Справочное руководство .NET API
 Закрыть
 Пространство имен HostMgd.Publishing Структуры
 Пространство имен HostMgd.Publishing Условные обозначения
 Структуры
 Имя
 Описание
 OptionsDialogResult
 Структура возвращаемого результата метода ShowDwfOptionsDialog класса Publisher