Справочное руководство .NET API
 Закрыть
 HostMgd.Windows Пространства имен
 HostMgd.Windows
 Пространства имен
 Имя
 Описание
 ToolPalette
 Пространство имен HostMgd.Windows.ToolPalette включает классы, перечисления и делегаты, предназначенные для создания в пользовательском интерфейсе разнообразных панелей инструментов.