Справочное руководство .NET API
 Закрыть
 Teigha.DatabaseServices Пространства имен
 Teigha.DatabaseServices
 Пространства имен
 Имя
 Описание
 Filters
 Пространство имен Teigha.DatabaseServices.Filters включает классы, предназначенные для создания программных фильтров.