Справочное руководство .NET API
 Закрыть
 HostMgd.Windows.ToolPalette Перечисления
 HostMgd.Windows.ToolPalette Условные обозначения
 Перечисления
 Имя
 Описание
 ContextMenuMode
 This is record HostMgd::Windows::ToolPalette::ContextMenuMode.
 ExecutionContext
 This is record HostMgd::Windows::ToolPalette::ExecutionContext.
 ReturnStatus
 This is record HostMgd::Windows::ToolPalette::ReturnStatus.
 TPOperationFlag
 This is record HostMgd::Windows::ToolPalette::TPOperationFlag.
 ToolEditFlags
 This is record HostMgd::Windows::ToolPalette::ToolEditFlags.