Справочное руководство .NET API
 Закрыть
 Пространство имен HostMgd.ApplicationServices Структуры
 Пространство имен HostMgd.ApplicationServices Условные обозначения
 Структуры
 Имя
 Описание
 WhoHasInfo
 POINTL
 Description