Справочное руководство .NET API
 Закрыть
 Пространство имен HostMgd Пространства имен
 Пространство имен HostMgd
 Пространства имен
 Имя
 Описание
 ApplicationServices
 Пространство имен, в котором расположены классы, предназначенные для работы с приложением nanoCAD через API.
 EditorInput
 Пространство имён предоставляет классы и события для обработки пользовательского ввода в nanoCAD, такие как выбор объектов, ввод точек, углов, чисел и текста.
 GraphicsSystem
 Пространство имен HostMgd.GraphicsSystem включает классы, перечисления и делегаты, предназначенные для работы с объектами графической системы nanoCAD.
 PlottingServices
 Пространство имен HostMgd.PlottingServices включает классы, структуры и перечисления, предназначенные для работы с объектами службы печати nanoCAD.
 Publishing
 This is namespace HostMgd::Publishing.
 Runtime
 This is namespace HostMgd::Runtime.
 Windows
 Пространство имен HostMgd.Windows включает классы, делегаты и перечисления, предназначенные для создания пользовательского оконного интерфейса (окна, диалоги, панели инструментов, меню и т.п.).