Справочное руководство .NET API
 Закрыть
 Пространство имен HostMgd.Runtime Перечисления
 Пространство имен HostMgd.Runtime Условные обозначения
 Перечисления
 Имя
 Описание
 AngularUnitFormat
 CommandFlags
 This is record HostMgd::Runtime::CommandFlags.
 DistanceUnitFormat
 LispDataType
 Значения типов