Справочное руководство .NET API
 Закрыть
 Пространство имен HostMgd.Publishing Делегаты
 Пространство имен HostMgd.Publishing
 Делегаты
 Имя
 Описание
 AboutToBeginBackgroundPublishingEventHandler
 This is type HostMgd::Publishing::AboutToBeginBackgroundPublishingEventHandler.
 AboutToBeginPublishingEventHandler
 This is type HostMgd::Publishing::AboutToBeginPublishingEventHandler.
 AboutToEndPublishingEventHandler
 This is type HostMgd::Publishing::AboutToEndPublishingEventHandler.
 AboutToMoveFileEventHandler
 This is type HostMgd::Publishing::AboutToMoveFileEventHandler.
 BeginAggregationEventHandler
 This is type HostMgd::Publishing::BeginAggregationEventHandler.
 BeginEntityEventHandler
 This is type HostMgd::Publishing::BeginEntityEventHandler.
 BeginPublishingSheetEventHandler
 This is type HostMgd::Publishing::BeginPublishingSheetEventHandler.
 BeginSheetEventHandler
 This is type HostMgd::Publishing::BeginSheetEventHandler.
 CancelledOrFailedPublishingEventHandler
 This is type HostMgd::Publishing::CancelledOrFailedPublishingEventHandler.
 EndEntityEventHandler
 This is type HostMgd::Publishing::EndEntityEventHandler.
 EndPublishEventHandler
 This is type HostMgd::Publishing::EndPublishEventHandler.
 EndSheetEventHandler
 This is type HostMgd::Publishing::EndSheetEventHandler.
 InitPublishOptionsDialogEventHandler
 This is type HostMgd::Publishing::InitPublishOptionsDialogEventHandler.