Справочное руководство .NET API
 Закрыть
 Пространство имен HostMgd.ApplicationServices Перечисления
 Пространство имен HostMgd.ApplicationServices Условные обозначения
 Перечисления
 Имя
 Описание
 DocumentLockMode
 Данное перечисление определяет поддерживаемые уровни блокировки документа.
 DocumentSaveFormat
 Save formats possible for documents.