Справочное руководство .NET API
 Закрыть
 Teigha.DatabaseServices Классы
 Teigha.DatabaseServices Условные обозначения
 Классы
 Имя
 Описание
 AbstractViewPE
 Класс AbstractViewPE определяет интерфейс классов расширения протокола для объектов View, ViewTableRecord, Viewport и ViewportTableRecord.
 AbstractViewTable
 Класс AbstractViewTable является базовым классом для двух классов таблиц символов - ViewTable и ViewportTable.
 AbstractViewTableRecord
 Класс AbstractViewTableRecord является базовым классом для классов ViewTableRecord и ViewportTableRecord.
 AbstractViewportData
 Класс AbstractViewportData является базовым классом классов расширения протокола для объектов Viewport и ViewportTableRecord.
 AlignedDimension
 Класс AlignedDimension представляет тип размера, определяющего расстояние между двумя произвольными точками в пространстве.
 AnnotationScale
 Данный класс представляет один единственный масштаб аннотаций, определенный в чертеже как контекст объекта.
 Arc
 Класс Arc представляет в nanoCAD геометрический объект "дуга".
 ArcDimension
 Данный класс представляет размер длины дуги.
 Assoc2dConstraintGroup
 Класс Assoc2dConstraintGroup представляет совокупность геометрических и размерных зависимостей между подобъектами геометрических объектов. Все связанные элементы геометрии должны лежать в одной плоскости.
 AssocAction
 Класс AssocAction представляет ассоциативные действия, позволяющие реализовать ассоциативное поведение объектов.
 AssocArray
 Класс AssocArray представляет массив ассоциативных действий, вычисление которых позволяет управлять элементами ассоциативного массива или их расположением.
 AssocArrayCommonParameters
 Класс AssocArrayCommonParameters предоставляет интерфейс для управления параметрами ассоциативного массива, которые являются общими для параметров прямоугольного и кругового массива, а также массива по траектории.
 AssocArrayParameters
 Класс предоставляет интерфейс для управления параметрами ассоциативного массива.
 AssocArrayPathParameters
 Класс предоставляет интерфейс для управления параметрами ассоциативного массива по траекториии.
 AssocArrayPolarParameters
 Класс предоставляет интерфейс для управления параметрами кругового массива.
 AssocArrayRectangularParameters
 Класс предоставляет интерфейс для управления параметрами прямоугольного ассоциативного массива.
 AssocDependency
 Класс AssocDependency является базовым классом для реализации ассоциативных зависимостей.
 AssocEvaluationCallback
 Класс предоставляет ассоциативным действиям механизмы реализации уведомлений о ходе обновления ассоциативных связей, сообщений о результатах вычислений, уведомлений о задействованных и измененных объектах, механизмы, позволяющие клиенту прервать и отменить обновление, и т.д.
 AssocManager
 Этот класс представляет менеджер ассоциативных связей, который глобально управляет структурой ассоциативных связей.
 AssocNetwork
 Класс AssocNetwork представляет сеть ассоциативных действий AssocAction. Не реализован.
 AttributeCollection
 Коллекция, которая служит контейнером для атрибутов вхождения блока.
 AttributeDefinition
 Класс AttributeDefinition представляет определения атрибутов (ATTDEF) в экземпляре базы данных.
 AttributeReference
 Класс AttributeReference представляет объекты атрибутов в базе данных.
 AuditInfo
 Класс предназначен для отслеживания общей информации, получаемой в ходе выполнения аудита базы данных.
 Background
 Класс Background является базовым классом для всех объектов, представляющих фон видового экрана.
 BeginInsertEventArgs
 Класс представляет данные для события BeginInsert базы данных.
 BeginWblockBlockEventArgs
 Класс представляет данные для события BeginWblockBlock базы данных.
 BeginWblockEntireDatabaseEventArgs
 Класс представляет данные для события BeginWblockEntireDatabase базы данных.
 BeginWblockObjectsEventArgs
 Класс представляет данные для события BeginWblockObjects базы данных.
 BeginWblockSelectedObjectsEventArgs
 Класс представляет данные для события BeginWblockSelectedObjects базы данных.
 BlockBegin
 Класс представляет объекты BlockBegin в базе данных.
 BlockEnd
 Класс представляет объекты BlockEnd в базе данных.
 BlockInsertionPointsEventArgs
 Класс представляет данные для события BlockInsertionPoints в записи таблицы блоков.
 BlockReference
 Класс предназначен для создания вставки блока в чертеже.
 BlockTable
 Класс предназначен для хранения определений блоков в базе данных чертежа.
 BlockTableRecord
 Класс предназначен для хранения определения блока.
 BlockTableRecordEnumerator
 Этот класс реализует перечислитель для объекта BlockTableRecord.
 Body
 Класс представляет объекты трехмерных тел в экземпляре базы данных.
 BulgeVertex
 Класс представляет безразмерную величину прогиба сегмента полилинии, берущего начало в двумерной вершине.
 BulgeVertexCollection
 Класс представляет коллекцию объектов BulgeVertex.
 Cell
 Данный класс представляет ячейки таблицы.
 CellBorder
 Класс CellBorder представляет границу ячейки таблицы.
 CellBorders
 Класс представляет границы ячеек таблицы.
 CellContent
 Класс CellContent представляет содержимое ячейки таблицы.
 CellContentsCollection
 Класс CellContentsCollection представляет коллекцию объектов содержимого ячейки таблицы.
 CellRange
 Этот класс представляет диапазоны ячеек таблицы.
 CellReference
 Структура CellReference представляет текущую ячейку таблицы.
 Circle
 Класс Circle представляет геометрический объект «окружность» в nanoCAD.
 Column
 Класс Column представляет столбец диапазона ячеек.
 ColumnsCollection
 Класс ColumnsCollection представляет коллекцию столбцов таблицы.
 CompoundObjectId
 Этот класс позволяет идентифицировать объект в базе данных, когда на объект ссылается вхождение блока BlockReference.
 Curve
 Класс Curve является базовым классом для всех классов сущностей, представляющих различные виды геометрических кривых (дуга, окружность, эллипс, сплайн и др.). Обеспечивает общую для кривых функциональность.
 CustomScale
 Этот класс предназначен для хранения значений числителя и знаменателя, используемых для формирования пользовательского масштаба печати.
 DBDictionary
 DBDictionary — это объектный словарь, хранящийся в базе данных и поддерживающий соответствие (мэппинг) текстовых строк и объектов базы данных.
 DBDictionaryEntry
 Этот класс представляет запись в словаре DatabaseServices.DBDictionary, в которой содержатся ключ и идентификатор ObjectId объекта чертежа в базе данных.
 DBObject
 Этот класс является базовым классом для всех объектов, содержащихся в базе данных dwg-файла (Database).
 DBObjectCollection
 Класс представляет интерфейс к коллекции объектов DBObject.
 DBObjectReference
 Структура DBObjectReference содержит идентификатор объекта и групповой код DXF, представляющий тип объекта.
 DBObjectReferenceCollection
 Класс DBObjectReferenceCollection представляет коллекцию объектов DBObjectReference.
 DBPoint
 Класс представляет геометрический объект "точка", который хранит своё положение в пространстве, вектор нормали для определения направления вытеснения и плоскости отображения, а также толщину — длину вытеснения вдоль нормали. Этот класс поддерживает различные режимы отображения точки в зависимости от системной переменной PDMODE.
 DBText
 Класс является представлением геометрического объекта TEXT в nanoCAD
 DBVisualStyle
 Данный класс описывает визуальный стиль как объект базы данных.
 DataCell
 Класс DataCell реализует единообразный подход к представлению следующих типов данных: Boolean, integer, double, char*, Point3d, ObjectId, HardOwnershipId, SoftOwnershipId, HardPointerId и SoftPointerId.
 DataCellCollection
 Класс представляет коллекцию объектов типа DataCell.
 DataColumn
 Класс DataColumn представляет один столбец таблицы данных DataTable.
 DataLink
 Класс реализует связывание данных таблицы на чертеже с внешним источником данных.
 DataLinkManager
 Класс предназначен для управления внешними ссылками в базе данных.
 DataTable
 Класс DataTable предоставляет универсальный инструмент для хранения в виде двумерной таблицы числовых и текстовых данных, 3D-точек и идентификаторов объектов.
 DataTypeParameter
 Структура DataTypeParameter представляет параметр типа данных.
 Database
 Класс Database представляет файл чертежа nanoCAD.
 DatabaseIOEventArgs
 Класс представляет данные для событий базы данных, связанных с операциями ввода-вывода (BeginSave, DwgFileOpened и SaveComplete).
 DatabaseSummaryInfo
 Класс DatabaseSummaryInfo предназначен для инкапсуляции набора текстовых строк, которые можно использовать для добавления в файл DWG дополнительной информации.
 DatabaseSummaryInfoBuilder
 Класс DatabaseSummaryInfoBuilder предназначен для создания объекта DatabaseSummaryInfo, в котором хранится набор строк с дополнительной информацией о файле .dwg.
 DbDictionaryEnumerator
 Класс DbDictionaryEnumerator представляет перечислитель для коллекции объектов DBDictionaryEntry.
 DbHomeView
 Этот класс представляет исходный вид в системе управления ориентацией модели.
 DecomposeForSaveReplacementRecord
 Структура DecomposeForSaveReplacementRecord инкапсулирует три выходных параметра, используемых методом Object.DecomposeForSave().
 DgnDefinition
 Этот класс представляет определения подложек DGN.
 DgnReference
 Этот класс представляет в чертеже ссылки подложек DGN.
 DgnUnderlayItem
 Этот класс представляет элементы подложки DGN.
 DiametricDimension
 Класс представляет объект диаметрального размера.
 DictionaryWithDefaultDictionary
 Данный класс представляет словарь, обладающий записью по умолчанию.
 DimAssoc
 Класс DimAssoc используется для создания ассоциативных размеров, которые обеспечивают ассоциативную связь объекта размера с соответствующей геометрией чертежа.
 DimStyleTable
 Класс предназначен для хранения определений размерных стилей в базе данных чертежа.
 DimStyleTableRecord
Класс предназначен для хранения определения размерного стиля.
 Dimension
 Этот класс является базовым для всех классов, представляющих размеры на чертеже в экземпляре Database.
 DrawOrderTable
 Класс DrawOrderTable предназначен для управления порядком отрисовки объектов, принадлежащих записи таблицы блоков.
 DwfDefinition
 Этот класс представляет определения подложек DWF на чертеже.
 DwfReference
 Этот класс представляет ссылки на подложки DWF на чертеже.
 DwgFiler
 Этот класс является абстрактным базовым классом для классов, которые используются для файловых операций ввода-вывода в формате DWG.
 DxfFiler
 Этот класс является абстрактным базовым классом для классов, которые используются для файловых операций ввода-вывода в формате DXF.
 DynamicBlockReferenceProperty
 Класс DynamicBlockReferenceProperty является служебным классом, который обеспечивает доступ к свойствам вхождений динамических блоков.
 DynamicBlockReferencePropertyCollection
 Класс представляет коллекцию свойств вхождений динамических блоков DynamicBlockReferenceProperty.
 DynamicBlockReferencePropertyCollectionEnumerator
 Этот класс реализует перечислитель в коллекции свойств динамического блока DynamicBlockReferencePropertyCollection.
 DynamicDimensionChangedEventArgs
 Этот класс предоставляет данные для функции OnDimensionValueChanged класса Jig.
 DynamicDimensionData
 Класс DynamicDimensionData поддерживает динамические размеры для производных от Entity объектов.
 DynamicDimensionDataCollection
 Класс DynamicDimensionDataCollection представляет коллекцию объектов DynamicDimensionData.
 EdgeRef
 Класс EdgeRef представляет ссылку на ребро.
 Ellipse
 Класс Ellipse реализует в базе данных объекты эллипса и эллиптической дуги.
 Entity
 Это базовый класс для всех объектов базы данных, имеющих графическое представление.
 Extents2d
 Этот класс представляет двумерные ограничивающие боксы для различных графических объектов.
 Extents3d
 Класс Extents3d представляет трехмерный ограничивающий прямоугольный параллелепипед (бокс) минимального размера, в который вписан тот или иной геометрический объект.
 ExtrudedSurface
 Этот класс реализует трехмерную поверхность, полученную в процессе экструзии.
 Face
 Класс Face реализует трехмерную грань как объект в базе данных и наследует базовую функциональность объектов чертежа Entity.
 FaceRecord
 Класс FaceRecord представляет в базе данных грани многогранной сети PolyFaceMesh.
 FaceRef
 Класс FaceRef представляет ссылку на грань.
 FeatureControlFrame
 Класс FeatureControlFrame представляет в базе данных рамки символов допусков формы и расположения.
 Field
 Класс Field представляет объекты Field в базе данных. Объект Field является контейнером для вычисляемого выражения, вычисленного результата и других данных.
 FieldCodeWithChildren
 Этот класс хранит код поля и его внедренные или вложенные (дочерние) поля.
 FieldEngine
 Класс FieldEngine управляет вычислением полей.
 FieldEvaluationResult
 Данный класс представляет результат вычисления поля.
 FieldEvaluationStatusResult
 Этот класс предназначен для хранения кодов, представляющих результаты вычисления поля.
 FieldEvaluator
 Класс FieldEvaluator является абстрактным базовым классом, определяющим интерфейс вычислителя поля.
 FieldEvaluatorLoader
 Класс FieldEvaluatorLoader предназначен для загрузки вычислителей, которые необходимы для вычисления полей.
 FieldResult
 Класс FieldResult представляет статус и результата вычисления поля.
 FieldUpdateResult
 Структура FieldUpdateResult представляет результаты вычисления полей.
 FileDependencyInfo
 Класс FileDependencyInfo представляет записи в разделе .dwg списка зависимостей файлов.
 FileDependencyManager
 Класс FileDependencyManager предназначен для управления записями в разделе .dwg списка файловых зависимостей.
 FitData
 Этот класс инкапсулирует данные, возвращаемые свойством Spline.FitData.
 FormattedTableData
 Класс реализует форматирование ячеек, строк и столбцов, чтобы обеспечить желаемое отображение таблицы.
 FullDwgVersion
 Этот класс представляет основные и второстепенные версии DWG.
 FullSubentityPath
 Этот класс реализует однозначную идентификацию подобъектов в базе данных.
 GeoLocationData
 Этот класс хранит данные географического местоположения, включая DesignPoint, UpDirection, NorthDirection в пространстве чертежа, а также широту, долготу и высоту в географическом пространстве.
 GeomRef
 Класс GeomRef является базовым для конкретных производных классов, таких как EdgeRef, FaceRef и VertexRef. Эти простые классы, которые хранят ссылку на подобъект объекта чертежа и используются главным образом не для хранения, а для передачи информации о геометрии подобъекта.
 GeometryOverrule
 Абстрактный класс Teigha.DatabaseServices.GeometryOverrule определяет связанные с геометрией методы объектных переопределений.
 GradientBackground
 Класс представляет градиентный фон.
 GradientColor
 Этот класс является контейнером для градиентных цветов, используемых объектом Hatch.
 Graph
 Класс Graph реализует базовый объект ориентированного графа и предоставляет базовый механизм для выявления циклов.
 GraphNode
 Класс GraphNode реализует базовый объект узла ориентированного графа.
 GraphNodeCollection
 Этот класс представляет коллекцию узлов графа.
 GridPropertyParameter
 Эта структура представляет свойства линий сетки для объектов Table.
 GripData
 Класс представляет данные ручек для объектов чертежа.
 GripDataCollection
 Класс GripDataCollection представляет коллекцию объектов GripData.
 GripOverrule
 Данный класс предоставляет методы переопределения ручек объекта.
 GroundPlaneBackground
 Этот класс реализует объект фона в нулевой плоскости в видовом экране.
 Group
 Этот класс представляет объекты группы в экземпляре базы данных.
 Handle
 Класс Handle предназначен для инкапсуляции 64-битных целочисленных идентификаторов дескрипторов, которые использовались в ряде ранних релизов.
 Hatch
 Класс представляет объект "штриховка" или "заливка" на чертеже.
 HatchLoop
 Этот класс представляет данные для определения контура границы штриховки.
 Helix
 Класс Helix представляет спирали в экземпляре базы данных.
 HighlightOverrule
 Этот класс переопределяет подмножество операций подсвечивания, определенных для объекта чертежа. Он является базовым классом для настройки поведения классов, производных от класса Entity. Каждая реализация по умолчанию вызывает соответствующий метод целевого класса.
 HostApplicationServices
 Класс HostApplicationServices предоставляет хост-приложениям различные сервисы времени выполнения. Сами сервисы определяются в приложении-клиенте.
 HyperLink
 Класс HyperLink служит базовым классом для объектов гиперссылок.
 HyperLinkCollection
 Класс HyperlinkCollection представляет собой коллекцию объектов Hyperlink.
 IdMapping
 Класс IdMapping используется в операциях глубокого клонирования для сопоставления (мэппинга) идентификаторов исходных объектов и идентификаторов их клонов. Пары идентификаторов (ID исходного объекта - ID его клона) реализуются объектами IdPair.
 IdMappingEventArgs
 Этот класс представляет данные для событий, связанных с сопоставлением (мэппингом) идентификаторов (BeginDeepClone, BeginDeepCloneTranslation, InsertMappingAvailable и WblockMappingAvailable) в базе данных.
 Image
 Данный класс является базовым классом для растровых объектов, включая RasterImage.
 ImageBackground
 Этот класс представляет в базе данных объекты фона, основанные на изображениях.
 ItemLocator
 Класс ItemLocator представляет индекс {i, j, k} элемента в прямоугольном массиве.
 LayerStateEventArgs
 Класс LayerStateEventArgs представляет данные для события LayerState.
 LayerStateManager
 Класс LayerStateManager используется для доступа и управления состояниями индивидуального слоя, связанными с базой данных чертежа.
 LayerStateRenameEventArgs
 Класс LayerStateRenameEventArgs представляет данные для события LayerStateRename базы данных.
 LayerTable
Класс предназначен для хранения определений слоёв в базе данных чертежа.
 LayerTableRecord
 Класс предназначен для хранения определений слоёв в базе данных чертежа.
 LayerViewportProperties
 Этот класс определяет свойства видовых экранов слоев, которые используются в LayerTableRecord.
 Layout
 Объект Layout хранит характеристики каждого листа. Объекты Layout хранятся в объекте Dictionary с ключом ACAD_LAYOUT, что облегчает их перебор и индексирование.
 LayoutCopiedEventArgs
 Этот класс представляет данные для события LayoutCopied в диспетчере листов.
 LayoutEventArgs
 Этот класс представляет данные для связанных с листом событий в менеджере листов.
 LayoutManager
 Этот интерфейсный класс обслуживает специфичные для базы данных процедуры, которые управляют объектами листа и предоставляют к ним доступ.
 LayoutPaperPE
 Класс LayoutPaperPE является классом расширения протокола для объектов Layout, позволяющий настраивать фон чертежа во время векторизации пространства PaperSpace.
 LayoutRenamedEventArgs
 Этот класс представляет данные для событий переименования листа в диспетчере листов.
 Leader
 Класс Leader представляет типовой геометрический объект "выноска".
 Light
 Этот класс представляет шаблон для всех общих свойств источников света, хранящихся в базе данных.
 Line
 Этот класс представляет геометрический объект "линия" nanoCAD.
 LineAngularDimension2
 Класс LineAngularDimension2 представляет угловой размер между двумя линиями.
 LineWeightConverter
 Класс предназначен для преобразования весов (толщин) линий.
 LinetypeTable
 Класс представляет таблицу символов для записей LinetypeTableRecord.
 LinetypeTableRecord
 Объекты этого класса представляют записи в LinetypeTable.
 LinkedData
 Класс представляет в базе данных объекты LinkedData и обеспечивает связывание данных.
 LinkedTableData
 Класс LinkedTableData реализует связывание с данными из внешних таблиц Excel.
 LinkedTableEnumerator
 This is class Teigha::DatabaseServices::LinkedTableEnumerator.
 LoftOptions
 Класс представляет параметры лофта - операции вытягивания поверхности по сечениям, используемые для создания как поверхностных, так и твердых тел. Параметры лофта используются для управления геометрией получаемой поверхности.
 LoftOptionsBuilder
 Этот вспомогательный класс используется для формирования настроек для операции вытягивания поверхности по сечениям (лофт).
 LoftOptionsCheckCurvesOut
 Этот класс представляет группу флагов, которые отражают состояние кривых поперечных сечений при их использовании в операциях вытягивания поверхностей по сечениям (лофт).
 LoftedSurface
 Этот класс реализует трехмерный объект, поверхность которого получена при помощи лофта - вытягивания поверхности по сечениям.
 MInsertBlock
 Класс MInsertBlock представляет в базе данных массивы вхождений блоков (MInserts).
 MLeader
 Класс MLeader представляет объект мультивыноски.
 MLeaderStyle
 Данный класс представляет объекты MLeaderStyle в базе данных.
 MText
 Данный класс представляет объекты типа MText в базе данных nanoCAD.
 MTextFragment
 Этот класс описывает фрагмент текста, создаваемый методом MText.ExplodeFragments().
 MatchProperties
 Этот класс является базовым для классов, реализующих копирование свойств между объектами чертежа.
 Material
 Класс Material представляет свойства материала, используемые при визуализации затененных объектов.
 MentalRayRenderSettings
 Класс MentalRayRenderSettings является классом-контейнером для свойств, связанных с рендерерами Mental Ray.
 MeshDataCollection
 Структура MeshDataCollection предназначена для хранения результатов метода Teigha.DatabaseServices.SubDMesh.GetObjectMesh().
 MeshFaceterData
 Структура MeshFaceterData предназначена для хранения данных, которые использует метод Teigha.DatabaseServices.SubDMesh.GetObjectMesh().
 MeshPointMap
 Структура MeshPointMap хранит данные, возвращаемые методом Teigha.DatabaseServices.GeoLocationData.GetMashPointMap().
 MeshPointMaps
 Структура MeshPointMaps хранит данные, возвращаемые методом Teigha.DatabaseServices.GeoLocationData.GetMeshPointMaps().
 Mline
 Класс Mline представляет в базе данных объекты мультилиний.
 MlineStyle
 Этот класс представляет в базе данных объекты стиля мультилинии.
 MlineStyleElement
 Эта структура инкапсулирует данные о цвете, смещении и типе линий, используемые объектами MlineStyle.
 MlineStyleElementCollection
 Класс представляет коллекцию объектов MlineStyleElement.
 MlineStyleElementCollectionEnumerator
 Данный класс представляет перечислитель для коллекции объектов MlineStyleElement.
 NurbSurface
 Класс NurbSurface представляет в базе данных поверхности, для математического описания которых используются неоднородные рациональные B-сплайны (NURBS).
 NurbsData
 Структура NurbsData заменяет любые имеющиеся данные сплайна данными, предоставленными через параметры этой структуры.
 ObjectClosedEventArgs
 Класс ObjectClosedEventArgs представляет данные для события ObjectClosed базы данных.
 ObjectContext
 Абстрактный базовый класс ObjectContext предназначен для представления контекста, который может влиять на свойства и поведение пользовательских объектов.
 ObjectContextCollection
 Класс ObjectContextCollection представляет интерфейс к определяемой приложением коллекции объектов ObjectContext.
 ObjectContextCollectionEnumerator
 Этот класс представляет перечислитель для коллекции объектов ObjectContext.
 ObjectContextManager
 Класс ObjectContextManager предназначен для управления коллекцией доступных в чертеже типов контекста.
 ObjectErasedEventArgs
 Данный класс представляет данные для события ObjectErased в базе данных.
 ObjectEventArgs
 Класс представляет данные для различных событий в базе данных, связанных с объектами.
 ObjectId
 ObjectId хранит единственный неизменный в пределах сеанса локатор для резидентного объекта базы данных.
 ObjectIdCollection
 Класс представляет коллекцию идентификаторов объектов ObjectId.
 ObjectIdGraph
 Этот класс реализует общие объекты графа.
 ObjectIterator
 This is class Teigha::DatabaseServices::ObjectIterator.
 ObjectOverrule
 Этот класс переопределяет подмножество операций для объекта базы данных. Он является базовым для классов, производных от OdDbObject, и используется для настройки их поведения.
 ObjectTypeAttribute
 Этот класс сообщает тип объекта.
 Ole2Frame
 Этот класс обеспечивает поддержку объектов OLE 2 в чертежах nanoCAD.
 OpenCloseTransaction
 Класс OpenCloseTransaction предназначен для использования в определенных сценариях вместо класса Transaction.
 OpenModeAttribute
 Класс представляет атрибут, который сообщает об режиме открытия объекта.
 OrdinateDimension
 This is class Teigha::DatabaseServices::OrdinateDimension.
 OsnapOverrule
 Этот класс переопределяет подмножество операций объектной привязки, которые специфичны для объекта чертежа.
 OsnapPointRef
 Класс OsnapPointRef позволяет использовать объектную привязку для получения данных о связанной с размером геометрии.
 PatternDefinition
 Класс PatternDefinition инкапсулирует данные определения штриховки, возвращаемые методом Hatch.GetPatternDefinitionAt().
 PdfDefinition
 Класс представляет функциональность определения подложки PDF.
 PdfReference
 Класс PdfReference реализует функционал для работы со ссылками на контент в формате PDF.
 PlaceHolder
 Данный класс предоставляет способ создания экземпляров заглушек для объектов DBObject. Класс не имеет собственных данных и не реализует никаких новых методов.
 PlaneSurface
 Данный класс реализует объект трехмерной плоской поверхности.
 PlotSettings
 Этот класс представляет настройки печати в экземпляре базы данных.
 PlotSettingsValidator
 Этот класс определяет методы, которые позволяют проверить данные для настроек печати в объекте PlotSettings до фактического переопределения этих настроек в объектах.
 PlotStyle
 Класс PlotStyle представляет стили печати.
 PlotStyleData
 Структура PlotStyleData представляет данные для стиля печати.
 PlotStyleDescriptor
 Данный класс инкапсулирует значение перечисления PlotStyleNameType и идентификатор объекта связанной записи в словаре имен стилей печати.
 PlotStyleTable
 Класс PlotStyleTable реализует таблицы стилей печати.
 PlotStyleTableChangedEventArgs
 Класс PlotStyleTableChangedEventArgs представляет данные для события PlotStyleTableChanged в диспетчере листов.
 Point3AngularDimension
 Класс Point3AngularDimension представляет в базе данных объекты углового размера по трем точкам.
 PolyFaceMesh
 Класс PolyFaceMesh представляет специальный тип полилинии PolyFaceMesh в nanoCAD.
 PolyFaceMeshVertex
 Класс PolyFaceMeshVertex представляет в базе данных вершины сети PolyFaceMesh.
 PolygonMesh
 Класс PolygonMesh представляет полигональную сеть в nanoCAD.
 PolygonMeshVertex
 Класс PolygonMeshVertex представляет в базе данных вершины сети PolygonMesh.
 Polyline
 Класс представляет объект "полилиния" на чертеже.
 Polyline2d
 Класс Polyline2d представляет объект 2D-полилинии в nanoCAD.
 Polyline3d
 Класс Polyline3d представляет 3D-полилинию в nanoCAD.
 PolylineVertex3d
 Класс PolylineVertex3d представляет вершины 3D полилинии в nanoCAD.
 PropertiesOverrule
 Этот класс переопределяет подмножество специфичных для объекта операций, связанных со свойствами. Он служит базовым классом для классов, производных от DBObject или DBEntity, и используется для настройки их поведения.
 ProxyEntity
 Класс ProxyEntity является базовым классом для прокси-объектов, производных от объектов чертежа в базе данных.
 ProxyObject
 Класс ProxyObject является базовым классом для прокси-объектов в базе данных.
 ProxyResurrectionCompletedEventArgs
 Класс ProxyResurrectionCompletedEventArgs предоставляет данные для события ProxyResurrectionCompleted базы данных.
 RadialDimension
 Класс RadialDimension представляет радиальный размер в базе данных.
 RadialDimensionLarge
 Класс RadialDimensionLarge представляет радиальный размер с изломом.
 RasterImage
 Класс представляет объект "изображение" на чертеже.
 RasterImageDef
 Класс является неграфической частью объекта "изображение" на чертеже.
 RasterVariables
 Класс RasterVariables представляет объекты RasterVariables в базе данных.
 Ray
 Класс Ray представляет объекты лучей в базе данных.
 Rectangle3d
 Структура Rectangle3d представляет четыре точки, которые определяют вершины 3D-прямоугольника.
 RegAppTable
 Этот класс реализует таблицу символов APPID, которая представляет зарегистрированные имена приложений для расширенных данных объекта чертежа в базе данных.
 RegAppTableRecord
 Экземпляры этого класса представляют записи в таблице RegAppTable (известной как таблица символов APPID в DXF). Каждая из этих записей представляет собой ID приложения, используемый для идентификации группы расширенных данных, прикрепленных к объектам в базе данных чертежа.
 Region
 Класс Region представляет объекты 2D-области (региона) в базе данных.
 RenderEnvironment
 Класс RenderEnvironment представляет собой класс-контейнер для свойств, связанных с окружающей средой, таких как туман или общее изображение окружающей среды.
 RenderGlobal
 Класс RenderGlobal служит контейнером для всех глобальных свойств рендеринга.
 RenderSettings
 Класс RenderSettings служит контейнером для свойств, общих для всех инструментов высококачественного рендеринга.
 ResultBuffer
 Этот класс реализует объект буфера результатов, который представляет собой структуру для хранения и передачи размеченных данных всех основных типов между разнообразными объектами с использованием различных технологий.
 ResultBufferEnumerator
 Класс ResultBufferEnumerator представляет перечислитель для класса ResultBuffer.
 RevolveOptions
 Вспомогательный класс RevolveOptions представляет настраиваемые опции операции создания тел и поверхностей вращения.
 RevolveOptionsBuilder
 Класс RevolveOptionsBuilder предназначен для редактирования свойств класса RevolveOptions, который является неизменяемым типом значения.
 RevolveOptionsCheckRevolveCurveOut
 Класс RevolveOptionsCheckRevolveCurveOut представляет индикаторы возможных проблем, выявляемых при проверке возможности вращения объекта.
 RevolvedSurface
 Класс RevolvedSurface представляет объект трехмерной поверхности вращения.
 RotatedDimension
 Класс RotatedDimension представляет тип размера между двумя точками в пространстве, которые располагаются на линии, ориентированной под определенным углом к горизонту в плоскости размера (угол поворота).
 Row
 Класс Row представляет строку ячеек таблицы.
 RowsCollection
 Класс RowsCollection представляет коллекцию строк таблицы.
 Section
 Класс Section представляет объект секущей плоскости.
 SectionHitTestInfo
 Эта структура служит контейнером для результатов проверки попадания в индикатор секущей плоскости, возвращаемых методом DatabaseServices.Section.HitTest().
 SectionManager
 Класс SectionManager используется для управления секущими плоскостями в базе данных.
 SectionSettings
 Класс SectionSettings представляет настройки геометрии секущей плоскости.
 SecurityParameters
 Класс SecurityParameters представляет параметры безопасности, используемые базой данных.
 SequenceEnd
 Класс SequenceEnd представляет объекты SequenceEnd в экземпляре базы данных Database.
 Shape
 Класс Shape представляет объекты Shape в базе данных nanoCAD.
 SkyBackground
 Класс SkyBackground представляет небо для объекта фона в видовом экране.
 Solid
 Класс Solid представляет в базе данных двумерный (плоский) твердотельный объект.
 Solid3d
 Класс Solid3d представляет в базе данных объекты трехмерных твердых тел.
 Solid3dMassProperties
 Структура Solid3dMassProperties представляет массо-центровочные свойства трехмерного твёрдого тела.
 SolidBackground
 Класс SolidBackground представляет сплошной фон.
 Spline
 Класс Spline представляет объекты Spline в базе данных.
 SubDMesh
 Этот класс представляет объекты SubDMesh в базе данных.
 SubentRef
 Класс SubentRef представляет ссылку на подобъект.
 SubentityId
 Структура SubentityId представляет в базе данных идентификаторы подобъектов для графических объектов чертежа.
 SubentityOverrule
 Этот класс переопределяет подмножество связанных с подобъектом операций, которые определяет объект. Используется в качестве базового класса для настройки поведения классов, производных от Entity.
 Sun
 Класс Sun представляет свойства, связанные с объектом солнца.
 Surface
 Класс Surface представляет в базе данных объект 3D-поверхности.
 SurfaceSliceResults
 Структура SurfaceSliceResults представляет данные, которые используются в методах Surface.SliceByPlane() и Surface.SliceBySurface().
 SweepOptions
 Класс SweepOptions предназначен для управления параметрами, которые используются при создании поверхностей и твердых тел вытягиванием по траектории такими методами как SweptSurface.CreateSweptSurface() или Solid3d.CreateSweptSolid().
 SweepOptionsBuilder
 Класс SweepOptionsBuilder предназначен для настройки параметров, используемых методами SweptSurface.CreateSweptSurface() и Solid3d.CreateSweptSolid().
 SweepOptionsCheckSweepCurveOut
 Класс SweepOptionsCheckSweepCurveOut представляет опции проверки вытянутых кривых.
 SweptSurface
 Класс SweptSurface представляет в базе данных поверхности, полученные вытягиванием по траектории.
 SymbolTable
 Класс является базовым для всех таблиц базы данных чертежа.
 SymbolTableEnumerator
 Класс SymbolTableEnumerator представляет перечислитель для таблицы символов.
 SymbolTableRecord
 Базовый класс для классов записей таблиц базы данных чертежа.
 SymbolUtilityServices
 Класс SymbolUtilityServices предоставляет различные утилиты для работы с именами символов, записями символов и таблицами символов.
 SystemVariableChangedEventArgs
 Класс SystemVariableChangedEventArgs представляет свойства, связанные с событиями системных переменных (после изменения системных переменных).
 SystemVariableChangingEventArgs
 Класс SystemVariableChangingEventArgs представляет свойства, связанные с событиями системных переменных (в процессе изменения системных переменных).
 Table
 Таблица является планарным объектом, который может быть размещен в произвольной плоскости трехмерного пространства. Как правило, таблица представляет собой прямоугольный массив ячеек размером n x m, содержимое которого состоит из аннотативных объектов, чаще всего текстовых. Таблицы обычно включают строку наименования таблицы, строку с заголовками столбцов и некоторое количество строк данных.
 TableContent
 Класс TableContent представляет в базе данных содержимое таблицы.
 TableEnumerator
 Класс TableEnumerator представляет перечислитель для таблицы.
 TableHitTestInfo
 Класс TableHitTestInfo представляет данные, получаемые от метода Table.HitTest().
 TableRegion
 This is class Teigha::DatabaseServices::TableRegion.
 TableStyle
 Класс TableStyle представляет в базе данных табличные стили.
 TableTemplate
 Класс TableTemplate предназначен для хранения и управления шаблонами таблиц.
 TextStyleTable
 Класс представляет таблицу текстовых стилей в базе данных чертежа.
 TextStyleTableRecord
 Класс представляет записи таблицы текстовых стилей TextStyleTable.
 Trace
 Класс Trace представляет в базе данных объект замкнутой двумерной полосы со сплошной заливкой.
 Transaction
 Класс реализует поддержку транзакций. Транзакции помогают расширить спектр связанных с объектом операций и избежать нежелательных конфликтных ситуаций. Кроме того, они повышают производительность, позволяя отложить операции закрытия всех открытых объектов до момента завершения транзакции.
 TransactionManager
 Данный класс представляет системный менеджер транзакций.
 TransformOverrule
 Этот класс переопределяет подмножество операций, связанных с 3D-преобразованиями объекта. Используется в качестве базового для настройки поведения наследников класса Entity.
 TypedValue
 Класс TypedValue реализует тип значения для хранения объектов различных типов. Конкретный тип хранимого значения определяется свойством TypeCode.
 UcsTable
 Класс UcsTable реализует таблицу, которая служит контейнером для хранения в базе данных чертежа пользовательских систем координат (UCS).
 UcsTableRecord
 Класс UcsTableRecord представляет записи в таблице UcsTable, каждая из которых связана с конкретной пользовательской системой координат, сохраненной в базе данных чертежа.
 UnderlayDefinition
 Класс UnderlayDefinition является абстрактным классом, который обеспечивает связь с внешним содержимым подложки.
 UnderlayFile
 Класс UnderlayFile реализуется хост-приложениями, которым требуется поддержка подложек.
 UnderlayHost
 Класс UnderlayHost реализуется хост-приложениями для поддержки подложек.
 UnderlayItem
 Класс UnderlayItem реализуется хост-приложениями, которым требуется поддержка подложек.
 UnderlayItemCollection
 Класс UnderlayItemCollection представляет коллекцию для объектов UnderlayItem.
 UnderlayLayer
 Класс UnderlayLayer представляет слои подложки на чертеже.
 UnderlayLayerCollection
 Класс UnderlayLayerCollection представляет коллекцию слоев подложки.
 UnderlayReference
 Класс UnderlayReference представляет подложки на чертеже.
 UnitsConverter
 Класс UnitsConverter реализует конвертер единиц измерения.
 Vertex
 Класс Vertex является базовым для всех вершин в базе данных.
 Vertex2d
 Класс Vertex2d представляет в базе данных вершины двумерной полилинии.
 VertexRef
 Класс VertexRef представляет ссылку на вершину объекта чертежа.
 ViewTable
 Класс предназначен для хранения определений именованных видов в базе данных чертежа.
 ViewTableRecord
 Класс предназначен для хранения определения именованного вида.
 Viewport
 Класс Viewport представляет в базе данных объекты видового экрана пространства листа PaperSpace.
 ViewportTable
 Класс предназначен для хранения определений видовых экранов пространства модели в базе данных чертежа.
 ViewportTableRecord
 Класс предназначен для хранения определения видового экрана в таблице видовых экранов пространства модели ViewportTable.
 WblockNoticeEventArgs
 Класс WblockNoticeEventArgs представляет данные для события WblockNotice базы данных.
 Wipeout
 Класс Wipeout представляет в базе данных растровые объекты с полигональной границей, которые используются в качестве масок (маскирующих объектов), чтобы перекрывать элементы других объектов на чертеже.
 Xline
 Класс Xline представляет в nanoCAD тип объекта XLINE. Объект Xline — это линия, бесконечная в обоих направлениях.
 Xrecord
 Класс Xrecord — это класс для хранения и управления произвольными данными.
 XrefBeginOperationEventArgs
 Класс XrefBeginOperationEventArgs представляет данные для событий базы данных XrefBeginRestore, XrefBeginAttached и XrefBeginOtherAttached.
 XrefComandeeredEventArgs
 Класс XrefComandeeredEventArgs представляет данные для события XrefComandeered в базе данных.
 XrefFullSubentityPath
 Класс XrefFullSubentityPath уникальным образом определяет в базе данных подобъекты внешних ссылок.
 XrefGraph
 Класс XrefGraph представляет дерево внешних ссылок базы данных.
 XrefGraphNode
 Класс XrefGraphNode представляет в базе данных узлы графа внешних ссылок.
 XrefPreXrefLockFileEventArgs
 Класс XrefPreXrefLockFileEventArgs представляет данные для события XrefPreXrefLockFile в базе данных.
 XrefRedirectedEventArgs
 Класс XrefRedirectedEventArgs представляет данные для события XrefRedirected базы данных.
 XrefSubCommandEventArgs
 Класс XrefSubCommandEventArgs представляет данные для событий базы данных, связанных с подкомандами внешних ссылок (XrefSubCommandStart, XrefSubCommandEnd и XrefSubCommandAborted).
 XrefVetoableSubCommandEventArgs
 Класс XrefVetoableSubCommandEventArgs представляет данные для команды XrefVetoableSubCommand базы данных.