Справочное руководство .NET API
 Закрыть
 Пространство имен HostMgd.Runtime Классы
 Пространство имен HostMgd.Runtime Условные обозначения
 Классы
 Имя
 Описание
 CommandClassAttribute
 This is class HostMgd::Runtime::CommandClassAttribute.
 Converter
 FileExistsConditionAttribute
 This is class HostMgd::Runtime::FileExistsConditionAttribute.