Справочное руководство .NET API
 Закрыть
 Пространство имен HostMgd.ApplicationServices Интерфейсы
 Пространство имен HostMgd.ApplicationServices Условные обозначения
 Интерфейсы
 Имя
 Описание
 IConfigurationSection