Справочное руководство .NET API
 Закрыть
 Пространство имен HostMgd.Runtime Интерфейсы
 Пространство имен HostMgd.Runtime Условные обозначения
 Интерфейсы
 Имя
 Описание
 ICondition
 This is class HostMgd::Runtime::ICondition.