Справочное руководство .NET API
 Закрыть
 EPlotPropertyBag Свойства
 Класс HostMgd.Publishing.EPlotPropertyBag Условные обозначения
 EPlotPropertyBag Свойства
 Имя
 Описание
 Id
 This is Id, a member of class EPlotPropertyBag.
 NamespaceLocation
 This is NamespaceLocation, a member of class EPlotPropertyBag.
 NamespaceUrl
 This is NamespaceUrl, a member of class EPlotPropertyBag.
 Properties
 This is Properties, a member of class EPlotPropertyBag.
 References
 This is References, a member of class EPlotPropertyBag.