Справочное руководство .NET API
 Закрыть
 Пространство имен Teigha Пространства имен
 Пространство имен Teigha
 Пространства имен
 Имя
 Описание
 BoundaryRepresentation
 Пространство имен Teigha.BoundaryRepresentation включает определения, относящиеся к граничным представлениям.
 Colors
 Пространство имен Teigha.Colors включает классы и перечисления, которые обеспечивают объекты чертежа функционалом для манипуляций цветами и прозрачностью, а также для преобразования цветов между цветовыми пространствами.
 DatabaseServices
 Пространство имен Teigha.DatabaseServices включает пространства имен и классы, предназначенные для работы с объектами базы данных чертежа.
 DbConstraints
 This is namespace Teigha::DbConstraints.
 Editor
 Пространство имен Teigha.Editor содержит классы и методы, предназначенные для работы с интерфейсом пользователя и взаимодействия с системой команд в рамках платформы Teigha.
 Geometry
 Пространство имен Teigha.Geometry содержит классы и перечисления, предоставляющие функционал для работы с геометрическими объектами в среде nanoCAD.
 GraphicsInterface
 Пространство имен Teigha.GraphicsInterface.
 GraphicsSystem
 Пространство имен Teigha.GraphicsSystem включает определения, относящиеся к графической системе.
 LayerManager
 Пространство имен Teigha.LayerManager включает определения, относящиеся к слоям.
 Runtime
 Пространство имен Runtime содержит классы, связанные со средой и временем выполнения программы.