Справочное руководство .NET API
 Закрыть
 Пространство имен HostMgd.ApplicationServices Делегаты
 Пространство имен HostMgd.ApplicationServices
 Делегаты
 Имя
 Описание
 BeginDoubleClickEventHandler
 Делегат события двойного щелчка
 CheckingOutEventHandler
 Делегат CheckingOutEventHandler определяет тип, используемый для обработки события LongTransactionManager.CheckingOut.
 CommandEventHandler
 Делегат коммандных событий класса Document
 DocumentActivationChangedEventHandler
 Делегат события переключения (активации) документа Событие класса DocumentCollection
 DocumentBeginCloseEventHandler
 Делегат события в начале метода сохранения класса Document
 DocumentCollectionEventHandler
 Делегат событий класса DocumentCollection
 DocumentDestroyedEventHandler
 Делегат события уничтожения документа Событие класса DocumentCollection
 DocumentLockModeChangeVetoedEventHandler
 Делегат события класса DocumentCollection
 DocumentLockModeChangedEventHandler
 Делегат события класса DocumentCollection
 DocumentLockModeWillChangeEventHandler
 Делегат события класса DocumentCollection
 DrawingOpenEventHandler
 Делегат предназначен для обработки события Document.EndDwgOpen, возникающего непосредственно после открытия файла чертежа в nanoCAD.
 ExecuteInApplicationContextCallback
 Делегат ExecuteInApplicationContextCallback предназначен для обратного вызова void функции из контекста приложения.
 LispWillStartEventHandler
 Делегат предназначен для обработки события LispWillStart класса Document, возникающего перед началом исполнения кода интерпретатором AutoLISP.
 LongTransactionEventHandler
 Делегат предназначен для обработки событий, возникающих в процессе длительных транзакций.
 PreTranslateMessageEventHandler
 Делегат предназначен для обработки события Application.PreTranslateMessage, возникающего непосредственно перед переводом сообщения.
 ProfileEventHandler
 Делегат предназначен для обработки событий класса UserConfigurationManager, возникающих в процессах управления пользовательскими профилями.
 SystemVariableChangedEventHandler
 Делегат события завершения изменения переменной
 SystemVariableChangingEventHandler
 Делегат события начала изменения переменной
 TabbedDialogAction
 Делегат используется для определения действий в диалоговых окнах с вкладками.
 TabbedDialogEventHandler
 Делегат используется для обработки событий, возникающих в диалоговых окнах с вкладками.
 UnknownCommandEventHandler
 Делегат коммандных событий класса Document