Справочное руководство .NET API
 Закрыть
 NurbSurfaceDefinition Свойства
 Teigha.Geometry.NurbSurfaceDefinition Условные обозначения
 NurbSurfaceDefinition Свойства
 Имя
 Описание
 ControlPoints
 Свойство ControlPoints представляет массив управляющих вершин NURBS поверхности.
 DegreeInU
 Свойство DegreeInU представляет степень сплайна в направлении U.
 DegreeInV
 Свойство DegreeInV представляет степень сплайна в направлении V.
 NumberOfControlPointsInU
 Свойство NumberOfControlPointsInU представляет количество управляющих вершин в направлении U.
 NumberOfControlPointsInV
 Свойство NumberOfControlPointsInV представляет количество управляющих вершин в направлении V.
 PropertiesInU
 Свойство PropertiesInU представляет значение NurbSurfaceProperties как свойство поверхности в направлении U.
 PropertiesInV
 Свойство PropertiesInV представляет значение NurbSurfaceProperties как свойство поверхности в направлении V.
 UKnots
 Свойство UKnots представляет узловой вектор поверхности в направлении U.
 VKnots
 Свойство VKnots представляет узловой вектор поверхности в направлении V.
 Weights
 Свойство Weights представляет массив весов NURBS поверхности.