Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PaletteSet.Visible
 Послать отзыв
 Видимость окна
 Синтаксис
C#
Visual Basic
public bool Visible;
Public Property Visible() As bool
 Ссылки
 PaletteSet Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!