Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод PlotEngine.BeginDocument
 Послать отзыв
 Синтаксис
C#
Visual Basic
public void BeginDocument(ref HostMgd::PlottingServices::PlotInfo plotInfo, ref System.String documentName, ref System.Object parameters, int copies, bool plotToFile, ref System.String fileName);
Public Sub BeginDocument(ByRef plotInfo As HostMgd.PlottingServices.PlotInfo, ByRef documentName As System.String, ByRef parameters As System.Object, copies As Integer, plotToFile As bool, ByRef fileName As System.String)
 Ссылки
 PlotEngine Класс, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!