Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Перечисление HostMgd.EditorInput.DragCursor
 Послать отзыв
 Синтаксис
C#
Visual Basic
public enum DragCursor { Normal, None, Selection }
Public Enum DragCursor Normal None Selection End Enum
 Члены
 Члены
 Описание
 Normal
 Обычный вид куросра при перетаскивании
 None
 Не указан тип курсора
 Selection
 Тип курсора при перетаскивании выбранного объекта
 Описание
 Перечисление типов курсора, которые могут быть использованы при перетаскивании.
 Члены перечисления
 Описание
 Normal
 Обычный вид куросра при перетаскивании
 None
 Не указан тип курсора
 Selection
 Тип курсора при перетаскивании выбранного объекта
 Ваши комментарии по поводу этого топика: Послать отзыв!