Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Событие Publisher.BeginSheet
 Послать отзыв
 This is BeginSheet, a member of class Publisher.
 Синтаксис
C#
Visual Basic
public event BeginSheetEventHandler BeginSheet;
Public Event BeginSheet As BeginSheetEventHandler
 Ссылки
 Publisher Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!