Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.Windows.ToolPalette.CustomToolBase.SetEditorWindow
 Послать отзыв
 Метод вызывается непосредственно перед отображением диалогового окна редактора свойств инструмента. Использует для окна редактора дескриптор типа long. Не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetEditorWindow( long editorWindow, ref System.Object propertyInspector );
Копировать Код
Public Overridable Sub SetEditorWindow( editorWindow As long, ByRef propertyInspector As System.Object )
 Параметры
 Параметры
 Описание
 editorWindow
 Входной дескриптор окна редактора свойств. Тип long.
 propertyInspector
 Входной объект инспектора свойств. Тип System.Object.
 Описание
 Метод вызывается непосредственно перед отображением диалогового окна редактора свойств инструмента. Он использует для окна редактора дескриптор типа long и объект инспектора свойств. Инструмент может кэшировать эти значения для использования в процессе редактирования.
 В текущей версии не реализован.
 Ссылки
 HostMgd.Windows.ToolPalette.CustomToolBase, HostMgd.Windows.ToolPalette
 Ваши комментарии по поводу этого топика: Послать отзыв!