Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.InplaceTextEditor.Copy
 Послать отзыв
 Метод копирует выделенный текст в буфер обмена. В текущей версии не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Copy();
Копировать Код
Public Sub Copy()
 Описание
 Метод копирует в буфер обмена выделенный в редакторе текст. На текущее выделение эта операция не влияет. В текущей версии метод не реализован.
 Ссылки
 HostMgd.ApplicationServices.InplaceTextEditor, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!