Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.GetFileNameForSave(String)
 Послать отзыв
 Метод эмулирует ввод имени файла для сохранения, выводя заданное приглашение в командной строке, если диалоговые окна отключены или выполняется скрипт.
 Синтаксис
C#
Visual Basic
Копировать Код
public PromptFileNameResult GetFileNameForSave(String message);
Копировать Код
Public Function GetFileNameForSave(message As String) As PromptFileNameResult
 Параметры
 Параметры
 Описание
 message
 Сообщение, отображаемое в командной строке для приглашения пользователя к вводу имени файла (например, "Введите путь для сохранения файла DWG:"). Тип String.
 Возвращает
 Возвращает объект типа PromptFileNameResult, который содержит:
Status — статус операции (OK, Cancel, Error и др.).
StringResult — строковое значение с путём, под которым будет сохранён файл (если ввод успешен).
 Если пользователь отменил операцию или не указал допустимое имя файла, статус будет отличаться от OK.
 Описание
 Метод используется для получения пути и имени файла, под которым пользователь хочет сохранить документ. Если значение системной переменной FILEDIA равно 0 (диалоговые окна отключены) или команда вызвана из LISP-скрипта, метод выводит указанное сообщение в командной строке и ожидает ввода от пользователя. В противном случае может быть показан стандартный диалог сохранения файла. Метод позволяет интегрировать операцию сохранения в интерактивные и автоматизированные сценарии.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("GetFileNameForSaveExample_String")] public void GetFileNameForSaveExample_String() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создаём запрос пользователю PromptFileNameResult result = editor.GetFileNameForSave("Введите имя файла для сохранения:"); // Если все данные введены, выводим результат в командную строку if (result.Status == PromptStatus.OK) { editor.WriteMessage( $"\nФайл будет сохранён как: {result.StringResult}"); } else { editor.WriteMessage( "\nСохранение отменено."); } } }
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!