Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.InplaceTextEditor.FindAndReplaceDialog
 Послать отзыв
 Метод вызывает диалог поиска и замены текста. В текущей версии не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public void FindAndReplaceDialog();
Копировать Код
Public Sub FindAndReplaceDialog()
 Описание
 Метод вызывает диалог поиска и замены текста. В текущей версии не реализован.
 Ссылки
 HostMgd.ApplicationServices.InplaceTextEditor, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!