Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство LinetypeDialog.Linetype
 Послать отзыв
 This is Linetype, a member of class LinetypeDialog.
 Синтаксис
C#
Visual Basic
public Teigha::DatabaseServices::ObjectId Linetype;
Public Property Linetype() As Teigha.DatabaseServices.ObjectId
 Ссылки
 LinetypeDialog Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!