Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.GraphicsSystem.LinePattern
 Послать отзыв
 Данное перечисление определяет типы линий (паттерны), отображение которых не зависит от масштабирования чертежа на экране.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum LinePattern { DashDot = 3, Dashed = 1, DefaultLinePattern = 2, Dotted = 2, DoubleLongDash = 9, DoubleMediumDash = 8, DoubleShortDash = 7, LongDash = 6, LongDashDot = 14, LongDashDotDot = 13, LongDashShortDash = 12, MediumDash = 5, MediumDashDotShortDashDot = 15, MediumDashShortDashShortDash = 11, MediumLongDash = 10, ShortDash = 4, Solid = 0, SparseDot = 16 }
Копировать Код
Public Enum LinePattern DashDot = 3 Dashed = 1 DefaultLinePattern = 2 Dotted = 2 DoubleLongDash = 9 DoubleMediumDash = 8 DoubleShortDash = 7 LongDash = 6 LongDashDot = 14 LongDashDotDot = 13 LongDashShortDash = 12 MediumDash = 5 MediumDashDotShortDashDot = 15 MediumDashShortDashShortDash = 11 MediumLongDash = 10 ShortDash = 4 Solid = 0 SparseDot = 16 End Enum
 Члены
 Члены
 Описание
 DashDot
 Значение: 3. Штрихпунктирная линия (чередование штриха, точки и пробела).
 Dashed
 Значение: 1. Штриховая линия (чередование коротких штрихов и пробелов).
 DefaultLinePattern
 Значение: 2. Тип линии по умолчанию.
 Dotted
 Значение: 2. Пунктирная линия (чередование точек и пробелов).
 DoubleLongDash
 Значение: 9. Линия Фантом (2х) с двойными длинными штрихами.
 DoubleMediumDash
 Значение: 8. Линия Фантом с двойными штрихами обычной длины.
 DoubleShortDash
 Значение: 7. Линия Фантом (.5х) с двойными короткими штрихами.
 LongDash
 Значение: 6. Штриховая линия с длинными штрихами (2х).
 LongDashDot
 Значение: 14. Линия с чередованием длинного штриха и точки.
 LongDashDotDot
 Значение: 13. Линия с чередованием длинного штриха и двух последовательных точек.
 LongDashShortDash
 Значение: 12. Линия с чередованием длинного и короткого штрихов.
 MediumDash
 Значение: 5. Штриховая линия со штрихами средней длины.
 MediumDashDotShortDashDot
 Значение: 15. Линия с повторяющимся паттерном (средний штрих, точка, короткий штрих, точка).
 MediumDashShortDashShortDash
 Значение: 11. Линия с чередованием среднего и двух коротких штрихов.
 MediumLongDash
 Значение: 10. Линия с чередованием средних и длинных штрихов.
 ShortDash
 Значение: 4. Штриховая линия с короткими штрихами (.5х).
 Solid
 Значение: 0. Сплошная линия без разрывов.
 SparseDot
 Значение: 16. Линия с повторяющимся паттерном из разреженных точек.
 Описание
 Перечисление LinePattern определяет типы линий (паттерны), отображение которых не зависит от масштабирования чертежа на экране.
 Ваши комментарии по поводу этого топика: Послать отзыв!