Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.Application.ShowModalDialog(System.IntPtr,System.Windows.Forms.Form)
 Послать отзыв
 МЕТОД НЕ РЕАЛИЗОВАН. ВСЕГДА ВОЗВРАЩАЕТ System.Windows.Forms.DialogResult.None.
 Синтаксис
C#
Visual Basic
Копировать Код
public static System.Windows.Forms.DialogResult ShowModalDialog(IntPtr owner, System.Windows.Forms.Form formToShow);
Копировать Код
Public Shared Function ShowModalDialog(owner As IntPtr, formToShow As System.Windows.Forms.Form) As System.Windows.Forms.DialogResult
 Ссылки
 HostMgd.ApplicationServices.Application, HostMgd.ApplicationServices Пространство имен
 Исключения
 MGD NOT_IMPLEMENTED
 Ваши комментарии по поводу этого топика: Послать отзыв!