Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.GraphicsSystem.Manager.GetGsView
 Послать отзыв
 Метод позволяет получить объект View графической системы для указанного видового экрана.
 Синтаксис
C#
Visual Basic
Копировать Код
public Teigha.GraphicsSystem.View GetGsView( int viewportNumber, bool createIfNone );
Копировать Код
Public Function GetGsView( viewportNumber As Integer, createIfNone As Boolean ) As Teigha.GraphicsSystem.View
 Параметры
 Параметры
 Описание
 viewportNumber
 Номер видового экрана. Тип int.
 createIfNone
 Когда флаг установлен (true), то если связанный с видовым экраном вид не существует, он будет создан. Тип bool.
 Возвращает
 Возвращает объект вида графической системы. Тип Teigha.GraphicsSystem.View.
 Описание
 Метод позволяет получить объект вида графической системы для указанного видового экрана. При необходимости вид будет создан.
 Ссылки
 HostMgd.GraphicsSystem.Manager, HostMgd.GraphicsSystem
 Ваши комментарии по поводу этого топика: Послать отзыв!