Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод PaletteSet.CopyTo
 Послать отзыв
 This is CopyTo, a member of class PaletteSet.
 Синтаксис
C#
Visual Basic
public void CopyTo(ref array<HostMgd::Windows::Palette^> array, int index);
Public Sub CopyTo(ByRef array As array<HostMgd.Windows.Palette^>, index As Integer)
 Ссылки
 PaletteSet Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!