Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Делегат HostMgd.Publishing.AboutToEndPublishingEventHandler
 Послать отзыв
 This is type HostMgd::Publishing::AboutToEndPublishingEventHandler.
 Синтаксис
C#
Visual Basic
public delegate AboutToEndPublishingEventHandler();
Public Delegate Sub AboutToEndPublishingEventHandler()
 Ваши комментарии по поводу этого топика: Послать отзыв!