Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Converter.StringToAngle (String^, AngularUnitFormat)
 Послать отзыв
 Синтаксис
C#
Visual Basic
public double StringToAngle(ref String value, AngularUnitFormat units);
Public Function StringToAngle(ByRef value As String, units As AngularUnitFormat) As Double
 Описание
 Конвертирует строку в угол в соответствии с заданными угловыми единицами.
 Ссылки
 Converter Класс, HostMgd.Runtime Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!