Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PromptFileOptions.DialogCaption
 Послать отзыв
 Синтаксис
C#
Visual Basic
public System.String DialogCaption;
Public Property DialogCaption() As System.String
 Описание
 Свойство возвращает и устанавливает строку, выводимую в заголовке окна диалога.
 Условия
 На чтение и запись
 Ссылки
 PromptFileOptions Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!