Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.SelectionAddedEventArgs.Highlight(int,FullSubentityPath)
 Послать отзыв
 Метод выделяет подобъект внутри составного объекта на основе индекса и пути к геометрическому подобъекту.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Highlight(int subSelectionIndex, ValueType path);
Копировать Код
Public Sub Highlight(subSelectionIndex As Integer, path As ValueType)
 Параметры
 Параметры
 Описание
 subSelectionIndex
 Индекс подобъекта в текущем наборе выбранных подобъектов. Используется для идентификации позиции элемента в выборке. Тип int
 path
 Путь к геометрическому подобъекту, определяющий его положение в иерархии объекта. Обычно представляет собой экземпляр SubentityId или аналогичный тип, описывающий тип и индекс подобъекта (например, Edge, Face, Vertex). Тип ValueType
 Описание
 Метод используется для визуального выделения конкретного подобъекта (например, сегмента полилинии, ребра 3D-тела, грани или вершины) в составе сложного объекта. Он активирует подсветку в интерфейсе nanoCAD, делая выбранный элемент визуально выделенным, что помогает пользователю или программе отследить, с каким именно компонентом ведётся работа.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события SelectionAdded [Teigha.Runtime.CommandMethod("SelectionAddedExample_Highlight")] public void SelectionAddedExample_Highlight() { // Подписка на событие Rollover editor.SelectionAdded += OnSelectionAdded; } // Реализация отработки события SelectionAdded private void OnSelectionAdded(object sender, SelectionAddedEventArgs e) { // Подобъект, полученный через запрос SelectedSubObject someSelectedSubObject = default; // Выделение подобъекта  e.Highlight(0, someSelectedSubObject.FullSubentityPath.SubentId); } }
 Ссылки
 HostMgd.EditorInput.SelectionAddedEventArgs, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!