Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Структура HostMgd.ApplicationServices.WhoHasInfo
 Послать отзыв
 Синтаксис
C#
Visual Basic
public struct WhoHasInfo { }
Public Structure WhoHasInfo End Structure
 Описание
 Структура, содержащую информацию, возвращаемую методом класса Application GetWhoHasInfo().
 Топики
 Имя
 Описание
 WhoHasInfo Свойства
 Ниже перечислены свойства класса WhoHasInfo.
 Ссылки
 WhoHasInfo Свойства, Топики, WhoHasInfo Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!