Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.GraphicsSystem.Manager.ViewWasCreated
 Послать отзыв
 Событие ViewWasCreated выпускается сразу после создания нового вида.
 Синтаксис
C#
Visual Basic
Копировать Код
public event Teigha.GraphicsSystem.ViewWasCreatedEventHandler ViewWasCreated;
Копировать Код
Public Event ViewWasCreated As Teigha.GraphicsSystem.ViewWasCreatedEventHandler
 Возвращает
 Возвращает делегат типа Teigha.GraphicsSystem.ViewWasCreatedEventHandler.
 Описание
 Событие ViewWasCreated выпускается сразу после создания нового вида.
 Ссылки
 HostMgd.GraphicsSystem.Manager, HostMgd.GraphicsSystem
 Ваши комментарии по поводу этого топика: Послать отзыв!