Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.InplaceTextEditor.RulerSupported
 Послать отзыв
 Свойство RulerSupported позволяет проверить, поддерживает ли данный текстовый редактор линейку. В текущей версии не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool RulerSupported;
Копировать Код
Public ReadOnly Property RulerSupported As Boolean
 Возвращает
 Возвращает true, если линейка поддерживается. В противном случае возвращает false.
 Описание
 Свойство RulerSupported позволяет проверить, поддерживает ли данный текстовый редактор линейку. В текущей версии не реализовано.
 Условия
 Только чтение.
 Ссылки
 HostMgd.ApplicationServices.InplaceTextEditor, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!