Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.SelectAll()
 Послать отзыв
 Метод выбирает все объекты в текущем пространстве чертежа и возвращает их набор в виде результата выбора.
 Синтаксис
C#
Visual Basic
Копировать Код
public PromptSelectionResult SelectAll();
Копировать Код
Public Function SelectAll() As PromptSelectionResult
 Возвращает
 Возвращает объект типа PromptSelectionResult, который содержит:
Status — статус выполнения операции (OK, Cancel, Error и др.). Если объекты успешно выбраны, статус будет равен PromptStatus.OK.
Value — объект типа SelectionSet, содержащий список идентификаторов (ObjectId) всех выбранных объектов.
InputString — строковое значение, если операция была прервана с помощью клавиатуры.
 Если выборка успешна, через Value можно получить количество и идентификаторы всех выбранных объектов.
 Описание
 Метод используется для программного выделения всех видимых и доступных для выбора объектов в текущем пространстве модели или листа. Он имитирует действие команды выбора всех объектов, часто используемой при массовых операциях — перемещении, удалении, изменении свойств и т. д. Результат возвращается в виде объекта PromptSelectionResult, который содержит набор выбранных объектов или информацию о прерванной операции.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("SelectAllExample")] public void SelectAllExample() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Вызываем метод PromptSelectionResult result = editor.SelectAll(); // Выводим сообщение в командную строку if (result.Status == PromptStatus.OK) { SelectionSet selSet = result.Value; editor.WriteMessage( $"\nВыбрано объектов: {selSet.Count}"); } else { editor.WriteMessage( "\nНе удалось выбрать объекты."); } } }
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!