Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство EPlotPropertyBag.Id
 Послать отзыв
 This is Id, a member of class EPlotPropertyBag.
 Синтаксис
C#
Visual Basic
public System.String Id;
Public Property Id() As System.String
 Ссылки
 EPlotPropertyBag Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!