Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.InputPointContext.PointComputed
 Послать отзыв
 Свойство предназначено для определения, была ли успешно вычислена точка ввода на текущем этапе операции.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool PointComputed;
Копировать Код
Public Property PointComputed() As bool
 Возвращает
 Возвращает значение типа bool:
true — точка полностью вычислена и корректна.
false — точка ещё не вычислена, находится в состоянии обработки или недоступна.
 Рекомендуется использовать в сочетании с другими свойствами контекста:
C#
 Копировать Код
if (context.PointComputed) { Point3d validPoint = context.ComputedPoint; // Безопасно использовать точку }
 Описание
 Свойство возвращает логическое значение, указывающее, завершила ли система расчёт координат точки ввода с учётом всех активных режимов — таких как объектная привязка (OSNAP), сетка, полярное отслеживание, автоматическое выравнивание и другие. Оно служит флагом готовности:
true — все необходимые данные получены, и точка считается корректной для использования.
false — вычисление ещё не завершено, или точка не может быть определена из-за отсутствия данных или конфликтующих условий.
 Это свойство особенно важно при работе с событиями PointMonitor и PointFilter, где необходимо понимать, можно ли уже использовать текущие координаты ( ComputedPoint, ObjectSnappedPoint и др.) для дальнейших действий — например, построения, отрисовки направляющих или запуска команды.
 Оно позволяет избежать обработки неполных или промежуточных состояний ввода, обеспечивая стабильность и предсказуемость поведения пользовательских команд.
 Свойство устанавливается системой nanoCAD автоматически при обновлении контекста ввода.
 Условия
 Только чтение
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class InputPointContextExamples { // Метод команды, которая определяет, // была ли успешно вычислена точка ввода на текущем этапе операции [Teigha.Runtime.CommandMethod("PointComputedExample")] public void PointComputedExample() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Метод для отработки события редактора PointMonitor editor.PointMonitor += (sender, e) => { // Сохраняем контекст события в преременную InputPointContext context = e.Context; // Выводим в комнадную строку полученные данные if (context != null && context.PointComputed) { Point3d pt = context.ComputedPoint; editor.WriteMessage($"\nТочка вычислена: {pt}"); } else { editor.WriteMessage("\nТочка ещё не готова."); } }; } }
 Ссылки
 HostMgd.EditorInput.InputPointContext, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!