Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.TabbedDialogAction()
 Послать отзыв
 Делегат используется для определения действий в диалоговых окнах с вкладками.
 Синтаксис
C#
Visual Basic
Копировать Код
public delegate void TabbedDialogAction();
Копировать Код
Public Delegate Sub TabbedDialogAction()
 Описание
 Делегат TabbedDialogAction используется классом TabbedDialogExtension для определения действий в диалоговых окнах с вкладками.
 Ваши комментарии по поводу этого топика: Послать отзыв!