Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.RefreshCode
 Послать отзыв
 Данное перечисление определяет флаги, которые используются при обновлении списков устройств и стилей печати, поддерживаемых классом PlotConfigManager.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum RefreshCode { All = 0, RefreshDevicesList = 1, RefreshStyleList = 2, RefreshSystemDevicesList = 3, RefreshPC3DevicesList = 4 }
Копировать Код
Public Enum RefreshCode All = 0 RefreshDevicesList = 1 RefreshStyleList = 2 RefreshSystemDevicesList = 3 RefreshPC3DevicesList = 4 End Enum
 Члены
 Члены
 Описание
 All
 Значение: 0. Обновление всех существующих списков.
 RefreshDevicesList
 Значение: 1. Обновление только списка устройств.
 RefreshPC3DevicesList
 Значение: 4. Обновление только кэшированной информации о списке устройств вывода PC3.
 RefreshStyleList
 Значение: 2. Обновление только списка таблиц стилей печати.
 RefreshSystemDevicesList
 Значение: 3. Обновление только кэшированной информации о списке системных устройств вывода.
 Описание
 Перечисление RefreshCode определяет флаги, которые используются при обновлении списков устройств и стилей печати, поддерживаемых классом PlotConfigManager.
 Ваши комментарии по поводу этого топика: Послать отзыв!