Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.DragCallback(Point3d, Matrix3d)
 Послать отзыв
 Делегат DragCallback используется для геометрического преобразования отображаемого объекта в процессе операции перетаскивания.
 Синтаксис
C#
Visual Basic
Копировать Код
public delegate SamplerStatus DragCallback( Point3d current, ref Matrix3d xform );
Копировать Код
Public Delegate Function DragCallback( current As Point3d, ByRef xform As Matrix3d ) As SamplerStatus
 Параметры
 Параметры
 Описание
 current
 Текущая позиция курсора в мировой системе координат (WCS), в которой определено геометрическое преобразование. Тип Point3d.
 xform
 Матрица геометрического аффинного преобразования для отображаемого объекта (перемещение, вращение, масштабирование и т.п.), которое определяет делегат. Тип Matrix3d.
 Возвращает
 Возвращает статус операции перетаскивания как значение из перечисления SamplerStatus (OK, NoChange или Cancel).
 Описание
 Делегат DragCallback используется в интерактивных командах отрисовки и редактирования, где объект динамически перемещается, поворачивается или масштабируется в ответ на перемещения курсора мыши (например, при реализации Jig). Делегат вызывается системой nanoCAD на каждом шаге изменения положения курсора, чтобы вычислить новую матрицу преобразования на основе текущей позиции.
 На входе делегат получает текущую координату курсора current и ссылку на матрицу геометрического преобразования xform, которую необходимо обновить. Система использует эту матрицу для отображения объекта в его промежуточном положении ("резиновая линия", динамическая вставка блока и т.п.).
 Этот механизм обеспечивает плавную и отзывчивую визуализацию в процессе перетаскивания объекта чертежа.
 Пример
C#
 Копировать Код
// Определение метода OnDrag, реализующего делегат DragCallback. // Принимает текущую позицию курсора и ссылку на матрицу преобразования. // Возвращает статус операции перетаскивания (SamplerStatus). public SamplerStatus OnDrag(Point3d current, ref Matrix3d xform) { // Задаём базовую точку — начало координат (0, 0, 0), от которой будет рассчитываться смещение. Point3d basePoint = new Point3d(0, 0, 0); // Вычисляем вектор смещения от базовой точки до текущего положения курсора. // Метод GetVectorTo() возвращает разницу между current и basePoint как Vector3d. Vector3d offset = basePoint.GetVectorTo(current); // Создаём матрицу преобразования, представляющую перемещение (сдвиг) на вектор offset. // Эта матрица будет применена к объекту, чтобы переместить его к курсору. xform = Matrix3d.Displacement(offset); // Указываем системе, что операция перетаскивания продолжается. // SamplerStatus.OK означает успешное обновление и готовность к следующему шагу. return SamplerStatus.OK; }
 Ваши комментарии по поводу этого топика: Послать отзыв!