Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод MenuItemCollection.CopyTo (System::Array^, int)
 Послать отзыв
 This is CopyTo, a member of class MenuItemCollection.
 Синтаксис
C#
Visual Basic
public void CopyTo(ref System.Array Array, int index);
Public Sub CopyTo(ByRef Array As System.Array, index As Integer)
 Ссылки
 MenuItemCollection Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!