Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Window.Text
 Послать отзыв
 Синтаксис
C#
Visual Basic
public System.String Text;
Public Property Text() As System.String
 Описание
 Обеспечивает доступ к заголовку окна.
 Условия
 На чтение и запись
 Ссылки
 Window Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!