Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.DocumentWindowCollection.Count
 Послать отзыв
 Свойство Count представляет текущее количество окон открытых документов.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual int Count;
Копировать Код
Public Overridable ReadOnly Property Count As Integer
 Возвращает
 Возвращает текущее количество окон открытых документов. Тип int.
 Описание
 Свойство Count представляет текущее количество окон открытых документов.
 Условия
 Только чтение.
 Ссылки
 HostMgd.ApplicationServices.DocumentWindowCollection, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!