Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод PlotProgress.Heartbeat
 Послать отзыв
 Метод вызывается периодически в процессе печати между вызовами PlotEngine.BeginGenerateGraphics и PlotEngine.EndGenerateGraphics
 Синтаксис
C#
Visual Basic
public void Heartbeat();
Public Sub Heartbeat()
 Ссылки
 PlotProgress Класс, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!