Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.Windows.ToolPalette.CustomToolBase.GetCommandString
 Послать отзыв
 Метод отображает однострочный поясняющий текст для команды, добавленной в контекстное меню методом GetContextMenu(). Не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual System.String GetCommandString( UInt32 idCommand );
Копировать Код
Public Overridable Function GetCommandString( idCommand As UInt32 ) As System.String
 Параметры
 Параметры
 Описание
 idCommand
 Входной идентификатор команды. Тип UInt32.
 Возвращает
 Возвращает текст краткой справки для команды idCommand. Тип System.String.
 Описание
 Метод отображает однострочный поясняющий текст для команды, добавленной в контекстное меню методом GetContextMenu().
 В текущей версии не реализован.
 Ссылки
 HostMgd.Windows.ToolPalette.CustomToolBase, HostMgd.Windows.ToolPalette
 Ваши комментарии по поводу этого топика: Послать отзыв!