Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.Windows.ToolPalette.CustomToolBase.IsUnspecifiedAllowed
 Послать отзыв
 Метод позволяет определить, допустимо ли для указанного свойства использовать представление "не указано" (unspecified). Не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual int IsUnspecifiedAllowed( ref System.Object id, bool returnValue );
Копировать Код
Public Overridable Function IsUnspecifiedAllowed( ByRef id As System.Object, returnValue As Boolean ) As Integer
 Параметры
 Параметры
 Описание
 id
 Входной идентификатор свойства инструмента. Тип System.Object.
 returnValue
 Возвращаемое значение. Тип bool.
 Возвращает
 Возвращает код завершения метода. Тип int.
 Описание
 Метод позволяет определить, допустимо ли для указанного свойства использовать представление "не указано" (unspecified).
 В текущей версии не реализован.
 Замечания
 Для получения текстового представления свойств инструмента, значение которых помечено как "не указано" (unspecified) используется метод GetUnspecifiedString().
 Ссылки
 HostMgd.Windows.ToolPalette.CustomToolBase, HostMgd.Windows.ToolPalette
 Ваши комментарии по поводу этого топика: Послать отзыв!