Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.GetSelection()
 Послать отзыв
 Метод предназначен для получения набора объектов, выбранных пользователем в текущем чертеже.
 Синтаксис
C#
Visual Basic
Копировать Код
public PromptSelectionResult GetSelection();
Копировать Код
Public Function GetSelection() As PromptSelectionResult
 Возвращает
 Возвращает объект типа PromptSelectionResult, который содержит:
Status — статус выполнения операции (OK, Cancel, Error и др.).
Value — объект типа SelectionSet, содержащий список идентификаторов (ObjectId`) выбранных геометрических объектов.
StringResult — строковое значение, если выбор был выполнен через ввод с клавиатуры.
 Если операция завершена успешно, Status будет равен PromptStatus.OK, и в Value будет содержаться набор выбранных объектов.
 Описание
 Метод используется для получения множества графических объектов, выделенных пользователем в интерактивном режиме. Пользователь может выбрать один или несколько объектов с помощью мыши в графической области nanoCAD. Метод возвращает результат в виде объекта PromptSelectionResult, который содержит идентификаторы выбранных объектов и информацию о статусе операции. Если пользователь не выбрал ни одного допустимого объекта или отменил операцию, статус результата будет отличаться от OK.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("GetSelectionExample")] public void GetSelectionExample() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создаём запрос пользователю PromptSelectionResult result = editor.GetSelection(); // Если все данные введены, выводим результат в командную строку if (result.Status == PromptStatus.OK) { SelectionSet selSet = result.Value; editor.WriteMessage( $"\nВыбрано объектов: {selSet.Count}"); } else { editor.WriteMessage( "\nНе удалось получить выделение."); } } }
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!