Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.Document.CommandCancelled
 Послать отзыв
 Событие, означающее, что команда cmdStr была снята пользователем или другим приложением, и не смогла быть успешно завершена.
 Синтаксис
C#
Visual Basic
public event CommandEventHandler CommandCancelled;
Public Event CommandCancelled As CommandEventHandler
 Возвращает
 Возвращает тип данных CommandEventHandler
 Описание
 Событие, означающее, что команда cmdStr была снята пользователем или другим приложением, и не смогла быть успешно завершена. Соответствует функции NRX API HostEditorReactor.commandcanceled().
 Ссылки
 HostMgd.ApplicationServices.Document, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!