Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.InputPointContext.LastPoint
 Послать отзыв
 Свойство предназначено для получения последней введённой точки, если в истории ввода установлен соответствующий флаг.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d LastPoint;
Копировать Код
Public Property LastPoint() As Point3d
 Возвращает
 Возвращает объект типа Point3d — координаты последней введённой точки в мировой системе координат (WCS). Если команда уже вводила точку ранее и флаг LastPoint установлен — возвращает её. Если LastPoint не был задан (например, начало сеанса), может вернуть неопределённое значение (технически — точку, но логически недоступную). Для проверки доступности точки рекомендуется анализировать History:
C#
 Копировать Код
if ((context.History & PointHistoryBits.LastPoint) != 0) { Point3d last = context.LastPoint; // Использовать как базовую точку }
 Описание
 Свойство предоставляет координаты последней успешно введённой точки в текущем сеансе команды — например, конечная точка предыдущего отрезка, центр ранее построенного круга или точка завершения последней операции. Оно содержит корректное значение только в том случае, если в битовой маске History установлен флаг LastPoint, что указывает на наличие доступной "предыдущей" точки в контексте ввода.
 Это свойство особенно полезно при реализации команд, где следующая точка привязывается к предыдущей (например, построение полилинии, смещение, цепочка объектов). Оно позволяет использовать встроенную логику nanoCAD для продолжения черчения без повторного запроса базовой точки.
 Условия
 Только чтение
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class InputPointContextExamples { // Метод команды, которая получает последнюю введённую точку, // если в истории ввода установлен соответствующий флаг. [Teigha.Runtime.CommandMethod("LastPointExample")] public void LastPointExample() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Метод для отработки события редактора PointMonitor editor.PointMonitor += (sender, e) => { // Сохраняем контекст события в преременную InputPointContext context = e.Context; // Выводим в комнадную строку полученные данные if (context != null && (context.History & PointHistoryBits.LastPoint) != 0) { Point3d lastPt = context.LastPoint; editor.WriteMessage($"\nПоследняя точка: {lastPt}"); } }; } }
 Ссылки
 HostMgd.EditorInput.InputPointContext, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!