Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.PlotConfig.RefreshMediaNameList
 Послать отзыв
 Метод обновляет информацию об устройстве вывода. Не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public void RefreshMediaNameList();
Копировать Код
Public Sub RefreshMediaNameList()
 Описание
 Метод обновляет информацию о носителях (листах), которые доступны для текущего устройства вывода или PC3-файла.
 В текущей версии не реализован.
 Ссылки
 HostMgd.PlottingServices.PlotConfig, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!