Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptNestedEntityResultEventArgs
 Послать отзыв
 Класс предоставляет данные о завершённой операции выбора вложенного геометрического объекта внутри блока или внешней ссылки.
 Иерархия классов
HostMgd::EditorInput::PromptNestedEntityResultEventArgs
 Синтаксис
C#
Visual Basic
Копировать Код
public sealed class PromptNestedEntityResultEventArgs : EventArgs
Копировать Код
Public NotInheritable Class PromptNestedEntityResultEventArgs Inherits EventArgs
 Описание
 Класс наследуется от EventArgs и используется для передачи информации при завершении интерактивного выбора вложенного объекта — например, после вызова метода GetNestedEntity(). Он содержит:
идентификатор выбранного объекта (ObjectId),
точку выбора (PickedPoint) в мировой системе координат (WCS),
матрицу преобразования блока (BlockTransform),
статус операции (Status).
 Этот класс позволяет разработчикам надстроек nanoCAD обрабатывать результаты выбора объектов, расположенных внутри составных элементов чертежа, таких как блоки или внешние ссылки.
 Топики
 Имя
 Описание
 PromptNestedEntityResultEventArgs Свойства
 Ниже перечислены свойства класса PromptNestedEntityResultEventArgs.
 Ссылки
 PromptNestedEntityResultEventArgs Свойства, Топики, PromptNestedEntityResultEventArgs Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!