Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод XrefFileLock.ConsistencyCheck ()
 Послать отзыв
 Синтаксис
C#
Visual Basic
public void ConsistencyCheck();
Public Sub ConsistencyCheck()
 Описание
 По выбранному ID записи таблицы блоков для внешней ссылки этот метод определяет, является ли файл внешней ссылки все еще синхронизованым с тем файлом, который использовался во время загрузки чертежа. Он также определяет, являются ли любые другие записи таблицы блоков, относящиеся к тому же самому файлу внешней ссылки, также синхронизированными. Эта проверка выполняется путем проверки даты/времени файла внешней ссылки и его размера во время загрузки по сравнению с этими же его характеристиками, актуальными во время выполнения метода.
 Ссылки
 XrefFileLock Класс, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!