Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.DocumentCollection.Add(String)
 Послать отзыв
 Метод предназначен для создания нового документа по указанному шаблону.
 Синтаксис
C#
Visual Basic
public Document Add(ref String templateFileName);
Public Function Add(ByRef templateFileName As String) As Document
 Параметры
 Параметры
 Описание
 templateFileName
 Название файла шаблона и путь к нему, если шаблон находится не в стандартной папке с шаблонами. По умолчанию, это папка C:\Users\[user name]\AppDataRoaming\Nanosoft\nanoCAD x64 [xx.x]\Templates, где [user name] - имя пользователя ОС, [xx.x] - версия nanoCAD. У файлов-шаблонов расширение .dwt. Тип String
 Описание
 Метод позволяет создать новый dwg-документ по указанному в параметре templateFileName шаблону.
 Пример
 В качестве примера приведен метод, который добавляет dwg-документ в коллекцию документов.
C#
 Копировать Код
public partial class Commands { // Команда добавляет два новых документа в коллекцию по указанному шаблону [Teigha.Runtime.CommandMethod("AddDocToDocCollection")] public void AddDocumentToDocCollection() { // Получаем ссылку на коллекцию документов DocumentCollection documentCollection = HostMgd.ApplicationServices.Application.DocumentManager; // Добавляем новый документ, указав шаблон // При таком формате параметра шаблон должен находиться в стандартной папке с шаблонами. Если шаблон находится в другой папке, то нужно указать полный путь к нему documentCollection.Add("Default.dwt"); } }
 Ссылки
 HostMgd.ApplicationServices.DocumentCollection, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!