Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Класс HostMgd.ApplicationServices.DocumentIterator
 Послать отзыв
 Иерархия классов
HostMgd::ApplicationServices::DocumentIterator
 Синтаксис
C#
Visual Basic
public class DocumentIterator : DisposableWrapper, System.Collections.IEnumerator;
Public Class DocumentIterator Inherits DisposableWrapper Inherits System.Collections.IEnumerator
 Описание
 Итератор перебора документов в коллекции документов, реализующий интерфейс IEnumerator для коллекции документов. В момент создания указатель итератора находится на индексе -1. После создания для получения первого документа из коллекции необходимо выполнить метод MoveNext() класса.
 Топики
 Имя
 Описание
 DocumentIterator Методы
 Ниже перечислены методы класса DocumentIterator.
 DocumentIterator Свойства
 Ниже перечислены свойства класса DocumentIterator.
 Ссылки
 DocumentIterator Методы, DocumentIterator Свойства, Топики, DocumentIterator Методы, DocumentIterator Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!