Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.DsdData.IsHomogeneous
 Послать отзыв
 Свойство IsHomogeneous позволяет определить, являются ли все листы в подшивке однородными, т.е. выводятся ли они на однотипные устройства. Не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsHomogeneous;
Копировать Код
Public Property IsHomogeneous As Boolean
 Возвращает
 Возвращает true, если все листы в подшивке являются однородными. В противном случае возвращает false.
 Описание
 Свойство IsHomogeneous позволяет определить, являются ли все листы в подшивке однородными, т.е. выводятся ли они на однотипные устройства.
 В текущей версии не реализовано.
 Условия
 Чтение и запись.
 Ссылки
 HostMgd.PlottingServices.DsdData, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!