Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.ObjectSnapMasks
 Послать отзыв
 Данное перечисление определяет битовые флаги для настройки режимов объектной привязки.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum ObjectSnapMasks { End = 0x1, Middle = 0x2, Center = 0x4, Node = 0x8, Quadrant = 0x10, Intersection = 0x20, Insertion = 0x40, Perpendicular = 0x80, Tangent = 0x100, Near = 0x200, Quick = 0x400, ApparentIntersection = 0x800, Immediate = 0x10000, AllowTangent = 0x20000, DisablePerpendicular = 0x40000, RelativeCartesian = 0x80000, RelativePolar = 0x100000, NoneOverride = 0x200000 }
Копировать Код
Public Enum ObjectSnapMasks End = 0x1 Middle = 0x2 Center = 0x4 Node = 0x8 Quadrant = 0x10 Intersection = 0x20 Insertion = 0x40 Perpendicular = 0x80 Tangent = 0x100 Near = 0x200 Quick = 0x400 ApparentIntersection = 0x800 Immediate = 0x10000 AllowTangent = 0x20000 DisablePerpendicular = 0x40000 RelativeCartesian = 0x80000 RelativePolar = 0x100000 NoneOverride = 0x200000 End Enum
 Члены
 Члены
 Описание
 AllowTangent
 Значение: 131072 (0x20000). Флаг допустимости (желательности) касательной привязки в данном контексте.
 ApparentIntersection
 Значение: 2048 (0x800). Привязка к кажущемуся пересечению двух объектов, которые не пересекаются в 3D пространстве, но на текущем виде выглядят пересекающимися.
 Center
 Значение: 4 (0x4). Привязка к центру дуги, эллиптической дуги, эллипса или круга.
 DisablePerpendicular
 Значение: 262144 (0x40000). Отключение привязки к точкам, располагающимся на нормали к выбранному геометрическому объекту.
 End
 Значение: 1 (0x1). Привязка к ближайшей конечной точке или углу геометрического объекта.
 Immediate
 Значение: 65536 (0x10000). Флаг немедленной объектной привязки. Точка привязки устанавливается непосредственно в позицию курсора без применения каких-либо дополнительных режимов привязки (например, OSNAP, сетка или полярное отслеживание).
 Insertion
 Значение: 64 (0x40). Привязка к точке вставки объекта, такого как текст, блок, форма или атрибут.
 Intersection
 Значение: 32 (0x20). Привязка к пересечению геометрических объектов.
 Middle
 Значение: 2 (0x2). Привязка к средней точке геометрического объекта.
 Near
 Значение: 512 (0x200). Привязка к ближайшей точке объекта, например, дуги, окружности, эллипса, эллиптической дуги, отрезка, точки как объекта, полилинии, луча, сплайна или прямой.
 Node
 Значение: 8 (0x8). Привязка к узлу (точке как объекту, определяющей точке размера или начальной точке размерного текста).
 NoneOverride
 Значение: 2097152 (0x200000). Предотвращение переопределения параметров объектной привязки по умолчанию.
 Perpendicular
 Значение: 128 (0x80). Привязка к точке, располагающейся на нормали к выбранному геометрическому объекту.
 Quadrant
 Значение: 16 (0x10). Привязка к точке квадранта дуги, эллиптической дуги, эллипса или круга.
 Quick
 Значение: 1024 (0x400). Режим быстрой привязки "на лету"с учетом уже включённых режимов объектной привязки.
 RelativeCartesian
 Значение: 524288 (0x80000). Координатная привязка в относительных декартовых координатах.
 RelativePolar
 Значение: 1048576 (0x100000). Координатная привязка в относительных полярных координатах.
 Tangent
 Значение: 256 (0x100). Привязка к точке контакта касательной с дугой, окружностью, эллипсом, эллиптической дугой, дугой полилинии или сплайном.
 Описание
 Данное перечисление определяет поддерживаемые битовые флаги (маски) для настройки режимов объектной привязки.
 Ваши комментарии по поводу этого топика: Послать отзыв!