Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод TrayItem.ShowBubbleWindow
 Послать отзыв
 This is ShowBubbleWindow, a member of class TrayItem.
 Синтаксис
C#
Visual Basic
public void ShowBubbleWindow(ref TrayItemBubbleWindow bubble);
Public Sub ShowBubbleWindow(ByRef bubble As TrayItemBubbleWindow)
 Ссылки
 TrayItem Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!