Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PlotConfigInfo.FullPath
 Послать отзыв
 Полный путь доступа учтройства.
 Синтаксис
C#
Visual Basic
public System.String FullPath;
Public Property FullPath() As System.String
 Описание
 Если это принтер, то значение совпадает со значением DeviceName. Если файл PC3 - свойство возаращает полный путь доступа к файлу.
 Ссылки
 PlotConfigInfo Класс, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!