Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод PlotInfo.IsCompatibleDocument
 Послать отзыв
 Возвращает true если параметр объекта класса PlotInfo совместим с этим объектом.
 Синтаксис
C#
Visual Basic
public bool IsCompatibleDocument(ref HostMgd::PlottingServices::PlotInfo info);
Public Function IsCompatibleDocument(ByRef info As HostMgd.PlottingServices.PlotInfo) As bool
 Описание
 Ссылки
 PlotInfo Класс, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!