Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.SelectFence(Point3dCollection)
 Послать отзыв
 Метод возвращает набор объектов, пересекаемых ломаной линией выбора, заданной множеством вершин.
 Синтаксис
C#
Visual Basic
Копировать Код
public PromptSelectionResult SelectFence(Point3dCollection fence);
Копировать Код
Public Function SelectFence(fence As Point3dCollection) As PromptSelectionResult
 Параметры
 Параметры
 Описание
 fence
 Коллекция трёхмерных точек (Point3d), представляющих вершины линии выбора. Объекты, пересекающие эту линию, будут выбраны. Тип Point3dCollection.
 Возвращает
 Возвращает объект типа PromptSelectionResult, содержащий:
Status — статус выполнения (OK, Cancel, Error и др.). При успешной выборке статус равен PromptStatus.OK.
Value — объект типа SelectionSet, содержащий список идентификаторов (ObjectId) выбранных объектов.
StringResult — строковое значение.
 Если ни один объект не пересекает линию выбора, Value может быть null.
 Описание
 Метод используется для выбора геометрических объектов чертежа, которые пересекаются с линией, построенной по заданным точкам. Линия выбора (fence) представляет собой последовательность соединённых отрезков, и все объекты, пересекающие эту линию, включаются в результат. Метод удобен при выделении объектов вдоль сложной траектории.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("SelectFenceExample_Point3dCollection")] public void SelectFenceExample() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создание линии выбора из нескольких точек Point3dCollection fencePoints = new Point3dCollection(); fencePoints.Add(new Point3d(0, 0, 0)); fencePoints.Add(new Point3d(50, 50, 0)); fencePoints.Add(new Point3d(100, 0, 0)); // Вызываем метод PromptSelectionResult result = editor.SelectFence(fencePoints); // Выводим сообщение в командную строку if (result.Status == PromptStatus.OK) { SelectionSet selSet = result.Value; editor.WriteMessage( $"\nВыбрано объектов: {selSet.Count}"); } else { editor.WriteMessage( "\nНе найдено объектов, пересекающих линию выбора."); } } }
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!