Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.BeginDocumentEventArgs.PlotToFile
 Послать отзыв
 Свойство PlotToFile представляет флаг печати в файл.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool PlotToFile;
Копировать Код
Public ReadOnly Property PlotToFile As Boolean
 Возвращает
 Возвращает true, если требуется печать документа в файл. В противном случае возвращает false.
 Описание
 Свойство PlotToFile представляет флаг печати в файл.
 Условия
 Только чтение.
 Ссылки
 HostMgd.PlottingServices.BeginDocumentEventArgs, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!