Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Tool.Execute
 Послать отзыв
 This is Execute, a member of class Tool.
 Синтаксис
C#
Visual Basic
public void Execute(int flag, ref System.Windows.Forms.IWin32Window window, System.Drawing.Point point, int keyState);
Public Sub Execute(flag As Integer, ByRef window As System.Windows.Forms.IWin32Window, point As System.Drawing.Point, keyState As Integer)
 Ссылки
 Tool Класс, HostMgd.Windows.ToolPalette
 Ваши комментарии по поводу этого топика: Послать отзыв!