Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptIntegerOptionsEventArgs.Options
 Послать отзыв
 Свойство предоставляет доступ к параметрам приглашения, используемым при интерактивном вводе целого числа.
 Синтаксис
C#
Visual Basic
Копировать Код
public PromptIntegerOptions Options { get; }
Копировать Код
Public ReadOnly Property Options As PromptIntegerOptions
 Возвращает
 Возвращает объект типа PromptIntegerOptions, содержащий:
Message — текст приглашения,
DefaultValue — значение, используемое при нажатии Enter,
LowerLimit / UpperLimit — минимальное и максимальное допустимые значения,
AllowNone — разрешение на пропуск ввода,
AllowNegative — разрешение на отрицательные значения,
AllowZero — разрешение на ввод нуля.
 Если объект не был инициализирован, может вернуть null.
 Описание
 Свойство возвращает объект типа PromptIntegerOptions, содержащий настройки команды ввода целого числа — такие как сообщение приглашения, значение по умолчанию, допустимый диапазон и режимы ввода. Оно используется в обработчике события PromptingForInteger для динамической модификации параметров команды GetInteger() перед началом взаимодействия с пользователем.
 Условия
 Только чтение
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события PromptingForInteger [Teigha.Runtime.CommandMethod("PromptingForIntegerExample_Options")] public void PromptingForIntegerExample_Options() { // Подписка на событие PromptingForInteger editor.PromptingForInteger += OnEditorPromptingForInteger; } // Реализация отработки события PromptingForInteger private void OnEditorPromptingForInteger(object sender, PromptIntegerOptionsEventArgs e) { // Получаем доступ к параметрам запроса PromptIntegerOptions eOptions = e.Options; // Установка сообщения eOptions.Message = "Введите количество копий:"; // Задание диапазона eOptions.LowerLimit = 1; eOptions.UpperLimit = 100; } }
 Ссылки
 HostMgd.EditorInput.PromptIntegerOptionsEventArgs, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!