Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор PlotProgressDialog.PlotProgressDialog
 Послать отзыв
 This is PlotProgressDialog, a member of class PlotProgressDialog.
 Синтаксис
C#
Visual Basic
public PlotProgressDialog(bool isPreview, int sheetCount, bool showCancelSheetButton);
Public Sub New(isPreview As bool, sheetCount As Integer, showCancelSheetButton As bool)
 Ссылки
 PlotProgressDialog Класс, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!