Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PerPropertyBrowsingEntryAttribute.IntegralHeight
 Послать отзыв
 This is IntegralHeight, a member of class PerPropertyBrowsingEntryAttribute.
 Синтаксис
C#
Visual Basic
public int IntegralHeight;
Public Property IntegralHeight() As Integer
 Ссылки
 PerPropertyBrowsingEntryAttribute Класс, HostMgd.Windows.ToolPalette
 Ваши комментарии по поводу этого топика: Послать отзыв!