Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptEntityResult.ObjectId
 Послать отзыв
 Свойство предоставляет идентификатор геометрического объекта, выбранного пользователем в ходе интерактивной операции.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectId ObjectId { get; }
Копировать Код
Public ReadOnly Property ObjectId As ObjectId
 Возвращает
 Возвращает значение типа ObjectId, представляющее собой ссылку на выбранный геометрический объект в чертеже. Если объект не был выбран или операция была прервана, возвращается ObjectId.Null. Примеры использования ObjectId:
Чтение данных объекта из базы.
Открытие объекта для редактирования.
Передача объекта другим командам.
 Описание
 Свойство возвращает ссылку на геометрический объект в базе данных чертежа nanoCAD, который был указан пользователем — например, через метод GetEntity() или событие PromptedForEntity. Это значение позволяет получить уникальный идентификатор (ObjectId) выбранного элемента чертежа, с которым можно выполнять дальнейшие операции: читать свойства, модифицировать объект или удалять его. Свойство доступно только для чтения и обновляется автоматически при завершении операции выборки.
 Условия
 Только чтение
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("PromptEntityResult_ObjectId")] public void PromptEntityResult_ObjectId() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Вызываем метод GetEntity() для запроса объекта PromptEntityResult result = editor.GetEntity("Выберите объект:"); // Если все данные введены, выводим результат в командную строку if (result.Status == PromptStatus.OK) { ObjectId objId = result.ObjectId; editor.WriteMessage($"\nВыбран объект с ID: {objId}"); } else { editor.WriteMessage("\nНе удалось получить объект."); } } }
 Ссылки
 HostMgd.EditorInput.PromptEntityResult, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!