Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.Windows.ToolPalette.CustomToolBase.CustomToolBase
 Послать отзыв
 Конструктор по умолчанию класса CustomToolBase.
 Синтаксис
C#
Visual Basic
Копировать Код
public CustomToolBase();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса CustomToolBase.
 Ссылки
 HostMgd.Windows.ToolPalette.CustomToolBase, HostMgd.Windows.ToolPalette
 Ваши комментарии по поводу этого топика: Послать отзыв!