Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.GetNestedEntity(String)
 Послать отзыв
 Метод позволяет пользователю выбрать геометрический объект, вложенный во внешнюю ссылку или блок, и возвращает его идентификатор вместе с точкой выбора.
 Синтаксис
C#
Visual Basic
Копировать Код
public PromptNestedEntityResult GetNestedEntity(String message);
Копировать Код
Public Function GetNestedEntity(message As String) As PromptNestedEntityResult
 Параметры
 Параметры
 Описание
 message
 Сообщение, отображаемое в командной строке для приглашения пользователя к выбору вложенного объекта (например, "Выберите объект внутри блока:"). Тип String.
 Возвращает
 Возвращает объект типа PromptNestedEntityResult, который содержит:
Status — статус операции (OK, Cancel, Error и др.).
ObjectId — идентификатор выбранного вложенного геометрического объекта.
PickedPoint — координата точки, в которой пользователь выбрал объект (Point3d`).
Transform — матрица преобразования, применённая к объекту внутри блока.
 Если пользователь отменил операцию или объект не был найден, статус будет отличаться от OK.
 Описание
 Метод используется для интерактивного выбора пользователем геометрического объекта, который находится внутри вложенной структуры — например, внутри блока или внешней ссылки. Пользователь указывает объект мышью, после чего метод возвращает информацию о выбранном элементе и координате точки, в которой он был выбран. Метод выводит заданное текстовое приглашение в командной строке перед началом операции.
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!