Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PublishEventArgs.IsMultiSheetDwf
 Послать отзыв
 This is IsMultiSheetDwf, a member of class PublishEventArgs.
 Синтаксис
C#
Visual Basic
public bool IsMultiSheetDwf;
Public Property IsMultiSheetDwf() As bool
 Ссылки
 PublishEventArgs Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!