Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод PaletteSet.EnableTransparency
 Послать отзыв
 Синтаксис
C#
Visual Basic
public bool EnableTransparency(bool value);
Public Function EnableTransparency(value As bool) As bool
 Ссылки
 PaletteSet Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!