Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство TrayItemBubbleWindow.Text
 Послать отзыв
 This is Text, a member of class TrayItemBubbleWindow.
 Синтаксис
C#
Visual Basic
public System.String Text;
Public Property Text() As System.String
 Ссылки
 TrayItemBubbleWindow Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!