Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.Windows.ToolPalette.CustomToolBase.DoModal
 Послать отзыв
 Метод отображает модальное диалоговое окно для взаимодействия с пользовательским инструментом. Не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public void DoModal( ref System.String propertyValue, ref Teigha.DatabaseServices.ObjectIdCollection activeShapes );
Копировать Код
Public Sub DoModal( ByRef propertyValue As System.String, ByRef activeShapes As Teigha.DatabaseServices.ObjectIdCollection )
 Параметры
 Параметры
 Описание
 propertyValue
 Значение пользовательского свойства инструмента. Тип System.String.
 activeShapes
 Коллекция идентификаторов объектов активных форм, связанных с инструментом. Тип Teigha.DatabaseServices.ObjectIdCollection.
 Описание
 Метод отображает модальное диалоговое окно для взаимодействия с пользовательским инструментом, когда пользователь активирует настраиваемый инструмент на панели инструментов.
 В текущей версии не реализован.
 Ссылки
 HostMgd.Windows.ToolPalette.CustomToolBase, HostMgd.Windows.ToolPalette
 Ваши комментарии по поводу этого топика: Послать отзыв!