Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PromptCornerOptions.AllowNone
 Послать отзыв
 Синтаксис
C#
Visual Basic
public bool AllowNone;
Public Property AllowNone() As bool
 Описание
 Возвращает или устанавливает признак того, разрешен ли ввод только Enter.
 Значение true означает, что ввод только Enter разрешен, и false в противном случае.
 Условия
 На чтение и запись
 Ссылки
 PromptCornerOptions Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!