Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Перечисление HostMgd.Windows.PaletteSetTitleBarLocation
 Послать отзыв
 This is record HostMgd::Windows::PaletteSetTitleBarLocation.
 Синтаксис
C#
Visual Basic
public enum PaletteSetTitleBarLocation { Left, Right }
Public Enum PaletteSetTitleBarLocation Left Right End Enum
 Ваши комментарии по поводу этого топика: Послать отзыв!