Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор MenuItem.MenuItem (System::String^)
 Послать отзыв
 This is MenuItem, a member of class MenuItem.
 Синтаксис
C#
Visual Basic
public MenuItem(ref System.String value);
Public Sub New(ByRef value As System.String)
 Ссылки
 MenuItem Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!