Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.Application.DoDragDrop(System.Windows.Forms.Control,System.Object,System.Windows.Forms.DragDropEffects,HostMgd.Windows.DropTarget
 Послать отзыв
 Метод предназначен для выполнения OLE-операции drag-and-drop (перемещения элемента).
 Синтаксис
C#
Visual Basic
Копировать Код
public void DoDragDrop(System.Windows.Forms.Control control, System.Object data, System.Windows.Forms.DragDropEffects allowedEffects, HostMgd.Windows.DropTarget target);
Копировать Код
Public Sub DoDragDrop(control As System.Windows.Forms.Control, data As System.Object, allowedEffects As System.Windows.Forms.DragDropEffects, target As HostMgd.Windows.DropTarget)
 Параметры
 Параметры
 Описание
 control
 Элемент управления, к которому применяется операция drag-and-drop (перемещения элемента)
 data
 Данные элемента управления
 allowedEffects
 Разрешенные для элемента управления эффекты
 target
 Расположение элемента после выполнения операции
 Описание
 Метод выполняет OLE операцию drag-and-drop (перемещения элемента).
 Ссылки
 HostMgd.ApplicationServices.Application, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!