Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Runtime.IMenuItem.Click
 Послать отзыв
 Событие Click создается, когда данный элемент меню выбирается щелчком мыши или с помощью клавиш клавиатуры.
 Синтаксис
C#
Visual Basic
Копировать Код
event EventHandler Click;
Копировать Код
Event Click As EventHandler
 Описание
 Событие Click создается, когда данный элемент меню выбирается щелчком мыши или с помощью клавиш клавиатуры.
 Ссылки
 MenuItem Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!