Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Visuals.ApplicationIcon
 Послать отзыв
 This is ApplicationIcon, a member of class Visuals.
 Синтаксис
C#
Visual Basic
public Icon ApplicationIcon;
Public Property ApplicationIcon() As Icon
 Ссылки
 Visuals Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!