Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.GetSelection(PromptSelectionOptions,SelectionFilter)
 Послать отзыв
 Метод позволяет пользователю выбрать множество объектов на чертеже с использованием заданных параметров и фильтра, ограничивающего типы допустимых для выбора объектов.
 Синтаксис
C#
Visual Basic
Копировать Код
public PromptSelectionResult GetSelection(PromptSelectionOptions options, SelectionFilter filter);
Копировать Код
Public Function GetSelection(options As PromptSelectionOptions, filter As SelectionFilter) As PromptSelectionResult
 Параметры
 Параметры
 Описание
 options
 Объект, содержащий параметры приглашения:
 filter
 Фильтр, определяющий, какие объекты могут быть выбраны. Фильтр строится на основе условий по типу объекта, слою, цвету и другим свойствам. Например, можно задать фильтр, разрешающий выбор только объектов типа Line.
 Тип
 SelectionFilter
 Возвращает
 Возвращает объект типа PromptSelectionResult, который содержит:
Status — статус операции (OK, Cancel, Error и др.).
Value— объект типа SelectionSet, содержащий список идентификаторов (ObjectId`) выбранных объектов (если операция успешна).
StringResult — строковое представление введённой команды или ключевого слова (если использовался ручной ввод).
 Если пользователь успешно выбрал объекты, соответствующие фильтру, статус будет равен PromptStatus.OK, и в Value будет содержаться набор выбранных объектов.
 Описание
 Метод используется для интерактивного выбора пользователем одного или нескольких графических объектов в nanoCAD. В отличие от базовой версии GetSelection(), этот метод позволяет применить фильтр, который ограничивает список допустимых для выбора объектов — например, только линии, окружности или объекты определённого слоя. Пользователь может выбирать объекты мышью, рамкой или другими способами, поддерживаемыми системой. Параметры приглашения (PromptSelectionOptions) позволяют настроить поведение и сообщения во время выбора.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("GetSelectionExample_PromptSelectionOptions_SelectionFilter")] public void GetSelectionExample_PromptSelectionOptions_SelectionFilter() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Определяем настройки запроса пользователю PromptSelectionOptions options = new PromptSelectionOptions(); options.MessageForAdding = "Выберите линии:"; // Фильтр: только объекты типа Line SelectionFilter filter = new SelectionFilter(new TypedValue[] { new TypedValue((int)DxfCode.Start, "LINE") }); // Создаём запрос пользователю с созданными параметрами и фильтром объектов PromptSelectionResult result = editor.GetSelection(options, filter); // Если все данные введены, выводим результат в командную строку if (result.Status == PromptStatus.OK) { SelectionSet selSet = result.Value; editor.WriteMessage( $"\nВыбрано объектов: {selSet.Count}"); } else { editor.WriteMessage( "\nНе удалось получить выделение или объекты не соответствуют фильтру."); } } }
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!