Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.SelectionAddedEventArgs.AddedObjects
 Послать отзыв
 Свойство возвращает набор объектов, которые были добавлены к текущему выделению.
 Синтаксис
C#
Visual Basic
Копировать Код
public SelectionSet AddedObjects { get; }
Копировать Код
Public ReadOnly Property AddedObjects As SelectionSet
 Возвращает
 Возвращает объект типа SelectionSet, содержащий идентификаторы (ObjectId) объектов, добавленных к выборке. Если объекты были добавлены — SelectionSet содержит их список. Если добавлений не было — возвращается пустой SelectionSet (не null).
 Описание
 Свойство предоставляет доступ к объекту типа SelectionSet, содержащему список объектов, недавно добавленных в выборку. Оно используется в контексте событий и команд, отслеживающих изменения в наборе выбранных объектов — например, в обработчиках события SelectionAdded или при анализе динамики выделения.
 Условия
 Только чтение
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события SelectionAdded [Teigha.Runtime.CommandMethod("SelectionAddedExample_AddedObjects")] public void SelectionAddedExample_AddedObjects() { // Подписка на событие Rollover editor.SelectionAdded += OnSelectionAdded; } // Реализация отработки события SelectionAdded private void OnSelectionAdded(object sender, SelectionAddedEventArgs e) { // Получаем доступ к добавленным объектам SelectionSet added = e.AddedObjects; // Выводим сообщение в командную строку foreach (ObjectId id in added.GetObjectIds()) { editor.WriteMessage($"\nК выборке добавлен объект: {id}"); } } }
 Ссылки
 HostMgd.EditorInput.SelectionAddedEventArgs, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!