Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.MediaBounds.ToString
 Послать отзыв
 Метод позволяет получить эквивалентное строковое представление данного объекта. Не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public override System.String ToString();
Копировать Код
Public Overrides Function ToString() As System.String
 Возвращает
 Возвращает эквивалентное строковое представление данного объекта. Тип System.String.
 Описание
 Метод позволяет получить эквивалентное строковое представление данного объекта.
 В текущей версии не реализован.
 Ссылки
 HostMgd.PlottingServices.MediaBounds, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!