Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.Dwf3dOptions.PublishWithMaterials
 Послать отзыв
 Свойство PublishWithMaterials позволяет определить, включен ли режим публикации объекта 3D DWF с назначенными материалами.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool PublishWithMaterials;
Копировать Код
Public Property PublishWithMaterials As Boolean
 Возвращает
 Возвращает true, если режим публикации объекта 3D DWF с назначенными материалами включен. В противном случае возвращает false.
 Описание
 Свойство PublishWithMaterials позволяет определить, включен ли режим публикации объекта 3D DWF с назначенными материалами.
 Условия
 Чтение и запись.
 Ссылки
 HostMgd.PlottingServices.Dwf3dOptions, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!