Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство TabbedDialogExtension.OnCancel
 Послать отзыв
 Синтаксис
C#
Visual Basic
public TabbedDialogAction OnCancel;
Public Property OnCancel() As TabbedDialogAction
 Описание
 Возвращает обработчик события, который вызывается, когда в главном диалоге производится отмена.
 Условия
 Только на чтение
 Ссылки
 TabbedDialogExtension Класс, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!