Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PublishSheetEventArgs.PlotType
 Послать отзыв
 This is PlotType, a member of class PublishSheetEventArgs.
 Синтаксис
C#
Visual Basic
public Teigha::DatabaseServices::PlotType PlotType;
Public Property PlotType() As Teigha.DatabaseServices.PlotType
 Ссылки
 PublishSheetEventArgs Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!