Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод PublishEntityEventArgs.SetCurrentNode
 Послать отзыв
 This is SetCurrentNode, a member of class PublishEntityEventArgs.
 Синтаксис
C#
Visual Basic
public bool SetCurrentNode(int nodeId, ref Teigha::DatabaseServices::ObjectIdCollection objIds);
Public Function SetCurrentNode(nodeId As Integer, ByRef objIds As Teigha.DatabaseServices.ObjectIdCollection) As bool
 Ссылки
 PublishEntityEventArgs Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!