Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Класс HostMgd.EditorInput.JigPrompts
 Послать отзыв
 Класс предназначен для взаимодействия с пользователем во время использования технологии Jig.
 Иерархия классов
HostMgd::EditorInput::JigPrompts
 Синтаксис
C#
Visual Basic
public class JigPrompts;
Public Class JigPrompts
 Описание
 Примечания
 Класс предназначен для взаимодействия с пользователем во время использования технологии Jig и предоставляет возможность запрашивать у пользователя данные разного типа для построения или изменения графических объектов.
 Пример
 В примере приведена команда JigRotateScaleMove, с помощью которой можно вращать, масштабировать(уменьшать/увеличивать) и перемещать выбранный примитив или группу примитивов с помощью технологии Jig. Для вращения, масштабирования и перемещения используются методы JigPrompts.AcquireAngle(JigPromptAngleOptions options), JigPrompts.AcquireDistance(JigPromptDistanceOptions options), JigPrompts.AcquirePoint(JigPromptPointOptions options) соответственно.
 Логика работы команды JigRotateScaleMove реализована в классе RotateScaleMove. В этом классе применяются рассматриваемые в настоящем разделе методы.
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; using Teigha.Runtime; using Teigha.DatabaseServices; using System.Collections.Generic; using Teigha.Geometry; using Teigha.GraphicsInterface; using System; class RotateScaleMove : DrawJig { //Переменная entities для коллекции примитивов, которые будут изменяться public List<Entity> entities = new List<Entity>(); //Переменная KeyWord для хранения выбранного над примитивами действия public string keyWord; //Переменная basePoint для хранения выбранной точки отсчета для изменений public Point3d basePoint; //Переменная angle для хранения угла поворота примитивов public double angle; //Переменная scale для хранения коэффициента масштабирования примитивов public double scale; //Переменная newPoint для хранения точки, в которую будут перемещены примитивы public Point3d newPoint; //Переменная currentUCS для хранения системы координат, в которой созданы примитивы Matrix3d currentUCS; //Переменная transformationMatrix для хранения матрицы преобразования примитивов public Matrix3d transformationMatrix; //Для изменения выбранных пользователем примитивов в экземпляр класса необходимо передать: // - систему координат примитивов matrix // - выбранную точку отсчета для изменения _basePoint // - выбранное действие над примитивами kW public RotateScaleMove(Matrix3d matrix, Point3d _basePoint,string kW) { this.currentUCS = matrix; this.basePoint = _basePoint; transformationMatrix = new Matrix3d(); keyWord = kW; } protected override SamplerStatus Sampler(JigPrompts prompts) { switch (keyWord) { case "ВРАЩЕНИЕ": { //Определение экземпляра класса JigPromptAngleOptions и его свойств: // - приглашающее сообщение пользователю // - определение точки, относительно которой будут поворачиваться выбранные объекты JigPromptAngleOptions angleOptions = new JigPromptAngleOptions("Повернуть:"); angleOptions.UseBasePoint = true; angleOptions.BasePoint = basePoint; //Запрос угла поворота у пользователя с применением экземпляра класса // JigPromptAngleOptions PromptDoubleResult angleResult = prompts.AcquireAngle(angleOptions); if (angleResult.Status == PromptStatus.Cancel || angleResult.Status == PromptStatus.Error) return SamplerStatus.Cancel; if (angleResult.Value == angle) return SamplerStatus.NoChange; //Если метод prompt.AcquireAngle(angleOptions) завершил свою работу со статусом PromptStatus.OK,  // переменной angle присваивается выбранное пользователем значение angle = angleResult.Value; // Переменной transformationMatrix присваивается матрица вращения transformationMatrix = Matrix3d.Rotation(angleResult.Value, currentUCS.CoordinateSystem3d.Zaxis, basePoint); //Завершение работы метода с дальнейшим вызовом метода WorldDraw() return SamplerStatus.OK; } case "МАСШТАБ": { //Определение экземпляра класса JigPromptDistanceOptions и его свойств JigPromptDistanceOptions distanceOptions = new JigPromptDistanceOptions("Масштабировать:"); distanceOptions.UseBasePoint = true; distanceOptions.BasePoint = basePoint; //Запрос расстояния, которое будет использовано как коэффициент масштабирования с  // применением экземпляра класса JigPromptDistanceOptions PromptDoubleResult distanceResult = prompts.AcquireDistance(distanceOptions); if (distanceResult.Status == PromptStatus.Cancel || distanceResult.Status == PromptStatus.Error) return SamplerStatus.Cancel; if (distanceResult.Value == scale) return SamplerStatus.NoChange; //Если метод prompt.AcquireDistance(distanceOptions) завершил свою работу со статусом PromptStatus.OK,  // переменной scale присваивается выбранное пользователем значение scale = distanceResult.Value; // Переменной transformationMatrix присваивается матрица масштабирования transformationMatrix = Matrix3d.Scaling(scale, basePoint); return SamplerStatus.OK; } case "ПЕРЕМЕЩЕНИЕ": { //Определение экземпляра класса JigPromptPointOptions и его свойств: JigPromptPointOptions moveOptions = new JigPromptPointOptions("Переместить:"); moveOptions.UseBasePoint = true; moveOptions.BasePoint = basePoint; //Запрос точки, в которую будет перемещена выбранная точка отсчета для изменения примитивов с  // применением экземпляра класса JigPromptPointOptions PromptPointResult pointResult = prompts.AcquirePoint(moveOptions); if (pointResult.Status == PromptStatus.Cancel || pointResult.Status == PromptStatus.Error) return SamplerStatus.Cancel; if (pointResult.Value == basePoint) return SamplerStatus.NoChange; //Если метод prompt.AcquirePoint(pointOptions) завершил свою работу со статусом PromptStatus.OK,  // переменной newPoint присваивается выбранное пользователем значение newPoint = pointResult.Value; // Переменной transformationMatrix присваивается матрица перемещения transformationMatrix = Matrix3d.Displacement(basePoint.GetVectorTo(pointResult.Value)); return SamplerStatus.OK; } default:break; } return SamplerStatus.OK; } protected override bool WorldDraw(WorldDraw draw) { //Добавление нового преобразования в стек преобразований draw.Geometry.PushModelTransform(transformationMatrix); //Отображение преобразованых объектов foreach (var ent in entities) { draw.Geometry.Draw(ent); } //Возврат объектов в начальное состояние draw.Geometry.PopModelTransform(); return true; } } public partial class Commands { [CommandMethod("JigRotateScaleMove")] public void JigRotateScaleMove() { Document doc = Application.DocumentManager.MdiActiveDocument; Editor ed = doc.Editor; Database db = doc.Database; //Запрос действия для преобразования объекта(ов) PromptStringOptions stringOptions = new PromptStringOptions("Выберите действие [ВРАЩЕНИЕ/МАСШТАБ/ПЕРЕМЕЩЕНИЕ]:"); PromptResult stringResult = ed.GetString(stringOptions); if (stringResult.Status != PromptStatus.OK) return; //Запрос объектов, которые будут преобразованы PromptSelectionOptions selectionOptions = new PromptSelectionOptions(); selectionOptions.MessageForAdding = "Выберите объекты, которые необходимо изменить:"; selectionOptions.MessageForRemoval = "Выберите объекты, которые необходимо убрать из выделения:"; PromptSelectionResult selectionResult = ed.GetSelection(selectionOptions); if (selectionResult.Status != PromptStatus.OK) return; //Запрос точки, относительно которой будет выполнено преобразование PromptPointOptions pointOptions = new PromptPointOptions("Выберите базовую точку:"); PromptPointResult pointResult = ed.GetPoint(pointOptions); if (pointResult.Status != PromptStatus.OK) return; //Определение экземпляра класса-наследника DrawJig, который преобразует выбранные объекты по технологии Jig RotateScaleMove rotateScaleMove = new RotateScaleMove(ed.CurrentUserCoordinateSystem, pointResult.Value,stringResult.StringResult); //Начало транзакции с базой данных документа using (Transaction trans = db.TransactionManager.StartTransaction()) { //Получение Id примитивов из базы данных foreach (ObjectId id in selectionResult.Value.GetObjectIds()) { //Открытие каждого выбранного примитива для изменений Entity ent = (Entity)trans.GetObject(id, OpenMode.ForWrite); //Добавление каждого выбранного пользователем примитива в коллекцию класса RotateScaleMove entities rotateScaleMove.entities.Add(ent); } //Вызов метода Editor.Drag() для изменения выбранных примитивов по технологии Jig PromptResult prompt = ed.Drag(rotateScaleMove); //Если метод успешно выполнен, последнее преобразование сохраняется в базе данных документа if (prompt.Status == PromptStatus.OK) { foreach (Entity ent in rotateScaleMove.entities) ent.TransformBy(rotateScaleMove.transformationMatrix); trans.Commit(); } //Если метод выполнен с ошибкой или была отмена действий, изменения не сохраняются в базе данных else trans.Abort(); } //Вывод сообщения о выполненном преобразовании. switch (rotateScaleMove.keyWord) { case "ВРАЩЕНИЕ": { //При повороте объекта(ов) значение угла поворота переводится из радиан в градусы ed.WriteMessage("Поворот на {0} градусов", rotateScaleMove.angle*180/Math.PI); break; } case "МАСШТАБ": { ed.WriteMessage("Масштабирование с коэффициентом {0}", rotateScaleMove.scale); break; } case "ПЕРЕМЕЩЕНИЕ": { ed.WriteMessage("Перемещение из точки ({0},{1},{2}) в точку ({3},{4},{5})", rotateScaleMove.basePoint.X, rotateScaleMove.basePoint.Y, rotateScaleMove.basePoint.Z, rotateScaleMove.newPoint.X, rotateScaleMove.newPoint.Y, rotateScaleMove.newPoint.Z); break; } } } }
Visual Basic
 Копировать Код
Imports HostMgd.ApplicationServices Imports HostMgd.EditorInput Imports Teigha.Runtime Imports Teigha.DatabaseServices Imports System.Collections.Generic Imports Teigha.Geometry Imports Teigha.GraphicsInterface Imports System Class RotateScaleMove Inherits DrawJig 'Переменная entities для коллекции примитивов, которые будут изменяться Public entities As List(Of Entity) = New List(Of Entity)() 'Переменная KeyWord для хранения выбранного над примитивами действия Public keyWord As String 'Переменная basePoint для хранения выбранной точки отсчета для изменений Public basePoint As Point3d 'Переменная angle для хранения угла поворота примитивов Public angle As Double 'Переменная scale для хранения коэффициента масштабирования примитивов Public scale As Double 'Переменная newPoint для хранения точки, в которую будут перемещены примитивы Public newPoint As Point3d 'Переменная currentUCS для хранения системы координат, в которой созданы примитивы Private currentUCS As Matrix3d 'Переменная transformationMatrix для хранения матрицы преобразования примитивов Public transformationMatrix As Matrix3d 'Для изменения выбранных пользователем примитивов в экземпляр класса необходимо передать: '- систему координат примитивов matrix '- выбранную точку отсчета для изменения _basePoint '- выбранное действие над примитивами kW Public Sub New(ByVal matrix As Matrix3d, ByVal _basePoint As Point3d, ByVal kW As String) Me.currentUCS = matrix Me.basePoint = _basePoint transformationMatrix = New Matrix3d() keyWord = kW End Sub Protected Overrides Function Sampler(ByVal prompts As JigPrompts) As SamplerStatus Select Case keyWord Case "ВРАЩЕНИЕ" 'Определение экземпляра класса JigPromptAngleOptions и его свойств: '- приглашающее сообщение пользователю '- определение точки, относительно которой будут поворачиваться выбранные объекты Dim angleOptions As JigPromptAngleOptions = New JigPromptAngleOptions("Повернуть:") angleOptions.UseBasePoint = True angleOptions.BasePoint = basePoint 'Запрос угла поворота у пользователя с применением экземпляра класса 'JigPromptAngleOptions Dim angleResult As PromptDoubleResult = prompts.AcquireAngle(angleOptions) If angleResult.Status = PromptStatus.Cancel OrElse angleResult.Status = PromptStatus.[Error] Then Return SamplerStatus.Cancel If angleResult.Value = angle Then Return SamplerStatus.NoChange 'Если метод prompt.AcquireAngle(angleOptions) завершил свою работу со статусом PromptStatus.OK,  'переменной angle присваивается выбранное пользователем значение angle = angleResult.Value 'Переменной transformationMatrix присваивается матрица вращения transformationMatrix = Matrix3d.Rotation(angleResult.Value, currentUCS.CoordinateSystem3d.Zaxis, basePoint) 'Завершение работы метода с дальнейшим вызовом метода WorldDraw() Return SamplerStatus.OK Case "МАСШТАБ" 'Определение экземпляра класса JigPromptDistanceOptions и его свойств Dim distanceOptions As JigPromptDistanceOptions = New JigPromptDistanceOptions("Масштабировать:") distanceOptions.UseBasePoint = True distanceOptions.BasePoint = basePoint 'Запрос расстояния, которое будет использовано как коэффициент масштабирования с 'применением экземпляра класса JigPromptDistanceOptions Dim distanceResult As PromptDoubleResult = prompts.AcquireDistance(distanceOptions) If distanceResult.Status = PromptStatus.Cancel OrElse distanceResult.Status = PromptStatus.[Error] Then Return SamplerStatus.Cancel If distanceResult.Value = scale Then Return SamplerStatus.NoChange 'Если метод prompt.AcquireDistance(distanceOptions) завершил свою работу со статусом PromptStatus.OK, 'переменной scale присваивается выбранное пользователем значение scale = distanceResult.Value 'Переменной transformationMatrix присваивается матрица масштабирования transformationMatrix = Matrix3d.Scaling(scale, basePoint) Return SamplerStatus.OK Case "ПЕРЕМЕЩЕНИЕ" 'Определение экземпляра класса JigPromptPointOptions и его свойств: Dim moveOptions As JigPromptPointOptions = New JigPromptPointOptions("Переместить:") moveOptions.UseBasePoint = True moveOptions.BasePoint = basePoint 'Запрос точки, в которую будет перемещена выбранная точка отсчета для изменения примитивов с 'применением экземпляра класса JigPromptPointOptions Dim pointResult As PromptPointResult = prompts.AcquirePoint(moveOptions) If pointResult.Status = PromptStatus.Cancel OrElse pointResult.Status = PromptStatus.[Error] Then Return SamplerStatus.Cancel If pointResult.Value = basePoint Then Return SamplerStatus.NoChange 'Если метод prompt.AcquirePoint(pointOptions) завершил свою работу со статусом PromptStatus.OK,  'переменной newPoint присваивается выбранное пользователем значение newPoint = pointResult.Value 'Переменной transformationMatrix присваивается матрица перемещения transformationMatrix = Matrix3d.Displacement(basePoint.GetVectorTo(pointResult.Value)) Return SamplerStatus.OK Case Else End Select Return SamplerStatus.OK End Function Protected Overrides Function WorldDraw(ByVal draw As WorldDraw) As Boolean 'Добавление нового преобразования в стек преобразований draw.Geometry.PushModelTransform(transformationMatrix) 'Отображение преобразованых объектов For Each ent In entities draw.Geometry.Draw(ent) Next 'Возврат объектов в начальное состояние draw.Geometry.PopModelTransform() Return True End Function End Class Partial Public Class Commands <CommandMethod("JigRotateScaleMove")> Public Sub JigRotateScaleMove() Dim doc As Document = Application.DocumentManager.MdiActiveDocument Dim ed As Editor = doc.Editor Dim db As Database = doc.Database 'Запрос действия для преобразования объекта(ов) Dim stringOptions As PromptStringOptions = New PromptStringOptions("Выберите действие [ВРАЩЕНИЕ/МАСШТАБ/ПЕРЕМЕЩЕНИЕ]:") Dim stringResult As PromptResult = ed.GetString(stringOptions) If stringResult.Status <> PromptStatus.OK Then Return 'Запрос объектов, которые будут преобразованы Dim selectionOptions As PromptSelectionOptions = New PromptSelectionOptions() selectionOptions.MessageForAdding = "Выберите объекты, которые необходимо изменить:" selectionOptions.MessageForRemoval = "Выберите объекты, которые необходимо убрать из выделения:" Dim selectionResult As PromptSelectionResult = ed.GetSelection(selectionOptions) If selectionResult.Status <> PromptStatus.OK Then Return 'Запрос точки, относительно которой будет выполнено преобразование Dim pointOptions As PromptPointOptions = New PromptPointOptions("Выберите базовую точку:") Dim pointResult As PromptPointResult = ed.GetPoint(pointOptions) If pointResult.Status <> PromptStatus.OK Then Return 'Определение экземпляра класса-наследника DrawJig, который преобразует выбранные объекты по технологии Jig Dim rotateScaleMove As RotateScaleMove = New RotateScaleMove(ed.CurrentUserCoordinateSystem, pointResult.Value, stringResult.StringResult) 'Начало транзакции с базой данных документа Using trans As Transaction = db.TransactionManager.StartTransaction() 'Получение Id примитивов из базы данных For Each id As ObjectId In selectionResult.Value.GetObjectIds() 'Открытие каждого выбранного примитива для изменений Dim ent As Entity = CType(trans.GetObject(id, OpenMode.ForWrite), Entity) 'Добавление каждого выбранного пользователем примитива в коллекцию класса RotateScaleMove entities rotateScaleMove.entities.Add(ent) Next 'Вызов метода Editor.Drag() для изменения выбранных примитивов по технологии Jig Dim prompt As PromptResult = ed.Drag(rotateScaleMove) 'Если метод успешно выполнен, последнее преобразование сохраняется в базе данных документа If prompt.Status = PromptStatus.OK Then For Each ent As Entity In rotateScaleMove.entities ent.TransformBy(rotateScaleMove.transformationMatrix) Next trans.Commit() Else 'Если метод выполнен с ошибкой или была отмена действий, изменения не сохраняются в базе данных trans.Abort() End If End Using 'Вывод сообщения о выполненном преобразовании Select Case rotateScaleMove.keyWord Case "ВРАЩЕНИЕ" 'При повороте объекта(ов) значение угла поворота переводится из радиан в градусы ed.WriteMessage("Поворот на {0} градусов", rotateScaleMove.angle * 180 / Math.PI) Exit Select Case "МАСШТАБ" ed.WriteMessage("Масштабирование с коэффициентом {0}", rotateScaleMove.scale) Exit Select Case "ПЕРЕМЕЩЕНИЕ" ed.WriteMessage("Перемещение из точки ({0},{1},{2}) в точку ({3},{4},{5})", rotateScaleMove.basePoint.X, rotateScaleMove.basePoint.Y, rotateScaleMove.basePoint.Z, rotateScaleMove.newPoint.X, rotateScaleMove.newPoint.Y, rotateScaleMove.newPoint.Z) Exit Select End Select End Sub End Class
 Работа команды JigRotateScaleMove:
Вызов команды JigRotateScaleMove через консоль:
Выбор действия «поворот объектов» с помощью ключевого слова ВРАЩЕНИЕ:
Выбор объектов, которые будут повернуты:
Выбор точки, вокруг которой будет вращаться группа объектов:
Завершение поворота объектов с сообщением о выполненном преобразовании:
Повторный запуск команды «JigRotateScaleMove» и выбор действия «масштабировать объекты» с помощью ключевого слова МАСШТАБ:
Завершение масштабирования объектов с коэффициентом увеличения 2 и сообщением о выполненном преобразовании:
Повторный запуск команды «JigRotateScaleMove» и выбор действия перемещения объектов с помощью ключевого слова команды ПЕРЕМЕЩЕНИЕ:
Перемещение группы объектов с помощью технологии Jig:
 10.Завершение перемещения объектов с сообщением о выполненном преобразовании:
 Методы
 Конструкторы
 ПоказатьInternal
 Нет совпадений по текущему фильтру
 Имя
 Описание
 JigPrompts
 Конструктор класса
 Топики
 Имя
 Описание
 JigPrompts Методы
 Ниже перечислены методы класса JigPrompts.
 JigPrompts Свойства
 Ниже перечислены свойства класса JigPrompts.
 Ссылки
 JigPrompts Методы, JigPrompts Свойства, Методы, Топики, JigPrompts Методы, JigPrompts Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!