Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptSelectionOptions.SingleOnly
 Послать отзыв
 Свойство устанавливает режим :S для функции HostSSGet, ограничивая выбор только одним объектом.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool SingleOnly { get; set; }
Копировать Код
Public Property SingleOnly As Boolean
 Возвращает
 Возвращает значение типа bool:
true — включён режим :S: выбор ограничен одним объектом.
false — выбор может включать несколько объектов (в зависимости от режима).
 Описание
 Свойство активирует режим :S внутренней функции выбора HostSSGet. При установке в true пользователь может выбрать только один объект , даже если используется режим окна, рамки или множественного выбора. После выбора первого объекта операция завершается автоматически — без возможности добавления других объектов.
 Этот режим аналогичен использованию ключевого слова Один (Single) в командах чертежа. Он полезен при реализации команд, где требуется строго один объект — например, указание базовой точки, целевого объекта для копирования или элемента для анализа.
 Условия
 Чтение и запись
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("PromptSelectionOptionsExample_SingleOnly")] public void PromptSelectionOptionsExample_SingleOnly() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создаём набор параметров для запроса PromptSelectionOptions options = new PromptSelectionOptions(); options.MessageForAdding = "Выберите линии для объединения:"; // Разрешить выбор только одного объекта options.SingleOnly = true; // Фильтр: только объекты типа Line TypedValue[] filterList = new TypedValue[] { new TypedValue((int)DxfCode.Start, "LINE") }; SelectionFilter filter = new SelectionFilter(filterList); // Создаём запрос пользователю PromptSelectionResult result = editor.GetSelection(options, filter); // Если все данные введены, выводим результат в командную строку if (result.Status == PromptStatus.OK) { SelectionSet selSet = result.Value; editor.WriteMessage( $"\nВыбрано объектов: {selSet.Count}"); } else { editor.WriteMessage( "\nНе удалось получить выделение."); } } }
 Ссылки
 HostMgd.EditorInput.PromptSelectionOptions, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!