Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PublishSheetEventArgs.IsScaleSpecified
 Послать отзыв
 This is IsScaleSpecified, a member of class PublishSheetEventArgs.
 Синтаксис
C#
Visual Basic
public bool IsScaleSpecified;
Public Property IsScaleSpecified() As bool
 Ссылки
 PublishSheetEventArgs Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!