Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.IsQuiescent
 Послать отзыв
 Свойство предназначено для определения, находится ли редактор в состоянии ожидания пользовательского ввода без активных фоновых операций.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsQuiescent { get; }
Копировать Код
Public ReadOnly Property IsQuiescent() As bool
 Возвращает
 Возвращает значение типа bool:
true — если редактор находится в спокойном состоянии (ожидает ввода пользователя и не занят выполнением команд).
false — если редактор в данный момент выполняет какую-либо операцию или обрабатывает событие.
 Описание
 Свойство используется для проверки текущего состояния редактора nanoCAD — является ли он "спокойным", то есть не выполняет каких-либо команд или операций перерисовки, и готов к восприятию нового пользовательского ввода. Это может быть полезно при разработке плагинов или реакции на события, когда важно убедиться, что редактор находится в стабильном состоянии перед началом выполнения определённого действия.
 Условия
 Только чтение
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("IsQuiescentExample")] public void IsQuiescentExample() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Вывод сообщения в командной строке в зависимости от значения свойства IsQuiescent if (editor.IsQuiescent) { editor.WriteMessage("\nРедактор готов к новому вводу."); } else { editor.WriteMessage("\nРедактор занят — операция отложена."); } } }
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!