Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptAngleOptions.AllowArbitraryInput
 Послать отзыв
 Свойство определяет, разрешён ли пользователю произвольный ввод угла, не ограниченный заданными параметрами.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool AllowArbitraryInput { get; set; }
Копировать Код
Public Property AllowArbitraryInput As Boolean
 Возвращает
 Возвращает значение типа bool:
true — произвольный ввод угла разрешён.
false — ввод угла ограничен заданным диапазоном.
 Описание
 Свойство используется для управления тем, может ли пользователь ввести любое значение угла, игнорируя заданные с помощью LowerLimit и UpperLimit границы. Если свойство установлено в true, пользователь может ввести значение вне указанного диапазона. Если в false — ввод угла ограничен указанными минимальным и максимальным значениями.
 Это свойство особенно полезно при реализации гибких команд, где требуется ограничить или разрешить свободный ввод угла, например, при повороте объектов, построении или параметрических операциях.
 Замечания
 По умолчанию значение свойства равно true.
 Условия
 Чтение и запись
 Ссылки
 HostMgd.EditorInput.PromptAngleOptions, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!