Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PromptFileOptions.Message
 Послать отзыв
 Синтаксис
C#
Visual Basic
public System.String Message;
Public Property Message() As System.String
 Описание
 Возвращает или устанавливает строку с приглашением.
 Условия
 На чтение и запись
 Ссылки
 PromptFileOptions Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!