Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.InplaceTextEditor.PasteWithoutFormats
 Послать отзыв
 Метод вставляет текст без форматирования абзацев и в формате символов по умолчанию для данного текстового редактора. В текущей версии не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public void PasteWithoutFormats();
Копировать Код
Public Sub PasteWithoutFormats()
 Описание
 Метод вставляет текст в формате символов по умолчанию для данного текстового редактора и без форматирования абзацев. Если в момент вызова метода существует выделенный текст, текущее выделение удаляется.
 В текущей версии не реализован.
 Замечания
 Форматы символов по умолчанию берутся из свойств вводимого объекта и его текстового стиля.
 Форматирование символов включает такие свойства как тип шрифта (гарнитура), начертание (обычный, полужирный, курсив), высота текста, ряд эффектов (верхний и нижний индекс, зачёркивание и т.д.), цвет символов текста, тип подчёркивания (одинарное, двойное, волнистое и т.д.), язык, угол наклона, масштаб ширины и т.п.
 Формат абзацев включает такие свойства как абзацный отступ (отступ первой строки), отступы слева и справа, интервалы перед и после абзаца, выравнивание текста, коэффициент изменения межстрочного интервала, стиль межстрочного интервала, табуляция, нумерация абзацев и т.д.
 Ссылки
 HostMgd.ApplicationServices.InplaceTextEditor, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!