Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Класс HostMgd.Windows.PaletteSet
 Послать отзыв
 Набор панелей
 Иерархия классов
Teigha::Runtime::DisposableWrapper HostMgd::Windows::Window HostMgd::Windows::PaletteSet
 Синтаксис
C#
Visual Basic
[System.Reflection.DefaultMemberAttribute("Item")] public class PaletteSet : HostMgd::Windows::Window, System.Collections.ICollection;
<System.Reflection.DefaultMemberAttribute("Item")> Public Class PaletteSet Inherits HostMgd.Windows.Window Inherits System.Collections.ICollection
 Описание
 [Wrapper("hostUiPaletteSet")] //!!!
 Методы
 Конструкторы
 Класс HostMgd.Windows.Window
 Имя
 Описание
 Window
 Это обзор перегрузок Window.
 Класс HostMgd.Windows.PaletteSet
 Имя
 Описание
 PaletteSet
 Это обзор перегрузок PaletteSet.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Класс HostMgd.Windows.Window
 Имя
 Описание
 Window Перечисления
 Ниже перечислены перечисления класса Window.
 Window Методы
 Ниже перечислены методы класса Window.
 Window Свойства
 Ниже перечислены свойства класса Window.
 Класс HostMgd.Windows.PaletteSet
 Имя
 Описание
 PaletteSet Методы
 Ниже перечислены методы класса PaletteSet.
 PaletteSet Свойства
 Ниже перечислены свойства класса PaletteSet.
 PaletteSet События
 Ниже перечислены события класса PaletteSet.
 Ссылки
 PaletteSet Конструктор, PaletteSet Методы, PaletteSet Свойства, PaletteSet События, Методы, Топики, Window Перечисления, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства, PaletteSet События
 Ваши комментарии по поводу этого топика: Послать отзыв!