Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство TrayItemCollection.IList_Item
 Послать отзыв
 This is IList_Item, a member of class TrayItemCollection.
 Синтаксис
C#
Visual Basic
public Object IList_Item;
Public Property IList_Item() As Object
 Ссылки
 TrayItemCollection Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!