Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Событие PaletteSet.PaletteSetMoved
 Послать отзыв
 Событие генерируется после перемещения окна
 Синтаксис
C#
Visual Basic
public event HostMgd::Windows::PaletteSetMoveEventHandler PaletteSetMoved;
Public Event PaletteSetMoved As HostMgd.Windows.PaletteSetMoveEventHandler
 Ссылки
 PaletteSet Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!