Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод PublishEntityEventArgs.AddPropertiesIds
 Послать отзыв
 This is AddPropertiesIds, a member of class PublishEntityEventArgs.
 Синтаксис
C#
Visual Basic
public bool AddPropertiesIds(ref HostMgd::Publishing::EPlotPropertyBag properties, ref HostMgd::Publishing::DwfNode node);
Public Function AddPropertiesIds(ByRef properties As HostMgd.Publishing.EPlotPropertyBag, ByRef node As HostMgd.Publishing.DwfNode) As bool
 Ссылки
 PublishEntityEventArgs Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!