Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор ImageInfo.ImageInfo ()
 Послать отзыв
 This is ImageInfo, a member of class ImageInfo.
 Синтаксис
C#
Visual Basic
public ImageInfo();
Public Sub New()
 Ссылки
 ImageInfo Класс, HostMgd.Windows.ToolPalette
 Ваши комментарии по поводу этого топика: Послать отзыв!