Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PalettePersistEventArgs.ConfigurationSection
 Послать отзыв
 This is ConfigurationSection, a member of class PalettePersistEventArgs.
 Синтаксис
C#
Visual Basic
public HostMgd::ApplicationServices::IConfigurationSection ConfigurationSection;
Public Property ConfigurationSection() As HostMgd.ApplicationServices.IConfigurationSection
 Ссылки
 PalettePersistEventArgs Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!