Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор PaletteSetSizeEventArgs.PaletteSetSizeEventArgs
 Послать отзыв
 This is PaletteSetSizeEventArgs, a member of class PaletteSetSizeEventArgs.
 Синтаксис
C#
Visual Basic
public PaletteSetSizeEventArgs(int cx, int cy, double dx, double dy);
Public Sub New(cx As Integer, cy As Integer, dx As Double, dy As Double)
 Ссылки
 PaletteSetSizeEventArgs Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!