Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.PreviewEndPlotStatus
 Послать отзыв
 Данное перечисление определяет состояния завершения предварительного просмотра листа перед выводом на печать.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum PreviewEndPlotStatus { Normal = 0, Plot = 1, Cancel = 2, Next = 3, Previous = 4 }
Копировать Код
Public Enum PreviewEndPlotStatus Normal = 0 Plot = 1 Cancel = 2 Next = 3 Previous = 4 End Enum
 Члены
 Члены
 Описание
 Cancel
 Значение: 2. Предварительный просмотр был прерван. Пользователь (или главное приложение) запросил завершение всего вывода на печать и возврат управления главному приложению. (Например, если предварительный просмотр был инициирован пользовательской командой nanoCAD, эта команда должна быть завершена, а управление возвращено nanoCAD).
 Next
 Значение: 3. Пользователь вышел из режима предварительного просмотра, нажав на панели инструментов кнопку "Следующая страница" для предварительного просмотра следующего листа.
 Normal
 Значение: 0. Предварительный просмотр завершен стандартно, и пользователь не инициировал вывод на печать непосредственно из пользовательского интерфейса предварительного просмотра.
 Plot
 Значение: 1. Предварительный просмотр завершен стандартно, и пользователь запросил вывод на печать непосредственно из пользовательского интерфейса предварительного просмотра. Клиентские приложения должны продолжить печать с тем же объектом PlotInfo, который использовался для создания предварительного просмотра.
 Previous
 Значение: 4. Пользователь вышел из режима предварительного просмотра, нажав на панели инструментов кнопку "Предыдущая страница" для предварительного просмотра предыдущего листа.
 Описание
 Перечисление PreviewEndPlotStatus представляет состояния завершения предварительного просмотра листа перед выводом на печать.
 Ваши комментарии по поводу этого топика: Послать отзыв!