Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PromptDragOptions.AllowNone
 Послать отзыв
 Синтаксис
C#
Visual Basic
public bool AllowNone;
Public Property AllowNone() As bool
 Описание
 Устанавливает или возвращает признака разрешения ввода только клавиши Enter после приглашения.
 Условия
 На чтение и запись
 Ссылки
 PromptDragOptions Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!