Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.PlotInfoValidator.MediaBoundsWeight
 Послать отзыв
 Свойство MediaBoundsWeight представляет весовой коэффициент для границ носителя и области печати в текущих настройках печати.
 Синтаксис
C#
Visual Basic
Копировать Код
public int MediaBoundsWeight;
Копировать Код
Public Property MediaBoundsWeight As Integer
 Возвращает
 Возвращает весовой коэффициент для границ носителя и области печати. Тип int.
 Описание
 Свойство MediaBoundsWeight представляет весовой коэффициент для границ носителя и области печати в текущей конфигурации печати, связанной с объектом PlotInfo.
 Замечания
 См. описание свойства MediaMatchingThreshold.
 Условия
 Чтение и запись.
 Ссылки
 HostMgd.PlottingServices.PlotInfoValidator, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!