Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PointFilterResult.Retry
 Послать отзыв
 Синтаксис
C#
Visual Basic
public bool Retry;
Public Property Retry() As bool
 Описание
 Возвращает признак того, нужно ли заставить пользователя повторить попытку.
 Условия
 На чтение и запись
 Ссылки
 PointFilterResult Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!