Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.DsdData.ProjectPath
 Послать отзыв
 Свойство ProjectPath представляет путь к выходной папке. Не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public System.String ProjectPath;
Копировать Код
Public Property ProjectPath As System.String
 Возвращает
 Возвращает путь к выходной папке. Тип System.String.
 Описание
 Свойство ProjectPath представляет имя выходной папки. Это поле актуально только в случае публикации в файл. Поле сохраняется в DSD-файле и содержит путь к выходной папке.
 В текущей версии не реализовано.
 Условия
 Чтение и запись.
 Ссылки
 HostMgd.PlottingServices.DsdData, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!