Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PlotProgress.PlotCancelStatus
 Послать отзыв
 Синтаксис
C#
Visual Basic
public HostMgd::PlottingServices::PlotCancelStatus PlotCancelStatus;
Public Property PlotCancelStatus() As HostMgd.PlottingServices.PlotCancelStatus
 Ссылки
 PlotProgress Класс, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!