Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.WriteMessage(IFormatProvider,String,Object[])
 Послать отзыв
 Метод выводит форматированный текст в командной строке nanoCAD.
 Синтаксис
C#
Visual Basic
Копировать Код
public void WriteMessage(IFormatProvider provider, String sFormat, Object[] aAgs);
Копировать Код
Public Sub WriteMessage(provider As IFormatProvider, sFormat As String, aAgs As Object[])
 Параметры
 Параметры
 Описание
 provider
 Объект, предоставляющий информацию о форматировании (например, культуре или языковом стандарте), используемый при преобразовании данных в строку. Может быть равен null, тогда используется текущая культура. Тип IFormatProvider
 sFormat
 Строка формата, содержащая текст и спецификаторы замены в стиле String.Format, например: "Точка X={0}, Y={1}". Тип String
 aAgs
 Массив объектов, значения которых подставляются в строку формата sFormat. Тип Object[]
 Описание
 Метод используется для отображения текстового сообщения в командной строке редактора nanoCAD. Позволяет выводить строки с подстановкой значений по заданному формату, аналогично стандартным функциям форматирования .NET (String.Format). Предоставляет возможность локализованного форматирования чисел и дат через указание IFormatProvider.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("WriteMessageExample_IFormatProvider_String_ObjectArr")] public void WriteMessageExample_IFormatProvider_String_ObjectArr() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создаём точку Point3d pt = new Point3d(100.5, 200.75, 0); // Выводим координаты точки в командную строку editor.WriteMessage(null, "Координаты точки: X={0:F2}, Y={1:F2}", new object[] { pt.X, pt.Y}); // Выведет: Координаты точки: X=100.50, Y=200.75 } }
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!