Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор FileExistsConditionAttribute.FileExistsConditionAttribute (System::String^)
 Послать отзыв
 This is FileExistsConditionAttribute, a member of class FileExistsConditionAttribute.
 Синтаксис
C#
Visual Basic
public FileExistsConditionAttribute(ref System.String fileName);
Public Sub New(ByRef fileName As System.String)
 Ссылки
 FileExistsConditionAttribute Класс, HostMgd.Runtime Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!