Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.DocumentCollection.DocumentActivationChanged
 Послать отзыв
 Событие, возникающее после событий DocumentActivated или DocumentDestroyed.
 Синтаксис
C#
Visual Basic
public event DocumentActivationChangedEventHandler DocumentActivationChanged;
Public Event DocumentActivationChanged As DocumentActivationChangedEventHandler
 Возвращает
 Возвращает тип данных HostMgd.ApplicationServices.DocumentActivationChangedEventHandler
 Описание
 Событие, возникающее после того, как произошло событие DocumentActivated или DocumentDestroyed.
 Ссылки
 HostMgd.ApplicationServices.DocumentCollection, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!