Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Класс HostMgd.EditorInput.EditorUserInteraction
 Послать отзыв
 Иерархия классов
HostMgd::EditorInput::EditorUserInteraction
 Синтаксис
C#
Visual Basic
public class EditorUserInteraction : System.IDisposable;
Public Class EditorUserInteraction Inherits System.IDisposable
 Описание
 Класс позволяет пользователям взаимодействовать с редактором при помощи диалогового окна. Приложение, которое определяет модальное диалоговое окно, получает экземпляр класса при вызове метода Editor.StartUserInteraction(). При использовании этого объекта, диалоговое окно может вызвать редактор nanoCAD, чтобы разрешить пользователю произвести выбор.
 Топики
 Имя
 Описание
 EditorUserInteraction Методы
 Ниже перечислены методы класса EditorUserInteraction.
 Ссылки
 EditorUserInteraction Методы, Топики, EditorUserInteraction Методы
 Ваши комментарии по поводу этого топика: Послать отзыв!