Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство JigPromptGeometryOptions.UseBasePoint
 Послать отзыв
 Признак использования базовой точки во время операции Jig.
 Синтаксис
C#
Visual Basic
public bool UseBasePoint;
Public Property UseBasePoint() As bool
 Возвращает
 Возвращает признак использования базовой точки. true - базовая точка используется, false - базовая точка не используется.
 Описание
 Свойство предназначено для определения признака использования базовой точки во время операции Jig с геометрическим объектом.
 Условия
 Чтение и запись.
 Ссылки
 JigPromptGeometryOptions Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!