Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.GetDistance(PromptDistanceOptions)
 Послать отзыв
 Метод позволяет пользователю ввести линейное расстояние графически или вручную, с возможностью настройки параметров ввода.
 Синтаксис
C#
Visual Basic
Копировать Код
public PromptDoubleResult GetDistance(PromptDistanceOptions options);
Копировать Код
Public Function GetDistance(options As PromptDistanceOptions) As PromptDoubleResult
 Параметры
 Параметры
 Описание
 options
 Объект, содержащий параметры ввода расстояния:
 Возвращает
 Возвращает объект типа PromptDoubleResult, который содержит:
Status — статус операции (OK, Cancel, Error и др.).
Value — значение расстояния в единицах чертежа (если ввод успешен).
StringResult — строковое представление введённого значения или команды.
 Описание
 Метод используется для интерактивного ввода значения расстояния пользователем. Пользователь может указать две точки на чертеже мышью, либо ввести числовое значение в командной строке. Метод предоставляет гибкие настройки приглашения через объект PromptDistanceOptions, такие как начальное значение, ограничения на ввод и сообщение для пользователя.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("GetDistanceExample_PromptDistanceOptions")] public void GetDistanceExample_PromptDistanceOptions() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создаём запрос пользователю PromptDistanceOptions options = new PromptDistanceOptions("\nВведите расстояние:"); options.DefaultValue = 100.0; PromptDoubleResult result = editor.GetDistance(options); // Если данные введены, выводим результат в командную строку if (result.Status == PromptStatus.OK) { double distance = result.Value; editor.WriteMessage( $"\nВведено расстояние: {distance}"); } } }
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!