Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.Windows.ToolPalette.CustomToolBase.Load
 Послать отзыв
 Метод загружает данные инструмента из XML-узла в XmlElement перед использованием инструмента. Не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void Load( ref System.Object xmlElement );
Копировать Код
Public Overridable Sub Load( ByRef xmlElement As System.Object )
 Параметры
 Параметры
 Описание
 xmlElement
 Входной загружаемый элемент. Тип System.Object.
 Описание
 Метод загружает данные инструмента из XML-узла в XmlElement перед использованием инструмента.
 В текущей версии не реализован.
 Замечания
 За загрузку своих данных из XML-узла отвечает сам инструмент. Структура XML в этом узле определяется инструментом.
 Ссылки
 HostMgd.Windows.ToolPalette.CustomToolBase, HostMgd.Windows.ToolPalette
 Ваши комментарии по поводу этого топика: Послать отзыв!