Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.TurnForcedPickOff()
 Послать отзыв
 Метод отключает принудительный выбор объектов и возвращает предыдущее состояние режима выборки.
 Синтаксис
C#
Visual Basic
Копировать Код
public int TurnForcedPickOff();
Копировать Код
Public Function TurnForcedPickOff() As Integer
 Возвращает
 Возвращает значение типа int, представляющее предыдущее состояние режима принудительного выбора:
0 — режим был выключен.
1 — режим был включен.
 Это значение можно использовать для последующего восстановления исходного состояния после выполнения операции, требующей принудительного выбора.
 Описание
 Метод используется для временного отключения режима принудительного выбора объектов (forced pick), который может быть активирован другим методом или командой. Этот режим заставляет пользователя выбирать объекты мышью, игнорируя автоматическое выделение по окну или другим способам. Метод возвращает предыдущее значение состояния режима, чтобы можно было восстановить его при необходимости.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("TurnForcedPickOffExample")] public void TurnForcedPickOffExample() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Вызываем метод int previousState = editor.TurnForcedPickOff(); // Вывод сообщения в командной строке editor.WriteMessage( $"\nПредыдущее состояние принудительного выбора: {previousState}"); } }
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!