Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.GetCommandVersion()
 Послать отзыв
 Метод предоставляет номер версии текущей команды, используемой в стеке версий команд документа.
 Синтаксис
C#
Visual Basic
Копировать Код
public int GetCommandVersion();
Копировать Код
Public Function GetCommandVersion() As Integer
 Возвращает
 Возвращает значение типа int, представляющее номер версии текущей выполняемой команды. Если команда не выполняется или версия не определена, возвращается значение по умолчанию (например, 0).
 Описание
 Метод используется для получения идентификатора версии команды, которая в данный момент выполняется в контексте текущего документа. Версия команды позволяет определить, какая реализация или модификация команды активна, что может быть полезно при совместимости с разными версиями nanoCAD или при отладке сложных командных последовательностей.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("GetCommandVersionExample")] public void GetCommandVersionExample() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Выводим номер версии комманды в командную строку int version = editor.GetCommandVersion(); editor.WriteMessage($"\nТекущая версия команды: {version}"); } }
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!