Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство TrayItemBubbleWindow.IconType
 Послать отзыв
 This is IconType, a member of class TrayItemBubbleWindow.
 Синтаксис
C#
Visual Basic
public HostMgd::Windows::IconType IconType;
Public Property IconType() As HostMgd.Windows.IconType
 Ссылки
 TrayItemBubbleWindow Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!