Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptSelectionOptions
 Послать отзыв
 Класс предоставляет параметры для настройки интерактивной операции выбора объектов в nanoCAD.
 Иерархия классов
HostMgd::EditorInput::PromptSelectionOptions
 Синтаксис
C#
Visual Basic
Копировать Код
public sealed class PromptSelectionOptions
Копировать Код
Public NotInheritable Class PromptSelectionOptions
 Описание
 Класс используется при вызове метода GetSelection() для настройки поведения команды выбора объектов. Он позволяет задать:
текст приглашения,
режим выбора,
разрешение на пустой ввод,
ключевые слова,
дополнительные параметры контекста .
 Этот класс играет ключевую роль при реализации команд, требующих точного контроля над выборкой — например, при фильтрации по типу объекта, слою или пользовательским условиям. Он обеспечивает гибкость при взаимодействии с пользователем, позволяя добавлять подсказки, управлять режимами выделения и реализовывать диалоговый ввод.
 Класс используется совместно с событиями PromptingForSelection и PromptedForSelection, что позволяет как настраивать параметры перед выбором, так и обрабатывать результат после его завершения.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("GetSelectionExample")] public void GetSelectionExample() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создаём набор параметров для запроса PromptSelectionOptions options = new PromptSelectionOptions(); options.MessageForAdding = "Выберите линии для объединения:"; // Фильтр: только объекты типа Line TypedValue[] filterList = new TypedValue[] { new TypedValue((int)DxfCode.Start, "LINE") }; SelectionFilter filter = new SelectionFilter(filterList); // Создаём запрос пользователю PromptSelectionResult result = editor.GetSelection(options, filter); // Если все данные введены, выводим результат в командную строку if (result.Status == PromptStatus.OK) { SelectionSet selSet = result.Value; editor.WriteMessage( $"\nВыбрано объектов: {selSet.Count}"); } else { editor.WriteMessage( "\nНе удалось получить выделение."); } } }
 Методы
 Конструкторы
 Имя
 Описание
 PromptSelectionOptions
 Конструктор инициализирует новый экземпляр класса с параметрами выбора объектов по умолчанию.
 Топики
 Имя
 Описание
 PromptSelectionOptions Методы
 Ниже перечислены методы класса PromptSelectionOptions.
 PromptSelectionOptions Свойства
 Ниже перечислены свойства класса PromptSelectionOptions.
 PromptSelectionOptions События
 Ниже перечислены события класса PromptSelectionOptions.
 Ссылки
 PromptSelectionOptions Методы, PromptSelectionOptions Свойства, PromptSelectionOptions События, Методы, Топики, PromptSelectionOptions Методы, PromptSelectionOptions Свойства, PromptSelectionOptions События
 Ваши комментарии по поводу этого топика: Послать отзыв!