Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptSelectionOptions.AllowSubSelections
 Послать отзыв
 Свойство определяет, разрешён ли выбор подмножества объектов (например, вершин, рёбер или граней) внутри составных объектов, таких как полилинии, блоки или 3D-тела.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool AllowSubSelections { get; set; }
Копировать Код
Public Property AllowSubSelections As Boolean
 Возвращает
 Возвращает значение типа bool:
true — выбор подмножеств объектов разрешён.
false — выбор ограничен целыми объектами.
 Описание
 Свойство указывает, может ли пользователь выбирать не только целые объекты, но и их внутренние компоненты — подмножества. Если свойство установлено в true, при выборе объекта пользователь может указать конкретную вершину, сегмент полилинии, ребро блока или другую логическую часть. Если false — выбор ограничен только целыми объектами.
 Свойство применяется в связке с методом GetSelection().
 Условия
 Чтение и запись
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("PromptSelectionOptionsExample_AllowSubSelections")] public void PromptSelectionOptionsExample_AllowSubSelections() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создаём набор параметров для запроса PromptSelectionOptions options = new PromptSelectionOptions(); options.MessageForAdding = "Выберите линии для объединения:"; // Разрешить выбор части объекта options.AllowSubSelections = true; // Фильтр: только объекты типа Line TypedValue[] filterList = new TypedValue[] { new TypedValue((int)DxfCode.Start, "LINE") }; SelectionFilter filter = new SelectionFilter(filterList); // Создаём запрос пользователю PromptSelectionResult result = editor.GetSelection(options, filter); // Если все данные введены, выводим результат в командную строку if (result.Status == PromptStatus.OK) { SelectionSet selSet = result.Value; editor.WriteMessage( $"\nВыбрано объектов: {selSet.Count}"); } else { editor.WriteMessage( "\nНе удалось получить выделение."); } } }
 Ссылки
 HostMgd.EditorInput.PromptSelectionOptions, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!