Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод TrayItem.CloseBubbleWindows
 Послать отзыв
 This is CloseBubbleWindows, a member of class TrayItem.
 Синтаксис
C#
Visual Basic
public void CloseBubbleWindows();
Public Sub CloseBubbleWindows()
 Ссылки
 TrayItem Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!