Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PaletteSetStateEventArgs.NewState
 Послать отзыв
 This is NewState, a member of class PaletteSetStateEventArgs.
 Синтаксис
C#
Visual Basic
public HostMgd::Windows::StateEventIndex NewState;
Public Property NewState() As HostMgd.Windows.StateEventIndex
 Ссылки
 PaletteSetStateEventArgs Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!