Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод DrawJig.WorldDraw
 Послать отзыв
 Абстрактный метод, обязателен к реализации.
 Синтаксис
C#
Visual Basic
public bool WorldDraw(ref Teigha.GraphicsInterface.WorldDraw draw);
Public Function WorldDraw(ByRef draw As Teigha.GraphicsInterface.WorldDraw) As bool
 Параметры
 Параметры
 Описание
 draw
 Параметры для отрисовки графических объектов.
 Возвращает
 Метод возвращает значение типа bool.
 Описание
 Отвечает за графическое представление объекта на экране.
 Абстрактный метод, обязателен к реализации. Отвечает за графическое представление объекта на экране. В теле метода определяется, как должен выглядеть объект. Для этого используется параметр draw типа WorldDraw. Тип данных WorldDraw содержит в себе свойства, которые возвращают ссылки на объекты классов SubEntityTraits и WorldGeometry.Класс SubEntityTraits позволяет управлять цветами, слоями, типами линий, типами заливки графических объектов.Класс WorldGeometry отвечает за кэширование графических объектов для последующего отображения на экране.
 Метод вызывается после отработки метода DrawJig.Sampler.В результате вызова метода DrawJig.WorldDraw на экране отображается предпросмотр графического объекта.После завершения всех операций метод возвращает значение типа bool.Если метод возвращает false, то далее вызывается метод DrawJig.ViewportDraw, если он возвращает true, то метод DrawJig.ViewportDraw не будет вызван, даже если он реализован.
 Ссылки
 DrawJig Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!