Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.GetEntity(String)
 Послать отзыв
 Метод приглашает пользователя выбрать графический объект указанием точки на нём и возвращает результат с идентификатором объекта и координатой точки выбора.
 Синтаксис
C#
Visual Basic
Копировать Код
public PromptEntityResult GetEntity(String message);
Копировать Код
Public Function GetEntity(message As String) As PromptEntityResult
 Параметры
 Параметры
 Описание
 message
 Сообщение, отображаемое в командной строке для приглашения пользователя к выбору объекта (например, "Выберите линию:"). Тип String.
 Возвращает
 Возвращает объект типа PromptEntityResult, который содержит:
Status — статус операции (OK, Cancel, Error и др.).
ObjectId — идентификатор выбранного графического объекта (если операция успешна).
PickedPoint — координата точки, указанной пользователем на объекте (Point3d).
 Если пользователь прервал операцию или был выбран недопустимый объект, статус будет отличаться от OK.
 Описание
 Метод используется для интерактивного выбора пользователем одного геометрического объекта на чертеже. Пользователь указывает мышью точку на объекте, после чего метод возвращает информацию о выбранном объекте. Выбор возможен только для графических объектов — неграфические элементы игнорируются. Метод выводит заданное сообщение-приглашение и ожидает ввода от пользователя до завершения операции.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("GetEntityExample_String")] public void GetEntityExample_String() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создаём запрос пользователю PromptEntityResult result = editor.GetEntity("\nВыберите объект:"); // Если все данные введены, выводим результат в командную строку if (result.Status == PromptStatus.OK) { editor.WriteMessage( $"\nВыбран объект с ID: {result.ObjectId}, точка: {result.PickedPoint}"); } else { editor.WriteMessage( "\nОперация выбора отменена или объект не найден."); } } }
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!