Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.GraphicsSystem.ViewEventArgs
 Послать отзыв
 Класс ViewEventArgs представляет данные пользовательских событий, связанных с изменением вида. Не реализован.
 Иерархия классов
HostMgd::GraphicsSystem::ViewEventArgs
 Синтаксис
C#
Visual Basic
Копировать Код
public sealed class ViewEventArgs : System.EventArgs;
Копировать Код
Public NotInheritable Class ViewEventArgs Inherits System.EventArgs;
 Описание
 Класс ViewEventArgs представляет данные пользовательских событий, связанных с изменением вида. В текущей версии не реализован.
 Методы
 Конструкторы
 Имя
 Описание
 ViewEventArgs
 Конструктор по умолчанию класса ViewEventArgs.
 Топики
 Имя
 Описание
 ViewEventArgs Свойства
 Ниже перечислены свойства класса ViewEventArgs.
 Ссылки
 ViewEventArgs Свойства, Методы, Топики, ViewEventArgs Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!