Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Пространство имен HostMgd.ApplicationServices
 Послать отзыв
 Пространство имен, в котором расположены классы, предназначенные для работы с приложением nanoCAD через API.
 Описание
 В пространстве имен расположены классы, с помощью которых можно работать с приложением nanoCAD через API: закрывать приложение, переключаться между открытыми чертежами, отслеживать события, происходящие в приложении, вызывать справку и пр.
 Классы
 Имя
 Описание
 Application
 Класс представляет приложение nanoCAD. Имеет только статические методы.
 BeginDoubleClickEventArgs
 Класс предназначен для хранения информации о событии двойного щелчка.
 CommandEventArgs
 Класс предназначен для хранения данных о событиях, произошедших в документе.
 Document
 Класс представляет dwg-документ. Каждый чертеж ассоциируется с этим классом.
 DocumentActivationChangedEventArgs
 DocumentBeginCloseEventArgs
 Класс предоставляет данные для события BeginDocumentClose класса Document.
 DocumentCollection
 Класс представляет коллекцию открытых в приложении dwg-документов.
 DocumentCollectionEventArgs
 DocumentDestroyedEventArgs
 DocumentIterator
 DocumentLock
 DocumentLockModeChangeVetoedEventArgs
 DocumentLockModeChangedEventArgs
 DocumentLockModeWillChangeEventArgs
 DocumentWindowCollection
 Класс DocumentWindowCollection представляет коллекцию окон открытых документов.
 DocumentWindowIterator
 DrawingOpenEventArgs
 Класс DrawingOpenEventArgs представляет данные события EndDwgOpen класса Document.
 InplaceTextEditor
 Класс InplaceTextEditor представляет встроенный текстовый редактор nanoCAD. В текущей версии не реализован.
 InplaceTextEditorSettings
 Класс InplaceTextEditorSettings представляет входные параметры для встроенного текстового редактора InplaceTextEditor. В текущей версии не реализован.
 LispWillStartEventArgs
 LongTransactionEventArgs
 Класс LongTransactionEventArgs представляет данные событий длительных транзакций. В текущей версии не реализован.
 LongTransactionManager
 Класс LongTransactionManager представляет менеджер для создания и управления длительными транзакциями. В текущей версии не реализован.
 Marshaler
 Класс Marshaler представляет служебные методы для преобразования между управляемыми наборами выделенных объектов и неуправляемыми структурами данных в формате ads_name. В текущей версии не реализован.
 PreTranslateMessageEventArgs
 Класс PreTranslateMessageEventArgs представляет данные события PreTranslateMessage класса Application. В текущей версии не реализован.
 ProfileEventArgs
 Класс ProfileEventArgs представляет данные события ProfileEvent. В текущей версии данный класс не реализован.
 RecentDocument
 Класс RecentDocument представляет недавно открытый документ или чертеж. В текущей версии данный класс не реализован.
 SystemVariableChangedEventArgs
 SystemVariableChangingEventArgs
 TabbedDialogEventArgs
 TabbedDialogExtension
 TransactionManager
 UnknownCommandEventArgs
 UserConfigurationManager
 XrefFileLock
 Интерфейсы
 Имя
 Описание
 IConfigurationSection
 Ссылки
 Классы, Перечисления, Интерфейсы, Структуры, Делегаты
 Ваши комментарии по поводу этого топика: Послать отзыв!