Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод PlotConfigManager.SetCurrentConfig
 Послать отзыв
 Метод устанавливает используемую конфигурацию плоттера печати по его наименованию Используемая конфигурация плоттера сохраняется только на время текущей сессии.
 Синтаксис
C#
Visual Basic
public HostMgd::PlottingServices::PlotConfig SetCurrentConfig(ref System.String deviceName);
Public Function SetCurrentConfig(ByRef deviceName As System.String) As HostMgd.PlottingServices.PlotConfig
 Описание
 И может иметь значение null.
 Ссылки
 PlotConfigManager Класс, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!