Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.PromptedForDistance
 Послать отзыв
 Событие возникает после завершения интерактивного ввода расстояния пользователем в редакторе nanoCAD. Событие не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public event PromptDoubleResultEventHandler PromptedForDistance;
Копировать Код
Public Event PromptedForDistance As PromptDoubleResultEventHandler
 Описание
 Событие инициируется системой .NET API nanoCAD при завершении операции ввода расстояния, например, после вызова метода GetDistance(). Оно позволяет разработчику получить доступ к результату ввода — значению расстояния типа double, а также статусу операции (OK, Cancel, Error) через объект PromptDoubleResultEventArgs. Это событие особенно полезно для обработки или отслеживания ввода расстояния с клавиатуры или указания мышью двух точек на чертеже.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события PromptedForDistance [Teigha.Runtime.CommandMethod("PromptedForDistanceExample")] public void PromptedForDistanceExample() { // Подписка на событие PromptedForDistance editor.PromptedForDistance += OnEditorPromptedForDistance; } // Реализация отработки события PromptedForDistance private void OnEditorPromptedForDistance(object sender, PromptDoubleResultEventArgs e) { // Вывод сообщения в командную строку if (e.Result.Status == PromptStatus.OK) { editor.WriteMessage($"\nВведено расстояние: {e.Result.Value}"); } else { editor.WriteMessage("\nОперация ввода расстояния отменена."); } } }
 Порядок работы с событием:
Пользователь запускает ввод расстояния (например, через GetDistance()).
Происходит графический или клавиатурный ввод.
После завершения генерируется событие PromptedForDistance.
Разработчик может обработать результат в обработчике, используя значение Value.
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!