Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Класс HostMgd.ApplicationServices.XrefFileLock
 Послать отзыв
 Иерархия классов
Teigha::Runtime::DisposableWrapper HostMgd::ApplicationServices::XrefFileLock
 Синтаксис
C#
Visual Basic
public class XrefFileLock : Teigha::Runtime::DisposableWrapper;
Public Class XrefFileLock Inherits Teigha.Runtime.DisposableWrapper
 Описание
 .NET класс, соответствующий классу NcEdXrefFileLock nanoCAD API.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Класс HostMgd.ApplicationServices.XrefFileLock
 Имя
 Описание
 XrefFileLock Методы
 Ниже перечислены методы класса XrefFileLock.
 XrefFileLock Свойства
 Ниже перечислены свойства класса XrefFileLock.
 Ссылки
 XrefFileLock Методы, XrefFileLock Свойства, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!