Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор FenceSelectedObject.FenceSelectedObject
 Послать отзыв
 Синтаксис
C#
Visual Basic
public FenceSelectedObject(Teigha::DatabaseServices::ObjectId id, HostMgd::EditorInput::SelectionMethod method, int gsMarker, ref array<HostMgd::EditorInput::PickPointDescriptor^> descriptors);
Public Sub New(id As Teigha.DatabaseServices.ObjectId, method As HostMgd.EditorInput.SelectionMethod, gsMarker As Integer, ByRef descriptors As array<HostMgd.EditorInput.PickPointDescriptor^>)
 Параметры
 Параметры
 Описание
 id
 Объект для выбора
 method
 Метод выбора
 gsMarker
 GS маркеры
 descriptors
 Описание образующих линию точек
 Описание
 Конструктор.
 Ссылки
 FenceSelectedObject Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!