Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptSelectionOptions.RejectObjectsFromNonCurrentSpace
 Послать отзыв
 Свойство определяет, будут ли отклоняться объекты, находящиеся вне текущего пространства (модель или лист), при операции выбора.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool RejectObjectsFromNonCurrentSpace { get; set; }
Копировать Код
Public Property RejectObjectsFromNonCurrentSpace As Boolean
 Возвращает
 Возвращает значение типа bool:
true — выбор объектов из других пространств (модель/лист) запрещён.
false — выбор объектов из любого пространства разрешён.
 Описание
 Свойство указывает, разрешено ли выбирать объекты, находящиеся в пространстве, отличном от текущего активного. Если свойство установлено в true, система отклоняет выбор объектов из других пространств — например, при работе в пространстве листа (Layout) нельзя выбрать объекты из модели, и наоборот. Если false — выбор объектов из других пространств разрешён.
 Это свойство особенно полезно при реализации команд, которые должны работать только в контексте текущего пространства чертежа, предотвращая случайное включение объектов из модели в листовых командах и наоборот.
 Условия
 Чтение и запись
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("PromptSelectionOptionsExample_RejectObjectsFromNonCurrentSpace")] public void PromptSelectionOptionsExample_RejectObjectsFromNonCurrentSpace() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создаём набор параметров для запроса PromptSelectionOptions options = new PromptSelectionOptions(); options.MessageForAdding = "Выберите линии для объединения:"; // Запретить выбор объектов из другого (не активного) пространства документа options.RejectObjectsFromNonCurrentSpace = true; // Фильтр: только объекты типа Line TypedValue[] filterList = new TypedValue[] { new TypedValue((int)DxfCode.Start, "LINE") }; SelectionFilter filter = new SelectionFilter(filterList); // Создаём запрос пользователю PromptSelectionResult result = editor.GetSelection(options, filter); // Если все данные введены, выводим результат в командную строку if (result.Status == PromptStatus.OK) { SelectionSet selSet = result.Value; editor.WriteMessage( $"\nВыбрано объектов: {selSet.Count}"); } else { editor.WriteMessage( "\nНе удалось получить выделение."); } } }
 Ссылки
 HostMgd.EditorInput.PromptSelectionOptions, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!