Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор PaletteSetMoveEventArgs.PaletteSetMoveEventArgs
 Послать отзыв
 This is PaletteSetMoveEventArgs, a member of class PaletteSetMoveEventArgs.
 Синтаксис
C#
Visual Basic
public PaletteSetMoveEventArgs(int x, int y);
Public Sub New(x As Integer, y As Integer)
 Ссылки
 PaletteSetMoveEventArgs Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!