Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Делегат HostMgd.Publishing.EndSheetEventHandler
 Послать отзыв
 This is type HostMgd::Publishing::EndSheetEventHandler.
 Синтаксис
C#
Visual Basic
public delegate EndSheetEventHandler();
Public Delegate Sub EndSheetEventHandler()
 Ваши комментарии по поводу этого топика: Послать отзыв!