Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод IConfigurationSection.ReadProperty
 Послать отзыв
 Синтаксис
C#
Visual Basic
System.Object ReadProperty(ref String name, ref System.Object defaultValue);
Function ReadProperty(ByRef name As String, ByRef defaultValue As System.Object) As System.Object
 Параметры
 Параметры
 Описание
 name
 Имя свойства
 defaultValue
 Значение по умолчанию, возвращаемое методом
 Описание
 Метод возвращает значение свойства с именем name. Если такого имени свойства нет, то должно быть возвращено значение defaultValue.
 Ссылки
 IConfigurationSection Интерфейс, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!