Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.Application.GetWhoHasInfo(System.String)
 Послать отзыв
 МЕТОД НЕ РЕАЛИЗОВАН. ВОЗВРАЩАЕТ NULL. Метод предоставляет доступ к информации о том, у кого открыт файл редактирования в nanoCAD.
 Синтаксис
C#
Visual Basic
Копировать Код
public static WhoHasInfo GetWhoHasInfo(string pathname);
Копировать Код
Public Shared Function GetWhoHasInfo(pathname As String) As WhoHasInfo
 Параметры
 Параметры
 Описание
 pathname
 Полный путь и имя файла чертежа. Тип string
 Возвращает
 Возвращаемый объект WhoHasInfo содержит ту же информацию, которая отображается командой WHOHAS.
 Описание
 Метод предоставляет информацию о том, у кого открыт файл редактирования в nanoCAD. Информация извлекается из DLL-файлов, которые создаются nanoCAD и управляются им.
 Ссылки
 HostMgd.ApplicationServices.Application, HostMgd.ApplicationServices Пространство имен
 Исключения
 MGD NOT_IMPLEMENTED
 Ваши комментарии по поводу этого топика: Послать отзыв!