Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.MediaBounds.LowerLeftPrintableArea
 Послать отзыв
 Свойство LowerLeftPrintableArea позволяет задать или получить точку левого нижнего угла области печати. Не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public Teigha.Geometry.Point2d LowerLeftPrintableArea;
Копировать Код
Public Property LowerLeftPrintableArea As Teigha.Geometry.Point2d
 Возвращает
 Возвращает точку левого нижнего угла области печати. Тип Teigha.Geometry.Point2d.
 Описание
 Свойство LowerLeftPrintableArea позволяет задать или получить точку левого нижнего угла области печати.
 В текущей версии не реализовано.
 Условия
 Чтение и запись.
 Ссылки
 HostMgd.PlottingServices.MediaBounds, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!