Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.Application.GetSystemVariable(String)
 Послать отзыв
 Метод предназначен для получения значения системной переменной.
 Синтаксис
C#
Visual Basic
Копировать Код
public static object GetSystemVariable(string name);
Копировать Код
Public Shared Function GetSystemVariable(name As String) As Object
 Параметры
 Параметры
 Описание
 name
 Имя системной переменной, для которой возвращается значение. Тип String
 Возвращает
 Значение системной переменной, тип object.
 Описание
 Метод находит в базе данных значение системной переменной, название которой было указано в параметре и возвращает его в формате object.
 Ссылки
 HostMgd.ApplicationServices.Application, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!