Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.Document.StatusBar
 Послать отзыв
 Свойство предоставляет доступ к строке состояния dwg-документа. Не реализовано
 Синтаксис
C#
Visual Basic
Копировать Код
public HostMgd.Windows.StatusBar StatusBar;
Public Property StatusBar() As HostMgd.Windows.StatusBar
 Возвращает
 Свойство возвращает объект - строку состояния dwg-документа. Тип HostMgd.Window.StatusBar
 Описание
 Свойство предоставляет доступ к строке состояния dwg-документа.
 Замечания
 Свойство не реализовано
 Условия
 Только чтение
 Ссылки
 HostMgd.ApplicationServices.Document, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!