Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.SelectionAddedEventArgs.Flags
 Послать отзыв
 Свойство возвращает признаки, предоставляющие информацию о контексте и режиме выполнения операции выбора объектов.
 Синтаксис
C#
Visual Basic
Копировать Код
public SelectionFlags Flags { get; }
Копировать Код
Public ReadOnly Property Flags As SelectionFlags
 Возвращает
 Возвращает значение типа SelectionFlags — побитовое перечисление флагов.
 Описание
 Свойство предоставляет доступ к перечислению SelectionFlags, которое содержит набор флагов, описывающих текущее состояние и режим операции выбора. Эти флаги позволяют определить, как именно пользователь выполняет выбор — например, добавляет объекты к существующей выборке, использует режим удаления, работает с ключевыми словами или применяет специальные условия.
 Условия
 Только чтение
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события SelectionAdded [Teigha.Runtime.CommandMethod("SelectionAddedExample_Flags")] public void SelectionAddedExample_Flags() { // Подписка на событие Rollover editor.SelectionAdded += OnSelectionAdded; } // Реализация отработки события SelectionAdded private void OnSelectionAdded(object sender, SelectionAddedEventArgs e) { // Получаем доступ к флагам выбора HostMgd.EditorInput.SelectionFlags flags = e.Flags; // Если есть флаг выбора подобъектов, выводим сообщение в командную строку if ((flags & HostMgd.EditorInput.SelectionFlags.SubSelection) == HostMgd.EditorInput.SelectionFlags.SubSelection) { editor.WriteMessage("\nВыбираются подобъекты."); } } }
 Ссылки
 HostMgd.EditorInput.SelectionAddedEventArgs, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!