Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices
 Послать отзыв
 Пространство имен HostMgd.PlottingServices включает классы, структуры и перечисления, предназначенные для работы с объектами службы печати nanoCAD.
 Описание
 Пространство имен HostMgd.PlottingServices включает классы, перечисления и делегаты, предназначенные для работы с объектами службы печати nanoCAD.
 Классы
 Имя
 Описание
 BeginDocumentEventArgs
 Класс BeginDocumentEventArgs представляет данные для события PlotReactorManager.BeginDocument, возникающего в процессе вывода на печать.
 BeginPageEventArgs
 Класс BeginPageEventArgs инкапсулирует необходимую для события BeginPage информацию, относящуюся к выводу на печать.
 BeginPlotEventArgs
 Класс BeginPlotEventArgs инкапсулирует необходимую для события BeginPlot информацию, относящуюся к выводу на печать.
 DsdData
 Класс DsdData реализует чтение и запись DSD-файлов, включает коллекцию объектов DSDEntry, а также DSD-данные о подшивке. Не реализован.
 DsdEntry
 Класс DsdEntry представляет информацию для настройки публикации листа в составе подшивки листов. В текущей версии не реализован.
 DsdEntryCollection
 Класс DsdEntryCollection представляет коллекцию объектов HostMgd.PlottingServices.DsdEntry.
 Dwf3dOptions
 Класс Dwf3dOptions представляет опции публикации в формате 3D DWF.
 EndDocumentEventArgs
 Класс EndDocumentEventArgs инкапсулирует информацию, относящуюся к выводу документа на печать, которая необходима для события PlotReactorManager.EndDocument.
 EndPageEventArgs
 Класс EndPageEventArgs предоставляет данные, специфичные для вывода листа на печать и необходимые для события PlotReactorManager.EndPage.
 EndPlotEventArgs
 Класс EndPlotEventArgs предоставляет данные, специфичные для вывода чертежа на печать и необходимые для события PlotReactorManager.EndPlot.
 HostAppServices
 Класс HostAppServices определяет интерфейс для базовых сервисов вывода на печать.
 PlotConfig
 Класс PlotConfig представляет описание установленного в системе устройства или РС3 файла. Не реализован.
 PlotConfigInfo
 Облегчённый класс, содержащий основную информацию об устройстве вывода.
 PlotConfigInfoCollection
 Класс PlotConfigInfoCollection представляет коллекцию объектов PlotConfigInfo.
 PlotConfigManager
 Класс реализует доступ к конфигурациям печати, таблицам стилей печати, устройствам и PC3 файлам, установленным в системе.
 PlotEngine
 Основной класс производства печати Приложение использует интерфейс этого класса для печати одного или нескольких документов на устройстве печати или в файл.
 PlotFactory
 Класс реализующий ряд статических методов и свойств характеризующих текущее состояние печати
 PlotInfo
 Сервисный класс, который предоставляет свойства, определяющие печать.
 PlotInfoValidator
 Класс PlotInfoValidator отвечает за формирование набора индикаторов возможных конфликтов при слиянии относящихся к печати настроек из таких объектов как слой, PlotSettings и переопределения устройства вывода, и помогает избежать ошибок, связанных с некорректной конфигурацией печати.
 PlotLogger
 Обычно экземпляр класса получается посредством статического свойства PlotLogger класса HostAppServices.
 PlotPageInfo
 Класс PlotPageInfo предоставляет информацию об объектах, содержащихся на печатаемой странице.
 PlotProgress
 PlotProgressDialog
 Класс реализующий интерфейс визуализации процесса печати.
 PlotReactorManager
 Класс менеджера событий печати.
 PreviewEndPlotInfo
 Класс PreviewEndPlotInfo представляет результаты предварительного просмотра операции вывода на печать. Не реализован.
 Ссылки
 Классы, Перечисления, Структуры, Делегаты
 Ваши комментарии по поводу этого топика: Послать отзыв!