Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор EPlotResource.EPlotResource (System::String^, System::String^, System::String^)
 Послать отзыв
 This is EPlotResource, a member of class EPlotResource.
 Синтаксис
C#
Visual Basic
public EPlotResource(ref System.String role, ref System.String mime, ref System.String path);
Public Sub New(ByRef role As System.String, ByRef mime As System.String, ByRef path As System.String)
 Ссылки
 EPlotResource Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!