Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PublishSheetEventArgs.PlotRotation
 Послать отзыв
 This is PlotRotation, a member of class PublishSheetEventArgs.
 Синтаксис
C#
Visual Basic
public Teigha::DatabaseServices::PlotRotation PlotRotation;
Public Property PlotRotation() As Teigha.DatabaseServices.PlotRotation
 Ссылки
 PublishSheetEventArgs Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!