Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.InputPointContext
 Послать отзыв
 Класс предоставляет контекстные данные для событий фильтрации и мониторинга ввода точки в nanoCAD.
 Иерархия классов
HostMgd::EditorInput::InputPointContext
 Синтаксис
C#
Visual Basic
Копировать Код
public class InputPointContext : System.IDisposable;
Копировать Код
Public Class InputPointContext Inherits System.IDisposable
 Описание
 Класс используется в .NET API nanoCAD для передачи дополнительной информации при обработке событий, связанных с интерактивным вводом точки — таких как PointFilter и PointMonitor. Он содержит параметры, описывающие текущее состояние операции ввода.
 Класс позволяет разработчику корректно обрабатывать и модифицировать точку ввода с учётом текущего контекста чертежа — например, выполнять фильтрацию, корректировку или визуальную подсказку с учётом активной ПСК, проекции или привязок.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class InputPointContextExamples { // Метод команды, которая проверяет контекст ввода точки [Teigha.Runtime.CommandMethod("InputPointContextExample")] public void InputPointContextExample() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Метод для отработки события редактора PointMonitor editor.PointMonitor += (sender, e) => { // Сохраняем контекст события в преременную InputPointContext context = e.Context; // Сохраняем контекст видового экрана в переменную var viewport = e.Context.DrawContext.Viewport; // Преобразуем координаты точки, в которой находится курсор // из мировой системы координат в текущую пользовательскую if (context != null) { Point3d wcsPoint = context.RawPoint; Point3d ucsPoint = wcsPoint.TransformBy(viewport.WorldToEyeTransform); // Выводим в командную строку преобразованные координаты editor.WriteMessage($"\nТочка в ПСК: {ucsPoint}"); } }; } }
 Топики
 Имя
 Описание
 InputPointContext Методы
 Ниже перечислены методы класса InputPointContext.
 InputPointContext Свойства
 Ниже перечислены свойства класса InputPointContext.
 Ссылки
 InputPointContext Методы, InputPointContext Свойства, Топики, InputPointContext Методы, InputPointContext Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!