Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Перечисление HostMgd.EditorInput.SelectionMode
 Послать отзыв
 Синтаксис
C#
Visual Basic
public enum SelectionMode { All = 6, Box = 3, CrossingSelectionMode = 2, CrossingPolygon = 8, Entity = 5, Every = 11, Extents = 12, FencePolyline = 7, Group = 13, Last = 4, Multiple = 15, Pick = 10, Previous = 14, Window = 1, WindowPolygon = 9 }
Public Enum SelectionMode All = 6 Box = 3 CrossingSelectionMode = 2 CrossingPolygon = 8 Entity = 5 Every = 11 Extents = 12 FencePolyline = 7 Group = 13 Last = 4 Multiple = 15 Pick = 10 Previous = 14 Window = 1 WindowPolygon = 9 End Enum
 Члены
 Члены
 Описание
 All
 Выбор всех
 CrossingPolygon
 Выбор пересечением с многоугольником
 Entity
 По точному имени геометрического объекта
 Every
 Каждый геометрический объект по единственному указателю
 FencePolyline
 Выбор путём указания точки на теле геометрического объекта
 Group
 Групповой выбор
 Last
 Последний
 Pick
 Единственный указатель
 Previous
 Предыдущий
 Window
 Выбор окном
 WindowPolygon
 Выбор по включению в многоугольник
 Описание
 Это перечисление содержит режим настроек процесса выбора геометрических объектов. ,ти настройки используются методами, которые обеспечивают проверку ошибки в выборе геометрического подобъекта.
 Члены перечисления
 Описание
 All = 6
 Выбор всех
 Box = 3
 Crossing = 2
 Выбор пересечением с окном
 CrossingPolygon = 8
 Выбор пересечением с многоугольником
 Entity = 5
 По точному имени геометрического объекта
 Every = 11
 Каждый геометрический объект по единственному указателю
 Extents = 12
 FencePolyline = 7
 Выбор путём указания точки на теле геометрического объекта.
 Group = 13
 Групповой выбор
 Last = 4
 Последний
 Pick = 10
 Единственный указатель
 Previous = 14
 Предыдущий
 Window = 1
 Выбор окном
 WindowPolygon = 9
 Выбор по включению в многоугольник
 Ваши комментарии по поводу этого топика: Послать отзыв!