Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство StatusBarItem.Visible
 Послать отзыв
 This is Visible, a member of class StatusBarItem.
 Синтаксис
C#
Visual Basic
public bool Visible;
Public Property Visible() As bool
 Ссылки
 StatusBarItem Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!