Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Перечисление HostMgd.Windows.StateEventIndex
 Послать отзыв
 This is record HostMgd::Windows::StateEventIndex.
 Синтаксис
C#
Visual Basic
public enum StateEventIndex { Hide = 0, Show = 1, ThemeChange = 4 }
Public Enum StateEventIndex Hide = 0 Show = 1 ThemeChange = 4 End Enum
 Ваши комментарии по поводу этого топика: Послать отзыв!