Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство KeywordCollection.Count
 Послать отзыв
 Синтаксис
C#
Visual Basic
public int Count;
Public Property Count() As Integer
 Описание
 Возвращает количество элементов, содержащихся в коллекции.
 Условия
 На чтение
 Ссылки
 KeywordCollection Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!