Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство EPlotPropertyCollection.IsSynchronized
 Послать отзыв
 This is IsSynchronized, a member of class EPlotPropertyCollection.
 Синтаксис
C#
Visual Basic
public bool IsSynchronized;
Public Property IsSynchronized() As bool
 Ссылки
 EPlotPropertyCollection Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!