Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.Windows.ToolPalette.CustomToolBase.GetContextMenu
 Послать отзыв
 Метод позволяет получить пользовательское контекстное меню, связанное с пользовательским инструментом на панели инструментов. Не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual UInt32 GetContextMenu( int contextFlag, UInt32 menu, UInt32 idCommandFirst, UInt32 idCommandLast );
Копировать Код
Public Overridable Function GetContextMenu( contextFlag As Integer, menu As UInt32, idCommandFirst As UInt32, idCommandLast As UInt32 ) As UInt32
 Параметры
 Параметры
 Описание
 contextFlag
 Указывает контекст, в котором запрашивается меню. Тип int. Контекст определяет, где именно щёлкнул мышью пользователь: на иконке инструмента, на пустом месте панели инструментов, на группе выделенных инструментов и т.д.
 menu
 Дескриптор стандартного контекстного меню Windows (HMENU). Тип UInt32.
 idCommandFirst
 Нижняя граница для идентификаторов команд (ID), которые можно использовать для новых пунктов меню. Тип UInt32. Значение не должно конфликтовать с диапазоном идентификаторов, зарезервированных платформой nanoCAD для системных команд.
 idCommandLast
 Верхняя граница для идентификаторов команд (ID), которые можно использовать для новых пунктов меню. Тип UInt32. Значение не должно конфликтовать с диапазоном идентификаторов, зарезервированных платформой nanoCAD для системных команд.
 Возвращает
 Возвращает значение, определяющее итог операции. Тип UInt32.
 Описание
 Метод позволяет получить пользовательское контекстное меню, связанное с пользовательским инструментом на панели инструментов, и вызывается перед отображением контекстного меню.
 Меню menu предварительно заполняется стандартными пунктами меню, применимыми в данном контексте. Соответственно, пользовательский инструмент может донастроить контекстное меню, добавляя туда собственные команды и при необходимости удаляя ненужные стандартные.
 Идентификаторы добавляемых в меню команд должны находиться в диапазоне от idCommandFirst до idCommandLast, чтобы исключить конфликт с идентификаторами стандартных команд. Любые пользовательские пункты меню должны использовать ID в диапазоне: idCommandFirst .. idCommandLast.
 Когда пользователь выбирает команду, добавленную пользовательским инструментом, вызывается метод InvokeCommand() с переданным ему идентификатором команды, что позволяет инструменту обработать команду.
 В текущей версии не реализован.
 Ссылки
 HostMgd.Windows.ToolPalette.CustomToolBase, HostMgd.Windows.ToolPalette
 Ваши комментарии по поводу этого топика: Послать отзыв!