Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptSelectionOptionsEventArgs
 Послать отзыв
 Класс предоставляет данные для события PromptingForSelection, позволяя настроить параметры операции выбора объектов перед её началом.
 Иерархия классов
HostMgd::EditorInput::PromptSelectionOptionsEventArgs
 Синтаксис
C#
Visual Basic
Копировать Код
public sealed class PromptSelectionOptionsEventArgs : EventArgs
Копировать Код
Public NotInheritable Class PromptSelectionOptionsEventArgs Inherits EventArgs
 Описание
 Класс используется для передачи параметров, применяемых при начале интерактивной операции выбора объектов — например, при вызове метода GetSelection(). Он предоставляет доступ к объекту PromptSelectionOptions, содержащему настройки команды выборки, такие как:
текст приглашения (Message),
режим выбора (SelectionMode),
разрешение на пустой ввод (AllowNone),
ключевые слова (Keywords),
ограничения и фильтры выборки .
 Этот класс применяется в обработчике события PromptingForSelection, где разработчик может динамически изменять параметры выбора в зависимости от контекста — например, задать подсказку, включить режим выбора "Все" или добавить пользовательские команды.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события PromptingForSelection [Teigha.Runtime.CommandMethod("PromptingForSelectionExample")] public void PromptingForSelectionExample() { // Подписка на событие PromptingForSelection editor.PromptingForSelection += OnEditorPromptingForSelection; } // Реализация отработки события PromptingForSelection private void OnEditorPromptingForSelection(object sender, PromptSelectionOptionsEventArgs e) { // Изменение текста приглашения e.Options.MessageForAdding = "Выберите объект для обработки:"; // Разрешить выбор только одного объекта e.Options.SingleOnly = true; // Добавление ключевых слов e.Options.Keywords.Add("Все"); e.Options.Keywords.Add("Фильтр"); } }
 Топики
 Имя
 Описание
 PromptSelectionOptionsEventArgs Методы
 Ниже перечислены методы класса PromptSelectionOptionsEventArgs.
 PromptSelectionOptionsEventArgs Свойства
 Ниже перечислены свойства класса PromptSelectionOptionsEventArgs.
 Ссылки
 PromptSelectionOptionsEventArgs Методы, PromptSelectionOptionsEventArgs Свойства, Топики, PromptSelectionOptionsEventArgs Методы, PromptSelectionOptionsEventArgs Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!