Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptForEntityEndingEventHandler(object,PromptForEntityEndingEventArgs)
 Послать отзыв
 Делегат предназначен для обработки события, возникающего при завершении операции выбора геометрического объекта в редакторе nanoCAD.
 Синтаксис
C#
Visual Basic
Копировать Код
public delegate void PromptForEntityEndingEventHandler(object sender, PromptForEntityEndingEventArgs e);
Копировать Код
Public Delegate Sub PromptForEntityEndingEventHandler(sender As Object, e As PromptForEntityEndingEventArgs)
 Параметры
 Параметры
 Описание
 sender
 Источник события — обычно экземпляр редактора (Editor), в контексте которого происходил выбор объекта. Тип object
 e
 Объект, содержащий данные о завершающейся операции выбора:
 Описание
 Делегат используется как тип метода-обработчика для события PromptForEntityEnding, которое происходит после того, как пользователь выбрал объект, но до окончательной фиксации выбора. Это позволяет разработчику получить доступ к результату выборки и выполнить дополнительные действия — например, проверить допустимость выбранного объекта, изменить его параметры или отменить выбор. Делегат предоставляет доступ к событию через объект PromptForEntityEndingEventArgs, содержащий информацию о выбранном объекте и статусе операции.
 Замечания
 Этот делегат особенно полезен при разработке интерактивных команд или надстроек, где требуется контролировать процесс выбора объектов перед тем, как он будет окончательно применён.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события PromptForEntityEnding [Teigha.Runtime.CommandMethod("PromptForEntityEndingExample")] public void PromptForEntityEndingExample() { // Подписка на событие PromptForEntityEnding editor.PromptForEntityEnding += OnEditorPromptForEntityEnding; } // Реализация отработки события PromptForEntityEnding private void OnEditorPromptForEntityEnding(object sender, PromptForEntityEndingEventArgs e) { if (!e.Result.ObjectId.IsNull) { // Вывод сообщения в командную строку editor.WriteMessage( $"\nВыбран объект: {e.Result.ObjectId.ObjectClass.Name}"); } } }
 Ваши комментарии по поводу этого топика: Послать отзыв!