Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод UserConfigurationManager.OpenGlobalSection
 Послать отзыв
 This is OpenGlobalSection, a member of class UserConfigurationManager.
 Синтаксис
C#
Visual Basic
public HostMgd::ApplicationServices::IConfigurationSection OpenGlobalSection();
Public Function OpenGlobalSection() As HostMgd.ApplicationServices.IConfigurationSection
 Ссылки
 UserConfigurationManager Класс, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!