Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.LongTransactionManager.CheckingOut
 Послать отзыв
 Событие CheckingOut возникает перед началом выгрузки объектов в длительную транзакцию (операция CheckOut). В текущей версии не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public event LongTransactionEventHandler CheckingOut;
Копировать Код
Public Event CheckingOut As LongTransactionEventHandler
 Описание
 Событие CheckingOut возникает перед началом выгрузки объектов в длительную транзакцию (операция CheckOut). Позволяет выполнить предварительную обработку или отменить операцию.
 В текущей версии не реализовано.
 Ссылки
 HostMgd.ApplicationServices.LongTransactionManager, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!