Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Класс HostMgd.Windows.Palette
 Послать отзыв
 This is class HostMgd::Windows::Palette.
 Иерархия классов
HostMgd::Windows::Palette
 Синтаксис
C#
Visual Basic
[Wrapper("hostUiPalette")] public class Palette;
<Wrapper("hostUiPalette")> Public Class Palette
 Топики
 Имя
 Описание
 Palette Свойства
 Ниже перечислены свойства класса Palette.
 Ссылки
 Palette Свойства, Топики, Palette Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!