Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptKeywordOptions.AllowNone
 Послать отзыв
 Свойство определяет, разрешён ли ввод без указания значения — только нажатием клавиши Enter.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool AllowNone { get; set; }
Копировать Код
Public Property AllowNone As Boolean
 Возвращает
 Возвращает значение типа bool:
true — завершение ввода нажатием Enter разрешено.
false — требуется обязательный выбор или ввод.
 Описание
 Свойство позволяет указать, может ли пользователь завершить операцию ввода ключевого слова простым нажатием Enter , не выбирая ни одного из предложенных вариантов. Если свойство установлено в true, такая возможность разрешена, и статус результата будет PromptStatus.None. Если false — пользователь обязан выбрать ключевое слово или ввести допустимое значение.
 Условия
 Чтение и запись
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("PromptKeywordOptionsExample_AllowNone")] public void PromptKeywordOptionsExample_AllowNone() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создаём запрос пользователю PromptKeywordOptions options = new PromptKeywordOptions("Выберите тип объекта [Круг/Прямоугольник/Линия]:"); // Разрешить нажатие Enter без выбора options.AllowNone = true; // Вызываем метод GetKeywords() для запроса пользователю PromptResult result = editor.GetKeywords(options); // Если все данные введены, выводим результат в командную строку if (result.Status == PromptStatus.OK || result.Status == PromptStatus.None) { if (result.StringResult != null) editor.WriteMessage($"\nВыбрано: {result.StringResult}"); else editor.WriteMessage("\nИспользовано значение по умолчанию."); } else { editor.WriteMessage("\nОперация отменена."); } } }
 Ссылки
 HostMgd.EditorInput.PromptKeywordOptions, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!