Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PaletteSet.Location
 Послать отзыв
 Местоположение окна в системе экранных координат
 Синтаксис
C#
Visual Basic
public System.Drawing.Point Location;
Public Property Location() As System.Drawing.Point
 Ссылки
 PaletteSet Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!