Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.InplaceTextEditor.UndoRecordingDisabled
 Послать отзыв
 Свойство UndoRecordingDisabled позволяет включать и выключать режим записи отмены действий. В текущей версии не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool UndoRecordingDisabled;
Копировать Код
Public Property UndoRecordingDisabled As Boolean
 Возвращает
 Возвращает true, если запись отмены действий отключена. В противном случае возвращает false.
 Описание
 Свойство UndoRecordingDisabled позволяет включать и выключать в редакторе режим записи отмены действий. В текущей версии не реализовано.
 Условия
 Чтение и запись.
 Ссылки
 HostMgd.ApplicationServices.InplaceTextEditor, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!