Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.Windows.ToolPalette.CustomToolBase.DropCallback
 Послать отзыв
 Метод определяет реакцию приложения, когда пользователь завершает операцию перетаскивания объекта чертежа из редактора nanoCAD на панель инструментов. Не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual bool DropCallback( ref Teigha.DatabaseServices.Entity entity );
Копировать Код
Public Overridable Function DropCallback( ByRef entity As Teigha.DatabaseServices.Entity ) As Boolean
 Параметры
 Параметры
 Описание
 entity
 Входной объект чертежа. Тип Teigha.DatabaseServices.Entity.
 Возвращает
 Возвращает true, если операция перетаскивания была успешно обработана. В противном случае возвращает false.
 Описание
 Метод предоставляет возможность задать реакцию приложения, когда пользователь завершает операцию перетаскивания (Drag-and-Drop) объекта чертежа entity из редактора nanoCAD на панель инструментов. Метод позволяет реализовать дополнительную обработку объекта entity, например, изменить его свойства, атрибуты или, например, выполнить необходимые проверки.
 В текущей версии не реализован.
 Замечания
 Метод вызывается после перетаскивания объекта на панель, но до завершения транзакции, что позволяет изменить свойства объекта, если это допустимо.
 Ссылки
 HostMgd.Windows.ToolPalette.CustomToolBase, HostMgd.Windows.ToolPalette
 Ваши комментарии по поводу этого топика: Послать отзыв!