Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 JigPrompts.AcquirePoint(String)
 Послать отзыв
 Метод запрашивает у пользователя точку, используя в запросе приглашающее сообщение.
 Синтаксис
C#
Visual Basic
public HostMgd.EditorInput.PromptPointResult AcquirePoint(ref System.String message);
Public Function AcquirePoint(ByRef message As System.String) As HostMgd.EditorInput.PromptPointResult
 Параметры
 Параметры
 Описание
 message
 Текстовое сообщение, приглашающее выбрать точку для дальнейших действий с объектом или группой объектов. Сообщение будет выводиться на экране во время работы метода.
 Возвращает
 Возвращает результат типа Point3d, полученный либо из текущего положения курсора мыши и значений настроек, выбранных пользователем, либо посредством ввода координат точки с клавиатуры.
 Описание
 Метод предназначен для запроса у пользователя точки с приглашающим сообщением. В основном применяется для интерактивного перемещения объекта или группы объектов из одной точки в другую. После вызова создает экземпляр класса JigPromptPointOptions, присваивает его свойству Message значение параметра message и вызывает свою перегрузку JigPrompts.AcquirePoint(JigPromptPointOptions options).
 Пример
 В примере приведен отрывок кода из реализации метода Sampler() класса Jig.
C#
 Копировать Код
 PromptPointResult result = prompts.AcquirePoint("Точка:");
Visual Basic
 Копировать Код
 Dim result As PromptPointResult = prompts.AcquirePoint("Точка:")
 Ссылки
 JigPrompts Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!