Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.Application.IsFileLocked(String)
 Послать отзыв
 МЕТОД НЕ РЕАЛИЗОВАН. ВСЕГДА ВОЗВРАЩАЕТ FALSE. Метод проверяет, доступен ли указанный файл.
 Синтаксис
C#
Visual Basic
Копировать Код
public static bool IsFileLocked(string pathname);
Копировать Код
Public Shared Function IsFileLocked(pathname As String) As Boolean
 Параметры
 Параметры
 Описание
 pathname
 Полный путь к файлу. Тип String
 Возвращает
 Тип bool: true - файл доступен, false - файл недоступен.
 Описание
 Метод проверяет, доступен ли указанный файл.
 Ссылки
 HostMgd.ApplicationServices.Application, HostMgd.ApplicationServices Пространство имен
 Исключения
 MGD NOT_IMPLEMENTED
 Ваши комментарии по поводу этого топика: Послать отзыв!