Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.PlotInfoValidator.PrintableBoundsWeight
 Послать отзыв
 Свойство PrintableBoundsWeight представляет весовой коэффициент для границ области печати, установленной в конфигурации печати.
 Синтаксис
C#
Visual Basic
Копировать Код
public int PrintableBoundsWeight;
Копировать Код
Public Property PrintableBoundsWeight As Integer
 Возвращает
 Возвращает весовой коэффициент для границ области печати. Тип int.
 Описание
 Свойство PrintableBoundsWeight представляет весовой коэффициент для границ области печати в конфигурации печати, связанной с объектом PlotInfo.
 Замечания
 См. описание свойства MediaMatchingThreshold.
 Условия
 Чтение и запись.
 Ссылки
 HostMgd.PlottingServices.PlotInfoValidator, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!