Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство JigPromptOptions.Cursor
 Послать отзыв
 Тип курсора, используемый в приглашении.
 Синтаксис
C#
Visual Basic
public HostMgd.EditorInput.CursorType Cursor;
Public Property Cursor() As HostMgd.EditorInput.CursorType
 Возвращает
 Возвращает тип выбранного курсора.
 Описание
 Свойство предназначено для определения внешнего вида курсора при запросе во время использования технологии Jig. Внешний вид курсора определяется одним из элементов перечисления CursorType.
 Условия
 Чтение и запись.
 Ссылки
 JigPromptOptions Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!