Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.ViewportIdFromNumber(int)
 Послать отзыв
 Метод возвращает идентификатор видового экрана по его номеру в текущем чертеже.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectId ViewportIdFromNumber(int viewportNumber);
Копировать Код
Public Function ViewportIdFromNumber(viewportNumber As Integer) As ObjectId
 Параметры
 Параметры
 Описание
 viewportNumber
 Номер видового экрана (начиная с 1), для которого необходимо получить идентификатор. Тип int.
 Возвращает
 Возвращает значение типа ObjectId, представляющее собой ссылку на объект видового экрана в базе данных чертежа. Если видовой экран с указанным номером не найден, возвращается ObjectId.Null.
 Описание
 Метод используется для получения идентификатора (ObjectId) видового экрана, который соответствует указанному номеру. Номер видового экрана определяется в порядке их создания в пространстве листа (paper space). Этот метод позволяет программно обращаться к конкретным видовым экранам для изменения их параметров или управления отображением.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("ViewportIdFromNumberExample")] public void ViewportIdFromNumberExample() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Вызываем метод ObjectId vpId = editor.ViewportIdFromNumber(1); // Вывод сообщения в командной строке if (!vpId.IsNull) { editor.WriteMessage( $"\nИдентификатор видового экрана №1: {vpId}"); } else { editor.WriteMessage( "\nВидовой экран с таким номером не найден."); } } }
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!