Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.Application.ShowModelessWindow(IntPtr,System.Windows.Window)
 Послать отзыв
 Метод предназначен для вызова WPF-формы с указанным окном-владельцем в немодальном режиме.
 Синтаксис
C#
Visual Basic
Копировать Код
public static void ShowModelessWindow(IntPtr owner, System.Windows.Window formToShow);
Копировать Код
Public Shared Sub ShowModelessWindow(owner As IntPtr, formToShow As System.Windows.Window)
 Параметры
 Параметры
 Описание
 owner
 Окно владельца диалога
 formToShow
 Форма, которая должна быть показана
 Описание
 Метод вызывает WPF-форму в немодальном режиме, для которой указано окно-владелец.
 Ссылки
 HostMgd.ApplicationServices.Application, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!