Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.GetDouble(PromptDoubleOptions)
 Послать отзыв
 Метод позволяет пользователю ввести числовое значение с возможностью настройки параметров ввода и возвращает результат в виде объекта PromptDoubleResult.
 Синтаксис
C#
Visual Basic
Копировать Код
public PromptDoubleResult GetDouble(PromptDoubleOptions options);
Копировать Код
Public Function GetDouble(options As PromptDoubleOptions) As PromptDoubleResult
 Параметры
 Параметры
 Описание
 options
 Объект, содержащий параметры ввода числа:
 Возвращает
 Возвращает объект типа PromptDoubleResult, который содержит:
Status — статус операции (OK, Cancel, Error и др.).
Value — числовое значение (double), если ввод был успешным.
StringResult — строковое представление введённого значения или ключевого слова.
 Описание
 Метод используется для интерактивного ввода пользователем вещественного числа через командную строку. Позволяет задать ограничения на ввод (например, минимальное и максимальное значение), установить начальное значение по умолчанию и настроить сообщения приглашения. Метод предоставляет гибкий способ получения числовых данных от пользователя с поддержкой проверки корректности ввода.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("GetDoubleExample_PromptDoubleOptions")] public void GetDoubleExample_PromptDoubleOptions() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создаём запрос пользователю PromptDoubleOptions options = new PromptDoubleOptions("\nВведите значение масштаба:"); options.DefaultValue = 1.0; options.UseDefaultValue = true; PromptDoubleResult result = editor.GetDouble(options); // Если все данные введены, выводим результат в командную строку if (result.Status == PromptStatus.OK) { double scale = result.Value; editor.WriteMessage( $"\nЗначение масштаба: {scale}"); } } }
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!