Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PublishEntityEventArgs.EffectiveBlockLayerId
 Послать отзыв
 This is EffectiveBlockLayerId, a member of class PublishEntityEventArgs.
 Синтаксис
C#
Visual Basic
public ObjectId EffectiveBlockLayerId;
Public Property EffectiveBlockLayerId() As ObjectId
 Ссылки
 PublishEntityEventArgs Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!