Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.TransactionManager.TransactionManager
 Послать отзыв
 Конструктор.
 Синтаксис
C#
Visual Basic
Копировать Код
public TransactionManager( IntPtr unmanagedPointer, bool autoDelete );
Копировать Код
Public Sub New( TransactionManager As IntPtr, autoDelete As Boolean )
 Параметры
 Параметры
 Описание
 autoDelete
 Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.
 TransactionManager
 Неуправляемый указатель на исходный объект. Тип IntPtr.
 Описание
 Конструктор.
 Ссылки
 TransactionManager Класс, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!