Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Перечисление HostMgd.Windows.SaveFileDialogFlags
 Послать отзыв
 This is record HostMgd::Windows::SaveFileDialogFlags.
 Синтаксис
C#
Visual Basic
public enum SaveFileDialogFlags { AllowAnyExtension = 4, DefaultIsFolder = 0x10, DoNotTransferRemoteFiles = 0x40, DoNotWarnIfFileExist = 0x20, ForceDefaultFolder = 0x100, NoFtpSites = 0x200, NoShellExtensions = 0x400, NoUrls = 0x80 }
Public Enum SaveFileDialogFlags AllowAnyExtension = 4 DefaultIsFolder = &H10 DoNotTransferRemoteFiles = &H40 DoNotWarnIfFileExist = &H20 ForceDefaultFolder = &H100 NoFtpSites = &H200 NoShellExtensions = &H400 NoUrls = &H80 End Enum
 Ваши комментарии по поводу этого топика: Послать отзыв!