Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptSelectionOptions.MessageForRemoval
 Послать отзыв
 Свойство возвращает или устанавливает сообщение, отображаемое при удалении объектов из текущего набора выбора.
 Синтаксис
C#
Visual Basic
Копировать Код
public string MessageForRemoval { get; set; }
Копировать Код
Public Property MessageForRemoval As String
 Возвращает
 Возвращает строку (string), отображаемую в командной строке при режиме удаления объектов из выборки. Если значение null или пустое — используется Message или сообщение по умолчанию. Если задано — активируется только при включении режима Remove (например, при вводе ключевого слова "Удалить").
 Описание
 Свойство предназначено для задания текста приглашения, который выводится в командной строке, когда пользователь находится в режиме удаления объектов из выборки — например, при использовании опции Remove в интерактивной команде выбора.
 Это позволяет улучшить пользовательский интерфейс, предоставляя понятную инструкцию: например, "Выберите объекты для удаления из выборки:" или "Щелкните, чтобы исключить объекты".
 Условия
 Чтение и запись
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("PromptSelectionOptionsExample_MessageForRemoval")] public void PromptSelectionOptionsExample_MessageForRemoval() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создаём набор параметров для запроса PromptSelectionOptions options = new PromptSelectionOptions(); options.MessageForAdding = "Выберите линии для объединения:"; options.MessageForRemoval = "Выберите объекты для исключения из выборки:"; // Фильтр: только объекты типа Line TypedValue[] filterList = new TypedValue[] { new TypedValue((int)DxfCode.Start, "LINE") }; SelectionFilter filter = new SelectionFilter(filterList); // Создаём запрос пользователю PromptSelectionResult result = editor.GetSelection(options, filter); // Если все данные введены, выводим результат в командную строку if (result.Status == PromptStatus.OK) { SelectionSet selSet = result.Value; editor.WriteMessage( $"\nВыбрано объектов: {selSet.Count}"); } else { editor.WriteMessage( "\nНе удалось получить выделение."); } } }
 Ссылки
 HostMgd.EditorInput.PromptSelectionOptions, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!