Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptPointResult.ToString(IFormatProvider)
 Послать отзыв
 Метод возвращает строковое представление точки, введённой пользователем, с учётом локализации и форматирования, заданного провайдером.
 Синтаксис
C#
Visual Basic
Копировать Код
public sealed override string ToString(IFormatProvider provider);
Копировать Код
Public NotOverridable Overrides Function ToString(provider As IFormatProvider) As String
 Параметры
 Параметры
 Описание
 provider
 Объект, предоставляющий информацию о правилах форматирования чисел и дат — например, CultureInfo.InvariantCulture для форматирования через точку как десятичный разделитель. Тип IFormatProvider
 Возвращает
 Возвращает значение типа string, представляющее собой текстовое отображение точки в формате (X, Y, Z), где X, Y и Z — координаты точки в мировой системе (WCS), отформатированные с использованием переданного provider. Примеры:
Без указания провайдера: (100,50; 200,75; 0,00)
С CultureInfo.InvariantCulture: (100.50, 200.75, 0.00)
Если операция выбора точки была отменена или завершена ошибкой, может вернуть пустую строку или специальное сообщение.
 Описание
 Метод переопределяет стандартный метод и предоставляет возможность отформатировать координаты точки (Point3d) с учётом текущих региональных настроек или указанного объекта IFormatProvider. Это позволяет корректно отображать числовые значения с нужным разделителем (точкой или запятой), а также учитывать системные настройки пользователя при выводе результата операции ввода точки. Метод используется, например, при отладке, логировании или отображении информации в командной строке nanoCAD.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("PromptPointResultExample_ToString_IFormatProvider")] public void PromptPointResultExample_ToString_IFormatProvider() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создаём запрос пользователю PromptPointOptions options = new PromptPointOptions("nУкажите точку:"); options.BasePoint = new Point3d(0, 0, 0); // Вызов метода GetPoint() для запроса пользователю PromptPointResult result = editor.GetPoint(options); // Если все данные введены, выводим результат в командную строку if (result.Status == PromptStatus.OK) { string formattedPoint = result.ToString(CultureInfo.InvariantCulture); editor.WriteMessage($"\nТочка: {formattedPoint}"); } else { editor.WriteMessage( "\nВвод точки отменен или произошла ошибка."); } } }
 Ссылки
 HostMgd.EditorInput.PromptPointResult, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!