Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор EntityJig.EntityJig
 Послать отзыв
 Конструктор класса EntityJig
 Синтаксис
C#
Visual Basic
public EntityJig(ref DatabaseServices.Entity entity);
Public Sub New(ByRef entity As DatabaseServices.Entity)
 Параметры
 Параметры
 Описание
 entity
 Пользовательский примитив
 Описание
 Конструктор класса EntityJig
 Ссылки
 EntityJig Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!