Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Класс HostMgd.ApplicationServices.DocumentCollectionEventArgs
 Послать отзыв
 Иерархия классов
HostMgd::ApplicationServices::DocumentCollectionEventArgs
 Синтаксис
C#
Visual Basic
public class DocumentCollectionEventArgs : System.EventArgs;
Public Class DocumentCollectionEventArgs Inherits System.EventArgs
 Описание
 Класс, обеспечивающий данными различные события класса DocumentCollection.
 Топики
 Имя
 Описание
 DocumentCollectionEventArgs Свойства
 Ниже перечислены свойства класса DocumentCollectionEventArgs.
 Ссылки
 DocumentCollectionEventArgs Свойства, Топики, DocumentCollectionEventArgs Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!