Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PaletteSet.Name
 Послать отзыв
 Имя набора палитр.
 Синтаксис
C#
Visual Basic
public System.String Name;
Public Property Name() As System.String
 Описание
 Представляет собой имя заголовка окна.
 Ссылки
 PaletteSet Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!