Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.DsdData.Copy
 Послать отзыв
 Метод создает копию данного объекта DsdData. Не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public HostMgd.PlottingServices.DsdData Copy();
Копировать Код
Public Function Copy() As HostMgd.PlottingServices.DsdData
 Возвращает
 Возвращает DSD-данные в виде объекта типа HostMgd.PlottingServices.DsdData.
 Описание
 Метод создает копию данного объекта DsdData.
 В текущей версии не реализован.
 Ссылки
 HostMgd.PlottingServices.DsdData, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!