Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор PaletteShowDockBarEventArgs.PaletteShowDockBarEventArgs (bool)
 Послать отзыв
 This is PaletteShowDockBarEventArgs, a member of class PaletteShowDockBarEventArgs.
 Синтаксис
C#
Visual Basic
public PaletteShowDockBarEventArgs(bool bShowDockBar);
Public Sub New(bShowDockBar As bool)
 Ссылки
 PaletteShowDockBarEventArgs Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!