Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptSelectionOptionsEventArgs.Filter
 Послать отзыв
 Свойство возвращает фильтр, использованный при операции выбора объектов, позволяя получить критерии отбора, применённые к выборке.
 Синтаксис
C#
Visual Basic
Копировать Код
public SelectionFilter Filter { get; }
Копировать Код
Public ReadOnly Property Filter As SelectionFilter
 Возвращает
 Возвращает объект типа SelectionFilter, содержащий набор условий, применённых к выбору объектов.
Если фильтр был задан при вызове команды выбора, возвращается соответствующий объект.
Если фильтр не использовался, может вернуть null.
 Описание
 Свойство предоставляет доступ к объекту типа SelectionFilter, который определял критерии выбора объектов в ходе операции — например, при вызове GetSelection() с заданным фильтром. Фильтр может включать:
типы объектов (например, Line, Circle),
значения свойств (например, слой, цвет, стиль),
пользовательские условия отбора.
 Это свойство особенно полезно при реализации команд, которые должны обрабатывать объекты в соответствии с теми же критериями, что и исходная выборка.
 Условия
 Только чтение
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события PromptingForSelection [Teigha.Runtime.CommandMethod("PromptingForSelectionExample_Filter")] public void PromptingForSelectionExample_Filter() { // Подписка на событие PromptingForSelection editor.PromptingForSelection += OnEditorPromptingForSelection; } // Реализация отработки события PromptingForSelection private void OnEditorPromptingForSelection(object sender, PromptSelectionOptionsEventArgs e) { // Получаем доступ к фильтру выбора SelectionFilter filter = e.Filter; // Если в фильтре есть данные, выводим их в командную строку if (filter != null) { editor.WriteMessage($"\nПрименён фильтр: {filter.GetType().Name}"); // Можно проанализировать или использовать фильтр для повторной выборки } else { editor.WriteMessage("\nФильтр не был задан."); } }
 Ссылки
 HostMgd.EditorInput.PromptSelectionOptionsEventArgs, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!