Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.GraphicsSystem.ConfigWasModifiedEventHandler(Object, EventArgs)
 Послать отзыв
 Делегат предназначен для обработки событий, возникающих в процессе изменения конфигурации менеджера графической системы dwg-документа nanoCAD.
 Синтаксис
C#
Visual Basic
Копировать Код
public delegate ConfigWasModifiedEventHandler( Object sender, EventArgs e );
Копировать Код
Public Delegate Sub ConfigWasModifiedEventHandler( sender As Object, e As EventArgs )
 Параметры
 Параметры
 Описание
 sender
 Объект-инициатор события. Тип Object.
 e
 Аргументы события. Тип EventArgs.
 Описание
 Делегат ConfigWasModifiedEventHandler используется для обработки событий, возникающих в процессе изменения конфигурации объекта HostMgd.GraphicsSystem.Manager.
 Параметры события передаются через аргументы sender и e, где sender представляет объект Manager как инициатор события, а аргумент e определяет контекст события в виде экземпляра класса EventArgs.
 Ваши комментарии по поводу этого топика: Послать отзыв!