Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptDistanceOptions
 Послать отзыв
 Класс предоставляет параметры для настройки интерактивного ввода расстояния в nanoCAD, такие как сообщение, диапазон значений и начальное значение.
 Иерархия классов
HostMgd::EditorInput::PromptOptions HostMgd::EditorInput::PromptEditorOptions HostMgd::EditorInput::PromptNumericalOptions HostMgd::EditorInput::PromptDistanceOptions
 Синтаксис
C#
Visual Basic
Копировать Код
public sealed class PromptDistanceOptions : PromptNumericalOptions
Копировать Код
Public NotInheritable Class PromptDistanceOptions Inherits PromptNumericalOptions
 Описание
 Класс используется при вызове методов ввода расстояния — например, GetDistance() — для задания поведения команды. С помощью класса можно:
установить текст приглашения (Message),
задать значение по умолчанию (DefaultValue),
разрешить или запретить отрицательные значения (AllowNegative),
разрешить пропуск ввода с помощью Enter (AllowNone),
включить режим ввода угла (AllowAngle), если расстояние связано с направлением.
 Этот класс позволяет гибко управлять пользовательским интерфейсом при вводе расстояния, обеспечивая точность и удобство взаимодействия.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { [Teigha.Runtime.CommandMethod("GetDistanceExample")] public void GetDistanceExample() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создаём запрос пользователю PromptDistanceOptions options = new PromptDistanceOptions("\nВведите расстояние:"); // Устанавливаем значение по умолчанию и разрешаем использовать его options.DefaultValue = 100.0; options.UseDefaultValue = true; // Разрешаем использовать Enter, не вводя значений. // В этом случае применится значение по умолчанию options.AllowNone = true; PromptDoubleResult result = editor.GetDistance(options); // Если данные введены, выводим результат в командную строку if (result.Status == PromptStatus.OK) { double distance = result.Value; editor.WriteMessage( $"\nВведено расстояние: {distance}"); } } }
 Методы
 Конструкторы
 HostMgd.EditorInput.PromptDistanceOptions
 Имя
 Описание
 PromptDistanceOptions
 Это обзор перегрузок PromptDistanceOptions.
 Топики
 Имя
 Описание
 PromptOptions Методы
 Ниже перечислены методы класса PromptOptions.
 PromptOptions Свойства
 Ниже перечислены свойства класса PromptOptions.
 Класс HostMgd.EditorInput.PromptNumericalOptions
 Имя
 Описание
 PromptNumericalOptions Свойства
 Ниже перечислены свойства класса PromptNumericalOptions.
 HostMgd.EditorInput.PromptDistanceOptions
 Имя
 Описание
 PromptDistanceOptions Методы
 Ниже перечислены методы класса PromptDistanceOptions.
 PromptDistanceOptions Свойства
 Ниже перечислены свойства класса PromptDistanceOptions.
 Ссылки
 PromptDistanceOptions Конструктор, PromptDistanceOptions Методы, PromptDistanceOptions Свойства, Методы, Топики, PromptOptions Методы, PromptOptions Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!