Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.Document.SendStringToExecute(String
 Послать отзыв
 Метод предназначен для вызова команды с помощью строки.
 Синтаксис
C#
Visual Basic
public void SendStringToExecute(ref System.String command, bool activate, bool wrapUpInactiveDoc, bool echoCommand);
Public Sub SendStringToExecute(ByRef command As System.String, activate As bool, wrapUpInactiveDoc As bool, echoCommand As bool)
 Параметры
 Параметры
 Описание
 command
 Команда, которая должна быть выполнена. Тип String
 activate
 Флаг, определяющий, должен ли результирующий документ стать активным. Тип bool
 wrapUpInactiveDoc
 Флаг, определяющий прекращение обработки очереди незавершенных действий текущего активного документа при очередном событии OnIdle(). Тип bool
 echoCommand
 Флаг, определяющий, должна ли команда быть отображена в командной строке. Тип bool
 Описание
 Метод вызывает команду, заданную в виде строки в параметре command.
 Ссылки
 HostMgd.ApplicationServices.Document, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!