Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод JigPromptAngleOptions.GetDefaultValueString
 Послать отзыв
 Вспомогательный метод.
 Синтаксис
C#
Visual Basic
public System.String GetDefaultValueString();
Public Function GetDefaultValueString() As System.String
 Возвращает
 Возвращает строку string, в которой указано значение угла, заданное по умолчанию.
 Описание
 Предназначен для преобразования значения угла по умолчанию в строку (string).
 Метод преобразовывает значение свойства DefaultValue в строку.
 Ссылки
 HostMgd.EditorInput.JigPromptAngleOptions, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!