Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод PublishEntityEventArgs.GetEntityNode
 Послать отзыв
 This is GetEntityNode, a member of class PublishEntityEventArgs.
 Синтаксис
C#
Visual Basic
public int GetEntityNode(ObjectId entityId, ref Teigha::DatabaseServices::ObjectIdCollection objIds);
Public Function GetEntityNode(entityId As ObjectId, ByRef objIds As Teigha.DatabaseServices.ObjectIdCollection) As Integer
 Ссылки
 PublishEntityEventArgs Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!