Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.ProfileEventHandler(Object, ProfileEventArgs)
 Послать отзыв
 Делегат предназначен для обработки событий класса UserConfigurationManager, возникающих в процессах управления пользовательскими профилями.
 Синтаксис
C#
Visual Basic
Копировать Код
public delegate void ProfileEventHandler( Object sender, ProfileEventArgs e );
Копировать Код
Public Delegate Sub ProfileEventHandler( sender As Object, e As ProfileEventArgs )
 Параметры
 Параметры
 Описание
 sender
 Объект, инициировавший событие. Тип Object.
 e
 Аргументы события. Тип ProfileEventArgs.
 Описание
 Делегат ProfileEventHandler определяет тип обработчика события класса UserConfigurationManager, таких как CurrentProfileChanged, CurrentProfileReset и др., возникающих в процессах управления пользовательскими профилями, а также связанными с ними диалоговыми разделами реестра Windows для хост-приложений nanoCAD. Контекст события передается через параметры sender и e, где e содержит имя профиля.
 Ваши комментарии по поводу этого топика: Послать отзыв!