Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Событие UserConfigurationManager.CurrentProfileSaving
 Послать отзыв
 This is CurrentProfileSaving, a member of class UserConfigurationManager.
 Синтаксис
C#
Visual Basic
public event ProfileEventHandler CurrentProfileSaving;
Public Event CurrentProfileSaving As ProfileEventHandler
 Ссылки
 UserConfigurationManager Класс, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!