Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptNestedEntityResultEventArgs
 Послать отзыв
 Класс предоставляет данные для события PromptedForSelection, включая набор выбранных объектов и статус операции.
 Иерархия классов
HostMgd::EditorInput::PromptSelectionResultEventArgs
 Синтаксис
C#
Visual Basic
Копировать Код
public sealed class PromptSelectionResultEventArgs : EventArgs
Копировать Код
Public NotInheritable Class PromptSelectionResultEventArgs Inherits EventArgs
 Описание
 Класс наследуется от EventArgs и используется в .NET API nanoCAD для передачи информации о завершённой операции выбора объектов в обработчик событий. Он применяется совместно с событием PromptedForSelection и делегатом PromptSelectionResultEventHandler, предоставляя разработчикам доступ к результату выборки, статусу операции и дополнительным параметрам команды.
 Класс содержит:
набор объектов (SelectionSet), выбранных пользователем,
статус операции (PromptStatus — OK, Cancel, Error и др.),
параметры приглашения (PromptSelectionOptions),
строковое значение , если выбор был прерван с клавиатуры.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события PromptedForSelection [Teigha.Runtime.CommandMethod("PromptedForSelectionExample")] public void PromptedForSelectionExample() { // Подписка на событие PromptedForSelection editor.PromptedForSelection += OnEditorPromptedForSelection; } // Реализация отработки события PromptedForSelection private void OnEditorPromptedForSelection(object sender, PromptSelectionResultEventArgs e) { // Вывод сообщения в командную строку if (e.Result.Status == PromptStatus.OK && e.Result.Value != null) { editor.WriteMessage($"\nВыбрано объектов: {e.Result.Value.Count}"); } else { editor.WriteMessage("\nОперация выбора объектов отменена."); } } }
 Топики
 Имя
 Описание
 PromptSelectionResultEventArgs Свойства
 Ниже перечислены свойства класса PromptSelectionResultEventArgs.
 Ссылки
 PromptSelectionResultEventArgs Свойства, Топики, PromptSelectionResultEventArgs Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!