Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор BeginAggregationEventArgs.BeginAggregationEventArgs
 Послать отзыв
 This is BeginAggregationEventArgs, a member of class BeginAggregationEventArgs.
 Синтаксис
C#
Visual Basic
public BeginAggregationEventArgs();
Public Sub New()
 Ссылки
 BeginAggregationEventArgs Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!