Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.GetString(String)
 Послать отзыв
 Метод позволяет пользователю ввести текстовую строку через командную строку, возвращая результат с информацией о статусе и введённом значении.
 Синтаксис
C#
Visual Basic
Копировать Код
public PromptResult GetString(String message);
Копировать Код
Public Function GetString(message As String) As PromptResult
 Параметры
 Параметры
 Описание
 message
 Сообщение, отображаемое в командной строке для приглашения пользователя к вводу строки (например, "Введите комментарий:"). Тип String.
 Возвращает
 Возвращает объект типа PromptResult, который содержит:
Status — статус операции (OK, Cancel, Error и др.).
StringResult — введённая пользователем строка (если ввод был успешным).
 Если пользователь успешно ввёл строку, статус будет равен PromptStatus.OK.
 Описание
 Метод используется для получения текстового ввода от пользователя в интерактивном режиме. Пользователь вводит строку с клавиатуры, при этом nanoCAD выводит заданное сообщение-приглашение. Метод ожидает ввод до тех пор, пока не будет получено допустимое значение или операция не будет прервана. Результат возвращается в виде объекта PromptResult, который содержит статус операции и введённую строку.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("GetStringExample_String")] public void GetStringExample_String() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создаём запрос пользователю PromptResult pr = editor.GetString("Введите имя файла:"); // Если все данные введены, выводим результат в командную строку if (pr.Status == PromptStatus.OK) { editor.WriteMessage( $"\nВы ввели: {pr.StringResult}"); } else { editor.WriteMessage( "\nВвод отменён."); } } }
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!