Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PlotInfo.Layout
 Послать отзыв
 Id объекта вывода
 Синтаксис
C#
Visual Basic
public Teigha::DatabaseServices::ObjectId Layout;
Public Property Layout() As Teigha.DatabaseServices.ObjectId
 Ссылки
 PlotInfo Класс, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!