Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.Application.ShowModelessDialog(System.IntPtr,System.Windows.Forms.Form)
 Послать отзыв
 МЕТОД НЕ РЕАЛИЗОВАН. Метод предназначен для вызова немодального диалогового окна, построенного с помощью WinForms, с заданным окном-владельцем.
 Синтаксис
C#
Visual Basic
Копировать Код
public static bool? ShowModalWindow(IntPtr owner, System.Windows.Window formToShow);
Копировать Код
Public Shared Function ShowModalWindow(owner As IntPtr, formToShow As System.Windows.Window) As Boolean?
 Параметры
 Параметры
 Описание
 owner
 Окно владельца диалога
 formToShow
 Форма, которая должна быть отображена
 Описание
 Метод отображает немодальный диалог, построенный на WinForms, у которого указано окно-владелец. Необходимо пользоваться именно этим методом вместо метода Form.Show, который может привести к непредсказуемому результату.
 Ссылки
 HostMgd.ApplicationServices.Application, HostMgd.ApplicationServices Пространство имен
 Исключения
 MGD NOT_IMPLEMENTED
 Ваши комментарии по поводу этого топика: Послать отзыв!