Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.BeginDocumentEventArgs.Copies
 Послать отзыв
 Свойство Copies представляет требуемое количество копий.
 Синтаксис
C#
Visual Basic
Копировать Код
public int Copies;
Копировать Код
Public ReadOnly Property Copies As Integer
 Возвращает
 Возвращает количество копий. Тип int.
 Описание
 Свойство Copies представляет заказанное количество копий.
 Условия
 Только чтение.
 Ссылки
 HostMgd.PlottingServices.BeginDocumentEventArgs, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!