Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PaletteSet.Opacity
 Послать отзыв
 Непрозрачность окна.
 Синтаксис
C#
Visual Basic
public int Opacity;
Public Property Opacity() As Integer
 Описание
 Значения 0-255
 Ссылки
 PaletteSet Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!