Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PrintForm.IsSheetCancelled
 Послать отзыв
 This is IsSheetCancelled, a member of class PrintForm.
 Синтаксис
C#
Visual Basic
public bool IsSheetCancelled;
Public Property IsSheetCancelled() As bool
 Ссылки
 PrintForm Класс, Пространство имен HostMgd
 Ваши комментарии по поводу этого топика: Послать отзыв!