Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PublishSheetEventArgs.Configuration
 Послать отзыв
 This is Configuration, a member of class PublishSheetEventArgs.
 Синтаксис
C#
Visual Basic
public System.String Configuration;
Public Property Configuration() As System.String
 Ссылки
 PublishSheetEventArgs Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!