Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptSelectionOptions.RejectPaperspaceViewport
 Послать отзыв
 Свойство определяет, будет ли отклоняться выбор видовых экранов в пространстве листа (Paper Space).
 Синтаксис
C#
Visual Basic
Копировать Код
public bool RejectPaperspaceViewport { get; set; }
Копировать Код
Public Property RejectPaperspaceViewport As Boolean
 Возвращает
 Возвращает значение типа bool:
true — выбор видовых экранов в пространстве листа запрещён.
false — выбор видовых экранов разрешён.
 Описание
 Свойство указывает, могут ли пользователи выбирать видовые экраны (viewport'ы) в пространстве листа.
 Если свойство установлено в true — выбор видовых экранов запрещён. Если false — выбор видовых экранов разрешён . Это свойство особенно полезно при реализации команд, которые должны работать только с обычными графическими объектами на листе, исключая вмешательство в структуру видовых экранов — например, при оформлении, аннотировании или печати.
 Оно не влияет на объекты внутри видовых экранов (в модели), а только на сам объект видового экрана в пространстве листа.
 Свойство применяется при вызове GetSelection().
 Условия
 Чтение и запись
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("PromptSelectionOptionsExample_RejectPaperspaceViewport")] public void PromptSelectionOptionsExample_RejectPaperspaceViewport() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создаём набор параметров для запроса PromptSelectionOptions options = new PromptSelectionOptions(); options.MessageForAdding = "Выберите линии для объединения:"; // Не позволять выбирать видовые экраны options.RejectPaperspaceViewport = true; // Фильтр: только объекты типа Line TypedValue[] filterList = new TypedValue[] { new TypedValue((int)DxfCode.Start, "LINE") }; SelectionFilter filter = new SelectionFilter(filterList); // Создаём запрос пользователю PromptSelectionResult result = editor.GetSelection(options, filter); // Если все данные введены, выводим результат в командную строку if (result.Status == PromptStatus.OK) { SelectionSet selSet = result.Value; editor.WriteMessage( $"\nВыбрано объектов: {selSet.Count}"); } else { editor.WriteMessage( "\nНе удалось получить выделение."); } } }
 Ссылки
 HostMgd.EditorInput.PromptSelectionOptions, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!