Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.DocumentCollection.DocumentCreateStarted
 Послать отзыв
 Событие возникает перед созданием dwg-документа.
 Синтаксис
C#
Visual Basic
public event DocumentCollectionEventHandler DocumentCreateStarted;
Public Event DocumentCreateStarted As DocumentCollectionEventHandler
 Возвращает
 Возвращает тип данных HostMgd.ApplicationServices.DocumentCollectionEventHandler
 Описание
 Событие, возникающее перед созданием документа, когда база данных еще не доступна.
 Соответствует функции NRX API HostApDocManagerReactor.documentCreateStarted().
 Ссылки
 HostMgd.ApplicationServices.DocumentCollection, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!