Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод EPlotProperty.AddEPlotAttribute
 Послать отзыв
 This is AddEPlotAttribute, a member of class EPlotProperty.
 Синтаксис
C#
Visual Basic
public void AddEPlotAttribute(ref System.String ns, ref System.String nsUrl, ref System.String attName, ref System.String attValue);
Public Sub AddEPlotAttribute(ByRef ns As System.String, ByRef nsUrl As System.String, ByRef attName As System.String, ByRef attValue As System.String)
 Ссылки
 EPlotProperty Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!