Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Событие Publisher.BeginEntity
 Послать отзыв
 This is BeginEntity, a member of class Publisher.
 Синтаксис
C#
Visual Basic
public event BeginEntityEventHandler BeginEntity;
Public Event BeginEntity As BeginEntityEventHandler
 Ссылки
 Publisher Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!