Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.DsdEntry.NpsSourceDwg
 Послать отзыв
 Свойство NpsSourceDwg представляет путь к файлу чертежа с именованной строкой настроек страницы, которую возвращает свойство Nps. Не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public System.String NpsSourceDwg;
Копировать Код
Public Property NpsSourceDwg As System.String
 Возвращает
 Возвращает путь к файлу DWG, в котором содержится именованная строка настроек страницы. Тип System.String.
 Описание
 Свойство NpsSourceDwg представляет путь к файлу чертежа с именованной строкой настроек страницы, которую возвращает свойство Nps.
 В текущей версии не реализовано.
 Условия
 Чтение и запись.
 Ссылки
 HostMgd.PlottingServices.DsdEntry, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!