Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство StatusBar.Panes
 Послать отзыв
 This is Panes, a member of class StatusBar.
 Синтаксис
C#
Visual Basic
public PaneCollection Panes;
Public Property Panes() As PaneCollection
 Ссылки
 StatusBar Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!