Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.EndPageEventArgs.Status
 Послать отзыв
 Свойство Status возвращает текущее значение флага SheetCancelStatus.
 Синтаксис
C#
Visual Basic
Копировать Код
public HostMgd.PlottingServices.SheetCancelStatus Status;
Копировать Код
Public ReadOnly Property Status As HostMgd.PlottingServices.SheetCancelStatus
 Возвращает
 Возвращает текущее значение флага отмены печати листа. Значение из перечисления HostMgd.PlottingServices.SheetCancelStatus.
 Описание
 Свойство Status возвращает текущее значение флага SheetCancelStatus.
 Условия
 Только чтение.
 Ссылки
 HostMgd.PlottingServices.EndPageEventArgs, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!