Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.DsdEntryCollection.RemoveAt
 Послать отзыв
 Метод удаляет из данной коллекции элемент с заданным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public void RemoveAt( int index );
Копировать Код
Public Sub RemoveAt( index As Integer )
 Параметры
 Параметры
 Описание
 index
 Индекс удаляемого из коллекции элемента. Тип int.
 Описание
 Метод удаляет из данной коллекции элемент с индексом index.
 Ссылки
 HostMgd.PlottingServices.DsdEntryCollection, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!