Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство AboutToBeginPublishingEventArgs.PlotLogger
 Послать отзыв
 This is PlotLogger, a member of class AboutToBeginPublishingEventArgs.
 Синтаксис
C#
Visual Basic
public HostMgd::PlottingServices::PlotLogger PlotLogger;
Public Property PlotLogger() As HostMgd.PlottingServices.PlotLogger
 Ссылки
 AboutToBeginPublishingEventArgs Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!