Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.GraphicsSystem
 Послать отзыв
 Пространство имен HostMgd.GraphicsSystem включает классы, перечисления и делегаты, предназначенные для работы с объектами графической системы nanoCAD.
 Описание
 Пространство имен HostMgd.GraphicsSystem включает классы, перечисления и делегаты, предназначенные для работы с объектами графической системы nanoCAD.
 Классы
 Имя
 Описание
 Manager
 Класс Manager представляет менеджер графической системы dwg-документа nanoCAD.
 ViewEventArgs
 Класс ViewEventArgs представляет данные пользовательских событий, связанных с изменением вида. Не реализован.
 Ссылки
 Классы, Перечисления, Делегаты
 Ваши комментарии по поводу этого топика: Послать отзыв!