Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.EndDocumentEventArgs
 Послать отзыв
 Класс EndDocumentEventArgs инкапсулирует информацию, относящуюся к выводу документа на печать, которая необходима для события PlotReactorManager.EndDocument.
 Иерархия классов
HostMgd::PlottingServices::EndDocumentEventArgs
 Синтаксис
C#
Visual Basic
Копировать Код
public class EndDocumentEventArgs : System.EventArgs;
Копировать Код
Public Class EndDocumentEventArgs Inherits System.EventArgs
 Описание
 Класс EndDocumentEventArgs инкапсулирует информацию, относящуюся к выводу документа на печать, которая необходима для события PlotReactorManager.EndDocument. Эта информация включает состояние флага PlotCancelStatus и используется делегатом HostMgd.PlottingServices.EndDocumentEventHandler.
 Методы
 Конструкторы
 Имя
 Описание
 EndDocumentEventArgs
 Конструктор класса EndDocumentEventArgs. Создает экземпляр класса с указанным статусом PlotCancelStatus.
 Топики
 Имя
 Описание
 EndDocumentEventArgs Свойства
 Ниже перечислены свойства класса EndDocumentEventArgs.
 Ссылки
 EndDocumentEventArgs Свойства, Методы, Топики, EndDocumentEventArgs Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!