Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.Application.InvokeHelpForExternal(String)
 Послать отзыв
 МЕТОД НЕ РЕАЛИЗОВАН. ВСЕГДА ВОЗВРАЩАЕТ FALSE. Метод вызывает справку для внешних функций.
 Синтаксис
C#
Visual Basic
Копировать Код
public static bool InvokeHelpForExternal(string functionName);
Копировать Код
Public Shared Function InvokeHelpForExternal(functionName As String) As Boolean
 Параметры
 Параметры
 Описание
 functionName
 Название внешней функции. Тип String
 Возвращает
 Тип bool: true - функция и справка для нее успешной найдены, flase - справка для функции не найдена.
 Описание
 Метод открывает окно со справной для внешней функции.
 Ссылки
 HostMgd.ApplicationServices.Application, HostMgd.ApplicationServices Пространство имен
 Исключения
 MGD NOT_IMPLEMENTED
 Ваши комментарии по поводу этого топика: Послать отзыв!