Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PromptDragOptions.Callback
 Послать отзыв
 Синтаксис
C#
Visual Basic
public HostMgd::EditorInput::DragCallback Callback;
Public Property Callback() As HostMgd.EditorInput.DragCallback
 Описание
 Возвращает или устанавливает делегат события.
 Условия
 На чтение и запись
 Ссылки
 PromptDragOptions Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!