Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод StatusBarItem.PointToClient
 Послать отзыв
 This is PointToClient, a member of class StatusBarItem.
 Синтаксис
C#
Visual Basic
public System.Drawing.Point PointToClient(System.Drawing.Point p);
Public Function PointToClient(p As System.Drawing.Point) As System.Drawing.Point
 Ссылки
 StatusBarItem Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!