Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PromptDragOptions.AllowArbitraryInput
 Послать отзыв
 Синтаксис
C#
Visual Basic
public bool AllowArbitraryInput;
Public Property AllowArbitraryInput() As bool
 Описание
 Разрешить произвольный ввод.
 Условия
 На чтение и запись
 Ссылки
 PromptDragOptions Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!