Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Делегат HostMgd.Windows.TrayItemBubbleWindowClosedEventHandler
 Послать отзыв
 This is type HostMgd::Windows::TrayItemBubbleWindowClosedEventHandler.
 Синтаксис
C#
Visual Basic
public delegate TrayItemBubbleWindowClosedEventHandler();
Public Delegate Sub TrayItemBubbleWindowClosedEventHandler()
 Ваши комментарии по поводу этого топика: Послать отзыв!