Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство StatusBarMouseDownEventArgs.X
 Послать отзыв
 This is X, a member of class StatusBarMouseDownEventArgs.
 Синтаксис
C#
Visual Basic
public int X;
Public Property X() As Integer
 Ссылки
 StatusBarMouseDownEventArgs Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!