Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.ConstraintUtilities
 Послать отзыв
 Класс ConstraintUtilities позволяет управлять режимом отображения значков наложенных ограничений у объектов активного документа. Не реализован.
 Иерархия классов
HostMgd::EditorInput::ConstraintUtilities
 Синтаксис
C#
Visual Basic
Копировать Код
public class ConstraintUtilities
Копировать Код
Public Class ConstraintUtilities
 Описание
 Класс ConstraintUtilities представляет метод для отображения, либо подавления видимости значков наложенных ограничений у объектов активного документа.
 В текущей версии не реализован.
 Топики
 Имя
 Описание
 ConstraintUtilities Методы
 Ниже перечислены методы класса ConstraintUtilities.
 Ссылки
 ConstraintUtilities Методы, Топики, ConstraintUtilities Методы
 Ваши комментарии по поводу этого топика: Послать отзыв!