Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptEntityResult.PickedPoint
 Послать отзыв
 Свойство возвращает точку в мировой системе координат, которую пользователь использовал для указания на геометрический объект.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d PickedPoint { get; }
Копировать Код
Public ReadOnly Property PickedPoint As Point3d
 Возвращает
 Возвращает объект типа Point3d, представляющий собой трёхмерные координаты точки выбора в мировой системе координат (X, Y, Z). Если операция выбора была отменена или не выполнена, возвращается Point3d.Null.
Point3d.Null — специальное значение, означающее недопустимую или неинициализированную точку.
X , Y , Z — компоненты координат точки.
 Описание
 Свойство предоставляет доступ к координатам точки (Point3d) в мировой системе координат (WCS), где пользователь щёлкнул мышью или указал с помощью клавиатуры при выборе геометрического объекта через такие методы, как GetEntity() или обработчики событий типа PromptedForEntity.
 Это значение может быть полезно при последующих построениях, вычислениях или модификации чертежа — например, для определения позиции взаимодействия с объектом. Свойство доступно только для чтения и устанавливается автоматически при завершении операции выбора.
 Условия
 Только чтение
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("PromptEntityResult_PickedPoint")] public void PromptEntityResult_PickedPoint() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Вызываем метод GetEntity() для запроса объекта PromptEntityResult result = editor.GetEntity("Выберите объект:"); // Если все данные введены, выводим результат в командную строку if (result.Status == PromptStatus.OK) { Point3d pt = result.PickedPoint; editor.WriteMessage($"\nТочка выбора: {pt.X}, {pt.Y}, {pt.Z}"); } else { editor.WriteMessage("\nНе удалось получить объект."); } } }
 Ссылки
 HostMgd.EditorInput.PromptEntityResult, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!