Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.Application.MainWindow
 Послать отзыв
 Свойство предназначено для доступа к основному окну приложения nanoCAD.
 Синтаксис
C#
Visual Basic
Копировать Код
public static Window MainWindow
Копировать Код
Public Shared ReadOnly Property MainWindow As Window
 Возвращает
 Возвращает ссылку на основное окно nanoCAD. Тип Window.
 Описание
 Свойство предоставляет доступ к основному окну приложения nanoCAD.
 Условия
 Только чтение.
 Ссылки
 HostMgd.ApplicationServices.Application, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!