Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.PlotConfig.MaximumDeviceDotsPerInch
 Послать отзыв
 Свойство MaximumDeviceDotsPerInch возвращает максимальное разрешение устройства (в точках на дюйм). Не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public int MaximumDeviceDotsPerInch;
Копировать Код
Public ReadOnly Property MaximumDeviceDotsPerInch As Integer
 Возвращает
 Возвращает максимальное разрешение устройства (в точках на дюйм). Тип int.
 Описание
 Свойство MaximumDeviceDotsPerInch возвращает максимальное разрешение устройства (в точках на дюйм).
 В текущей версии не реализовано.
 Условия
 Только чтение.
 Ссылки
 HostMgd.PlottingServices.PlotConfig, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!