Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PublishSheetEventArgs.PlotToFileName
 Послать отзыв
 This is PlotToFileName, a member of class PublishSheetEventArgs.
 Синтаксис
C#
Visual Basic
public System.String PlotToFileName;
Public Property PlotToFileName() As System.String
 Ссылки
 PublishSheetEventArgs Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!