Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PointInputEventArgs.PointInputEventArgs
 Послать отзыв
 Конструктор по умолчанию класса PointInputEventArgs.
 Синтаксис
C#
Visual Basic
Копировать Код
public PointInputEventArgs();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса PointInputEventArgs.
 Ссылки
 HostMgd.EditorInput.PointInputEventArgs, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!