Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptEntityOptions.PromptEntityOptions(string,string)
 Послать отзыв
 Конструктор инициализирует новый экземпляр класса с заданным сообщением, включающим локальные и глобальные ключевые слова для выбора объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public PromptEntityOptions(string messageAndKeywords, string globalKeywords);
Копировать Код
Public Sub New(messageAndKeywords As String, globalKeywords As String)
 Параметры
 Параметры
 Описание
 messageAndKeywords
 Строка, содержащая текст приглашения и, опционально, список локальных ключевых слов в формате [Ключ1/Ключ2]. Эти слова отображаются как возможные варианты выбора. Тип string
 globalKeywords
 Строка, содержащая глобальные ключевые слова, разделённые пробелом. Они остаются доступными на протяжении всей команды, даже если не указаны в основном сообщении. Тип string
 Описание
 Конструктор создаёт объект класса PromptEntityOptions, используемый при вызове метода GetEntity() или аналогичных команд выбора объектов в nanoCAD. Он позволяет задать:
приглашающее сообщение с локальными ключевыми словами , заключёнными в квадратные скобки
 — например: "Выберите объект [линия/окружность]:",
глобальные ключевые слова , доступные на протяжении всей команды —
 например: "отмена/выход". Этот конструктор особенно полезен при реализации интерактивных команд, где пользователь может выбрать режим выбора или выполнить системные действия, такие как отмена операции, не прерывая процесс ввода.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("PromptEntityOptions_string_string")] public void PromptEntityOptions_string_string() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создаём запрос пользователю PromptEntityOptions options = new PromptEntityOptions( "\nВыберите объект [Линия/Блок]:", "Line Block"); PromptEntityResult result = editor.GetEntity(options); // Если все данные введены, выводим результат в командную строку if (result.Status == PromptStatus.OK) { editor.WriteMessage( $"\nВыбран объект с ID: {result.ObjectId}, точка: {result.PickedPoint}"); } else { editor.WriteMessage( "\nОперация выбора отменена или объект не найден."); } } }
 Ссылки
 HostMgd.EditorInput.PromptEntityOptions, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!