Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод EntityJig.Update
 Послать отзыв
 Абстрактный метод, обязателен к реализации при наследовании класса EntityJig.
 Синтаксис
C#
Visual Basic
public System.Boolean Update();
Public Function Update() As System.Boolean
 Возвращает
 Возвращаемое значение типа bool
 Описание
 В методе должен быть реализован алгоритм преобразования данных в формат, необходимый для построения примитива на экране.
 Ссылки
 EntityJig Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!