Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.Windows.ToolPalette.CustomToolBase.GetCustomPropertyCtrl
 Послать отзыв
 Метод предоставляет настраиваемый элемент управления ActiveX для отображения и редактирования свойств пользовательского инструмента. Не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void GetCustomPropertyCtrl( ref System.Object id, UInt32 lcid, ref System.String programId );
Копировать Код
Public Overridable Sub GetCustomPropertyCtrl( ByRef id As System.Object, lcid As UInt32, ByRef programId As System.String )
 Параметры
 Параметры
 Описание
 id
 Идентификатор пользовательского элемента управления. Тип System.Object.
 lcid
 Идентификатор региональных параметров (локаль) Windows для локализации интерфейса элемента управления. Тип UInt32.
 programId
 Программный идентификатор элемента управления ActiveX. Тип System.String.
 Описание
 Метод предоставляет настраиваемый элемент управления ActiveX для отображения и редактирования свойств пользовательского инструмента. При выборе на панели инструментов пользовательского инструмента в окне свойств (Properties window) будет отображаться пользовательский элемент управления ActiveX с указанными идентификатором id и программным идентификатором programId.
 В текущей версии не реализован.
 Ссылки
 HostMgd.Windows.ToolPalette.CustomToolBase, HostMgd.Windows.ToolPalette
 Ваши комментарии по поводу этого топика: Послать отзыв!