Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод TabbedDialogEventArgs.AddTab
 Послать отзыв
 This is AddTab, a member of class TabbedDialogEventArgs.
 Синтаксис
C#
Visual Basic
public void AddTab(ref System.String name, ref HostMgd::ApplicationServices::TabbedDialogExtension extension);
Public Sub AddTab(ByRef name As System.String, ByRef extension As HostMgd.ApplicationServices.TabbedDialogExtension)
 Ссылки
 TabbedDialogEventArgs Класс, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!