Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство StatusBarItem.ToolTipText
 Послать отзыв
 This is ToolTipText, a member of class StatusBarItem.
 Синтаксис
C#
Visual Basic
public System.String ToolTipText;
Public Property ToolTipText() As System.String
 Ссылки
 StatusBarItem Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!