Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод DropTarget.OnDragOver
 Послать отзыв
 This is OnDragOver, a member of class DropTarget.
 Синтаксис
C#
Visual Basic
public void OnDragOver(ref System.Windows.Forms.DragEventArgs e);
Public Sub OnDragOver(ByRef e As System.Windows.Forms.DragEventArgs)
 Ссылки
 DropTarget Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!