Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Событие TrayItemBubbleWindow.Closed
 Послать отзыв
 This is Closed, a member of class TrayItemBubbleWindow.
 Синтаксис
C#
Visual Basic
public event TrayItemBubbleWindowClosedEventHandler Closed;
Public Event Closed As TrayItemBubbleWindowClosedEventHandler
 Ссылки
 TrayItemBubbleWindow Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!