Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.LongTransactionManager.CheckOut
 Послать отзыв
 Метод создаёт новую длительную транзакцию и выгружает (CheckOut) в рабочий набор объекты, перечисленные в предоставленном списке. В текущей версии не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public Teigha.DatabaseServices.ObjectId CheckOut( ref Teigha.DatabaseServices.ObjectIdCollection checkoutSet, Teigha.DatabaseServices.ObjectId toBlock, ref Teigha.DatabaseServices.IdMapping errorMap, Teigha.DatabaseServices.ObjectId blkRef );
Копировать Код
Public Function CheckOut( ByRef checkoutSet As Teigha.DatabaseServices.ObjectIdCollection, toBlock As Teigha.DatabaseServices.ObjectId, ByRef errorMap As Teigha.DatabaseServices.IdMapping, blkRef As Teigha.DatabaseServices.ObjectId ) As Teigha.DatabaseServices.ObjectId
 Параметры
 Параметры
 Описание
 checkoutSet
 Коллекция идентификаторов объектов, которые необходимо включить в транзакцию. Тип Teigha.DatabaseServices.ObjectIdCollection.
 toBlock
 Идентификатор блока, в который будут помещены выгруженные объекты. Тип Teigha.DatabaseServices.ObjectId.
 errorMap
 Карта с идентификаторами объектов, для которых при выгрузке (CheckOut) были выявлены ошибки. Тип Teigha.DatabaseServices.IdMapping.
 blkRef
 Идентификатор ссылки на блок (BlockReference), связанной с транзакцией. Тип Teigha.DatabaseServices.ObjectId.
 Возвращает
 Возвращает идентификатор объекта, представляющего созданную длительную транзакцию. Тип Teigha.DatabaseServices.ObjectId.
 Описание
 Метод создаёт новую длительную транзакцию, выгружает (CheckOut) в рабочий набор объекты, перечисленные в предоставленном списке, и возвращает идентификатор объекта созданной длительной транзакции.
 В текущей версии не реализован.
 Ссылки
 HostMgd.ApplicationServices.LongTransactionManager, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!