Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptIntegerOptionsEventHandler(object,PromptIntegerOptionsEventArgs)
 Послать отзыв
 Делегат предназначен для обработки события, возникающего перед началом ввода целого числа, и позволяет настроить параметры команды.
 Синтаксис
C#
Visual Basic
Копировать Код
public delegate void PromptIntegerOptionsEventHandler(object sender, PromptIntegerOptionsEventArgs e);
Копировать Код
Public Delegate Sub PromptIntegerOptionsEventHandler(sender As Object, e As PromptIntegerOptionsEventArgs)
 Параметры
 Параметры
 Описание
 sender
 Источник события — обычно экземпляр редактора (Editor), в котором происходит ввод. Тип object
 e
 Объект, содержащий параметры ввода целого числа:
 Описание
 Делегат используется как тип обработчика для события PromptingForInteger, которое генерируется перед началом интерактивного ввода целого числа — например, при вызове метода GetInteger() в .NET API nanoCAD. Он позволяет разработчику изменить параметры ввода в реальном времени, такие как:
текст приглашения (Message),
значение по умолчанию (DefaultValue),
допустимый диапазон (LowerLimit, UpperLimit),
режимы ввода (AllowNone, AllowZero, AllowNegative и др.).
 Этот делегат является ключевым элементом при создании интерактивных команд, где требуется точная настройка поведения ввода целого числа в зависимости от контекста — например, при задании количества, номера слоя или параметра операции.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события PromptingForInteger [Teigha.Runtime.CommandMethod("PromptingForIntegerExample")] public void PromptingForIntegerExample() { // Подписка на событие PromptingForInteger editor.PromptingForInteger += OnEditorPromptingForInteger; } // Реализация отработки события PromptingForInteger private void OnEditorPromptingForInteger(object sender, PromptIntegerOptionsEventArgs e) { // Установка сообщения e.Options.Message = "Введите количество копий:"; // Задание диапазона e.Options.LowerLimit = 1; e.Options.UpperLimit = 100; } }
 Ваши комментарии по поводу этого топика: Послать отзыв!