Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.InputPointContext.History
 Послать отзыв
 Свойство предназначено для получения информации о типе привязки или операции, выполненной при вводе точки, на основе битовых флагов.
 Синтаксис
C#
Visual Basic
Копировать Код
public PointHistoryBits History;
Копировать Код
Public Property History() As PointHistoryBits
 Возвращает
 Возвращает значение типа PointHistoryBits — перечисление с побитовой структурой, определяющей историю формирования точки. Флаги могут комбинироваться с помощью побитовых операций:
 Копировать Код
if ((context.History & PointHistoryBits.ObjectSnapped) != 0) { // Точка получена через OSNAP }
 Описание
 Свойство предоставляет значение перечисления PointHistoryBits, представляющее собой битовую маску, которая содержит сведения о том, как была получена текущая точка ввода. Оно позволяет определить, был ли использован режим:
объектной привязки,
прямоугольной сетки,
полярного отслеживания,
ручек,
автоматического выравнивания,
или другой специфический режим.
 Это свойство особенно полезно в обработчиках событий PointMonitor и PointFilter, где важно различать контекст ввода — например, чтобы избежать конфликтов между пользовательскими подсказками и системными привязками, или чтобы изменить поведение команды в зависимости от активного режима.
 Значение устанавливается системой nanoCAD автоматически. Каждый бит в возвращаемом значении соответствует определённому состоянию или режиму, что позволяет использовать побитовые операции для проверки конкретных условий.
 Условия
 Только чтение
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class InputPointContextExamples { // Метод команды, которая получает информацию о типе привязки или операции, // выполненной при вводе точки, на основе битовых флагов [Teigha.Runtime.CommandMethod("HistoryExample")] public void HistoryExample() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Метод для отработки события редактора PointMonitor editor.PointMonitor += (sender, e) => { // Сохраняем контекст события в преременную InputPointContext context = e.Context; // Выводим в комнадную строку полученные данные if (context != null) { PointHistoryBits history = context.History; if ((history & PointHistoryBits.ObjectSnapped) != 0) { editor.WriteMessage("\nТочка с привязкой (OSNAP)."); } else if ((history & PointHistoryBits.CartSnapped) != 0) { editor.WriteMessage("\nТочка по сетке (CartSnap)."); } } }; } }
 Ссылки
 HostMgd.EditorInput.InputPointContext, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!