Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.DsdEntry.DsdEntry
 Послать отзыв
 Конструктор по умолчанию класса DsdEntry. Не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public DsdEntry();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса DsdEntry.
 В текущей версии не реализован.
 Ссылки
 HostMgd.PlottingServices.DsdEntry, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!