Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.UseCommandLineInterface
 Послать отзыв
 Свойство предоставляет возможность проверить или задать, используется ли командная строка nanoCAD для взаимодействия с пользователем. Свойство не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool UseCommandLineInterface { get; }
Копировать Код
Public ReadOnly Property UseCommandLineInterface() As bool
 Возвращает
 Возвращает значение типа bool:
true — если командная строка активна и используется для взаимодействия с пользователем.
false — если взаимодействие осуществляется другим способом (например, через модальные окна или графические элементы).
 Свойство не реализовано, всегда возвращает false.
 Описание
 Свойство определяет, включен ли интерфейс командной строки в текущем контексте редактора. Оно может применяться для управления режимом ввода — например, при необходимости временно отключить вывод сообщений и запросов в командную строку или принудительно перевести взаимодействие в графический режим (например, при работе с формами или диалогами).
 Условия
 Только чтение.
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!