Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PromptOptions.Keywords
 Послать отзыв
 Коллекция ключевых слов запроса.
 Синтаксис
C#
Visual Basic
public KeywordCollection Keywords;
Public Property Keywords() As KeywordCollection
 Возвращает
 Возвращает коллекцию ключевых слов.
 Описание
 Возвращает коллекцию ключевых слов для запроса, которая отображается в приглашающем сообщении.
 Условия
 Только чтение.
 Ссылки
 HostMgd.EditorInput.PromptOptions, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!