Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PublishSheetEventArgs.PlotBoundsMinY
 Послать отзыв
 This is PlotBoundsMinY, a member of class PublishSheetEventArgs.
 Синтаксис
C#
Visual Basic
public double PlotBoundsMinY;
Public Property PlotBoundsMinY() As Double
 Ссылки
 PublishSheetEventArgs Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!