Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.Application.ShowModalWindow(System.IntPtr,System.Windows.Window,bool)
 Послать отзыв
 Метод предназначен для вызова WPF-формы с указанным окном-владельцем в модальном режиме и признаком сохранения позиции и размера окна.
 Синтаксис
C#
Visual Basic
Копировать Код
public static bool? ShowModalWindow(IntPtr owner, System.Windows.Window formToShow, bool persistSizeAndPosition);
Копировать Код
Public Shared Function ShowModalWindow(owner As IntPtr, formToShow As System.Windows.Window, persistSizeAndPosition As Boolean) As Boolean?
 Параметры
 Параметры
 Описание
 owner
 Окно владельца диалога
 formToShow
 Форма, которая должна быть показана
 persistSizeAndPosition
 Сохранять или нет позицию и размеры окна
 Возвращает
 Возвращает результат работы диалога, тип bool. Также возможно значение null.
 Описание
 Метод вызывает WPF-форму в модальном режиме, для которой указано окно-владелец и признак сохранения позиции и размера окна.
 Ссылки
 HostMgd.ApplicationServices.Application, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!