Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.PromptedForCorner
 Послать отзыв
 Событие возникает после завершения операции ввода точки, используемой как угол прямоугольной области. Событие не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public event PromptPointResultEventHandler PromptedForCorner;
Копировать Код
Public Event PromptedForCorner As PromptPointResultEventHandler
 Описание
 Событие вызывается в .NET API nanoCAD при завершении интерактивного ввода угла (точки), который обычно используется для задания прямоугольной области — например, при работе с командами, требующими указания двух противоположных углов. Оно позволяет разработчику получить доступ к результату ввода, обработать координаты точки или выполнить дополнительные действия на основе введённых данных.
 Событие реализуется через делегат PromptPointResultEventHandler, который передаёт объект PromptPointResultEventArgs, содержащий статус операции и значение точки (Point3d) в мировых координатах.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события PromptedForCorner [Teigha.Runtime.CommandMethod("PromptedForCornerExample")] public void PromptedForCornerExample() { // Подписка на событие PromptedForCorner editor.PromptedForCorner += OnEditorPromptedForCorner; } // Реализация отработки события PromptedForCorner private void OnEditorPromptedForCorner(object sender, PromptPointResultEventArgs e) { // Вывод сообщения в командную строку if (e.Result.Status == PromptStatus.OK) { editor.WriteMessage($"\nУказана точка: {e.Result.Value}"); } else { editor.WriteMessage("\nВвод точки отменён."); } } }
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!