Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.MediaBounds
 Послать отзыв
 Класс MediaBounds представляет границы носителя в терминах размера страницы, нижнего левого угла и верхнего правого угла области печати. Не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public class MediaBounds
Копировать Код
Public Class MediaBounds
 Описание
 Класс MediaBounds представляет границы носителя (листа) в терминах размера страницы, нижнего левого угла и верхнего правого угла области печати.
 В текущей версии не реализован.
 Методы
 Конструкторы
 Имя
 Описание
 MediaBounds
 Конструктор класса MediaBounds. Создает экземпляр класса с указанными параметрами. Не реализован.
 Топики
 Имя
 Описание
 MediaBounds Методы
 Ниже перечислены методы класса MediaBounds.
 MediaBounds Операторы
 Ниже перечислены операторы класса MediaBounds.
 MediaBounds Свойства
 Ниже перечислены свойства класса MediaBounds.
 Ссылки
 MediaBounds Методы, MediaBounds Операторы, MediaBounds Свойства, Методы, Топики, MediaBounds Методы, MediaBounds Операторы, MediaBounds Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!