Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.Application.NonInPlaceMainWindow
 Послать отзыв
 СВОЙСТВО НЕ РЕАЛИЗОВАНО. ВСЕГДА ВОЗВРАЩАЕТ NULL.
 Синтаксис
C#
Visual Basic
Копировать Код
public static Window NonInPlaceMainWindow
Копировать Код
Public Shared ReadOnly Property NonInPlaceMainWindow As Window
 Ссылки
 HostMgd.ApplicationServices.Application, HostMgd.ApplicationServices Пространство имен
 Исключения
 MGD NOT_IMPLEMENTED
 Ваши комментарии по поводу этого топика: Послать отзыв!