Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор EPlotPropertyBag.EPlotPropertyBag (System::String^, System::String^, System::String^)
 Послать отзыв
 This is EPlotPropertyBag, a member of class EPlotPropertyBag.
 Синтаксис
C#
Visual Basic
public EPlotPropertyBag(ref System.String id, ref System.String namespaceUrl, ref System.String namespaceLocation);
Public Sub New(ByRef id As System.String, ByRef namespaceUrl As System.String, ByRef namespaceLocation As System.String)
 Ссылки
 EPlotPropertyBag Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!