Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.PlotConfig.DefaultFileExtension
 Послать отзыв
 Свойство DefaultFileExtension представляет установленное по умолчанию расширение имени для файла печати, который создается текущим устройством. Не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public System.String DefaultFileExtension;
Копировать Код
Public ReadOnly Property DefaultFileExtension As System.String
 Возвращает
 Возвращает расширение имени для файла печати по умолчанию (с точкой в первом знаке). Тип System.String.
 Описание
 Свойство возвращает установленное по умолчанию расширение имени для файла печати, который создается текущим устройством (например, ".DWF").
 В текущей версии не реализовано.
 Замечания
 Точка в первом знаке присутствует в обязательном порядке.
 Условия
 Только чтение.
 Ссылки
 HostMgd.PlottingServices.PlotConfig, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!