Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство SelectionTextInputEventArgs.Input
 Послать отзыв
 Синтаксис
C#
Visual Basic
public System.String Input;
Public Property Input() As System.String
 Описание
 Возвращает ввод пользователя в виде строки.
 Условия
 Только на чтение
 Ссылки
 SelectionTextInputEventArgs Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!