Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Tool.CurrentShapeGuid
 Послать отзыв
 This is CurrentShapeGuid, a member of class Tool.
 Синтаксис
C#
Visual Basic
public System.Guid CurrentShapeGuid;
Public Property CurrentShapeGuid() As System.Guid
 Ссылки
 Tool Класс, HostMgd.Windows.ToolPalette
 Ваши комментарии по поводу этого топика: Послать отзыв!