Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор ColorDialog.ColorDialog
 Послать отзыв
 This is ColorDialog, a member of class ColorDialog.
 Синтаксис
C#
Visual Basic
public ColorDialog();
Public Sub New()
 Ссылки
 ColorDialog Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!