Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.BeginDocumentEventArgs.PlotInfo
 Послать отзыв
 Свойство PlotInfo представляет свойства печати.
 Синтаксис
C#
Visual Basic
Копировать Код
public HostMgd.PlottingServices.PlotInfo PlotInfo;
Копировать Код
Public ReadOnly Property PlotInfo As HostMgd.PlottingServices.PlotInfo
 Возвращает
 Возвращает свойства печати. Тип HostMgd.PlottingServices.PlotInfo.
 Описание
 Свойство PlotInfo представляет свойства печати в виде объекта сервисного класса HostMgd.PlottingServices.PlotInfo.
 Условия
 Только чтение.
 Ссылки
 HostMgd.PlottingServices.BeginDocumentEventArgs, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!