Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PointInputEventArgs.GraphicsSystemMarker
 Послать отзыв
 Свойство GraphicsSystemMarker представляет маркер графической системы. Не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public System.IntPtr GraphicsSystemMarker;
Копировать Код
Public ReadOnly Property GraphicsSystemMarker As System.IntPtr
 Возвращает
 Возвращает маркер графической системы. Тип System.IntPtr.
 Описание
 Свойство GraphicsSystemMarker представляет маркер графической системы.
 В текущей версии не реализовано.
 Условия
 Только чтение.
 Ссылки
 HostMgd.EditorInput.PointInputEventArgs, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!