Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.Windows.ToolPalette.FlyoutEntryAttribute.FlyoutEntryAttribute
 Послать отзыв
 Конструктор класса FlyoutEntryAttribute для создания экземпляра класса с указанным диспетчерским идентификатором. Конструктор не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public FlyoutEntryAttribute( int dispatchId );
Копировать Код
Public Sub New( dispatchId As Integer )
 Параметры
 Параметры
 Описание
 dispatchId
 Диспетчерский идентификатор. Тип int.
 Описание
 Конструктор класса FlyoutEntryAttribute. Создает экземпляр класса с указанным диспетчерским идентификатором dispatchId.
 В текущей версии не реализован.
 Ссылки
 HostMgd.Windows.ToolPalette.FlyoutEntryAttribute, HostMgd.Windows.ToolPalette
 Ваши комментарии по поводу этого топика: Послать отзыв!