Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Класс HostMgd.Windows.PaletteActivatedEventArgs
 Послать отзыв
 This is class HostMgd::Windows::PaletteActivatedEventArgs.
 Иерархия классов
HostMgd::Windows::PaletteActivatedEventArgs
 Синтаксис
C#
Visual Basic
public class PaletteActivatedEventArgs : System.EventArgs;
Public Class PaletteActivatedEventArgs Inherits System.EventArgs
 Методы
 Конструкторы
 Имя
 Описание
 PaletteActivatedEventArgs
 This is PaletteActivatedEventArgs, a member of class PaletteActivatedEventArgs.
 Топики
 Имя
 Описание
 PaletteActivatedEventArgs Свойства
 Ниже перечислены свойства класса PaletteActivatedEventArgs.
 Ссылки
 PaletteActivatedEventArgs Свойства, Методы, Топики, PaletteActivatedEventArgs Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!