Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.LongTransactionManager.CheckIn
 Послать отзыв
 Метод завершает длительную транзакцию (Check-In), возвращая изменённые объекты обратно в основную базу данных. В текущей версии не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public void CheckIn( Teigha.DatabaseServices.ObjectId transId, ref Teigha.DatabaseServices.IdMapping errorMap, bool keepObjs );
Копировать Код
Public Sub CheckIn( transId As Teigha.DatabaseServices.ObjectId, ByRef errorMap As Teigha.DatabaseServices.IdMapping, keepObjs As Boolean )
 Параметры
 Параметры
 Описание
 transId
 Входной идентификатор объекта длительной транзакции, которой предстоит операция CheckIn. Тип Teigha.DatabaseServices.ObjectId.
 errorMap
 Пустой объект IdMapping, в котором на выходе сохраняются идентификаторы объектов с обнаруженными ошибками в процессе операции CheckIn. Тип Teigha.DatabaseServices.IdMapping.
 keepObjs
 Входной флаг сохранения созданных объектов. Тип bool. Если равен true, созданные в рамках транзакции объекты рабочего набора сохраняются в целевом блоке. В случае false они удаляются.
 Описание
 Метод выполняет завершение длительной транзакции (Check-In), возвращая изменённые объекты обратно в основную базу данных.
 Аргумент keepObjs управляет сохранением объектов рабочего набора в целевом блоке. Такие объекты можно сохранить, либо удалить, если на них больше не ссылаются другие объекты в базе данных транзакции.
 В случае невозможности возврата каких-либо объектов в основную базу данных транзакция отменяется, а идентификаторы таких объектов сохраняются в карте errorMap.
 В текущей версии не реализован.
 Ссылки
 HostMgd.ApplicationServices.LongTransactionManager, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!