Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PlotProgress.UpperPlotProgressRange
 Послать отзыв
 Верхняя граница индикатора печати
 Синтаксис
C#
Visual Basic
public int UpperPlotProgressRange;
Public Property UpperPlotProgressRange() As Integer
 Ссылки
 PlotProgress Класс, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!