Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод XrefFileLock.ReleaseFile (System::Boolean, System::Boolean)
 Послать отзыв
 Синтаксис
C#
Visual Basic
public void ReleaseFile(System.Boolean skipSaveback, System.Boolean reload);
Public Sub ReleaseFile(skipSaveback As System.Boolean, reload As System.Boolean)
 Ссылки
 XrefFileLock Класс, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!