Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PlotProgress.IsSheetCancelled
 Послать отзыв
 Клиент диалога процесса печати может периодически опрашивать значение этого свойства для определения произошла ли отмена печати текущей страницы
 Синтаксис
C#
Visual Basic
public bool IsSheetCancelled;
Public Property IsSheetCancelled() As bool
 Ссылки
 PlotProgress Класс, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!