Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Publisher.FireAboutToBeginPublishing
 Послать отзыв
 This is FireAboutToBeginPublishing, a member of class Publisher.
 Синтаксис
C#
Visual Basic
public void FireAboutToBeginPublishing(ref HostMgd::Publishing::AboutToBeginPublishingEventArgs e);
Public Sub FireAboutToBeginPublishing(ByRef e As HostMgd.Publishing.AboutToBeginPublishingEventArgs)
 Ссылки
 Publisher Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!