Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Window.DeviceIndependentLocation
 Послать отзыв
 This is DeviceIndependentLocation, a member of class Window.
 Синтаксис
C#
Visual Basic
public System.Windows.Point DeviceIndependentLocation;
Public Property DeviceIndependentLocation() As System.Windows.Point
 Ссылки
 Window Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!