Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.DsdEntry.Title
 Послать отзыв
 Свойство Title представляет заголовок записи DsdEntry в в файле конфигурации DSD. Не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public System.String Title;
Копировать Код
Public Property Title As System.String
 Возвращает
 Возвращает заголовок записи DsdEntry. Тип System.String.
 Описание
 Свойство Title представляет заголовок записи DsdEntry в в файле конфигурации DSD.
 Заголовок является уникальным именем раздела записи DsdEntry в файле конфигурации DSD. Записи с одинаковым заголовком перезапишут друг друга.
 В текущей версии не реализовано.
 Условия
 Чтение и запись.
 Ссылки
 HostMgd.PlottingServices.DsdEntry, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!