Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.Application.AcadApplication
 Послать отзыв
 Свойство предоставляет доступ к COM-объекту приложения nanoCAD.
 Синтаксис
C#
Visual Basic
Копировать Код
public static object AcadApplication
Копировать Код
Public Shared ReadOnly Property AcadApplication As Object
 Возвращает
 Возвращает ссылку на COM-объект приложения nanoCAD. Тип object, который нужно преобразовать в nanoCAD.Application из COM-библиотеки.
 Описание
 Свойство предназначено для доступа к COM-объекту nanoCAD.
 Условия
 Только чтение.
 Пример
 Пример получения COM-объекта nanoCAD через свойство.
C#
 Копировать Код
nanoCAD.Application comApp = HostMgd.ApplicationServices.Application.AcadApplication as nanoCAD.Application;
 Ссылки
 HostMgd.ApplicationServices.Application, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!