Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Класс HostMgd.ApplicationServices.TabbedDialogExtension
 Послать отзыв
 Иерархия классов
HostMgd::ApplicationServices::TabbedDialogExtension
 Синтаксис
C#
Visual Basic
public class TabbedDialogExtension;
Public Class TabbedDialogExtension
 Описание
 Класс содержит информацию, необходимую для расширения информации о диалоговом окне с вкладками.
 Класс добавлен для совместимости.
 Методы
 Конструкторы
 Имя
 Описание
 TabbedDialogExtension
 Это обзор перегрузок TabbedDialogExtension.
 Топики
 Имя
 Описание
 TabbedDialogExtension Методы
 Ниже перечислены методы класса TabbedDialogExtension.
 TabbedDialogExtension Свойства
 Ниже перечислены свойства класса TabbedDialogExtension.
 Ссылки
 TabbedDialogExtension Конструктор, TabbedDialogExtension Методы, TabbedDialogExtension Свойства, Методы, Топики, TabbedDialogExtension Методы, TabbedDialogExtension Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!