Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Converter.AreaToString (double, DistanceUnitFormat, int)
 Послать отзыв
 Синтаксис
C#
Visual Basic
public String AreaToString(double value, DistanceUnitFormat units, int precision);
Public Function AreaToString(value As Double, units As DistanceUnitFormat, precision As Integer) As String
 Описание
 Конвертирует площадь в строку в соответствии с заданными квадратичными единицами и точностью.
 Ссылки
 Converter Класс, HostMgd.Runtime Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!