Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.Document.BeginDocumentClose
 Послать отзыв
 Событие, генерируемое перед закрытием документа.
 Синтаксис
C#
Visual Basic
Копировать Код
public event HostMgd.ApplicationServices.DocumentBeginCloseEventHandler BeginDocumentClose;
Public Event BeginDocumentClose As HostMgd.ApplicationServices.DocumentBeginCloseEventHandler
 Возвращает
 Возвращает тип данных HostMgd.ApplicationServices.DocumentBeginCloseEventHandler
 Описание
 Событие, генерируемое перед закрытием документа. Позволяет разработчику вызвать метод DocumentBeginCloseEventArgs.Veto() при обработке этого события, чтобы остановить закрытие документа. Соответствует функции NRX API NcEditorReactor2.docCloseAborted().
 Ссылки
 HostMgd.ApplicationServices.Document, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!