Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.Windows.ToolPalette.CustomToolBase.GetUnspecifiedString
 Послать отзыв
 Метод предоставляет текстовую строку со значением свойства, которое не указано явно или которое помечено как "не указано" (unspecified). Не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual System.String GetUnspecifiedString( ref System.Object id );
Копировать Код
Public Overridable Function GetUnspecifiedString( ByRef id As System.Object ) As System.String
 Параметры
 Параметры
 Описание
 id
 Идентификатор свойства, для которого запрашивается текстовая строка в случае "неуказанного" значения. Тип System.Object.
 Возвращает
 Возвращает текстовую строку, связанную со свойством id. Тип System.String.
 Описание
 Метод используется для получения текстового представления свойств инструмента, значение которых помечено как "не указано" (unspecified).
 В текущей версии не реализован.
 Ссылки
 HostMgd.Windows.ToolPalette.CustomToolBase, HostMgd.Windows.ToolPalette
 Ваши комментарии по поводу этого топика: Послать отзыв!