Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Класс HostMgd.Publishing.PublishEventArgs
 Послать отзыв
 This is class HostMgd::Publishing::PublishEventArgs.
 Иерархия классов
HostMgd::Publishing::PublishEventArgs
 Синтаксис
C#
Visual Basic
public class PublishEventArgs : System.EventArgs;
Public Class PublishEventArgs Inherits System.EventArgs
 Методы
 Конструкторы
 Имя
 Описание
 PublishEventArgs
 This is PublishEventArgs, a member of class PublishEventArgs.
 Топики
 Имя
 Описание
 PublishEventArgs Свойства
 Ниже перечислены свойства класса PublishEventArgs.
 Ссылки
 PublishEventArgs Свойства, Методы, Топики, PublishEventArgs Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!