Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Делегат HostMgd.ApplicationServices.SystemVariableChangedEventHandler
 Послать отзыв
 Делегат события завершения изменения переменной
 Синтаксис
C#
Visual Basic
public delegate SystemVariableChangedEventHandler();
Public Delegate Sub SystemVariableChangedEventHandler()
 Ваши комментарии по поводу этого топика: Послать отзыв!