Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.DsdData.MinorVersion
 Послать отзыв
 Свойство MinorVersion возвращает минорную версию файла DSD, загруженного методом ReadDsd(). Не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public int MinorVersion;
Копировать Код
Public Property MinorVersion As Integer
 Возвращает
 Возвращает номер дополнительной (минорной) версии файла DSD. Тип int.
 Описание
 Свойство MinorVersion позволяет управлять номером дополнительной (минорной) версии файла DSD. Этот номер становится доступным после чтения файла DSD методом ReadDsd().
 В текущей версии не реализовано.
 Условия
 Чтение и запись.
 Ссылки
 HostMgd.PlottingServices.DsdData, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!