Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.MediaBounds.Equals
 Послать отзыв
 Метод реализует проверку равенства данного и указанного объектов. Не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public override bool Equals( ref System.Object obj );
Копировать Код
Public Overrides Function Equals( ByRef obj As System.Object ) As Boolean
 Параметры
 Параметры
 Описание
 obj
 Входной объект, который проверяется на равенство данному объекту. Тип Object.
 Возвращает
 Возвращает true, если сравниваемые объекты равны. В противном случае возвращает false.
 Описание
 Метод реализует проверку равенства данного объекта и объекта obj.
 В текущей версии не реализован.
 Замечания
 Переопределение методов Equals и GetHashCode должно выполняться согласованно с соблюдением общей логики. Если Equals возвращает true, хеш-коды сравниваемых объектов обязаны совпадать. Обратное не гарантируется - совпадение хеш-кодов не всегда означает совпадение объектов вследствие возможных коллизий. Хеш-коды должны формироваться с использованием полей, на которых основано равенство объектов.
 Иногда используется метод Equals() из объекта C++, но поскольку сравниваются указатели, вы по-прежнему можете использовать GetHashCode() отсюда, в то время как метод Equals() может быть переопределен в производном классе.
 Ссылки
 HostMgd.PlottingServices.MediaBounds, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!