Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.InplaceTextEditor.Wysiwyg
 Послать отзыв
 Свойство Wysiwyg позволяет включать и выключать режим WYSIWYG. В текущей версии не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool Wysiwyg;
Копировать Код
Public Property Wysiwyg As Boolean
 Возвращает
 Возвращает true, если режим отображения WYSIWYG включен. В противном случае возвращает false.
 Описание
 Свойство Wysiwyg позволяет включать и выключать режим WYSIWYG в данном редакторе. В текущей версии не реализовано.
 Условия
 Чтение и запись.
 Ссылки
 HostMgd.ApplicationServices.InplaceTextEditor, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!