Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.InplaceTextEditorSettings.DefinedHeight
 Послать отзыв
 Свойство DefinedHeight управляет назначенной высотой текста во встроенном текстовом редакторе. В текущей версии не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public double DefinedHeight;
Копировать Код
Public Property DefinedHeight As Double
 Возвращает
 Возвращает назначенную высоту текста в настройках редактора. Тип double.
 Описание
 Свойство DefinedHeight представляет назначенную высоту текста во встроенном текстовом редакторе.
 Эта настройка используется, если входной объект не является резидентным объектом текущей базы данных. В противном случае назначенная высота приравнивается высоте самого объекта MTEXT или TEXT.
 В текущей версии не реализовано.
 Условия
 Чтение и запись.
 Ссылки
 HostMgd.ApplicationServices.InplaceTextEditorSettings, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!