Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Jig.GetDynamicDimensionData
 Послать отзыв
 Метод обрабатывает данные об изменениях размера объекта при перемещении курсора мыши.
 Синтаксис
C#
Visual Basic
public Teigha.DatabaseServices.DynamicDimensionDataCollection GetDynamicDimensionData(double dimScale);
Public Function GetDynamicDimensionData(dimScale As double) As Teigha.DatabaseServices.DynamicDimensionDataCollection
 Параметры
 Параметры
 Описание
 dimScale
 Масштаб объекта
 Возвращает
 Возвращает DynamicDimensionDataCollection - набор размерных данных объекта
 Описание
 Переопределяемый метод. Обрабатывает данные об изменениях размеров объекта при изменении положения курсора мыши.
 Ссылки
 Jig Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!