Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство WhoHasInfo.IsFileLocked
 Послать отзыв
 Синтаксис
C#
Visual Basic
public bool IsFileLocked;
Public Property IsFileLocked() As bool
 Описание
 Признак того, что файл заблокирован на редактирование другой сессией nanoCAD.
 Условия
 Только на чтение
 Ссылки
 WhoHasInfo Структура, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!