Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.GetPoint(PromptPointOptions)
 Послать отзыв
 Метод позволяет пользователю указать точку в чертеже с помощью мыши или ввести координаты вручную, возвращая результат с координатами точки.
 Синтаксис
C#
Visual Basic
Копировать Код
public PromptPointResult GetPoint(PromptPointOptions options);
Копировать Код
Public Function GetPoint(options As PromptPointOptions) As PromptPointResult
 Параметры
 Параметры
 Описание
 options
 Объект, содержащий параметры ввода точки:
 Возвращает
 Возвращает объект типа PromptPointResult, который содержит:
Status — статус операции (OK, Cancel, Error и др.).
Value — значение точки (Point3d`) в мировой системе координат (WCS), если ввод был успешным.
StringResult — строковое представление введённых данных.
 Если пользователь успешно указал точку, статус будет OK. Если операция была прервана или введены некорректные данные, статус будет другим.
 Описание
 Метод используется для интерактивного получения координат точки от пользователя. Пользователь может выбрать точку графически — щелчком мыши на экране, либо ввести её координаты в командной строке. Метод предоставляет гибкие настройки приглашения через объект PromptPointOptions, включая сообщение, начальную точку, ограничения и дополнительные подсказки. Поддерживает привязки и фильтры, что делает его удобным для точного позиционирования.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("GetPointExample_PromptPointOptions")] public void GetPointExample_PromptPointOptions() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создаём запрос пользователю PromptPointOptions options = new PromptPointOptions("nУкажите точку:"); options.BasePoint = new Point3d(0, 0, 0); PromptPointResult result = editor.GetPoint(options); // Если все данные введены, выводим результат в командную строку if (result.Status == PromptStatus.OK) { Point3d pt = result.Value; editor.WriteMessage( $"\nВыбранная точка: {pt}"); } else { editor.WriteMessage( "\nВвод точки отменен или произошла ошибка."); } } }
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!