Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PointInputEventHandler(Object, PointInputEventArgs)
 Послать отзыв
 Делегат PointInputEventHandler предназначен для обработки событий, связанных с интерактивным указанием точки в редакторе nanoCAD.
 Синтаксис
C#
Visual Basic
Копировать Код
public delegate void PointInputEventHandler( Object sender, PointInputEventArgs e );
Копировать Код
Public Delegate Sub PointInputEventHandler( sender As Object, e As PointInputEventArgs )
 Параметры
 Параметры
 Описание
 sender
 Объект, инициировавший событие. Тип Object.
 e
 Аргументы события. Тип PointInputEventArgs.
 Описание
 Делегат PointInputEventHandler определяет тип обработчика для пользовательских событий, связанных с интерактивным указанием точки в редакторе nanoCAD. Параметры события передаются через аргументы sender и e, где sender представляет объект-инициатор события, а аргумент e определяет контекст события в виде экземпляра класса HostMgd.EditorInput.PointInputEventArgs. Этот контекст обеспечивает доступ к таким объектам как документ, из которого было выдано событие, режим объектной привязки, указатель на ручку, подсказки и т.п.
 Ваши комментарии по поводу этого топика: Послать отзыв!