Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод IConfigurationSection.ContainsSubsection
 Послать отзыв
 Синтаксис
C#
Visual Basic
bool ContainsSubsection(ref String name);
Function ContainsSubsection(ByRef name As String) As bool
 Параметры
 Параметры
 Описание
 name
 Имя подсекции, которое должно быть найдено
 Описание
 Этот метод должен быть разработан, чтобы проверить, что секция конфигурации содержит подсекцию с заданным именем.
 Ссылки
 IConfigurationSection Интерфейс, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!