Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 JigPrompts.AcquireAngle(String)
 Послать отзыв
 Метод запрашивает у пользователя угол в °(градусах), используя при запросе приглашающее сообщение.
 Синтаксис
C#
Visual Basic
public HostMgd.EditorInput.PromptDoubleResult AcquireAngle(ref System.String message);
Public Function AcquireAngle(ByRef message As System.String) As HostMgd.EditorInput.PromptDoubleResult
 Параметры
 Параметры
 Описание
 message
 Текстовое сообщение, приглашающее выбрать угол для дальнейших действий с объектом или группой объектов. Сообщение будет выводиться на экране во время работы метода.
 Возвращает
 Возвращает результат типа double, который является углом, выраженным в радианах. Значение угла определяется либо исходя из текущего положения курсора мыши, либо посредством ввода с клавиатуры. При вводе с клавиатуры необходимо указывать угол в °(градусах).
 Описание
 Метод предназначен для запроса у пользователя угла в °(градусах). В основном применяется для интерактивного поворота объекта или группы объектов. После вызова создает экземпляр класса JigPromptAngleOptions, присваивает его свойству Message значение параметра message и вызывает свою перегрузку JigPrompts.AcquireAngle(JigPromptAngleOptions options).
 Пример
 В примере приведен отрывок кода из реализации метода Sampler() класса Jig.
C#
 Копировать Код
 PromptDoubleResult result = prompts.AcquireAngle("Угол поворота:");
Visual Basic
 Копировать Код
 Dim result As PromptDoubleResult = prompts.AcquireAngle("Угол поворота:")
 Ссылки
 JigPrompts Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!