Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.Marshaler
 Послать отзыв
 Класс Marshaler представляет служебные методы для преобразования между управляемыми наборами выделенных объектов и неуправляемыми структурами данных в формате ads_name. В текущей версии не реализован.
 Иерархия классов
HostMgd::ApplicationServices::Marshaler
 Синтаксис
C#
Visual Basic
Копировать Код
public class Marshaler;
Копировать Код
Public Class Marshaler
 Описание
 Класс Marshaler представляет служебные методы для преобразования между управляемыми наборами выделенных объектов и неуправляемыми структурами данных в формате ads_name. В текущей версии не реализован.
 Топики
 Имя
 Описание
 Marshaler Методы
 Ниже перечислены методы класса Marshaler.
 Ссылки
 Marshaler Методы, Топики, Marshaler Методы
 Ваши комментарии по поводу этого топика: Послать отзыв!