Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.DeviceInputEventArgs
 Послать отзыв
 Класс DeviceInputEventArgs предоставляет данные для реализации пользовательских событий, связанных с изменениями в устройстве ввода (например, мыши). Не реализован.
 Иерархия классов
HostMgd::EditorInput::DeviceInputEventArgs
 Синтаксис
C#
Visual Basic
Копировать Код
public sealed class DeviceInputEventArgs : System.EventArgs;
Копировать Код
Public NotInheritable Class DeviceInputEventArgs Inherits System.EventArgs;
 Описание
 Класс DeviceInputEventArgs является наследником класса EventArgs и в .NET API nanoCAD предоставляет данные для реализации низкоуровневых пользовательских событий, связанных с изменениями в устройстве ввода (например, мыши, клавиатуры или графического планшета). Используется совместно с делегатом HostMgd.EditorInput.DeviceInputEventHandler
 В текущей версии не реализован.
 Топики
 Имя
 Описание
 DeviceInputEventArgs Свойства
 Ниже перечислены свойства класса DeviceInputEventArgs.
 Ссылки
 DeviceInputEventArgs Свойства, Топики, DeviceInputEventArgs Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!