Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.DocumentWindowCollection
 Послать отзыв
 Класс DocumentWindowCollection представляет коллекцию окон открытых документов.
 Иерархия классов
HostMgd::ApplicationServices::DocumentWindowCollection
 Синтаксис
C#
Visual Basic
Копировать Код
public class DocumentWindowCollection : System.Collections.ICollection;
Копировать Код
Public Class DocumentWindowCollection Inherits System.Collections.ICollection
 Описание
 Класс DocumentWindowCollection представляет коллекцию окон открытых документов.
 Топики
 Имя
 Описание
 DocumentWindowCollection Методы
 Ниже перечислены методы класса DocumentWindowCollection.
 DocumentWindowCollection Свойства
 Ниже перечислены свойства класса DocumentWindowCollection.
 Ссылки
 DocumentWindowCollection Методы, DocumentWindowCollection Свойства, Топики, DocumentWindowCollection Методы, DocumentWindowCollection Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!