Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptDoubleOptions.DefaultValue
 Послать отзыв
 Свойство возвращает или устанавливает значение по умолчанию, которое будет использовано при нажатии Enter без ввода других данных.
 Синтаксис
C#
Visual Basic
Копировать Код
public double DefaultValue { get; set; }
Копировать Код
Public Property DefaultValue As Double
 Возвращает
 Возвращает значение типа double, представляющее собой число, используемое по умолчанию. Если значение не задано, возвращается 0.0.
 Описание
 Свойство типа double используется в классе PromptDoubleOptions для задания значения, которое автоматически применяется при интерактивном вводе вещественного числа, если пользователь нажимает Enter , не вводя другого значения. Это позволяет ускорить выполнение команд, предоставляя разумное значение по умолчанию, соответствующее типичному сценарию использования.
 Свойство доступно как для чтения, так и для записи, что даёт возможность динамически изменять его в зависимости от контекста — например, на основе предыдущих действий или параметров чертежа.
 Важно: Чтобы значение по умолчанию применялось, необходимо установить AllowNone = true, чтобы разрешить завершение ввода без указания значения.
 Условия
 Чтение и запись
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("PromptDoubleOptionsExample_DefaultValue")] public void PromptDoubleOptionsExample_DefaultValue() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создаём запрос пользователю PromptDoubleOptions options = new PromptDoubleOptions("\nВведите значение масштаба:"); options.DefaultValue = 1.0; // Значение по умолчанию options.UseDefaultValue = true; // Разрешить использовать значение по умолчанию options.AllowNone = true; // Разрешить нажатие Enter PromptDoubleResult result = editor.GetDouble(options); // Если все данные введены, выводим результат в командную строку if (result.Status == PromptStatus.OK) { double scale = result.Value; editor.WriteMessage( $"\nЗначение масштаба: {scale}"); } else if (result.Status == PromptStatus.None) { editor.WriteMessage("\nИспользовано значение по умолчанию."); } } }
 Ссылки
 HostMgd.EditorInput.PromptDoubleOptions, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!