Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Класс HostMgd.PlottingServices.PlotEngine
 Послать отзыв
 Основной класс производства печати Приложение использует интерфейс этого класса для печати одного или нескольких документов на устройстве печати или в файл.
 Иерархия классов
Teigha::Runtime::DisposableWrapper HostMgd::PlottingServices::PlotEngine
 Синтаксис
C#
Visual Basic
[Wrapper("AcPlPlotEngine")] public class PlotEngine : Teigha::Runtime::DisposableWrapper;
<Wrapper("AcPlPlotEngine")> Public Class PlotEngine Inherits Teigha.Runtime.DisposableWrapper
 Описание
 Экземпляры этого класса создаются статическими методами класса PlotFactory. В любой момент времени может существовать только один объект класса PlotEngine. Приложение должно создать один экземпляр этого класса, произвести печать с его помощью и удалить его при помощи метода Destroy()
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Класс HostMgd.PlottingServices.PlotEngine
 Имя
 Описание
 PlotEngine Методы
 Ниже перечислены методы класса PlotEngine.
 PlotEngine Свойства
 Ниже перечислены свойства класса PlotEngine.
 Ссылки
 PlotEngine Методы, PlotEngine Свойства, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!