Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.SwitchToModelSpace()
 Послать отзыв
 Метод выполняет переключение текущего пространства чертежа в пространство модели.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SwitchToModelSpace();
Копировать Код
Public Sub SwitchToModelSpace()
 Описание
 Метод используется для программного переключения активного контекста редактора из пространства листа (paper space) в пространство модели (model space). Это может быть полезно при автоматизации операций, требующих работы именно в пространстве модели, например, при создании или редактировании геометрических объектов. Метод не вызывает запросов к пользователю и выполняет переключение немедленно.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("SwitchToModelSpaceExample")] public void SwitchToModelSpaceExample() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Вызов метода editor.SwitchToModelSpace(); // Вывод сообщения в командной строке editor.WriteMessage("\nПереключено в пространство модели."); } }
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!