Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор PaletteAddContextMenuEventArgs.PaletteAddContextMenuEventArgs
 Послать отзыв
 This is PaletteAddContextMenuEventArgs, a member of class PaletteAddContextMenuEventArgs.
 Синтаксис
C#
Visual Basic
public PaletteAddContextMenuEventArgs(ref System.Collections.Generic.List<HostMgd::Windows::MenuItem^> menuItems, ref System.Collections.Generic.List<int> removeMenuItems, int hitFlag, int rightClickTab);
Public Sub New(ByRef menuItems As System.Collections.Generic.List<HostMgd.Windows.MenuItem^>, ByRef removeMenuItems As System.Collections.Generic.List<int>, hitFlag As Integer, rightClickTab As Integer)
 Ссылки
 PaletteAddContextMenuEventArgs Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!