Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 JigPrompts.AcquireDistance()
 Послать отзыв
 Метод запрашивает у пользователя расстояние.
 Синтаксис
C#
Visual Basic
public HostMgd.EditorInput.PromptDoubleResult AcquireDistance();
Public Function AcquireDistance() As HostMgd.EditorInput.PromptDoubleResult
 Возвращает
 Возвращает результат типа double, который является расстоянием, полученным либо из текущего положения курсора мыши и значений настроек, выбранных пользователем, либо посредством ввода с клавиатуры.
 Описание
 Метод предназначен для запроса у пользователя расстояния. В основном применяется для интерактивного увеличения или уменьшения объекта или группы объектов, либо их перемещения. После вызова создает пустой экземпляр класса JigPromptDistanceOptions и вызывает свою перегрузку JigPrompts.AcquireDistance(JigPromptDistanceOptions options).
 Пример
 В примере приведен отрывок кода из реализации метода Sampler() класса Jig.
C#
 Копировать Код
 PromptDoubleResult result = prompts.AcquireDistance();
Visual Basic
 Копировать Код
 Dim result As PromptDoubleResult = prompts.AcquireDistance()
 Ссылки
 JigPrompts Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!