Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PublishSheetEventArgs.ViewPlotted
 Послать отзыв
 This is ViewPlotted, a member of class PublishSheetEventArgs.
 Синтаксис
C#
Visual Basic
public System.String ViewPlotted;
Public Property ViewPlotted() As System.String
 Ссылки
 PublishSheetEventArgs Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!