Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptIntegerOptionsEventArgs
 Послать отзыв
 Класс предоставляет данные для события PromptingForInteger, позволяя настроить параметры ввода целого числа перед началом операции.
 Иерархия классов
HostMgd::EditorInput::PromptIntegerOptionsEventArgs
 Синтаксис
C#
Visual Basic
Копировать Код
public sealed class PromptIntegerOptionsEventArgs : EventArgs
Копировать Код
Public NotInheritable Class PromptIntegerOptionsEventArgs Inherits EventArgs
 Описание
 Класс используется в .NET API nanoCAD для передачи параметров при начале интерактивного ввода целого числа — например, перед вызовом метода GetInteger(). Объект этого класса передаётся в обработчик события PromptingForInteger, предоставляя доступ к настройкам ввода через свойство Options.
 Через этот класс можно:
изменить текст приглашения (Message),
задать значение по умолчанию (DefaultValue),
установить допустимый диапазон (LowerLimit, UpperLimit),
управлять режимами ввода (AllowNone, AllowNegative, AllowZero и др.).
 Это позволяет гибко настраивать поведение команды ввода в зависимости от контекста — например, при создании команд, требующих ввода количества копий, номера слоя, параметра массива и других целочисленных значений.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события PromptingForInteger [Teigha.Runtime.CommandMethod("PromptingForIntegerExample")] public void PromptingForIntegerExample() { // Подписка на событие PromptingForInteger editor.PromptingForInteger += OnEditorPromptingForInteger; } // Реализация отработки события PromptingForInteger private void OnEditorPromptingForInteger(object sender, PromptIntegerOptionsEventArgs e) { // Установка сообщения e.Options.Message = "Введите количество копий:"; // Задание диапазона e.Options.LowerLimit = 1; e.Options.UpperLimit = 100; } }
 Топики
 Имя
 Описание
 PromptIntegerOptionsEventArgs Свойства
 Ниже перечислены свойства класса PromptIntegerOptionsEventArgs.
 Ссылки
 PromptIntegerOptionsEventArgs Свойства, Топики, PromptIntegerOptionsEventArgs Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!