Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.InputPointContext.GetKeyPointEntities()
 Послать отзыв
 Метод предназначен для получения массива геометрических объектов, участвующих в вычислении привязанной точки (оснапа).
 Синтаксис
C#
Visual Basic
Копировать Код
public FullSubentityPath[] GetKeyPointEntities();
Копировать Код
Public Function GetKeyPointEntities() As FullSubentityPath[]
 Возвращает
 Возвращает массив объектов типа FullSubentityPath[], каждый из которых указывает на:
ObjectId контейнера (полного объекта),
путь к подобъекту (например, сегменту, ребру, грани), если применимо.
 Если привязка не активна — возвращается пустой массив. Если привязка выполнена к одиночному объекту — массив содержит один элемент. При сложных привязках (например, пересечение) — может содержать два и более элемента.
 Описание
 Метод используется в контексте интерактивного ввода точки и возвращает набор объектов, которые непосредственно участвуют в определении положения привязанной (osnapped) точки. Эти объекты являются основой для расчёта координат при использовании режимов объектной привязки (OSNAP), таких как конечная точка, пересечение, центр, касательная и других.
 Этот метод особенно полезен при реализации пользовательских фильтров ввода (PointFilter) или мониторов (PointMonitor), где требуется анализировать, к каким именно объектам производится привязка, чтобы корректно обработать или визуализировать результат.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class InputPointContextExamples { // Метод команды, которая получает массив геометрических объектов, // участвующих в вычислении привязанной точки (оснапа). [Teigha.Runtime.CommandMethod("GetKeyPointEntitiesExample")] public void GetKeyPointEntitiesExample() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Метод для отработки события редактора PointMonitor editor.PointMonitor += (sender, e) => { // Сохраняем контекст события в преременную InputPointContext context = e.Context; // Выводим в комнадную строку данные об операции if (context != null) { FullSubentityPath[] keyEntities = context.GetKeyPointEntities(); if (keyEntities != null && keyEntities.Length > 0) { editor.WriteMessage($"\nКоличество объектов, участвующих в оснапе: {keyEntities.Length}"); foreach (var path in keyEntities) { editor.WriteMessage($"\nУчаствует объект: {path.SubentId}"); } } } }; } }
 Ссылки
 HostMgd.EditorInput.InputPointContext, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!