Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.DeviceInputEventArgs.Handled
 Послать отзыв
 Свойство Handled позволяет выяснить или указать, обработано событие или нет. Не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool Handled;
Копировать Код
Public Property Handled As Boolean
 Возвращает
 Возвращает true, если событие обработано. В противном случае возвращает false.
 Описание
 Свойство Handled позволяет управлять состоянием флага, указывающего, обработано событие или ещё нет.
 В текущей версии не реализовано.
 Условия
 Чтение и запись.
 Ссылки
 HostMgd.EditorInput.DeviceInputEventArgs, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!