Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptEntityResultEventHandler(object,PromptEntityResultEventArgs)
 Послать отзыв
 Делегат предназначен для обработки событий, возникающих после завершения выбора геометрического объекта пользователем в редакторе nanoCAD.
 Синтаксис
C#
Visual Basic
Копировать Код
public delegate void PromptEntityResultEventHandler(object sender, PromptEntityResultEventArgs e);
Копировать Код
Public Delegate Sub PromptEntityResultEventHandler(sender As Object, e As PromptEntityResultEventArgs)
 Параметры
 Параметры
 Описание
 sender
 Источник события, обычно представляет собой экземпляр редактора (Editor), в котором произошёл выбор объекта. Тип object
 e
 Объект, содержащий данные о результате выбора:
 Описание
 Делегат используется как сигнатура метода-обработчика для событий, связанных с операцией выбора объекта — таких как PromptedForEntity. Он позволяет получить информацию о результате выбора: идентификатор (ObjectId) выбранного объекта, точку выбора (PickedPoint) и статус выполнения операции (PromptStatus). Делегат предоставляет доступ к этим данным через параметр e, который является экземпляром класса PromptEntityResultEventArgs.
 Этот тип делегата особенно полезен при разработке плагинов или надстроек, где требуется реагировать на выбор объектов в чертеже и выполнять дальнейшие действия — например, модификацию, анализ или создание новых объектов на основе выбранного элемента.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события PromptedForEntity [Teigha.Runtime.CommandMethod("PromptedForEntityExample")] public void PromptedForEntityExample() { // Подписка на событие PromptedForEntity editor.PromptedForEntity += OnEditorPromptedForEntity; } // Реализация отработки события PromptedForEntity private void OnEditorPromptedForEntity(object sender, PromptEntityResultEventArgs e) { // Вывод сообщения в командную строку if (e.Result.Status == PromptStatus.OK && !e.Result.ObjectId.IsNull) { editor.WriteMessage($"\nВыбран объект: {e.Result.ObjectId.ObjectClass.Name}, точка: {e.Result.PickedPoint}"); } else { editor.WriteMessage("\nНе удалось получить объект."); } } }
 Ваши комментарии по поводу этого топика: Послать отзыв!