Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptKeywordOptionsEventHandler(object, PromptKeywordOptionsEventArgs)
 Послать отзыв
 Делегат предназначен для обработки события, возникающего перед началом ввода ключевого слова, и позволяет настроить параметры выбора.
 Синтаксис
C#
Visual Basic
Копировать Код
public delegate void PromptKeywordOptionsEventHandler(object sender, PromptKeywordOptionsEventArgs e);
Копировать Код
Public Delegate Sub PromptKeywordOptionsEventHandler(sender As Object, e As PromptKeywordOptionsEventArgs)
 Параметры
 Параметры
 Описание
 sender
 Источник события — обычно экземпляр редактора (Editor), в котором происходит ввод ключевого слова. Тип object
 e
 Объект, содержащий параметры ввода ключевого слова:
 Описание
 Делегат используется как сигнатура метода-обработчика для события PromptingForKeyword, которое генерируется перед началом интерактивного ввода ключевого слова в редакторе nanoCAD. Он позволяет разработчику изменять параметры команды ввода — такие как сообщение приглашения, список доступных ключевых слов и режимы ввода — до того, как пользователь увидит запрос.
 Этот делегат применяется при реализации команд, где требуется выбор из ограниченного набора вариантов — например, "Да/Нет", "Вкл/Выкл", "Сохранить/Отмена". Он обеспечивает гибкость при настройке интерфейса взаимодействия с пользователем в зависимости от контекста.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события PromptingForKeyword [Teigha.Runtime.CommandMethod("PromptingForKeywordExample")] public void PromptingForKeywordExample() { // Подписка на событие PromptingForKeyword editor.PromptingForKeyword += OnEditorPromptingForKeyword; } // Реализация отработки события PromptingForKeyword private void OnEditorPromptingForKeyword(object sender, PromptKeywordOptionsEventArgs e) { // Изменение сообщения e.Options.Message = "Выберите действие:"; // Добавление ключевых слов e.Options.Keywords.Add("Включить"); e.Options.Keywords.Add("Отключить"); e.Options.Keywords.Add("По умолчанию"); } }
 Ваши комментарии по поводу этого топика: Послать отзыв!