Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Класс HostMgd.ApplicationServices.BeginDoubleClickEventArgs
 Послать отзыв
 Класс предназначен для хранения информации о событии двойного щелчка.
 Иерархия классов
HostMgd::ApplicationServices::BeginDoubleClickEventArgs
 Синтаксис
C#
Visual Basic
public class BeginDoubleClickEventArgs : System.EventArgs;
Public Class BeginDoubleClickEventArgs Inherits System.EventArgs
 Описание
 Класс представляет собой тип данных для параметров, относящихся к событиям двойного щелчка.
 Содержит параметры, относящиеся к событиям двойного щелчка.
 Содержит параметры, относящиеся к событиям двойного щелчка.
 Топики
 Имя
 Описание
 BeginDoubleClickEventArgs Свойства
 Ниже перечислены свойства класса BeginDoubleClickEventArgs.
 Ссылки
 BeginDoubleClickEventArgs Свойства, Топики, BeginDoubleClickEventArgs Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!