Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PrintForm.UpperSheetProgressRange
 Послать отзыв
 Верхняя граница индикатора печати
 Синтаксис
C#
Visual Basic
public int UpperSheetProgressRange;
Public Property UpperSheetProgressRange() As Integer
 Ссылки
 PrintForm Класс, Пространство имен HostMgd
 Ваши комментарии по поводу этого топика: Послать отзыв!