Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.Application.IsInBackgroundMode
 Послать отзыв
 СВОЙСТВО НЕ РЕАЛИЗОВАНО. ВСЕГДА ВОЗВРАЩАЕТ FALSE.
 Синтаксис
C#
Visual Basic
Копировать Код
public static bool IsInBackgroundMode
Копировать Код
Public Shared ReadOnly Property IsInBackgroundMode As Boolean
 Ссылки
 HostMgd.ApplicationServices.Application, HostMgd.ApplicationServices Пространство имен
 Исключения
 MGD NOT_IMPLEMENTED
 Ваши комментарии по поводу этого топика: Послать отзыв!