Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Keyword.LocalName
 Послать отзыв
 Синтаксис
C#
Visual Basic
public String LocalName;
Public Property LocalName() As String
 Описание
 Свойство возвращает или устанавливает локальное имя ключевого слова (которое обычно изображается на экране).
 Условия
 На чтение и запись
 Ссылки
 Keyword Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!