Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.Document.UnknownCommand
 Послать отзыв
 Событие, возникающее при вызове команды, которую nanoCAD не распознает.
 Синтаксис
C#
Visual Basic
public event UnknownCommandEventHandler UnknownCommand;
Public Event UnknownCommand As UnknownCommandEventHandler
 Возвращает
 Возвращает тип данных UnknownCommandEventHandler
 Описание
 Событие, возникающее при вызове команды, которую nanoCAD не распознает. Соответствует функции NRX API NcEditorReactor.unknownCommand().
 Ссылки
 HostMgd.ApplicationServices.Document, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!