Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Перечисление HostMgd.EditorInput.SelectionMethod
 Послать отзыв
 Синтаксис
C#
Visual Basic
public enum SelectionMethod { Crossing = 3, Fence = 4, NonGraphical = 0, PickPoint = 1, SubEntity = 5, Unavailable = -1, Window = 2 }
Public Enum SelectionMethod Crossing = 3 Fence = 4 NonGraphical = 0 PickPoint = 1 SubEntity = 5 Unavailable = -1 Window = 2 End Enum
 Описание
 Перечисление, обозначающее различные методы выбора объектов в nanoCAD.
 Члены перечисления
 Описание
 Crossing = 3
 Выбор пересечением или пересечением многоугольником.
При выборе перечесением с многоугольником, Id окна указывается в подсписке данных геометрического объекта, чтобы идентифицировать, какое пересечение было использовано для выбора геометрического объекта. Id окна также указывается в списке данных для выбора включением/пересечением с окном или включением в многоугольник. По совпадению этих Id приложение может определить всю информацию о том, как геометрический объект был выбран.
Id окон начинаются с -1 и последовательно уменьшаются (т.е., становятся -2, -3 и т.д.). Каждое отдельное пересечение, используемое в процессе выбора, получает свой собственный Id.
 Fence = 4
 Выбор объекта путём указания точки на его теле.
Для такого выбора выбранная точка должна пересекаться с выбираемым геометрическим объектом. Список данных точки пересечения такой же, как и для обычной базовой точки, но содержит подсписок для каждого пересечения между точкой и видимым ребром геометрического объекта
 NonGraphical = 0
 Не графический выбор.
Если выбор производится этим не графическим методом, то только метод выбора, имя геометрического объекта и GS марке будут содержаться в подсписке.
 PickPoint = 1
 Указание точкой.
Для геометрических объектов, выбранных этим методом, содержится примерно такая же информация, как и информация для GS маркера
 SubEntity = 5
 Выбор геометрического подобъекта.
Этот метод выбора когда геометрический объект попадает в выбранный набор из-за того, что выбора его подобъект. В этом случае формат результатов такой-же, как и для не графического метода выбора
 Unavailable = -1
 Нет доступных методов выбора
 Window = 2
 Выбор окном или многоугольником.
Для выбора многоугольником, Id окна заносится в подсписок данных геометрического объекта, чтобы идентифицировать, какое окно использовалось для выбора геометрического объекта.
Id окна также указывается в списке данных для выбора включением/пересечением с окном или включением в многоугольник. По совпадению этих Id приложение может определить всю информацию о том, как геометрический объект был выбран.
Id окон начинаются с -1 и последовательно уменьшаются (т.е., становятся -2, -3 и т.д.). Каждое отдельное пересечение, используемое в процессе выбора, получает свой собственный Id.
 Ваши комментарии по поводу этого топика: Послать отзыв!