Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.GraphicsSystem.Manager.CreateAutoCADModel
 Послать отзыв
 Метод создаёт объект Teigha.GraphicsSystem.Model, представляющий коллекции отображаемых объектов платформы ODA Platform.
 Синтаксис
C#
Visual Basic
Копировать Код
public Teigha.GraphicsSystem.Model CreateAutoCADModel();
Копировать Код
Public Function CreateAutoCADModel() As Teigha.GraphicsSystem.Model
 Возвращает
 Возвращает созданный объект модели GS. Тип Teigha.GraphicsSystem.Model.
 Описание
 Метод создаёт объект Teigha.GraphicsSystem.Model, представляющий коллекции отображаемых графических объектов платформы ODA Platform.
 Фактически, класс представляет собой абстракцию базы данных. Эта база данных может быть объектом Database, контейнером для временной графики (например, Icon и Grid) или представлять другой постоянный формат базы данных, например DWF. Существенно то, что Model предоставляет базе данных механизм для информирования графической системы (GS) об изменениях (добавление, удаление и изменение). Каждому экземпляру Model назначается свой RenderType, по которому GS определяет тип визуализации геометрии этой модели.
 Ссылки
 HostMgd.GraphicsSystem.Manager, HostMgd.GraphicsSystem
 Ваши комментарии по поводу этого топика: Послать отзыв!