Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод PlotEngine.BeginGenerateGraphics
 Послать отзыв
 Метод начала собственно печати.
 Синтаксис
C#
Visual Basic
public void BeginGenerateGraphics(ref System.Object parameters);
Public Sub BeginGenerateGraphics(ByRef parameters As System.Object)
 Описание
 После него необходимо вызвать метод EndGenerateGraphics
 Ссылки
 PlotEngine Класс, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!