Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.Document.CloseAndSave(String)
 Послать отзыв
 Метод предназначен для закрытия dwg-документа с предварительным сохранением.
 Синтаксис
C#
Visual Basic
public void CloseAndSave(ref String fileName);
Public Sub CloseAndSave(ByRef fileName As String)
 Параметры
 Параметры
 Описание
 fileName
 Полный путь к файлу c его названием. Тип String
 Описание
 Метод сохраняет dwg-документ в файле, заданном именем fileName, и после закрывает документ.
 Ссылки
 HostMgd.ApplicationServices.Document, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!