Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptResult.Status
 Послать отзыв
 Свойство возвращает статус выполнения операции ввода, завершённой пользователем, например, OK, Cancel или Error.
 Синтаксис
C#
Visual Basic
Копировать Код
public PromptStatus Status { get; }
Копировать Код
Public ReadOnly Property Status As PromptStatus
 Возвращает
 Возвращает значение типа PromptStatus — это перечисление, содержащее следующие возможные статусы:
PromptStatus.OK — операция завершена успешно, введённое значение допустимо.
PromptStatus.Cancel — пользователь отменил операцию (например, нажав Esc).
PromptStatus.Error — произошла ошибка ввода (например, введено некорректное значение).
PromptStatus.None — операция завершена без ввода значения.
PromptStatus.Keyword — введено ключевое слово вместо ожидаемого значения.
PromptStatus.Timeout — операция прервана по таймауту.
 Описание
 Свойство используется для получения информации о результате интерактивной операции ввода, такой как GetInteger(), GetString(), GetPoint() и другие. Оно предоставляет значение из перечисления PromptStatus, указывающее, как завершена операция: успешно, отменена пользователем или прервана по ошибке. Свойство доступно только для чтения и автоматически устанавливается после завершения ввода.
 Условия
 Только чтение
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("PromptResultExample_Status")] public void PromptResultExample_Status() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создаём запрос пользователю PromptPointOptions options = new PromptPointOptions("nУкажите точку:"); options.BasePoint = new Point3d(0, 0, 0); PromptPointResult result = editor.GetPoint(options); // Если все данные введены, выводим результат в командную строку if (result.Status == PromptStatus.OK) { Point3d pt = result.Value; editor.WriteMessage( $"\nВыбранная точка: {pt}"); } else { editor.WriteMessage( "\nВвод точки отменен или произошла ошибка."); } } }
 Ссылки
 HostMgd.EditorInput.PromptResult, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!