Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Делегат HostMgd.Publishing.AboutToBeginPublishingEventHandler
 Послать отзыв
 This is type HostMgd::Publishing::AboutToBeginPublishingEventHandler.
 Синтаксис
C#
Visual Basic
public delegate AboutToBeginPublishingEventHandler();
Public Delegate Sub AboutToBeginPublishingEventHandler()
 Ваши комментарии по поводу этого топика: Послать отзыв!