Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.HostAppServices.UpdatePlotJobStatus
 Послать отзыв
 Метод обеспечивает передачу хост-приложению событий, условий и результатов вывода на печать.
 Синтаксис
C#
Visual Basic
Копировать Код
public static void UpdatePlotJobStatus( HostMgd.PlottingServices.AppPlotStatus status, ref System.String message );
Копировать Код
Public Shared Sub UpdatePlotJobStatus( status As HostMgd.PlottingServices.AppPlotStatus, ByRef message As System.String )
 Параметры
 Параметры
 Описание
 status
 Входной статус задания на печать. Перечисление HostMgd.PlottingServices.AppPlotStatus.
 message
 Входное сообщение печати или имя DWF-файла. Тип System.String.
 Описание
 Метод обеспечивает передачу хост-приложению событий, условий и результатов вывода на печать. Подразумевается, что хост-приложение соответствующим образом обновляет элементы пользовательского интерфейса, чтобы визуально отображать текущее состояние задания на печать.
 Ссылки
 HostMgd.PlottingServices.HostAppServices, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!