Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.InplaceTextEditor.ForcedOpaqueBackground
 Послать отзыв
 Свойство ForcedOpaqueBackground позволяет проверить, сделан ли принудительно фон непрозрачным. В текущей версии не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool ForcedOpaqueBackground;
Копировать Код
Public ReadOnly Property ForcedOpaqueBackground As Boolean
 Возвращает
 Возвращает true, если текущая фоновая заливка в данном объекте принудительно сделана непрозрачной. В противном случае возвращает false.
 Описание
 Свойство ForcedOpaqueBackground позволяет проверить, сделан ли принудительно фон в данном редакторе непрозрачным. В текущей версии не реализовано.
 Условия
 Только чтение.
 Ссылки
 HostMgd.ApplicationServices.InplaceTextEditor, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!