Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PaletteActivatedEventArgs.Activated
 Послать отзыв
 This is Activated, a member of class PaletteActivatedEventArgs.
 Синтаксис
C#
Visual Basic
public HostMgd::Windows::Palette Activated;
Public Property Activated() As HostMgd.Windows.Palette
 Ссылки
 PaletteActivatedEventArgs Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!