Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.EndDocumentEventArgs.EndDocumentEventArgs
 Послать отзыв
 Конструктор класса EndDocumentEventArgs. Создает экземпляр класса с указанным статусом PlotCancelStatus.
 Синтаксис
C#
Visual Basic
Копировать Код
public EndDocumentEventArgs( HostMgd.PlottingServices.PlotCancelStatus status );
Копировать Код
Public Sub New( status As HostMgd.PlottingServices.PlotCancelStatus )
 Параметры
 Параметры
 Описание
 status
 Входное значение статуса отмены печати. Тип HostMgd.PlottingServices.PlotCancelStatus.
 Описание
 Конструктор класса EndDocumentEventArgs. Создает экземпляр класса с заданным состоянием статуса отмены печати PlotCancelStatus.
 Ссылки
 HostMgd.PlottingServices.EndDocumentEventArgs, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!