Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.CrossingOrWindowSelectedObject.ToString(IFormatProvider)
 Послать отзыв
 Синтаксис
C#
Visual Basic
public String ToString(ref IFormatProvider provider);
Public Function ToString(ByRef provider As IFormatProvider) As String
 Параметры
 Параметры
 Описание
 provider
 Формат (с учетом локализации)
 Описание
 Возвращает строковое представление данного объекта в формате (с учетом локализации), определенном параметром метода.
 Ссылки
 HostMgd.EditorInput.CrossingOrWindowSelectedObject, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!