Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PlotConfigManager.NamedPlotStyles
 Послать отзыв
 Свойство возвращает список файлов стилей печати (STB) с полным путём доступа Только для чтения.
 Синтаксис
C#
Visual Basic
public System.Collections.Specialized.StringCollection NamedPlotStyles;
Public Property NamedPlotStyles() As System.Collections.Specialized.StringCollection
 Описание
 Ссылки
 PlotConfigManager Класс, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!