Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.DsdEntry.OriginalSheetPath
 Послать отзыв
 Свойство OriginalSheetPath представляет путь к исходному листу, который подлежит публикации. Не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public System.String OriginalSheetPath;
Копировать Код
Public Property OriginalSheetPath As System.String
 Возвращает
 Возвращает путь к исходному листу, который подлежит публикации. Тип System.String.
 Описание
 Свойство OriginalSheetPath представляет путь к исходному листу, который подлежит публикации.
 В текущей версии не реализовано.
 Условия
 Чтение и запись.
 Ссылки
 HostMgd.PlottingServices.DsdEntry, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!