Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PrintForm.CancelSheetButtonMessage
 Послать отзыв
 This is CancelSheetButtonMessage, a member of class PrintForm.
 Синтаксис
C#
Visual Basic
public System.String CancelSheetButtonMessage;
Public Property CancelSheetButtonMessage() As System.String
 Ссылки
 PrintForm Класс, Пространство имен HostMgd
 Ваши комментарии по поводу этого топика: Послать отзыв!