Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.PromptedForNestedEntity
 Послать отзыв
 Событие возникает после завершения операции выбора вложенного геометрического объекта — например, внутри блока или внешней ссылки. Событие не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public event PromptNestedEntityResultEventHandler PromptedForNestedEntity;
Копировать Код
Public Event PromptedForNestedEntity As PromptNestedEntityResultEventHandler
 Описание
 Событие инициируется системой nanoCAD после завершения выбора вложенного объекта — элемента, входящего в состав блока или внешней ссылки. Оно используется в связке с методом GetNestedEntity() и предоставляет разработчикам надстроек возможность обработать результат выбора, включая идентификатор объекта и точку, в которой он был выбран.
 Событие реализуется через делегат PromptNestedEntityResultEventHandler, который передаёт объект PromptNestedEntityResultEventArgs, содержащий:
ObjectId — идентификатор выбранного вложенного объекта.
PickedPoint — точка выбора в мировой системе координат (WCS).
Transform — матрица преобразования, применённая к объекту внутри блока.
Status — статус завершения операции (OK, Cancel, Error и др.).
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события PromptedForNestedEntity [Teigha.Runtime.CommandMethod("PromptedForNestedEntityExample")] public void PromptedForNestedEntityExample() { // Подписка на событие PromptedForNestedEntity editor.PromptedForNestedEntity += OnEditorPromptedForNestedEntity; } // Реализация отработки события PromptedForNestedEntity private void OnEditorPromptedForNestedEntity(object sender, PromptNestedEntityResultEventArgs e) { // Вывод сообщения в командную строку if (e.Result.Status == PromptStatus.OK) { editor.WriteMessage($"\nВыбран вложенный объект: {e.Result.ObjectId}, точка: {e.Result.PickedPoint}"); } else { editor.WriteMessage("\nВыбор вложенного объекта отменён."); } } }
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!