Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.Application.ShowConnectHomepage()
 Послать отзыв
 МЕТОД НЕ РЕАЛИЗОВАН.
 Синтаксис
C#
Visual Basic
Копировать Код
public static void ShowConnectHomepage();
Копировать Код
Public Shared Sub ShowConnectHomepage()
 Ссылки
 HostMgd.ApplicationServices.Application, HostMgd.ApplicationServices Пространство имен
 Исключения
 MGD NOT_IMPLEMENTED
 Ваши комментарии по поводу этого топика: Послать отзыв!