Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PaletteAddContextMenuEventArgs.MenuItems
 Послать отзыв
 This is MenuItems, a member of class PaletteAddContextMenuEventArgs.
 Синтаксис
C#
Visual Basic
public System.Collections.Generic.List<HostMgd::Windows::MenuItem^> MenuItems;
Public Property MenuItems() As System.Collections.Generic.List<HostMgd.Windows.MenuItem^>
 Ссылки
 PaletteAddContextMenuEventArgs Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!