Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор ToolAttribute.ToolAttribute (System::String^, System::String^)
 Послать отзыв
 This is ToolAttribute, a member of class ToolAttribute.
 Синтаксис
C#
Visual Basic
public ToolAttribute(ref System.String toolName, ref System.String toolImage);
Public Sub New(ByRef toolName As System.String, ByRef toolImage As System.String)
 Ссылки
 ToolAttribute Класс, HostMgd.Windows.ToolPalette
 Ваши комментарии по поводу этого топика: Послать отзыв!