Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Делегат HostMgd.Windows.PalettePersistEventHandler
 Послать отзыв
 This is type HostMgd::Windows::PalettePersistEventHandler.
 Синтаксис
C#
Visual Basic
public delegate PalettePersistEventHandler();
Public Delegate Sub PalettePersistEventHandler()
 Ваши комментарии по поводу этого топика: Послать отзыв!