Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.Application.LoadMainMenu(String)
 Послать отзыв
 МЕТОД НЕ РЕАЛИЗОВАН. ВСЕГДА ВОЗВРАЩАЕТ FALSE. Метод предназначен для изменения основного меню.
 Синтаксис
C#
Visual Basic
Копировать Код
public static bool LoadMainMenu(string filename);
Копировать Код
Public Shared Function LoadMainMenu(filename As String) As Boolean
 Возвращает
 Тип bool: true - меню успешно загружено, flase - при загрузке возникли ошибки.
 Описание
 Метод изменяет меню в соответствии с указанным файлом cuix, где описаны нужные изменения в основном меню. Изменения меню в корпоративной версии nanoCAD невозможны. Если файл меню по указанному пути не найден или в параметре указано название файла без пути, то метод ищет файл по пути поиска вспомогательных файлов. Функциональность метда идентична использованию команды МЕНЮ. Если в параметре указано ".", то основное меню выгружается.
 Примечания
 Возможные ошибки:файл не найден.
 Ссылки
 HostMgd.ApplicationServices.Application, HostMgd.ApplicationServices Пространство имен
 Исключения
 MGD NOT_IMPLEMENTED
 Ваши комментарии по поводу этого топика: Послать отзыв!