Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Событие Publisher.AboutToBeginPublishing
 Послать отзыв
 This is AboutToBeginPublishing, a member of class Publisher.
 Синтаксис
C#
Visual Basic
public event AboutToBeginPublishingEventHandler AboutToBeginPublishing;
Public Event AboutToBeginPublishing As AboutToBeginPublishingEventHandler
 Ссылки
 Publisher Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!