Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.PlotInfoValidator.SheetDimensionalWeight
 Послать отзыв
 Свойство SheetDimensionalWeight представляет весовой коэффициент для размеров листа, определенный в конфигурации печати.
 Синтаксис
C#
Visual Basic
Копировать Код
public int SheetDimensionalWeight;
Копировать Код
Public Property SheetDimensionalWeight As Integer
 Возвращает
 Возвращает весовой коэффициент для размеров листа. Тип int.
 Описание
 Свойство SheetDimensionalWeight представляет весовой коэффициент для размеров листа в конфигурации печати, связанной с объектом PlotInfo.
 Замечания
 См. описание свойства MediaMatchingThreshold.
 Условия
 Чтение и запись.
 Ссылки
 HostMgd.PlottingServices.PlotInfoValidator, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!