Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.InputPointContext.CartesianSnappedPoint
 Послать отзыв
 Свойство предназначено для получения точки, привязанной по прямоугольной (декартовой) сетке, если в контексте ввода был активирован соответствующий режим привязки.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d CartesianSnappedPoint;
Копировать Код
Public Property CartesianSnappedPoint() As Point3d
 Возвращает
 Возвращает объект типа Point3d — координаты привязанной точки в мировой системе координат (WCS), скорректированной по прямоугольной сетке. Возвращает старый стиль привязки в случае, если в истории установлен признак CartSnapped. Если режим декартовой привязки не был активен, возвращается некорректное или исходное значение. При отсутствии привязки может совпадать с RawPoint.
 Описание
 Свойство предоставляет доступ к координатам точки, которая была скорректирована с учётом прямоугольного режима привязки, аналогичного устаревшему CartSnap. Оно возвращает значение только в том случае, если в истории операции ввода установлен внутренний признак CartSnapped, указывающий на то, что была выполнена декартова коррекция положения курсора.
 Это свойство используется в обработчиках событий, связанных с мониторингом или фильтрацией ввода точки (PointMonitor, PointFilter), и позволяет определить, применялась ли привязка по фиксированной сетке — например, при включённом режиме SNAP в интерфейсе nanoCAD.
 Свойство актуально исключительно в тех случаях, когда пользователь работает с активной прямоугольной привязкой, а система выполняет выравнивание курсора по шагам сетки.
 Условия
 Только чтение
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class InputPointContextExamples { // Метод команды, которая получает точку, привязанную по прямоугольной (декартовой) сетке, // если в контексте ввода был активирован соответствующий режим привязки [Teigha.Runtime.CommandMethod("CartesianSnappedPointExample")] public void CartesianSnappedPointExample() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Метод для отработки события редактора PointMonitor editor.PointMonitor += (sender, e) => { // Сохраняем контекст события в преременную InputPointContext context = e.Context; // Выводим в комнадную строку данные об операции if (context != null) { Point3d cartPoint = context.CartesianSnappedPoint; editor.WriteMessage($"\nТочка по сетке: {cartPoint}"); } }; } }
 Ссылки
 HostMgd.EditorInput.InputPointContext, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!