Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод MenuItemCollection.Contains (System::Object^)
 Послать отзыв
 This is Contains, a member of class MenuItemCollection.
 Синтаксис
C#
Visual Basic
public bool Contains(ref System.Object value);
Public Function Contains(ByRef value As System.Object) As bool
 Ссылки
 MenuItemCollection Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!