Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PublishSheetEventArgs.MaxBoundsY
 Послать отзыв
 This is MaxBoundsY, a member of class PublishSheetEventArgs.
 Синтаксис
C#
Visual Basic
public double MaxBoundsY;
Public Property MaxBoundsY() As Double
 Ссылки
 PublishSheetEventArgs Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!