Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство DocumentLockModeWillChangeEventArgs.MyCurrentMode
 Послать отзыв
 Синтаксис
C#
Visual Basic
public HostMgd::ApplicationServices::DocumentLockMode MyCurrentMode;
Public Property MyCurrentMode() As HostMgd.ApplicationServices.DocumentLockMode
 Описание
 Возвращает режим блокировки документа, который был установлен текущим слоем.
 Условия
 Только на чтение
 Ссылки
 DocumentLockModeWillChangeEventArgs Класс, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!