Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод TransactionManager.FlushGraphics
 Послать отзыв
 This is FlushGraphics, a member of class TransactionManager.
 Синтаксис
C#
Visual Basic
public void FlushGraphics();
Public Sub FlushGraphics()
 Ссылки
 TransactionManager Класс, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!