Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PaletteActivatedEventArgs.Deactivated
 Послать отзыв
 This is Deactivated, a member of class PaletteActivatedEventArgs.
 Синтаксис
C#
Visual Basic
public HostMgd::Windows::Palette Deactivated;
Public Property Deactivated() As HostMgd.Windows.Palette
 Ссылки
 PaletteActivatedEventArgs Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!