Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.InplaceTextEditor.CanCut
 Послать отзыв
 Свойство CanCut позволяет проверить, возможно ли вырезать текст с сохранением его в буфере обмена. В текущей версии не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool CanCut;
Копировать Код
Public ReadOnly Property CanCut As Boolean
 Возвращает
 Возвращает true, если вырезание текста разрешено. В противном случае возвращает false.
 Описание
 Свойство CanCut позволяет проверить, возможно ли вырезать текст с сохранением его в буфере обмена. В текущей версии не реализовано.
 Условия
 Только чтение.
 Ссылки
 HostMgd.ApplicationServices.InplaceTextEditor, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!