Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Структура HostMgd.Publishing.OptionsDialogResult
 Послать отзыв
 Структура возвращаемого результата метода ShowDwfOptionsDialog класса Publisher
 Синтаксис
C#
Visual Basic
public struct OptionsDialogResult { }
Public Structure OptionsDialogResult End Structure
 Топики
 Имя
 Описание
 OptionsDialogResult Свойства
 Ниже перечислены свойства класса OptionsDialogResult.
 Ссылки
 OptionsDialogResult Свойства, Топики, OptionsDialogResult Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!