Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Класс HostMgd.EditorInput.JigPromptOptions
 Послать отзыв
 Класс предназначен для хранения набора параметров, которые используются во время операции Jig.
 Иерархия классов
HostMgd::EditorInput::PromptOptions HostMgd::EditorInput::JigPromptOptions
 Синтаксис
C#
Visual Basic
public class JigPromptOptions : PromptOptions;
Public Class JigPromptOptions Inherits PromptOptions
 Описание
 Абстрактный класс, предназначенный для для хранения набора параметров, которые используются во время операции Jig. Является базовым классом для классов JigPromptGeometryOptions и JigPromptStringOptions.
 Класс предоставляет возможность установить для опрерации Jig приглашающее сообщение, ключевые слова, внешний вид курсора и изменить пользовательские настройки ввода.
 Топики
 Имя
 Описание
 PromptOptions Методы
 Ниже перечислены методы класса PromptOptions.
 PromptOptions Свойства
 Ниже перечислены свойства класса PromptOptions.
 Класс HostMgd.EditorInput.JigPromptOptions
 Имя
 Описание
 JigPromptOptions Методы
 Ниже перечислены методы класса JigPromptOptions.
 JigPromptOptions Свойства
 Ниже перечислены свойства класса JigPromptOptions.
 Ссылки
 JigPromptOptions Методы, JigPromptOptions Свойства, Топики, PromptOptions Методы, PromptOptions Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!