Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод XrefFileLock.ReleaseFile ()
 Послать отзыв
 Синтаксис
C#
Visual Basic
public void ReleaseFile();
Public Sub ReleaseFile()
 Описание
 Освобождение, сохранение и перезагрузка файла внешней ссылки, содержащего новые (внесенные при редактировании) изменения. Все другие ссылки блоков, которые ссылаются на тот же самый файл, также будут обновлены.
 Данные внутреннего массива объекта, определенные для записи таблицы блоков (в соответствии с ID), используются для определения того, какие внешние ссылки на файл рассинхронизированы с тем, чтобы перезагрузить файл. Данные внутреннего массива заполняются методом ConsistencyCheck(). Если эти данные пустые, то перезагрузка не выполняется. В любом случае, после перезагрузки, эти данные очищаются (устанавливаются в null).
 Ссылки
 XrefFileLock Класс, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!