Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.Windows.ToolPalette.CustomToolBase.EditMode
 Послать отзыв
 Свойство EditMode позволяет проверить, находится ли данный инструмент в режиме редактирования. Не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual int EditMode;
Копировать Код
Public Overridable ReadOnly Property EditMode As Integer
 Возвращает
 Возвращает значение флага режима редактирования инструмента. Тип int.
 Описание
 Свойство EditMode позволяет проверить, находится ли данный инструмент в режиме редактирования.
 В текущей версии не реализовано.
 Условия
 Только чтение.
 Ссылки
 HostMgd.Windows.ToolPalette.CustomToolBase, HostMgd.Windows.ToolPalette
 Ваши комментарии по поводу этого топика: Послать отзыв!