Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PublishSheetEventArgs.DrawingScale
 Послать отзыв
 This is DrawingScale, a member of class PublishSheetEventArgs.
 Синтаксис
C#
Visual Basic
public double DrawingScale;
Public Property DrawingScale() As Double
 Ссылки
 PublishSheetEventArgs Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!