Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Класс HostMgd.EditorInput.PromptFileNameResult
 Послать отзыв
 Иерархия классов
HostMgd::EditorInput::PromptResult HostMgd::EditorInput::PromptFileNameResult
 Синтаксис
C#
Visual Basic
public class PromptFileNameResult : PromptResult;
Public Class PromptFileNameResult Inherits PromptResult
 Описание
 Класс содержит результат, возвращаемый после приглашения, требующего ввода имени файла в методах Editor.GetFileNameForSave() и Editor.GetFileNameForOpen().
 Топики
 Имя
 Описание
 PromptResult Методы
 Ниже перечислены методы класса PromptResult.
 PromptResult Свойства
 Ниже перечислены свойства класса PromptResult.
 Класс HostMgd.EditorInput.PromptFileNameResult
 Имя
 Описание
 PromptFileNameResult Методы
 Ниже перечислены методы класса PromptFileNameResult.
 PromptFileNameResult Свойства
 Ниже перечислены свойства класса PromptFileNameResult.
 Ссылки
 PromptFileNameResult Методы, PromptFileNameResult Свойства, Топики, PromptResult Методы, PromptResult Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!