Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptIntegerResult.ToString(IFormatProvider)
 Послать отзыв
 Метод возвращает строковое представление целого числа, введённого пользователем, с учётом локализации и форматирования, заданного провайдером.
 Синтаксис
C#
Visual Basic
Копировать Код
public sealed override string ToString(IFormatProvider provider);
Копировать Код
Public NotOverridable Overrides Function ToString(provider As IFormatProvider) As String
 Параметры
 Параметры
 Описание
 provider
 Объект, предоставляющий информацию о форматировании чисел, дат и других значений в зависимости от локализации. Может быть:
 Возвращает
 Возвращает значение типа string, представляющее результат операции ввода:
Для успешного ввода (Status == OK) — строка с числом, отформатированным с учётом провайдера.
Для отмены или ошибки — строка, отражающая статус операции (например, "Operation cancelled").
 Описание
 Метод переопределяет стандартный метод и возвращает строку, отражающую результат ввода целого числа через интерактивное приглашение в nanoCAD. В отличие от базового ToString(), этот метод принимает IFormatProvider, что позволяет форматировать число в соответствии с региональными настройками — например, учитывать локализацию при отладке, логировании или отображении информации в командной строке.
 Метод возвращает:
 Значение Value в виде строки, если статус операции OK. Сообщение об отмене или ошибке, если ввод не был успешно завершён.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("PromptIntegerResultExample_ToString_IFormatProvider")] public void PromptIntegerResultExample_ToString_IFormatProvider() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создаём запрос пользователю PromptIntegerOptions iopts = new PromptIntegerOptions("Введите целое число"); iopts.DefaultValue = 10; iopts.LowerLimit = 0; iopts.UpperLimit = 100; // Вызываем метод GetInteger() для запроса пользователю PromptIntegerResult result = editor.GetInteger(iopts); // Если все данные введены, выводим результат в командную строку if (PromptStatus.OK == result.Status) { string formatted = result.ToString(CultureInfo.InvariantCulture); editor.WriteMessage($"\nВведено: {formatted}"); } else { editor.WriteMessage("\nОтмена или ошибка ввода."); } } }
 Ссылки
 HostMgd.EditorInput.PromptIntegerResult, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!