Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.Windows.ToolPalette.CustomToolBase.Edit
 Послать отзыв
 Метод предназначен для редактирования свойства инструмента в окне, заданном дескриптором окна типа long. Не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Edit( ref System.Object property, long parentWindow, bool success );
Копировать Код
Public Sub Edit( ByRef property As System.Object, parentWindow As long, success As Boolean )
 Параметры
 Параметры
 Описание
 property
 Входной объект, определяющий редактируемое свойство. Тип System.Object.
 parentWindow
 Дескриптор родительского окна. Тип long.
 success
 Флаг завершения процедуры. Тип bool. Возвращает true в случае успешного завершения и false в противном случае.
 Описание
 Метод предназначен для редактирования свойства property инструмента в окне, заданном дескриптором окна parentWindow типа long.
 В текущей версии не реализован.
 Ссылки
 HostMgd.Windows.ToolPalette.CustomToolBase, HostMgd.Windows.ToolPalette
 Ваши комментарии по поводу этого топика: Послать отзыв!