Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.RecentDocument.LastOpenedTime
 Послать отзыв
 Свойство LastOpenedTime представляет время последнего открытия документа. В текущей версии данное свойство не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public ValueType LastOpenedTime;
Копировать Код
Public ReadOnly Property LastOpenedTime As ValueType
 Возвращает
 Возвращает время последнего открытия документа. Тип ValueType.
 Описание
 Свойство LastOpenedTime представляет время последнего открытия документа. В текущей версии данное свойство не реализовано.
 Условия
 Только чтение.
 Ссылки
 HostMgd.ApplicationServices.RecentDocument, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!