Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PublishSheetEventArgs.LayoutMarginMaxY
 Послать отзыв
 This is LayoutMarginMaxY, a member of class PublishSheetEventArgs.
 Синтаксис
C#
Visual Basic
public double LayoutMarginMaxY;
Public Property LayoutMarginMaxY() As Double
 Ссылки
 PublishSheetEventArgs Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!