Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство BeginAggregationEventArgs.DwfPassword
 Послать отзыв
 This is DwfPassword, a member of class BeginAggregationEventArgs.
 Синтаксис
C#
Visual Basic
public System.String DwfPassword;
Public Property DwfPassword() As System.String
 Ссылки
 BeginAggregationEventArgs Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!