Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Делегат HostMgd.Windows.InfoToolbarMoveDelegate
 Послать отзыв
 This is type HostMgd::Windows::InfoToolbarMoveDelegate.
 Синтаксис
C#
Visual Basic
public delegate InfoToolbarMoveDelegate();
Public Delegate Sub InfoToolbarMoveDelegate()
 Ваши комментарии по поводу этого топика: Послать отзыв!