Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Событие UserConfigurationManager.ProfileResetting
 Послать отзыв
 This is ProfileResetting, a member of class UserConfigurationManager.
 Синтаксис
C#
Visual Basic
public event ProfileEventHandler ProfileResetting;
Public Event ProfileResetting As ProfileEventHandler
 Ссылки
 UserConfigurationManager Класс, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!