Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PlotConfigInfo.DeviceType
 Послать отзыв
 Тип выходного устройства.
 Синтаксис
C#
Visual Basic
public HostMgd::PlottingServices::DeviceType DeviceType;
Public Property DeviceType() As HostMgd.PlottingServices.DeviceType
 Описание
 Возвращает одно из значений перечисления.
 Ссылки
 PlotConfigInfo Класс, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!