Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.InplaceTextEditorSettings.Type
 Послать отзыв
 Свойство Type предоставляет доступ к типу исходного объекта для текущего редактируемого объекта MTEXT. В текущей версии не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public InplaceTextEditorSettings.EntityType Type;
Копировать Код
Public Property Type As InplaceTextEditorSettings.EntityType
 Возвращает
 Возвращает заданный вами тип объекта. Тип InplaceTextEditorSettings.EntityType.
 Описание
 Свойство Type предоставляет доступ к типу исходного объекта для текущего редактируемого объекта MTEXT.
 Для сложного объекта, например, ячейки таблицы или многострочного атрибута, можно создавать копию объекта MTEXT в памяти.
 В текущей версии не реализовано.
 Условия
 Чтение и запись.
 Ссылки
 HostMgd.ApplicationServices.InplaceTextEditorSettings, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!