Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Camera.FrontClipDistance
 Послать отзыв
 Свойство FrontClipDistance представляет положение передней плоскости отсечения камеры. Не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public double FrontClipDistance;
Копировать Код
Public ReadOnly Property FrontClipDistance As Double
 Возвращает
 Возвращает расстояние до передней плоскости отсечения. Тип double.
 Описание
 Свойство FrontClipDistance представляет положение передней плоскости отсечения камеры. В текущей версии не реализовано.
 Условия
 Только чтение.
 Ссылки
 HostMgd.EditorInput.Camera, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!