Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.GraphicsSystem.ViewEventArgs.View
 Послать отзыв
 Свойство View возвращает ссылку на вид. Не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public Teigha.GraphicsSystem.View View;
Копировать Код
Public ReadOnly Property View As Teigha.GraphicsSystem.View
 Возвращает
 Возвращает объект вида. Тип Teigha.GraphicsSystem.View.
 Описание
 Свойство View возвращает ссылку на вид графической системы.
 В текущей версии не реализовано.
 Условия
 Только чтение.
 Ссылки
 HostMgd.GraphicsSystem.ViewEventArgs, HostMgd.GraphicsSystem
 Ваши комментарии по поводу этого топика: Послать отзыв!