Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.PlotConfig.LocationName
 Послать отзыв
 Свойство LocationName возвращает локализованное имя листа для текущего канонического имени листа. Не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public System.String LocationName;
Копировать Код
Public ReadOnly Property LocationName As System.String
 Возвращает
 Возвращает локализованное имя листа. Тип System.String.
 Описание
 Свойство LocationName возвращает локализованное имя листа для текущего канонического имени листа.
 В текущей версии не реализовано.
 Условия
 Только чтение.
 Ссылки
 HostMgd.PlottingServices.PlotConfig, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!