Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptSelectionResult.Value
 Послать отзыв
 Свойство возвращает набор объектов, выбранных пользователем в ходе интерактивной операции выделения.
 Синтаксис
C#
Visual Basic
Копировать Код
public SelectionSet Value { get; }
Копировать Код
Public ReadOnly Property Value As SelectionSet
 Возвращает
 Возвращает объект типа SelectionSet, представляющий собой набор идентификаторов (ObjectId) выбранных геометрических объектов. Если операция выборки завершена успешно, Value содержит список объектов, иначе — null.
 Описание
 Свойство предоставляет доступ к множеству объектов, выделенных пользователем — например, с помощью мыши, рамки или метода GetSelection(). Оно доступно только для чтения и содержит результат выборки, если операция завершена успешно (Status == PromptStatus.OK). Если выборка отменена или выполнена с ошибкой, свойство может возвращать null.
 Это свойство используется в связке с событием PromptedForSelection и методом GetSelection() для получения и дальнейшей обработки выделенных объектов чертежа — таких как редактирование, анализ или удаление.
 Условия
 Только чтение
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("PromptSelectionResultExample_Value")] public void PromptSelectionResultExample_Value() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создаём запрос пользователю PromptSelectionResult result = editor.GetSelection(); // Если все данные введены, выводим результат в командную строку if (result.Status == PromptStatus.OK) { SelectionSet selSet = result.Value; editor.WriteMessage( $"\nВыбрано объектов: {selSet.Count}"); } else { editor.WriteMessage( "\nНе удалось получить выделение."); } } }
 Ссылки
 HostMgd.EditorInput.PromptSelectionResult, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!