Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство AboutToBeginBackgroundPublishingEventArgs.JobWillPublishInBackground
 Послать отзыв
 This is JobWillPublishInBackground, a member of class AboutToBeginBackgroundPublishingEventArgs.
 Синтаксис
C#
Visual Basic
public bool JobWillPublishInBackground;
Public Property JobWillPublishInBackground() As bool
 Ссылки
 AboutToBeginBackgroundPublishingEventArgs Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!