Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PublishSheetEventArgs.EffectivePlotOffsetY
 Послать отзыв
 This is EffectivePlotOffsetY, a member of class PublishSheetEventArgs.
 Синтаксис
C#
Visual Basic
public double EffectivePlotOffsetY;
Public Property EffectivePlotOffsetY() As Double
 Ссылки
 PublishSheetEventArgs Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!