Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Camera.ViewId
 Послать отзыв
 Свойство ViewId представляет идентификатор объекта данной камеры. Не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public Teigha.DatabaseServices.ObjectId ViewId;
Копировать Код
Public ReadOnly Property ViewId As Teigha.DatabaseServices.ObjectId
 Возвращает
 Возвращает идентификатор объекта камеры. Тип Teigha.DatabaseServices.ObjectId.
 Описание
 Свойство ViewId представляет идентификатор объекта данной камеры. В текущей версии не реализовано.
 Условия
 Только чтение.
 Ссылки
 HostMgd.EditorInput.Camera, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!