Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptEntityOptions.AllowNone
 Послать отзыв
 Свойство определяет, разрешено ли завершить операцию выбора объекта нажатием Enter без указания объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool AllowNone { get; set; }
Копировать Код
Public Property AllowNone As Boolean
 Возвращает
 Возвращает значение типа bool:
true — завершение ввода нажатием Enter разрешено.
false — выбор объекта обязателен.
 Описание
 Свойство используется для управления возможностью пропуска выбора объекта. Если свойство установлено в true, пользователь может завершить команду ввода (например, GetEntity()) нажатием клавиши Enter , не указывая ни одного объекта. В этом случае операция завершается со статусом PromptStatus.None, что позволяет разработчику обработать этот случай как допустимый сценарий — например, использовать значение по умолчанию или перейти к следующему шагу.
 Если AllowNone = false (по умолчанию), пользователь обязан выбрать объект, и нажатие Enter без выбора будет считаться отменой или ошибкой.
 Условия
 Чтение и запись
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("PromptEntityOptions_AllowNone")] public void PromptEntityOptions_AllowNone() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создаём запрос пользователю PromptEntityOptions options = new PromptEntityOptions("\nВыберите объект (или нажмите Enter для пропуска):"); // Разрешаем пропуск ввода options.AllowNone = true; // Ограничиваем выбор только линиями options.AddAllowedClass(typeof(Line), true); // Устанавливаем пользовательское сообщение об ошибке options.SetRejectMessage("Можно выбирать только отрезки."); PromptEntityResult result = editor.GetEntity(options); // Если все данные введены, выводим результат в командную строку if (result.Status == PromptStatus.OK) { editor.WriteMessage( $"\nВыбран объект с ID: {result.ObjectId}, точка: {result.PickedPoint}"); } else if (result.Status == PromptStatus.None) { editor.WriteMessage("\nВвод пропущен — использовано значение по умолчанию."); } else { editor.WriteMessage( "\nОперация выбора отменена или объект не найден."); } } }
 Ссылки
 HostMgd.EditorInput.PromptEntityOptions, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!