Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод UserConfigurationManager.OpenDialogSection
 Послать отзыв
 Синтаксис
C#
Visual Basic
public IConfigurationSection OpenDialogSection(ref Object dialog);
Public Function OpenDialogSection(ByRef dialog As Object) As IConfigurationSection
 Описание
 Осуществляет доступ к секции диалога в реестре Window's
 Ссылки
 UserConfigurationManager Класс, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!