Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Application.AddObjectContextMenuExtension
 Послать отзыв
 Метод предназначен для добавления пунктов меню в контекстное меню для указанного класса.
 Синтаксис
C#
Visual Basic
Копировать Код
public void AddObjectContextMenuExtension(RXClass runtimeClass, ContextMenuExtension menuExtension);
Копировать Код
Public Sub AddObjectContextMenuExtension(runtimeClass As RXClass, menuExtension As ContextMenuExtension)
 Параметры
 Параметры
 Описание
 runtimeClass
 Класс объекта, имеющего контекстное меню, в которое будут вставлены пункты меню
 menuExtension
 Пункты контекстного меню, которые будут добавлены в контекстное меню класса
 Описание
 Метод добавляет пункты меню в контекстное меню для указанного класса.
 Ссылки
 HostMgd.ApplicationServices.Application, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!