Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptSelectionOptions.PrepareOptionalDetails
 Послать отзыв
 Свойство устанавливает или возвращает режим N (No details), определяя, следует ли пропускать подготовку дополнительных данных о выбранных объектах.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool PrepareOptionalDetails { get; set; }
Копировать Код
Public Property PrepareOptionalDetails As Boolean
 Возвращает
 Возвращает значение типа bool:
true — дополнительные детали о выбранных объектах будут подготовлены (режим по умолчанию).
false — подготовка деталей пропускается (режим N), выбор выполняется быстрее, но без предварительной загрузки метаданных.
 Описание
 Свойство влияет на поведение внутренней функции выбора объектов. Оно управляет тем, будет ли система заранее загружать и обрабатывать дополнительные детали о выбранных объектах — такие как геометрия, свойства, связи и другие метаданные.
 Если свойство установлено в false, включается режим N (No details) — система оптимизирует операцию выбора, пропуская подготовку вспомогательной информации. Это может повысить производительность при работе с большими наборами объектов, особенно если детальная информация не требуется.
 Если true — система выполняет полную подготовку данных, что может быть необходимо для команд, требующих анализа или отображения свойств объектов сразу после выбора.
 Условия
 Чтение и запись
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("PromptSelectionOptionsExample_PrepareOptionalDetails")] public void PromptSelectionOptionsExample_PrepareOptionalDetails() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создаём набор параметров для запроса PromptSelectionOptions options = new PromptSelectionOptions(); options.MessageForAdding = "Выберите линии для объединения:"; // Ускорить выбор, не загружая детали options.PrepareOptionalDetails = false; // Фильтр: только объекты типа Line TypedValue[] filterList = new TypedValue[] { new TypedValue((int)DxfCode.Start, "LINE") }; SelectionFilter filter = new SelectionFilter(filterList); // Создаём запрос пользователю PromptSelectionResult result = editor.GetSelection(options, filter); // Если все данные введены, выводим результат в командную строку if (result.Status == PromptStatus.OK) { SelectionSet selSet = result.Value; editor.WriteMessage( $"\nВыбрано объектов: {selSet.Count}"); } else { editor.WriteMessage( "\nНе удалось получить выделение."); } } }
 Ссылки
 HostMgd.EditorInput.PromptSelectionOptions, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!