Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор AboutToBeginPublishingEventArgs.AboutToBeginPublishingEventArgs
 Послать отзыв
 This is AboutToBeginPublishingEventArgs, a member of class AboutToBeginPublishingEventArgs.
 Синтаксис
C#
Visual Basic
public AboutToBeginPublishingEventArgs();
Public Sub New()
 Ссылки
 AboutToBeginPublishingEventArgs Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!