Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.DocumentBeginCloseEventArgs.DocumentBeginCloseEventArgs
 Послать отзыв
 Конструктор по умолчанию класса DocumentBeginCloseEventArgs.
 Синтаксис
C#
Visual Basic
Копировать Код
public DocumentBeginCloseEventArgs();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса DocumentBeginCloseEventArgs.
 Ссылки
 HostMgd.ApplicationServices.DocumentBeginCloseEventArgs, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!