Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptAngleOptions.UseAngleBase
 Послать отзыв
 Свойство определяет, будет ли использоваться базовый угол при интерактивном вводе угла пользователем.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool UseAngleBase { get; set; }
Копировать Код
Public Property UseAngleBase As Boolean
 Возвращает
 Возвращает значение типа bool:
true — базовый угол будет использоваться при вводе.
false — ввод угла производится без учёта базового направления.
 Описание
 Свойство используется для указания, следует ли учитывать текущий базовый угол чертежа при вводе угла пользователем. Если свойство установлено в true, вводимый пользователем угол будет отсчитываться относительно базового направления, заданного в системе (например, относительно угла 0°, заданного в настройках чертежа). Если свойство равно false, угол отсчитывается от стандартного направления (например, оси X).
 Это свойство особенно полезно при реализации команд, где требуется учитывать настройки чертежа или пользовательский контекст, например, при повороте объектов или построении элементов под определённым углом.
 Замечания
 Свойство работает совместно с BasePoint и DefaultValue, чтобы обеспечить точный и контекстно-зависимый ввод угла, особенно при интеграции с настройками чертежа и пользовательским интерфейсом nanoCAD.
 Условия
 Чтение и запись
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("PromptAngleOptionsExample_UseAngleBase")] public void PromptAngleOptionsExample_UseAngleBase() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создаём запрос пользователю, чтобы он указал угол на чертеже PromptAngleOptions options = new PromptAngleOptions("\nУкажите угол поворота:"); options.UseAngleBase = true; // Учитывать базовое направление чертежа options.DefaultValue = Math.PI / 2; // Угол по умолчанию — 90 градусов options.AllowNone = true; // Разрешить нажатие Enter без ввода // Вызов метода GetAngle, запрашивающего угол у пользователя PromptDoubleResult result = editor.GetAngle(options); // Если пользователь указал все необходимые данные, // выводим в командной строке сообщение if (result.Status == PromptStatus.OK) { double angleInRadians = result.Value; double angleInDegrees = result.Value * 180 / Math.PI; editor.WriteMessage($"\nУгол введён с учётом базового направления: {angleInRadians} радиан или {angleInDegrees} градусов"); } else if (result.Status == PromptStatus.None) { editor.WriteMessage("\nИспользовано значение угла по умолчанию."); } } }
 Ссылки
 HostMgd.EditorInput.PromptAngleOptions, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!