Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptEntityOptionsEventHandler(object,PromptEntityOptionsEventArgs)
 Послать отзыв
 Делегат предназначен для обработки события, возникающего перед началом выбора геометрического объекта, и позволяет настроить параметры команды выборки.
 Синтаксис
C#
Visual Basic
Копировать Код
public delegate void PromptEntityOptionsEventHandler(object sender, PromptEntityOptionsEventArgs e);
Копировать Код
Public Delegate Sub PromptEntityOptionsEventHandler(sender As Object, e As PromptEntityOptionsEventArgs)
 Параметры
 Параметры
 Описание
 sender
 Источник события — обычно экземпляр редактора (Editor), в котором происходит выбор объекта. Тип object
 e
 Объект, содержащий параметры выбора:
 Описание
 Делегат используется как тип обработчика для события PromptingForEntity, которое генерируется перед началом операции выбора объекта в nanoCAD — например, при вызове метода GetEntity(). Он позволяет разработчику модифицировать параметры выбора в реальном времени, такие как:
текст приглашения ,
допустимые типы объектов (линии, окружности, полилинии и др.),
ключевые слова ,
режимы ввода (AllowNone, AllowArbitraryInput и т.д.).
 Этот делегат является ключевым элементом при создании интерактивных команд, где требуется фильтрация или контекстная настройка поведения выбора объектов.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события PromptingForEntity [Teigha.Runtime.CommandMethod("PromptingForEntityExample")] public void PromptingForEntityExample() { // Подписка на событие PromptingForEntity editor.PromptingForEntity += OnEditorPromptingForEntity; } // Реализация отработки события PromptingForEntity private void OnEditorPromptingForEntity(object sender, PromptEntityOptionsEventArgs e) { // Изменение сообщения приглашения e.Options.Message = "Выберите линию или окружность:"; // Классы объектов, которые можно выбирать e.Options.AddAllowedClass(typeof(Line3d),true); e.Options.AddAllowedClass(typeof(Circle),true); // Можно ничего не выбрать e.Options.AllowNone = true; } }
 Ваши комментарии по поводу этого топика: Послать отзыв!