Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод StatusBarItem.DisplayContextMenu (ContextMenu, System::Drawing::Point)
 Послать отзыв
 This is DisplayContextMenu, a member of class StatusBarItem.
 Синтаксис
C#
Visual Basic
public DisplayContextMenu(ContextMenu menu, System.Drawing.Point p);
Public Sub DisplayContextMenu(menu As ContextMenu, p As System.Drawing.Point)
 Ссылки
 StatusBarItem Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!