Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.UpdateScreen()
 Послать отзыв
 Метод принудительно обновляет графическое отображение чертежа, перерисовывая его на экране.
 Синтаксис
C#
Visual Basic
Копировать Код
public void UpdateScreen();
Копировать Код
Public Sub UpdateScreen()
 Описание
 Метод вызывает немедленную перерисовку активного окна чертежа nanoCAD. Он используется для визуального обновления отображения после выполнения операций, изменяющих геометрию или параметры объектов, чтобы изменения стали видны пользователю. В отличие от метода Regen(), не пересчитывает данные объектов — только обновляет их отображение.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("UpdateScreenExample")] public void UpdateScreenExample() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Вызываем метод editor.UpdateScreen(); // Обновляем экран после изменения объекта // Вывод сообщения в командной строке editor.WriteMessage("\nЭкран обновлён."); } }
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!