Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Runtime.IMenuItem.OnClicked
 Послать отзыв
 Метод позволяет назначить обработчик события щелчка мышью на данном элементе меню.
 Синтаксис
C#
Visual Basic
Копировать Код
void OnClicked( ref EventArgs eventArgs );
Копировать Код
Sub OnClicked( ByRef eventArgs As EventArgs )
 Параметры
 Параметры
 Описание
 eventArgs
 Данные для события. Тип EventArgs.
 Описание
 Метод позволяет назначить обработчик события щелчка мышью на данном элементе меню.
 Ссылки
 MenuItem Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!