Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.MediaBounds.!=
 Послать отзыв
 Оператор неравенства класса MediaBounds. Не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public static bool operator !=( ref HostMgd.PlottingServices.MediaBounds a, ref HostMgd.PlottingServices.MediaBounds b );
Копировать Код
Public Shared Operator <>( ByRef a As HostMgd.PlottingServices.MediaBounds, ByRef b As HostMgd.PlottingServices.MediaBounds ) As Boolean
 Параметры
 Параметры
 Описание
 a
 Левый операнд. Тип HostMgd.PlottingServices.MediaBounds.
 b
 Правый операнд. Тип HostMgd.PlottingServices.MediaBounds.
 Возвращает
 Возвращает true в случае неравенства операндов. В противном случае возвращает false. Тип bool.
 Описание
 Оператор неравенства класса MediaBounds.
 В текущей версии не реализован.
 Ссылки
 HostMgd.PlottingServices.MediaBounds, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!