Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.GraphicsSystem.Manager.CreateAutoCADView
 Послать отзыв
 Метод создаёт объект Teigha.GraphicsSystem.View и добавляет в этот вид переданный отображаемый объект Drawable.
 Синтаксис
C#
Visual Basic
Копировать Код
public Teigha.GraphicsSystem.View CreateAutoCADView( ref Teigha.GraphicsInterface.Drawable drawable );
Копировать Код
Public Function CreateAutoCADView( ByRef drawable As Teigha.GraphicsInterface.Drawable ) As Teigha.GraphicsSystem.View
 Параметры
 Параметры
 Описание
 drawable
 Входной отображаемый объект. Тип Teigha.GraphicsInterface.Drawable.
 Возвращает
 Возвращает созданный вид графической системы. Тип Teigha.GraphicsSystem.View.
 Описание
 Метод создаёт новый вид как объект Teigha.GraphicsSystem.View, а также добавляет в этот вид указанный отображаемый объект drawable.
 Ссылки
 HostMgd.GraphicsSystem.Manager, HostMgd.GraphicsSystem
 Ваши комментарии по поводу этого топика: Послать отзыв!