Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptAngleOptions.UseBasePoint
 Послать отзыв
 Свойство определяет, будет ли учитываться базовая точка при интерактивном вводе угла пользователем.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool UseBasePoint { get; set; }
Копировать Код
Public Property UseBasePoint As Boolean
 Возвращает
 Возвращает значение типа bool:
true — базовая точка будет использоваться при вводе угла.
false — базовая точка не учитывается при вводе.
 Описание
 Свойство используется для указания, должно ли вводимое пользователем значение угла отсчитываться относительно заданной базовой точки (BasePoint). Если свойство установлено в true, ввод угла становится привязанным к указанной точке, и пользователь указывает направление относительно неё — например, при построении угла от конкретного объекта или точки на чертеже. Если свойство равно false, точка не учитывается, и угол вводится относительно текущей системы координат.
 Замечания
 Свойство работает совместно с BasePoint, и позволяет управлять тем, учитывается ли эта точка при отсчёте угла.
 Условия
 Чтение и запись
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("PromptAngleOptionsExample_UseBasePoint")] public void PromptAngleOptionsExample_UseBasePoint() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создаём запрос пользователю, чтобы он указал угол на чертеже PromptAngleOptions options = new PromptAngleOptions("\nУкажите угол поворота:"); // Устанавливаем базовую точку options.BasePoint = new Point3d(100, 100, 0); // Включаем использование базовой точки options.UseBasePoint = true; // Вызов метода GetAngle, запрашивающего угол у пользователя PromptDoubleResult result = editor.GetAngle(options); // Если пользователь указал все необходимые данные, // выводим в командной строке сообщение if (result.Status == PromptStatus.OK) { double angleInRadians = result.Value; double angleInDegrees = result.Value * 180 / Math.PI; editor.WriteMessage($"\nУгол задан относительно точки {options.BasePoint}: {angleInRadians} радиан или {angleInDegrees} градусов"); } else if (result.Status == PromptStatus.None) { editor.WriteMessage("\nОперация отменена."); } } }
 Ссылки
 HostMgd.EditorInput.PromptAngleOptions, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!