Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Делегат HostMgd.Publishing.CancelledOrFailedPublishingEventHandler
 Послать отзыв
 This is type HostMgd::Publishing::CancelledOrFailedPublishingEventHandler.
 Синтаксис
C#
Visual Basic
public delegate CancelledOrFailedPublishingEventHandler();
Public Delegate Sub CancelledOrFailedPublishingEventHandler()
 Ваши комментарии по поводу этого топика: Послать отзыв!