Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.DraggingEventArgs.DraggingEventArgs(String)
 Послать отзыв
 Конструктор создаёт новый экземпляр класса DraggingEventArgs, используя приглашающее сообщение.
 Синтаксис
C#
Visual Basic
Копировать Код
public DraggingEventArgs(string prompt);
Копировать Код
Public Sub New(prompt As String)
 Параметры
 Параметры
 Описание
 prompt
 Сообщение-приглашение, связанное с операцией перетаскивания (например, "Перетащите объект сюда"). Тип string
 Описание
 Конструктор инициализирует объект класса DraggingEventArgs, который используется для передачи контекстной информации в обработчики событий, связанных с началом операции перетаскивания. Он принимает строковый параметр — приглашение, которое может отображаться пользователю перед началом перетаскивания.
 Пример
C#
 Копировать Код
DraggingEventArgs args = new DraggingEventArgs("Выберите точку привязки");
 Такой экземпляр может быть использован в пользовательской реализации событий или тестировании логики, связанной с перетаскиванием объектов в nanoCAD.
 Ссылки
 HostMgd.EditorInput.DraggingEventArgs, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!