Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptResult
 Послать отзыв
 Класс является базовым классом для всех типов результатов, возвращаемых после интерактивного ввода пользователя в редакторе nanoCAD.
 Иерархия классов
HostMgd::EditorInput::PromptResult
 Синтаксис
C#
Visual Basic
Копировать Код
public sealed class PromptIntegerResult : PromptResult
Копировать Код
Public NotInheritable Class PromptIntegerResult Inherits PromptResult
 Описание
 Класс служит обобщённым контейнером для результатов, вводимых пользователем через интерактивные команды, такие как GetInteger(), GetString(), GetPoint() и другие. Он содержит информацию о статусе завершения операции и может быть унаследован или использован напрямую для получения:
статуса операции (Status — например, OK, Cancel, Error),
введённого значения (StringResult, Value и другие, в зависимости от реализации),
исходного ввода (InputString), если значение было введено вручную.
 Этот класс используется совместно с другими производными классами, такими как PromptIntegerResult, PromptStringResult, PromptPointResult и т. д., и предоставляет единый интерфейс для проверки результата ввода в надстройках и плагинах nanoCAD.
 Замечания
 PromptResult — это базовый класс, который лежит в основе всех результатов ввода в .NET API nanoCAD, обеспечивая единый способ обработки ввода пользователя в различных форматах (числа, строки, точки и др.).
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("GetStringExample")] public void GetStringExample() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Определяем настройки запроса пользователю PromptStringOptions options = new PromptStringOptions("Введите текст"); options.DefaultValue = "Untitled"; options.AllowSpaces = true; // Создаём запрос пользователю PromptResult pr = editor.GetString(options); // Если все данные введены, выводим результат в командную строку if (pr.Status == PromptStatus.OK) { editor.WriteMessage( $"\nВы ввели: {pr.StringResult}"); } else { editor.WriteMessage( "\nВвод отменён."); } } }
 Топики
 Имя
 Описание
 PromptResult Методы
 Ниже перечислены методы класса PromptResult.
 PromptResult Свойства
 Ниже перечислены свойства класса PromptResult.
 Ссылки
 PromptResult Методы, PromptResult Свойства, Топики, PromptResult Методы, PromptResult Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!