Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PublishEventArgs.DwfFileName
 Послать отзыв
 This is DwfFileName, a member of class PublishEventArgs.
 Синтаксис
C#
Visual Basic
public System.String DwfFileName;
Public Property DwfFileName() As System.String
 Ссылки
 PublishEventArgs Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!