Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.InplaceTextEditor.FieldDialog
 Послать отзыв
 Метод вызывает диалог редактирования поля. В текущей версии не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public void FieldDialog( ref Teigha.DatabaseServices.Field field );
Копировать Код
Public Sub FieldDialog( ByRef field As Teigha.DatabaseServices.Field )
 Параметры
 Параметры
 Описание
 field
 Поле, для редактирования которого вызывается диалог. Тип Teigha.DatabaseServices.Field.
 Описание
 Метод вызывает диалог редактирования поля field. В текущей версии не реализован.
 Ссылки
 HostMgd.ApplicationServices.InplaceTextEditor, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!