Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство MenuItemCollection.IList_Item
 Послать отзыв
 This is IList_Item, a member of class MenuItemCollection.
 Синтаксис
C#
Visual Basic
public Object IList_Item;
Public Property IList_Item() As Object
 Ссылки
 MenuItemCollection Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!