Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод PickPointDescriptor.Equals
 Послать отзыв
 Синтаксис
C#
Visual Basic
public bool Equals(ref System.Object obj);
Public Function Equals(ByRef obj As System.Object) As bool
 Описание
 Возвращает true, если объект идентичен объекту, являющемуся параметром метода.
 Ссылки
 PickPointDescriptor Структура, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!