Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptAngleOptionsEventArgs.Options
 Послать отзыв
 Свойство предоставляет доступ к параметрам приглашения, используемым при интерактивном вводе угла.
 Синтаксис
C#
Visual Basic
Копировать Код
public PromptAngleOptions Options { get; }
Копировать Код
Public ReadOnly Property Options As PromptAngleOptions
 Возвращает
 Возвращает объект типа PromptAngleOptions, содержащий параметры, переданные в команду ввода угла. Если параметры не были заданы или произошла ошибка, возвращается null.
Message — текст, отображаемый в командной строке.
DefaultValue — начальное значение угла по умолчанию (в радианах).
AllowNone, AllowZero и другие настройки выбора угла.
 Описание
 Свойство предоставляет доступ к объекту типа PromptAngleOptions, который содержит настройки приглашения, переданные в команду ввода угла. Оно позволяет разработчикам надстроек nanoCAD динамически изменять или дополнять параметры команды — например, устанавливать начальное значение, задавать ограничения по минимальному и максимальному углу, изменять текст приглашения или управлять режимами ввода.
 Свойство используется, в частности, в событии PromptingForAngle, чтобы модифицировать поведение команды GetAngle() или других методов, связанных с вводом угла, в зависимости от текущего контекста или состояния чертежа.
 Условия
 Только чтение
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события PromptingForAngle [Teigha.Runtime.CommandMethod("PromptingForAngleExample")] public void PromptingForAngleExample() { // Подписка на событие PromptingForAngle editor.PromptingForAngle += OnEditorPromptingForAngle; } // Реализация отработки события PromptingForAngle private void OnEditorPromptingForAngle(object sender, PromptAngleOptionsEventArgs e) { // Установить начальное значение угла e.Options.DefaultValue = Math.PI / 2; // 90 градусов // Установить сообщение e.Options.Message = "Введите угол поворота:"; } }
 Ссылки
 HostMgd.EditorInput.PromptAngleOptionsEventArgs, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!