Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptForEntityEndingEventArgs.Flags
 Послать отзыв
 Свойство предоставляет дополнительные сведения о текущем режиме или состоянии операции выбора объектов в редакторе nanoCAD.
 Синтаксис
C#
Visual Basic
Копировать Код
public SelectionFlags Flags { get; }
Копировать Код
Public ReadOnly Property Flags As SelectionFlags
 Возвращает
 Возвращает значение типа SelectionFlags — это битовое перечисление, где каждый флаг представляет определённый режим или состояние выборки. Возможные значения:
AddAllowed — разрешено добавлять объекты.
RemoveAllowed — разрешено удалять объекты.
SinglePick — разрешено только одиночное выделение.
SubEntitySelection — активирован режим выбора подобъектов.
И другие.
 Если операция выбора не активна, значение может быть недопустимым (например, None).
 Описание
 Свойство возвращает значение перечисления SelectionFlags, которое содержит флаги, определяющие контекст и параметры выполняемой в данный момент операции выбора объектов. Эти флаги могут указывать, например, разрешено ли добавлять новые объекты к выделению, требуется ли выбирать только один объект, или выполняется ли выбор подобъектов. Свойство особенно полезно при обработке событий, связанных с выборкой, таких как PromptForSelectionEnding.
 Условия
 Только чтение
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события PromptForSelectionEnding [Teigha.Runtime.CommandMethod("PromptForSelectionEndingExample_Flags")] public void PromptForSelectionEndingExample_Flags() { // Подписка на событие PromptForSelectionEnding editor.PromptForSelectionEnding += OnEditorPromptForSelectionEnding; } // Реализация отработки события PromptForSelectionEnding private void OnEditorPromptForSelectionEnding(object sender, PromptForSelectionEndingEventArgs e) { if ((e.Flags & SelectionFlags.AddAllowed) != 0) { editor.WriteMessage("\nДобавление объектов в выделение разрешено."); } if ((e.Flags & SelectionFlags.SubEntitySelection) != 0) { editor.WriteMessage("\nВыполняется выбор подобъектов."); } } }
 Ссылки
 HostMgd.EditorInput.PromptForSelectionEndingEventArgs, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!