Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод TrayItemCollection.Contains (TrayItem^)
 Послать отзыв
 This is Contains, a member of class TrayItemCollection.
 Синтаксис
C#
Visual Basic
public bool Contains(ref TrayItem value);
Public Function Contains(ByRef value As TrayItem) As bool
 Ссылки
 TrayItemCollection Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!