Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PublishSheetEventArgs.EffectivePlotOffsetX
 Послать отзыв
 This is EffectivePlotOffsetX, a member of class PublishSheetEventArgs.
 Синтаксис
C#
Visual Basic
public double EffectivePlotOffsetX;
Public Property EffectivePlotOffsetX() As Double
 Ссылки
 PublishSheetEventArgs Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!