Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Событие PaletteSet.Load
 Послать отзыв
 This is Load, a member of class PaletteSet.
 Синтаксис
C#
Visual Basic
public event PalettePersistEventHandler Load;
Public Event Load As PalettePersistEventHandler
 Ссылки
 PaletteSet Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!