Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор SelectionDetails.SelectionDetails
 Послать отзыв
 This is SelectionDetails, a member of class SelectionDetails.
 Синтаксис
C#
Visual Basic
public SelectionDetails();
Public Sub New()
 Ссылки
 SelectionDetails Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!