Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptStringOptionsEventArgs
 Послать отзыв
 Класс предоставляет данные для события PromptingForString, позволяя настроить параметры ввода строки перед её началом.
 Иерархия классов
HostMgd::EditorInput::PromptStringOptionsEventArgs
 Синтаксис
C#
Visual Basic
Копировать Код
public sealed class PromptStringOptionsEventArgs : EventArgs
Копировать Код
Public NotInheritable Class PromptStringOptionsEventArgs Inherits EventArgs
 Описание
 Класс используется для передачи параметров, применяемых при начале операции ввода текстовой строки — например, при вызове метода GetString(). Он предоставляет доступ к объекту PromptStringOptions, содержащему настройки команды ввода:
текст приглашения,
ключевые слова,
глобальные ключевые слова,
разрешение на пустой ввод,
режим ввода (только ключевые слова или произвольный текст) и т.п.
 Этот класс применяется в обработчике события PromptingForString, где разработчик может динамически изменять параметры ввода в зависимости от контекста — например, задать подсказку, добавить пользовательские команды или ограничить ввод списком допустимых значений.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события PromptingForString [Teigha.Runtime.CommandMethod("PromptingForStringExample")] public void PromptingForStringExample() { // Подписка на событие PromptingForString editor.PromptingForString += OnEditorPromptingForString; } // Реализация отработки события PromptingForString private void OnEditorPromptingForString(object sender, PromptStringOptionsEventArgs e) { // Изменение сообщения приглашения e.Options.Message = "Введите имя стиля текста:"; // Добавление ключевых слов e.Options.Keywords.Add("По умолчанию"); e.Options.Keywords.Add("Новый"); e.Options.Keywords.Add("Текущий"); } }
 Топики
 Имя
 Описание
 PromptStringOptionsEventArgs Свойства
 Ниже перечислены свойства класса PromptStringOptionsEventArgs.
 Ссылки
 PromptStringOptionsEventArgs Свойства, Топики, PromptStringOptionsEventArgs Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!