Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PublishSheetEventArgs.PrintableBoundsX
 Послать отзыв
 This is PrintableBoundsX, a member of class PublishSheetEventArgs.
 Синтаксис
C#
Visual Basic
public double PrintableBoundsX;
Public Property PrintableBoundsX() As Double
 Ссылки
 PublishSheetEventArgs Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!