Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PlotConfigManager.ColorDependentPlotStyles
 Послать отзыв
 Свойство возвращает перечень файлов ctb с полным путём доступа Только для чтения
 Синтаксис
C#
Visual Basic
public System.Collections.Specialized.StringCollection ColorDependentPlotStyles;
Public Property ColorDependentPlotStyles() As System.Collections.Specialized.StringCollection
 Ссылки
 PlotConfigManager Класс, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!