Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Publisher.FireBeginAggregation
 Послать отзыв
 This is FireBeginAggregation, a member of class Publisher.
 Синтаксис
C#
Visual Basic
public void FireBeginAggregation(ref HostMgd::Publishing::BeginAggregationEventArgs e);
Public Sub FireBeginAggregation(ByRef e As HostMgd.Publishing.BeginAggregationEventArgs)
 Ссылки
 Publisher Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!