Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.InputPointContext.GrippedPoint
 Послать отзыв
 Свойство предназначено для получения координат точки ручки (grip), если в контексте ввода активирован режим редактирования с помощью ручек и установлен соответствующий флаг.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d GrippedPoint;
Копировать Код
Public Property GrippedPoint() As Point3d
 Возвращает
 Возвращает объект типа Point3d — координаты активной ручки в мировой системе координат (WCS).
 Если режим ручек активен и точка захвачена — содержит её положение. Если редактирование не через ручки — может содержать неопределённое значение (не null, но игнорируется).
 Описание
 Свойство возвращает координаты точки привязки к ручке (grip) — маркеру редактирования объекта, при активации которого пользователь начинает тянуть за него (например, перемещение вершины полилинии). Оно содержит значение только в том случае, если в истории операции ввода установлен внутренний флаг Gripped, указывающий на то, что текущая операция началась с выбора и активации ручки.
 Это свойство используется в обработчиках событий ввода (PointMonitor, PointFilter) для определения, находится ли пользователь в режиме редактирования через ручки. Это позволяет адаптировать поведение команды — например, изменить логику привязки, отключить конфликтующие подсказки или визуализировать дополнительные направляющие.
 Свойство актуально исключительно во время операций, инициированных через grip-редактирование.
 Условия
 Только чтение
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class InputPointContextExamples { // Метод команды, которая получает координаты точки ручки (grip), // если в контексте ввода активирован режим редактирования // с помощью ручек и установлен соответствующий флаг. [Teigha.Runtime.CommandMethod("GrippedPointExample")] public void GrippedPointExample() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Метод для отработки события редактора PointMonitor editor.PointMonitor += (sender, e) => { // Сохраняем контекст события в преременную InputPointContext context = e.Context; if (context != null) { Point3d gripPoint = context.GrippedPoint; // Проверка, возможно, через другие признаки, что это grip-режим editor.WriteMessage($"\nАктивная ручка: {gripPoint}"); } }; } }
 Ссылки
 HostMgd.EditorInput.InputPointContext, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!