Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.GetInteger(String)
 Послать отзыв
 Метод позволяет пользователю ввести целое число в диапазоне от -32768 до +32767, возвращая результат в виде объекта PromptIntegerResult.
 Синтаксис
C#
Visual Basic
Копировать Код
public PromptIntegerResult GetInteger(String message);
Копировать Код
Public Function GetInteger(message As String) As PromptIntegerResult
 Параметры
 Параметры
 Описание
 message
 Сообщение, отображаемое в командной строке для приглашения пользователя к вводу целого числа (например, "Введите количество:"). Тип String.
 Возвращает
 Возвращает объект типа PromptIntegerResult, который содержит:
Status — статус операции (OK, Cancel, Error и др.).
Value — введённое пользователем целое число (int), если ввод был успешным.
StringResult — строковое представление введённого значения.
 Описание
 Метод используется для интерактивного получения целочисленного значения от пользователя через командную строку. Пользователь может ввести число с клавиатуры, при этом система автоматически проверяет его на соответствие допустимому диапазону и формату. Метод выводит заданное текстовое сообщение-приглашение и ожидает ввода до тех пор, пока не будет получено корректное значение или операция не будет прервана.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("GetIntegerExample_String")] public void GetIntegerExample_String() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создаём запрос пользователю PromptIntegerResult result = editor.GetInteger("nВведите целое число:"); // Если все данные введены, выводим результат в командную строку if (result.Status == PromptStatus.OK) { int value = result.Value; editor.WriteMessage( $"\nВы ввели: {value}"); } else { editor.WriteMessage( "\nВвод отменён или произошла ошибка."); } } }
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!