Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PublishSheetEventArgs.OriginY
 Послать отзыв
 This is OriginY, a member of class PublishSheetEventArgs.
 Синтаксис
C#
Visual Basic
public double OriginY;
Public Property OriginY() As Double
 Ссылки
 PublishSheetEventArgs Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!