Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство CommandClassAttribute.Type
 Послать отзыв
 This is Type, a member of class CommandClassAttribute.
 Синтаксис
C#
Visual Basic
public System.Type Type;
Public Property Type() As System.Type
 Ссылки
 CommandClassAttribute Класс, HostMgd.Runtime Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!