Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод SelectionSet.CopyTo
 Послать отзыв
 Синтаксис
C#
Visual Basic
public void CopyTo(ref array<HostMgd::EditorInput::SelectedObject^> array, int index);
Public Sub CopyTo(ByRef array As array<HostMgd.EditorInput.SelectedObject^>, index As Integer)
 Параметры
 Параметры
 Описание
 index
 Индекс массива, начиная с которого должны размещаться копируемые элементы
 a
 Одномерный массив, в который записываются копируемые из набора элементы. Индекс массива должен начинаться с 0
 Описание
 Копирует выбранный набор или его часть в одномерный массив.
 Ссылки
 SelectionSet Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!