Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.PlotConfig
 Послать отзыв
 Класс PlotConfig представляет описание установленного в системе устройства или РС3 файла. Не реализован.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject HostMgd::PlottingServices::PlotConfig
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("AcPlPlotConfig")] public sealed class PlotConfig : Teigha.Runtime.RXObject;
Копировать Код
<Wrapper("AcPlPlotConfig")> Public NotInheritable Class PlotConfig Inherits Teigha.Runtime.RXObject
 Описание
 Класс PlotConfig представляет описание установленного в системе устройства или РС3 файла. Класс предоставляет методы и свойства для описания размеров листа и полей. Экземпляр этого класса возвращается свойством PlotConfig класса.
 В текущей версии не реализован.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 HostMgd.PlottingServices.PlotConfig
 Имя
 Описание
 PlotConfig Методы
 Ниже перечислены методы класса PlotConfig.
 PlotConfig Свойства
 Ниже перечислены свойства класса PlotConfig.
 Ссылки
 PlotConfig Методы, PlotConfig Свойства, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!