Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод FenceSelectedObject.ToString ()
 Послать отзыв
 Синтаксис
C#
Visual Basic
public System.String ToString(); public System.String ToString(ref System.IFormatProvider provider);
Public Function ToString() As System.String Public Function ToString(ByRef provider As System.IFormatProvider) As System.String
 Описание
 Метод возвращает строковое представление объекта (ObjectId, метод выделения, gsMarker).
 Ссылки
 FenceSelectedObject Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!