Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.PreviewEndPlotInfo.Status
 Послать отзыв
 Свойство Status возвращает текущее состояние операции предварительного просмотра. Не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public HostMgd.PlottingServices.PreviewEndPlotStatus Status;
Копировать Код
Public ReadOnly Property Status As HostMgd.PlottingServices.PreviewEndPlotStatus
 Возвращает
 Возвращает состояние операции предварительного просмотра. Перечисление HostMgd.PlottingServices.PreviewEndPlotStatus.
 Описание
 Свойство Status возвращает текущее состояние операции предварительного просмотра.
 В текущей версии не реализовано.
 Условия
 Только чтение.
 Ссылки
 HostMgd.PlottingServices.PreviewEndPlotInfo, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!