Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод PlotEngine.EndPage
 Послать отзыв
 Синтаксис
C#
Visual Basic
public void EndPage(ref System.Object parameters);
Public Sub EndPage(ByRef parameters As System.Object)
 Ссылки
 PlotEngine Класс, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!