Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор EPlotAttribute.EPlotAttribute (System::String^, System::String^, System::String^, System::String^)
 Послать отзыв
 This is EPlotAttribute, a member of class EPlotAttribute.
 Синтаксис
C#
Visual Basic
public EPlotAttribute(ref System.String ns, ref System.String nsUrl, ref System.String name, ref System.String value);
Public Sub New(ByRef ns As System.String, ByRef nsUrl As System.String, ByRef name As System.String, ByRef value As System.String)
 Ссылки
 EPlotAttribute Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!