Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.Windows.ToolPalette.CustomToolBase.EndMultipleEdit
 Послать отзыв
 Метод вызывается для завершения операции группового редактирования пользовательских инструментов на панели инструментов. Не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void EndMultipleEdit( ref System.Object tools, ref System.Object stockToolIds, bool editCancelled );
Копировать Код
Public Overridable Sub EndMultipleEdit( ByRef tools As System.Object, ByRef stockToolIds As System.Object, editCancelled As Boolean )
 Параметры
 Параметры
 Описание
 tools
 Входной массив инструментов. Тип System.Object.
 stockToolIds
 Входной массив идентификаторов стандартных инструментов. Тип System.Object.
 editCancelled
 Входной флаг отмены изменений. Тип bool. Значение true означает отмену всех сделанных изменений.
 Описание
 Метод предназначен для завершения операции группового редактирования пользовательских инструментов на панели инструментов. Редактируемые объекты задаются массивами tools и stockToolIds. Флаг editCancelled позволяет отменить все сделанные изменения.
 В текущей версии не реализован.
 Замечания
 Чтобы начать групповое редактирование пользовательских инструментов, используется метод BeginMultipleEdit().
 Ссылки
 HostMgd.Windows.ToolPalette.CustomToolBase, HostMgd.Windows.ToolPalette
 Ваши комментарии по поводу этого топика: Послать отзыв!