Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Класс HostMgd.ApplicationServices.TabbedDialogEventArgs
 Послать отзыв
 Иерархия классов
HostMgd::ApplicationServices::TabbedDialogEventArgs
 Синтаксис
C#
Visual Basic
public class TabbedDialogEventArgs : System.EventArgs;
Public Class TabbedDialogEventArgs Inherits System.EventArgs
 Описание
 Класс содержит параметры и действия, относящиеся к событиям для диалога с вкладками.
 Класс добавлен для совместимости.
 Топики
 Имя
 Описание
 TabbedDialogEventArgs Методы
 Ниже перечислены методы класса TabbedDialogEventArgs.
 Ссылки
 TabbedDialogEventArgs Методы, Топики, TabbedDialogEventArgs Методы
 Ваши комментарии по поводу этого топика: Послать отзыв!