Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.MediaBounds.PageSize
 Послать отзыв
 Свойство PageSize представляет размеры страницы. Не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public Teigha.Geometry.Point2d PageSize;
Копировать Код
Public Property PageSize As Teigha.Geometry.Point2d
 Возвращает
 Возвращает размеры страницы по ширине и высоте. Тип Teigha.Geometry.Point2d.
 Описание
 Свойство PageSize представляет размеры страницы. В текущей версии не реализовано.
 Условия
 Чтение и запись.
 Ссылки
 HostMgd.PlottingServices.MediaBounds, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!