Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.SelectLast()
 Послать отзыв
 Метод предоставляет объект, который был создан последним в чертеже.
 Синтаксис
C#
Visual Basic
Копировать Код
public PromptSelectionResult SelectLast();
Копировать Код
Public Function SelectLast() As PromptSelectionResult
 Возвращает
 Возвращает объект типа PromptSelectionResult, содержащий:
Status — статус выполнения (OK, если объект найден, и Cancel, если нет подходящих объектов).
Value — объект типа SelectionSet, содержащий идентификатор (ObjectId) последнего созданного объекта.
StringResult — строковое значение (используется, если в запросе были ключевые слова).
 Если последний объект успешно найден, статус будет равен PromptStatus.OK, и в Value будет содержаться набор с одним объектом.
 Описание
 Метод используется для получения ссылки на последний созданный геометрический объект в чертеже. Это может быть полезно при выполнении команд, которые должны автоматически работать с самым новым объектом без необходимости его ручного выбора.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("SelectLastExample")] public void SelectLastExample() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Вызываем метод PromptSelectionResult result = editor.SelectLast(); // Выводим сообщение в командную строку if (result.Status == PromptStatus.OK) { ObjectId lastObjId = result.Value.GetObjectIds().First(); editor.WriteMessage( $"\nПоследний созданный объект: {lastObjId}"); } else { editor.WriteMessage( "\nНет созданных ранее объектов."); } } }
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!