Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Перечисление HostMgd.Windows.DefaultPane
 Послать отзыв
 This is record HostMgd::Windows::DefaultPane.
 Синтаксис
C#
Visual Basic
public enum DefaultPane { ModeMacro, CursorCoordinates, Snap, Grid, Ortho, Polar, ObjectTrack, LineWeight, PaperModel, Paper, Model, ObjectSnap, Float, Table, Spacer, ViewportMaximizePrevious, ViewportMaximize, ViewportMaximizeNext, DynamicInput, DynamicUcs, LayoutModelIcons, ModelIcon, LayoutIcon, LayoutMoreIcon, All }
Public Enum DefaultPane ModeMacro CursorCoordinates Snap Grid Ortho Polar ObjectTrack LineWeight PaperModel Paper Model ObjectSnap Float Table Spacer ViewportMaximizePrevious ViewportMaximize ViewportMaximizeNext DynamicInput DynamicUcs LayoutModelIcons ModelIcon LayoutIcon LayoutMoreIcon All End Enum
 Ваши комментарии по поводу этого топика: Послать отзыв!