Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.Windows.ToolPalette.CustomToolBase.GetPropTextColor
 Послать отзыв
 Метод задает пользовательский цвет текста метки для свойства. Не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void GetPropTextColor( ref System.Object id, UInt32 textColor );
Копировать Код
Public Overridable Sub GetPropTextColor( ByRef id As System.Object, textColor As UInt32 )
 Параметры
 Параметры
 Описание
 id
 Идентификатор свойства, для которого запрашивается цвет текста. Тип System.Object.
 textColor
 Выходной цвет текста для указанного свойства. Тип UInt32.
 Описание
 Метод позволяет задать пользовательский цвет для текста метки указанного свойства пользовательского инструмента.
 В текущей версии не реализован.
 Ссылки
 HostMgd.Windows.ToolPalette.CustomToolBase, HostMgd.Windows.ToolPalette
 Ваши комментарии по поводу этого топика: Послать отзыв!