Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Делегат HostMgd.Publishing.BeginEntityEventHandler
 Послать отзыв
 This is type HostMgd::Publishing::BeginEntityEventHandler.
 Синтаксис
C#
Visual Basic
public delegate BeginEntityEventHandler();
Public Delegate Sub BeginEntityEventHandler()
 Ваши комментарии по поводу этого топика: Послать отзыв!