Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PromptOptions.IsReadOnly
 Послать отзыв
 Признак доступности свойств класса для записи.
 Синтаксис
C#
Visual Basic
public bool IsReadOnly;
Public Property IsReadOnly() As bool
 Возвращает
 Возвращает признак доступности свойств класса. true - свойства доступны только для чтения, false - свойства доступны для чтения и записи.
 Описание
 Возвращает признак доступности свойств класса UseDefaultValue, DefaultValueWorker для записи. Если значение свойства равно true, то эти свойства класса доступны только для чтения.
 Условия
 Только чтение.
 Ссылки
 HostMgd.EditorInput.PromptOptions, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!