Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.SelectionAddedEventArgs.Remove(int)
 Послать отзыв
 Метод удаляет объект из набора выбранных элементов по указанному индексу.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Remove(int index);
Копировать Код
Public Sub Remove(index As Integer)
 Параметры
 Параметры
 Описание
 index
 Позиция удаляемого объекта в коллекции выбранных объектов. Индексация начинается с 0.
 Пример
 0 — первый объект, 1 — второй и т.д. Тип int
 Описание
 Метод используется для удаления объекта из коллекции выбранных объектов (SelectionSet) по его индексу в этой коллекции. Он позволяет программно изменять состав выборки — например, исключать объекты, не соответствующие определённым критериям, или корректировать выборку перед выполнением команды редактирования.
 Перед удалением рекомендуется проверить, что индекс находится в допустимом диапазоне (0 до Count - 1), чтобы избежать исключения ArgumentOutOfRangeException.
 Метод изменяет внутреннюю структуру набора выделения, и после удаления все последующие объекты сдвигаются на одну позицию вниз.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события SelectionAdded [Teigha.Runtime.CommandMethod("SelectionAddedExample_Remove")] public void SelectionAddedExample_Remove() { // Подписка на событие Rollover editor.SelectionAdded += OnSelectionAdded; } // Реализация отработки события SelectionAdded private void OnSelectionAdded(object sender, SelectionAddedEventArgs e) { // Получаем доступ к выбранным объектам SelectionSet selection = e.Selection; // Вывод сообщения в командную строку editor.WriteMessage($"\nОбъект: {selection[0].ObjectId} будет удалён из выборки"); // Удаление объекта из выборки e.Remove(0); } }
 Ссылки
 HostMgd.EditorInput.SelectionAddedEventArgs, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!