Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Runtime.IMenuItem.Visible
 Послать отзыв
 Свойство Visible позволяет определить, является ли видимым данный элемент меню.
 Синтаксис
C#
Visual Basic
Копировать Код
bool Visible;
Копировать Код
Property Visible As Boolean
 Возвращает
 Возвращает true, если данный элемент меню является видимым. В противном случае возвращает false.
 Описание
 Свойство Visible позволяет определить, является ли видимым данный элемент меню.
 Условия
 Чтение и запись.
 Ссылки
 MenuItem Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!