Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Событие UserConfigurationManager.ProfileSaving
 Послать отзыв
 This is ProfileSaving, a member of class UserConfigurationManager.
 Синтаксис
C#
Visual Basic
public event ProfileEventHandler ProfileSaving;
Public Event ProfileSaving As ProfileEventHandler
 Ссылки
 UserConfigurationManager Класс, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!