Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство ImageInfo.Size
 Послать отзыв
 This is Size, a member of class ImageInfo.
 Синтаксис
C#
Visual Basic
public System.Drawing.Size Size;
Public Property Size() As System.Drawing.Size
 Ссылки
 ImageInfo Класс, HostMgd.Windows.ToolPalette
 Ваши комментарии по поводу этого топика: Послать отзыв!