Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.PlotToFileCapability
 Послать отзыв
 Данное перечисление определяет возможность печати в файл для объекта PlotConfig.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum PlotToFileCapability { NoPlotToFile = 0, PlotToFileAllowed = 1, MustPlotToFile = 2 }
Копировать Код
Public Enum PlotToFileCapability NoPlotToFile = 0 PlotToFileAllowed = 1 MustPlotToFile = 2 End Enum
 Члены
 Члены
 Описание
 MustPlotToFile
 Значение: 2. Устройство поддерживает вывод данных только в файл. Свойство PlotConfig.IsPlotToFile всегда возвращает значение true.
 NoPlotToFile
 Значение: 0. Устройство не поддерживает печать в файл. Свойство PlotConfig.IsPlotToFile всегда возвращает значение false.
 PlotToFileAllowed
 Значение: 1. Устройство поддерживает печать в файл. Если текущая конфигурация устройства настроена на печать в файл, то свойство PlotConfig.IsPlotToFile возвращает значение true.
 Описание
 Перечисление PlotToFileCapability определяет возможность печати в файл для объекта PlotConfig.
 Ваши комментарии по поводу этого топика: Послать отзыв!