Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.DocumentCollection.DocumentLockModeChangeVetoed
 Послать отзыв
 Событие, возникающее при запрете блокировки dwg-документа.
 Синтаксис
C#
Visual Basic
public event DocumentLockModeChangeVetoedEventHandler DocumentLockModeChangeVetoed;
Public Event DocumentLockModeChangeVetoed As DocumentLockModeChangeVetoedEventHandler
 Возвращает
 Возвращает тип данных HostMgd.ApplicationServices.DocumentLockModeChangeVetoedEventHandler
 Описание
 Событие возникает при запрете блокировки dwg-документа. Попытка блокировки документа может быть запрещена реактором, получившим событие DocumentLockModeChanged. Если запрет произошел, все реакторы получат данное событие и все реакторы смогут получить информацию о запрете блокировки, даже если не все реакторы получили событие DocumentLockModeChanged до того, как будет запрещена блокировка.
 Соответствует функции NRX API HostApDocManagerReactor.documentLockModeChangeVetoed().
 Ссылки
 HostMgd.ApplicationServices.DocumentCollection, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!