Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Palette.PaletteSet
 Послать отзыв
 This is PaletteSet, a member of class Palette.
 Синтаксис
C#
Visual Basic
public HostMgd::Windows::PaletteSet PaletteSet;
Public Property PaletteSet() As HostMgd.Windows.PaletteSet
 Ссылки
 Palette Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!