Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.Application.ShowModelessDialog(System.Windows.Forms.IWin32Window,System.Windows.Forms.Form)
 Послать отзыв
 Метод предназначен для вызова немодального диалогового окна, построенного с помощью WinForms, с заданным окном-владельцем.
 Синтаксис
C#
Visual Basic
Копировать Код
public static void ShowModelessDialog(System.Windows.Forms.IWin32Window owner, System.Windows.Forms.Form formToShow);
Копировать Код
Public Shared Sub ShowModelessDialog(owner As System.Windows.Forms.IWin32Window, formToShow As System.Windows.Forms.Form)
 Параметры
 Параметры
 Описание
 owner
 Окно владельца диалога
 formToShow
 Форма, которая должна быть отображена
 Описание
 Метод отображает немодальный диалог, построенный на WinForms, у которого указано окно-владелец. Необходимо пользоваться именно этим методом вместо метода Form.Show, который может привести к непредсказуемому результату.
 Ссылки
 HostMgd.ApplicationServices.Application, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!