Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод PaneCollection.CopyTo (array<HostMgd::Windows::Pane^>^, int)
 Послать отзыв
 Копирует элементы коллекции или часть из них в одномерный массив.
 Синтаксис
C#
Visual Basic
public void CopyTo(ref array<HostMgd::Windows::Pane^> array, int index);
Public Sub CopyTo(ByRef array As array<HostMgd.Windows.Pane^>, index As Integer)
 Параметры
 Параметры
 Описание
 index
 Значение индекса в массиве, начиная с котрого в него копируются элементы коллекции.
 a
 Массив, куда копируются элементы коллекции. Индекс массива должен начинаться с 0.
 Ссылки
 PaneCollection Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!