Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство MenuItemCollection.Item
 Послать отзыв
 This is Item, a member of class MenuItemCollection.
 Синтаксис
C#
Visual Basic
public HostMgd::Windows::MenuItem Item;
Public Property Item() As HostMgd.Windows.MenuItem
 Ссылки
 MenuItemCollection Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!