Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Делегат HostMgd.Publishing.AboutToMoveFileEventHandler
 Послать отзыв
 This is type HostMgd::Publishing::AboutToMoveFileEventHandler.
 Синтаксис
C#
Visual Basic
public delegate AboutToMoveFileEventHandler();
Public Delegate Sub AboutToMoveFileEventHandler()
 Ваши комментарии по поводу этого топика: Послать отзыв!