Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.Windows.ToolPalette.CustomToolBase.SetFlyoutTools
 Послать отзыв
 Метод вызывается для инструмента, отображаемого в виде формы на выпадающей панели инструментов, когда выпадающий инструмент выполняется или перетаскивается. Не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetFlyoutTools( ref System.Object flyoutToolIds );
Копировать Код
Public Overridable Sub SetFlyoutTools( ByRef flyoutToolIds As System.Object )
 Параметры
 Параметры
 Описание
 flyoutToolIds
 Входной массив идентификаторов инструментов на выпадающей панели инструментов. Тип System.Object.
 Описание
 Метод вызывается для инструмента, отображаемого в виде формы на выпадающей панели инструментов, когда выпадающий инструмент выполняется или перетаскивается. Метод передаёт ID выпадающего инструмента COM-объекту инструмента во время выполнения или перетаскивания.
 В текущей версии не реализован.
 Ссылки
 HostMgd.Windows.ToolPalette.CustomToolBase, HostMgd.Windows.ToolPalette
 Ваши комментарии по поводу этого топика: Послать отзыв!