Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.Document.Name
 Послать отзыв
 Свойство предоставляет полное название dwg-документа.
 Синтаксис
C#
Visual Basic
public System.String Name;
Public Property Name() As System.String
 Возвращает
 Полное имя dwg-документа. Тип String
 Описание
 Свойство предоставляет полное название dwg-документа.
 Условия
 Только чтение
 Ссылки
 HostMgd.ApplicationServices.Document, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!