Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.Application.ShowModalWindow(System.Windows.Window)
 Послать отзыв
 Метод предназначен для вызова WPF-формы в модальном режиме.
 Синтаксис
C#
Visual Basic
Копировать Код
public static bool? ShowModalWindow(System.Windows.Window formToShow);
Копировать Код
Public Shared Function ShowModalWindow(formToShow As System.Windows.Window) As Boolean?
 Параметры
 Параметры
 Описание
 formToShow
 Форма, которая должна быть показана
 Возвращает
 Возвращает результат работы диалога, тип bool. Также возможно значение null.
 Описание
 Метод вызывает WPF-форму в модальном режиме.
 Ссылки
 HostMgd.ApplicationServices.Application, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!