Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.Windows.ToolPalette.CustomToolBase.GetPredefinedValue
 Послать отзыв
 Метод вызывается для получения фактического значения свойства, когда пользователь выбирает один из предопределённых вариантов. Не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void GetPredefinedValue( int dispatchId, UInt32 cookie, ref System.Object value );
Копировать Код
Public Overridableic Sub GetPredefinedValue( dispatchId As Integer, cookie As UInt32, ByRef value As System.Object )
 Параметры
 Параметры
 Описание
 dispatchId
 Входной диспетчерский идентификатор свойства (DispID), для которого запрашивается значение. Тип int.
 cookie
 Входной числовой идентификатор выбранного варианта, заданный ранее методом GetPredefinedStrings(). Тип UInt32.
 value
 Выходное значение, соответствующее значению cookie. Тип System.Object.
 Описание
 Метод вызывается для получения фактического значения свойства по значению идентификатора cookie, которое соответствует выбору пользователя из списка предопределённых вариантов (например, из выпадающего списка свойств).
 В текущей версии не реализован.
 Ссылки
 HostMgd.Windows.ToolPalette.CustomToolBase, HostMgd.Windows.ToolPalette
 Ваши комментарии по поводу этого топика: Послать отзыв!