Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод KeywordCollection.GetDisplayString
 Послать отзыв
 Синтаксис
C#
Visual Basic
public String GetDisplayString(bool showNoDefault);
Public Function GetDisplayString(showNoDefault As bool) As String
 Параметры
 Параметры
 Описание
 showNoDefault
 При значении true в результирующую строку не входят значения ключевых слов по умолчанию.
 Описание
 Метод возвращает строку, представляющую ключевое слово, как оно отображается пользователю.
 Ссылки
 KeywordCollection Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!