Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.SetCurrentView(ViewTableRecord)
 Послать отзыв
 Метод устанавливает текущий вид чертежа, используя заданную запись таблицы видов.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetCurrentView(ViewTableRecord value);
Копировать Код
Public Sub SetCurrentView(value As ViewTableRecord)
 Параметры
 Параметры
 Описание
 value
 Объект, представляющий новую конфигурацию вида. Должен быть получен из таблицы видов (ViewTable) или построен программно с корректными параметрами отображения. Тип ViewTableRecord
 Описание
 Метод используется для программного изменения текущего вида в чертеже nanoCAD. Он принимает объект ViewTableRecord, представляющий собой запись из таблицы видов, и применяет его параметры (положение камеры, направление взгляда, окно просмотра и др.) к активному пространству модели или листа. Это позволяет быстро переключать отображение чертежа между различными предопределенными или динамически созданными видами.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("SetCurrentViewExample")] public void SetCurrentViewExample() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Получение текущего вида ViewTableRecord currentView = editor.GetCurrentView(); // Изменение параметров вида, например, положения камеры currentView.CenterPoint = new Point2d(100, 100); currentView.Height = 500; // Установка изменённого вида как текущего editor.SetCurrentView(currentView); // Выводим сообщение в командную строку editor.WriteMessage("\nТекущий вид изменён."); } }
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!