Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.BeginPlotEventArgs.BeginPlotEventArgs
 Послать отзыв
 Конструктор класса BeginPlotEventArgs. Создает экземпляр класса с указанными параметрами.
 Синтаксис
C#
Visual Basic
Копировать Код
public BeginPlotEventArgs( ref HostMgd.PlottingServices.PlotProgress progress, HostMgd.PlottingServices.PlotType plotType );
Копировать Код
Public Sub New( ByRef progress As HostMgd.PlottingServices.PlotProgress, plotType As HostMgd.PlottingServices.PlotType )
 Параметры
 Параметры
 Описание
 progress
 Назначенное поведение диалога прогресса печати. Тип HostMgd.PlottingServices.PlotProgress.
 plotType
 Тип печати. Значение из перечисления HostMgd.PlottingServices.PlotType.
 Описание
 Конструктор класса BeginPlotEventArgs. Создает экземпляр класса с указанными параметрами.
 Ссылки
 HostMgd.PlottingServices.BeginPlotEventArgs, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!