Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.DocumentWindowCollection.TileVertically
 Послать отзыв
 Метод позволяет разместить дочерние окна MDI вертикально. В текущей версии не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public void TileVertically();
Копировать Код
Public Sub TileVertically()
 Описание
 Метод позволяет разместить дочерние окна MDI данной коллекции вертикально. В текущей версии не реализован.
 Ссылки
 HostMgd.ApplicationServices.DocumentWindowCollection, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!