Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.InplaceTextEditor.SpellDictinaryDialog
 Послать отзыв
 Метод вызывает диалоговое окно проверки орфографии. В текущей версии не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SpellDictinaryDialog();
Копировать Код
Public Sub SpellDictinaryDialog()
 Описание
 Метод вызывает диалоговое окно проверки орфографии в данном текстовом редакторе. В текущей версии метод не реализован.
 Ссылки
 HostMgd.ApplicationServices.InplaceTextEditor, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!