Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство JigPromptPointOptions.DefaultValue
 Послать отзыв
 Значение по умолчанию для запроса точки во время операции Jig.
 Синтаксис
C#
Visual Basic
public Teigha.Geometry.Point3d DefaultValue;
Public Property DefaultValue() As Teigha.Geometry.Point3d
 Возвращает
 Возвращает тип данных Point3d - точка, заданная по умолчанию.
 Описание
 Свойство предназначено для чтения и определения точки по умолчанию для запроса точки во время операции Jig с геометрическим объектом. Значение по умолчанию будет использовано, если пользователь во время запроса нажал клавишу ENTER без какого-либо ввода.
 Условия
 Чтение и запись.
 Ссылки
 JigPromptPointOptions Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!