Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Класс HostMgd.EditorInput.PromptDragOptions
 Послать отзыв
 Иерархия классов
HostMgd::EditorInput::PromptOptions HostMgd::EditorInput::PromptEditorOptions HostMgd::EditorInput::PromptDragOptions
 Синтаксис
C#
Visual Basic
public class PromptDragOptions : PromptEditorOptions;
Public Class PromptDragOptions Inherits PromptEditorOptions
 Описание
 Этот класс позволяет определить пользовательские настройки, отображаемые в командной строке перед операцией перетаскивания.
 Методы
 Конструкторы
 Класс HostMgd.EditorInput.PromptDragOptions
 Имя
 Описание
 PromptDragOptions
 Это обзор перегрузок PromptDragOptions.
 Топики
 Имя
 Описание
 PromptOptions Методы
 Ниже перечислены методы класса PromptOptions.
 PromptOptions Свойства
 Ниже перечислены свойства класса PromptOptions.
 Класс HostMgd.EditorInput.PromptDragOptions
 Имя
 Описание
 PromptDragOptions Свойства
 Ниже перечислены свойства класса PromptDragOptions.
 Ссылки
 PromptDragOptions Конструктор, PromptDragOptions Свойства, Методы, Топики, PromptOptions Методы, PromptOptions Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!