Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Класс HostMgd.ApplicationServices.DocumentActivationChangedEventArgs
 Послать отзыв
 Иерархия классов
HostMgd::ApplicationServices::DocumentActivationChangedEventArgs
 Синтаксис
C#
Visual Basic
public class DocumentActivationChangedEventArgs : System.EventArgs;
Public Class DocumentActivationChangedEventArgs Inherits System.EventArgs
 Описание
 Класс, обеспечивающий данными событие DocumentActivationChanged класса DocumentCollection.
 Топики
 Имя
 Описание
 DocumentActivationChangedEventArgs Свойства
 Ниже перечислены свойства класса DocumentActivationChangedEventArgs.
 Ссылки
 DocumentActivationChangedEventArgs Свойства, Топики, DocumentActivationChangedEventArgs Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!