Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.Windows.ToolPalette.FlyoutEntryAttribute.FlyoutEntryAttribute
 Послать отзыв
 Конструктор по умолчанию класса FlyoutEntryAttribute. Не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public FlyoutEntryAttribute();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса FlyoutEntryAttribute. В текущей версии не реализован.
 Ссылки
 HostMgd.Windows.ToolPalette.FlyoutEntryAttribute, HostMgd.Windows.ToolPalette
 Ваши комментарии по поводу этого топика: Послать отзыв!