Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод UserConfigurationManager.SetCurrentProfile
 Послать отзыв
 This is SetCurrentProfile, a member of class UserConfigurationManager.
 Синтаксис
C#
Visual Basic
public void SetCurrentProfile(ref System.String profileName);
Public Sub SetCurrentProfile(ByRef profileName As System.String)
 Ссылки
 UserConfigurationManager Класс, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!