Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод SelectionSet.ToString (IFormatProvider^)
 Послать отзыв
 Синтаксис
C#
Visual Basic
public String ToString(ref IFormatProvider provider);
Public Function ToString(ByRef provider As IFormatProvider) As String
 Параметры
 Параметры
 Описание
 provider
 Формат, зависящей от локализации
 Описание
 Возвращает строковое представление данного объекта в соответствии с заданным форматом, зависящим от локализации.
 Ссылки
 SelectionSet Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!