Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод SelectionDetails.ToString (IFormatProvider^)
 Послать отзыв
 Синтаксис
C#
Visual Basic
public String ToString(ref IFormatProvider provider);
Public Function ToString(ByRef provider As IFormatProvider) As String
 Параметры
 Параметры
 Описание
 provider
 Формат, зависящий от локализации
 Описание
 Возвращает строку, представляющую объект в соответствии с заданным форматом, зависящим от локализации.
 Ссылки
 SelectionDetails Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!