Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PromptFileOptions.AllowUrls
 Послать отзыв
 Синтаксис
C#
Visual Basic
public bool AllowUrls;
Public Property AllowUrls() As bool
 Описание
 Свойство возвращает и устанавливает признак разрешения ввода URL адресов.
 Условия
 На чтение и запись
 Ссылки
 PromptFileOptions Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!