Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 JigPrompts.AcquireString()
 Послать отзыв
 Метод запрашивает у пользователя строку/текстовые данные.
 Синтаксис
C#
Visual Basic
public HostMgd.EditorInput.PromptResult AcquireString();
Public Function AcquireString() As HostMgd.EditorInput.PromptResult
 Возвращает
 Возвращает результат типа string, который является строкой, введенной пользователем с клавиатуры в ответ на запрос.
 Описание
 Метод предназначен для запроса у пользователя текстовых данных, которые необходимо ввести с клавиатуры. После вызова создает пустой экземпляр класса JigPromptStringOptions и вызывает свою перегрузку JigPrompts.AcquireString(JigPromptStringOptions options).
 Пример
 В примере приведен отрывок кода из реализации метода Sampler() класса Jig.
C#
 Копировать Код
 PromptResult result = prompts.AcquireString();
Visual Basic
 Копировать Код
 Dim result As PromptResult = prompts.AcquireString()
 Ссылки
 JigPrompts Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!