Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.InplaceTextEditor.SpellerEnabled
 Послать отзыв
 Свойство SpellerEnabled позволяет определить, включена ли в данном редакторе проверка орфографии. В текущей версии не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool SpellerEnabled;
Копировать Код
Public Property SpellerEnabled As Boolean
 Возвращает
 Возвращает true, если проверка орфографии включена. В противном случае возвращает false.
 Описание
 Свойство SpellerEnabled позволяет определить, включена ли в данном редакторе проверка орфографии. В текущей версии не реализовано.
 Условия
 Чтение и запись.
 Ссылки
 HostMgd.ApplicationServices.InplaceTextEditor, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!