Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.ProfileEventArgs.ProfileName
 Послать отзыв
 Свойство ProfileName представляет имя профиля. В текущей версии данное свойство не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public String ProfileName;
Копировать Код
Public ReadOnly Property ProfileName As String
 Возвращает
 Возвращает имя профиля. Тип String.
 Описание
 Свойство ProfileName представляет имя профиля.
 В текущей версии данное свойство не реализовано.
 Условия
 Только чтение.
 Ссылки
 HostMgd.ApplicationServices.ProfileEventArgs, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!