Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство BeginAggregationEventArgs.DwfFileName
 Послать отзыв
 This is DwfFileName, a member of class BeginAggregationEventArgs.
 Синтаксис
C#
Visual Basic
public System.String DwfFileName;
Public Property DwfFileName() As System.String
 Ссылки
 BeginAggregationEventArgs Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!