Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор WindowOnHandle.WindowOnHandle
 Послать отзыв
 This is WindowOnHandle, a member of class WindowOnHandle.
 Синтаксис
C#
Visual Basic
public WindowOnHandle(HWND hWnd);
Public Sub New(hWnd As HWND)
 Ссылки
 WindowOnHandle Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!