Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.DeviceInputEventArgs.LParam
 Послать отзыв
 Свойство LParam представляет компонент сообщения в виде указателя на параметр Windows LParam. Не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public System.IntPtr LParam;
Копировать Код
Public ReadOnly Property LParam As System.IntPtr
 Возвращает
 Возвращает указатель на параметр LParam. Тип System.IntPtr.
 Описание
 Свойство LParam представляет компонент в структуре сообщения MSG в виде указателя на параметр Windows LParam (Long Parameter).
 В текущей версии не реализовано.
 Условия
 Только чтение.
 Ссылки
 HostMgd.EditorInput.DeviceInputEventArgs, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!