Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Transient
 Послать отзыв
 Класс Transient представляет временные объекты, создаваемые редактором nanoCAD. В текущей версии не реализован.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::GraphicsInterface::Drawable HostMgd::EditorInput::Transient
 Синтаксис
C#
Visual Basic
Копировать Код
public class Transient : Drawable
Копировать Код
Public Class Transient Inherits Drawable
 Описание
 Класс Transient наследует класс Drawable и представляет временные объекты, создаваемые редактором nanoCAD.
 В текущей версии не реализован.
 Методы
 Конструкторы
 Teigha.GraphicsInterface.Drawable
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 Drawable
 Конструктор класса Teigha.GraphicsInterface.Drawable. (Унаследован от Drawable)
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.GraphicsInterface.Drawable
 Имя
 Описание
 Drawable Методы
 Ниже перечислены методы класса Drawable.
 Drawable Свойства
 Ниже перечислены свойства класса Drawable.
 HostMgd.EditorInput.Transient
 Имя
 Описание
 Transient Методы
 Ниже перечислены методы класса Transient.
 Transient Свойства
 Ниже перечислены свойства класса Transient.
 Ссылки
 Transient Методы, Transient Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!