Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Window.WindowState
 Послать отзыв
 Синтаксис
C#
Visual Basic
public Window.State WindowState;
Public Property WindowState() As Window.State
 Описание
 Обеспечивает доступ к статусу отображения окна.
 Условия
 На чтение и запись
 Ссылки
 Window Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!