Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.Document.Editor
 Послать отзыв
 Свойство предоставляет доступ к редактору dwg-документа.
 Синтаксис
C#
Visual Basic
Копировать Код
public Editor Editor;
Public Property Editor() As HostMgd.EditorInput.Editor
 Возвращает
 Возвращает редактор, ассоциированный с данным документом. Тип Editor
 Описание
 Свойство предоставляет доступ к редактору dwg-документа.
 Условия
 Только чтение
 Ссылки
 HostMgd.ApplicationServices.Document, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!