Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.PreviewEndPlotInfo.DeleteUnmanagedObject
 Послать отзыв
 Метод удаляет неуправляемый объект. Не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public sealed override void DeleteUnmanagedObject();
Копировать Код
Public NotOverridable Overrides Sub DeleteUnmanagedObject()
 Описание
 Метод предназначен для удаления неуправляемого объекта.
 В текущей версии не реализован.
 Ссылки
 HostMgd.PlottingServices.PreviewEndPlotInfo, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!