Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.GetInteger(PromptIntegerOptions)
 Послать отзыв
 Метод позволяет пользователю ввести целое число в диапазоне от -32768 до +32767 с возможностью настройки параметров ввода.
 Синтаксис
C#
Visual Basic
Копировать Код
public PromptIntegerResult GetInteger(PromptIntegerOptions options);
Копировать Код
Public Function GetInteger(options As PromptIntegerOptions) As PromptIntegerResult
 Параметры
 Параметры
 Описание
 options
 Объект, содержащий параметры ввода:
 Возвращает
 Возвращает объект типа PromptIntegerResult, который содержит:
Status — статус операции (OK, Cancel, Error и др.).
Value — введённое пользователем целое число (int), если ввод был успешным.
StringResult — строковое представление введённого значения.
 Описание
 Метод используется для интерактивного получения целочисленного значения от пользователя через командную строку. Пользователь может ввести число вручную или указать значение графически (если поддерживается). Метод предоставляет гибкие настройки приглашения, такие как сообщение, начальное значение, ограничения и дополнительные подсказки. Диапазон допустимых значений соответствует 16-битному целому числу со знаком.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("GetIntegerExample_PromptIntegerOptions")] public void GetIntegerExample_PromptIntegerOptions() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создаём запрос пользователю PromptIntegerOptions iopts = new PromptIntegerOptions("Введите целое число"); iopts.DefaultValue = 10; iopts.LowerLimit = 0; iopts.UpperLimit = 100; PromptIntegerResult ipr = editor.GetInteger(iopts); // Если все данные введены, выводим результат в командную строку if (PromptStatus.OK == ipr.Status) { editor.WriteMessage("\nВы ввели: " + ipr.Value); } else { editor.WriteMessage("\nОтмена или ошибка ввода."); } } }
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!