Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.InplaceTextEditor.HightlightColorDialog
 Послать отзыв
 Метод вызывает диалог настройки цвета подсветки. В текущей версии не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public void HightlightColorDialog();
Копировать Код
Public Sub HightlightColorDialog()
 Описание
 Метод вызывает диалог настройки цвета подсветки объектов в редакторе. В текущей версии метод не реализован.
 Ссылки
 HostMgd.ApplicationServices.InplaceTextEditor, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!