Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.Windows.ToolPalette.CustomToolBase.EndEdit
 Послать отзыв
 Метод завершает редактирование пользовательского инструмента с опцией отмены изменений. Не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void EndEdit( bool bEditCancelled );
Копировать Код
Public Overridable Sub EndEdit( bEditCancelled As Boolean )
 Параметры
 Параметры
 Описание
 bEditCancelled
 Входной флаг отмены изменений. Тип bool. Значение true означает отмену всех сделанных изменений. В противном случае редактирование считается завершенным успешно.
 Описание
 Метод позволяет завершить редактирование пользовательского инструмента. Входной флаг bEditcanceled используется для отмены сделанных изменений.
 В текущей версии не реализован.
 Ссылки
 HostMgd.Windows.ToolPalette.CustomToolBase, HostMgd.Windows.ToolPalette
 Ваши комментарии по поводу этого топика: Послать отзыв!