Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PointInputEventArgs.Handled
 Послать отзыв
 Свойство Handled позволяет указать или проверить, обработано ли событие, связанное с выделением точки. Не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool Handled;
Копировать Код
Public Property Handled As Boolean
 Возвращает
 Возвращает true, если событие обработано. В противном случае возвращает false.
 Описание
 Свойство Handled позволяет указать или проверить, обработано ли событие, связанное с выделением точки.
 В текущей версии не реализовано.
 Условия
 Чтение и запись.
 Ссылки
 HostMgd.EditorInput.PointInputEventArgs, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!