Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.PromptedForInteger
 Послать отзыв
 Событие возникает после завершения операции ввода целого числа пользователем в редакторе nanoCAD. Событие не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public event PromptIntegerResultEventHandler PromptedForInteger;
Копировать Код
Public Event PromptedForInteger As PromptIntegerResultEventHandler
 Описание
 Событие инициируется, когда пользователь завершает ввод целочисленного значения через интерактивную команду — например, с помощью метода GetInteger(). Оно предоставляет результат ввода, включая значение, статус (OK, Cancel, Error) и строковое представление введённых данных. Это событие используется для обработки или анализа введённого числа, а также для выполнения действий на основе ввода пользователя.
 Событие реализуется через делегат PromptIntegerResultEventHandler, который передаёт данные о вводе в виде объекта PromptIntegerResultEventArgs.
 Замечания
 Это событие особенно полезно при разработке надстроек, где требуется отслеживать ввод целых чисел — таких как количество копий, индексы, номера слоёв или другие параметры, ограниченные диапазоном 16-битного целого числа (-32768 до +32767).
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события PromptedForInteger [Teigha.Runtime.CommandMethod("PromptedForIntegerExample")] public void PromptedForIntegerExample() { // Подписка на событие PromptedForInteger editor.PromptedForInteger += OnEditorPromptedForInteger; } // Реализация отработки события PromptedForInteger private void OnEditorPromptedForInteger(object sender, PromptIntegerResultEventArgs e) { // Вывод сообщения в командную строку if (e.Result.Status == PromptStatus.OK) { editor.WriteMessage($"\nВведено число: {e.Result.Value}"); } else { editor.WriteMessage("\nЧисло не введено."); } } }
 Порядок работы с событием:
Пользователь вызывает команду, запрашивающую ввод целого числа.
Ввод выполняется с клавиатуры или графически.
После завершения ввода генерируется событие PromptedForInteger.
Разработчик может получить доступ к числу и его статусу через параметры события.
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!