Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод PickPointDescriptor.IsEqualTo (HostMgd::EditorInput::PickPointDescriptor^, Teigha::Geometry::Tolerance)
 Послать отзыв
 Синтаксис
C#
Visual Basic
public bool IsEqualTo(ref HostMgd::EditorInput::PickPointDescriptor a, Teigha::Geometry::Tolerance tolerance);
Public Function IsEqualTo(ByRef a As HostMgd.EditorInput.PickPointDescriptor, tolerance As Teigha.Geometry.Tolerance) As bool
 Параметры
 Параметры
 Описание
 a
 Объект для сравнения
 tolerance
 Значение допуска
 Описание
 Этот метод сравнивает свойства PointOnLine (базовая точка) и Direction (направление) объекта a, являющегося параметром метода, с такими же свойствами данного объекта с допуском, заданным параметром метода.
 Ссылки
 PickPointDescriptor Структура, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!