Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PlotConfigInfo.DeviceName
 Послать отзыв
 Имя устройства.
 Синтаксис
C#
Visual Basic
public System.String DeviceName;
Public Property DeviceName() As System.String
 Описание
 Это может быть имя принтера или имя PC3 файла
 Ссылки
 PlotConfigInfo Класс, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!