Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PromptOpenFileOptions.SearchPath
 Послать отзыв
 Синтаксис
C#
Visual Basic
public bool SearchPath;
Public Property SearchPath() As bool
 Описание
 Устанавливает или возвращает признак того, что разрешен поиск пути к файлу. Если свойство имеет значение true, то поиск пути к файлу разрешен.
 Условия
 На чтение и запись
 Ссылки
 PromptOpenFileOptions Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!