Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.Windows.ToolPalette.CustomToolBase.GetToolProperties
 Послать отзыв
 Метод предназначен для получения объекта, представляющего свойства пользовательского инструмента. Не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual System.Object GetToolProperties();
Копировать Код
Public Overridable Function GetToolProperties() As System.Object
 Возвращает
 Возвращает объект, представляющий свойства пользовательского инструмента. Тип System.Object.
 Описание
 Метод предназначен для получения объекта, представляющего свойства пользовательского инструмента. Свойства инструмента могут запрашиваться, например, при выделении пользователем пользовательского инструмента на панели инструментов.
 В текущей версии не реализован.
 Замечания
 Данный метод возвращает тот же объект, который передается в метод SetToolProperties().
 Ссылки
 HostMgd.Windows.ToolPalette.CustomToolBase, HostMgd.Windows.ToolPalette
 Ваши комментарии по поводу этого топика: Послать отзыв!