Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.DocumentCollection.IsApplicationContext
 Послать отзыв
 Свойство предоставляет информацию о выполнении функции в контексте приложения.
 Синтаксис
C#
Visual Basic
public bool IsApplicationContext;
Public Property IsApplicationContext() As bool
 Возвращает
 Возвращает признак того, что в данный момент функция исполняется в контексте приложения: true - ункция исполняется в контексте приложения, false - функция не исполняется в контексте приложения. Тип bool
 Описание
 Свойство предоставляет информацию о выполнении функции в контексте приложения.
 Замечания
 Не реализовано
 Условия
 Только чтение
 Ссылки
 HostMgd.ApplicationServices.DocumentCollection, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!