Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptNestedEntityOptionsEventArgs.Options
 Послать отзыв
 Свойство предоставляет доступ к параметрам приглашения, используемым при выборе вложенного геометрического объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public PromptNestedEntityOptions Options { get; }
Копировать Код
Public ReadOnly Property Options As PromptNestedEntityOptions
 Возвращает
 Возвращает объект типа PromptNestedEntityOptions. Если параметры не были инициализированы, может вернуть null.
Message — текст, отображаемый в командной строке.
AllowNone — разрешено ли завершить операцию без выбора.
Keywords — (при наличии) ключевые слова, доступные в процессе выбора.
 Описание
 Свойство возвращает объект типа PromptNestedEntityOptions, который содержит настройки операции выбора объекта, вложенного в блок или внешнюю ссылку. Оно используется в событии PromptingForNestedEntity для динамического изменения параметров ввода перед началом взаимодействия с пользователем.
 Через это свойство можно:
изменить текст приглашения (Message),
разрешить или запретить отмену выбора (AllowNone),
настроить дополнительные режимы поведения команды.
 Условия
 Только чтение
 Ссылки
 HostMgd.EditorInput.PromptNestedEntityOptionsEventArgs, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!