Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Событие PaletteSet.SizeChanged
 Послать отзыв
 Событие генерируется после изменения размера
 Синтаксис
C#
Visual Basic
public event HostMgd::Windows::PaletteSetSizeEventHandler SizeChanged;
Public Event SizeChanged As HostMgd.Windows.PaletteSetSizeEventHandler
 Ссылки
 PaletteSet Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!