Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Событие PaletteSet.PaletteActivated
 Послать отзыв
 Событие генерируется после активации новой панели (переключение)
 Синтаксис
C#
Visual Basic
public event HostMgd::Windows::PaletteActivatedEventHandler PaletteActivated;
Public Event PaletteActivated As HostMgd.Windows.PaletteActivatedEventHandler
 Ссылки
 PaletteSet Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!