Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.PlotPageInfo.EntityCount
 Послать отзыв
 Свойство EntityCount предоставляет оценку количества объектов чертежа на странице.
 Синтаксис
C#
Visual Basic
Копировать Код
public int EntityCount;
Копировать Код
Public ReadOnly Property EntityCount As Integer
 Возвращает
 Возвращает количество объектов чертежа. Тип int.
 Описание
 Свойство EntityCount позволяет получить оценку количества объектов чертежа на печатаемой странице.
 Условия
 Только чтение.
 Ссылки
 HostMgd.PlottingServices.PlotPageInfo, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!