Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptNestedEntityOptions.PromptNestedEntityOptions(string,string)
 Послать отзыв
 Конструктор инициализирует новый экземпляр класса с заданным сообщением, включающим локальные ключевые слова, и списком глобальных ключевых слов.
 Синтаксис
C#
Visual Basic
Копировать Код
public PromptNestedEntityOptions(string messageAndKeywords, string globalKeywords);
Копировать Код
Public Sub New(messageAndKeywords As String, globalKeywords As String)
 Параметры
 Параметры
 Описание
 messageAndKeywords
 Строка, содержащая сообщение и список локальных ключевых слов в формате: "сообщение [ключ1/ключ2/ключN]".
 globalKeywords
 Строка, содержащая глобальные команды, разделённые пробелом. Эти команды остаются доступными независимо от контекста.
 Пример
 "Выберите тип объекта [Прямоугольник/Полилиния]". Тип string "Отмена Выход Повтор". Тип string
 Описание
 Конструктор создаёт объект класса PromptNestedEntityOptions, используемый при настройке операции выбора вложенного геометрического объекта — например, внутри блока или внешней ссылки. Он позволяет одновременно задать:
текст приглашения с локальными ключевыми словами, заключёнными в квадратные скобки: "Выберите объект [Линия/Круг]",
глобальные ключевые слова , доступные в любой момент ввода, разделённые пробелом: "Отмена Выход".
 Этот конструктор особенно полезен при реализации интерактивных команд, где пользователь может выбрать действие из списка или ввести системную команду, не прерывая операцию.
 После вызова конструктора локальные ключевые слова автоматически добавляются в коллекцию Keywords, а глобальные становятся доступными через GlobalKeywords.
 Ссылки
 HostMgd.EditorInput.PromptNestedEntityOptions, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!