Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Перечисление HostMgd.Windows.ToolPalette.ExecutionContext
 Послать отзыв
 This is record HostMgd::Windows::ToolPalette::ExecutionContext.
 Синтаксис
C#
Visual Basic
public enum ExecutionContext { DroppedInDrawing = 1, LeftButtonClicked = 0 }
Public Enum ExecutionContext DroppedInDrawing = 1 LeftButtonClicked = 0 End Enum
 Ваши комментарии по поводу этого топика: Послать отзыв!