Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.PreTranslateMessageEventArgs
 Послать отзыв
 Класс PreTranslateMessageEventArgs представляет данные события PreTranslateMessage класса Application. В текущей версии не реализован.
 Иерархия классов
HostMgd::ApplicationServices::PreTranslateMessageEventArgs
 Синтаксис
C#
Visual Basic
Копировать Код
public sealed class PreTranslateMessageEventArgs : System.EventArgs
Копировать Код
Public NotInheritable Class PreTranslateMessageEventArgs Inherits System.EventArgs
 Описание
 Класс PreTranslateMessageEventArgs наследует класс System.EventArgs и предоставляет данные события PreTranslateMessage класса Application, в частности, объект сообщения в формате структуры MSG и флаг состояния события (обработано или нет).
 В текущей версии не реализован.
 Топики
 Имя
 Описание
 PreTranslateMessageEventArgs Свойства
 Ниже перечислены свойства класса PreTranslateMessageEventArgs.
 Ссылки
 PreTranslateMessageEventArgs Свойства, Топики, PreTranslateMessageEventArgs Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!