Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PlotProgress.SheetProgressPos
 Послать отзыв
 Позиция индикатора печати страницы
 Синтаксис
C#
Visual Basic
public int SheetProgressPos;
Public Property SheetProgressPos() As Integer
 Ссылки
 PlotProgress Класс, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!