Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор MenuItemCollection.MenuItemCollection
 Послать отзыв
 This is MenuItemCollection, a member of class MenuItemCollection.
 Синтаксис
C#
Visual Basic
public MenuItemCollection(ref HostMgd::Windows::Menu owner);
Public Sub New(ByRef owner As HostMgd.Windows.Menu)
 Ссылки
 MenuItemCollection Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!