Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PublishSheetEventArgs.LayoutBoundsMaxX
 Послать отзыв
 This is LayoutBoundsMaxX, a member of class PublishSheetEventArgs.
 Синтаксис
C#
Visual Basic
public double LayoutBoundsMaxX;
Public Property LayoutBoundsMaxX() As Double
 Ссылки
 PublishSheetEventArgs Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!