Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод KeywordCollection.Add (String^)
 Послать отзыв
 Синтаксис
C#
Visual Basic
public void Add(ref String globalName);
Public Sub Add(ByRef globalName As String)
 Параметры
 Параметры
 Описание
 globalName
 Глобальное имя. Оно никогда не показывается на экране, а применяется для того, чтобы доступ к ключевому слову производился независимо от локализации (используемого языка).
 Описание
 Метод добавляет ключевое слово в коллекцию по значению глобального имени ключевого слова.
 Глобальное имя никогда не отображается, но может использоваться программой для обеспечения доступа к ключевому слову, когда локальный перевод не известен.
 Ссылки
 KeywordCollection Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!