Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.InputPointContext.GetPickedEntities()
 Послать отзыв
 Метод предназначен для получения массива путей к геометрическим объектам, на которых была выполнена привязка или выбор при вводе точки.
 Синтаксис
C#
Visual Basic
Копировать Код
public FullSubentityPath[] GetPickedEntities();
Копировать Код
Public Function GetPickedEntities() FullSubentityPath[]
 Возвращает
 Возвращает массив объектов типа FullSubentityPath[], каждый из которых указывает на:
ObjectId основного объекта,
путь к подобъекту (при наличии).
 Если ни один объект не был захвачен — возвращается пустой массив. В типичном случае содержит один элемент. Может содержать несколько элементов при сложных привязках (например, пересечение нескольких объектов). Значение никогда не является null, но может быть пустым.
 Описание
 Метод используется в контексте интерактивного ввода точки и возвращает набор объектов, на которые указывал курсор в момент определения положения точки — например, при использовании режимов объектной привязки (OSNAP) или при выборе элемента для построения. Эти объекты называются "picked entities" и представляют собой базовые геометрические сущности, участвующие в операции ввода.
 Метод полезен при реализации пользовательских фильтров (PointFilter) или мониторов (PointMonitor), где необходимо: определить, какие именно объекты были "подхвачены" курсором, выполнить дополнительную обработку на основе выбранных сущностей, визуализировать или проанализировать геометрию привязки.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class InputPointContextExamples { // Метод команды, которая получает массив геометрических объектов, // участвующих в вычислении привязанной точки (оснапа). [Teigha.Runtime.CommandMethod("GetPickedEntitiesExample")] public void GetPickedEntitiesExample() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Метод для отработки события редактора PointMonitor editor.PointMonitor += (sender, e) => { // Сохраняем контекст события в преременную InputPointContext context = e.Context; // Выводим в комнадную строку данные об операции if (context != null) { FullSubentityPath[] picked = context.GetPickedEntities(); if (picked.Length > 0) { foreach (var path in picked) { editor.WriteMessage($"\nПод курсором: объект {path.SubentId}"); } } } }; } }
 Ссылки
 HostMgd.EditorInput.InputPointContext, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!