Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PromptFileOptions.DialogName
 Послать отзыв
 Синтаксис
C#
Visual Basic
public System.String DialogName;
Public Property DialogName() As System.String
 Описание
 Возвращает или устанавливает строку с именем окна диалога.
 Условия
 На чтение и запись
 Ссылки
 PromptFileOptions Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!