Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PromptFileOptions.FilterIndex
 Послать отзыв
 Синтаксис
C#
Visual Basic
public int FilterIndex;
Public Property FilterIndex() As Integer
 Описание
 Устанавливает или взвращает текущий индекс фильтра.
 Условия
 На чтение и запись
 Ссылки
 PromptFileOptions Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!