Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.PointMonitor
 Послать отзыв
 Событие возникает при каждом перемещении мыши в окне редактора nanoCAD, позволяя отслеживать координаты указателя в реальном времени.
 Синтаксис
C#
Visual Basic
Копировать Код
public event PointMonitorEventHandler PointMonitor;
Копировать Код
Public Event PointMonitor As PointMonitorEventHandler
 Описание
 Событие предназначено для отслеживания движения мыши в графической области чертежа. Оно вызывается каждый раз, когда курсор перемещается в пределах окна редактора, и может использоваться для реализации интерактивных функций — таких как динамическое отображение координат, подсказки, контекстные подсветки или пользовательские привязки. В отличие от события PointFilter, не позволяет изменять точку ввода, а только наблюдать за ней.
 Замечания
 Событие использует делегат PointMonitorEventHandler, который передаёт данные о текущем положении мыши и состоянии ввода через объект PointMonitorEventArgs.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события PointMonitor [Teigha.Runtime.CommandMethod("PointMonitorExample")] public void PointMonitorExample() { // Подписка на событие PointMonitor editor.PointMonitor += OnEditorPointMonitor; } // Реализация отработки события PointMonitor private void OnEditorPointMonitor(object sender, PointMonitorEventArgs e) { // Вывод сообщения в командную строку editor.WriteMessage( $"\nТекущая позиция мыши: {e.Context.LastPoint}"); } }
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!