Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PublishSheetEventArgs.DisplayMaxX
 Послать отзыв
 This is DisplayMaxX, a member of class PublishSheetEventArgs.
 Синтаксис
C#
Visual Basic
public double DisplayMaxX;
Public Property DisplayMaxX() As Double
 Ссылки
 PublishSheetEventArgs Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!