Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод PromptOptions.SetMessageAndKeywords
 Послать отзыв
 Метод предназначен для обработки приглащающего сообщения с ключевыми словами и набора глобальных ключевых слов.
 Синтаксис
C#
Visual Basic
public void SetMessageAndKeywords(ref String messageAndKeywords, ref String globalKeywords);
Public Sub SetMessageAndKeywords(ByRef messageAndKeywords As String, ByRef globalKeywords As String)
 Параметры
 Параметры
 Описание
 messageAndKeywords
 Cтрока, содержащая в себе сообщение запроса и ключевые слова к нему, которые будут выводиться на экране при запросе данных.
 globalKeywords
 Строка,содержащая в себе глобальные ключевые слова. Количество глобальных ключевых слов должно совпадать с количеством ключевых слов в приглашающем сообщении messageAndKeywords". Ключевые слова в строке globalKeywords" должны отделяться друг от друга одним пробелом.
 Описание
 Набор отображаемых ключевых слов строки messageAndKeywords" должен быть заключен в скобки: "[" в начале и "]" в конце. Сами ключевые слова должны быть отделены между собой символом "/". Каждое отображаемое в строке messageAndKeywords ключевое слово должно также быть представлено на той же позиции в строке globalKeywords.
 Метод обрабатывает полученные строки messageAndKeywords и globalKeywords как массив символов, выделяя из строки messageAndKeywords вида "message [key0/key1/key3]" приглашающее сообщение message, записывая его в свойство класса Message, и ключевые слова key0/key1/key3, преобразовывая их в тип данных KeywordCollection и записывая в свойство класса Keywords вместе с глобальными ключевыми словами из строки globalKeywords вида "globalKey0 globalKey1 globalKey2".
 Каждое ключевое слово в строке messageAndKeywords должно соответствовать глобальному ключевому слову в строке globalKeywords на той же позиции.
 Если список ключевых слов ошибочный или пустой, либо количество глобальных ключевых слов не совпадает с количеством ключевых слов, то возникает событие System.ArgumentException.
 Ссылки
 HostMgd.EditorInput.PromptOptions, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!