Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.EndPlotEventArgs.PlotCancelStatus
 Послать отзыв
 Свойство PlotCancelStatus возвращает текущий статус печати.
 Синтаксис
C#
Visual Basic
Копировать Код
public HostMgd.PlottingServices.PlotCancelStatus PlotCancelStatus;
Копировать Код
Public ReadOnly Property PlotCancelStatus As HostMgd.PlottingServices.PlotCancelStatus
 Возвращает
 Возвращает текущий статус печати как значение из перечисления HostMgd.PlottingServices.PlotCancelStatus.
 Описание
 Свойство PlotCancelStatus возвращает текущий статус печати.
 Условия
 Только чтение.
 Ссылки
 HostMgd.PlottingServices.EndPlotEventArgs, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!