Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PublishSheetEventArgs.PlotToFilePath
 Послать отзыв
 This is PlotToFilePath, a member of class PublishSheetEventArgs.
 Синтаксис
C#
Visual Basic
public System.String PlotToFilePath;
Public Property PlotToFilePath() As System.String
 Ссылки
 PublishSheetEventArgs Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!