Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Перечисление HostMgd.Windows.TrayItemBubbleWindowCloseReason
 Послать отзыв
 This is record HostMgd::Windows::TrayItemBubbleWindowCloseReason.
 Синтаксис
C#
Visual Basic
public enum TrayItemBubbleWindowCloseReason { FailedToCreate, NoIcons, NoNotifications, ClosedByUser, TimedOut, HyperlinkClicked, DocumentDeactivated }
Public Enum TrayItemBubbleWindowCloseReason FailedToCreate NoIcons NoNotifications ClosedByUser TimedOut HyperlinkClicked DocumentDeactivated End Enum
 Ваши комментарии по поводу этого топика: Послать отзыв!