Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptDoubleOptionsEventArgs.Options
 Послать отзыв
 Свойство возвращает параметры приглашения, используемые при интерактивном вводе вещественного числа.
 Синтаксис
C#
Visual Basic
Копировать Код
public PromptDoubleOptions Options { get; }
Копировать Код
Public ReadOnly Property Options As PromptDoubleOptions
 Возвращает
 Возвращает объект типа PromptDoubleOptions, содержащий:
Message — текст приглашения,
DefaultValue — значение по умолчанию (вводится при нажатии Enter),
AllowNone — разрешение на пропуск ввода,
AllowNegative — разрешение на отрицательные значения,
AllowZero — разрешение на ввод нуля.
 Если объект не был инициализирован, может вернуть null.
 Описание
 Свойство предоставляет доступ к объекту PromptDoubleOptions, содержащему настройки команды ввода вещественного числа — такие как сообщение приглашения, значение по умолчанию, допустимый диапазон и режимы ввода. Оно используется в обработчике события PromptingForDouble для динамической настройки поведения команды GetDouble() перед началом взаимодействия с пользователем.
 Свойство доступно только для чтения, но позволяет изменять свойства возвращённого объекта, что даёт возможность модифицировать параметры ввода в реальном времени.
 Условия
 Только чтение
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события PromptingForDouble [Teigha.Runtime.CommandMethod("PromptingForDoubleExample_Options")] public void PromptingForDoubleExample_Options() { // Подписка на событие PromptingForDouble editor.PromptingForDouble += OnEditorPromptingForDouble; } // Реализация отработки события PromptingForDouble private void OnEditorPromptingForDouble(object sender, PromptDoubleOptionsEventArgs e) { // Получаем настройки запроса PromptDoubleOptions eOptions = e.Options; // Установка начального значения eOptions.DefaultValue = 5.75; // Изменение сообщения приглашения eOptions.Message = "Введите коэффициент масштабирования:"; } }
 Ссылки
 HostMgd.EditorInput.PromptDoubleOptionsEventArgs, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!