Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PaletteSetMoveEventArgs.Y
 Послать отзыв
 This is Y, a member of class PaletteSetMoveEventArgs.
 Синтаксис
C#
Visual Basic
public int Y;
Public Property Y() As Integer
 Ссылки
 PaletteSetMoveEventArgs Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!