Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор PerPropertyBrowsingEntryAttribute.PerPropertyBrowsingEntryAttribute (int, System::String^, System::String^, int, System::String^, int, int, bool, int, int)
 Послать отзыв
 This is PerPropertyBrowsingEntryAttribute, a member of class PerPropertyBrowsingEntryAttribute.
 Синтаксис
C#
Visual Basic
public PerPropertyBrowsingEntryAttribute(int dispatchId, ref System.String programId, ref System.String leftIconResource, int leftIconType, ref System.String ellipsisBmpResource, int ellipsisBmpType, int textColor, bool fullView, int integralHeight, int weight);
Public Sub New(dispatchId As Integer, ByRef programId As System.String, ByRef leftIconResource As System.String, leftIconType As Integer, ByRef ellipsisBmpResource As System.String, ellipsisBmpType As Integer, textColor As Integer, fullView As bool, integralHeight As Integer, weight As Integer)
 Ссылки
 PerPropertyBrowsingEntryAttribute Класс, HostMgd.Windows.ToolPalette
 Ваши комментарии по поводу этого топика: Послать отзыв!