Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство LinetypeDialog.IncludeByBlockByLayer
 Послать отзыв
 This is IncludeByBlockByLayer, a member of class LinetypeDialog.
 Синтаксис
C#
Visual Basic
public bool IncludeByBlockByLayer;
Public Property IncludeByBlockByLayer() As bool
 Ссылки
 LinetypeDialog Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!