Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство MenuItemCollection.Count
 Послать отзыв
 This is Count, a member of class MenuItemCollection.
 Синтаксис
C#
Visual Basic
public int Count;
Public Property Count() As Integer
 Ссылки
 MenuItemCollection Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!