Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptSelectionOptions.SetKeywords(string,string)
 Послать отзыв
 Метод устанавливает отображаемые и глобальные ключевые слова для приглашения выбора вложенного объекта с проверкой соответствия и формата.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetKeywords(string keywords, string globalKeywords);
Копировать Код
Public Sub SetKeywords(keywords As String, globalKeywords As String)
 Параметры
 Параметры
 Описание
 keywords
 Ключевые слова (отображаемые). Тип string
 globalKeywords
 Ключевые слова (глобальные имена). Тип string
 Описание
 Этот метод устанавливает отображаемые ключевые слова и глобальные ключевые слова в globalKeywords. Набор отображаемых ключевых слов должен быть заключен в скобки "[" в начале набора и "]" в конце. Сами ключевые слова набора должны быть отделены между собой символом "/".
 Каждое отображаемое в строке messageAndKeywords ключевое слово должно также быть представленным строке на той же позиции в строке globalKeywords. Ключевые слова в строке globalKeywords дожны отделяться друг от друга одним пробелом.
 Если список ключевых слов в скобках "[" и "]" ошибочный или пустой, то возникает событие System.ArgumentException. Если количество глобальных ключевых слов не совпадает с количеством отображаемых ключевых слов, возникает событие System.ArgumentException.
 Ссылки
 HostMgd.EditorInput.PromptSelectionOptions, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!