Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.PromptedForSelection
 Послать отзыв
 Событие возникает после завершения операции выбора объектов в редакторе nanoCAD, предоставляя доступ к набору выбранных элементов. Событие не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public event PromptSelectionResultEventHandler PromptedForSelection;
Копировать Код
Public Event PromptedForSelection As PromptSelectionResultEventHandler
 Описание
 Событие инициируется системой .NET API nanoCAD после завершения интерактивного выбора одного или нескольких геометрических объектов — например, через методы GetSelection(), SelectAll() или при использовании рамки выделения. Оно предоставляет результат выборки в виде объекта SelectionSet, а также статус операции (OK, Cancel, Error и др.). Это позволяет разработчикам надстроек реагировать на изменения в выборке, обрабатывать выделенные объекты или отменять выполнение команды на основе пользовательского ввода.
 Событие реализуется через делегат PromptSelectionResultEventHandler, который передаёт:
источник события ,
объект PromptSelectionResultEventArgs , содержащий результат выбора: SelectionSet, статус, строковое представление ввода и параметры приглашения.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события PromptedForSelection [Teigha.Runtime.CommandMethod("PromptedForSelectionExample")] public void PromptedForSelectionExample() { // Подписка на событие PromptedForSelection editor.PromptedForSelection += OnEditorPromptedForSelection; } // Реализация отработки события PromptedForSelection private void OnEditorPromptedForSelection(object sender, PromptSelectionResultEventArgs e) { // Вывод сообщения в командную строку if (e.Result.Status == PromptStatus.OK && e.Result.Value != null) { editor.WriteMessage($"\nВыбрано объектов: {e.Result.Value.Count}"); } else { editor.WriteMessage("\nОперация выбора объектов отменена."); } } }
 Порядок работы с событием:
Пользователь выполняет выборку объектов мышью, рамкой или другой командой.
После завершения операции генерируется событие PromptedForSelection.
Разработчик получает доступ к набору выделенных объектов через SelectionSet.
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!