Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptStringResultEventHandler(object,PromptStringResultEventArgs)
 Послать отзыв
 Делегат предназначен для обработки событий, возникающих после завершения интерактивного ввода строки или ключевого слова пользователем в редакторе nanoCAD.
 Синтаксис
C#
Visual Basic
Копировать Код
public delegate void PromptStringResultEventHandler(object sender, PromptStringResultEventArgs e);
Копировать Код
Public Delegate Sub PromptStringResultEventHandler(sender As Object, e As PromptStringResultEventArgs)
 Параметры
 Параметры
 Описание
 sender
 Источник события, обычно представляющий текущий экземпляр редактора (Editor), который инициировал ввод строки. Тип object
 e
 Объект, содержащий данные о результате ввода:
 Описание
 Делегат используется как тип обработчика событий для операций ввода строковых данных — таких как методы GetString() или события PromptedForKeyword. Он передаёт контекст события через параметры sender и e, где e содержит:
Value — строку, введённую пользователем или выбранную из списка ключевых слов.
Status — статус завершения (OK, Cancel, Error и др.).
StringResult — исходная строка, введённая пользователем (если отличается от значения выбора).
 Этот делегат применяется при разработке плагинов, где требуется обрабатывать ввод текста или выбор ключевых слов, например: "Да", "Нет", "Отмена" и другие.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события PromptedForKeyword [Teigha.Runtime.CommandMethod("PromptedForKeywordExample")] public void PromptedForKeywordExample() { // Подписка на событие PromptedForKeyword editor.PromptedForKeyword += OnEditorPromptedForKeyword; } // Реализация отработки события PromptedForKeyword  private void OnEditorPromptedForKeyword(object sender, PromptStringResultEventArgs e) { // Вывод сообщения в командную строку if (e.Result.Status == PromptStatus.OK) { editor.WriteMessage($"\nВведено ключевое слово: {e.Result.StringResult}"); } else { editor.WriteMessage("\nВвод ключевого слова отменён."); } } }
 Ваши комментарии по поводу этого топика: Послать отзыв!