Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PaletteAddContextMenuEventArgs.RightClickTab
 Послать отзыв
 This is RightClickTab, a member of class PaletteAddContextMenuEventArgs.
 Синтаксис
C#
Visual Basic
public int RightClickTab;
Public Property RightClickTab() As Integer
 Ссылки
 PaletteAddContextMenuEventArgs Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!