Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.DocumentWindowCollection.CopyTo
 Послать отзыв
 Метод копирует все элементы этой коллекции в предоставленный массив, начиная с указанного индекса.
 Синтаксис
C#
Visual Basic
Копировать Код
public void CopyTo( ref Array a, int index );
Копировать Код
Public Sub CopyTo( ByRef a As Array, index As Integer )
 Параметры
 Параметры
 Описание
 a
 Входной массив, в который следует копировать элементы коллекции. Тип Array.
 index
 Индекс в массиве, начиная с которого в массив копируются элементы коллекции. Тип int.
 Описание
 Метод копирует все элементы коллекции DocumentWindowCollection в массив a, начиная с индекса index.
 Ссылки
 HostMgd.ApplicationServices.DocumentWindowCollection, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!