Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PrintForm.Status
 Послать отзыв
 This is Status, a member of class PrintForm.
 Синтаксис
C#
Visual Basic
public System.String Status;
Public Property Status() As System.String
 Ссылки
 PrintForm Класс, Пространство имен HostMgd
 Ваши комментарии по поводу этого топика: Послать отзыв!