Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.Application.Invoke(Teigha.DatabaseServices.ResultBuffer)
 Послать отзыв
 МЕТОД НЕ РЕАЛИЗОВАН. ВОЗВРАЩАЕТ NULL Метод предназначен для вызова функций, определенный в других приложениях.
 Синтаксис
C#
Visual Basic
Копировать Код
public static ResultBuffer Invoke(ResultBuffer args);
Копировать Код
Public Shared Function Invoke(args As ResultBuffer) As ResultBuffer
 Параметры
 Параметры
 Описание
 args
 Указатель на функцию, которую нужно вызвать. Тип ResultBuffer
 Возвращает
 Вовзращает указатель на результат работы функции. Тип ResultBuffer
 Описание
 Метод вызывает функцию, определенную в другом приложении.
 Ссылки
 HostMgd.ApplicationServices.Application, HostMgd.ApplicationServices Пространство имен
 Исключения
 MGD NOT_IMPLEMENTED
 Ваши комментарии по поводу этого топика: Послать отзыв!