Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Перечисление HostMgd.Runtime.DistanceUnitFormat
 Послать отзыв
 Синтаксис
C#
Visual Basic
public enum DistanceUnitFormat { Current = -1, Scientific = 1, Decimal = 2, Engineering = 3, Architectural = 4, Fractional = 5 }
Public Enum DistanceUnitFormat Current = -1 Scientific = 1 Decimal = 2 Engineering = 3 Architectural = 4 Fractional = 5 End Enum
 Члены
 Члены
 Описание
 Current
 Текущий формат единиц измерения
 Scientific
 Научный
 Decimal
 Десятичный
 Engineering
 Инженерный
 Architectural
 Архитектурный
 Fractional
 Дробный
 Описание
 Перечисление возможных форматов единиц измерения.
 Члены Описание
 ------------ -------------------------------------------------
 Current = -1 Текущий формат единиц измерения
 Scientific = 1 Научный
 Decimal = 2 Десятичный
 Engineering = 3 Инженерный
 Architectural = 4 Архитектурный
 Fractional = 5 Дробный
 Ваши комментарии по поводу этого топика: Послать отзыв!