Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.BeginPageEventArgs.LastPage
 Послать отзыв
 Свойство LastPage позволяет проверить состояние флага последней страницы.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool LastPage;
Копировать Код
Public ReadOnly Property LastPage As Boolean
 Возвращает
 Возвращает true, если аргументы события связаны с печатью последней страницы документа. В противном случае возвращает false.
 Описание
 Свойство LastPage позволяет проверить состояние флага последней страницы.
 Условия
 Только чтение.
 Ссылки
 HostMgd.PlottingServices.BeginPageEventArgs, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!