Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Структура HostMgd.EditorInput.PickPointDescriptor
 Послать отзыв
 Синтаксис
C#
Visual Basic
public struct PickPointDescriptor { }
Public Structure PickPointDescriptor End Structure
 Описание
 Структура описывает форму точки выбора.
 Методы
 Конструкторы
 Имя
 Описание
 PickPointDescriptor
 Топики
 Имя
 Описание
 PickPointDescriptor Методы
 Ниже перечислены методы класса PickPointDescriptor.
 PickPointDescriptor Операторы
 Ниже перечислены операторы класса PickPointDescriptor.
 PickPointDescriptor Свойства
 Ниже перечислены свойства класса PickPointDescriptor.
 Ссылки
 PickPointDescriptor Методы, PickPointDescriptor Операторы, PickPointDescriptor Свойства, Методы, Топики, PickPointDescriptor Методы, PickPointDescriptor Операторы, PickPointDescriptor Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!