Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.Windows.ToolPalette.CustomToolBase.CreateShapeCatalog
 Послать отзыв
 Метод создает для единственной формы каталог, содержащий пакеты форм. Не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public HostMgd.Windows.ToolPalette.Package CreateShapeCatalog( ref System.String shapeName );
Копировать Код
Public Function CreateShapeCatalog( ByRef shapeName As System.String ) As HostMgd.Windows.ToolPalette.Package
 Параметры
 Параметры
 Описание
 shapeName
 Входное имя формы для каталога. Тип System.String.
 Возвращает
 Возвращает созданный каталог. Тип HostMgd.Windows.ToolPalette.Package.
 Описание
 Метод создает для единственной формы каталог, содержащий пакеты форм.
 В текущей версии не реализован.
 Ссылки
 HostMgd.Windows.ToolPalette.CustomToolBase, HostMgd.Windows.ToolPalette
 Ваши комментарии по поводу этого топика: Послать отзыв!