Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.SelectionAddedEventArgs.AddSubEntity(SelectedSubObject)
 Послать отзыв
 Метод добавляет геометрический подобъект (например, сегмент, ребро или грань) к составному выбранному объекту.
 Синтаксис
C#
Visual Basic
Копировать Код
public void AddSubEntity(SelectedSubObject value);
Копировать Код
Public Sub AddSubEntity(value As SelectedSubObject)
 Параметры
 Параметры
 Описание
 value
 Подобъект, который необходимо добавить. Должен содержать:
 Описание
 Метод используется для расширения выборки на уровне подобъектов — отдельных элементов сложных объектов, таких как сегменты полилинии, рёбра 3D-тела или грани многогранника. Он добавляет экземпляр SelectedSubObject, содержащий информацию о конкретной части объекта, в состав текущего выбора.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события SelectionAdded [Teigha.Runtime.CommandMethod("SelectionAddedExample_AddSubEntity")] public void SelectionAddedExample_AddSubEntity() { // Подписка на событие Rollover editor.SelectionAdded += OnSelectionAdded; } // Реализация отработки события SelectionAdded private void OnSelectionAdded(object sender, SelectionAddedEventArgs e) { // Подобъект, полученный через запрос SelectedSubObject someSelectedSubObject = default; // Добавление нового объекта к выборке e.AddSubEntity(someSelectedSubObject); // Вывод сообщения в командную строку editor.WriteMessage($"\nК выборке добавлен подобъект: {someSelectedSubObject.FullSubentityPath}"); } }
 Ссылки
 HostMgd.EditorInput.SelectionAddedEventArgs, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!