Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.BeginDocumentEventHandler(Object, BeginDocumentEventArgs)
 Послать отзыв
 Делегат BeginDocumentEventHandler предназначен для обработки события PlotReactorManager.BeginDocument, возникающего перед началом вывода документа на плоттер.
 Синтаксис
C#
Visual Basic
Копировать Код
public delegate void BeginDocumentEventHandler( Object sender, BeginDocumentEventArgs e );
Копировать Код
Public Delegate Sub BeginDocumentEventHandler( sender As Object, e As BeginDocumentEventArgs )
 Параметры
 Параметры
 Описание
 sender
 Объект, инициировавший событие. Тип Object.
 e
 Аргументы события. Тип BeginDocumentEventArgs.
 Описание
 Делегат BeginDocumentEventHandler предназначен для обработки события PlotReactorManager.BeginDocument, возникающего перед началом вывода документа на плоттер.
 Контекст события передается через параметры sender и e, где sender определяет объект-инициатор события, а e передает объект PlotInfo, имя документа, количество копий, флаг печати в файл и имя файла.
 Ваши комментарии по поводу этого топика: Послать отзыв!