Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.DocumentCollection.DocumentActivated
 Послать отзыв
 Событие, возникающее при активации dwg-документа.
 Синтаксис
C#
Visual Basic
public event DocumentCollectionEventHandler DocumentActivated;
Public Event DocumentActivated As DocumentCollectionEventHandler
 Возвращает
 Возвращает тип данных HostMgd.ApplicationServices.DocumentCollectionEventHandler
 Описание
 Событие, возникающее, когда документ активирован и происходит успешное переключение на его контекст. Соответствует функции NRX API HostApDocManagerReactor.documentActivated().
 Ссылки
 HostMgd.ApplicationServices.DocumentCollection, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!