Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.Windows.ToolPalette.CustomToolBase.SetToolProperties
 Послать отзыв
 Метод используется для инициализации или получения свойств инструмента. Не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetToolProperties( ref System.Object toolProperties );
Копировать Код
Public Overridable Sub SetToolProperties( ByRef toolProperties As System.Object )
 Параметры
 Параметры
 Описание
 toolProperties
 Указатель на COM-объект, реализующий свойства инструмента. Тип System.Object.
 Описание
 Метод используется для инициализации или получения свойств инструмента. В качестве аргумента используется объект, реализующий интерфейс соответствующего COM-объекта.
 В текущей версии не реализован.
 Ссылки
 HostMgd.Windows.ToolPalette.CustomToolBase, HostMgd.Windows.ToolPalette
 Ваши комментарии по поводу этого топика: Послать отзыв!