Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptSelectionResult.ToString()
 Послать отзыв
 Метод возвращает строковое представление результата выборки объектов, включая статус и количество выбранных элементов.
 Синтаксис
C#
Visual Basic
Копировать Код
public override string ToString();
Копировать Код
Public Overrides Function ToString() As String
 Возвращает
 Возвращает значение типа string, представляющее результат выборки:
Для успешной операции (Status == PromptStatus.OK) : Пример: "12 object(s) selected" или "Selection set contains 3 objects".
Для отмены пользователем (Status == PromptStatus.Cancel) : Пример: "Operation cancelled".
Для ошибки (Status == PromptStatus.Error) : Пример: "Input error occurred".
 Если результат пустой или не определён может вернуть null.
 Описание
 Метод предоставляет читаемую строку, описывающую результат операции выбора объектов в чертеже nanoCAD. Метод формирует текст на основе статуса операции и содержимого набора выделенных объектов (SelectionSet). Это удобно для отладки, логирования или вывода информации в командную строку.
 Если операция завершена успешно, метод возвращает количество объектов в выборке. В случае отмены или ошибки — соответствующее текстовое сообщение.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("PromptSelectionResultExample_ToString")] public void PromptSelectionResultExample_ToString() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создаём запрос пользователю PromptSelectionResult result = editor.GetSelection(); // Если все данные введены, выводим результат в командную строку if (result.Status == PromptStatus.OK) { string resultStr = result.ToString(); editor.WriteMessage($"\nРезультат выборки: {resultStr}"); } else { editor.WriteMessage( "\nНе удалось получить выделение."); } } }
 Ссылки
 HostMgd.EditorInput.PromptSelectionResult, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!