Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.Marshaler.SelectionSetToAdsName
 Послать отзыв
 Метод предназначен для записи данных из управляемого объекта SelectionSet в неуправляемый объект по указанному адресу. В текущей версии не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public static void SelectionSetToAdsName( ref HostMgd.EditorInput.SelectionSet selectionSet, System.IntPtr pointerToAdsName );
Копировать Код
Public Shared Sub SelectionSetToAdsName( ByRef selectionSet As HostMgd.EditorInput.SelectionSet, pointerToAdsName As System.IntPtr )
 Параметры
 Параметры
 Описание
 selectionSet
 Ссылка на управляемый набор выделенных объектов. Тип HostMgd.EditorInput.SelectionSet.
 pointerToAdsName
 Неуправляемый указатель на область памяти, куда следует записать данные в формате ads_name. Тип System.IntPtr.
 Описание
 Метод предназначен для записи данных из управляемого объекта SelectionSet в неуправляемую структуру ads_name по указанному адресу. По сути, это преобразование является обратным по отношению к методу AdsNameToSelectionSet(). В текущей версии не реализован.
 Ссылки
 HostMgd.ApplicationServices.Marshaler, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!