Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Класс HostMgd.Windows.MenuItemCollection
 Послать отзыв
 Коллекция, содержащая объекты MenuItem.
 Иерархия классов
HostMgd::Windows::MenuItemCollection
 Синтаксис
C#
Visual Basic
public class MenuItemCollection : IList, Generic.IEnumerable<IMenuItem^>;
Public Class MenuItemCollection Inherits IList Inherits Generic.IEnumerable<IMenuItem^>
 Описание
 Методы
 Конструкторы
 Имя
 Описание
 MenuItemCollection
 This is MenuItemCollection, a member of class MenuItemCollection.
 Топики
 Имя
 Описание
 MenuItemCollection Методы
 Ниже перечислены методы класса MenuItemCollection.
 MenuItemCollection Свойства
 Ниже перечислены свойства класса MenuItemCollection.
 Ссылки
 MenuItemCollection Методы, MenuItemCollection Свойства, Методы, Топики, MenuItemCollection Методы, MenuItemCollection Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!