Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.GetSelection(PromptSelectionOptions)
 Послать отзыв
 Метод позволяет пользователю выбрать множество графических объектов в интерактивном режиме, используя заданные параметры приглашения.
 Синтаксис
C#
Visual Basic
Копировать Код
public PromptSelectionResult GetSelection(PromptSelectionOptions options);
Копировать Код
Public Function GetSelection(options As PromptSelectionOptions) As PromptSelectionResult
 Параметры
 Параметры
 Описание
 options
 Объект, содержащий параметры выбора:
 Возвращает
 Возвращает объект типа PromptSelectionResult, который содержит:
Status — статус операции (OK, Cancel, Error и др.).
Value — объект типа SelectionSet, содержащий список идентификаторов (ObjectId`) выбранных объектов (если операция успешна).
StringResult — строковое представление введённой команды или ключевого слова.
 Если пользователь успешно выбрал объекты, статус будет OK, и в Value будет содержаться их список.
 Описание
 Метод используется для получения набора объектов, выбранных пользователем в графической области nanoCAD. Пользователь может указывать объекты мышью, выделять рамкой и т. д. Метод предоставляет возможность настроить процесс выбора через объект PromptSelectionOptions, например, задать сообщение-приглашение, использовать перекрестье или ограничить количество выбора. Фильтрация объектов не применяется — пользователь может выбрать любые допустимые графические элементы.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("GetSelectionExample_PromptSelectionOptions")] public void GetSelectionExample_PromptSelectionOptions() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создаём запрос пользователю PromptSelectionOptions options = new PromptSelectionOptions(); options.MessageForAdding = "Выберите объекты для обработки"; PromptSelectionResult result = editor.GetSelection(options); // Если все данные введены, выводим результат в командную строку if (result.Status == PromptStatus.OK) { SelectionSet selSet = result.Value; editor.WriteMessage( $"\nВыбрано объектов: {selSet.Count}"); } else { editor.WriteMessage( "\nОперация выбора отменена или объекты не выбраны."); } } }
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!