Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Window.Icon
 Послать отзыв
 Синтаксис
C#
Visual Basic
public System.Drawing.Icon Icon;
Public Property Icon() As System.Drawing.Icon
 Описание
 Предоставляет доступ к пиктограмме, содержащейся в окне.
 Условия
 На чтение и запись
 Ссылки
 Window Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!