Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.GetFileNameForOpen(String)
 Послать отзыв
 Метод эмулирует ввод имени файла для открытия, выводя заданное приглашение в командной строке, если диалоговые окна отключены или выполняется скрипт.
 Синтаксис
C#
Visual Basic
Копировать Код
public PromptFileNameResult GetFileNameForOpen(String message);
Копировать Код
Public Function GetFileNameForOpen(message As String) As PromptFileNameResult
 Параметры
 Параметры
 Описание
 message
 Сообщение, отображаемое в командной строке для приглашения пользователя к вводу имени файла (например, "Введите путь к файлу DWG:"). Тип String
 Возвращает
 Возвращает объект типа PromptFileNameResult, который содержит:
Status — статус операции (OK, Cancel, Error и др.).
StringResult — строковое значение с путём к выбранному файлу (если ввод успешен).
 Если пользователь отменил операцию или не указал допустимый файл, статус будет отличаться от OK.
 Описание
 Метод используется для получения пути к файлу, который пользователь намерен открыть. Если значение системной переменной FILEDIA равно 0 (диалоговые окна отключены) или команда вызвана из LISP-скрипта, метод выводит указанное сообщение в командной строке и ожидает ввода имени файла с клавиатуры. В противном случае может быть показан стандартный диалог открытия файла. Метод позволяет интегрировать выбор файла в интерактивные и автоматизированные сценарии работы с nanoCAD.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("GetFileNameForOpenExample_String")] public void GetFileNameForOpenExample_String() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создаём запрос пользователю PromptFileNameResult result = editor.GetFileNameForOpen("Выберите файл для открытия:"); // Если все данные введены, выводим результат в командную строку if (result.Status == PromptStatus.OK) { editor.WriteMessage( $"\nВыбран файл: {result.StringResult}"); } else { editor.WriteMessage( "\nФайл не выбран."); } } }
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!