Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Класс HostMgd.Windows.ColorDialog
 Послать отзыв
 Этот класс представляет диалоговое окно, позволяющее пользователю выбрать цвет.
 Иерархия классов
HostMgd::Windows::ColorDialog
 Синтаксис
C#
Visual Basic
public class ColorDialog;
Public Class ColorDialog
 Методы
 Конструкторы
 Имя
 Описание
 ColorDialog
 This is ColorDialog, a member of class ColorDialog.
 Топики
 Имя
 Описание
 ColorDialog Перечисления
 Ниже перечислены перечисления класса ColorDialog.
 ColorDialog Методы
 Ниже перечислены методы класса ColorDialog.
 ColorDialog Свойства
 Ниже перечислены свойства класса ColorDialog.
 Ссылки
 ColorDialog Перечисления, ColorDialog Методы, ColorDialog Свойства, Методы, Топики, ColorDialog Перечисления, ColorDialog Методы, ColorDialog Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!