Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.IsQuiescentForTransparentCommand
 Послать отзыв
 Свойство предназначено для проверки, готов ли редактор к выполнению прозрачной команды.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsQuiescentForTransparentCommand { get; }
Копировать Код
Public ReadOnly Property IsQuiescentForTransparentCommand() As bool
 Возвращает
 Возвращает значение типа bool:
true — если редактор находится в состоянии, подходящем для выполнения прозрачной команды.
false — если редактор занят выполнением другой команды или находится в недопустимом состоянии.
 Описание
 Свойство используется для определения, находится ли редактор nanoCAD в состоянии, допускающем выполнение прозрачных команд — то есть, когда редактор не занят выполнением основной команды и может принять команду, вызванную во время другой операции (например, настройки или запросы). Это состояние важно при реализации команд, которые могут быть вызваны из контекста других команд без их прерывания.
 Условия
 Только чтение
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("IsQuiescentForTransparentCommandExample")] public void IsQuiescentForTransparentCommandExample() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Вывод сообщения в командной строке в зависимости от значения свойства IsQuiescentForTransparentCommand if (editor.IsQuiescentForTransparentCommand) { editor.WriteMessage("\nМожно выполнять прозрачные команды."); } else { editor.WriteMessage("\nВыполнение прозрачной команды невозможно."); } } }
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!