Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод PlotLogger.EndJob
 Послать отзыв
 Функция запуска процесса печати.
 Синтаксис
C#
Visual Basic
public void EndJob();
Public Sub EndJob()
 Описание
 Ссылки
 PlotLogger Класс, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!