Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.Application.RemoveObjectContextMenuExtension(RXClass,ContextMenuExtension)
 Послать отзыв
 Метод предназначен для удаления пунктов контекстного меню из контекстного меню класса.
 Синтаксис
C#
Visual Basic
Копировать Код
public static void RemoveObjectContextMenuExtension(RXClass runtimeClass, ContextMenuExtension menuExtension);
Копировать Код
Public Shared Sub RemoveObjectContextMenuExtension(runtimeClass As RXClass, menuExtension As ContextMenuExtension)
 Параметры
 Параметры
 Описание
 runtimeClass
 Класс объекта, имеющего контекстное меню, из которого будут удалены пункты меню
 menuExtension
 Пункты контекстного меню, которые будут удалены из контекстного меню класса
 Описание
 Метод удаляет пункты контекстного меню из контекстного меню класса.
 Ссылки
 HostMgd.ApplicationServices.Application, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!