Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.Windows.ToolPalette.CustomToolBase.FlayoutPackageID
 Послать отзыв
 Свойство FlayoutPackageID предоставляет доступ к пакету инструментов выпадающего инструмента. Не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public Guid FlayoutPackageID;
Копировать Код
Public Property FlayoutPackageID As Guid
 Возвращает
 Возвращает идентификатор пакета инструментов. Тип Guid.
 Описание
 Свойство FlayoutPackageID предоставляет доступ к пакету инструментов выпадающего инструмента.
 В текущей версии не реализовано.
 Условия
 Чтение и запись.
 Ссылки
 HostMgd.Windows.ToolPalette.CustomToolBase, HostMgd.Windows.ToolPalette
 Ваши комментарии по поводу этого топика: Послать отзыв!