Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Класс HostMgd.Windows.PaletteSetHelpEventArgs
 Послать отзыв
 This is class HostMgd::Windows::PaletteSetHelpEventArgs.
 Иерархия классов
HostMgd::Windows::PaletteSetHelpEventArgs
 Синтаксис
C#
Visual Basic
public class PaletteSetHelpEventArgs : System.EventArgs;
Public Class PaletteSetHelpEventArgs Inherits System.EventArgs
 Методы
 Конструкторы
 Имя
 Описание
 PaletteSetHelpEventArgs
 This is PaletteSetHelpEventArgs, a member of class PaletteSetHelpEventArgs.
 Ссылки
 Методы
 Ваши комментарии по поводу этого топика: Послать отзыв!