Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PerPropertyBrowsingEntryAttribute.EllipsisBmpType
 Послать отзыв
 This is EllipsisBmpType, a member of class PerPropertyBrowsingEntryAttribute.
 Синтаксис
C#
Visual Basic
public int EllipsisBmpType;
Public Property EllipsisBmpType() As Integer
 Ссылки
 PerPropertyBrowsingEntryAttribute Класс, HostMgd.Windows.ToolPalette
 Ваши комментарии по поводу этого топика: Послать отзыв!