Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод CrossingOrWindowSelectedSubObject.ToString (IFormatProvider^)
 Послать отзыв
 Синтаксис
C#
Visual Basic
public String ToString(ref IFormatProvider provider);
Public Function ToString(ByRef provider As IFormatProvider) As String
 Параметры
 Параметры
 Описание
 provider
 Формат, зависящий от локализации
 Описание
 Возвращает строковое представление данного объекта в формате (зависящем от локализации), определенном параметром метода.
 Метод не реализован.
 Ссылки
 CrossingOrWindowSelectedSubObject Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!