Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Класс HostMgd.ApplicationServices.DocumentLock
 Послать отзыв
 Иерархия классов
HostMgd::ApplicationServices::DocumentLock
 Синтаксис
C#
Visual Basic
public class DocumentLock : System.IDisposable;
Public Class DocumentLock Inherits System.IDisposable
 Описание
 Класс представляющий блокировки документа. Объекты класса создаются и возвращаются приложению, когда оно вызывает метод Document.LockDocument.
 Ваши комментарии по поводу этого топика: Послать отзыв!