Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.InplaceTextEditor.SpellSettingDialog
 Послать отзыв
 Метод вызывает диалоговое окно настроек проверки орфографии. В текущей версии не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SpellSettingDialog();
Копировать Код
Public Sub SpellSettingDialog()
 Описание
 Метод вызывает диалоговое окно настроек проверки орфографии в данном текстовом редакторе. В текущей версии метод не реализован.
 Ссылки
 HostMgd.ApplicationServices.InplaceTextEditor, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!