Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PickPointSelectedSubObject.PickPoint
 Послать отзыв
 Синтаксис
C#
Visual Basic
public HostMgd::EditorInput::PickPointDescriptor PickPoint;
Public Property PickPoint() As HostMgd.EditorInput.PickPointDescriptor
 Описание
 Возвращает точку, которая была использована при выборе подобъекта.
 Условия
 Только на чтение
 Ссылки
 PickPointSelectedSubObject Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!