Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод PublishEntityEventArgs.Cancel
 Послать отзыв
 This is Cancel, a member of class PublishEntityEventArgs.
 Синтаксис
C#
Visual Basic
public void Cancel();
Public Sub Cancel()
 Ссылки
 PublishEntityEventArgs Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!