Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод PlotStyleDialog.ShowModal
 Послать отзыв
 This is ShowModal, a member of class PlotStyleDialog.
 Синтаксис
C#
Visual Basic
public Nullable<System.Boolean> ShowModal();
Public Function ShowModal() As Nullable<System.Boolean>
 Ссылки
 PlotStyleDialog Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!