Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод SelectionSet.GetEnumerator
 Послать отзыв
 Синтаксис
C#
Visual Basic
public IEnumerator GetEnumerator();
Public Function GetEnumerator() As IEnumerator
 Описание
 Метод возвращает итератор коллекции класса.
 Ссылки
 SelectionSet Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!