Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.GetPoint(String)
 Послать отзыв
 Метод позволяет пользователю указать точку в чертеже с помощью мыши или ввести её координаты вручную, возвращая результат с координатами точки.
 Синтаксис
C#
Visual Basic
Копировать Код
public PromptPointResult GetPoint(String message);
Копировать Код
Public Function GetPoint(message As String) As PromptPointResult
 Параметры
 Параметры
 Описание
 message
 Сообщение, отображаемое в командной строке для приглашения пользователя к выбору точки (например, "Укажите центр окружности:"). Тип String.
 Возвращает
 Возвращает объект типа PromptPointResult, который содержит:
Status — статус операции (OK, Cancel, Error и др.).
Value — значение точки (Point3d`) в мировой системе координат (WCS), если ввод был успешным.
StringResult — строковое представление введённых данных.
 Если пользователь успешно указал точку, статус будет OK. Если операция была прервана или введены некорректные данные, статус будет другим.
 Описание
 Метод используется для интерактивного получения координат точки от пользователя. Пользователь может выбрать точку графически — щелчком мыши на экране, либо ввести координаты в командной строке. Метод выводит заданное сообщение-приглашение и ожидает ввода до тех пор, пока не будет получена допустимая точка или операция не будет прервана. Поддерживает стандартные привязки и фильтры, что делает его удобным для точного позиционирования.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("GetPointExample_String")] public void GetPointExample_String() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создаём запрос пользователю PromptPointResult result = editor.GetPoint("\nУкажите точку:"); // Если все данные введены, выводим результат в командную строку if (result.Status == PromptStatus.OK) { Point3d pt = result.Value; editor.WriteMessage( $"\nВыбранная точка: {pt}"); } else { editor.WriteMessage( "\nВвод точки отменен."); } } }
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!