Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.Windows.ToolPalette.CustomToolBase.CreateTool
 Послать отзыв
 Метод создаёт новый объект инструмента с заданным пакетом инструментов, именем инструмента и связанным изображением. Не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public HostMgd.Windows.ToolPalette.Tool CreateTool( ref HostMgd.Windows.ToolPalette.Package palette, ref System.String toolNameOverride, ref HostMgd.Windows.ToolPalette.ImageInfo toolImageOverride );
Копировать Код
Public Function CreateTool( ByRef palette As HostMgd.Windows.ToolPalette.Package, ByRef toolNameOverride As System.String, ByRef toolImageOverride As HostMgd.Windows.ToolPalette.ImageInfo ) As HostMgd.Windows.ToolPalette.Tool
 Параметры
 Параметры
 Описание
 palette
 Входной пакет инструментов. Тип HostMgd.Windows.ToolPalette.Package.
 toolNameOverride
 Входное имя инструмента. Тип System.String.
 toolImageOverride
 Входной объект связанного с инструментом изображения. Тип HostMgd.Windows.ToolPalette.ImageInfo.
 Возвращает
 Возвращает созданный объект инструмента. Тип HostMgd.Windows.ToolPalette.Tool.
 Описание
 Метод создаёт новый объект инструмента с заданным пакетом инструментов palette, именем инструмента toolNameOverride и связанным изображением toolImageOverride.
 В текущей версии не реализован.
 Ссылки
 HostMgd.Windows.ToolPalette.CustomToolBase, HostMgd.Windows.ToolPalette
 Ваши комментарии по поводу этого топика: Послать отзыв!