Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Перечисление HostMgd.Windows.SaveFileDialog.SaveFileDialogFlags
 Послать отзыв
 This is record HostMgd::Windows::SaveFileDialog::SaveFileDialogFlags.
 Синтаксис
C#
Visual Basic
[Flags] public enum SaveFileDialogFlags { NoShellExtensions = 1024, NoFtpSites = 512, ForceDefaultFolder = 256, NoUrls = 128, DoNotTransferRemoteFiles = 64, DoNotWarnIfFileExist = 32, DefaultIsFolder = 16, AllowAnyExtension = 4 }
<Flags> Public Enum SaveFileDialogFlags NoShellExtensions = 1024 NoFtpSites = 512 ForceDefaultFolder = 256 NoUrls = 128 DoNotTransferRemoteFiles = 64 DoNotWarnIfFileExist = 32 DefaultIsFolder = 16 AllowAnyExtension = 4 End Enum
 Ваши комментарии по поводу этого топика: Послать отзыв!