Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptDoubleOptionsEventHandler(object,PromptDoubleOptionsEventArgs)
 Послать отзыв
 Делегат предназначен для обработки события, возникающего перед началом операции ввода вещественного числа, и позволяет настроить параметры ввода.
 Синтаксис
C#
Visual Basic
Копировать Код
public delegate void PromptDoubleOptionsEventHandler(object sender, PromptDoubleOptionsEventArgs e);
Копировать Код
Public Delegate Sub PromptDoubleOptionsEventHandler(sender As Object, e As PromptDoubleOptionsEventArgs)
 Параметры
 Параметры
 Описание
 sender
 Источник события. Тип object
 e
 Объект, содержащий параметры ввода вещественного числа. Тип PromptDoubleOptionsEventArgs
 Описание
 Делегат `PromptDoubleOptionsEventHandler` используется как тип обработчика для события `PromptingForDouble`, которое генерируется перед началом интерактивного ввода вещественного числа в nanoCAD. Он позволяет разработчику изменять параметры команды ввода — такие как сообщение, начальное значение, допустимый диапазон и режимы ввода — до того, как пользователь начнёт взаимодействовать с командой.
 Этот делегат применяется в надстройках и плагинах для гибкой настройки поведения команд, требующих ввода чисел с плавающей точкой, таких как масштабирование, параметризация, вычисления и другие операции.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события PromptingForDouble [Teigha.Runtime.CommandMethod("PromptingForDoubleExample")] public void PromptingForDoubleExample() { // Подписка на событие PromptingForDouble editor.PromptingForDouble += OnEditorPromptingForDouble; } // Реализация отработки события PromptingForDouble private void OnEditorPromptingForDouble(object sender, PromptDoubleOptionsEventArgs e) { // Установка начального значения e.Options.DefaultValue = 5.75; // Изменение сообщения приглашения e.Options.Message = "Введите коэффициент масштабирования:"; } }
 Ваши комментарии по поводу этого топика: Послать отзыв!