Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство ToolAttribute.ToolName
 Послать отзыв
 This is ToolName, a member of class ToolAttribute.
 Синтаксис
C#
Visual Basic
public System.String ToolName;
Public Property ToolName() As System.String
 Ссылки
 ToolAttribute Класс, HostMgd.Windows.ToolPalette
 Ваши комментарии по поводу этого топика: Послать отзыв!