Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.DsdData.CategoryName
 Послать отзыв
 Свойство CategoryName предоставляет доступ к наименованию категории задания на печать. Не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public System.String CategoryName;
Копировать Код
Public Property CategoryName As System.String
 Возвращает
 Возвращает наименование категории задания на публикацию. Тип System.String.
 Описание
 Свойство CategoryName предоставляет доступ к наименованию категории задания на печать. nanoCAD позволяет группировать задания на печать по разным категориям. Это поле сериализуется в DSD-файле.
 В текущей версии не реализовано.
 Условия
 Чтение и запись.
 Ссылки
 HostMgd.PlottingServices.DsdData, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!