Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptDoubleOptions
 Послать отзыв
 Класс предоставляет параметры для настройки интерактивного ввода вещественного числа в nanoCAD, такие как сообщение, диапазон значений и значение по умолчанию.
 Иерархия классов
HostMgd::EditorInput::PromptOptions HostMgd::EditorInput::PromptEditorOptions HostMgd::EditorInput::PromptNumericalOptions HostMgd::EditorInput::PromptDoubleOptions
 Синтаксис
C#
Visual Basic
Копировать Код
public sealed class PromptDoubleOptions : PromptNumericalOptions
Копировать Код
Public NotInheritable Class PromptDoubleOptions Inherits PromptNumericalOptions
 Описание
 Класс является запечатанным (sealed) и наследуется от PromptNumericalOptions. Он используется при вызове методов ввода чисел с плавающей точкой — например, GetDouble() — для настройки поведения команды ввода. С его помощью можно задать:
текст приглашения (Message),
значение по умолчанию (DefaultValue),
режимы ввода (AllowNone, AllowNegative, AllowZero и др.).
 Этот класс позволяет гибко управлять пользовательским интерфейсом при вводе чисел, обеспечивая контроль над допустимыми значениями и улучшая взаимодействие с пользователем.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("GetDoubleExample")] public void GetDoubleExample() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создаём запрос пользователю PromptDoubleOptions options = new PromptDoubleOptions("\nВведите значение масштаба:"); options.DefaultValue = 1.0; options.UseDefaultValue = true; PromptDoubleResult result = editor.GetDouble(options); // Если все данные введены, выводим результат в командную строку if (result.Status == PromptStatus.OK) { double scale = result.Value; editor.WriteMessage( $"\nЗначение масштаба: {scale}"); } } }
 Методы
 Конструкторы
 HostMgd.EditorInput.PromptDoubleOptions
 Имя
 Описание
 PromptDoubleOptions
 Это обзор перегрузок PromptDoubleOptions.
 Топики
 Имя
 Описание
 PromptOptions Методы
 Ниже перечислены методы класса PromptOptions.
 PromptOptions Свойства
 Ниже перечислены свойства класса PromptOptions.
 Класс HostMgd.EditorInput.PromptNumericalOptions
 Имя
 Описание
 PromptNumericalOptions Свойства
 Ниже перечислены свойства класса PromptNumericalOptions.
 HostMgd.EditorInput.PromptDoubleOptions
 Имя
 Описание
 PromptDoubleOptions Методы
 Ниже перечислены методы класса PromptDoubleOptions.
 PromptDoubleOptions Свойства
 Ниже перечислены свойства класса PromptDoubleOptions.
 Ссылки
 PromptDoubleOptions Конструктор, PromptDoubleOptions Методы, PromptDoubleOptions Свойства, Методы, Топики, PromptOptions Методы, PromptOptions Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!