Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PaletteSetSizeEventArgs.DeviceIndependentWidth
 Послать отзыв
 This is DeviceIndependentWidth, a member of class PaletteSetSizeEventArgs.
 Синтаксис
C#
Visual Basic
public double DeviceIndependentWidth;
Public Property DeviceIndependentWidth() As Double
 Ссылки
 PaletteSetSizeEventArgs Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!