Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptStatus
 Послать отзыв
 Данное перечисление определяет поддерживаемые статусы выполнения запросов на интерактивный ввод данных.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum PromptStatus { None = 5000, Modeless = 5027, Other = 5028, OK = 5100, Keyword = -5005, Cancel = -5002, Error = -5001 }
Копировать Код
Public Enum PromptStatus None = 5000 Modeless = 5027 Other = 5028 OK = 5100 Keyword = -5005 Cancel = -5002 Error = -5001 End Enum
 Члены
 Члены
 Описание
 Cancel
 Значение: -5002. Пользователь отменил запрос, нажав CTRL-C.
 Error
 Значение: -5001. Неспецифическая ошибка.
 Keyword
 Значение: -5005. Пользователь вместо свободного ввода выбрал одно из ключевых слов, которые соответствуют предопределенным стандартным ответам.
 Modeless
 Значение: 5027 (0x13a3). Немодальный статус запроса.
 None
 Значение: 5000 (0x1388). Результат отсутствует.
 OK
 Значение: 5100 (0x13ec). Пользователь ввёл валидный (допустимый) ответ на запрос.
 Other
 Значение: 5028 (0x13a4). Статус запроса, отличный от списка по умолчанию.
 Описание
 Данное перечисление определяет поддерживаемые статусы выполнения запросов на интерактивный ввод данных.
 Ваши комментарии по поводу этого топика: Послать отзыв!