Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод PublishEntityEventArgs.GetGraphicIDs
 Послать отзыв
 This is GetGraphicIDs, a member of class PublishEntityEventArgs.
 Синтаксис
C#
Visual Basic
public array<int> GetGraphicIDs();
Public Function GetGraphicIDs() As array<int>
 Ссылки
 PublishEntityEventArgs Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!