Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PromptFileNameResult.ReadOnly
 Послать отзыв
 Синтаксис
C#
Visual Basic
public bool ReadOnly;
Public Property ReadOnly() As bool
 Описание
 Возвращает признак того, является ли приглашение для получения имени файла для файла только на чтение.
 Условия
 Только на чтение
 Ссылки
 PromptFileNameResult Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!