Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PlotInfo.IsValidated
 Послать отзыв
 Синтаксис
C#
Visual Basic
public bool IsValidated;
Public Property IsValidated() As bool
 Ссылки
 PlotInfo Класс, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!