Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Transient.Id
 Послать отзыв
 Свойство Id представляет идентификатор объекта для данного временного объекта. Не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public sealed override DatabaseServices.ObjectId Id;
Копировать Код
Public Overrides NotOverridable ReadOnly Property Id As DatabaseServices.ObjectId
 Возвращает
 Возвращает идентификатор объекта. Тип DatabaseServices.ObjectId.
 Описание
 Свойство Id представляет идентификатор объекта для данного временного объекта.
 В текущей версии не реализовано.
 Условия
 Только чтение.
 Ссылки
 HostMgd.EditorInput.Transient, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!