Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство DocumentLockModeWillChangeEventArgs.CurrentMode
 Послать отзыв
 Синтаксис
C#
Visual Basic
public HostMgd::ApplicationServices::DocumentLockMode CurrentMode;
Public Property CurrentMode() As HostMgd.ApplicationServices.DocumentLockMode
 Описание
 Возвращает текущий режим блокировки документа.
 Условия
 Только на чтение
 Ссылки
 DocumentLockModeWillChangeEventArgs Класс, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!