Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.MediaBounds.IsEqualTo
 Послать отзыв
 Метод позволяет проверить, совпадают ли границы носителя в данном объекте и в указанном объекте MediaBounds в пределах заданной точности. Не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsEqualTo( ref HostMgd.PlottingServices.MediaBounds a, Teigha.Geometry.Tolerance tolerance );
Копировать Код
Public Function IsEqualTo( ByRef a As HostMgd.PlottingServices.MediaBounds, tolerance As Teigha.Geometry.Tolerance ) As Boolean
 Параметры
 Параметры
 Описание
 a
 Входной объект, с которым выполняется сравнение. Тип HostMgd.PlottingServices.MediaBounds.
 tolerance
 Входное значение геометрической точности. Тип Teigha.Geometry.Tolerance.
 Возвращает
 Возвращает true, если в пределах точности tolerance границы листа, определенные данным объектом и объектом a, совпадают. В противном случае возвращает false.
 Описание
 Метод позволяет проверить, совпадают ли границы носителя (листа) в данном объекте и в указанном объекте MediaBounds в пределах заданной точности.
 В текущей версии не реализован.
 Ссылки
 HostMgd.PlottingServices.MediaBounds, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!