Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.SelectWindowPolygon(Point3dCollection,SelectionFilter)
 Послать отзыв
 Метод возвращает набор объектов, полностью находящихся внутри заданного многоугольника и соответствующих указанному фильтру.
 Синтаксис
C#
Visual Basic
Копировать Код
public PromptSelectionResult SelectWindowPolygon(Point3dCollection polygon, SelectionFilter filter);
Копировать Код
Public Function SelectWindowPolygon(polygon As Point3dCollection, filter As SelectionFilter) As PromptSelectionResult
 Параметры
 Параметры
 Описание
 polygon
 Коллекция трёхмерных точек (Point3d), представляющих вершины многоугольника в мировой системе координат (WCS). Многоугольник должен быть замкнутым — иначе он будет автоматически замкнут при обработке. Тип Point3dCollection.
 filter
 Фильтр, задающий условия для выбираемых объектов. Может включать проверки по типу объекта, слою, цвету и другим свойствам. Если фильтр равен null, учитываются все объекты, полностью попадающие внутрь многоугольника. Тип SelectionFilter.
 Возвращает
 Возвращает объект типа PromptSelectionResult, содержащий:
Status — статус выполнения (OK, Cancel, Error и др.). При успешной выборке статус равен PromptStatus.OK.
Value — объект типа SelectionSet, содержащий список идентификаторов (ObjectId) выбранных объектов, удовлетворяющих условиям многоугольника и фильтра.
StringResult — строковое значение.
 Если ни один объект не удовлетворяет условиям выборки, Value может быть null.
 Описание
 Метод используется для выборки геометрических объектов чертежа, которые полностью расположены внутри замкнутого многоугольника, заданного коллекцией вершин. В отличие от перекрёстного выделения, данный метод исключает объекты, частично пересекающие границу многоугольника. К выборке применяется фильтр, который позволяет ограничить результат только теми объектами, которые удовлетворяют заданным критериям (например, типу объекта, слою или цвету).
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("SelectWindowPolygonExample_Point3dCollection_SelectionFilter")] public void SelectWindowPolygonExample_Point3dCollection_SelectionFilter() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Задание многоугольника Point3dCollection polygon = new Point3dCollection(); polygon.Add(new Point3d(0, 0, 0)); polygon.Add(new Point3d(100, 0, 0)); polygon.Add(new Point3d(100, 100, 0)); polygon.Add(new Point3d(0, 100, 0)); // Фильтр: выбрать только объекты типа Circle SelectionFilter filter = new SelectionFilter(new TypedValue[] { new TypedValue((int)DxfCode.Start, "CIRCLE") }); // Вызываем метод PromptSelectionResult result = editor.SelectWindowPolygon(polygon, filter); // Выводим сообщение в командную строку if (result.Status == PromptStatus.OK) { SelectionSet selSet = result.Value; editor.WriteMessage( $"\nВыбрано окружностей внутри области: {selSet.Count}"); } else { editor.WriteMessage( "\nНе найдено объектов, удовлетворяющих условиям."); } } }
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!