Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PlotInfo.ValidatedConfig
 Послать отзыв
 Синтаксис
C#
Visual Basic
public HostMgd::PlottingServices::PlotConfig ValidatedConfig;
Public Property ValidatedConfig() As HostMgd.PlottingServices.PlotConfig
 Ссылки
 PlotInfo Класс, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!