Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.SelectWindow(Point3d,Point3d)
 Послать отзыв
 Метод возвращает набор объектов, полностью находящихся внутри прямоугольного окна, заданного двумя противоположными угловыми точками.
 Синтаксис
C#
Visual Basic
Копировать Код
public PromptSelectionResult SelectWindow(Point3d pt1, Point3d pt2);
Копировать Код
Public Function SelectWindow(pt1 As Point3d, pt2 As Point3d) As PromptSelectionResult
 Параметры
 Параметры
 Описание
 pt1
 Первая угловая точка прямоугольного окна в мировых координатах (WCS). Тип Point3d.
 pt2
 Вторая угловая точка, противоположная первой, которая вместе с pt1 определяет область окна. Тип Point3d.
 Возвращает
 Возвращает объект типа PromptSelectionResult, содержащий:
Status — статус выполнения (OK, Cancel, Error и др.). Если выборка успешна, статус равен PromptStatus.OK.
Value — объект типа SelectionSet, содержащий список идентификаторов (ObjectId) выбранных объектов.
StringResult — строковое значение, если операция была прервана пользователем с помощью клавиатуры.
 Если ни один объект не находится полностью внутри окна, Value может быть null.
 Описание
 Метод используется для выборки геометрических объектов чертежа, которые полностью расположены внутри прямоугольной области. Прямоугольник определяется двумя точками — противоположными углами окна в мировой системе координат (WCS). В отличие от метода SelectCrossingWindow, данный метод не включает объекты, пересекающие границу окна — только те, что полностью в нём помещаются.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("SelectWindowExample_Point3d_Point3d")] public void SelectWindowExample_Point3d_Point3d() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создание точек углов области, внутри которой необходимо выбрать объекты Point3d corner1 = new Point3d(0, 0, 0); Point3d corner2 = new Point3d(100, 100, 0); // Вызываем метод PromptSelectionResult result = editor.SelectWindow(corner1, corner2); // Выводим сообщение в командную строку if (result.Status == PromptStatus.OK) { SelectionSet selSet = result.Value; editor.WriteMessage( $"\nОбъектов внутри окна: {selSet.Count}"); } else { editor.WriteMessage( "\nНет объектов, полностью находящихся в указанном окне."); } } }
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!