Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.SelectionSetDelayMarshalled
 Послать отзыв
 Класс SelectionSetDelayMarshalled представляет набор выделенных объектов чертежа с отложенным маршаллингом. В текущей версии не реализован.
 Иерархия классов
HostMgd::EditorInput::SelectionSet HostMgd::EditorInput::SelectionSetDelayMarshalled
 Синтаксис
C#
Visual Basic
Копировать Код
public sealed class SelectionSetDelayMarshalled : SelectionSet
Копировать Код
Public NotInheritable Class SelectionSetDelayMarshalled Inherits SelectionSet
 Описание
 Класс SelectionSetDelayMarshalled представляет набор выделенных объектов чертежа с отложенным маршаллингом.
 В текущей версии не реализован.
 Методы
 Конструкторы
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 SelectionSet
 (Унаследован от SelectionSet)
 Топики
 Имя
 Описание
 SelectionSet Методы
 Ниже перечислены методы класса SelectionSet.
 SelectionSet Свойства
 Ниже перечислены свойства класса SelectionSet.
 HostMgd.EditorInput.SelectionSetDelayMarshalled
 Имя
 Описание
 SelectionSetDelayMarshalled Методы
 Ниже перечислены методы класса SelectionSetDelayMarshalled.
 SelectionSetDelayMarshalled Свойства
 Ниже перечислены свойства класса SelectionSetDelayMarshalled.
 Ссылки
 SelectionSetDelayMarshalled Методы, SelectionSetDelayMarshalled Свойства, Методы, Топики, SelectionSet Методы, SelectionSet Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!