Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство SelectedObject.OptionalDetails
 Послать отзыв
 Синтаксис
C#
Visual Basic
public HostMgd::EditorInput::SelectionDetails OptionalDetails;
Public Property OptionalDetails() As HostMgd.EditorInput.SelectionDetails
 Описание
 Возвращает объект, описывающий детали выделения объекта., полезные для вложенных объектов.
 Условия
 Только для чтения
 Ссылки
 SelectedObject Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!