Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptResult.ToString(IFormatProvider)
 Послать отзыв
 Метод ToString(IFormatProvider provider) возвращает строковое представление результата ввода, отформатированное с учётом локализации, заданной провайдером форматирования.
 Синтаксис
C#
Visual Basic
Копировать Код
public sealed override string ToString(IFormatProvider provider);
Копировать Код
Public NotOverridable Overrides Function ToString(provider As IFormatProvider) As String
 Параметры
 Параметры
 Описание
 provider
 Объект, предоставляющий информацию о правилах форматирования, например:
 Возвращает
 Возвращает значение типа string, представляющее результат операции ввода, отформатированный с учётом переданного provider. Возвращаемая строка может содержать:
числовое значение , если статус OK (например, "3.14" или "3,14" в зависимости от провайдера),
сообщение об отмене или ошибке , если операция была прервана или завершена некорректно.
 Описание
 Метод используется для получения строкового представления результата ввода, включая числа, точки, строки и другие данные, в формате, соответствующем региональным настройкам пользователя. Метод применяется при работе с числовыми значениями (например, PromptDoubleResult, PromptIntegerResult) и позволяет корректно отображать значения с нужным разделителем (точка или запятая), что особенно важно при разработке мультиязычных плагинов или надстроек.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("PromptResultExample_ToString_IFormatProvider")] public void PromptResultExample_ToString_IFormatProvider() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создаём запрос пользователю PromptDistanceOptions options = new PromptDistanceOptions("\nВведите расстояние:"); options.DefaultValue = 100.0; PromptDoubleResult result = editor.GetDistance(options); // Если данные введены, выводим результат в командную строку if (result.Status == PromptStatus.OK) { string formatted = result.ToString(CultureInfo.InvariantCulture); editor.WriteMessage($"\nРасстояние: {formatted}"); } } }
 Ссылки
 HostMgd.EditorInput.PromptResult, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!