Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.LongTransactionManager.CheckingIn
 Послать отзыв
 Событие CheckingIn возникает перед завершением (возвратом) длительной транзакции (операция CheckIn). В текущей версии не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public event LongTransactionEventHandler CheckingIn;
Копировать Код
Public Event CheckingIn As LongTransactionEventHandler
 Описание
 Событие CheckingIn возникает перед завершением (возвратом) длительной транзакции (операция CheckIn). Может использоваться для проверки состояния объектов перед их сохранением в основной базе данных.
 В текущей версии не реализовано.
 Ссылки
 HostMgd.ApplicationServices.LongTransactionManager, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!