Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.PromptedForEntity
 Послать отзыв
 Событие возникает после завершения операции выбора геометрического объекта пользователем в редакторе nanoCAD. Событие не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public event PromptEntityResultEventHandler PromptedForEntity;
Копировать Код
Public Event PromptedForEntity As PromptEntityResultEventHandler
 Описание
 Событие инициируется системой .NET API nanoCAD при завершении интерактивного выбора объекта — например, после вызова метода GetEntity(), когда пользователь указывает на объект с помощью мыши или выбирает его другим способом. Оно предоставляет результат выборки в виде объекта PromptEntityResult, который содержит статус операции (OK, Cancel, Error) и данные о выбранном объекте: его ObjectId и точку выбора PickedPoint.
 Это событие позволяет разработчикам надстроек и плагинов реагировать на завершение выбора объекта, выполнять дополнительные действия, проверять допустимость выбора или изменять состояние чертежа на основе выбранного элемента.
 Событие реализуется через делегат PromptEntityResultEventHandler, передающий источник события и аргументы типа PromptEntityResultEventArgs.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события PromptedForEntity [Teigha.Runtime.CommandMethod("PromptedForEntityExample")] public void PromptedForEntityExample() { // Подписка на событие PromptedForEntity editor.PromptedForEntity += OnEditorPromptedForEntity; } // Реализация отработки события PromptedForEntity private void OnEditorPromptedForEntity(object sender, PromptEntityResultEventArgs e) { // Вывод сообщения в командную строку if (e.Result.Status == PromptStatus.OK && !e.Result.ObjectId.IsNull) { editor.WriteMessage($"\nВыбран объект: {e.Result.ObjectId.ObjectClass.Name}, точка: {e.Result.PickedPoint}"); } else { editor.WriteMessage("\nНе удалось получить объект."); } } }
 Порядок работы с событием:
Вызывается метод GetEntity() или аналогичный.
Пользователь выбирает объект на чертеже или отменяет операцию.
Генерируется событие PromptedForEntity.
Разработчик получает доступ к результату выбора и может обработать его.
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!