Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PromptOpenFileOptions.TransferRemoteFiles
 Послать отзыв
 Синтаксис
C#
Visual Basic
public bool TransferRemoteFiles;
Public Property TransferRemoteFiles() As bool
 Описание
 Устанавливает или возвращает признак того, что разрешно преобразование или удаление файла. Если свойство имеет значение true, то преобразование или удаление разрешено.
 Условия
 На чтение и запись
 Ссылки
 PromptOpenFileOptions Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!