Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод PlotEngine.EndDocument
 Послать отзыв
 Синтаксис
C#
Visual Basic
public void EndDocument(ref System.Object parameters);
Public Sub EndDocument(ByRef parameters As System.Object)
 Ссылки
 PlotEngine Класс, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!