Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptAngleOptions
 Послать отзыв
 Класс предоставляет параметры, используемые при интерактивном вводе угла в nanoCAD, такие как начальное значение, допустимый диапазон и сообщение для пользователя.
 Иерархия классов
HostMgd::EditorInput::PromptOptions HostMgd::EditorInput::PromptEditorOptions HostMgd::EditorInput::PromptAngleOptions
 Синтаксис
C#
Visual Basic
Копировать Код
public sealed class PromptAngleOptions : PromptEditorOptions
Копировать Код
Public NotInheritable Class PromptAngleOptions Inherits PromptEditorOptions
 Описание
 Класс наследуется от PromptEditorOptions и применяется для настройки поведения команды ввода угла — например, при вызове метода GetAngle(). Он позволяет задать:
текст приглашения (Message),
начальное значение угла (DefaultValue),
начальную точку (BasePoint),
дополнительные флаги для управления поведением ввода.
 Эти параметры обеспечивают гибкость при работе с интерактивным вводом угла, позволяя ограничивать значения, устанавливать подсказки и управлять контекстом ввода.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("GetAngleExample")] public void GetAngleExample() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создаём запрос пользователю, чтобы он указал угол на чертеже PromptAngleOptions options = new PromptAngleOptions("\nУкажите угол поворота:"); options.DefaultValue = Math.PI / 2; // 90 градусов по умолчанию // Вызов метода GetAngle, запрашивающего угол у пользователя PromptDoubleResult result = editor.GetAngle(options); // Если пользователь указал все необходимые данные, // выводим в командной строке сообщение if (result.Status == PromptStatus.OK) { double angleInRadians = result.Value; double angleInDegrees = result.Value * 180 / Math.PI; editor.WriteMessage($"\nВведен угол: {angleInRadians} радиан или {angleInDegrees} градусов"); } } }
 Методы
 Конструкторы
 HostMgd.EditorInput.PromptAngleOptions
 Имя
 Описание
 PromptAngleOptions
 Это обзор перегрузок PromptAngleOptions.
 Топики
 Имя
 Описание
 PromptOptions Методы
 Ниже перечислены методы класса PromptOptions.
 PromptOptions Свойства
 Ниже перечислены свойства класса PromptOptions.
 HostMgd.EditorInput.PromptAngleOptions
 Имя
 Описание
 PromptAngleOptions Методы
 Ниже перечислены методы класса PromptAngleOptions.
 PromptAngleOptions Свойства
 Ниже перечислены свойства класса PromptAngleOptions.
 Ссылки
 PromptAngleOptions Конструктор, PromptAngleOptions Методы, PromptAngleOptions Свойства, Методы, Топики, PromptOptions Методы, PromptOptions Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!