Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptDistanceOptions.Only2d
 Послать отзыв
 Свойство предназначено для указания, должно ли возвращаемое значение расстояния рассматриваться как проекция в плоскости местной системы координат (ПСК), но в текущей реализации не используется.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool Only2d { get; set; }
Копировать Код
Public Property Only2d As Boolean
 Возвращает
 Возвращает или устанавливает значение типа bool, но изменение этого значения не оказывает эффекта на работу программы.
true — (теоретически) расстояние ограничивается 2D-проекцией.
false — расстояние обрабатывается в трёхмерном пространстве.
 Описание
 Свойство изначально задумано как флаг, определяющий, следует ли интерпретировать вводимое расстояние только в двухмерной плоскости текущей пользовательской системы координат (ПСК). Если бы оно поддерживалось, при значении true расстояние вычислялось бы как проекция на XY-плоскость ПСК, игнорируя Z-компоненту.
 Это свойство не используется в текущей версии API nanoCAD. Оно присутствует в интерфейсе, но не влияет на поведение команды ввода расстояния.
 Условия
 Чтение и запись
 Ссылки
 HostMgd.EditorInput.PromptDistanceOptions, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!