Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.DocumentCollection.CopyTo(Document[],int)
 Послать отзыв
 Метод предназначен для копирования коллекции dwg-документов в одномерный массив.
 Синтаксис
C#
Visual Basic
Копировать Код
public void CopyTo(Document[] arrDoc, int index);
Копировать Код
Public Function CopyTo( array As Document[], index As Integer ) As void
 Параметры
 Параметры
 Описание
 arrDoc
 Одномерный массив, в который копируются элементы коллекции документов класса. Этот массив должен иметь индексацию элементов, начинающуюся с 0. Тип Document[]
 index
 Индекс в массиве, начиная с которого в массив будут копироваться элементы коллекции. Тип int
 Описание
 Метод копирует коллекцию dwg-документов в одномерный массив, типипзированный классом Document.
 Ссылки
 HostMgd.ApplicationServices.DocumentCollection, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!