Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор DropTarget.DropTarget
 Послать отзыв
 This is DropTarget, a member of class DropTarget.
 Синтаксис
C#
Visual Basic
public DropTarget();
Public Sub New()
 Ссылки
 DropTarget Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!