Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство StatusBarMouseDownEventArgs.Y
 Послать отзыв
 This is Y, a member of class StatusBarMouseDownEventArgs.
 Синтаксис
C#
Visual Basic
public int Y;
Public Property Y() As Integer
 Ссылки
 StatusBarMouseDownEventArgs Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!