Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Делегат HostMgd.Windows.StatusBarMouseDownEventHandler
 Послать отзыв
 This is type HostMgd::Windows::StatusBarMouseDownEventHandler.
 Синтаксис
C#
Visual Basic
public delegate StatusBarMouseDownEventHandler();
Public Delegate Sub StatusBarMouseDownEventHandler()
 Ваши комментарии по поводу этого топика: Послать отзыв!