Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор PromptSaveFileOptions.PromptSaveFileOptions
 Послать отзыв
 Синтаксис
C#
Visual Basic
public PromptSaveFileOptions(ref System.String message);
Public Sub New(ByRef message As System.String)
 Параметры
 Параметры
 Описание
 message
 Приглашающее сообщение
 Описание
 Конструктор.
 Ссылки
 PromptSaveFileOptions Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!