Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство SelectedSubObject.GraphicsSystemMarker
 Послать отзыв
 Синтаксис
C#
Visual Basic
public int GraphicsSystemMarker;
Public Property GraphicsSystemMarker() As Integer
 Описание
 Устанавливает или возвращает GS маркер выбранного подобъекта.
 Условия
 На чтение и запись
 Ссылки
 SelectedSubObject Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!