Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.BeginPlotEventArgs.PlotType
 Послать отзыв
 Свойство PlotType представляет тип печати из перечисления PlotType.
 Синтаксис
C#
Visual Basic
Копировать Код
public HostMgd.PlottingServices.PlotType PlotType;
Копировать Код
Public ReadOnly Property PlotType As HostMgd.PlottingServices.PlotType
 Возвращает
 Возвращает используемый тип печати. Тип HostMgd.PlottingServices.PlotType.
 Описание
 Свойство PlotType представляет тип печати (предварительная печать, фоновая печать и т.п.) как значение из перечисления HostMgd.PlottingServices.PlotType.
 Условия
 Только чтение.
 Ссылки
 HostMgd.PlottingServices.BeginPlotEventArgs, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!