Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод IConfigurationSection.OpenSubsection
 Послать отзыв
 Синтаксис
C#
Visual Basic
IConfigurationSection OpenSubsection(ref String name);
Function OpenSubsection(ByRef name As String) As IConfigurationSection
 Параметры
 Параметры
 Описание
 name
 Имя открываемой подсекции
 Описание
 Этот метод должен быть разработан для открытия конфигурационной подсекции с именем name.
 Ссылки
 IConfigurationSection Интерфейс, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!