Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PrintForm.SheetProgressCaption
 Послать отзыв
 This is SheetProgressCaption, a member of class PrintForm.
 Синтаксис
C#
Visual Basic
public System.String SheetProgressCaption;
Public Property SheetProgressCaption() As System.String
 Ссылки
 PrintForm Класс, Пространство имен HostMgd
 Ваши комментарии по поводу этого топика: Послать отзыв!