Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.Document.TryGetDatabase()
 Послать отзыв
 Метод предназначен для получения базы данных активного dwg-документа. Не реализован.
 Синтаксис
C#
Visual Basic
public Teigha::DatabaseServices::Database TryGetDatabase();
Public Function TryGetDatabase() As Teigha.DatabaseServices.Database
 Возвращает
 Возвращает базу данных dwg-документа. Тип Database
 Описание
 Метод пытается получить базу данных активного dwg-документа.
 Замечания
 Метод не реализован
 Ссылки
 HostMgd.ApplicationServices.Document, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!