Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Событие StatusBarItem.Deleted
 Послать отзыв
 This is Deleted, a member of class StatusBarItem.
 Синтаксис
C#
Visual Basic
public event EventHandler Deleted;
Public Event Deleted As EventHandler
 Ссылки
 StatusBarItem Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!