Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.DraggingEndedEventArgs.Offset
 Послать отзыв
 Свойство предоставляет вектор смещения, применённый к объекту в процессе операции перетаскивания.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d Offset { get; }
Копировать Код
Public ReadOnly Property Offset As Vector3d
 Возвращает
 Возвращает объект типа Vector3d, содержащий значения смещения по осям X, Y и Z. Если операция перетаскивания не была выполнена или смещение отсутствует, возвращается нулевой вектор (Vector3d.Zero).
 Описание
 Свойство возвращает значение типа Vector3d, представляющее собой смещение (разницу между начальной и конечной точками перемещения) объекта в мировой системе координат (WCS). Оно используется для определения направления и величины перемещения при завершении операции перетаскивания. Это позволяет разработчикам корректно обновить положение объекта в чертеже или выполнить дополнительные вычисления на основе его нового положения.
 Условия
 Только чтение
 Пример
C#
 Копировать Код
public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события Dragging [Teigha.Runtime.CommandMethod("DraggingEndedExample_OffsetProp")] public void DraggingEndedExample_OffsetProp() { // Подписка на событие редактора DraggingEnded editor.DraggingEnded += OnEditorDraggingEnded; } // Реализация отработки события DraggingEnded private void OnEditorDraggingEnded(object sender, DraggingEndedEventArgs e) { // Получаем доступ к вектору смещения Vector3d offset = e.Offset; // Выводим в командную строку сообщение о смещении editor.WriteMessage( $"\nОбъект перемещён на: {offset}"); } }
 Ссылки
 HostMgd.EditorInput.DraggingEndedEventArgs, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!