Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.LongTransactionManager.CheckedIn
 Послать отзыв
 Событие CheckedIn возникает после успешного возврата объектов из длительной транзакции в основную базу данных (операция CheckIn). В текущей версии не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public event LongTransactionEventHandler CheckedIn;
Копировать Код
Public Event CheckedIn As LongTransactionEventHandler
 Описание
 Событие CheckedIn возникает после успешного завершения возврата объектов из длительной транзакции в основную базу данных (операция CheckIn).
 В текущей версии не реализовано.
 Ссылки
 HostMgd.ApplicationServices.LongTransactionManager, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!