Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.PlotConfig.IsPlotToFile
 Послать отзыв
 Свойство IsPlotToFile позволяет проверить, сконфигурировано ли устройство для печати в файл. Не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsPlotToFile;
Копировать Код
Public ReadOnly Property IsPlotToFile As Boolean
 Возвращает
 Возвращает true, если устройство в данный момент настроено на печать в файл. В противном случае возвращает false.
 Описание
 Свойство IsPlotToFile позволяет проверить, сконфигурировано ли устройство для печати в файл.
 В текущей версии не реализовано.
 Условия
 Только чтение.
 Ссылки
 HostMgd.PlottingServices.PlotConfig, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!