Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.InplaceTextEditor.ToolbarHidden
 Послать отзыв
 Свойство ToolbarHidden позволяет определить, является ли скрытой панель инструментов. В текущей версии не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool ToolbarHidden;
Копировать Код
Public Property ToolbarHidden As Boolean
 Возвращает
 Возвращает true, если панель инструментов в редакторе не отображается (скрыта). В противном случае возвращает false.
 Описание
 Свойство ToolbarHidden позволяет определить, является ли скрытой панель инструментов. В текущей версии не реализовано.
 Условия
 Чтение и запись.
 Ссылки
 HostMgd.ApplicationServices.InplaceTextEditor, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!