Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.PlotConfig.DriverName
 Послать отзыв
 Свойство DriverName возвращает имя драйвера устройства вывода. Не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public System.String DriverName;
Копировать Код
Public ReadOnly Property DriverName As System.String
 Возвращает
 Возвращает имя драйвера устройства. Тип System.String.
 Описание
 Свойство DriverName возвращает имя драйвера устройства вывода.
 В текущей версии не реализовано.
 Условия
 Только чтение.
 Ссылки
 HostMgd.PlottingServices.PlotConfig, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!