Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.RolloverEventArgs
 Послать отзыв
 Класс предоставляет данные для события Rollover, возникающего при наведении курсора на графический объект в чертеже.
 Иерархия классов
HostMgd::EditorInput::RolloverEventArgs
 Синтаксис
C#
Visual Basic
Копировать Код
public sealed class RolloverEventArgs : EventArgs
Копировать Код
Public NotInheritable Class RolloverEventArgs Inherits EventArgs
 Описание
 Класс используется для передачи информации о событии подсветки объекта при наведении курсора. Он применяется в обработчике события Rollover и содержит сведения о геометрическом объекте, над которым в данный момент находится курсор.
 Основные данные, предоставляемые классом:
идентификатор объекта (ObjectId),
точка пересечения курсора с объектом в мировых координатах.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события Rollover [Teigha.Runtime.CommandMethod("RolloverExample")] public void RolloverExample() { // Подписка на событие Rollover editor.Rollover += OnEditorRollover; } // Реализация отработки события Rollover private void OnEditorRollover(object sender, RolloverEventArgs e) { ObjectId[] objId = e.Highlighted.GetObjectIds(); // Вывод информации о подсвеченных объектах editor.WriteMessage($"\nКурсор над {objId.Length} объектом(ами)"); for (int i = 0; i < objId.Length; i++) editor.WriteMessage($"\n{objId}"); } }
 Топики
 Имя
 Описание
 RolloverEventArgs Свойства
 Ниже перечислены свойства класса RolloverEventArgs.
 Ссылки
 RolloverEventArgs Свойства, Топики, RolloverEventArgs Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!