Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.DsdData.MajorVersion
 Послать отзыв
 Свойство MajorVersion возвращает номер основной версии файла DSD, загруженного методом ReadDsd(). Не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public int MajorVersion;
Копировать Код
Public Property MajorVersion As Integer
 Возвращает
 Возвращает номер основной версии файла DSD. Тип int.
 Описание
 Свойство MajorVersion позволяет управлять номером основной (мажорной) версии файла DSD. Этот номер становится доступным после чтения файла DSD методом ReadDsd().
 В текущей версии не реализовано.
 Условия
 Чтение и запись.
 Ссылки
 HostMgd.PlottingServices.DsdData, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!