Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Visuals.PickBitmap
 Послать отзыв
 This is PickBitmap, a member of class Visuals.
 Синтаксис
C#
Visual Basic
public Teigha::DatabaseServices::Image PickBitmap;
Public Property PickBitmap() As Teigha.DatabaseServices.Image
 Ссылки
 Visuals Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!