Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.Document.ViewChanged
 Послать отзыв
 Событие, возникающее, когда параметры текущего вида были изменены.
 Синтаксис
C#
Visual Basic
public event EventHandler ViewChanged;
Public Event ViewChanged As EventHandler
 Возвращает
 Возвращает тип данных EventHandler
 Описание
 Событие возникает, когда параметры текущего вида были изменены.
 Ссылки
 HostMgd.ApplicationServices.Document, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!