Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.Windows.ToolPalette.CustomToolBase.IsValueUnspecified
 Послать отзыв
 Метод позволяет определить, является ли текущим значением указанного свойства значение "не указано" (unspecified). Не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual int IsValueUnspecified( ref System.Object id, bool returnValue );
Копировать Код
Public Overridable Function IsValueUnspecified( ByRef id As System.Object, returnValue As Boolean ) As Integer
 Параметры
 Параметры
 Описание
 id
 Входной идентификатор свойства инструмента. Тип System.Object.
 returnValue
 Возвращаемое значение. Тип bool.
 Возвращает
 Возвращает код завершения метода. Тип int.
 Описание
 Метод позволяет определить, является ли текущим значением указанного свойства значение "не указано" (unspecified).
 В текущей версии не реализован.
 Ссылки
 HostMgd.Windows.ToolPalette.CustomToolBase, HostMgd.Windows.ToolPalette
 Ваши комментарии по поводу этого топика: Послать отзыв!