Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor
 Послать отзыв
 Класс представляет системный объект, управляющий цепочкой реакторов редактора nanoCAD, что позволяет приложениям добавлять и удалять реакторы для обработки событий и взаимодействия с редактором.
 Иерархия классов
HostMgd::EditorInput::Editor
 Синтаксис
C#
Visual Basic
Копировать Код
public class Editor : MarshalByRefObject;
Копировать Код
Public Class Editor Inherits MarshalByRefObject
 Описание
 Системный объект класса, наследованный от этого абстрактного базового класса, позволяет приложению управлять реакторами редактора nanoCAD. Приложения могут добавлять и удалять реакторы из цепочки реакторов редактора nanoCAD.
 Топики
 Имя
 Описание
 Editor Данные
 Ниже перечислены данные класса Editor.
 Editor Методы
 Ниже перечислены методы класса Editor.
 Editor Свойства
 Ниже перечислены свойства класса Editor.
 Editor События
 Ниже перечислены события класса Editor.
 Ссылки
 Editor Данные, Editor Методы, Editor Свойства, Editor События, Топики, Editor Данные, Editor Методы, Editor Свойства, Editor События
 Ваши комментарии по поводу этого топика: Послать отзыв!