Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство WhoHasInfo.UserName
 Послать отзыв
 Синтаксис
C#
Visual Basic
public System.String UserName;
Public Property UserName() As System.String
 Описание
 Возвращает имя пользователя (логин), редактирующего файл, если файл был открыт на редактирование.
 Условия
 Только на чтение
 Ссылки
 WhoHasInfo Структура, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!