Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод SaveFileDialog.ShowModal
 Послать отзыв
 This is ShowModal, a member of class SaveFileDialog.
 Синтаксис
C#
Visual Basic
public Nullable<Boolean> ShowModal();
Public Function ShowModal() As Nullable<Boolean>
 Ссылки
 SaveFileDialog Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!