Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.EndPageEventArgs
 Послать отзыв
 Класс EndPageEventArgs предоставляет данные, специфичные для вывода листа на печать и необходимые для события PlotReactorManager.EndPage.
 Иерархия классов
HostMgd::PlottingServices::EndPageEventArgs
 Синтаксис
C#
Visual Basic
Копировать Код
public class EndPageEventArgs : System.EventArgs;
Копировать Код
Public Class EndPageEventArgs Inherits System.EventArgs;
 Описание
 Класс EndPageEventArgs является наследником класса System.EventArgs и в .NET API nanoCAD предоставляет данные, специфичные для вывода листа на печать и необходимые для события PlotReactorManager.EndPage. Эти данные включают состояние флага SheetCancelStatus. Используется совместно с делегатом HostMgd.PlottingServices.EndPageEventHandler.
 Методы
 Конструкторы
 Имя
 Описание
 EndPageEventArgs
 Конструктор класса EndPageEventArgs. Создает экземпляр класса с указанным значением флага HostMgd.PlottingServices.SheetCancelStatus.
 Топики
 Имя
 Описание
 EndPageEventArgs Свойства
 Ниже перечислены свойства класса EndPageEventArgs.
 Ссылки
 EndPageEventArgs Свойства, Методы, Топики, EndPageEventArgs Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!