Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство JigPromptOptions.UserInputControls
 Послать отзыв
 Пользовательские настройки ввода, используемые во время выполнения технологии Jig.
 Синтаксис
C#
Visual Basic
public HostMgd.EditorInput.UserInputControls UserInputControls;
Public Property UserInputControls() As HostMgd.EditorInput.UserInputControls
 Возвращает
 Возвращает тип данных UserInputControls - набор пользовательских настроек ввода, установленных для операции Jig.
 Описание
 Свойство предназначено для определения пользовательских настроек ввода при запросе во время использования технологии Jig. Пользовательские настройки ввода определяются одним из элементов перечисления UserInputControls.
 Условия
 Чтение и запись.
 Ссылки
 JigPromptOptions Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!