Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.PromptForSelectionEnding
 Послать отзыв
 Событие возникает после завершения операции выбора объектов, но перед фиксацией результата. Событие не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public event PromptForSelectionEndingEventHandler PromptForSelectionEnding;
Копировать Код
Public Event PromptForSelectionEnding As PromptForSelectionEndingEventHandler
 Описание
 Событие вызывается на этапе завершения интерактивного выбора множества объектов в nanoCAD. Оно является частью последовательности событий, связанных с выборкой:
SelectionRemoved — объекты удалены из текущего выделения.
PromptingForSelection — начало новой операции выборки.
SelectionAdded — объекты добавлены к выделению.
PromptForSelectionEnding — завершение операции выборки (текущее событие).
PromptedForSelection — пост-обработка после окончания выборки.
 Это событие позволяет разработчику получить доступ к текущему набору выбранных объектов и обработать его перед тем, как выбор будет использован в команде. Может применяться для проверки допустимости выборки, изменения состава выделенных объектов или выполнения предварительных действий.
 Замечания
 Событие реализуется через делегат PromptForSelectionEndingEventHandler, который предоставляет доступ к объекту PromptForSelectionEndingEventArgs.
 Событие особенно полезно при создании плагинов, где требуется дополнительная обработка выбора объектов до завершения операции, например, фильтрация, модификация или отмена выборки.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события PromptForSelectionEnding [Teigha.Runtime.CommandMethod("PromptForSelectionEndingExample")] public void PromptForSelectionEndingExample() { // Подписка на событие PromptForSelectionEnding editor.PromptForSelectionEnding += OnEditorPromptForSelectionEnding; } // Реализация отработки события PromptForSelectionEnding private void OnEditorPromptForSelectionEnding(object sender, PromptForSelectionEndingEventArgs e) { if (e.Selection.Count > 0) { // Вывод сообщения в командную строку editor.WriteMessage( $"\nВыбрано объектов: {e.Selection.Count}"); } } }
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!