Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.InplaceTextEditorSettings.SimpleMText
 Послать отзыв
 Свойство SimpleMText позволяет указать или проверить, что входным является простой объект MTEXT. В текущей версии не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool SimpleMText;
Копировать Код
Public Property SimpleMText As Boolean
 Возвращает
 Возвращает true, если входным объектом редактора является простой объект MTEXT. В противном случае возвращает false.
 Описание
 Свойство SimpleMText позволяет задать или проверить, что входным объектом встроенного текстового редактора является простой объект MTEXT.
 В текущей версии не реализовано.
 Условия
 Чтение и запись.
 Ссылки
 HostMgd.ApplicationServices.InplaceTextEditorSettings, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!