Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptForEntityEndingEventArgs.Selection
 Послать отзыв
 Свойство предоставляет доступ к набору объектов, выбранных пользователем в результате интерактивного приглашения.
 Синтаксис
C#
Visual Basic
Копировать Код
public SelectionSet Selection { get; }
Копировать Код
Public ReadOnly Property Selection As SelectionSet
 Возвращает
 Возвращает объект типа SelectionSet, представляющий собой набор выделенных объектов. Если объекты были выбраны — SelectionSet будет содержать список ObjectId этих объектов. Если выборка не была выполнена или отменена, возвращается null или пустой SelectionSet.
 Описание
 Свойство возвращает объект типа SelectionSet, который содержит коллекцию геометрических объектов, выделенных пользователем в ходе интерактивной операции. Оно используется, например, в обработчиках событий редактора nanoCAD, таких как PromptForSelectionEnding, и позволяет получить или проанализировать текущее выделение перед его использованием в команде. Свойство доступно только для чтения и обновляется автоматически при завершении выборки.
 Замечания
 Это свойство особенно полезно при разработке плагинов и надстроек, где требуется работать с множественным выбором объектов и выполнять над ними массовые операции.
 Условия
 Только чтение
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события PromptForSelectionEnding [Teigha.Runtime.CommandMethod("PromptForSelectionEndingExample_Selection")] public void PromptForSelectionEndingExample_Selection() { // Подписка на событие PromptForSelectionEnding editor.PromptForSelectionEnding += OnEditorPromptForSelectionEnding; } // Реализация отработки события PromptForSelectionEnding private void OnEditorPromptForSelectionEnding(object sender, PromptForSelectionEndingEventArgs e) { SelectionSet selected = e.Selection; if (selected != null && selected.Count > 0) { editor.WriteMessage( $"\nВыбрано объектов: {selected.Count}"); } } }
 Ссылки
 HostMgd.EditorInput.PromptForSelectionEndingEventArgs, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!