Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство TabbedDialogExtension.OnApply
 Послать отзыв
 Синтаксис
C#
Visual Basic
public TabbedDialogAction OnApply;
Public Property OnApply() As TabbedDialogAction
 Описание
 Возвращает обработчик события, который вызывается, когда пользователь нажимает на кнопку Apply в главном диалоге для того, чтобы применить изменения.
 Условия
 Только на чтение
 Ссылки
 TabbedDialogExtension Класс, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!