Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.Windows.ToolPalette.FlyoutEntryAttribute.DispId
 Послать отзыв
 Свойство DispId представляет идентификатор диспетчеризации. Не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public int DispId;
Копировать Код
Public ReadOnly Property DispId As Integer
 Возвращает
 Возвращает идентификатор диспетчеризации. Тип int.
 Описание
 Свойство DispId представляет идентификатор диспетчеризации.
 В текущей версии не реализовано.
 Условия
 Только чтение.
 Ссылки
 HostMgd.Windows.ToolPalette.FlyoutEntryAttribute, HostMgd.Windows.ToolPalette
 Ваши комментарии по поводу этого топика: Послать отзыв!