Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод PaneCollection.Add (HostMgd::Windows::Pane^)
 Послать отзыв
 Добавление объекта Pane в коллекцию.
 Синтаксис
C#
Visual Basic
public int Add(ref HostMgd::Windows::Pane value);
Public Function Add(ByRef value As HostMgd.Windows.Pane) As Integer
 Описание
 Ссылки
 PaneCollection Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!