Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.Document.LockMode(bool)
 Послать отзыв
 Метод позволяет приложению определить, установлены ли в dwg-документе какие-либо блокировки с учетом значения параметра bIncludeMyLocks.
 Синтаксис
C#
Visual Basic
public DocumentLockMode LockMode(bool bIncludeMyLocks);
Public Function LockMode(bIncludeMyLocks As bool) As DocumentLockMode
 Параметры
 Параметры
 Описание
 bIncludeMyLocks
 Признак, показывающий, должны ли при формировании результата учитываться блокировки собственным контекстом. Тип bool
 Возвращает
 Возвращает самый высокий уровень блокировки, установленный исполняемым контекстом. Тип DocumentLockMode Если bIncludeMyLocks = true, то метод возвращает самый высокий уровень блокировки, установленный любым выполняемым контекстом, включая и само приложение. Если bIncludeMyLocks = false, то метод возвращает самый высокий уровень блокировки, установленный контекстом, не являющимся собственным для dwg-документа и приложения.
 Описание
 Метод проверяет, установлены ли в dwg-документе какие-либо блокировки. При проверке учитывается возможность испольняемого контекста переопределить собственные блокировки. Если контекст имеет право на монопольную запись, он может задать и другую блокировку документа.
 Ссылки
 HostMgd.ApplicationServices.Document, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!