Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод SelectionDetails.ToString ()
 Послать отзыв
 Синтаксис
C#
Visual Basic
public String ToString();
Public Function ToString() As String
 Описание
 Возвращает строку, представляющую объект.
 Ссылки
 SelectionDetails Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!