Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.DsdEntry.DwgName
 Послать отзыв
 Свойство DwgName представляет имя файла DWG, в котором содержится лист, подлежащий публикации. Не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public System.String DwgName;
Копировать Код
Public Property DwgName As System.String
 Возвращает
 Возвращает имя файла DWG. Тип System.String.
 Описание
 Свойство DwgName представляет имя файла DWG, в котором содержится лист, подлежащий публикации.
 В текущей версии не реализовано.
 Условия
 Чтение и запись.
 Ссылки
 HostMgd.PlottingServices.DsdEntry, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!