Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 JigPromptDistanceOptions.JigPromptDistanceOptions()
 Послать отзыв
 Конструктор класса без параметров.
 Синтаксис
C#
Visual Basic
public JigPromptDistanceOptions();
Public Sub New()
 Описание
 Конструктор класса. Присваивает свойству Message пустую строку. Также устанавливает значение свойства Cursor равное CursorType.Crosshair (перекрестие).
 Ссылки
 JigPromptDistanceOptions Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!