Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Делегат HostMgd.ApplicationServices.DocumentActivationChangedEventHandler
 Послать отзыв
 Делегат события переключения (активации) документа Событие класса DocumentCollection
 Синтаксис
C#
Visual Basic
public delegate DocumentActivationChangedEventHandler();
Public Delegate Sub DocumentActivationChangedEventHandler()
 Ваши комментарии по поводу этого топика: Послать отзыв!