Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство JigPromptStringOptions.DefaultValue
 Послать отзыв
 Значение по умолчанию для запроса текста во время операции Jig.
 Синтаксис
C#
Visual Basic
public System.String DefaultValue;
Public Property DefaultValue() As System.String
 Возвращает
 Возвращает текстовые данные, заданные по умолчанию.
 Описание
 Свойство предназначено для чтения и определения текста по умолчанию для запроса текстовых данных во время операции Jig. Значение по умолчанию будет использовано, если пользователь во время запроса нажал клавишу ENTER без какого-либо ввода.
 Условия
 Чтение и запись.
 Ссылки
 JigPromptStringOptions Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!