Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.Windows.ToolPalette.CustomToolBase.Dropped
 Послать отзыв
 Метод вызывается после того, как пользователь перетащил инструмент на панель инструментов с помощью пользовательской процедуры перетаскивания или IDrop. Не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void Dropped( ref System.String url );
Копировать Код
Public Overridable Sub Dropped( ByRef url As System.String )
 Параметры
 Параметры
 Описание
 url
 Входной/выходной URL, связанный с инструментом. Тип System.String.
 Описание
 Метод вызывается после того, как пользователь завершил операцию перетаскивания (drag-and-drop) инструмента на панель инструментов с помощью пользовательской процедуры перетаскивания или IDrop.
 В текущей версии не реализован.
 Ссылки
 HostMgd.Windows.ToolPalette.CustomToolBase, HostMgd.Windows.ToolPalette
 Ваши комментарии по поводу этого топика: Послать отзыв!