Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptStringOptions
 Послать отзыв
 Класс предоставляет параметры для настройки интерактивного ввода строки в nanoCAD, такие как сообщение, ключевые слова и режимы ввода.
 Иерархия классов
HostMgd::EditorInput::PromptOptions HostMgd::EditorInput::PromptEditorOptions HostMgd::EditorInput::PromptStringOptions
 Синтаксис
C#
Visual Basic
Копировать Код
public sealed class PromptStringOptions : PromptEditorOptions
Копировать Код
Public NotInheritable Class PromptStringOptions Inherits PromptEditorOptions
 Описание
 Класс используется при вызове метода GetString() для настройки поведения команды ввода текстовой строки. С его помощью можно задать:
текст приглашения,
локальные ключевые слова, отображаемые в формате [Ключ1/Ключ2],
глобальные ключевые слова,
разрешение на пустой ввод,
режим ввода — только из списка ключевых слов или с разрешением произвольного текста.
 Класс используется совместно с событиями PromptingForString и PromptedForString, что позволяет как настраивать параметры до ввода, так и обрабатывать результат после завершения.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("GetStringExample")] public void GetStringExample() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Определяем настройки запроса пользователю PromptStringOptions options = new PromptStringOptions("Введите имя"); options.DefaultValue = "Untitled"; options.AllowSpaces = true; // Создаём запрос пользователю PromptResult pr = editor.GetString(options); // Если все данные введены, выводим результат в командную строку if (pr.Status == PromptStatus.OK) { editor.WriteMessage( $"\nВы ввели: {pr.StringResult}"); } else { editor.WriteMessage( "\nВвод отменён."); } } }
 Методы
 Конструкторы
 HostMgd.EditorInput.PromptStringOptions
 Имя
 Описание
 PromptStringOptions
 Конструктор инициализирует новый экземпляр класса с заданным приглашающим сообщением для ввода строки.
 Топики
 Имя
 Описание
 PromptOptions Методы
 Ниже перечислены методы класса PromptOptions.
 PromptOptions Свойства
 Ниже перечислены свойства класса PromptOptions.
 HostMgd.EditorInput.PromptStringOptions
 Имя
 Описание
 PromptStringOptions Свойства
 Ниже перечислены свойства класса PromptStringOptions.
 Ссылки
 PromptStringOptions Свойства, Методы, Топики, PromptOptions Методы, PromptOptions Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!