Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство EditorVisualStyle.IsVS2dType
 Послать отзыв
 Синтаксис
C#
Visual Basic
public bool IsVS2dType;
Public Property IsVS2dType() As bool
 Описание
 Возвращает true, если визуальный стиль является 2D стилем.
 Условия
 Только на чтение
 Ссылки
 EditorVisualStyle Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!