Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptNestedEntityOptions.UseNonInteractivePickPoint
 Послать отзыв
 Свойство определяет, будет ли операция выбора вложенного объекта использовать заданную программную точку выбора вместо ожидания ввода от пользователя.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool UseNonInteractivePickPoint { get; set; }
Копировать Код
Public Property UseNonInteractivePickPoint As Boolean
 Возвращает
 Возвращает значение типа bool:
true — система использует NonInteractivePickPoint для автоматического выбора объекта.
false — включается стандартный интерактивный режим ввода (ожидание указания мышью).
 Описание
 Свойство указывает, следует ли применять значение, заданное в свойстве NonInteractivePickPoint, для автоматического выбора вложенного объекта без участия пользователя. Если свойство установлено в true, система пытается найти и выбрать объект в указанной точке (заданной через NonInteractivePickPoint) без отображения приглашения и ожидания действий пользователя. Если false — операция работает в стандартном интерактивном режиме.
 Это свойство позволяет переключаться между интерактивным и неинтерактивным режимами выбора, что особенно полезно при автоматизации задач, тестировании или реализации фоновых операций.
 Свойство должно использоваться совместно с NonInteractivePickPoint, иначе попытка неинтерактивного выбора будет игнорироваться или завершится ошибкой.
 Условия
 Чтение и запись
 Ссылки
 HostMgd.EditorInput.PromptNestedEntityOptions, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!