Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PublishSheetEventArgs.PlotBoundsMinX
 Послать отзыв
 This is PlotBoundsMinX, a member of class PublishSheetEventArgs.
 Синтаксис
C#
Visual Basic
public double PlotBoundsMinX;
Public Property PlotBoundsMinX() As Double
 Ссылки
 PublishSheetEventArgs Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!