Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.Document.TransactionManager
 Послать отзыв
 Свойство предоставляет доступ к объекту диспетчера транзакций для этого документа.
 Синтаксис
C#
Visual Basic
Копировать Код
public HostMgd.ApplicationServices.TransactionManager TransactionManager;
Public Property TransactionManager() As HostMgd.ApplicationServices.TransactionManager
 Возвращает
 Полученный диспетчер транзакций документа. Тип HostMgd.ApplicationServices.TransactionManager
 Описание
 Свойство предоставляет доступ к объекту диспетчера транзакций для этого документа. Если приложение открывает объекты более чем из одного документа одновременно и использует транзакции, оно должно запустить отдельную транзакцию для каждого документа, используя диспетчер транзакций для каждого документа.
 Условия
 Только чтение
 Ссылки
 HostMgd.ApplicationServices.Document, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!