Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PublishSheetEventArgs.UniqueLayoutId
 Послать отзыв
 This is UniqueLayoutId, a member of class PublishSheetEventArgs.
 Синтаксис
C#
Visual Basic
public System.String UniqueLayoutId;
Public Property UniqueLayoutId() As System.String
 Ссылки
 PublishSheetEventArgs Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!