Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.GraphicsSystem.Manager.CreateAutoCADDevice
 Послать отзыв
 Метод создает объект Teigha.GraphicsSystem.Device с заданным дескриптором окна, в котором отображается чертеж.
 Синтаксис
C#
Visual Basic
Копировать Код
public Teigha.GraphicsSystem.Device CreateAutoCADDevice( System.IntPtr hwnd );
Копировать Код
Public Function CreateAutoCADDevice( hwnd As System.IntPtr ) As Teigha.GraphicsSystem.Device
 Параметры
 Параметры
 Описание
 hwnd
 Входной дескриптор окна. Тип System.IntPtr.
 Возвращает
 Возвращает созданный объект типа Teigha.GraphicsSystem.Device.
 Описание
 Метод создаёт устройство как объект Teigha.GraphicsSystem.Device с заданным дескриптором окна hwnd. Дескриптор hwnd представляет окно графического интерфейса, используемого графической системой для отрисовки объектов чертежа.
 Ссылки
 HostMgd.GraphicsSystem.Manager, HostMgd.GraphicsSystem
 Ваши комментарии по поводу этого топика: Послать отзыв!