Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.PlotConfig.DeviceName
 Послать отзыв
 Свойство DeviceName возвращает имя устройства вывода. Не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public System.String DeviceName;
Копировать Код
Public ReadOnly Property DeviceName As System.String
 Возвращает
 Возвращает имя устройства вывода. Тип System.String.
 Описание
 Свойство DeviceName возвращает имя текущего устройства вывода или имя PC3-файла.
 В текущей версии не реализовано.
 Замечания
 Это свойство всегда возвращает короткое имя PC3-файла. Чтобы получить полный путь к PC3-файлу, используйте свойство FullPath.
 Условия
 Только чтение.
 Ссылки
 HostMgd.PlottingServices.PlotConfig, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!