Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.Regen()
 Послать отзыв
 Метод выполняет принудительную регенерацию (перерисовку) чертежа в активном документе.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Regen();
Копировать Код
Public Sub Regen()
 Описание
 Метод используется для обновления графического представления чертежа, применяя все изменения, внесённые в объекты чертежа, и пересчитывая их отображение на экране. Это может быть полезно после выполнения операций, изменяющих геометрию или параметры отображения объектов, чтобы обеспечить корректное визуальное представление чертежа в текущем виде.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("RegenExample")] public void RegenExample() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Вызываем метод editor.Regen(); // Принудительно обновляем отображение чертежа // Выводим сообщение в командную строку editor.WriteMessage("\nЧертёж обновлён."); } }
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!