Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PlotInfo.MergeStatus
 Послать отзыв
 This is MergeStatus, a member of class PlotInfo.
 Синтаксис
C#
Visual Basic
public int MergeStatus;
Public Property MergeStatus() As Integer
 Ссылки
 PlotInfo Класс, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!