Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptPointOptionsEventHandler(object,PromptPointOptionsEventArgs)
 Послать отзыв
 Делегат предназначен для обработки события, возникающего при начале операции ввода точки, и позволяет программно настраивать параметры приглашения.
 Синтаксис
C#
Visual Basic
Копировать Код
public delegate void PromptPointOptionsEventHandler(object sender, PromptPointOptionsEventArgs e);
Копировать Код
Public Delegate Sub PromptPointOptionsEventHandler(sender As Object, e As PromptPointOptionsEventArgs)
 Параметры
 Параметры
 Описание
 sender
 Источник события — обычно экземпляр редактора (Editor), в котором происходит ввод точки. Тип object
 e
 Объект, содержащий данные о параметрах ввода точки:
 Описание
 Делегат используется как сигнатура метода-обработчика для событий, связанных с началом интерактивного ввода точки в nanoCAD — таких как PromptingForCorner или PromptingForPoint. Он позволяет разработчикам надстроек и плагинов изменять параметры ввода, например:
текст приглашения (Message),
базовую точку (BasePoint),
режимы привязки ,
ограничения по вводу .
 Это даёт возможность гибко управлять поведением команды ввода точки, в зависимости от контекста или текущего состояния чертежа.
 Замечания
 Делегат играет важную роль при разработке интерактивных команд, где требуется изменять параметры ввода точки динамически — например, при построении прямоугольных рамок, выборе точек привязки или других графических операциях.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события PromptingForCorner [Teigha.Runtime.CommandMethod("PromptingForCornerExample")] public void PromptingForCornerExample() { // Подписка на событие PromptingForCorner editor.PromptingForCorner += OnEditorPromptingForCorner; } // Реализация отработки события PromptingForCorner private void OnEditorPromptingForCorner(object sender, PromptPointOptionsEventArgs e) { // Изменение текста приглашения e.Options.Message = "Укажите второй угол прямоугольной области."; // Установка базовой точки e.Options.BasePoint = new Point3d(0, 0, 0); // Ограничение ввода только в первом квадранте e.Options.UseBasePoint = true; } }
 Ваши комментарии по поводу этого топика: Послать отзыв!