Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PointFilterEventArgs.Context
 Послать отзыв
 Свойство предоставляет объект, содержащий контекстную информацию о текущей операции ввода точки.
 Синтаксис
C#
Visual Basic
Копировать Код
public InputPointContext Context { get; }
Копировать Код
Public ReadOnly Property Context As InputPointContext
 Возвращает
 Возвращает объект типа InputPointContext, предоставляющий доступ к контексту ввода точки — например:
Текущая система координат (UCS).
Активные режимы привязки.
Маркер (GSMarker) для точечного ввода.
Состояние командной строки и другие параметры.
 Если контекст не определён или событие завершено, может вернуть null.
 Описание
 Свойство возвращает экземпляр класса InputPointContext, который содержит дополнительные данные о контексте интерактивного ввода точки. Оно используется при обработке события PointFilter и позволяет получить информацию о типе ввода, состоянии привязок, текущем маркере графического ввода и других параметрах, влияющих на поведение точки в редакторе nanoCAD.
 Условия
 Только чтение
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события PointFilter [Teigha.Runtime.CommandMethod("PointFilterExample_ContextProp")] public void PointFilterExample_ContextProp() { // Подписка на событие PointFilter editor.PointFilter += OnEditorPointFilter; } // Реализация отработки события PointFilter private void OnEditorPointFilter(object sender, PointFilterEventArgs e) { InputPointContext context = e.Context; if (context != null) { editor.WriteMessage( $"\nТекущий режим привязки: {context.ObjectSnapMask}"); } // Пример: принудительное выравнивание Y-координаты e.Context.ComputedPoint = new Point3d(e.Context.LastPoint.X, 0, e.Context.LastPoint.Z); } }
 Ссылки
 HostMgd.EditorInput.PointFilterEventArgs, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!