Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.InplaceTextEditor.RemoveHightlight
 Послать отзыв
 Метод удаляет подсветку текста в текстовом редакторе. В текущей версии не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public void RemoveHightlight();
Копировать Код
Public Sub RemoveHightlight()
 Описание
 Метод удаляет подсветку текста в текстовом редакторе. В текущей версии не реализован.
 Ссылки
 HostMgd.ApplicationServices.InplaceTextEditor, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!