Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.Windows.ToolPalette.CustomToolBase.GetPropertyWeight
 Послать отзыв
 Метод задает относительный вес (приоритет) категории или свойства на панели инструментов, влияющий на порядок отображения категорий и свойств в пользовательском интерфейсе. Не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void GetPropertyWeight( ref System.Object id, int pPropertyWeight );
Копировать Код
Public Overridable Sub GetPropertyWeight( ByRef id As System.Object, pPropertyWeight As Integer )
 Параметры
 Параметры
 Описание
 id
 Идентификатор свойства (или категории), для которого запрашивается вес. Тип System.Object.
 pPropertyWeight
 Выходной вес указанного свойства. Тип int. Чем выше значение, тем выше приоритет или важность свойства.
 Описание
 Метод используется для получения веса (приоритета) указанного свойства инструмента или категории на панели инструментов. Вес свойства влияет на порядок отображения или важность свойства в пользовательском интерфейсе и используется, например, при сортировке.
 В текущей версии не реализован.
 Ссылки
 HostMgd.Windows.ToolPalette.CustomToolBase, HostMgd.Windows.ToolPalette
 Ваши комментарии по поводу этого топика: Послать отзыв!