Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PlotInfo.DeviceOverride
 Послать отзыв
 Свойство возвращает и устанавливает конфигурацию плоттера используемого при печати
 Синтаксис
C#
Visual Basic
public HostMgd::PlottingServices::PlotConfig DeviceOverride;
Public Property DeviceOverride() As HostMgd.PlottingServices.PlotConfig
 Ссылки
 PlotInfo Класс, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!