Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PromptCornerOptions.LimitsChecked
 Послать отзыв
 Синтаксис
C#
Visual Basic
public bool LimitsChecked;
Public Property LimitsChecked() As bool
 Описание
 Устанавилвает или возвращает признак наличия проверки ограничений при вводе значения.
 Условия
 На чтение и запись
 Ссылки
 PromptCornerOptions Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!