Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.Application.SetChild(IntPtr)
 Послать отзыв
 Метод предназначен для назначения одного окна другому дочерним для главного окна nanoCAD.
 Синтаксис
C#
Visual Basic
public void SetChild(System.IntPtr handleWindow);
Public Sub SetChild(handleWindow As System.IntPtr)
 Параметры
 Параметры
 Описание
 handleWindow
 Окно, которое нужно сделать дочерним для главного окна nanoCAD
 Описание
 Метод устанавливает окно handleWindow дочерним для главного окна nanoCAD.
 Ссылки
 HostMgd.ApplicationServices.Application, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!