Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PaletteSet.TitleBarLocation
 Послать отзыв
 Местонахождение закладок панелей.
 Синтаксис
C#
Visual Basic
public HostMgd::Windows::PaletteSetTitleBarLocation TitleBarLocation;
Public Property TitleBarLocation() As HostMgd.Windows.PaletteSetTitleBarLocation
 Описание
 Слева или справа
 Ссылки
 PaletteSet Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!