Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PlotProgress.IsPlotCancelled
 Послать отзыв
 Индикатор отмены печати.
 Синтаксис
C#
Visual Basic
public bool IsPlotCancelled;
Public Property IsPlotCancelled() As bool
 Описание
 Пользователь может периодически опрашивать это свойство для определения возможности продолжения работы. Только для чтения.
 Ссылки
 PlotProgress Класс, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!