Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.GetAngle(PromptAngleOptions)
 Послать отзыв
 Метод предлагает пользователю ввести угол с учётом текущего значения системной переменной ANGBASE, возвращая результат в виде числового значения угла.
 Синтаксис
C#
Visual Basic
Копировать Код
public PromptDoubleResult GetAngle(PromptAngleOptions options);
Копировать Код
Public Function GetAngle(options As PromptAngleOptions) As PromptDoubleResult
 Параметры
 Параметры
 Описание
 options
 Объект, задающий параметры ввода угла:
 Возвращает
 Возвращает значение типа PromptDoubleResult, представляющее результат ввода угла. Содержит статус операции: OK (успешно), Cancel (отменено пользователем), Error (ошибка) и другие. Если операция успешна, содержит значение угла в радианах (Value типа double). Может использоваться для последующего применения угла в построениях, поворотах и других вычислениях.
 Описание
 Метод используется для интерактивного ввода угла пользователем через командную строку или указатель мыши в графической области nanoCAD. Угол вводится с учетом текущей настройки системной переменной ANGBASE, которая определяет начальное направление угла (обычно угол отсчитывается от оси X). Метод предоставляет гибкие настройки ввода через объект PromptAngleOptions. После завершения операции возвращается результат, содержащий статус и значение введённого угла в радианах.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("GetAngleExample_PromptAngleOptions")] public void GetAngleExample_PromptAngleOptions() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создаём запрос пользователю, чтобы он указал угол на чертеже PromptAngleOptions options = new PromptAngleOptions("\nУкажите угол поворота:"); PromptDoubleResult result = editor.GetAngle(options); // Если пользователь указал все необходимые данные, // выводим в командной строке сообщение if (result.Status == PromptStatus.OK) { double angleInRadians = result.Value; double angleInDegrees = result.Value * 180 / Math.PI; editor.WriteMessage($"\nВведен угол: {angleInRadians} радиан или {angleInDegrees} градусов"); } } }
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!