Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод DocumentLockModeChangedEventArgs.Veto
 Послать отзыв
 Синтаксис
C#
Visual Basic
public void Veto();
Public Sub Veto()
 Описание
 Эта функция может быть вызвана при выполнении метода DocumentLockModeChanged, если он вызван в связи с требованием на блокировку (а не на разблокировку). Результатом выполнения будет то, что запрос на блокировку будет ветирован. Это обычно означает, что команда будет отменена прежде, чем она начнет выполняться. Если данная функция будет вызвана, то будет послано событие DocumentLockModeChangeVetoed.
 Может возникнуть ситуация, когда получатель события DocumentLockModeChanged должен сделать какие-либо изменения в документе до того, как будет принято решение С ветировать событие или нет. До принятия решения, документ будет заблокирован, пока есть возможность ветировать изменения. Это необходимо, потому что невозможно изменить статус блокировки документа изнутри выполнения событий.
 Ссылки
 DocumentLockModeChangedEventArgs Класс, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!