Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.Windows.ToolPalette.CustomToolBase
 Послать отзыв
 Класс CustomToolBase является абстрактным классом, который определяет универсальный пользовательский инструмент, пригодный для реализации инструмента любого типа, поддерживаемого панелями инструментов. В текущей версии не реализован.
 Иерархия классов
HostMgd::Windows::ToolPalette::CustomToolBase
 Синтаксис
C#
Visual Basic
Копировать Код
public class CustomToolBase : IDisposable
Копировать Код
Public Class CustomToolBase Implements IDisposable
 Описание
 Класс CustomToolBase является абстрактным классом, который определяет универсальный пользовательский инструмент, пригодный для реализации инструмента любого типа, поддерживаемого панелями инструментов. Класс обеспечивает поддержку ряда характерных для инструментов интерфейсов и предоставляет шаблоны создания пользовательских инструментов.
 В текущей версии не реализован.
 Методы
 Конструкторы
 Имя
 Описание
 CustomToolBase
 Конструктор по умолчанию класса CustomToolBase.
 Топики
 Имя
 Описание
 CustomToolBase Методы
 Ниже перечислены методы класса CustomToolBase.
 CustomToolBase Свойства
 Ниже перечислены свойства класса CustomToolBase.
 Ссылки
 CustomToolBase Методы, CustomToolBase Свойства, Методы, Топики, CustomToolBase Методы, CustomToolBase Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!