Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство KeywordCollection.Item
 Послать отзыв
 This is Item, a member of class KeywordCollection.
 Синтаксис
C#
Visual Basic
public HostMgd::EditorInput::Keyword Item;
Public Property Item() As HostMgd.EditorInput.Keyword
 Ссылки
 KeywordCollection Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!