Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство StatusBarItem.Enabled
 Послать отзыв
 This is Enabled, a member of class StatusBarItem.
 Синтаксис
C#
Visual Basic
public bool Enabled;
Public Property Enabled() As bool
 Ссылки
 StatusBarItem Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!