Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.InplaceTextEditor.Current
 Послать отзыв
 Свойство Current возвращает текущий активный объект встроенного текстового редактора. В текущей версии не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public static InplaceTextEditor Current;
Копировать Код
Public Shared ReadOnly Property Current As InplaceTextEditor
 Возвращает
 Возвращает объект встроенного текстового редактора. Тип InplaceTextEditor.
 Описание
 Свойство Current возвращает текущий активный объект встроенного текстового редактора. В текущей версии не реализовано.
 Условия
 Только чтение.
 Ссылки
 HostMgd.ApplicationServices.InplaceTextEditor, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!