Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод IConfigurationSection.DeleteSubsection
 Послать отзыв
 Синтаксис
C#
Visual Basic
void DeleteSubsection(ref String name);
Sub DeleteSubsection(ByRef name As String)
 Параметры
 Параметры
 Описание
 name
 Имя удаляемой подсекции
 Описание
 Этот метод должен быть разработан для удаления конфигурационной подсекции с именем name.
 Ссылки
 IConfigurationSection Интерфейс, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!