Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Pane.Style
 Послать отзыв
 This is Style, a member of class Pane.
 Синтаксис
C#
Visual Basic
public HostMgd::Windows::PaneStyles Style;
Public Property Style() As HostMgd.Windows.PaneStyles
 Ссылки
 Pane Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!