Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор MenuItem.MenuItem (System::String^, System::Drawing::Icon^)
 Послать отзыв
 This is MenuItem, a member of class MenuItem.
 Синтаксис
C#
Visual Basic
public MenuItem(ref System.String value, ref System.Drawing.Icon icon);
Public Sub New(ByRef value As System.String, ByRef icon As System.Drawing.Icon)
 Ссылки
 MenuItem Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!