Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Перечисление HostMgd.Windows.ColorDialog.ColorTabs
 Послать отзыв
 This is record HostMgd::Windows::ColorDialog::ColorTabs.
 Синтаксис
C#
Visual Basic
[Flags] public enum ColorTabs { ACITab = 1, TrueColorTab = 2 }
<Flags> Public Enum ColorTabs ACITab = 1 TrueColorTab = 2 End Enum
 Ваши комментарии по поводу этого топика: Послать отзыв!