Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptAngleOptions.PromptAngleOptions(string)
 Послать отзыв
 Конструктор инициализирует новый экземпляр класса с указанным приглашающим сообщением.
 Синтаксис
C#
Visual Basic
Копировать Код
public PromptAngleOptions(string message);
Копировать Код
Public Sub New(message As String)
 Параметры
 Параметры
 Описание
 message
 Текст приглашения, выводимый в командной строке перед началом ввода угла.
 Например
 "Введите угол поворота:". Тип string
 Описание
 Конструктор создаёт объект PromptAngleOptions, который используется для настройки параметров интерактивного ввода угла в nanoCAD. Он устанавливает текст приглашения, отображаемый пользователю в командной строке, и инициализирует остальные параметры по умолчанию. После создания объекта можно дополнительно задать такие параметры, как начальное значение, допустимый диапазон, тип курсора и другие, чтобы управлять поведением команды ввода угла.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("PromptAngleOptionsExample_String")] public void PromptAngleOptionsExample_String() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создаём запрос пользователю, чтобы он указал угол на чертеже PromptAngleOptions options = new PromptAngleOptions("\nУкажите угол поворота:"); // Вызов метода GetAngle, запрашивающего угол у пользователя PromptDoubleResult result = editor.GetAngle(options); // Если пользователь указал все необходимые данные, // выводим в командной строке сообщение if (result.Status == PromptStatus.OK) { double angleInRadians = result.Value; double angleInDegrees = result.Value * 180 / Math.PI; editor.WriteMessage($"\nВведен угол: {angleInRadians} радиан или {angleInDegrees} градусов"); } } }
 Ссылки
 HostMgd.EditorInput.PromptAngleOptions, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!