Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PublishSheetEventArgs.PrintableBoundsY
 Послать отзыв
 This is PrintableBoundsY, a member of class PublishSheetEventArgs.
 Синтаксис
C#
Visual Basic
public double PrintableBoundsY;
Public Property PrintableBoundsY() As Double
 Ссылки
 PublishSheetEventArgs Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!