Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.BeginPageEventArgs.PlotPageInfo
 Послать отзыв
 Свойство PlotPageInfo представляет характеристики печатаемой страницы.
 Синтаксис
C#
Visual Basic
Копировать Код
public HostMgd.PlottingServices.PlotPageInfo PlotPageInfo;
Копировать Код
Public ReadOnly Property PlotPageInfo As HostMgd.PlottingServices.PlotPageInfo
 Возвращает
 Возвращает характеристики печатаемой страницы. Тип HostMgd.PlottingServices.PlotPageInfo.
 Описание
 Свойство PlotPageInfo представляет ряд характеристик печатаемой страницы, которые инкапсулируются объектом HostMgd.PlottingServices.PlotPageInfo (например, количество на странице различных объектов).
 Условия
 Только чтение.
 Ссылки
 HostMgd.PlottingServices.BeginPageEventArgs, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!