Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.SelectCrossingWindow(Point3d,Point3d,SelectionFilter)
 Послать отзыв
 Метод возвращает набор объектов, находящихся внутри или пересекающих прямоугольное окно, заданное двумя точками, и соответствующих указанному фильтру.
 Синтаксис
C#
Visual Basic
Копировать Код
public PromptSelectionResult SelectCrossingWindow(Point3d pt1, Point3d pt2, SelectionFilter filter);
Копировать Код
Public Function SelectCrossingWindow(pt1 As Point3d, pt2 As Point3d, filter As SelectionFilter) As PromptSelectionResult
 Параметры
 Параметры
 Описание
 pt1
 Первая угловая точка прямоугольного окна в мировых координатах (WCS). Тип Point3d.
 pt2
 Вторая угловая точка, противоположная первой, которая вместе с pt1 определяет область окна. Тип Point3d.
 filter
 Фильтр, задающий условия для выбираемых объектов. Может включать проверки по типу объекта, слою, цвету и другим свойствам. Если фильтр равен null, учитываются все объекты, попадающие в окно. Тип SelectionFilter.
 Возвращает
 Возвращает объект типа PromptSelectionResult, содержащий:
Status — статус выполнения (OK, Cancel, Error и др.). При успешной выборке статус равен PromptStatus.OK.
Value — объект типа SelectionSet, содержащий список идентификаторов (ObjectId) выбранных объектов, удовлетворяющих условиям окна и фильтра.
StringResult — строковое значение.
 Если ни один объект не удовлетворяет условиям выборки, Value может быть null.
 Описание
 Метод используется для выборки геометрических объектов чертежа, которые попадают в прямоугольную область, заданную двумя противоположными угловыми точками. Объекты выбираются как по пересечению с границей окна, так и по нахождению внутри него. При этом дополнительно применяется фильтр, который позволяет ограничить выборку только объектами, удовлетворяющими определённым критериям (тип, слой, цвет и т. д.).
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("SelectCrossingWindowExample_Point3d_Point3d_SelectionFilter")] public void SelectCrossingWindowExample_Point3d_Point3d_SelectionFilter() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создание точек углов области, внутри которой необходимо выбрать объекты Point3d corner1 = new Point3d(0, 0, 0); Point3d corner2 = new Point3d(200, 200, 0); // Фильтр: выбрать только объекты типа Circle SelectionFilter filter = new SelectionFilter(new TypedValue[] { new TypedValue((int)DxfCode.Start, "CIRCLE") }); // Вызываем метод PromptSelectionResult result = editor.SelectCrossingWindow(corner1, corner2, filter); // Выводим сообщение в командную строку if (result.Status == PromptStatus.OK) { SelectionSet selSet = result.Value; editor.WriteMessage( $"\nВыбрано окружностей: {selSet.Count}"); } else { editor.WriteMessage( "\nНе найдено объектов, удовлетворяющих условиям."); } } }
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!