Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PlotInfo.ValidatedSettings
 Послать отзыв
 Синтаксис
C#
Visual Basic
public Teigha::DatabaseServices::PlotSettings ValidatedSettings;
Public Property ValidatedSettings() As Teigha.DatabaseServices.PlotSettings
 Ссылки
 PlotInfo Класс, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!