Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Событие Application.QuitWillStart
 Послать отзыв
 Событие, возникающее после выполнения события BeginQuit непосредственно перед завершением работы приложения.
 Синтаксис
C#
Visual Basic
public event System.EventHandler QuitWillStart;
Public Event QuitWillStart As System.EventHandler
 Описание
 Событие возникает после выполнения события BeginQuit непосредственно перед завершением работы приложения.
 Ссылки
 HostMgd.ApplicationServices.Application, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!