Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PublishSheetEventArgs.PlotBoundsMaxX
 Послать отзыв
 This is PlotBoundsMaxX, a member of class PublishSheetEventArgs.
 Синтаксис
C#
Visual Basic
public double PlotBoundsMaxX;
Public Property PlotBoundsMaxX() As Double
 Ссылки
 PublishSheetEventArgs Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!