Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Keyword.IsReadOnly
 Послать отзыв
 Синтаксис
C#
Visual Basic
public bool IsReadOnly;
Public Property IsReadOnly() As bool
 Описание
 Свойство возвращает или устанавливает, может ли ключевое слово использоваться в режиме "только для чтения".
 Свойство имеет значение true, если ключевое слово может использоваться в режиме "только для чтения". По умолчанию свойство имеет значение false.
 Условия
 На чтение и запись
 Ссылки
 Keyword Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!