Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Keyword.Enabled
 Послать отзыв
 Синтаксис
C#
Visual Basic
public bool Enabled;
Public Property Enabled() As bool
 Описание
 Свойство возвращает или устанавливает, может ли в текущее время использоваться ключевое слово. Если ключевое слово не может использоваться, пользователь не может выбрать его. Значение true означает, что ключевое слово может быть выбрано пользователем.
 Условия
 На чтение и запись
 Ссылки
 Keyword Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!