Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство IConfigurationSection.IsReadOnly
 Послать отзыв
 Синтаксис
C#
Visual Basic
bool IsReadOnly;
Property IsReadOnly() As bool
 Описание
 Возвращает признак того, является ли объект доступным только на чтение.
 Условия
 Только на чтение
 Ссылки
 IConfigurationSection Интерфейс, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!