Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.Windows.ToolPalette.CustomToolBase.ShowProperty
 Послать отзыв
 Метод позволяет динамически управлять отображением свойства инструмента. Не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void ShowProperty( int dispatchId, int show );
Копировать Код
Public Overridable Sub ShowProperty( dispatchId As Integer, show As Integer )
 Параметры
 Параметры
 Описание
 dispatchId
 Входной диспетчерский идентификатор свойства. Тип int.
 show
 Флаг, указывающий, отображается ли свойство. Тип int.
 Описание
 Метод позволяет управлять отображением свойства инструмента во время выполнения. Это бывает полезно, если некоторые свойства не должны быть видны или не имеют смысла, исходя из значения другого свойства.
 В текущей версии не реализован.
 Ссылки
 HostMgd.Windows.ToolPalette.CustomToolBase, HostMgd.Windows.ToolPalette
 Ваши комментарии по поводу этого топика: Послать отзыв!