Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.InplaceTextEditor
 Послать отзыв
 Класс InplaceTextEditor представляет встроенный текстовый редактор nanoCAD. В текущей версии не реализован.
 Иерархия классов
HostMgd::ApplicationServices::InplaceTextEditor
 Синтаксис
C#
Visual Basic
Копировать Код
public class InplaceTextEditor;
Копировать Код
Public Class InplaceTextEditor
 Описание
 Класс InplaceTextEditor представляет встроенный текстовый редактор nanoCAD. В текущей версии не реализован.
 Замечания
 Пользователь обращается к этому редактору, как правило, через объекты MTEXT или TEXT.
 Топики
 Имя
 Описание
 InplaceTextEditor Перечисления
 Ниже перечислены перечисления класса InplaceTextEditor.
 InplaceTextEditor Методы
 Ниже перечислены методы класса InplaceTextEditor.
 InplaceTextEditor Свойства
 Ниже перечислены свойства класса InplaceTextEditor.
 Ссылки
 InplaceTextEditor Перечисления, InplaceTextEditor Методы, InplaceTextEditor Свойства, Топики, InplaceTextEditor Перечисления, InplaceTextEditor Методы, InplaceTextEditor Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!