Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство AboutToBeginPublishingEventArgs.JobWillPublishInBackground
 Послать отзыв
 This is JobWillPublishInBackground, a member of class AboutToBeginPublishingEventArgs.
 Синтаксис
C#
Visual Basic
public bool JobWillPublishInBackground;
Public Property JobWillPublishInBackground() As bool
 Ссылки
 AboutToBeginPublishingEventArgs Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!