Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.DsdData.SheetSetName
 Послать отзыв
 Свойство SheetSetName представляет имя подшивки. Не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public System.String SheetSetName;
Копировать Код
Public Property SheetSetName As System.String
 Возвращает
 Возвращает имя подшивки. Тип System.String.
 Описание
 Свойство SheetSetName представляет имя подшивки. Это поле хранится в файле DSD и имеет значение только в случае публикации подшивки.
 В текущей версии не реализовано.
 Условия
 Чтение и запись.
 Ссылки
 HostMgd.PlottingServices.DsdData, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!