Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.InplaceTextEditor.CanCopy
 Послать отзыв
 Свойство CanCopy позволяет проверить, возможно ли копирование текста в данном текстовом редакторе. В текущей версии не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool CanCopy;
Копировать Код
Public ReadOnly Property CanCopy As Boolean
 Возвращает
 Возвращает true, если копирование текста разрешено. В противном случае возвращает false.
 Описание
 Свойство CanCopy позволяет проверить, возможно ли копирование текста в данном текстовом редакторе. В текущей версии не реализовано.
 Условия
 Только чтение.
 Ссылки
 HostMgd.ApplicationServices.InplaceTextEditor, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!