Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.PlotInfoValidator.Validate
 Послать отзыв
 Метод выполняет проверку листа (layout), переопределений параметров печати и переопределений устройств печати для входного объекта PlotInfo.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Validate( ref HostMgd.PlottingServices.PlotInfo info );
Копировать Код
Public Sub Validate( ByRef info As HostMgd.PlottingServices.PlotInfo )
 Параметры
 Параметры
 Описание
 info
 Проверяемые настройки печати в объекте типа HostMgd.PlottingServices.PlotInfo.
 Описание
 Метод выполняет проверку листа (layout), переопределений параметров печати и переопределений устройств печати для входного объекта PlotInfo. Если валидация прошла успешно, объект PlotInfo помечается как проверенный и в нём сохраняются проверенные параметры PlotSettings и PlotConfig.
 Замечания
 Валидатор выполняет следующие проверки согласованности настроек печати:
Проверка, что идентификатор слоя не нулевой.
Проверка, что устройство вывода существует и не является устройством «None».
Проверяет, что носитель (размер) существует на устройстве. (Если носитель отсутствует на устройстве, валидатор может попытаться найти подходящий носитель или создать пользовательский носитель в зависимости от текущей политики соответствия носителей.)
Проверяет, что лист чертежа (layout) и переопределения настроек печати имеют одинаковое свойство modelType.
Если в листе чертежа или переопределениях настроек печати указана таблица стилей печати, проверяет, существует ли таблица стилей печати и совместима ли она с режимом рисования (например, CTB/STB).
Если областью печати является вид (View), то проверяет, существует ли такой вид на чертеже.
Если область печати определяется окном (Window), проверяет, указано ли допустимое окно.
Если область печати определяется листом (Layout), проверяет, относится ли этот лист к пространству листа (Пространству модели соответствует значение false).
 Валидатор также регистрирует предупреждения при следующих условиях:
Если размер носителя не изменился, но изменились единицы измерения, а при этом смещение бумаги и масштаб не изменились на соответствующий коэффициент (в зависимости от отношения новых и старых единиц измерения).
Если альбомная/книжная ориентация исходного листа (layout) отличается от проверенных настроек.
 Алгоритм валидации поддерживает политики сопоставления форматов (размеров) бумаги. В зависимости от настройки политики валидатор может попытаться найти соответствующий размер бумаги, если каноническое имя носителя, указанное в листе (layout) или переопределениях, отсутствует на устройстве. На случай сбоя алгоритма сопоставления в валидаторе предусмотрена попытка создания пользовательского размера бумаги (если это возможно). Если политика допускает такие сценарии, и они успешно выполняются, валидированные параметры обновляются с тем, чтобы содержать корректное каноническое имя носителя, размер носителя и границы печати (поля), которые могут отличаться как от исходного формата листа, так и от любых переопределений параметров печати.
 Ссылки
 HostMgd.PlottingServices.PlotInfoValidator, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!