Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.GetCorner(String,Point3d)
 Послать отзыв
 Метод позволяет пользователю указать вторую угловую точку прямоугольника относительно заданной начальной точки, с отображением указанного сообщения.
 Синтаксис
C#
Visual Basic
Копировать Код
public PromptPointResult GetCorner(String message, Point3d basePoint);
Копировать Код
Public Function GetCorner(message As String, basePoint As Point3d) As PromptPointResult
 Параметры
 Параметры
 Описание
 message
 Сообщение, отображаемое в командной строке для приглашения пользователя к выбору угла прямоугольника (например, "Укажите противоположный угол:"). Тип String.
 basePoint
 Начальная точка прямоугольника, относительно которой будет определяться прямоугольное направление при вводе второй точки. Тип Point3d.
 Возвращает
 Возвращает объект типа PromptPointResult, который содержит:
Status — статус операции (OK, Cancel, Error и др.).
Value — значение точки (Point3d), если ввод был успешным.
StringResult — строковое представление введённых данных (если использовался ручной ввод).
 Описание
 Метод используется для интерактивного ввода второй угловой точки прямоугольника. Пользователь может указать точку мышью на чертеже или ввести координаты вручную. При этом обеспечивается прямоугольное выравнивание по осям X и Y относительно начальной точки (аналогично поведению команды RECTANG). Метод выводит заданное текстовое приглашение и возвращает результат в виде объекта PromptPointResult.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("GetCornerExample_String_Point3d")] public void GetCornerExample_String_Point3d() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создаём запрос пользователю Point3d basePt = new Point3d(100, 100, 0); PromptPointResult result = editor.GetCorner("\nУкажите противоположный угол:", basePt); // Если пользователь указал все данные, выводим сообщение в командой строке if (result.Status == PromptStatus.OK) { Point3d corner = result.Value; editor.WriteMessage( $"\nВыбранная точка: {corner}"); } } }
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!