Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.PromptedForAngle
 Послать отзыв
 Событие возникает после завершения операции ввода угла пользователем в редакторе nanoCAD. Событие не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public event PromptDoubleResultEventHandler PromptedForAngle;
Копировать Код
Public Event PromptedForAngle As PromptDoubleResultEventHandler
 Описание
 Событие инициируется, когда пользователь завершил ввод значения угла через командную строку или графический интерфейс. Оно используется для получения результата ввода, например, при вызове метода GetAngle(). Событие позволяет обработать результат ввода — проверить значение, выполнить действия на основе введённого угла или отреагировать на отмену операции.
 Это событие является частью последовательности, связанной с вводом угла:
Вызов метода GetAngle() и начало ввода.
Завершение ввода и вызов события PromptedForAngle.
 Событие реализуется через делегат PromptDoubleResultEventHandler, который предоставляет доступ к объекту PromptDoubleResult, содержащему статус операции и введённое пользователем значение.
 Замечания
 Событие полезно при разработке пользовательских команд, требующих точного ввода угловых значений, и позволяет реагировать на результат ввода сразу после его завершения.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события PromptedForAngle [Teigha.Runtime.CommandMethod("PromptedForAngleExample")] public void PromptedForAngleExample() { // Подписка на событие PromptedForAngle editor.PromptedForAngle += OnEditorPromptedForAngle; } // Реализация отработки события PromptedForAngle private void OnEditorPromptedForAngle(object sender, PromptDoubleResultEventArgs e) { // Вывод сообщения в командную строку if (e.Result.Status == PromptStatus.OK) { editor.WriteMessage( $"\nВведённый угол (радианы): {e.Result.Value}"); } else { editor.WriteMessage( "\nВвод угла отменён или произошла ошибка."); } } }
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!