Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.RecentDocument.IsPinned
 Послать отзыв
 Свойство IsPinned позволяет определить, закреплен ли документ на начальной странице или в меню приложений. В текущей версии данное свойство не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsPinned;
Копировать Код
Public Property IsPinned As Boolean
 Возвращает
 Возвращает true, если документ закреплён на начальной странице или в меню приложений. В противном случае возвращает false.
 Описание
 Свойство IsPinned позволяет определить, закреплен ли документ на начальной странице или в меню приложений.
 В текущей версии данное свойство не реализовано.
 Условия
 Чтение и запись.
 Ссылки
 HostMgd.ApplicationServices.RecentDocument, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!