Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.Application.StatusBar
 Послать отзыв
 СВОЙСТВО НЕ РЕАЛИЗОВАНО. ВСЕГДА ВОЗВРАЩАЕТ NULL.
 Синтаксис
C#
Visual Basic
Копировать Код
public static StatusBar StatusBar
Копировать Код
Public Shared ReadOnly Property StatusBar As StatusBar
 Ссылки
 HostMgd.ApplicationServices.Application, HostMgd.ApplicationServices Пространство имен
 Исключения
 MGD NOT_IMPLEMENTED
 Ваши комментарии по поводу этого топика: Послать отзыв!