Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.Windows.ToolPalette.CatalogItem
 Послать отзыв
 Класс CatalogItem является базовым классом для всех элементов каталога, инкапсулируя их общие свойства и поведение.
 Иерархия классов
HostMgd::Windows::ToolPalette::CatalogItem
 Синтаксис
C#
Visual Basic
Копировать Код
public class CatalogItem : DisposableWrapper
Копировать Код
Public Class CatalogItem Inherits DisposableWrapper
 Описание
 Класс CatalogItem является базовым классом для всех элементов каталога. Он инкапсулирует общие свойства и поведение элементов.
 Этот класс используется для создания и реализации следующих элементов каталога:
инструмент (Tool),
пакет (Package),
панель инструментов (Palette),
категория (Category),
каталог (Catalog),
стандартный инструмент (Stock Tool).
 Топики
 Имя
 Описание
 CatalogItem Методы
 Ниже перечислены методы класса CatalogItem.
 Ссылки
 CatalogItem Методы, Топики, CatalogItem Методы
 Ваши комментарии по поводу этого топика: Послать отзыв!