Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.CustomSizeResults
 Послать отзыв
 Данное перечисление определяет флаги возврата из метода PlotInfoValidator.IsCustomPossible().
 Синтаксис
C#
Visual Basic
Копировать Код
public enum CustomSizeResults { Possible = 0x0, MustCreatePC3 = 0x1, RotationRequired = 0x2, PC3DirReadOnly = 0x4, PmpDirReadOnly = 0x8, PmpDirMissing = 0x10, UnknownErrPmpDir = 0x20, PC3FileReadOnly = 0x40, SizeTooBig = 0x80, Exception = 0x100, UnknownErrPC3File = 0x200, UnknownErrPmpFile = 0x400, PmpFileReadOnly = 0x800, WidthAndHeightMustBePositive = 0x1000, DeviceLoadFailed = 0x2000 }
Копировать Код
Public Enum CustomSizeResults Possible = 0x0 MustCreatePC3 = 0x1 RotationRequired = 0x2 PC3DirReadOnly = 0x4 PmpDirReadOnly = 0x8 PmpDirMissing = 0x10 UnknownErrPmpDir = 0x20 PC3FileReadOnly = 0x40 SizeTooBig = 0x80 Exception = 0x100 UnknownErrPC3File = 0x200 UnknownErrPmpFile = 0x400 PmpFileReadOnly = 0x800 WidthAndHeightMustBePositive = 0x1000 DeviceLoadFailed = 0x2000 End Enum
 Члены
 Члены
 Описание
 DeviceLoadFailed
 Значение: 8192 (0x2000). Не удалось загрузить устройство, указанное в параметрах листа (layout), или переопределение устройства, чтобы определить, поддерживает ли оно пользовательские размеры бумаги.
 Exception
 Значение: 256 (0x100). Произошло исключение.
 MustCreatePC3
 Значение: 1 (0x1). Файл PC3 для данной конфигурации не существует; его необходимо создать.
 PC3DirReadOnly
 Значение: 4 (0x4). Каталог PC3 доступен только для чтения; пользовательские размеры невозможны.
 PC3FileReadOnly
 Значение: 64 (0x40). Файл PC3 доступен только для чтения. Пользовательские размеры бумаги доступны только при условии создания временного PC3-файла.
 PmpDirMissing
 Значение: 16 (0x10). Каталог PMP не существует; пользовательские размеры невозможны.
 PmpDirReadOnly
 Значение: 8 (0x8). Каталог PMP доступен только для чтения; пользовательские размеры невозможны.
 PmpFileReadOnly
 Значение: 2048 (0x800). Файл PMP доступен только для чтения. Пользовательские размеры бумаги доступны только при условии создания временного PMP-файла.
 Possible
 Значение: 0 (0x0). Пользовательский размер возможен.
 RotationRequired
 Значение: 2 (0x2). Размер допустим, но при условии разворота бумажного носителя на 90 градусов.
 SizeTooBig
 Значение: 128 (0x80). Размер страницы слишком велик для данного устройства.
 UnknownErrPC3File
 Значение: 512 (0x200). С файлом PC3 произошла неизвестная ошибка; пользовательские размеры невозможны.
 UnknownErrPmpDir
 Значение: 32 (0x20). В каталоге PMP произошла неизвестная ошибка; пользовательские размеры невозможны.
 UnknownErrPmpFile
 Значение: 1024 (0x400). С файлом PMP произошла неизвестная ошибка; пользовательские размеры невозможны.
 WidthAndHeightMustBePositive
 Значение: 4096 (0x1000). Значения ширины и высоты страницы должны быть положительными.
 Описание
 Перечисление CustomSizeResults определяет флаги возврата из метода PlotInfoValidator.IsCustomPossible().
 Ваши комментарии по поводу этого топика: Послать отзыв!