Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptDistanceOptionsEventArgs.Options
 Послать отзыв
 Свойство предоставляет доступ к параметрам ввода расстояния, используемым при интерактивной команде.
 Синтаксис
C#
Visual Basic
Копировать Код
public PromptDistanceOptions Options { get; }
Копировать Код
Public ReadOnly Property Options As PromptDistanceOptions
 Возвращает
 Возвращает объект типа PromptDistanceOptions, содержащий параметры ввода расстояния. Если параметры не были инициализированы, может вернуть null.
 Описание
 Свойство редназначено для получения объекта PromptDistanceOptions, который содержит настройки команды ввода расстояния — такие как сообщение, начальное значение, допустимый диапазон и режимы ввода. Оно используется, например, в событии PromptingForDistance, чтобы дать разработчику возможность изменить параметры ввода перед началом взаимодействия с пользователем.
 Свойство позволяет настраивать:
сообщение приглашения (Message),
значение по умолчанию (DefaultValue),
возможность пропуска ввода (AllowNone) и другие параметры.
 Это свойство особенно полезно при разработке интерактивных команд, где требуется гибкая настройка поведения ввода расстояния в зависимости от контекста или состояния чертежа.
 Условия
 Только чтение
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события PromptingForDistance [Teigha.Runtime.CommandMethod("PromptingForDistanceExample_Options")] public void PromptingForDistanceExample_Options() { // Подписка на событие PromptingForDistance editor.PromptingForDistance += OnEditorPromptingForDistance; } // Реализация отработки события PromptingForDistance private void OnEditorPromptingForDistance(object sender, PromptDistanceOptionsEventArgs e) { // Сохраняем параметры запроса в переменную PromptDistanceOptions eOptions = e.Options; // Установка начального значения расстояния eOptions.DefaultValue = 100.0; // Задание сообщения приглашения eOptions.Message = "Введите расстояние для смещения:"; } }
 Ссылки
 HostMgd.EditorInput.PromptDistanceOptionsEventArgs, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!