Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод OpenFileDialog.ShowDialog
 Послать отзыв
 Открытие диалога
 Синтаксис
C#
Visual Basic
public System.Windows.Forms.DialogResult ShowDialog();
Public Function ShowDialog() As System.Windows.Forms.DialogResult
 Ссылки
 OpenFileDialog Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!