Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор OpenFileDialog.OpenFileDialog
 Послать отзыв
 Конструктор класса
 Синтаксис
C#
Visual Basic
public OpenFileDialog(ref System.String title, ref System.String defaultName, ref System.String extension, ref System.String dialogName, OpenFileDialog.OpenFileDialogFlags flags);
Public Sub New(ByRef title As System.String, ByRef defaultName As System.String, ByRef extension As System.String, ByRef dialogName As System.String, flags As OpenFileDialog.OpenFileDialogFlags)
 Ссылки
 OpenFileDialog Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!