Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PlotProgress.LowerSheetProgressRange
 Послать отзыв
 Нижняя граница индикатора печати страницы.
 Синтаксис
C#
Visual Basic
public int LowerSheetProgressRange;
Public Property LowerSheetProgressRange() As Integer
 Описание
 Ссылки
 PlotProgress Класс, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!