Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство CommandEventArgs.GlobalCommandName
 Послать отзыв
 В свойстве хранится имя команды, которая вызвала событие в документе.
 Синтаксис
C#
Visual Basic
public System.String GlobalCommandName;
Public Property GlobalCommandName() As System.String
 Возвращает
 Название команды. Тип String.
 Описание
 В свойстве хранится имя команды, которая вызвала событие в документе.
 Условия
 Только чтение.
 Ссылки
 CommandEventArgs Класс, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!