Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор JigPrompts.JigPrompts
 Послать отзыв
 Конструктор класса
 Синтаксис
C#
Visual Basic
internal JigPrompts(ref HostMgd.EditorInput.Jig jig);
Friend Sub New(ByRef jig As HostMgd.EditorInput.Jig)
 Параметры
 Параметры
 Описание
 jig
 Ссылка на экземпляр объекта, создаваемого или изменяемого по технологии Jig
 Описание
 Конструктор класса
 Ссылки
 JigPrompts Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!