Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.SelectCrossingWindow(Point3d,Point3d)
 Послать отзыв
 Метод возвращает набор объектов, которые пересекают или находятся внутри прямоугольного окна, заданного двумя противоположными угловыми точками.
 Синтаксис
C#
Visual Basic
Копировать Код
public PromptSelectionResult SelectCrossingWindow(Point3d pt1, Point3d pt2);
Копировать Код
Public Function SelectCrossingWindow(pt1 As Point3d, pt2 As Point3d) As PromptSelectionResult
 Параметры
 Параметры
 Описание
 pt1
 Первая точка, задающая один из углов прямоугольного окна. Тип Point3d.
 pt2
 Вторая точка, задающая противоположный угол прямоугольного окна. Тип Point3d.
 Возвращает
 Возвращает объект типа PromptSelectionResult, содержащий:
Status — статус выполнения (OK, Cancel, Error и др.). Если выборка успешна, статус равен PromptStatus.OK.
Value — объект типа SelectionSet, содержащий список идентификаторов (ObjectId) выбранных объектов.
StringResult — строковое значение.
 Если ни один объект не попал в окно выбора, Value может быть null.
 Описание
 Метод используется для интерактивной выборки геометрических объектов чертежа, находящихся внутри или пересекающих прямоугольную область. Прямоугольник определяется двумя точками — противоположными углами окна в мировой системе координат (WCS). Объекты, полностью или частично попадающие в эту область, включаются в результат выборки.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("SelectCrossingWindowExample_Point3d_Point3d")] public void SelectCrossingWindowExample_Point3d_Point3d() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создание точек углов области, внутри которой необходимо выбрать объекты Point3d corner1 = new Point3d(0, 0, 0); Point3d corner2 = new Point3d(100, 100, 0); // Вызываем метод PromptSelectionResult result = editor.SelectCrossingWindow(corner1, corner2); // Выводим сообщение в командную строку if (result.Status == PromptStatus.OK) { SelectionSet selSet = result.Value; editor.WriteMessage( $"\nВыбрано объектов: {selSet.Count}"); } else { editor.WriteMessage( "\nНе найдено объектов в указанном окне."); } } }
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!