Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.PlotConfig.GetMediaBounds
 Послать отзыв
 Метод предоставляет границы листа (размер страницы и печатные границы) для заданного канонического имени носителя. Не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public HostMgd.PlottingServices.MediaBounds GetMediaBounds( ref System.String canonicalMediaName );
Копировать Код
Public Function GetMediaBounds( ByRef canonicalMediaName As System.String ) As HostMgd.PlottingServices.MediaBounds
 Параметры
 Параметры
 Описание
 canonicalMediaName
 Входное каноническое имя листа. Тип System.String.
 Возвращает
 Возвращает границы для листа canonicalMediaName. Тип HostMgd.PlottingServices.MediaBounds.
 Описание
 Метод предоставляет границы листа (размер страницы и печатные границы) для заданного канонического имени носителя.
 В текущей версии не реализован.
 Ссылки
 HostMgd.PlottingServices.PlotConfig, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!