Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.PlotPageInfo.PlotPageInfo
 Послать отзыв
 Конструктор по умолчанию класса PlotPageInfo.
 Синтаксис
C#
Visual Basic
Копировать Код
public PlotPageInfo();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса PlotPageInfo.
 Ссылки
 HostMgd.PlottingServices.PlotPageInfo, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!