Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Класс HostMgd.Windows.ToolPalette.ToolAttribute
 Послать отзыв
 This is class HostMgd::Windows::ToolPalette::ToolAttribute.
 Иерархия классов
HostMgd::Windows::ToolPalette::ToolAttribute
 Синтаксис
C#
Visual Basic
public class ToolAttribute : Attribute;
Public Class ToolAttribute Inherits Attribute
 Методы
 Конструкторы
 Имя
 Описание
 ToolAttribute
 Это обзор перегрузок ToolAttribute.
 Топики
 Имя
 Описание
 ToolAttribute Свойства
 Ниже перечислены свойства класса ToolAttribute.
 Ссылки
 ToolAttribute Конструктор, ToolAttribute Свойства, Методы, Топики, ToolAttribute Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!