Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.DocumentLockMode
 Послать отзыв
 Данное перечисление определяет поддерживаемые уровни блокировки документа.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum DocumentLockMode { None = 0, AutoWrite = 1, NotLocked = 2, Write = 4, ProtectedAutoWrite = 20, Read = 32, ExclusiveWrite = 64 }
Копировать Код
Public Enum DocumentLockMode None = 0 AutoWrite = 1 NotLocked = 2 Write = 4 ProtectedAutoWrite = 20 Read = 32 ExclusiveWrite = 64 End Enum
 Члены
 Члены
 Описание
 AutoWrite
 Значение: 1. Блокировка автоматической записи. Цель этого режима блокировки — объединить в единую команду непрерывающиеся последовательности запросов от элементов ActiveX, которые могут быть обработаны все вместе без разблокирования и повторной блокировки между запросами. Это гарантирует, что в отношении отмены и подтверждения они будут работать как одна команда, а не как набор отдельных команд или операций с соответствующими действиями по подтверждению и отмене для каждой из них (т.е. подтверждение выполняется лишь один раз перед первым действием). Этот режим блокировки дает тот же эффект, что и режим Write, за исключением того, что AutoWrite устанавливается только в отсутствие других блокировок. Автоматическая блокировка снимается при установке любой другой блокировки, а при новой блокировке AutoWrite подтверждение и отмена выводятся пользователю только в случае, если после последней блокировки AutoWrite была выполнена какая-либо другая блокировка (т.е. блокировка AutoWrite уже была снята).
 ExclusiveWrite
 Значение: 64 (0x40). Этот тип блокировки устанавливает блокировку на монопольную запись (ExclusiveWrite). Такая блокировка взаимно исключает все иные типы блокировок другими исполняемыми контекстами. Это позволяет исполняемому контексту проверять и изменять содержимое указанного документа.
 None
 Значение: 0. Блокировки отсутствуют.
 NotLocked
 Значение: 2. Этот тип блокировки устанавливает отсутствие блокировки контекста документа.
 ProtectedAutoWrite
 Значение: 20. Этот тип блокировки используется вместо AutoWrite перед выполнением кода, который может обработать вложенную блокировку документа, с тем чтобы сохранить блокировку AutoWrite.
 Read
 Значение: 32 (0x20). Этот тип блокировки устанавливает блокировку только на чтение. Она может сосуществовать с другими блокировками Read, установленными другими исполняемыми контекстами. Блокировка Read взаимно исключает блокировки типа Write и ExclusiveWrite. Read позволяет исполняемому контексту просматривать содержимое документа, но не изменять его.
 Write
 Значение: 4. Режим блокировки по умолчанию. Блокировка на запись позволяет контексту выполнения проверять и изменять содержимое данного документа и является разделяемой (shared Write lock). Несколько контекстов выполнения могут одновременно удерживать разделяемую блокировку записи. Например, команда может вносить изменения в документ, но когда её выполнение приостановлено, другие команды могут вносить изменения в документ. Блокировка Write может сосуществовать с блокировками Read, установленными другими контекстами выполнения, а также взаимно исключает другие блокировки Read и ExclusiveWrite.
 Описание
 Данное перечисление определяет поддерживаемые уровни блокировки документа.
 Документ должен быть заблокирован исполняемым контекстом, прежде чем он сам или связанная с ним база данных и менеджер транзакций смогут быть изменены. Документ также может быть заблокирован, чтобы временно предотвратить его просмотр и/или изменение другими исполняемыми контекстами.
 Блокировка документов осуществляется централизованно на уровне приложения, чтобы предотвратить угрозу возникновения взаимоблокировок.
 Замечания
 Реализация блокировки AutoWrite весьма проста: вызов LockDocument(AutoWrite) не приведет ни к какому действию, если документ уже заблокирован. В противном случае блокировка будет установлена, и если в дальнейшем какой-либо поток запросит другую блокировку любого типа, блокировка AutoWrite будет снята. Как отмена действия, так и подтверждение посылаются в соответствии с настройками и могут быть отключены. Блокировка AutoWrite предназначена для использования элементами ActiveX, которые выполняют последовательность немодальных запросов, определенную заданными транзакционными границами.
 Последовательность действий выглядит следующим образом:
 Копировать Код
set AutoWrite внесение изменений внесение изменений return // В этой части кода могут быть другие блокировки set AutoWrite внесение изменений return
 В этом примере второй вызов для установки AutoWrite не создаст вторую отметку Undo и не отправит подтверждение о блокировке, если только перед этим не была установлена другая блокировка, из-за чего первая блокировка AutoWrite была бы удалена.
 Но возможен и случай вложенных блокировок:
 Копировать Код
set AutoWrite внесение изменений // Вложенный код устанавливает другую блокировку, что снимает текущую блокировку AutoWrite внесение изменений // И вот здесь происходит нарушение первой блокировки. return
 Блокировка типа ProtectedAutoWrite используется для сохранения блокировки AutoWrite в области действия установившей её функции, т.е. до выполнения команды "return". Этот режим настолько похож на ExclusiveWrite, что имеет общий с ним бит записи. Таким образом, любая проверка бита записи у текущей блокировки (mode & Write) дает значение true, если активна блокировка типа ProtectedAutoWrite .
 В отличие от AutoWrite, использование ProtectedAutoWrite предполагает соответствующий вызов Unlock. Разблокировка Unlock не снимает блокировку ProtectedAutoWrite полностью, а понижает уровень блокировки до обычного режима AutoWrite. Для этого действия не предусмотрены ни отмены, ни подтверждения. Если уже установлена блокировка на запись любого типа, не рассылаются ни подтверждения, ни отмены записи. Это соответствует поведению блокировки AutoWrite за исключением того, что в режиме ProtectedAutoWrite действия выполняются несколько медленнее.
 Используйте ProtectedAutoWrite вместо AutoWrite всякий раз, когда блокировка AutoWrite устанавливается перед выполнением кода, который сам может установить вложенную блокировку документа, но при этом блокировка AutoWrite должна остаться действующей.
 Использование режима AutoWrite вполне обосновано, если вы абсолютно уверены, что выполняемый код не приведёт к вложенной блокировке документа. В случае сомнений используйте ProtectedAutoWrite.
 Ваши комментарии по поводу этого топика: Послать отзыв!