Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Делегат HostMgd.Windows.PaletteSetStateEventHandler
 Послать отзыв
 This is type HostMgd::Windows::PaletteSetStateEventHandler.
 Синтаксис
C#
Visual Basic
public delegate PaletteSetStateEventHandler();
Public Delegate Sub PaletteSetStateEventHandler()
 Ваши комментарии по поводу этого топика: Послать отзыв!