Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор TrayItemBubbleWindowClosedEventArgs.TrayItemBubbleWindowClosedEventArgs
 Послать отзыв
 This is TrayItemBubbleWindowClosedEventArgs, a member of class TrayItemBubbleWindowClosedEventArgs.
 Синтаксис
C#
Visual Basic
public TrayItemBubbleWindowClosedEventArgs();
Public Sub New()
 Ссылки
 TrayItemBubbleWindowClosedEventArgs Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!