Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор TrayItemBubbleWindow.TrayItemBubbleWindow
 Послать отзыв
 This is TrayItemBubbleWindow, a member of class TrayItemBubbleWindow.
 Синтаксис
C#
Visual Basic
public TrayItemBubbleWindow();
Public Sub New()
 Ссылки
 TrayItemBubbleWindow Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!