Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.BeginPlotEventArgs
 Послать отзыв
 Класс BeginPlotEventArgs инкапсулирует необходимую для события BeginPlot информацию, относящуюся к выводу на печать.
 Иерархия классов
HostMgd::PlottingServices::BeginPlotEventArgs
 Синтаксис
C#
Visual Basic
Копировать Код
public class BeginPlotEventArgs : System.EventArgs;
Копировать Код
Public Class BeginPlotEventArgs Inherits System.EventArgs;
 Описание
 Класс BeginPlotEventArgs служит контейнером для аргументов события BeginPlot класса PlotReactorManager. Аргументы включают объекты PlotProgress и PlotType, которые определяют поведение диалога прогресса печати и тип печати, соответственно. Экземпляры класса используются делегатом HostMgd.PlottingServices.BeginPlotEventHandler.
 Методы
 Конструкторы
 Имя
 Описание
 BeginPlotEventArgs
 Конструктор класса BeginPlotEventArgs. Создает экземпляр класса с указанными параметрами.
 Топики
 Имя
 Описание
 BeginPlotEventArgs Свойства
 Ниже перечислены свойства класса BeginPlotEventArgs.
 Ссылки
 BeginPlotEventArgs Свойства, Методы, Топики, BeginPlotEventArgs Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!