Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PrintForm.SheetName
 Послать отзыв
 This is SheetName, a member of class PrintForm.
 Синтаксис
C#
Visual Basic
public System.String SheetName;
Public Property SheetName() As System.String
 Ссылки
 PrintForm Класс, Пространство имен HostMgd
 Ваши комментарии по поводу этого топика: Послать отзыв!