Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Перечисление HostMgd.Windows.Window.State
 Послать отзыв
 This is record HostMgd::Windows::Window::State.
 Синтаксис
C#
Visual Basic
public enum State { Normal = 0, Minimized = 1, Maximized = 2 }
Public Enum State Normal = 0 Minimized = 1 Maximized = 2 End Enum
 Ваши комментарии по поводу этого топика: Послать отзыв!