Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.SelectionRemovedEventArgs.Flags
 Послать отзыв
 Свойство возвращает битовые флаги, предоставляющие детальную информацию о текущем режиме и контексте операции выбора объектов.
 Синтаксис
C#
Visual Basic
Копировать Код
public SelectionFlags Flags { get; }
Копировать Код
Public ReadOnly Property Flags As SelectionFlags
 Возвращает
 Возвращает значение типа SelectionFlags — побитовое перечисление, объединяющее один или несколько флагов. Флаги могут комбинироваться с помощью побитовых операций (например, if ((flags & SelectionFlags.SubSelection) != 0)).
 Описание
 Свойство предоставляет доступ к перечислению SelectionFlags, которое содержит набор флагов, описывающих состояние и параметры текущей операции выбора в редакторе nanoCAD. Оно доступно только для чтения и используется в объектах, связанных с выборкой, таких как SelectionAddedEventArgs, SelectionRemovedEventArgs или PromptSelectionResult.
 Эти флаги позволяют определить:
Происходит ли добавление или удаление объектов,
Выполняется ли выбор всех объектов,
Используется ли выбор подобъектов,
Является ли выбор одиночным,
Было ли действие инициировано ключевым словом),
Выполняется ли выбор автоматически.
 Условия
 Только чтение
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; [Teigha.Runtime.CommandMethod("SelectionRemovedExample_Flags")] public void SelectionRemovedExample_Flags() { // Подписка на событие SelectionRemoved editor.SelectionRemoved += OnSelectionRemoved; } // Реализация отработки события SelectionRemoved private void OnSelectionRemoved(object sender, SelectionRemovedEventArgs e) { // Получаем доступ к флагам HostMgd.EditorInput.SelectionFlags flags = e.Flags; // Выводим сообщение в командную строку при соблюдении условий if ((flags & HostMgd.EditorInput.SelectionFlags.SubSelection) == HostMgd.EditorInput.SelectionFlags.SubSelection) { editor.WriteMessage("\nИдёт выбор подобъектов."); } } }
 Ссылки
 HostMgd.EditorInput.SelectionRemovedEventArgs, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!