Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.InplaceTextEditor.CanPaste
 Послать отзыв
 Свойство CanPaste позволяет проверить, возможно ли вставить текст из буфера обмена. В текущей версии не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool CanPaste;
Копировать Код
Public ReadOnly Property CanPaste As Boolean
 Возвращает
 Возвращает true, если вставка текста возможна. В противном случае возвращает false.
 Описание
 Свойство CanPaste позволяет проверить, возможно ли вставить текст из буфера обмена. В текущей версии не реализовано.
 Условия
 Только чтение.
 Ссылки
 HostMgd.ApplicationServices.InplaceTextEditor, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!