Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.InputPointContext.ComputedPoint
 Послать отзыв
 Свойство предназначено для получения или установки конечной вычисленной точки ввода, если она была определена в процессе обработки.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d ComputedPoint;
Копировать Код
Public Property ComputedPoint() As Point3d
 Возвращает
 Возвращает объект типа Point3d — координаты конечной вычисленной точки в мировой системе координат (WCS), если значение pointComputed равно true.
 Если точка была успешно вычислена, содержит её актуальные координаты. Если вычисление не выполнено (например, на раннем этапе), может содержать недопустимое или исходное значение.
 Описание
 Свойство используется для хранения итоговой координаты точки, которая была рассчитана системой ввода nanoCAD. Оно содержит финальное положение точки после применения всех доступных механизмов: привязок (OSNAP), сетки, полярного отслеживания, автоматического выравнивания и пользовательских фильтров.
 Значение свойства устанавливается, когда внутренний флаг pointComputed имеет значение true, что указывает на успешное вычисление точки. Важно, что ComputedPoint всегда устанавливается системой, независимо от того, были ли применены пользовательские фильтры (PointFilter) или нет. Это позволяет использовать его как надёжный источник текущей расчётной позиции курсора.
 Свойство даёт возможность:
получить текущую вычисленную точку,
программно задать новое значение, например, при реализации кастомного поведения ввода.
 После установки ComputedPoint система может использовать его для последующих операций — например, для расчёта OsnapPoint (привязанной точки) или динамической визуализации.
 Условия
 Чтение и запись
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class InputPointContextExamples { // Метод команды, которая получает точку, привязанную по прямоугольной (декартовой) сетке, // если в контексте ввода был активирован соответствующий режим привязки [Teigha.Runtime.CommandMethod("ComputedPointExample")] public void ComputedPointExample() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Метод для отработки события редактора PointMonitor editor.PointMonitor += (sender, e) => { // Сохраняем контекст события в преременную InputPointContext context = e.Context; // Выводим в комнадную строку данные об операции if (context != null) { Point3d computed = context.ComputedPoint; editor.WriteMessage($"\nВычисленная точка: {computed}"); // Пример модификации (редко используется, но возможно) // context.ComputedPoint = new Point3d(0, 0, 0); } }; } }
 Ссылки
 HostMgd.EditorInput.InputPointContext, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!