Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.PlotConfig.FullPath
 Послать отзыв
 Свойство FullPath возвращает полный путь доступа к устройству. Не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public System.String FullPath;
Копировать Код
Public ReadOnly Property FullPath As System.String
 Возвращает
 Возвращает полное имя текущего устройства или файла PC3. Тип System.String.
 Описание
 Свойство FullPath возвращает полный путь доступа к устройству. В случае файла PC3 свойство возвращает полный путь к файлу, а для системных принтеров - полный UNC путь.
 В текущей версии не реализовано.
 Условия
 Только чтение.
 Ссылки
 HostMgd.PlottingServices.PlotConfig, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!