Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptDoubleOptions.PromptDoubleOptions(string,string)
 Послать отзыв
 Конструктор инициализирует новый экземпляр класса с заданным сообщением, включающим локальные и глобальные ключевые слова.
 Синтаксис
C#
Visual Basic
Копировать Код
public PromptDoubleOptions(string messageAndKeywords, string globalKeywords);
Копировать Код
Public Sub New(messageAndKeywords As String, globalKeywords As String)
 Параметры
 Параметры
 Описание
 messageAndKeywords
 Строка, содержащая текст приглашения и, опционально, список локальных ключевых слов в формате [Ключ1/Ключ2]. Эти слова отображаются как возможные варианты выбора. Тип string
 globalKeywords
 Строка, содержащая глобальные ключевые слова, разделённые пробелом. Они остаются доступными на протяжении всей команды, даже если не указаны в основном сообщении. Тип string
 Описание
 Конструктор создаёт объект класса PromptDoubleOptions, используемый при настройке интерактивного ввода вещественного числа — например, через метод GetDouble(). Он позволяет задать:
сообщение приглашения , в которое можно включить локальные ключевые слова в формате [Ключ1/Ключ2] (например: "Введите значение [Быстро/Медленно]:"),
глобальные ключевые слова , которые остаются доступными на протяжении всей команды и не зависят от контекста ввода (например: "Cancel Exit").
 Этот конструктор особенно полезен при разработке команд, где пользователь может выбирать между режимами или выполнять системные действия (например, отмена операции) в любой момент.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("PromptDoubleOptionsExample_string_string")] public void PromptDoubleOptionsExample_string_string() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создаём запрос пользователю PromptDoubleOptions options = new PromptDoubleOptions( "Введите масштаб [Стандартный/Пользовательский]:", "Standard Custom"); options.DefaultValue = 1.0; options.UseDefaultValue = true; PromptDoubleResult result = editor.GetDouble(options); // Если все данные введены, выводим результат в командную строку if (result.Status == PromptStatus.OK) { double scale = result.Value; editor.WriteMessage( $"\nЗначение масштаба: {scale}"); } else if (result.Status == PromptStatus.Keyword) { editor.WriteMessage($"\nВыбрано ключевое слово: {result.StringResult}"); } } }
 Ссылки
 HostMgd.EditorInput.PromptDoubleOptions, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!