Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство JigPrompts.DragStatus
 Послать отзыв
 Одно из значений перечисления DragStatus
 Синтаксис
C#
Visual Basic
internal HostEdJig.DragStatus DragStatus;
Friend Property DragStatus() As HostEdJig.DragStatus
 Возвращает
 Возвращает одно из значений перечисления DragStatus, указывающее либо на то, что была выбрана начальная точка (DragStart=0), либо была выбрана конечная точка(DragEnd=1), либо после выбора начальной точки была отмена действия(DragAbort=2).
 Описание
 Значение свойства меняется в соответствии с шагом, на котором находится процесс изменения объекта или группы объектов: начало изменения, конец изменения, либо отмена изменений.
 Условия
 Только чтение.
 Ссылки
 JigPrompts Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!