Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод TabbedDialogExtension.SetDirty (System::Object^, bool)
 Послать отзыв
 This is SetDirty, a member of class TabbedDialogExtension.
 Синтаксис
C#
Visual Basic
public void SetDirty(ref System.Object control, bool dirty);
Public Sub SetDirty(ByRef control As System.Object, dirty As bool)
 Ссылки
 TabbedDialogExtension Класс, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!