Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.DsdData.Dwf3dOptions
 Послать отзыв
 Свойство Dwf3dOptions позволяет определить объект настроек публикации в 3D DWF. Не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public HostMgd.PlottingServices.Dwf3dOptions Dwf3dOptions;
Копировать Код
Public Property Dwf3dOptions As HostMgd.PlottingServices.Dwf3dOptions
 Возвращает
 Возвращает настройки публикации в 3D DWF. Тип HostMgd.PlottingServices.Dwf3dOptions.
 Описание
 Свойство Dwf3dOptions позволяет определить объект настроек публикации в 3D DWF. В настройках представлены флаги сохранения иерархии внешних ссылок и публикации с использованием назначенных материалов.
 В текущей версии не реализовано.
 Условия
 Чтение и запись.
 Ссылки
 HostMgd.PlottingServices.DsdData, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!