Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptNestedEntityResult.ToString()
 Послать отзыв
 Метод возвращает строковое представление результата выбора вложенного объекта, включая статус и идентификатор выбранного элемента.
 Синтаксис
C#
Visual Basic
Копировать Код
public override string ToString();
Копировать Код
Public Overrides Function ToString() As String
 Возвращает
 Возвращает значение типа string, представляющее собой текстовое описание результата выбора:
Если операция успешна (Status == PromptStatus.OK) — строка содержит идентификатор объекта и координаты точки выбора.
Если операция отменена или произошла ошибка — возвращается сообщение о статусе, например: "Operation cancelled" или "Input error".
 Примеры:
Успешный выбор: "Object ID: 12345, Point: (100.0, 50.0, 0.0)"
Операция отменена: "Operation cancelled"
 Описание
 Переопределённый метод предоставляет читаемую строку, описывающую результат операции выбора вложенного геометрического объекта. Метод возвращает информацию о статусе операции (OK, Cancel, Error) и, при успешном завершении, идентификатор (ObjectId) выбранного объекта и точку выбора (PickedPoint), если она доступна.
 Этот метод удобен для отладки, логирования или вывода информации в командную строку nanoCAD.
 Ссылки
 HostMgd.EditorInput.PromptNestedEntityResult, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!