Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод SelectionFilter.GetFilter
 Послать отзыв
 Синтаксис
C#
Visual Basic
public array<Teigha::DatabaseServices::TypedValue> GetFilter();
Public Function GetFilter() As array<Teigha.DatabaseServices.TypedValue>
 Описание
 Возвращает массив типа TypeValues, которы содержит инструкции по фильтрации.
 Ссылки
 SelectionFilter Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!