Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.Document.CloseAndDiscard()
 Послать отзыв
 Метод предназначен для закрытия dwg-документа без его сохранения.
 Синтаксис
C#
Visual Basic
public void CloseAndDiscard();
Public Sub CloseAndDiscard()
 Описание
 Метод закрывает dwg-документ без его сохранения.
 Ссылки
 HostMgd.ApplicationServices.Document, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!