Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.MediaBounds.ToString
 Послать отзыв
 Метод позволяет получить эквивалентное строковое представление данного объекта с учетом региональных и языковых настроек. Не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public System.String ToString( ref System.IFormatProvider provider );
Копировать Код
Public Function ToString( ByRef provider As System.IFormatProvider ) As System.String
 Параметры
 Параметры
 Описание
 provider
 Заданный провайдер региональных и языковых настроек. Тип System.IFormatProvider.
 Возвращает
 Возвращает строковое представление данного объекта. Тип System.String.
 Описание
 Метод позволяет получить эквивалентное строковое представление данного объекта с учетом региональных и языковых настроек.
 В текущей версии не реализован.
 Ссылки
 HostMgd.PlottingServices.MediaBounds, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!