Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.PlotConfig.CanonicalMediaNames
 Послать отзыв
 Свойство CanonicalMediaNames возвращает список размеров листа, которые поддерживает текущее устройство. Не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public System.Collections.Specialized.StringCollection CanonicalMediaNames;
Копировать Код
Public ReadOnly Property CanonicalMediaNames() As System.Collections.Specialized.StringCollection
 Возвращает
 Возвращает список поддерживаемых размеров листов. Тип System.Collections.Specialized.StringCollection.
 Описание
 Свойство CanonicalMediaNames возвращает список размеров листа, которые поддерживает текущее устройство.
 В текущей версии не реализовано.
 Условия
 Только чтение.
 Ссылки
 HostMgd.PlottingServices.PlotConfig, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!