Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.BeginDocumentEventArgs.BeginDocumentEventArgs
 Послать отзыв
 Конструктор класса BeginDocumentEventArgs. Создает экземпляр класса с указанными параметрами.
 Синтаксис
C#
Visual Basic
Копировать Код
public BeginDocumentEventArgs( ref HostMgd.PlottingServices.PlotInfo plotInfo, ref System.String documentName, int copies, bool plotToFile, ref System.String fileName );
Копировать Код
Public Sub New( ByRef plotInfo As HostMgd.PlottingServices.PlotInfo, ByRef documentName As System.String, copies As Integer, plotToFile As Boolean, ByRef fileName As System.String )
 Параметры
 Параметры
 Описание
 plotInfo
 Объект сервисного класса HostMgd.PlottingServices.PlotInfo, представляющий свойства вывода на печать.
 documentName
 Имя документа. Тип System.String.
 copies
 Требуемое количество копий. Тип int.
 plotToFile
 Флаг печати в файл. Тип bool. Значение true означает печать в файл.
 fileName
 Имя файла. Тип System.String.
 Описание
 Конструктор класса BeginDocumentEventArgs. Создает экземпляр класса с указанными параметрами.
 Ссылки
 HostMgd.PlottingServices.BeginDocumentEventArgs, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!