Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.SelectionRemovedEventArgs.RemoveSubentity(int,int)
 Послать отзыв
 Метод удаляет геометрический подобъект из набора выбора по индексу объекта и индексу подобъекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public void RemoveSubentity(int index, int subentityIndex);
Копировать Код
Public Sub RemoveSubentity(index As Integer, subentityIndex As Integer)
 Параметры
 Параметры
 Описание
 index
 Порядковый номер объекта в наборе выбранных объектов (SelectionSet). Нумерация начинается с 0.
 subentityIndex
 Порядковый номер подобъекта внутри указанного объекта. Зависит от типа объекта — например, может соответствовать номеру сегмента в полилинии или ребра в 3D-теле. Тип int
 Пример
 0 — первый выбранный объект, 1 — второй и т.д. Тип int
 Описание
 Метод предназначен для удаления отдельного подобъекта — такого как сегмент полилинии, ребро 3D-тела, грань или вершина — из состава выбранного объекта в рамках текущей выборки. Он используется в сценариях, где выборка включает не целые объекты, а их внутренние компоненты, и требуется точное управление составом выделения.
 После выполнения метода указанный подобъект исключается из выборки.
 Ссылки
 HostMgd.EditorInput.SelectionRemovedEventArgs, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!