Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.ExecuteInApplicationContextCallback(Object)
 Послать отзыв
 Делегат ExecuteInApplicationContextCallback предназначен для обратного вызова void функции из контекста приложения.
 Синтаксис
C#
Visual Basic
Копировать Код
public delegate void ExecuteInApplicationContextCallback( ref System.Object userData );
Копировать Код
Public Delegate Sub ExecuteInApplicationContextCallback( ByRef userData As System.Object )
 Параметры
 Параметры
 Описание
 userData
 Пользовательская функция callback. Тип System.Object.
 Описание
 Делегат ExecuteInApplicationContextCallback предназначен для обратного вызова void функции из контекста приложения.
 Ваши комментарии по поводу этого топика: Послать отзыв!