Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод PlotLogger.LogError
 Послать отзыв
 Синтаксис
C#
Visual Basic
public void LogError(ref System.String message);
Public Sub LogError(ByRef message As System.String)
 Ссылки
 PlotLogger Класс, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!