Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод XrefFileLock.ReloadFile ()
 Послать отзыв
 Синтаксис
C#
Visual Basic
public void ReloadFile();
Public Sub ReloadFile()
 Описание
 Перезагрузка соответствующего файла (ов) внешней ссылки по списку ID записей таблицы блоков (рассинхронизированных) для текущего чертежа. После этого (т.е. после перезагрузки самих файлов внешних ссылок) файлы внешних ссылок будут снова синхронизированы для всех внешних ссылок.
 Этот вариант метода использует внутренний список ID рассинхронизированных записей.
 Ссылки
 XrefFileLock Класс, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!