Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PlotFactory.ProcessPlotState
 Послать отзыв
 Текущее состояние подсистемы печати.
 Синтаксис
C#
Visual Basic
public HostMgd::PlottingServices::ProcessPlotState ProcessPlotState;
Public Property ProcessPlotState() As HostMgd.PlottingServices.ProcessPlotState
 Описание
 Только для чтения. Возвращает одно из трёх состояний: NotPlotting - печать не идёт. ForegroundPlotting - BackgroundPlotting - идёт печать в фоновом режиме (?)
 Ссылки
 PlotFactory Класс, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!