Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.Application.InvokeContextHelp(IntPtr,int,String)
 Послать отзыв
 МЕТОД НЕ РЕАЛИЗОВАН. Метод вызывает контекстную справку с заданной темой.
 Синтаксис
C#
Visual Basic
Копировать Код
public static void InvokeContextHelp(IntPtr window, int contextId, string helpPrefix);
Копировать Код
Public Shared Sub InvokeContextHelp(window As IntPtr, contextId As Integer, helpPrefix As String)
 Параметры
 Параметры
 Описание
 window
 Указатель на окно, для которого вызывается справка. Тип IntPtr
 contextId
 Идентификатор контекста, для которого вызывается справка. Тип Integer
 helpPrefix
 Тема справки, которую нужно открыть. Тип String
 Описание
 Метод открывает окно с контекстной справкой на заданную тему.
 Ссылки
 HostMgd.ApplicationServices.Application, HostMgd.ApplicationServices Пространство имен
 Исключения
 MGD NOT_IMPLEMENTED
 Ваши комментарии по поводу этого топика: Послать отзыв!