Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 JigPrompts.AcquireAngle(JigPromptAngleOptions)
 Послать отзыв
 Метод запрашивает у пользователя угол в °(градусах), используя при запросе свойства класса JigPromptAngleOptions.
 Синтаксис
C#
Visual Basic
public HostMgd.EditorInput.PromptDoubleResult AcquireAngle(ref HostMgd.EditorInput.JigPromptAngleOptions options);
Public Function AcquireAngle(ByRef options As HostMgd.EditorInput.JigPromptAngleOptions) As HostMgd.EditorInput.PromptDoubleResult
 Параметры
 Параметры
 Описание
 options
 Набор данных типа JigPromptAngleOptions, которые используются при запросе угла.
 Возвращает
 Возвращает результат типа double, который является углом, выраженным в радианах. Значение угла определяется либо исходя из текущего положения курсора мыши, либо посредством ввода с клавиатуры. При вводе с клавиатуры необходимо указывать угол в °(градусах).
 Описание
 Метод предназначен для запроса у пользователя угла в °(градусах). В основном применяется для интерактивного поворота объекта или группы объектов.
 Пример
 В примере приведен отрывок кода из реализации метода Sampler() класса Jig.
C#
 Копировать Код
 JigPromptAngleOptions angleOptions = new JigPromptAngleOptions("Угол:"); angleOptions.UseBasePoint = true; angleOptions.BasePoint = basePoint; PromptDoubleResult result = prompts.AcquireAngle(angleOptions);
Visual Basic
 Копировать Код
 Dim angleOptions As JigPromptAngleOptions = New JigPromptAngleOptions("Угол:") angleOptions.UseBasePoint = True angleOptions.BasePoint = basePoint Dim result As PromptDoubleResult = prompts.AcquireAngle(angleOptions)
 Ссылки
 JigPrompts Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!