Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.Dwf3dOptions.GroupByXrefHierarchy
 Послать отзыв
 Свойство GroupByXrefHierarchy позволяет определить, включен ли режим группировки объекта 3D DWF согласно иерархии Xref.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool GroupByXrefHierarchy;
Копировать Код
Public Property GroupByXrefHierarchy As Boolean
 Возвращает
 Возвращает true, если режим группировки согласно иерархии внешних ссылок включен. В противном случае возвращает false.
 Описание
 Свойство GroupByXrefHierarchy позволяет определить, включен ли режим группировки объекта 3D DWF согласно иерархии внешних ссылок (Xref).
 Условия
 Чтение и запись.
 Ссылки
 HostMgd.PlottingServices.Dwf3dOptions, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!