Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод TrayItemCollection.GetEnumerator
 Послать отзыв
 This is GetEnumerator, a member of class TrayItemCollection.
 Синтаксис
C#
Visual Basic
public System.Collections.IEnumerator GetEnumerator();
Public Function GetEnumerator() As System.Collections.IEnumerator
 Ссылки
 TrayItemCollection Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!