Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.RolloverEventArgs.Picked
 Послать отзыв
 Свойство устанавливает или возвращает путь к геометрическому подобъекту, выбранному или подсвеченному при взаимодействии с курсором.
 Синтаксис
C#
Visual Basic
Копировать Код
public FullSubentityPath Picked { get; set; }
Копировать Код
Public Property Picked As FullSubentityPath
 Возвращает
 Возвращает или устанавливает объект типа FullSubentityPath, представляющий путь к подобъекту:
Если значение не null — содержит ObjectId контейнера и массив селекторов, идентифицирующих конкретный подобъект.
Если null — ни один подобъект не выбран или не определён.
 Описание
 Свойство используется в контексте событий, связанных с наведением и выбором объектов — например, при обработке выбора вложенных элементов. Оно указывает на конкретный подобъект (например, сегмент полилинии, ребро 3D-тела, грань или вершину), с которым в данный момент взаимодействует пользователь.
 В отличие от Highlighted, которое отвечает за визуальную подсветку, свойство Picked может использоваться для определения логически выбранного подобъекта в процессе наведения или выбора. Оно позволяет точно идентифицировать элемент составного объекта, даже если сам объект не был окончательно выбран.
 Условия
 Чтение и запись
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события Rollover [Teigha.Runtime.CommandMethod("RolloverExample_Picked")] public void RolloverExample_Picked() { // Подписка на событие Rollover editor.Rollover += OnEditorRollover; } // Реализация отработки события Rollover private void OnEditorRollover(object sender, RolloverEventArgs e) { // Получаем путь к выбранному подобъекту FullSubentityPath pickedPath = e.Picked; // Выводим результат в командную строку if (!pickedPath.IsNull) { editor.WriteMessage($"\nВыбранный подобъект: {pickedPath.SubentIdd}"); } } }
 Ссылки
 HostMgd.EditorInput.RolloverEventArgs, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!