Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Перечисление HostMgd.Windows.DockSides
 Послать отзыв
 This is record HostMgd::Windows::DockSides.
 Синтаксис
C#
Visual Basic
[Flags] public enum DockSides { Bottom = 0x8000, Left = 0x1000, None = 0, Right = 0x4000, Top = 0x2000 }
<Flags> Public Enum DockSides Bottom = &H8000 Left = &H1000 None = 0 Right = &H4000 Top = &H2000 End Enum
 Ваши комментарии по поводу этого топика: Послать отзыв!