Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PublishSheetEventArgs.CanonicalMediaName
 Послать отзыв
 This is CanonicalMediaName, a member of class PublishSheetEventArgs.
 Синтаксис
C#
Visual Basic
public System.String CanonicalMediaName;
Public Property CanonicalMediaName() As System.String
 Ссылки
 PublishSheetEventArgs Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!