Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PaneCollection.Count
 Послать отзыв
 This is Count, a member of class PaneCollection.
 Синтаксис
C#
Visual Basic
public int Count;
Public Property Count() As Integer
 Ссылки
 PaneCollection Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!