Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Перечисление HostMgd.Windows.IconType
 Послать отзыв
 This is record HostMgd::Windows::IconType.
 Синтаксис
C#
Visual Basic
public enum IconType { None, Information, Critical, Warning }
Public Enum IconType None Information Critical Warning End Enum
 Ваши комментарии по поводу этого топика: Послать отзыв!