Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.LongTransactionManager.CurrentLongTransactionFor
 Послать отзыв
 Метод предоставляет идентификатор объекта длительной транзакции, если таковая существует в указанным объекте Document. В текущей версии не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public Teigha.DatabaseServices.ObjectId CurrentLongTransactionFor( ref Document doc );
Копировать Код
Public Function CurrentLongTransactionFor( ByRef doc As Document ) As Teigha.DatabaseServices.ObjectId
 Параметры
 Параметры
 Описание
 doc
 Запрашиваемый документ. Тип Document.
 Возвращает
 Возвращает идентификатор объекта длительной транзакции,связанной с документом doc. Тип Teigha.DatabaseServices.ObjectId. Если в документе нет активной длительной транзакции, возвращает NULL.
 Описание
 Метод предоставляет идентификатор объекта длительной транзакции, если таковая существует в указанным объекте Document. Если в документе нет активной длительной транзакции, возвращает NULL.
 В текущей версии не реализован.
 Ссылки
 HostMgd.ApplicationServices.LongTransactionManager, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!