Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.SelectionRemovedEventArgs.RemovedObjects
 Послать отзыв
 Свойство возвращает набор объектов, которые были удалены из текущего выделения.
 Синтаксис
C#
Visual Basic
Копировать Код
public SelectionSet RemovedObjects { get; }
Копировать Код
Public ReadOnly Property RemovedObjects As SelectionSet
 Возвращает
 Возвращает объект типа SelectionSet, содержащий:
Список ObjectId удалённых объектов.
При необходимости — дополнительную информацию (точки выбора, матрицы преобразования и т.д.).
 Если удалённых объектов нет, возвращается пустой SelectionSet (с Count = 0), а не null.
 Описание
 Свойство предоставляет доступ к объекту типа SelectionSet, содержащему коллекцию идентификаторов (ObjectId) объектов, исключённых из выборки в ходе операции выделения — например, при использовании режима Shift + щелчок или команды "Удалить из выбора". Оно доступно только для чтения и используется в контексте событий, связанных с изменением выборки, таких как SelectionRemoved.
 Это свойство позволяет разработчику плагина точно определить, какие именно объекты были удалены, и выполнить соответствующую реакцию — например, обновить интерфейс, снять выделение в пользовательской панели или скорректировать логику команды.
 Условия
 Только чтение
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; [Teigha.Runtime.CommandMethod("SelectionRemovedExample_RemovedObjects)] public void SelectionRemovedExample_RemovedObjects() { // Подписка на событие SelectionRemoved editor.SelectionRemoved += OnSelectionRemoved; } // Реализация отработки события SelectionRemoved private void OnSelectionRemoved(object sender, SelectionRemovedEventArgs e) { // Получаем доступ к объектам, удаленным из текущего выделения SelectionSet removed = e.RemovedObjects; // Выводим в командную строку идентификаторы этих объектов foreach (ObjectId id in removed.GetObjectIds()) { editor.WriteMessage($"\nИз выборки удалён объект: {id}"); } } }
 Ссылки
 HostMgd.EditorInput.SelectionRemovedEventArgs, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!