Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.PromptingForDouble
 Послать отзыв
 Событие возникает при начале интерактивной операции ввода вещественного числа, позволяя настроить параметры команды до её запуска. Событие не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public event PromptDoubleOptionsEventHandler PromptingForDouble;
Копировать Код
Public Event PromptingForDouble As PromptDoubleOptionsEventHandler
 Описание
 Событие инициируется в момент начала операции ввода вещественного числа — например, перед вызовом метода `GetDouble()` или других команд, требующих ввода значения типа `double`. Оно предоставляет доступ к параметрам ввода через объект `PromptDoubleOptionsEventArgs`, что позволяет динамически изменять:
сообщение приглашения (`Message`),
значение по умолчанию (`DefaultValue`),
режимы ввода (`AllowNone`, `AllowNegative`, `AllowZero` и др.).
 Это событие особенно полезно при разработке интерактивных команд, где требуется гибкая настройка параметров ввода числа в зависимости от контекста, например, при задании коэффициентов масштабирования, размеров или параметров объектов.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события PromptingForDouble [Teigha.Runtime.CommandMethod("PromptingForDoubleExample")] public void PromptingForDoubleExample() { // Подписка на событие PromptingForDouble editor.PromptingForDouble += OnEditorPromptingForDouble; } // Реализация отработки события PromptingForDouble private void OnEditorPromptingForDouble(object sender, PromptDoubleOptionsEventArgs e) { // Установка начального значения e.Options.DefaultValue = 5.75; // Изменение сообщения приглашения e.Options.Message = "Введите коэффициент масштабирования:"; } }
 Порядок работы с событием:
Вызывается метод GetDouble() или аналогичный, требующий ввода вещественного числа.
Перед началом ввода генерируется событие PromptingForDouble.
Разработчик может изменить параметры ввода через e.Options.
Пользователь вводит значение графически или с клавиатуры.
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!