Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство LispWillStartEventArgs.FirstLine
 Послать отзыв
 Синтаксис
C#
Visual Basic
public System.String FirstLine;
Public Property FirstLine() As System.String
 Описание
 Возвращает первую строку процедуры lisp для выполнения.
 Условия
 Только на чтение
 Ссылки
 LispWillStartEventArgs Класс, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!