Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Converter.AngleToString (double)
 Послать отзыв
 Синтаксис
C#
Visual Basic
public String AngleToString(double value);
Public Function AngleToString(value As Double) As String
 Описание
 Конвертирует угол в строку в соответствии с текущими угловыми единицами и текущей точностью (системная переменная AUPREC).
 Ссылки
 Converter Класс, HostMgd.Runtime Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!