Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.Application.InvokeHelp(String,String)
 Послать отзыв
 Метод открывает файл со справкой на указанной теме.
 Синтаксис
C#
Visual Basic
Копировать Код
public static void InvokeHelp(string fileName, string topic);
Копировать Код
Public Shared Sub InvokeHelp(fileName As String, topic As String)
 Параметры
 Параметры
 Описание
 fileName
 Путь к файлу справки с его названием. Тип String
 topic
 Тема, на которой нужно открыть справку. Тип String
 Описание
 Метод открывает файл со справкой на указанной теме.
 Ссылки
 HostMgd.ApplicationServices.Application, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!