Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод PaneCollection.Add (System::Object^)
 Послать отзыв
 This is Add, a member of class PaneCollection.
 Синтаксис
C#
Visual Basic
public int Add(ref System.Object value);
Public Function Add(ByRef value As System.Object) As Integer
 Ссылки
 PaneCollection Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!