Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Publisher.FireBeginPublishingSheet
 Послать отзыв
 This is FireBeginPublishingSheet, a member of class Publisher.
 Синтаксис
C#
Visual Basic
public void FireBeginPublishingSheet(ref HostMgd::Publishing::BeginPublishingSheetEventArgs e);
Public Sub FireBeginPublishingSheet(ByRef e As HostMgd.Publishing.BeginPublishingSheetEventArgs)
 Ссылки
 Publisher Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!