Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод XrefFileLock.ConsistencyCheckLocal
 Послать отзыв
 This is ConsistencyCheckLocal, a member of class XrefFileLock.
 Синтаксис
C#
Visual Basic
public Teigha::DatabaseServices::ObjectIdCollection ConsistencyCheckLocal(Teigha::DatabaseServices::ObjectId selectedBlockId);
Public Function ConsistencyCheckLocal(selectedBlockId As Teigha.DatabaseServices.ObjectId) As Teigha.DatabaseServices.ObjectIdCollection
 Ссылки
 XrefFileLock Класс, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!