Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Keyword.Visible
 Послать отзыв
 Синтаксис
C#
Visual Basic
public bool Visible;
Public Property Visible() As bool
 Описание
 Свойство возвращает или устанавливает, отображается ли ключевое слово пользователю.
 Свойство имеет значение true, если ключевое слово отображается на экране.
 Условия
 На чтение и запись
 Ссылки
 Keyword Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!