Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.InputPointContext.DrawContext
 Послать отзыв
 Свойство предназначено для получения или установки контекста отрисовки, используемого при визуализации графики во время операции ввода точки.
 Синтаксис
C#
Visual Basic
Копировать Код
public ViewportDraw DrawContext;
Копировать Код
Public Property DrawContext() As ViewportDraw
 Возвращает
 Возвращает объект типа ViewportDraw — контекст отрисовки, связанный с текущим видом (viewport).
 Может быть null, если контекст отрисовки недоступен (например, при ошибке инициализации).
 Описание
 Свойство предоставляет доступ к объекту ViewportDraw, который содержит информацию о текущем контексте отображения — включая активный вид, параметры отрисовки, трансформационные матрицы, размеры точек и другие графические настройки. Оно используется в обработчиках событий ввода (PointMonitor, PointFilter) для рисования временной графики (например, направляющих, подсказок, "резиновых линий") прямо в окне чертежа.
 Благодаря DrawContext разработчик может:
определить, в каком виде (viewport) происходит ввод,
корректно преобразовать координаты для отображения,
нарисовать примитивы с учётом масштаба, поворота и стиля вида,
обеспечить совместимость с различными режимами отображения (2D/3D, изометрия и др.).
 Свойство позволяет не только читать текущие параметры отрисовки, но и, при необходимости, модифицировать контекст — например, при реализации пользовательских визуальных эффектов.
 Условия
 Чтение и запись
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class InputPointContextExamples { // Метод команды, которая получает и устанавливает контекст отрисовки, // используемый при визуализации графики во время операции ввода точки [Teigha.Runtime.CommandMethod("DrawContextExample")] public void DrawContextExample() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Метод для отработки события редактора PointMonitor editor.PointMonitor += (sender, e) => { // Сохраняем контекст события в преременную InputPointContext context = e.Context; // Получаем данные о контексте if (context != null && context.DrawContext != null) { ViewportDraw drawContext = context.DrawContext; // Пример: можно использовать drawContext для отрисовки // (в реальной реализации — через реакторы или Jig) Point3d origin = Point3d.Origin; Point3d point = new Point3d(10, 10, 0); // Условная визуализация // drawContext.Geometry.DrawLine(origin, point);  } }; } }
 Ссылки
 HostMgd.EditorInput.InputPointContext, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!