Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptDistanceOptions.GetDefaultValueString()
 Послать отзыв
 Метод возвращает строковое представление значения расстояния по умолчанию, заданного в параметрах команды.
 Синтаксис
C#
Visual Basic
Копировать Код
public System.String GetDefaultValueString();
Копировать Код
Public Function GetDefaultValueString() As System.String
 Возвращает
 Возвращает значение типа string, представляющее собой отформатированное значение расстояния по умолчанию. Например:
"100.00" — если DefaultValue = 100.0.
 & "0" — если значение по умолчанию не задано. Может возвращать пустую строку, если DefaultValue не определено.
 Описание
 Метод является вспомогательным и предназначен для преобразования числового значения свойства DefaultValue в строку, отформатированную согласно текущим настройкам единиц чертежа и локализации. Это удобно при формировании подсказок, сообщений или динамического обновления интерфейса, где требуется отобразить значение по умолчанию в читаемом виде.
 Метод автоматически учитывает формат отображения чисел (например, разделитель точка/запятая), количество знаков после запятой и единицы измерения, используемые в текущем чертеже nanoCAD.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { [Teigha.Runtime.CommandMethod("PromptDistanceOptionsExample_GetDefaultValueString")] public void PromptDistanceOptionsExample_GetDefaultValueString() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создаём запрос пользователю PromptDistanceOptions options = new PromptDistanceOptions("\nВведите расстояние:"); // Устанавливаем значение по умолчанию и разрешаем использовать его options.DefaultValue = 100.0; options.UseDefaultValue = true; // Разрешаем использовать Enter, не вводя значений. // В этом случае применится значение по умолчанию options.AllowNone = true; // Вызов метода GetDefaultValueString() string defaultStr = options.GetDefaultValueString(); // Вывод результата в командную строку editor.WriteMessage($"\nЗначение по умолчанию: {defaultStr} ед."); } }
 Ссылки
 HostMgd.EditorInput.PromptDistanceOptions, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!