Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Делегат HostMgd.ApplicationServices.DocumentLockModeChangedEventHandler
 Послать отзыв
 Делегат события класса DocumentCollection
 Синтаксис
C#
Visual Basic
public delegate DocumentLockModeChangedEventHandler();
Public Delegate Sub DocumentLockModeChangedEventHandler()
 Ваши комментарии по поводу этого топика: Послать отзыв!