Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор Window.Window (HWND, bool)
 Послать отзыв
 This is Window, a member of class Window.
 Синтаксис
C#
Visual Basic
public Window(HWND hWnd, bool autoDelete);
Public Sub New(hWnd As HWND, autoDelete As bool)
 Ссылки
 Window Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!