Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Keyword.GlobalName
 Послать отзыв
 Синтаксис
C#
Visual Basic
public String GlobalName;
Public Property GlobalName() As String
 Описание
 Свойство возвращает или устанавливает глобальное имя ключевого слова. Оно никогда не показывается на экране, а применяется для того, чтобы доступ к ключевому слову производился независимо от локализации (используемого языка).
 Условия
 На чтение и запись
 Ссылки
 Keyword Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!