Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.CrossingOrWindowSelectedObject
 Послать отзыв
 Класс описывает объект, выбранный с помощью окна или многоугольника, при этом учитывается, был ли выбор выполнен как "окно пересечения" или "окно включения".
 Иерархия классов
HostMgd::EditorInput::SelectedObject HostMgd::EditorInput::CrossingOrWindowSelectedObject
 Синтаксис
C#
Visual Basic
Копировать Код
public sealed class CrossingOrWindowSelectedObject : SelectedObject
Копировать Код
Public NotInheritable Class CrossingOrWindowSelectedObject Inherits SelectedObject
 Описание
 Класс является производным от SelectedObject и используется для представления объектов, выбранных графическим способом — с помощью прямоугольного окна или полигональной рамки. Он расширяет базовую информацию о выбранном объекте, добавляя данные о режиме выбора:
окно включения — выбираются только объекты, полностью находящиеся внутри окна.
окно пересечения — выбираются объекты, которые пересекаются или полностью находятся внутри окна.
 Этот класс позволяет точно определить тип операции выбора, что важно при реализации команд, где поведение зависит от режима: например, при фильтрации, анализе или визуальном выделении.
 Пример
C#
 Копировать Код
// Метод команды, которая проверяет способ выбора объектов чертежа [Teigha.Runtime.CommandMethod("CrossingOrWindowSelectedObjectExample")] public void CrossingOrWindowSelectedObjectExample() { // Создаём набор параметров для запроса PromptSelectionOptions options = new PromptSelectionOptions(); options.MessageForAdding = "Выберите объекты чертежа:"; // Создаём запрос пользователю PromptSelectionResult result = editor.GetSelection(options); // Если все данные введены верно, можно проанализировать контекст выбора if (result.Status == PromptStatus.OK) { SelectionSet selSet = result.Value; editor.WriteMessage( $"\nВыбрано объектов: {selSet.Count}"); foreach (SelectedObject selObj in selSet) { if (selObj is CrossingOrWindowSelectedObject cwObj) { if (cwObj.SelectionMethod == SelectionMethod.Window) editor.WriteMessage($"nОбъект {cwObj.ObjectId} выбран через окно."); else if (cwObj.SelectionMethod == SelectionMethod.Crossing) editor.WriteMessage($"nОбъект {cwObj.ObjectId} выбран через пересечение."); } } } else { editor.WriteMessage( "\nНе удалось получить выделение."); } }
 Методы
 Конструкторы
 HostMgd.EditorInput.CrossingOrWindowSelectedObject
 Имя
 Описание
 CrossingOrWindowSelectedObject
 Конструктор инициализирует новый экземпляр класса с указанием объекта, метода выбора и графического маркера.
 Топики
 Имя
 Описание
 SelectedObject Методы
 Ниже перечислены методы класса SelectedObject.
 SelectedObject Свойства
 Ниже перечислены свойства класса SelectedObject.
 HostMgd.EditorInput.CrossingOrWindowSelectedObject
 Имя
 Описание
 CrossingOrWindowSelectedObject Методы
 Ниже перечислены методы класса CrossingOrWindowSelectedObject.
 Ссылки
 CrossingOrWindowSelectedObject Методы, Методы, Топики, SelectedObject Методы, SelectedObject Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!