Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PointMonitorEventArgs.AppendToolTipText(string)
 Послать отзыв
 Метод добавляет строку текста подсказки к текущему событию, например, при отслеживании положения мыши.
 Синтаксис
C#
Visual Basic
Копировать Код
public void AppendToolTipText(string value);
Копировать Код
Public Sub AppendToolTipText(value As String)
 Параметры
 Параметры
 Описание
 value
 Строка текста, которую необходимо добавить к подсказке инструмента. Тип string
 Описание
 Метод используется для динамического добавления текстовой информации в подсказку (tooltip), которая отображается во время интерактивных операций в редакторе nanoCAD. Это позволяет выводить пользователю дополнительные сведения о текущем состоянии объекта или действия, например, координаты, параметры или статус операции. Метод может быть вызван несколько раз для формирования многострочного сообщения.
 Замечания
 Метод применяется в связке с событиями, поддерживающими отображение подсказок, такими как PointMonitor, и позволяет улучшить пользовательский интерфейс за счёт предоставления актуальной информации на лету.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события PointMonitor [Teigha.Runtime.CommandMethod("PointMonitorExample_AppendToolTipText")] public void PointMonitorExample_AppendToolTipText() { // Подписка на событие PointMonitor editor.PointMonitor += OnEditorPointMonitor; } // Реализация отработки события PointMonitor private void OnEditorPointMonitor(object sender, PointMonitorEventArgs e) { // Сохраняем положение курсора в переменную Point3d cursorPosition = e.Context.LastPoint; // Вывод сообщения в командную строку editor.WriteMessage( $"\nТекущая позиция мыши: {cursorPosition}"); // Добавляем текст-подсказку к отслеживанию положения курсора e.AppendToolTipText($"Текущая позиция: X={cursorPosition.X:F2}, Y={cursorPosition.Y:F2}, Z={cursorPosition.Z:F2}"); } }
 Ссылки
 HostMgd.EditorInput.PointMonitorEventArgs, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!