Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.DraggingEnded
 Послать отзыв
 Событие возникает при завершении пользователем операции перетаскивания объекта в чертеже. Событие не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public event DraggingEndedEventHandler DraggingEnded;
Копировать Код
Public Event DraggingEnded As DraggingEndedEventHandler
 Описание
 Событие предназначено для обработки действий, которые должны быть выполнены сразу после окончания интерактивной операции перетаскивания. Оно позволяет подписаться на уведомление о том, что пользователь отпустил мышь и перемещение объекта завершено. С помощью этого события можно выполнить финальные действия — например, зафиксировать новое положение объекта, обновить состояние или произвести визуальные изменения.
 Замечания
 В текущей версии не реализовано. Событие использует делегат DraggingEndedEventHandler, который передаёт расширенную информацию через объект DraggingEndedEventArgs.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события Dragging [Teigha.Runtime.CommandMethod("DraggingEndedExample")] public void DraggingEndedExample() { // Подписка на событие редактора DraggingEnded editor.DraggingEnded += OnEditorDraggingEnded; } // Реализация отработки события DraggingEnded private void OnEditorDraggingEnded(object sender, DraggingEndedEventArgs e) { // Вывод сообщения в командную строку editor.WriteMessage("\nПеретаскивание завершено."); } }
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!