Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.PlotConfigInfoCollection.Item
 Послать отзыв
 Свойство Item предоставляет или задаёт элемент коллекции с указанным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public HostMgd.PlottingServices.PlotConfigInfo this[int index];
Копировать Код
Public Property Item( index As Integer ) As HostMgd.PlottingServices.PlotConfigInfo
 Параметры
 Параметры
 Описание
 index
 Входной индекс требуемого элемента. Тип int. Значения индекса отсчитываются от нуля и должно иметь допустимое значение.
 Возвращает
 Возвращает элемент коллекции с указанным индексом. Тип HostMgd.PlottingServices.PlotConfigInfo.
 Описание
 Свойство Item предоставляет или задаёт элемент коллекции с указанным индексом.
 Ссылки
 HostMgd.PlottingServices.PlotConfigInfoCollection, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!