Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Делегат HostMgd.Publishing.InitPublishOptionsDialogEventHandler
 Послать отзыв
 This is type HostMgd::Publishing::InitPublishOptionsDialogEventHandler.
 Синтаксис
C#
Visual Basic
public delegate InitPublishOptionsDialogEventHandler();
Public Delegate Sub InitPublishOptionsDialogEventHandler()
 Ваши комментарии по поводу этого топика: Послать отзыв!