Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptKeywordOptions
 Послать отзыв
 Класс предоставляет параметры для настройки интерактивного ввода ключевого слова в nanoCAD, включая список допустимых вариантов и текст приглашения.
 Иерархия классов
HostMgd::EditorInput::PromptOptions HostMgd::EditorInput::PromptEditorOptions HostMgd::EditorInput::PromptKeywordOptions
 Синтаксис
C#
Visual Basic
Копировать Код
public sealed class PromptKeywordOptions : PromptEditorOptions
Копировать Код
Public NotInheritable Class PromptKeywordOptions Inherits PromptEditorOptions
 Описание
 Класс используется при вызове команд, требующих ввода ключевого слова — например, через метод GetString() с активированным режимом ключевых слов. Этот класс позволяет задать:
сообщение приглашения,
список локальных ключевых слов,
глобальные ключевые слова,
разрешение на пропуск ввода (AllowNone).
 Эти параметры позволяют реализовать диалог с пользователем, в котором он выбирает действие из заданного набора — например: "Да/Нет", "Включить/Отключить", "Создать/Открыть".
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("GetKeywordsExample")] public void GetKeywordsExample() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создаём запрос пользователю PromptKeywordOptions opts = new PromptKeywordOptions("Выберите действие"); opts.Keywords.Add("Open","Открыть"); opts.Keywords.Add("Save", "Сохранить"); opts.Keywords.Add("Exit", "Выход"); PromptResult pr = editor.GetKeywords(opts); // Если все данные введены, выводим результат в командную строку if (pr.Status == PromptStatus.OK) { editor.WriteMessage($"\nВыбрано: {pr.StringResult}"); } else { editor.WriteMessage("\nОперация отменена."); } } }
 Методы
 Конструкторы
 HostMgd.EditorInput.PromptKeywordOptions
 Имя
 Описание
 PromptKeywordOptions
 Это обзор перегрузок PromptKeywordOptions.
 Топики
 Имя
 Описание
 PromptOptions Методы
 Ниже перечислены методы класса PromptOptions.
 PromptOptions Свойства
 Ниже перечислены свойства класса PromptOptions.
 HostMgd.EditorInput.PromptKeywordOptions
 Имя
 Описание
 PromptKeywordOptions Свойства
 Ниже перечислены свойства класса PromptKeywordOptions.
 Ссылки
 PromptKeywordOptions Конструктор, PromptKeywordOptions Свойства, Методы, Топики, PromptOptions Методы, PromptOptions Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!