Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод CrossingOrWindowSelectedSubObject.ToString ()
 Послать отзыв
 Синтаксис
C#
Visual Basic
public String ToString();
Public Function ToString() As String
 Описание
 Возвращает строковое представление данного подобъекта.
 Метод не реализован.
 Ссылки
 CrossingOrWindowSelectedSubObject Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!