Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptKeywordOptions.AllowArbitraryInput
 Послать отзыв
 Свойство определяет, разрешён ли ввод пользователем произвольной строки, не входящей в список ключевых слов.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool AllowArbitraryInput { get; set; }
Копировать Код
Public Property AllowArbitraryInput As Boolean
 Возвращает
 Возвращает значение типа bool:
true — произвольный ввод строки разрешён.
false — пользователь обязан выбрать значение из списка или ввести глобальную команду.
 Описание
 Свойство позволяет указать, может ли пользователь ввести текст, не совпадающий ни с одним из ключевых слов, указанных в коллекции Keywords. Если свойство установлено в true, пользователь может ввести любую строку — она будет доступна через StringResult при завершении ввода. Если false — ввод разрешается только из числа предопределённых ключевых или глобальных слов.
 Условия
 Чтение и запись
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("PromptKeywordOptionsExample_AllowArbitraryInput")] public void PromptKeywordOptionsExample_AllowArbitraryInput() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создаём запрос пользователю PromptKeywordOptions options = new PromptKeywordOptions("Введите имя слоя или выберите [Новый/По умолчанию]:"); // Разрешить ввод произвольного текста options.AllowArbitraryInput = true; // Вызываем метод GetKeywords() для запроса пользователю PromptResult result = editor.GetKeywords(options); // Если все данные введены, выводим результат в командную строку if (result.Status == PromptStatus.OK) { editor.WriteMessage($"\nВведено имя слоя: {result.StringResult}"); } else if (result.Status == PromptStatus.Keyword) { editor.WriteMessage($"\nВыбрано: {result.StringResult}"); } } }
 Ссылки
 HostMgd.EditorInput.PromptKeywordOptions, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!