Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор PaletteSet.PaletteSet (System::String^, System::String^, System::Guid)
 Послать отзыв
 Конструктор класса
 Синтаксис
C#
Visual Basic
public PaletteSet(ref System.String name, ref System.String cmd, System.Guid toolID);
Public Sub New(ByRef name As System.String, ByRef cmd As System.String, toolID As System.Guid)
 Ссылки
 PaletteSet Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!