Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство AboutToBeginBackgroundPublishingEventArgs.DsdData
 Послать отзыв
 This is DsdData, a member of class AboutToBeginBackgroundPublishingEventArgs.
 Синтаксис
C#
Visual Basic
public HostMgd::PlottingServices::DsdData DsdData;
Public Property DsdData() As HostMgd.PlottingServices.DsdData
 Ссылки
 AboutToBeginBackgroundPublishingEventArgs Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!