Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.Application.RemoveDefaultContextMenuExtension(ContextMenuExtension)
 Послать отзыв
 Метод предназначен для удаления пункта контекстного меню из контекстного меню по умолчанию.
 Синтаксис
C#
Visual Basic
Копировать Код
public static void RemoveDefaultContextMenuExtension(ContextMenuExtension menuExtension);
Копировать Код
Public Shared Sub RemoveDefaultContextMenuExtension(menuExtension As ContextMenuExtension)
 Параметры
 Параметры
 Описание
 menuExtension
 Пункт контекстного меню, который должен быть удален из меню по умолчанию
 Описание
 Метод удаляет пункт контекстного меню из контекстного меню по умолчанию.
 Ссылки
 HostMgd.ApplicationServices.Application, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!