Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptDoubleOptions.PromptDoubleOptions(string)
 Послать отзыв
 Конструктор инициализирует новый экземпляр класса с заданным приглашающим сообщением для ввода вещественного числа.
 Синтаксис
C#
Visual Basic
Копировать Код
public PromptDoubleOptions(string message);
Копировать Код
Public Sub New(message As String)
 Параметры
 Параметры
 Описание
 message
 Текст приглашения, отображаемый в командной строке при запросе ввода вещественного числа. Может содержать инструкции или пояснения для пользователя.
 Пример
 "Введите значение угла (в градусах):". Тип string
 Описание
 Конструктор создаёт объект класса PromptDoubleOptions, который используется при вызове метода GetDouble() или других команд, требующих интерактивного ввода вещественного числа в nanoCAD. Он устанавливает текст приглашения, отображаемый пользователю в командной строке, а все остальные параметры (например, DefaultValue, LowerLimit, AllowNone) инициализируются значениями по умолчанию.
 Этот конструктор является основным способом задания начального сообщения, которое подсказывает пользователю, какое значение требуется ввести — например, "Введите коэффициент масштабирования:" или "Укажите толщину линии:".
 После создания объекта его параметры можно дополнительно настроить перед передачей в команду ввода.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("PromptDoubleOptionsExample_string")] public void PromptDoubleOptionsExample_string() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создаём запрос пользователю PromptDoubleOptions options = new PromptDoubleOptions("\nВведите значение масштаба:"); options.DefaultValue = 1.0; options.UseDefaultValue = true; PromptDoubleResult result = editor.GetDouble(options); // Если все данные введены, выводим результат в командную строку if (result.Status == PromptStatus.OK) { double scale = result.Value; editor.WriteMessage( $"\nЗначение масштаба: {scale}"); } else { editor.WriteMessage("\nОперация отменена."); } }
 Ссылки
 HostMgd.EditorInput.PromptDoubleOptions, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!