Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство TrayItemCollection.Count
 Послать отзыв
 This is Count, a member of class TrayItemCollection.
 Синтаксис
C#
Visual Basic
public int Count;
Public Property Count() As Integer
 Ссылки
 TrayItemCollection Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!