Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.PlotConfigInfoCollection.GetEnumerator
 Послать отзыв
 Метод предоставляет перечислитель для данной коллекции.
 Синтаксис
C#
Visual Basic
Копировать Код
public System.Collections.IEnumerator GetEnumerator();
Копировать Код
Public Function GetEnumerator() As System.Collections.IEnumerator
 Возвращает
 Возвращает перечислитель для данной коллекции. Тип System.Collections.IEnumerator.
 Описание
 Метод предоставляет перечислитель для данной коллекции.
 Ссылки
 HostMgd.PlottingServices.PlotConfigInfoCollection, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!