Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.Document.Create(IntPtr)
 Послать отзыв
 Метод предназначен для создания нового документа по указателю.
 Синтаксис
C#
Visual Basic
public Document Create(System.IntPtr unmanagedPointer);
Public Function Create(unmanagedPointer As System.IntPtr) As Document
 Параметры
 Параметры
 Описание
 unmanagedPointer
 Небезопасный указатель. Тип IntPtr
 Возвращает
 Возвращает созданный объект. Тип Document
 Описание
 Метод созданет новый безопасноый объект по значению небезопасного указателя.
 Ссылки
 HostMgd.ApplicationServices.Document, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!