Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.InplaceTextEditor.SimpleMText
 Послать отзыв
 Свойство SimpleMText позволяет проверить, является ли текущий объект в редакторе объектом MTEXT. В текущей версии не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool SimpleMText;
Копировать Код
Public ReadOnly Property SimpleMText As Boolean
 Возвращает
 Возвращает true, если в редакторе текущим является объект MTEXT. В противном случае возвращает false.
 Описание
 Свойство SimpleMText позволяет проверить, является ли текущий объект в редакторе объектом MTEXT. В текущей версии не реализовано.
 Условия
 Только чтение.
 Ссылки
 HostMgd.ApplicationServices.InplaceTextEditor, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!