Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptSelectionResult.Status
 Послать отзыв
 Свойство возвращает статус завершения операции выбора объектов, указывая на успешное выполнение, отмену или ошибку.
 Синтаксис
C#
Visual Basic
Копировать Код
public PromptStatus Status { get; }
Копировать Код
Public ReadOnly Property Status As PromptStatus
 Возвращает
 Возвращает значение из перечисления PromptStatus, которое может принимать следующие значения:
PromptStatus.OK — операция выполнена успешно, и выборка содержит допустимые объекты.
PromptStatus.Cancel — пользователь отменил операцию (например, нажав Esc).
PromptStatus.Error — произошла ошибка ввода (например, некорректный ввод с клавиатуры).
PromptStatus.None — результат не определён или операция не завершена.
PromptStatus.Keyword — введено ключевое слово вместо выбора объектов.
PromptStatus.Timeout — операция прервана по таймауту.
 Описание
 Свойство используется для определения результата интерактивной операции выбора объектов — например, после вызова метода GetSelection() или при обработке события PromptedForSelection. Оно предоставляет информацию о том, как была завершена операция: успешно (OK), отменена пользователем (Cancel) или прервана из-за ошибки (Error). Свойство доступно только для чтения и автоматически устанавливается системой nanoCAD по завершении операции.
 Это свойство играет ключевую роль при проверке допустимости выборки перед выполнением последующих действий над объектами чертежа.
 Условия
 Только чтение
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("PromptSelectionResultExample_Status")] public void PromptSelectionResultExample_Status() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создаём запрос пользователю PromptSelectionResult result = editor.GetSelection(); // Если все данные введены, выводим результат в командную строку if (result.Status == PromptStatus.OK) { SelectionSet selSet = result.Value; editor.WriteMessage( $"\nВыбрано объектов: {selSet.Count}"); } else { editor.WriteMessage( "\nНе удалось получить выделение."); } } }
 Ссылки
 HostMgd.EditorInput.PromptSelectionResult, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!