Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство SelectionSet.Count
 Послать отзыв
 Синтаксис
C#
Visual Basic
public int Count;
Public Property Count() As Integer
 Описание
 Возвращает количество элементов, реально содержащихся в выбранном наборе.
 Условия
 Только на чтение
 Ссылки
 SelectionSet Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!