Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор FenceSelectedSubObject.FenceSelectedSubObject
 Послать отзыв
 Синтаксис
C#
Visual Basic
public FenceSelectedSubObject(ref Teigha::DatabaseServices::FullSubentityPath path, HostMgd::EditorInput::SelectionMethod method, int gsMarker, ref array<HostMgd::EditorInput::PickPointDescriptor^> descriptors);
Public Sub New(ByRef path As Teigha.DatabaseServices.FullSubentityPath, method As HostMgd.EditorInput.SelectionMethod, gsMarker As Integer, ByRef descriptors As array<HostMgd.EditorInput.PickPointDescriptor^>)
 Параметры
 Параметры
 Описание
 path
 Путь к вложенному объкту
 method
 Метод выбора
 gsMarker
 GS маркер
 descriptors
 Точки ломаной линии
 Описание
 Конструктор.
 Ссылки
 FenceSelectedSubObject Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!