Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод MenuItemCollection.Add (HostMgd::Windows::MenuItem^)
 Послать отзыв
 This is Add, a member of class MenuItemCollection.
 Синтаксис
C#
Visual Basic
public int Add(ref HostMgd::Windows::MenuItem value);
Public Function Add(ByRef value As HostMgd.Windows.MenuItem) As Integer
 Ссылки
 MenuItemCollection Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!