Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.DocumentBeginCloseEventArgs
 Послать отзыв
 Класс предоставляет данные для события BeginDocumentClose класса Document.
 Иерархия классов
HostMgd::ApplicationServices::DocumentBeginCloseEventArgs
 Синтаксис
C#
Visual Basic
Копировать Код
public sealed class DocumentBeginCloseEventArgs : EventArgs
Копировать Код
Public NotInheritable Class DocumentBeginCloseEventArgs Inherits EventArgs
 Описание
 Класс DocumentBeginCloseEventArgs является наследником класса EventArgs и в .NET API nanoCAD используется совместно с событием BeginDocumentClose и делегатом DocumentBeginCloseEventHandler для реализации процедур, предшествующих закрытию документа. В частности, позволяет при необходимости остановить закрытие документа, воспользовавшись методом DocumentBeginCloseEventArgs.Veto().
 Методы
 Конструкторы
 Имя
 Описание
 DocumentBeginCloseEventArgs
 Конструктор по умолчанию класса DocumentBeginCloseEventArgs.
 Топики
 Имя
 Описание
 DocumentBeginCloseEventArgs Методы
 Ниже перечислены методы класса DocumentBeginCloseEventArgs.
 Ссылки
 DocumentBeginCloseEventArgs Методы, Методы, Топики, DocumentBeginCloseEventArgs Методы
 Ваши комментарии по поводу этого топика: Послать отзыв!