Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод PublishEntityEventArgs.GetNode
 Послать отзыв
 This is GetNode, a member of class PublishEntityEventArgs.
 Синтаксис
C#
Visual Basic
public HostMgd::Publishing::DwfNode GetNode(int nodeId);
Public Function GetNode(nodeId As Integer) As HostMgd.Publishing.DwfNode
 Ссылки
 PublishEntityEventArgs Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!