Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство TrayItemBubbleWindow.HyperLink
 Послать отзыв
 This is HyperLink, a member of class TrayItemBubbleWindow.
 Синтаксис
C#
Visual Basic
public System.String HyperLink;
Public Property HyperLink() As System.String
 Ссылки
 TrayItemBubbleWindow Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!