Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Перечисление HostMgd.EditorInput.SelectionFlags
 Послать отзыв
 Синтаксис
C#
Visual Basic
public enum SelectionFlags { Duplicates = 2, FailedPickAuto = 0x200, NestedEntities = 4, Normal = 0, PickfirstSet = 0x20, PickPoints = 1, PreviousSet = 0x40, SinglePick = 0x10, SubEntities = 8, SubSelection = 0x80, Undo = 0x100 }
Public Enum SelectionFlags Duplicates = 2 FailedPickAuto = &H200 NestedEntities = 4 Normal = 0 PickfirstSet = &H20 PickPoints = 1 PreviousSet = &H40 SinglePick = &H10 SubEntities = 8 SubSelection = &H80 Undo = &H100 End Enum
 Члены
 Члены
 Описание
 Duplicates
 Разрешен повторяющийся выбор
 FailedPickAuto
 Выбор завершен в результате отсутствия базовой точки в режиме PICKAUTO, после чего nanoCAD выполняет следующее действие по выбору по пересечению или включении в окно в соответствии со следующей базовой точкой
 NestedEntities
 Разрешен выбор вложенных геометрических объектов
 Normal
 Обычный режим выбора геометрических объектов
 PickfirstSet
 Используется набор Pickfirst
 PickPoints
 Требуются настоящие базовые точки
 PreviousSet
 Предыдущий выбранный набор
 SinglePick
 Требует одиночной базовой точки
 SubEntities
 Требуется выбор набора геометричесих подобъектов
 SubSelection
 Когда этот признак установлен, указывает, что параметр ":U" был использован при вызове HostSSGet() и что полученный набор выбранных объектов может содержать информацию о геометрических подобъектах
 Undo
 nanoCAD выполняет операцию отката выбора
 Описание
 Это перечисление содержит битовые признаки для процесса выбора геометрических объектов. Эти данные используются методами, которые добавляют или удаляют геометрические объекты из поднабора выбора.
 Члены
 Описание
 Duplicates = 2
 Разрешен повторяющийся выбор
 FailedPickAuto = 0x200
 Выбор завершен в результате отсутствия базовой точки в режиме PICKAUTO, после чего nanoCAD выполняет следующее действие по выбору по пересечению или включении в окно в соответствии со следующей базовой точкой
 NestedEntities = 4
 Разрешен выбор вложенных геометрических объектов
 Normal = 0
 Обычный режим выбора геометрических объектов
 PickfirstSet = 0x20
 Используется набор Pickfirst
 PickPoints = 1
 Требуются настоящие базовые точки
 PreviousSet = 0x40
 Предыдущий выбранный набор
 SinglePick = 0x10
 Требует одиночной базовой точки
 SubEntities = 8
 Требуется выбор набора геометричесих подобъектов
 SubSelection = 0x80
 Когда этот признак установлен, указывает, что параметр ":U" был использован при вызове HostSSGet() и что полученный набор выбранных объектов может содержать информацию о геометрических подобъектах
 Undo = 0x100
 nanoCAD выполняет операцию отката выбора
 Ваши комментарии по поводу этого топика: Послать отзыв!