Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.DsdData.SelectionSetName
 Послать отзыв
 Свойство SelectionSetName представляет имя именованного набора листов. Не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public System.String SelectionSetName;
Копировать Код
Public Property SelectionSetName As System.String
 Возвращает
 Возвращает имя набора листов. Тип System.String.
 Описание
 Свойство SelectionSetName представляет имя именованного набора листов. Это поле действительно только при публикации подшивки или публикации выбранных листов из диспетчера подшивок.
 В текущей версии не реализовано.
 Условия
 Чтение и запись.
 Ссылки
 HostMgd.PlottingServices.DsdData, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!