Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод DocumentWindowIterator.MoveNext
 Послать отзыв
 Перемещение указателя в следующую позицию.
 Синтаксис
C#
Visual Basic
public bool MoveNext();
Public Function MoveNext() As bool
 Описание
 При выходе за пределы коллекции, возвращает "ложь".
 Ссылки
 DocumentWindowIterator Класс, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!