Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.Document.AcadDocument
 Послать отзыв
 Свойство предоставляет доступ к COM-объекту активного dwg-документа.
 Синтаксис
C#
Visual Basic
public System.Object AcadDocument;
Public Property AcadDocument() As System.Object
 Возвращает
 Возвращает интерфейс IDispatch документа. Тип System.Object
 Описание
 Свойство предоставляет доступ к COM-объекту активного dwg-документа.
 Условия
 Только чтение.
 Ссылки
 HostMgd.ApplicationServices.Document, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!