Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод PublishEntityEventArgs.GetCurrentEntityNode
 Послать отзыв
 This is GetCurrentEntityNode, a member of class PublishEntityEventArgs.
 Синтаксис
C#
Visual Basic
public HostMgd::Publishing::DwfNode GetCurrentEntityNode(ref Teigha::DatabaseServices::ObjectIdCollection objIds);
Public Function GetCurrentEntityNode(ByRef objIds As Teigha.DatabaseServices.ObjectIdCollection) As HostMgd.Publishing.DwfNode
 Ссылки
 PublishEntityEventArgs Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!