Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Делегат HostMgd.Publishing.EndEntityEventHandler
 Послать отзыв
 This is type HostMgd::Publishing::EndEntityEventHandler.
 Синтаксис
C#
Visual Basic
public delegate EndEntityEventHandler();
Public Delegate Sub EndEntityEventHandler()
 Ваши комментарии по поводу этого топика: Послать отзыв!