Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Класс HostMgd.Windows.DropTarget
 Послать отзыв
 Приложение получает из этого класса орудие поведения при операции перетаскивания
 Иерархия классов
HostMgd::Windows::DropTarget
 Синтаксис
C#
Visual Basic
public class DropTarget;
Public Class DropTarget
 Методы
 Конструкторы
 Имя
 Описание
 DropTarget
 This is DropTarget, a member of class DropTarget.
 Топики
 Имя
 Описание
 DropTarget Методы
 Ниже перечислены методы класса DropTarget.
 Ссылки
 DropTarget Методы, Методы, Топики, DropTarget Методы
 Ваши комментарии по поводу этого топика: Послать отзыв!