Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptKeywordOptions.PromptKeywordOptions(string)
 Послать отзыв
 Конструктор инициализирует новый экземпляр класса с заданным приглашающим сообщением для ввода ключевого слова.
 Синтаксис
C#
Visual Basic
Копировать Код
public PromptKeywordOptions(string message);
Копировать Код
Public Sub New(message As String)
 Параметры
 Параметры
 Описание
 message
 Текст приглашения, отображаемый пользователю перед вводом ключевого слова. Может содержать инструкцию или вопрос,
 например
 "Продолжить операцию?". Тип string
 Описание
 Конструктор создаёт объект класса PromptKeywordOptions, используемый при настройке операции ввода ключевого слова в nanoCAD. Он устанавливает текст приглашения, который отображается пользователю в командной строке перед выбором из списка доступных ключевых слов. После создания объекта можно добавить ключевые слова через коллекцию Keywords, задать глобальные команды и настроить поведение ввода.
 Этот конструктор является основным способом инициализации параметров при реализации диалоговых команд, где требуется выбор действия — например, "Да/Нет", "Включить/Отключить", "Создать/Открыть".
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("PromptKeywordOptionsExample_string")] public void PromptKeywordOptionsExample_string() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создаём запрос пользователю PromptKeywordOptions opts = new PromptKeywordOptions("Выберите действие"); opts.Keywords.Add("Open","Открыть"); opts.Keywords.Add("Save", "Сохранить"); opts.Keywords.Add("Exit", "Выход"); PromptResult pr = editor.GetKeywords(opts); // Если все данные введены, выводим результат в командную строку if (pr.Status == PromptStatus.OK) { editor.WriteMessage($"\nВыбрано: {pr.StringResult}"); } else { editor.WriteMessage("\nОперация отменена."); } } }
 Ссылки
 HostMgd.EditorInput.PromptKeywordOptions, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!