Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство ImageInfo.ResourceFile
 Послать отзыв
 This is ResourceFile, a member of class ImageInfo.
 Синтаксис
C#
Visual Basic
public System.String ResourceFile;
Public Property ResourceFile() As System.String
 Ссылки
 ImageInfo Класс, HostMgd.Windows.ToolPalette
 Ваши комментарии по поводу этого топика: Послать отзыв!