Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.Document.LockMode()
 Послать отзыв
 Метод позволяет приложению определить, установлены ли в dwg-документе какие-либо блокировки.
 Синтаксис
C#
Visual Basic
public DocumentLockMode LockMode();
Public Function LockMode() As DocumentLockMode
 Возвращает
 Возвращает самый высокий уровень блокировки, установленный исполняемым контекстом. Тип DocumentLockMode
 Описание
 Метод проверяет, установлены ли в dwg-документе какие-либо блокировки. При проверке учитывается возможность испольняемого контекста переопределить собственные блокировки. Если контекст имеет право на монопольную запись, он может задать и другую блокировку документа.
 Ссылки
 HostMgd.ApplicationServices.Document, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!