Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptPointResultEventArgs
 Послать отзыв
 Класс предоставляет данные для события, возникающего после завершения интерактивного ввода точки пользователем в редакторе nanoCAD.
 Иерархия классов
HostMgd::EditorInput::PromptPointResultEventArgs
 Синтаксис
C#
Visual Basic
Копировать Код
public sealed class PromptPointResultEventArgs : EventArgs
Копировать Код
Public NotInheritable Class PromptPointResultEventArgs Inherits EventArgs
 Описание
 Класс наследуется от EventArgs и используется для передачи информации о результате операции ввода точки (Point3d) в событиях, таких как PromptedForCorner, PromptedForPoint и других. Он содержит значение точки в мировой системе координат (WCS), статус выполнения операции, а также дополнительные параметры команды, такие как приглашение к вводу и строковое представление введённых данных. Этот класс позволяет разработчикам надстроек nanoCAD обрабатывать результат выбора или ввода точки пользователем — например, при построении геометрии, выделении объектов или отрисовке временных элементов.
 Замечания
 Этот класс часто применяется совместно с делегатом PromptPointResultEventHandler для обработки событий ввода точек в реальном времени.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события PromptedForCorner [Teigha.Runtime.CommandMethod("PromptedForCornerExample")] public void PromptedForCornerExample() { // Подписка на событие PromptedForCorner editor.PromptedForCorner += OnEditorPromptedForCorner; } // Реализация отработки события PromptedForCorner private void OnEditorPromptedForCorner(object sender, PromptPointResultEventArgs e) { // Вывод сообщения в командную строку if (e.Result.Status == PromptStatus.OK) { editor.WriteMessage($"\nУказана точка: {e.Result.Value}"); } else { editor.WriteMessage("\nВвод точки отменён."); } } }
 Топики
 Имя
 Описание
 PromptPointResultEventArgs Свойства
 Ниже перечислены свойства класса PromptPointResultEventArgs.
 Ссылки
 PromptPointResultEventArgs Свойства, Топики, PromptPointResultEventArgs Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!