Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.GetEntity(PromptEntityOptions)
 Послать отзыв
 Метод приглашает пользователя выбрать геометрический объект указанием точки на нём и возвращает информацию о выбранном объекте и точке выбора.
 Синтаксис
C#
Visual Basic
Копировать Код
public PromptEntityResult GetEntity(PromptEntityOptions options);
Копировать Код
Public Function GetEntity(options As PromptEntityOptions) As PromptEntityResult
 Параметры
 Параметры
 Описание
 options
 Объект, содержащий параметры приглашения:
 Возвращает
 Возвращает объект типа PromptEntityResult, который содержит:
Status — статус операции (OK, Cancel, Error и др.).
ObjectId — идентификатор выбранного объекта (если операция успешна).
PickedPoint — координата точки, указанной пользователем на объекте (Point3d).
 Если пользователь отменил операцию или был выбран недопустимый объект, статус будет отличаться от OK.
 Описание
 Метод используется для интерактивного выбора пользователем одного геометрического объекта на чертеже с помощью указания мышью. Метод ожидает ввод от пользователя до тех пор, пока не будет выбран допустимый объект или операция не будет прервана. Поддерживаются только графические объекты — неграфические элементы игнорируются. Настройка поведения выбора осуществляется через параметр PromptEntityOptions.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("GetEntityExample_PromptEntityOptions")] public void GetEntityExample_PromptEntityOptions() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создаём запрос пользователю PromptEntityOptions options = new PromptEntityOptions("\nВыберите объект:"); PromptEntityResult result = editor.GetEntity(options); // Если все данные введены, выводим результат в командную строку if (result.Status == PromptStatus.OK) { editor.WriteMessage( $"\nВыбран объект с ID: {result.ObjectId}, точка: {result.PickedPoint}"); } else { editor.WriteMessage( "\nОперация выбора отменена или объект не найден."); } } }
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!