Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.Document.CloseWillStart
 Послать отзыв
 Событие, возникающее тогда же, когда и событие BeginDocumentClose.
 Синтаксис
C#
Visual Basic
public event EventHandler CloseWillStart;
Public Event CloseWillStart As EventHandler
 Возвращает
 Возвращает тип данных EventHandler
 Описание
 Событие, возникающее тогда же, когда и событие BeginDocumentClose. Соответствует функции NRX API NcEditorReactor2.docCloseWillStart().
 Ссылки
 HostMgd.ApplicationServices.Document, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!