Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptForEntityEndingEventArgs.Result
 Послать отзыв
 Свойство предоставляет доступ к результату операции выбора объекта, включая статус и данные о выбранном элементе.
 Синтаксис
C#
Visual Basic
Копировать Код
public PromptEntityResult Result { get; }
Копировать Код
Public ReadOnly Property Result As PromptEntityResult
 Возвращает
 Возвращает объект типа PromptEntityResult, который может содержать:
Status — статус выполнения (PromptStatus.OK, PromptStatus.Cancel, PromptStatus.Error и др.).
ObjectId — идентификатор выбранного объекта.
PickedPoint — координата точки, в которой был выбран объект.
InputString — строковое значение, если операция завершилась вводом с клавиатуры.
 Если операция не была выполнена или произошла ошибка, результат может быть равен null или содержать статус Cancel.
 Описание
 Свойство возвращает объект типа PromptEntityResult, который содержит информацию о результате интерактивной операции выбора геометрического объекта — например, после вызова методов GetEntity() или других команд, где пользователь выбирает объект мышью. Статус операции (успех, отмена, ошибка) и данные о выбранной точке или объекте становятся доступны через это свойство. Оно используется, в том числе при обработке событий PromptForEntityEnding.
 Условия
 Только чтение
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события PromptForEntityEnding [Teigha.Runtime.CommandMethod("PromptForEntityEndingExample_Result")] public void PromptForEntityEndingExample_Result() { // Подписка на событие PromptForEntityEnding editor.PromptForEntityEnding += OnEditorPromptForEntityEnding; } // Реализация отработки события PromptForEntityEnding private void OnEditorPromptForEntityEnding(object sender, PromptForEntityEndingEventArgs e) { // Получаем доступ к результатам запроса PromptEntityResult eResult = e.Result; if (!eResult.ObjectId.IsNull) { // Вывод сообщения в командную строку editor.WriteMessage( $"\nВыбран объект: {eResult.ObjectId.ObjectClass.Name}"); } } }
 Ссылки
 HostMgd.EditorInput.PromptForEntityEndingEventArgs, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!