Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.Windows.ToolPalette.CustomToolBase.SetEditorWindow
 Послать отзыв
 Метод вызывается непосредственно перед отображением диалогового окна редактора свойств инструмента. Использует входные указатели окна редактора и инспектора свойств. Не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetEditorWindow( System.IntPtr editorWindow, ref System.Object propertyInspector );
Копировать Код
Public Overridable Sub SetEditorWindow( editorWindow As System.IntPtr, ByRef propertyInspector As System.Object )
 Параметры
 Параметры
 Описание
 editorWindow
 Входной указатель окна редактора свойств. Тип System.IntPtr.
 propertyInspector
 Входной объект инспектора свойств. Тип System.Object.
 Описание
 Метод вызывается непосредственно перед отображением диалогового окна редактора свойств инструмента. Он использует входной указатель окна редактора и входной указатель инспектора свойств. Инструмент может кэшировать эти значения для использования в процессе редактирования.
 В текущей версии не реализован.
 Ссылки
 HostMgd.Windows.ToolPalette.CustomToolBase, HostMgd.Windows.ToolPalette
 Ваши комментарии по поводу этого топика: Послать отзыв!