Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PublishSheetEventArgs.LayoutBoundsMinX
 Послать отзыв
 This is LayoutBoundsMinX, a member of class PublishSheetEventArgs.
 Синтаксис
C#
Visual Basic
public double LayoutBoundsMinX;
Public Property LayoutBoundsMinX() As Double
 Ссылки
 PublishSheetEventArgs Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!