Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.EndPlotEventArgs.EndPlotEventArgs
 Послать отзыв
 Конструктор класса EndPlotEventArgs.
 Синтаксис
C#
Visual Basic
Копировать Код
public EndPlotEventArgs( HostMgd.PlottingServices.PlotCancelStatus status );
Копировать Код
Public Sub New( status As HostMgd.PlottingServices.PlotCancelStatus )
 Параметры
 Параметры
 Описание
 status
 Входное значение из перечисления HostMgd.PlottingServices.PlotCancelStatus.
 Описание
 Конструктор класса EndPlotEventArgs. Создает экземпляр класса с указанным значением флага HostMgd.PlottingServices.PlotCancelStatus.
 Ссылки
 HostMgd.PlottingServices.EndPlotEventArgs, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!