Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод TrayItemCollection.Add (TrayItem^)
 Послать отзыв
 This is Add, a member of class TrayItemCollection.
 Синтаксис
C#
Visual Basic
public int Add(ref TrayItem value);
Public Function Add(ByRef value As TrayItem) As Integer
 Ссылки
 TrayItemCollection Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!