Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PickPointDescriptor.Direction
 Послать отзыв
 Синтаксис
C#
Visual Basic
public Teigha::Geometry::Vector3d Direction;
Public Property Direction() As Teigha.Geometry.Vector3d
 Описание
 Возвращает вектор, который описывает направление линии или направление и длину для луча и отрезка линии.
 Условия
 Только на чтение
 Ссылки
 PickPointDescriptor Структура, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!