Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод UserConfigurationManager.OpenCurrentProfile
 Послать отзыв
 This is OpenCurrentProfile, a member of class UserConfigurationManager.
 Синтаксис
C#
Visual Basic
public IConfigurationSection OpenCurrentProfile();
Public Function OpenCurrentProfile() As IConfigurationSection
 Ссылки
 UserConfigurationManager Класс, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!