Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PaneCollection.IsReadOnly
 Послать отзыв
 This is IsReadOnly, a member of class PaneCollection.
 Синтаксис
C#
Visual Basic
public bool IsReadOnly;
Public Property IsReadOnly() As bool
 Ссылки
 PaneCollection Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!