Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Класс HostMgd.PlottingServices.PlotConfigManager
 Послать отзыв
 Класс реализует доступ к конфигурациям печати, таблицам стилей печати, устройствам и PC3 файлам, установленным в системе.
 Иерархия классов
HostMgd::PlottingServices::PlotConfigManager
 Синтаксис
C#
Visual Basic
[Wrapper("AcPlPlotConfigManager")] public class PlotConfigManager;
<Wrapper("AcPlPlotConfigManager")> Public Class PlotConfigManager
 Описание
 Имеет только статические методы и свойства.
 Топики
 Имя
 Описание
 PlotConfigManager Методы
 Ниже перечислены методы класса PlotConfigManager.
 PlotConfigManager Свойства
 Ниже перечислены свойства класса PlotConfigManager.
 Ссылки
 PlotConfigManager Методы, PlotConfigManager Свойства, Топики, PlotConfigManager Методы, PlotConfigManager Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!