Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.DisposableSelectionSet
 Послать отзыв
 Класс DisposableSelectionSet представляет набор выделенных в редакторе nanoCAD объектов, в котором реализован интерфейс IDisposable для корректного освобождения связанных ресурсов. В текущей версии этот класс не реализован.
 Иерархия классов
HostMgd::EditorInput::DisposableSelectionSet
 Синтаксис
C#
Visual Basic
Копировать Код
public sealed class DisposableSelectionSet : IDisposable
Копировать Код
Public NotInheritable Class DisposableSelectionSet Implements IDisposable
 Описание
 Класс DisposableSelectionSet представляет набор выделенных в редакторе nanoCAD объектов, в котором реализован интерфейс IDisposable для корректного освобождения связанных ресурсов.
 В текущей версии не реализован.
 Методы
 Конструкторы
 Имя
 Описание
 DisposableSelectionSet
 Конструктор класса DisposableSelectionSet.
 Ссылки
 Методы
 Ваши комментарии по поводу этого топика: Послать отзыв!