Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.DsdData.GetDsdEntryCollection
 Послать отзыв
 Метод предназначен для получения коллекции листов, настроенных для публикации. Не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public HostMgd.PlottingServices.DsdEntryCollection GetDsdEntryCollection();
Копировать Код
Public Function GetDsdEntryCollection() As HostMgd.PlottingServices.DsdEntryCollection
 Возвращает
 Возвращает коллекцию листов, сохранённых в данном объекте. Тип HostMgd.PlottingServices.DsdEntryCollection.
 Описание
 Метод предназначен для получения коллекции листов, настроенных для публикации. Каждый лист представлен в этой коллекции своим объектом DsdEntry.
 В текущей версии не реализован.
 Ссылки
 HostMgd.PlottingServices.DsdData, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!