Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод PlotProgressDialog.OnEndPlot
 Послать отзыв
 Закрытие формы процесса печати.
 Синтаксис
C#
Visual Basic
public void OnEndPlot();
Public Sub OnEndPlot()
 Описание
 Ссылки
 PlotProgressDialog Класс, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!