Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.HostAppServices.PlotLogger
 Послать отзыв
 Свойство PlotLogger возвращает объект логгера печати PlotLogger.
 Синтаксис
C#
Visual Basic
Копировать Код
public static HostMgd.PlottingServices.PlotLogger PlotLogger;
Копировать Код
Public Shared ReadOnly Property PlotLogger As HostMgd.PlottingServices.PlotLogger
 Возвращает
 Возвращает ссылку на логгер печати. Тип HostMgd.PlottingServices.PlotLogger.
 Описание
 Приложения реализуют это свойство, чтобы возвращать ссылку на объект PlotLogger. Как правило, за создание экземпляра PlotLogger отвечает хост-приложение.
 Условия
 Только чтение.
 Ссылки
 HostMgd.PlottingServices.HostAppServices, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!