Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Класс HostMgd.PlottingServices.PlotProgressDialog
 Послать отзыв
 Класс реализующий интерфейс визуализации процесса печати.
 Иерархия классов
Teigha::Runtime::DisposableWrapper HostMgd::PlottingServices::PlotProgress HostMgd::PlottingServices::PlotProgressDialog
 Синтаксис
C#
Visual Basic
public class PlotProgressDialog : HostMgd::PlottingServices::PlotProgress;
Public Class PlotProgressDialog Inherits HostMgd.PlottingServices.PlotProgress
 Описание
 Методы
 Конструкторы
 Класс HostMgd.PlottingServices.PlotProgressDialog
 Имя
 Описание
 PlotProgressDialog
 This is PlotProgressDialog, a member of class PlotProgressDialog.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Класс HostMgd.PlottingServices.PlotProgress
 Имя
 Описание
 PlotProgress Методы
 Ниже перечислены методы класса PlotProgress.
 PlotProgress Свойства
 Ниже перечислены свойства класса PlotProgress.
 Класс HostMgd.PlottingServices.PlotProgressDialog
 Имя
 Описание
 PlotProgressDialog Методы
 Ниже перечислены методы класса PlotProgressDialog.
 PlotProgressDialog Свойства
 Ниже перечислены свойства класса PlotProgressDialog.
 Ссылки
 PlotProgressDialog Методы, PlotProgressDialog Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!