Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.PauseToken
 Послать отзыв
 Поле представляет строковый маркер, используемый для приостановки выполнения команды в методе RunCommand() с целью ожидания пользовательского ввода.
 Синтаксис
C#
Visual Basic
Копировать Код
public literal String PauseToken = "\";
Копировать Код
Public PauseToken As literal String = "\"
 Описание
 PauseToken — это константа типа string, которая по умолчанию определена как обратный слеш ("\). Она может быть передана в метод RunCommand() для вставки паузы в выполнение команды, что позволяет приостановить выполнение и ожидать интерактивного ввода пользователя.
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!