Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptEntityResult.ToString()
 Послать отзыв
 Метод возвращает строковое представление результата выбора объекта, включая идентификатор и координаты точки выбора.
 Синтаксис
C#
Visual Basic
Копировать Код
public override string ToString();
Копировать Код
Public Overrides Function ToString() As String
 Возвращает
 Возвращает значение типа string, содержащее:
Статус операции (например, OK, Cancel).
Идентификатор (ObjectId) выбранного объекта.
Координаты точки выбора (Point3d), если доступны.
 Если операция была прервана или объект не выбран, возвращается строка, содержащая информацию об этом (например, "Operation cancelled" или "No entity selected").
 Описание
 Переопределённый метод класса PromptEntityResult предоставляет строковое описание выбранного геометрического объекта и точки его выбора. Он используется для отладки, логирования или вывода информации в командную строку nanoCAD. Метод формирует строку на основе данных о статусе операции, идентификаторе объекта (ObjectId) и точке выбора (PickedPoint), если операция завершена успешно.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("PromptEntityResult_ToString")] public void PromptEntityResult_ToString() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Вызываем метод GetEntity() для запроса объекта PromptEntityResult result = editor.GetEntity("Выберите объект:"); // Если все данные введены, выводим результат в командную строку if (result.Status == PromptStatus.OK) { string resultStr = result.ToString(); editor.WriteMessage($"\nРезультат выбора: {resultStr}"); } else { editor.WriteMessage("\nНе удалось получить объект."); } } }
 Ссылки
 HostMgd.EditorInput.PromptEntityResult, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!