Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.Document.DowngradeDocOpen(bool)
 Послать отзыв
 Метод предназначен для понижения статуса открытого чертежа с "доступен для записи" до "доступен для чтения".
 Синтаксис
C#
Visual Basic
public void DowngradeDocOpen(bool bPromptForSave);
Public Sub DowngradeDocOpen(bPromptForSave As bool)
 Параметры
 Параметры
 Описание
 bPromptForSave
 Параметр, определяющий, необходимо ли предупрежедение о сохранении. Тип bool
 Описание
 Метод преобразует статус dwg-документа из "доступный для записи" в "доступен для чтения". Если параметр bPromptForSave равен true и чертеж был изменен (на основании значеня dbmod), пользователю выдается предупрежедение с возможностью сохранения чертежа. Если параметр bPromptForSave равен false, а чертеж был изменен, то возвращается ошибка.
 Ссылки
 HostMgd.ApplicationServices.Document, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!