Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PromptFileOptions.Filter
 Послать отзыв
 Синтаксис
C#
Visual Basic
public System.String Filter;
Public Property Filter() As System.String
 Описание
 Свойство возвращает и устанавливает строку для фильтации имен файлов по расширению.
 Условия
 На чтение и запись
 Ссылки
 PromptFileOptions Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!