Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptDoubleResult.ToString(IFormatProvider)
 Послать отзыв
 Метод возвращает строковое представление вещественного числа, введённого пользователем, с учётом формата, заданного провайдером локализации.
 Синтаксис
C#
Visual Basic
Копировать Код
public override string ToString(IFormatProvider provider);
Копировать Код
Public Overrides Function ToString(provider As IFormatProvider) As String
 Параметры
 Параметры
 Описание
 provider
 Объект, предоставляющий информацию о правилах форматирования чисел — например, культуру (CultureInfo) для корректного отображения десятичного числа в зависимости от локализации пользователя. Тип IFormatProvider
 Возвращает
 Возвращает значение типа string, представляющее собой текстовое отображение вещественного числа с учётом заданного формата. Например, число 3.1415 может быть преобразовано в "3.14" или "3,14", в зависимости от региональных настроек, переданных через provider.
 Если операция была отменена или значение не определено, может вернуть пустую строку или специальное сообщение об ошибке.
 Описание
 Метод переопределяет стандартный метод и предоставляет возможность отформатировать значение вещественного числа (например, угла или расстояния) в зависимости от текущих региональных настроек или указанного провайдера форматирования. Это позволяет корректно отображать числовые значения с нужным разделителем десятичной точки или запятой, а также в нужной системе единиц. Метод используется при выводе результатов ввода в командную строку или интерфейс, где важен язык и формат представления данных.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("PromptDoubleResultExample_ToString_IFormatProvider")] public void PromptDoubleResultExample_ToString_IFormatProvider() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Вызываем метод GetAngle для запроса данных у пользователя PromptDoubleResult result = editor.GetAngle("Введите угол:");; // Если все данные введены, выводим результат в командную строку if (result.Status == PromptStatus.OK) { string formattedValue = result.ToString(CultureInfo.InvariantCulture); editor.WriteMessage($"\nУгол: {formattedValue}"); } else { editor.WriteMessage("\nВвод отменён."); } } }
 Ссылки
 HostMgd.EditorInput.PromptDoubleResult, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!