Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.Windows.ToolPalette.CustomToolBase.GetPredefinedStrings
 Послать отзыв
 Метод предоставляет список предопределённых строковых значений для конкретного свойства пользовательского инструмента. Не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void GetPredefinedStrings( int dispatchId, tagCALPOLESTR value, tagCADWORD cookie );
Копировать Код
Public Overridable Sub GetPredefinedStrings( dispatchId As Integer, value As tagCALPOLESTR, cookie As tagCADWORD )
 Параметры
 Параметры
 Описание
 dispatchId
 Диспетчерский идентификатор свойства пользовательского инструмента. Тип int.
 value
 Выходной объект-контейнер для массива предопределённых строк. Тип tagCALPOLESTR.
 cookie
 Выходной объект-контейнер для массива значений, сопоставленных предопределенным строкам в value. Тип tagCADWORD.
 Описание
 Метод предоставляет список предопределённых строковых значений для конкретного свойства пользовательского инструмента. Свойство специфицируется по заданному dispatchId.
 В текущей версии не реализован.
 Ссылки
 HostMgd.Windows.ToolPalette.CustomToolBase, HostMgd.Windows.ToolPalette
 Ваши комментарии по поводу этого топика: Послать отзыв!