Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PromptSaveFileOptions.ForceOverwriteWarningForScriptsAndLisp
 Послать отзыв
 Синтаксис
C#
Visual Basic
public bool ForceOverwriteWarningForScriptsAndLisp;
Public Property ForceOverwriteWarningForScriptsAndLisp() As bool
 Описание
 Возвращает или устанавливает признак того, должно ли переписанное предупреждающее сообщение быть отображено, даже когда исполняется команда LISP или скрипта. Если он не установлен, при исполнении команды LISP или скрипта переписанное предупреждающее сообщение подавляется.
 Условия
 На чтение и запись
 Ссылки
 PromptSaveFileOptions Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!