Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PickPointDescriptor.PointOnLine
 Послать отзыв
 Синтаксис
C#
Visual Basic
public Teigha::Geometry::Point3d PointOnLine;
Public Property PointOnLine() As Teigha.Geometry.Point3d
 Описание
 Возвращает точку линии, луча или отрезка, которая представляет точку выбора. Для луча или отрезка это первая точка.
 Условия
 Только на чтение
 Ссылки
 PickPointDescriptor Структура, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!