Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptNestedEntityOptionsEventArgs
 Послать отзыв
 Класс предоставляет данные для события PromptingForNestedEntity, позволяя настроить параметры выбора вложенного геометрического объекта.
 Иерархия классов
HostMgd::EditorInput::PromptNestedEntityOptionsEventArgs
 Синтаксис
C#
Visual Basic
Копировать Код
public sealed class PromptNestedEntityOptionsEventArgs : EventArgs
Копировать Код
Public NotInheritable Class PromptNestedEntityOptionsEventArgs Inherits EventArgs
 Описание
 Класс используется для передачи параметров, применяемых при начале операции выбора вложенного объекта — например, при вызове метода GetNestedEntity(). Он предоставляет доступ к объекту PromptNestedEntityOptions, содержащему настройки команды, такие как:
текст приглашения (Message),
разрешение на отмену (AllowNone),
дополнительные флаги поведения .
 Этот класс применяется в обработчике события PromptingForNestedEntity, где разработчик может динамически изменять параметры ввода перед тем, как пользователь начнёт выбирать объект внутри блока или внешней ссылки.
 Топики
 Имя
 Описание
 PromptNestedEntityOptionsEventArgs Свойства
 Ниже перечислены свойства класса PromptNestedEntityOptionsEventArgs.
 Ссылки
 PromptNestedEntityOptionsEventArgs Свойства, Топики, PromptNestedEntityOptionsEventArgs Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!