Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод SelectedObject.GetSubentities
 Послать отзыв
 Синтаксис
C#
Visual Basic
public array<HostMgd::EditorInput::SelectedSubObject^> GetSubentities();
Public Function GetSubentities() As array<HostMgd.EditorInput.SelectedSubObject^>
 Описание
 Возвращает геометрические подобъекты выбранного объекта в массиве SelectedSubObject.
 Ссылки
 SelectedObject Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!