Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.WriteMessage(String,Object[])
 Послать отзыв
 Метод выводит форматированное текстовое сообщение в командной строке nanoCAD, подставляя значения в указанную строку формата.
 Синтаксис
C#
Visual Basic
Копировать Код
public void WriteMessage(String sFormat, Object[] aAgs);
Копировать Код
Public Sub WriteMessage(sFormat As String, aAgs As Object[])
 Параметры
 Параметры
 Описание
 sFormat
 Строка формата, содержащая текст и спецификаторы подстановки, например: "Объект ID: {0}, Тип: {1}".
 aAgs
 Массив объектов, значения которых будут подставлены в строку формата sFormat при выводе. Тип Object[]
 Тип
 String
 Описание
 Метод используется для отображения динамически формируемого текста в командной строке редактора. Он работает аналогично методу String.Format, позволяя включать в выводимую строку подстановочные элементы (например, {0}, {1}), которые заменяются на значения из массива aAgs. Это удобно для вывода информации с переменными значениями — координатами, числами, именами объектов и т. д.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("WriteMessageExample_String_ObjectArr")] public void WriteMessageExample_String_ObjectArr() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Для примера получим идентификатор активного видового экрана ObjectId objId = editor.ActiveViewportId; // Вывод сообщения в командной строке editor.WriteMessage("Объект ID: {0}, Тип: {1}", new object[] { objId, objId.ObjectClass.Name}); // Выведет: Объект ID: 1981080301728, Тип: AcDbViewportTableRecord } }
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!