Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод MenuItemCollection.IndexOf (System::Object^)
 Послать отзыв
 This is IndexOf, a member of class MenuItemCollection.
 Синтаксис
C#
Visual Basic
public int IndexOf(ref System.Object value);
Public Function IndexOf(ByRef value As System.Object) As Integer
 Ссылки
 MenuItemCollection Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!