Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.DocumentWindowCollection.Cascade
 Послать отзыв
 Метод реализует каскадное размещение дочерних окон MDI. В текущей версии не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Cascade();
Копировать Код
Public Sub Cascade()
 Описание
 Метод реализует каскадное размещение дочерних окон MDI (Multiple Document Interface). В текущей версии не реализован.
 Ссылки
 HostMgd.ApplicationServices.DocumentWindowCollection, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!