Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод TrayItemCollection.Insert (int, TrayItem^)
 Послать отзыв
 This is Insert, a member of class TrayItemCollection.
 Синтаксис
C#
Visual Basic
public void Insert(int index, ref TrayItem value);
Public Sub Insert(index As Integer, ByRef value As TrayItem)
 Ссылки
 TrayItemCollection Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!