Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Publisher.CurrentPublishedSheetSetPath
 Послать отзыв
 This is CurrentPublishedSheetSetPath, a member of class Publisher.
 Синтаксис
C#
Visual Basic
public System.String CurrentPublishedSheetSetPath;
Public Property CurrentPublishedSheetSetPath() As System.String
 Ссылки
 Publisher Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!