Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.Windows.ToolPalette.CustomToolBase.ToolName
 Послать отзыв
 Свойство ToolName представляет имя пользовательского инструмента. Не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public System.String ToolName;
Копировать Код
Public ReadOnly Property ToolName As System.String
 Возвращает
 Возвращает имя инструмента. Тип System.String.
 Описание
 Свойство ToolName представляет имя пользовательского инструмента. В текущей версии не реализовано.
 Условия
 Только чтение.
 Ссылки
 HostMgd.Windows.ToolPalette.CustomToolBase, HostMgd.Windows.ToolPalette
 Ваши комментарии по поводу этого топика: Послать отзыв!