Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.EndPlotEventArgs.Status
 Послать отзыв
 Свойство Status представляет текущий статус задания на печать.
 Синтаксис
C#
Visual Basic
Копировать Код
public HostMgd.PlottingServices.PlotCancelStatus Status;
Копировать Код
Public ReadOnly Property Status As HostMgd.PlottingServices.PlotCancelStatus
 Возвращает
 Возвращает текущий статус задания на печать. Значение из перечисления HostMgd.PlottingServices.PlotCancelStatus.
 Описание
 Свойство Status представляет текущий статус задания на печать.
 Условия
 Только чтение.
 Ссылки
 HostMgd.PlottingServices.EndPlotEventArgs, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!