Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PromptFileOptions.InitialFileName
 Послать отзыв
 Синтаксис
C#
Visual Basic
public System.String InitialFileName;
Public Property InitialFileName() As System.String
 Описание
 Возвращает или устанавливает начальное имя файла.
 Условия
 На чтение и запись
 Ссылки
 PromptFileOptions Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!