Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PlotProgressDialog.PlotMsgString
 Послать отзыв
 С помощью этого свойства можно предварительно установить строковые значения в форме.
 Синтаксис
C#
Visual Basic
public System.String PlotMsgString;
Public Property PlotMsgString() As System.String
 Описание
 Использование этого свойства напрямую в языках C++ и C# невозможно. Для получения и присвоения значений необходимо использовать методы set_PlotMsgString и get_PlotMsgString Порядок изображения элементов на форме ( сверху вниз ) :
DialogTitle - заголовок формы
SheetName - наименование страницы. SheetNameToolTip - выпадающая подсказка
Status
SheetProgressCaption
CancelSheetButtonMessage = текст кнопки отмены печати страницы
 Ссылки
 PlotProgressDialog Класс, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!