Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Класс HostMgd.EditorInput.SelectedObject
 Послать отзыв
 Иерархия классов
HostMgd::EditorInput::SelectedObject
 Синтаксис
C#
Visual Basic
public class SelectedObject;
Public Class SelectedObject
 Описание
 Это базовый класс для выбранного объекта.
 Топики
 Имя
 Описание
 SelectedObject Методы
 Ниже перечислены методы класса SelectedObject.
 SelectedObject Свойства
 Ниже перечислены свойства класса SelectedObject.
 Ссылки
 SelectedObject Методы, SelectedObject Свойства, Топики, SelectedObject Методы, SelectedObject Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!