Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.ConstraintUtilities.ShowConstraintBar
 Послать отзыв
 Метод управляет отображением ограничений для указанного набора объектов чертежа с наложенными ограничениями. Не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public static bool ShowConstraintBar( ref Teigha.DatabaseServices.FullSubentityPath[] subentityPaths, bool bToShow );
Копировать Код
Public Shared Function ShowConstraintBar( ByRef subentityPaths() As Teigha.DatabaseServices.FullSubentityPath, bToShow As Boolean ) As Boolean
 Параметры
 Параметры
 Описание
 subentityPaths
 Массив полных путей подобъектов с наложенными ограничениями. Тип Teigha.DatabaseServices.FullSubentityPath[]. Если этот массив пуст, действие «показать/скрыть» будет применено ко всем объектам с наложенными ограничениями в активном документе.
 bToShow
 Флаг видимости ограничений. Тип bool. Если задано true, ограничения отображаются, в противном случае отображение ограничений подавлено.
 Возвращает
 Возвращает true, если метод завершился успешно. В противном случае возвращает false.
 Описание
 Метод позволяет скрыть или отобразить наложенные ограничения для указанных в массиве subentityPaths объектов чертежа. Отображением управляет входной флаг bToShow.
 В текущей версии не реализован.
 Ссылки
 HostMgd.EditorInput.ConstraintUtilities, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!