Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.DocumentCollection.DocumentLockModeChanged
 Послать отзыв
 Событие, возникающее при каждой блокировке/разблокировке dwg-документа.
 Синтаксис
C#
Visual Basic
public event DocumentLockModeChangedEventHandler DocumentLockModeChanged;
Public Event DocumentLockModeChanged As DocumentLockModeChangedEventHandler
 Возвращает
 Возвращает тип данных HostMgd.ApplicationServices.DocumentLockModeChangedEventHandler
 Описание
 Событие, возникающее при установке блокировки или разблокировании документа. Вызов блокировки или разблокировки можно отличить. При разблокировке документа имя команды начинается с символа '#'. Блокировка документа может быть запрещена, а разблокировка — нет.
 Соответствует функции NRX API HostApDocManagerReactor.documentLockModeChanged().
 Ссылки
 HostMgd.ApplicationServices.DocumentCollection, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!