Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод FenceSelectedObject.GetIntersectionPoints
 Послать отзыв
 Синтаксис
C#
Visual Basic
public array<HostMgd::EditorInput::PickPointDescriptor^> GetIntersectionPoints();
Public Function GetIntersectionPoints() As array<HostMgd.EditorInput.PickPointDescriptor^>
 Описание
 Возвращает массив точек линии выбора, используемой для выбора объекта.
 Ссылки
 FenceSelectedObject Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!