Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.Windows.ToolPalette.CustomToolBase.CreateStockTool
 Послать отзыв
 Метод создает именованный каталог для стандартных инструментов. Не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public HostMgd.Windows.ToolPalette.Catalog CreateStockTool( ref System.String catalogName );
Копировать Код
Public Function CreateStockTool( ByRef catalogName As System.String ) As HostMgd.Windows.ToolPalette.Catalog
 Параметры
 Параметры
 Описание
 catalogName
 Входное имя каталога. Тип System.String.
 Возвращает
 Возвращает созданный каталог. Тип HostMgd.Windows.ToolPalette.Catalog.
 Описание
 Метод создает именованный каталог для стандартных инструментов.
 В текущей версии не реализован.
 Ссылки
 HostMgd.Windows.ToolPalette.CustomToolBase, HostMgd.Windows.ToolPalette
 Ваши комментарии по поводу этого топика: Послать отзыв!