Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptDoubleResultEventArgs.Result
 Послать отзыв
 Свойство предоставляет результат интерактивного ввода числового значения типа double, такого как угол или расстояние, после завершения операции.
 Синтаксис
C#
Visual Basic
Копировать Код
public PromptDoubleResult Result { get; }
Копировать Код
Public ReadOnly Property Result As PromptDoubleResult
 Возвращает
 Возвращает экземпляр класса PromptDoubleResult, который содержит:
Status — статус завершения операции (OK, Cancel, Error и др.).
Value — числовое значение, введённое пользователем (в радианах для угла, в единицах чертежа для расстояния).
StringResult — строковое представление введённого пользователем значения.
Options — параметры ввода, использованные при вызове команды.
 Если операция не была выполнена или произошла ошибка, возвращается null или объект со статусом Cancel.
 Описание
 Свойство возвращает объект типа PromptDoubleResult, содержащий информацию о результате пользовательского ввода числа (значения с плавающей точкой), выполненного через такие методы, как GetAngle(), GetDistance() и другие. Оно используется внутри событий, таких как PromptedForAngle, чтобы получить значение, статус операции и дополнительные данные. Свойство доступно только для чтения и обновляется автоматически при завершении интерактивной команды ввода.
 Условия
 Только чтение
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события PromptedForAngle [Teigha.Runtime.CommandMethod("PromptedForAngleExample_Result")] public void PromptedForAngleExample_Result() { // Подписка на событие PromptedForAngle editor.PromptedForAngle += OnEditorPromptedForAngle; } // Реализация отработки события PromptedForAngle private void OnEditorPromptedForAngle(object sender, PromptDoubleResultEventArgs e) { // Получаем доступ к результатам запроса PromptDoubleResult result = e.Result; // Вывод сообщения в командную строку if (result.Status == PromptStatus.OK) { editor.WriteMessage( $"\nВведённый угол (радианы): {result.Value}"); } else { editor.WriteMessage( "\nВвод угла отменён или произошла ошибка."); } } }
 Ссылки
 HostMgd.EditorInput.PromptDoubleResultEventArgs, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!