Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.InplaceTextEditor.DrawHightlight
 Послать отзыв
 Метод предназначен для отрисовки подсвеченного текста в данном редакторе. В текущей версии не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public void DrawHightlight();
Копировать Код
Public Sub DrawHightlight()
 Описание
 Метод предназначен для отрисовки подсвеченного текста в данном редакторе. В текущей версии метод не реализован.
 Ссылки
 HostMgd.ApplicationServices.InplaceTextEditor, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!