Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство SelectedObject.GraphicsSystemMarkerPtr
 Послать отзыв
 This is GraphicsSystemMarkerPtr, a member of class SelectedObject.
 Синтаксис
C#
Visual Basic
public System.IntPtr GraphicsSystemMarkerPtr;
Public Property GraphicsSystemMarkerPtr() As System.IntPtr
 Ссылки
 SelectedObject Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!