Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Класс HostMgd.ApplicationServices.DocumentLockModeChangedEventArgs
 Послать отзыв
 Иерархия классов
HostMgd::ApplicationServices::DocumentLockModeChangedEventArgs
 Синтаксис
C#
Visual Basic
public class DocumentLockModeChangedEventArgs : System.EventArgs;
Public Class DocumentLockModeChangedEventArgs Inherits System.EventArgs
 Описание
 Класс, обеспечивающий данными событие DocumentLockModeChanged класса DocumentCollection.
 Топики
 Имя
 Описание
 DocumentLockModeChangedEventArgs Методы
 Ниже перечислены методы класса DocumentLockModeChangedEventArgs.
 DocumentLockModeChangedEventArgs Свойства
 Ниже перечислены свойства класса DocumentLockModeChangedEventArgs.
 Ссылки
 DocumentLockModeChangedEventArgs Методы, DocumentLockModeChangedEventArgs Свойства, Топики, DocumentLockModeChangedEventArgs Методы, DocumentLockModeChangedEventArgs Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!