Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptSelectionResult.ToString(IFormatProvider)
 Послать отзыв
 Метод возвращает строковое представление результата выборки объектов, отформатированное с учётом текущих локализационных настроек.
 Синтаксис
C#
Visual Basic
Копировать Код
public override string ToString(IFormatProvider provider);
Копировать Код
Public Overrides Function ToString(provider As IFormatProvider) As String
 Параметры
 Параметры
 Описание
 provider
 Объект, определяющий правила форматирования данных — например:
 Возвращает
 Возвращает значение типа string, представляющее собой текстовое описание результата выборки:
Если статус OK и набор объектов не пуст: Пример: "3 object(s) selected" или "Выбрано объектов: 3", в зависимости от культуры.
Если операция была отменена: Пример: "Operation cancelled".
Если произошла ошибка: Пример: "Input error".
 Формат строки зависит от реализации и переданного provider.
 Описание
 Метод предоставляет строковое описание результата операции выбора объектов, форматируемое в соответствии с переданным провайдером форматирования. Это позволяет корректно отображать числовые значения (например, количество объектов) или другие данные с учётом региональных и языковых настроек пользователя — таких как разделитель десятичной точки или запятой, формат даты и т. д.
 Метод может использоваться при разработке мультиязычных плагинов nanoCAD для единообразного отображения информации о выделенных объектах в командной строке или лог-файлах.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("PromptSelectionResultExample_ToString_IFormatProvider")] public void PromptSelectionResultExample_ToString_IFormatProvider() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создаём запрос пользователю PromptSelectionResult result = editor.GetSelection(); // Если все данные введены, выводим результат в командную строку if (result.Status == PromptStatus.OK) { string formatted = result.ToString(CultureInfo.InvariantCulture); editor.WriteMessage($"\nРезультат: {formatted}"); } else { editor.WriteMessage( "\nНе удалось получить выделение."); } } }
 Ссылки
 HostMgd.EditorInput.PromptSelectionResult, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!