Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PlotProgress.UpperSheetProgressRange
 Послать отзыв
 Верхняя граница индикатора печати страницы.
 Синтаксис
C#
Visual Basic
public int UpperSheetProgressRange;
Public Property UpperSheetProgressRange() As Integer
 Описание
 Ссылки
 PlotProgress Класс, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!