Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Делегат HostMgd.Windows.ToolPalette.PickHandler
 Послать отзыв
 This is type HostMgd::Windows::ToolPalette::PickHandler.
 Синтаксис
C#
Visual Basic
public delegate PickHandler();
Public Delegate Sub PickHandler()
 Ваши комментарии по поводу этого топика: Послать отзыв!