Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptPointResultEventArgs.Result
 Послать отзыв
 Свойство возвращает результат операции интерактивного ввода точки, выполненной пользователем.
 Синтаксис
C#
Visual Basic
Копировать Код
public PromptPointResult Result { get; }
Копировать Код
Public ReadOnly Property Result As PromptPointResult
 Возвращает
 Возвращает экземпляр класса PromptPointResult, который содержит:
Status — статус завершения операции (OK, Cancel, Error и др.).
Value — значение типа Point3d, представляющее координаты точки в мировой системе координат (WCS), если операция завершена успешно.
StringResult — строковое представление введённой пользователем информации (если использовался клавиатурный ввод).
 Если операция не была завершена или произошла ошибка, возвращается объект со статусом, отличным от OK.
 Описание
 Свойство предоставляет доступ к объекту типа PromptPointResult, который содержит информацию о статусе и результате ввода точки (Point3d) через такие методы, как GetPoint(), GetCorner() и другие. Оно используется, например, внутри событий PromptedForCorner, чтобы получить координаты точки после завершения пользовательского ввода. Свойство доступно только для чтения и обновляется автоматически при окончании операции.
 Условия
 Только чтение
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события PromptedForCorner [Teigha.Runtime.CommandMethod("PromptedForCornerExample_Result")] public void PromptedForCornerExample_Result() { // Подписка на событие PromptedForCorner editor.PromptedForCorner += OnEditorPromptedForCorner; } // Реализация отработки события PromptedForCorner private void OnEditorPromptedForCorner(object sender, PromptPointResultEventArgs e) { // Получаем доступ к результатам запроса PromptPointResult result = e.Result; // Вывод сообщения в командную строку if (result.Status == PromptStatus.OK) { editor.WriteMessage($"\nУказана точка: {result.Value}"); } else { editor.WriteMessage("\nВвод точки отменён."); } } }
 Ссылки
 HostMgd.EditorInput.PromptPointResultEventArgs, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!