Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Класс HostMgd.EditorInput.SelectionDetails
 Послать отзыв
 Иерархия классов
HostMgd::EditorInput::SelectionDetails
 Синтаксис
C#
Visual Basic
public class SelectionDetails;
Public Class SelectionDetails
 Описание
 Класс, представляющий дополнительные детали выбора объектов.
 Методы
 Конструкторы
 Имя
 Описание
 SelectionDetails
 This is SelectionDetails, a member of class SelectionDetails.
 Топики
 Имя
 Описание
 SelectionDetails Методы
 Ниже перечислены методы класса SelectionDetails.
 SelectionDetails Свойства
 Ниже перечислены свойства класса SelectionDetails.
 Ссылки
 SelectionDetails Методы, SelectionDetails Свойства, Методы, Топики, SelectionDetails Методы, SelectionDetails Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!