Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.TurnForcedPickOn()
 Послать отзыв
 Метод включает режим принудительного выбора объектов и возвращает его предыдущее состояние.
 Синтаксис
C#
Visual Basic
Копировать Код
public int TurnForcedPickOn();
Копировать Код
Public Function TurnForcedPickOn() As Integer
 Возвращает
 Возвращает значение типа int, представляющее предыдущее состояние режима принудительного выбора: 0 — режим был выключен. 1 — режим уже был включен. Это значение может быть использовано для последующего восстановления исходного состояния с помощью метода TurnForcedPickOff() или повторного вызова TurnForcedPickOn().
 Описание
 Метод активирует режим принудительного выбора (forced pick), при котором пользователь может выбирать объекты только по одному щелчком мыши, исключая массовый выбор рамкой или другими способами. Этот режим используется для точного контроля над выбором объектов в интерактивных командах. Метод возвращает предыдущее состояние режима, что позволяет восстановить настройку после выполнения операции.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("TurnForcedPickOnExample")] public void TurnForcedPickOnExample() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Вызываем метод int previousState = editor.TurnForcedPickOn(); // Вывод сообщения в командной строке editor.WriteMessage( $"\nРежим принудительного выбора включён. Предыдущее состояние: {previousState}"); } }
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!