Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.Document.IsActive
 Послать отзыв
 Свойство позволяет проверить, активен ли данный dwg-документ.
 Синтаксис
C#
Visual Basic
public bool IsActive;
Public Property IsActive() As bool
 Возвращает
 Возвращает признак того, активен документ или нет. Тип bool. При значении true документ активен, false - не активен
 Описание
 Свойство позволяет проверить, активен ли данный dwg-документ.
 Условия
 Только чтение
 Ссылки
 HostMgd.ApplicationServices.Document, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!