Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.InplaceTextEditor.Paste
 Послать отзыв
 Метод вставляет текст из буфера обмена в то место, где находится текущий выделенный объект (курсор или выделение). В текущей версии не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Paste();
Копировать Код
Public Sub Paste()
 Описание
 Метод вставляет текст из буфера обмена в то место, где находится текущий выделенный объект (курсор или выделение). Если в момент вызова метода существует выделенный текст, текущее выделение удаляется. В текущей версии метод не реализован.
 Ссылки
 HostMgd.ApplicationServices.InplaceTextEditor, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!