Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод CrossingOrWindowSelectedSubObject.GetPickPoints
 Послать отзыв
 Синтаксис
C#
Visual Basic
public array<HostMgd::EditorInput::PickPointDescriptor^> GetPickPoints();
Public Function GetPickPoints() As array<HostMgd.EditorInput.PickPointDescriptor^>
 Описание
 Метод возвращает массив точек выбора, используемых для того, чтобы выбрать подобъект.
 Ссылки
 CrossingOrWindowSelectedSubObject Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!