Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Делегат HostMgd.Windows.PaletteSetHelpEventHandler
 Послать отзыв
 This is type HostMgd::Windows::PaletteSetHelpEventHandler.
 Синтаксис
C#
Visual Basic
public delegate PaletteSetHelpEventHandler();
Public Delegate Sub PaletteSetHelpEventHandler()
 Ваши комментарии по поводу этого топика: Послать отзыв!