Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptSelectionOptions.AllowDuplicates
 Послать отзыв
 Свойство определяет, разрешено ли добавление дублирующихся объектов в результирующий набор выбора.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool AllowDuplicates { get; set; }
Копировать Код
Public Property AllowDuplicates As Boolean
 Возвращает
 Возвращает значение типа bool:
true — дублирующиеся объекты разрешены в наборе выбора.
false — каждый объект может быть выбран только один раз.
 Описание
 Свойство используется в классе PromptSelectionOptions и указывает, может ли итоговый набор выбранных объектов (SelectionSet) содержать один и тот же объект более одного раза. Если свойство установлено в true, пользователь может указать один и тот же объект несколько раз — например, при многократном щелчке в режиме выбора с возможностью добавления. Если false — каждый объект может быть выбран только один раз.
 Условия
 Чтение и запись
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("PromptSelectionOptionsExample_AllowDuplicates")] public void PromptSelectionOptionsExample_AllowDuplicates() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создаём набор параметров для запроса PromptSelectionOptions options = new PromptSelectionOptions(); options.MessageForAdding = "Выберите линии для объединения:"; // Разрешить повторный выбор options.AllowDuplicates = true; // Фильтр: только объекты типа Line TypedValue[] filterList = new TypedValue[] { new TypedValue((int)DxfCode.Start, "LINE") }; SelectionFilter filter = new SelectionFilter(filterList); // Создаём запрос пользователю PromptSelectionResult result = editor.GetSelection(options, filter); // Если все данные введены, выводим результат в командную строку if (result.Status == PromptStatus.OK) { SelectionSet selSet = result.Value; editor.WriteMessage( $"\nВыбрано объектов: {selSet.Count}"); } else { editor.WriteMessage( "\nНе удалось получить выделение."); } } }
 Ссылки
 HostMgd.EditorInput.PromptSelectionOptions, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!