Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.InplaceTextEditor.Text
 Послать отзыв
 Свойство Text позволяет проверить, является ли текст текущим объектом в данном редакторе. В текущей версии не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool Text;
Копировать Код
Public ReadOnly Property Text As Boolean
 Возвращает
 Возвращает true, если текущим объектом в редакторе является текст. В противном случае возвращает false.
 Описание
 Свойство Text позволяет проверить, является ли текст текущим объектом в данном редакторе. В текущей версии не реализовано.
 Условия
 Только чтение.
 Ссылки
 HostMgd.ApplicationServices.InplaceTextEditor, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!