Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.DocumentCollection.DocumentLockModeWillChange
 Послать отзыв
 Событие, возникающее перед изменением режима блокировки dwg-документа.
 Синтаксис
C#
Visual Basic
public event DocumentLockModeWillChangeEventHandler DocumentLockModeWillChange;
Public Event DocumentLockModeWillChange As DocumentLockModeWillChangeEventHandler
 Возвращает
 Возвращает тип данных HostMgd.ApplicationServices.DocumentLockModeWillChangedEventHandler
 Описание
 Событие, возникающее перед тем, как будет изменен режим блокировки dwg-документа. Оно не может быть запрещено.
 Соответствует функции NRX API HostApDocManagerReactor.documentLockModeWillChange().
 Ссылки
 HostMgd.ApplicationServices.DocumentCollection, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!