Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 JigPromptGeometryOptions.JigPromptGeometryOptions()
 Послать отзыв
 Конструктор класса без параметров.
 Синтаксис
C#
Visual Basic
public JigPromptGeometryOptions();
Public Sub New()
 Описание
 Конструктор класса. Присваивает свойству Message пустую строку. Также устанавливает значение свойства Cursor равное CursorType.Crosshair (перекрестие).
 Ссылки
 JigPromptGeometryOptions Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!