Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.Application.SetCurrentWorkspace(String)
 Послать отзыв
 МЕТОД НЕ РЕАЛИЗОВАН. ВСЕГДА ВОЗВРАЩАЕТ FALSE. Метод устанавливает текущее рабочее пространство по его названию.
 Синтаксис
C#
Visual Basic
Копировать Код
public static bool SetCurrentWorkspace(string workspacename);
Копировать Код
Public Shared Function SetCurrentWorkspace(workspacename As String) As Boolean
 Параметры
 Параметры
 Описание
 workspacename
 Имя рабочего пространства, которое необходимо сделать текущим
 Возвращает
 Возвращает тип данных bool: true - рабочее пространство найдено и успешно установлено, false - рабочее пространство не было найдено.
 Описание
 Метод устанавливает рабочее пространство по его назваию. Поиск по названию не учитывает регистр.
 Ссылки
 HostMgd.ApplicationServices.Application, HostMgd.ApplicationServices Пространство имен
 Исключения
 MGD NOT_IMPLEMENTED
 Ваши комментарии по поводу этого топика: Послать отзыв!