Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PickPointSelectedObject.PickPoint
 Послать отзыв
 Синтаксис
C#
Visual Basic
public HostMgd::EditorInput::PickPointDescriptor PickPoint;
Public Property PickPoint() As HostMgd.EditorInput.PickPointDescriptor
 Описание
 Возвращает точку выбора, которая была использована при выборе объекта.
 Условия
 Только на чтение
 Ссылки
 PickPointSelectedObject Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!