Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptResult.ToString()
 Послать отзыв
 Метод ToString() возвращает строковое представление результата ввода, отражающее статус операции и значение, введённое пользователем.
 Синтаксис
C#
Visual Basic
Копировать Код
public sealed override string ToString();
Копировать Код
Public NotOverridable Overrides Function ToString() As String
 Возвращает
 Возвращает значение типа string, которое может содержать:
для успешного ввода (Status == PromptStatus.OK) — строковое представление введённого значения (например, число, точка, строка).
для отмены (Status == PromptStatus.Cancel) — сообщение вроде "Operation cancelled".
для ошибки (Status == PromptStatus.Error) — описание ошибки или сообщение о некорректном вводе.
 Формат возвращаемой строки зависит от типа производного класса и статуса операции ввода.
 Описание
 Метод используется для получения строкового описания результата интерактивного ввода. Метод возвращает текст, отражающий либо введённое значение, либо статус операции (например, отмена или ошибка). Это удобно при отладке, логировании или выводе информации в командную строку nanoCAD.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("PromptResultExample_ToString")] public void PromptResultExample_ToString() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создаём запрос пользователю PromptIntegerOptions iopts = new PromptIntegerOptions("Введите целое число"); iopts.DefaultValue = 10; iopts.LowerLimit = 0; iopts.UpperLimit = 100; PromptIntegerResult result = editor.GetInteger(iopts); // Если все данные введены, выводим результат в командную строку if (PromptStatus.OK == result.Status) { editor.WriteMessage($"\nРезультат: {result.ToString()}"); } else { editor.WriteMessage("\nОтмена или ошибка ввода."); } } }
 Ссылки
 HostMgd.EditorInput.PromptResult, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!