Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.GraphicsSystem.Manager.SetViewFromViewport
 Послать отзыв
 Метод позволяет переопределить заданный вид GS, используя параметры указанного видового экрана.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetViewFromViewport( ref Teigha.GraphicsSystem.View view, int viewportNumber );
Копировать Код
Public Sub SetViewFromViewport( ByRef view As Teigha.GraphicsSystem.View, viewportNumber As Integer )
 Параметры
 Параметры
 Описание
 view
 Переопределяемый вид графической системы. Тип Teigha.GraphicsSystem.View.
 viewportNumber
 Входной номер видового экрана. Тип int.
 Описание
 Метод позволяет переопределить вид GS view, используя параметры видового экрана с номером viewportNumber.
 Ссылки
 HostMgd.GraphicsSystem.Manager, HostMgd.GraphicsSystem
 Ваши комментарии по поводу этого топика: Послать отзыв!