Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Publisher.FireEndSheet
 Послать отзыв
 This is FireEndSheet, a member of class Publisher.
 Синтаксис
C#
Visual Basic
public void FireEndSheet(ref HostMgd::Publishing::PublishSheetEventArgs e);
Public Sub FireEndSheet(ByRef e As HostMgd.Publishing.PublishSheetEventArgs)
 Ссылки
 Publisher Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!