Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.DsdEntryCollection.IsSynchronized
 Послать отзыв
 Свойство IsSynchronized позволяет проверить, является ли доступ к коллекции синхронизированным (потокобезопасным).
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsSynchronized;
Копировать Код
Public ReadOnly Property IsSynchronized As Boolean Implements ICollection.IsSynchronized
 Возвращает
 Возвращает true, если доступ к данной коллекции является синхронизированным. В противном случае возвращает false.
 Описание
 Свойство IsSynchronized позволяет проверить, является ли доступ к данной коллекции синхронизированным (потокобезопасным).
 Условия
 Только чтение.
 Ссылки
 HostMgd.PlottingServices.DsdEntryCollection, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!