Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Делегат HostMgd.ApplicationServices.DocumentLockModeWillChangeEventHandler
 Послать отзыв
 Делегат события класса DocumentCollection
 Синтаксис
C#
Visual Basic
public delegate DocumentLockModeWillChangeEventHandler();
Public Delegate Sub DocumentLockModeWillChangeEventHandler()
 Ваши комментарии по поводу этого топика: Послать отзыв!