Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptSelectionResult
 Послать отзыв
 Класс содержит результат операции выбора объектов в чертеже, включая статус выполнения и набор выбранных элементов.
 Иерархия классов
HostMgd::EditorInput::PromptSelectionResult
 Синтаксис
C#
Visual Basic
Копировать Код
public sealed class PromptSelectionResult
Копировать Код
Public NotInheritable Class PromptSelectionResult
 Описание
 Класс используется в .NET API nanoCAD для хранения данных о результатах интерактивной выборки объектов — например, после вызова методов GetSelection() или SelectAll(). Он предоставляет информацию:
о статусе операции (OK, Cancel, Error и др.),
о наборе выделенных объектов через свойство Value типа SelectionSet,
строковое представление ввода , если операция была прервана с клавиатуры,
параметры приглашения , использованные в команде выбора.
 Этот класс применяется при разработке плагинов и надстроек, где требуется обработка множественного выбора объектов, проверка допустимости выборки и реакция на отмену или ошибку ввода.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("GetSelectionExample")] public void GetSelectionExample() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создаём запрос пользователю PromptSelectionResult result = editor.GetSelection(); // Если все данные введены, выводим результат в командную строку if (result.Status == PromptStatus.OK) { SelectionSet selSet = result.Value; editor.WriteMessage( $"\nВыбрано объектов: {selSet.Count}"); } else { editor.WriteMessage( "\nНе удалось получить выделение."); } } }
 Топики
 Имя
 Описание
 PromptSelectionResult Методы
 Ниже перечислены методы класса PromptSelectionResult.
 PromptSelectionResult Свойства
 Ниже перечислены свойства класса PromptSelectionResult.
 Ссылки
 PromptSelectionResult Методы, PromptSelectionResult Свойства, Топики, PromptSelectionResult Методы, PromptSelectionResult Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!