Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство SelectionDetails.Transform
 Послать отзыв
 Синтаксис
C#
Visual Basic
public Teigha::Geometry::Matrix3d Transform;
Public Property Transform() As Teigha.Geometry.Matrix3d
 Описание
 Возвращает матрицу преобразования, которая прикладывается к базовым объектам из их контейнеров.
 Условия
 Только на чтение
 Ссылки
 SelectionDetails Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!