Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptStringOptions.PromptStringOptions(string)
 Послать отзыв
 Конструктор инициализирует новый экземпляр класса с заданным приглашающим сообщением для ввода строки.
 Синтаксис
C#
Visual Basic
Копировать Код
public PromptStringOptions(string message);
Копировать Код
Public Sub New(message As String)
 Параметры
 Параметры
 Описание
 message
 Текст приглашения, отображаемый пользователю в командной строке. Может содержать инструкцию, вопрос или подсказку.
 Пример
 "Введите имя слоя:", "Выберите режим [Ручной/Автоматический]:". Тип string
 Описание
 Конструктор создаёт объект класса PromptStringOptions, используемый при настройке операции ввода текстовой строки — например, через метод GetString(). Он устанавливает основное сообщение, отображаемое в командной строке, которое подсказывает пользователю, какое значение следует ввести. После создания объекта можно дополнительно настроить параметры ввода, такие как ключевые слова, разрешение на пустой ввод или глобальные команды.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("PromptStringOptionsExample_String")] public void PromptStringOptionsExample_String() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Определяем настройки запроса пользователю PromptStringOptions options = new PromptStringOptions("Введите имя"); options.DefaultValue = "Untitled"; options.AllowSpaces = true; // Создаём запрос пользователю PromptResult pr = editor.GetString(options); // Если все данные введены, выводим результат в командную строку if (pr.Status == PromptStatus.OK) { editor.WriteMessage( $"\nВы ввели: {pr.StringResult}"); } else { editor.WriteMessage( "\nВвод отменён."); } } }
 Ссылки
 HostMgd.EditorInput.PromptStringOptions, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!