Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PublishSheetEventArgs.MaxBoundsX
 Послать отзыв
 This is MaxBoundsX, a member of class PublishSheetEventArgs.
 Синтаксис
C#
Visual Basic
public double MaxBoundsX;
Public Property MaxBoundsX() As Double
 Ссылки
 PublishSheetEventArgs Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!