Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.InplaceTextEditor.OpaqueBackground
 Послать отзыв
 Свойство OpaqueBackground позволяет определить, является ли непрозрачной фоновая заливка в данном редакторе. В текущей версии не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool OpaqueBackground;
Копировать Код
Public Property OpaqueBackground As Boolean
 Возвращает
 Возвращает true, если фоновая заливка является непрозрачной. В противном случае возвращает false.
 Описание
 Свойство OpaqueBackground позволяет определить, является ли непрозрачной фоновая заливка в данном редакторе. Непрозрачный фон скрывает нижележащую геометрию. В текущей версии данное свойство не реализовано.
 Условия
 Чтение и запись.
 Ссылки
 HostMgd.ApplicationServices.InplaceTextEditor, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!