Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод DocumentWindowIterator.Reset
 Послать отзыв
 Перемещение указателя в начальную позицию, т.е.
 Синтаксис
C#
Visual Basic
public void Reset();
Public Sub Reset()
 Описание
 перед первым элементом (окном) коллекции.
 Ссылки
 DocumentWindowIterator Класс, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!