Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод ToolReactorManager.invokeToolDrag
 Послать отзыв
 This is invokeToolDrag, a member of class ToolReactorManager.
 Синтаксис
C#
Visual Basic
public void invokeToolDrag(Guid itemId, UInt32 dwKeyState, Point3d point);
Public Sub invokeToolDrag(itemId As Guid, dwKeyState As UInt32, point As Point3d)
 Ссылки
 ToolReactorManager Класс, HostMgd.Windows.ToolPalette
 Ваши комментарии по поводу этого топика: Послать отзыв!