Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.PlotConfig.DeviceType
 Послать отзыв
 Свойство DeviceType возвращает тип текущего выходного устройства. Не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public int DeviceType;
Копировать Код
Public ReadOnly Property DeviceType As Integer
 Возвращает
 Возвращает тип выходного устройства. Тип int.
 Описание
 Свойство DeviceType возвращает тип текущего выходного устройства. См. перечисление HostMgd.PlottingServices.DeviceType.
 В текущей версии не реализовано.
 Условия
 Только чтение.
 Ссылки
 HostMgd.PlottingServices.PlotConfig, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!