Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод MenuItemCollection.Contains (HostMgd::Windows::MenuItem^)
 Послать отзыв
 This is Contains, a member of class MenuItemCollection.
 Синтаксис
C#
Visual Basic
public bool Contains(ref HostMgd::Windows::MenuItem value);
Public Function Contains(ByRef value As HostMgd.Windows.MenuItem) As bool
 Ссылки
 MenuItemCollection Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!