Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Tool.CurrentShape
 Послать отзыв
 This is CurrentShape, a member of class Tool.
 Синтаксис
C#
Visual Basic
public HostMgd::Windows::ToolPalette::Tool CurrentShape;
Public Property CurrentShape() As HostMgd.Windows.ToolPalette.Tool
 Ссылки
 Tool Класс, HostMgd.Windows.ToolPalette
 Ваши комментарии по поводу этого топика: Послать отзыв!