Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.Windows.ToolPalette.CustomToolBase.Save
 Послать отзыв
 Метод предназначен для сохранения данных элемента каталога в XML-узле. Не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void Save( ref System.Object xmlElement );
Копировать Код
Public Overridable Sub Save( ByRef xmlElement As System.Object )
 Параметры
 Параметры
 Описание
 xmlElement
 Входной сохраняемый элемент. Тип System.Object.
 Описание
 Метод предназначен для сохранения состояния инструмента в XML-представлении. Производные классы реализуют этот метод для сохранения в XML-узле своих специфичных данных. Переопределения должны вызывать реализацию базового класса перед сохранением своих пользовательских данных.
 В текущей версии не реализован.
 Замечания
 Метод является парным к методу Load(), который восстанавливает состояние инструмента при загрузке из XML-представления.
 Ссылки
 HostMgd.Windows.ToolPalette.CustomToolBase, HostMgd.Windows.ToolPalette
 Ваши комментарии по поводу этого топика: Послать отзыв!