Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PaletteSet.PaletteSize
 Послать отзыв
 This is PaletteSize, a member of class PaletteSet.
 Синтаксис
C#
Visual Basic
public System.Windows.Size PaletteSize;
Public Property PaletteSize() As System.Windows.Size
 Ссылки
 PaletteSet Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!