Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptPointResult.ToString()
 Послать отзыв
 Метод возвращает строковое представление точки, введённой пользователем в ходе интерактивной операции.
 Синтаксис
C#
Visual Basic
Копировать Код
public sealed override string ToString();
Копировать Код
Public NotInheritable Class PromptPointResult Inherits PromptResult
 Возвращает
 Возвращает значение типа string, представляющее собой текстовое отображение точки в формате (X, Y, Z) — например: (100.50, 200.25, 0.00). Если точка не была введена (операция отменена или завершена с ошибкой), может вернуть пустую строку или сообщение об отмене.
 Описание
 Метод переопределяет стандартный метод PromptResult.ToString() и предоставляет строковое значение точки (Point3d), введённой пользователем через такие команды, как GetPoint(), GetCorner() и другие. Он используется для удобного отображения или логгирования координат точки — например, при выводе результата в командную строку или вспомогательные подсказки. Метод возвращает точку в формате, соответствующем текущим настройкам локализации и параметрам ввода.
 Замечания
 Формат строки может зависеть от настроек единиц чертежа и используемой культуры (локализации). Для контролируемого форматирования можно использовать перегруженную версию с IFormatProvider.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("PromptPointResultExample_ToString")] public void PromptPointResultExample_ToString() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создаём запрос пользователю PromptPointOptions options = new PromptPointOptions("nУкажите точку:"); options.BasePoint = new Point3d(0, 0, 0); // Вызов метода GetPoint() для запроса пользователю PromptPointResult result = editor.GetPoint(options); // Если все данные введены, выводим результат в командную строку if (result.Status == PromptStatus.OK) { string pointStr = result.ToString(); editor.WriteMessage($"\nВведённая точка: {pointStr}"); } else { editor.WriteMessage( "\nВвод точки отменен или произошла ошибка."); } } }
 Ссылки
 HostMgd.EditorInput.PromptPointResult, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!