Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptOptions
 Послать отзыв
 Базовый класс, предназначенный для хранения набора параметров, необходимых для запроса данных у пользователя.
 Иерархия классов
HostMgd::EditorInput::PromptOptions
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract class PromptOptions
Копировать Код
Public MustInherit Class PromptOptions
 Описание
 Абстрактный класс, предназначенный для для хранения набора параметров, необходимых для запроса данных у пользователя. Является базовым классом для класса JigPromptOptions.
 Класс предоставляет возможность установить для запроса приглашающее сообщение, ключевые слова, значение по умолчанию и признак его использования.
 Топики
 Имя
 Описание
 PromptOptions Методы
 Ниже перечислены методы класса PromptOptions.
 PromptOptions Свойства
 Ниже перечислены свойства класса PromptOptions.
 Ссылки
 PromptOptions Методы, PromptOptions Свойства, Топики, PromptOptions Методы, PromptOptions Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!