Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.SelectionSetDelayMarshalled.Count
 Послать отзыв
 Свойство Count представляет количество объектов в данном наборе выбранных объектов чертежа. Не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public override int Count;
Копировать Код
Public Overrides ReadOnly Property Count As Integer
 Возвращает
 Возвращает количество объектов в данном наборе. Тип int.
 Описание
 Свойство Count представляет количество объектов в данном наборе выбранных объектов чертежа.
 В текущей версии не реализовано.
 Условия
 Только чтение.
 Ссылки
 HostMgd.EditorInput.SelectionSetDelayMarshalled, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!