Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.InplaceTextEditor.CanExitEditor
 Послать отзыв
 Свойство CanExitEditor позволяет определить, можно ли закрыть данный текстовый редактор. В текущей версии не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool CanExitEditor;
Копировать Код
Public Property CanExitEditor As Boolean
 Возвращает
 Возвращает true, если данный текстовый редактор можно закрыть. В противном случае возвращает false.
 Описание
 Свойство CanExitEditor позволяет определить, можно ли закрыть данный текстовый редактор. В текущей версии не реализовано.
 Условия
 Чтение и запись.
 Ссылки
 HostMgd.ApplicationServices.InplaceTextEditor, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!