Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Класс HostMgd.Windows.WindowOnHandle
 Послать отзыв
 This is class HostMgd::Windows::WindowOnHandle.
 Иерархия классов
Teigha::Runtime::DisposableWrapper HostMgd::Windows::Window HostMgd::Windows::WindowOnHandle
 Синтаксис
C#
Visual Basic
public class WindowOnHandle : Window;
Public Class WindowOnHandle Inherits Window
 Методы
 Конструкторы
 Класс HostMgd.Windows.Window
 Имя
 Описание
 Window
 Это обзор перегрузок Window.
 Класс HostMgd.Windows.WindowOnHandle
 Имя
 Описание
 WindowOnHandle
 This is WindowOnHandle, a member of class WindowOnHandle.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Класс HostMgd.Windows.Window
 Имя
 Описание
 Window Перечисления
 Ниже перечислены перечисления класса Window.
 Window Методы
 Ниже перечислены методы класса Window.
 Window Свойства
 Ниже перечислены свойства класса Window.
 Класс HostMgd.Windows.WindowOnHandle
 Имя
 Описание
 WindowOnHandle Методы
 Ниже перечислены методы класса WindowOnHandle.
 Ссылки
 WindowOnHandle Методы, Методы, Топики, Window Перечисления, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!