Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство DocumentWindowIterator.Current
 Послать отзыв
 Указатель на текущее окно документа.
 Синтаксис
C#
Visual Basic
public System.Object Current;
Public Property Current() As System.Object
 Описание
 При нахождении указателя внутри коллекции свойство возвращает HostMgd::Windows::Window^ При выходе указателя за пределы коллекции свойство возвращает nullptr
 Ссылки
 DocumentWindowIterator Класс, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!