Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptIntegerResult.ToString()
 Послать отзыв
 Метод возвращает строковое представление целого числа, введённого пользователем через интерактивную команду.
 Синтаксис
C#
Visual Basic
Копировать Код
public sealed override string ToString();
Копировать Код
Public NotOverridable Overrides Function ToString() As String
 Возвращает
 Возвращает значение типа string, представляющее результат ввода целого числа:
Если статус OK — строка с числом, например: "123".
Если статус Cancel или Error — строка с описанием отмены или ошибки, например: "Operation cancelled".
 Формат и содержание строки может варьироваться в зависимости от реализации и контекста ввода.
 Описание
 Метод переопределяет стандартное строковое представление объекта и возвращает значение типа string, соответствующее введённому целому числу (Value) и статусу операции. Он используется, например, для отладки, логгирования или вывода информации в командную строку nanoCAD. Формат вывода зависит от статуса: если операция завершена успешно — возвращается строковое значение числа, иначе — сообщение об отмене или ошибке.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("PromptIntegerResultExample_ToString")] public void PromptIntegerResultExample_ToString() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создаём запрос пользователю PromptIntegerOptions iopts = new PromptIntegerOptions("Введите целое число"); iopts.DefaultValue = 10; iopts.LowerLimit = 0; iopts.UpperLimit = 100; // Вызываем метод GetInteger() для запроса пользователю PromptIntegerResult result = editor.GetInteger(iopts); // Если все данные введены, выводим результат в командную строку if (PromptStatus.OK == result.Status) { string resultStr = result.ToString(); editor.WriteMessage($"\nРезультат: {resultStr}"); } else { editor.WriteMessage("\nОтмена или ошибка ввода."); } } ]
 Ссылки
 HostMgd.EditorInput.PromptIntegerResult, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!