Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PaletteSet.KeepFocus
 Послать отзыв
 Свойство определяющее, сохраняетли панель фокус ввода даже при переключении его в окно редактора.
 Синтаксис
C#
Visual Basic
public bool KeepFocus;
Public Property KeepFocus() As bool
 Описание
 Ссылки
 PaletteSet Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!