Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.RolloverEventArgs.Highlighted
 Послать отзыв
 Свойство устанавливает или возвращает путь к подобъекту (например, сегменту, ребру, вершине), который выделяется при наведении курсора.
 Синтаксис
C#
Visual Basic
Копировать Код
public FullSubentityPath Highlighted { get; set; }
Копировать Код
Public Property Highlighted As FullSubentityPath
 Возвращает
 Возвращает или устанавливает объект типа FullSubentityPath:
Если значение не null — указывает на конкретный подобъект, который будет подсвечен.
Если null — подсветка подобъекта не применяется (может выделяться весь объект).
 Описание
 Свойство предназначено для управления визуальным выделением подобъектов — отдельных элементов составных объектов, таких как сегменты полилинии, рёбра 3D-тела или грани многогранников. Оно позволяет указать, какой именно фрагмент объекта должен быть подсвечен при наведении курсора, обеспечивая точную визуальную обратную связь.
 Условия
 Чтение и запись
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события Rollover [Teigha.Runtime.CommandMethod("RolloverExample_Highlighted")] public void RolloverExample_Highlighted() { // Подписка на событие Rollover editor.Rollover += OnEditorRollover; } // Реализация отработки события Rollover private void OnEditorRollover(object sender, RolloverEventArgs e) { // Получить путь к подобъекту, который будет подсвечен FullSubentityPath path = e.Highlighted; // Вывод результата в командную строку if (!path.IsNull) { editor.WriteMessage($"\nПодсвечивается подобъект: {path.SubentId}"); } } }
 Ссылки
 HostMgd.EditorInput.RolloverEventArgs, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!