Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.PromptingForNestedEntity
 Послать отзыв
 Событие возникает при начале операции выбора вложенного геометрического объекта, например, внутри блока или внешней ссылки. Событие не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public event PromptNestedEntityOptionsEventHandler PromptingForNestedEntity;
Копировать Код
Public Event PromptingForNestedEntity As PromptNestedEntityOptionsEventHandler
 Описание
 Событие инициируется перед началом интерактивного выбора объекта, находящегося внутри составного элемента чертежа — такого как блок или внешняя ссылка. Оно предоставляет доступ к параметрам ввода через объект PromptNestedEntityOptionsEventArgs, что позволяет разработчику настроить поведение команды выбора до её запуска.
 Это событие используется в связке с методом GetNestedEntity(), который позволяет выбрать объект, вложенный в контейнер, с учётом его трансформации (масштаб, поворот, смещение). Через событие можно изменить:
текст приглашения (Message),
режимы выбора ,
дополнительные флаги поведения .
 Событие реализуется через делегат PromptNestedEntityOptionsEventHandler и вызывается до отображения запроса пользователю, что даёт возможность адаптировать параметры ввода в зависимости от контекста — например, изменить сообщение или ограничить типы выбираемых объектов.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события PromptingForNestedEntity [Teigha.Runtime.CommandMethod("PromptingForNestedEntityExample")] public void PromptingForNestedEntityExample() { // Подписка на событие PromptingForNestedEntity editor.PromptingForNestedEntity += OnEditorPromptingForNestedEntity; } // Реализация отработки события PromptingForNestedEntity private void OnEditorPromptingForNestedEntity(object sender, PromptNestedEntityOptionsEventArgs e) { // Изменение сообщения приглашения e.Options.Message = "Выберите объект внутри блока:"; // Дополнительные настройки (при наличии) e.Options.AllowNone = false; } }
 Порядок работы с событием:
Вызывается метод GetNestedEntity() для выбора объекта внутри блока.
Перед началом ввода генерируется событие PromptingForNestedEntity.
Разработчик может изменить параметры через e.Options.
Пользователь указывает объект, и операция завершается событием PromptedForNestedEntity.
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!