Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.PointToWorld(Point)
 Послать отзыв
 Метод преобразует точку из экранных координат в трёхмерную точку в мировой системе координат (WCS) текущего видового экрана.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d PointToWorld(System.Drawing.Point pt);
Копировать Код
Public Function PointToWorld(pt As System.Drawing.Point) As Point3d
 Параметры
 Параметры
 Описание
 pt
 Точка в экранных координатах (в пикселях), относительно клиентской области окна редактора. Тип System.Drawing.Point.
 Возвращает
 Возвращает объект типа Point3d, представляющий координаты точки в мировой системе координат (WCS), соответствующей положению курсора или указанной области на экране текущего видового экрана.
 Описание
 Метод используется для перевода координат точки, заданной в клиентских пикселях окна редактора, в соответствующую трёхмерную точку в мировой системе координат (WCS), с учётом текущего представления чертежа. Это позволяет определить, какая точка в пространстве чертежа соответствует указанному месту на экране — например, при обработке кликов мыши или других событий пользовательского интерфейса.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("PointToWorldExample_Point")] public void PointToWorldExample_Point() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Определяем переменные для параметров метода PointToWorld System.Drawing.Point screenPoint = new System.Drawing.Point(200, 150); // Вызываем метод Point3d worldPoint = editor.PointToWorld(screenPoint); // Выводим результат в командную строку editor.WriteMessage( $"\nМировые координаты точки: {worldPoint}"); } }
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!