Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод StatusBar.GetDefaultPane
 Послать отзыв
 This is GetDefaultPane, a member of class StatusBar.
 Синтаксис
C#
Visual Basic
public HostMgd::Windows::Pane GetDefaultPane(HostMgd::Windows::DefaultPane pane);
Public Function GetDefaultPane(pane As HostMgd.Windows.DefaultPane) As HostMgd.Windows.Pane
 Ссылки
 StatusBar Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!