Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.SelectionRemovedEventArgs.Remove(int)
 Послать отзыв
 Метод удаляет объект из набора выбранных объектов по указанному индексу.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Remove(int index);
Копировать Код
Public Sub Remove(index As Integer)
 Параметры
 Параметры
 Описание
 index
 Порядковый номер объекта в коллекции, который необходимо удалить. Нумерация начинается с 0.
 Пример
 значение 0 — удалить первый объект, 1 — второй и т.д. Тип int
 Описание
 Метод предназначен для программного удаления объекта из коллекции выбранных элементов — например, из объекта типа SelectionSet. Он использует порядковый индекс элемента в наборе для определения, какой объект должен быть исключён из выборки. После удаления все последующие объекты сдвигаются на одну позицию влево, а общее количество элементов уменьшается на единицу.
 Важно: перед вызовом метода необходимо убедиться, что переданный индекс находится в допустимом диапазоне (от 0 до Count - 1), иначе будет выброшено исключение ArgumentOutOfRangeException.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; [Teigha.Runtime.CommandMethod("SelectionRemovedExample_Remove")] public void SelectionRemovedExample_Remove() { // Подписка на событие SelectionRemoved editor.SelectionRemoved += OnSelectionRemoved; } // Реализация отработки события SelectionRemoved private void OnSelectionRemoved(object sender, SelectionRemovedEventArgs e) { // Получаем доступ к объектам, удалённым из выборки SelectionSet removedSet = e.Selection; // Выводим сообщение в командную строку editor.WriteMessage($"\nИз выборки удалён объект: {removedSet[0]}"); // Удаляем объект из коллекции e.Remove(0); } }
 Ссылки
 HostMgd.EditorInput.SelectionRemovedEventArgs, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!