Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Класс HostMgd.Windows.SaveFileDialog
 Послать отзыв
 Диалог сохранения файла
 Иерархия классов
HostMgd::Windows::SaveFileDialog
 Синтаксис
C#
Visual Basic
public class SaveFileDialog;
Public Class SaveFileDialog
 Методы
 Конструкторы
 Имя
 Описание
 SaveFileDialog
 This is SaveFileDialog, a member of class SaveFileDialog.
 Топики
 Имя
 Описание
 SaveFileDialog Перечисления
 Ниже перечислены перечисления класса SaveFileDialog.
 SaveFileDialog Методы
 Ниже перечислены методы класса SaveFileDialog.
 SaveFileDialog Свойства
 Ниже перечислены свойства класса SaveFileDialog.
 Ссылки
 SaveFileDialog Перечисления, SaveFileDialog Методы, SaveFileDialog Свойства, Методы, Топики, SaveFileDialog Перечисления, SaveFileDialog Методы, SaveFileDialog Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!