Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.Document.LispCancelled
 Послать отзыв
 Событие, возникающее при прерывании выполнения lisp выражения в документе.
 Синтаксис
C#
Visual Basic
public event EventHandler LispCancelled;
Public Event LispCancelled As EventHandler
 Возвращает
 Возвращает тип данных EventHandler
 Описание
 Событие, возникающее при прерывании выполнения lisp выражения в документе. Соответствует функции NRX API HostEditorReactor.lispCancelled().
 Ссылки
 HostMgd.ApplicationServices.Document, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!