Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.SelectionAdded
 Послать отзыв
 Событие возникает при добавлении одного или нескольких объектов в текущий набор выделенных объектов в редакторе nanoCAD.
 Синтаксис
C#
Visual Basic
Копировать Код
public event SelectionAddedEventHandler SelectionAdded;
Копировать Код
Public Event SelectionAdded As SelectionAddedEventHandler
 Описание
 Событие нициируется системой nanoCAD при изменении набора выбранных объектов, когда один или несколько объектов добавляются в выборку — например, при щелчке по объекту, выделении рамкой или использовании режима добавления (с клавишей Shift или кнопкой "Добавить").
 Оно предоставляет доступ к новым объектам через объект SelectionSet, что позволяет разработчику отслеживать динамику выборки и реагировать на неё — например, обновлять панель свойств, активировать инструменты, запускать анализ или визуализировать выбранные элементы.
 Событие реализуется через делегат SelectionAddedEventHandler и вызывается автоматически при каждом расширении выборки.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события SelectionAdded [Teigha.Runtime.CommandMethod("SelectionAddedExample")] public void SelectionAddedExample() { // Подписка на событие Rollover editor.SelectionAdded += OnSelectionAdded; } // Реализация отработки события SelectionAdded private void OnSelectionAdded(object sender, SelectionAddedEventArgs e) { SelectionSet addedSet = e.Selection; foreach (ObjectId id in addedSet.GetObjectIds()) { editor.WriteMessage($"\nК выборке добавлен объект: {id}"); } } }
 Порядок работы с событием:
Пользователь выполняет действие, добавляющее объекты в выборку.
Система формирует список добавленных объектов.
Генерируется событие SelectionAdded.
Разработчик получает доступ к списку и может обработать изменение.
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!