Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод IConfigurationSection.Delete
 Послать отзыв
 Синтаксис
C#
Visual Basic
void Delete(ref String name);
Sub Delete(ByRef name As String)
 Параметры
 Параметры
 Описание
 name
 Имя элемента, который должен быть удален
 Описание
 Этот метод должен быть разаработан для удаления элемента с именем name в секции конфигурации.
 Ссылки
 IConfigurationSection Интерфейс, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!