Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Перечисление HostMgd.Windows.PaneStyles
 Послать отзыв
 This is record HostMgd::Windows::PaneStyles.
 Синтаксис
C#
Visual Basic
[Flags] public enum PaneStyles { Command = 0x10, NoBorders = 1, Normal = 8, PopOut = 2, PopUp = 0x20, Stretch = 4 }
<Flags> Public Enum PaneStyles Command = &H10 NoBorders = 1 Normal = 8 PopOut = 2 PopUp = &H20 Stretch = 4 End Enum
 Ваши комментарии по поводу этого топика: Послать отзыв!