Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.DeviceType
 Послать отзыв
 Данное перечисление определяет типы выходных устройств, поддерживаемые в пространстве имен HostMgd.PlottingServices.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum DeviceType { SystemPrinter = 0, PC3File = 1, OneOffConfig = 2, EmbeddedPrinter = 3, NonePrinter = 4, Uninitialized = -1 }
Копировать Код
Public Enum DeviceType SystemPrinter = 0 PC3File = 1 OneOffConfig = 2 EmbeddedPrinter = 3 NonePrinter = 4 Uninitialized = -1 End Enum
 Члены
 Члены
 Описание
 OneOffConfig
 Значение: 2. Только для внутреннего использования.
 PC3File
 Значение: 1. Устройство вывода определено и настроено с помощью файла конфигурации плоттера в формате PC3.
 SystemPrinter
 Значение: 0. Устройством вывода является системный принтер.
 Uninitialized
 Значение: -1. Устройство вывода не инициализировано. Только для внутреннего использования.
 EmbeddedPrinter
 Значение: 3. Устройством вывода является встроенный принтер.
 NonePrinter
 Значение: 4. Устройство вывода не задано.
 Описание
 Перечисление DeviceType определяет типы выходных устройств, поддерживаемые в пространстве имен HostMgd.PlottingServices.
 Ваши комментарии по поводу этого топика: Послать отзыв!