Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.SelectionRemovedEventArgs
 Послать отзыв
 Класс предоставляет данные для события SelectionRemoved, возникающего при удалении объектов из текущего набора выделенных в редакторе nanoCAD.
 Иерархия классов
HostMgd::EditorInput::SelectionRemovedEventArgs
 Синтаксис
C#
Visual Basic
Копировать Код
public sealed class SelectionRemovedEventArgs : EventArgs, IDisposable
Копировать Код
Public NotInheritable Class SelectionRemovedEventArgs Inherits EventArgs Implements IDisposable
 Описание
 Класс используется для передачи информации о тех объектах, которые были удалены из выборки — например, при использовании режима Shift + щелчок, команды "Удалить из выбора" или программного изменения набора.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; [Teigha.Runtime.CommandMethod("SelectionRemovedExample")] public void SelectionRemovedExample() { // Подписка на событие SelectionRemoved editor.SelectionRemoved += OnSelectionRemoved; } // Реализация отработки события SelectionRemoved private void OnSelectionRemoved(object sender, SelectionRemovedEventArgs e) { SelectionSet removedSet = e.Selection; foreach (ObjectId id in removedSet.GetObjectIds()) { editor.WriteMessage($"\nИз выборки удалён объект: {id}"); } } }
 Топики
 Имя
 Описание
 SelectionRemovedEventArgs Методы
 Ниже перечислены методы класса SelectionRemovedEventArgs.
 SelectionRemovedEventArgs Свойства
 Ниже перечислены свойства класса SelectionRemovedEventArgs.
 Ссылки
 SelectionRemovedEventArgs Методы, SelectionRemovedEventArgs Свойства, Топики, SelectionRemovedEventArgs Методы, SelectionRemovedEventArgs Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!