Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Класс HostMgd.ApplicationServices.DocumentLockModeWillChangeEventArgs
 Послать отзыв
 Иерархия классов
HostMgd::ApplicationServices::DocumentLockModeWillChangeEventArgs
 Синтаксис
C#
Visual Basic
public class DocumentLockModeWillChangeEventArgs : System.EventArgs;
Public Class DocumentLockModeWillChangeEventArgs Inherits System.EventArgs
 Описание
 Класс, обеспечивающий данными событие DocumentLockModeWillChange класса DocumentCollection.
 Топики
 Имя
 Описание
 DocumentLockModeWillChangeEventArgs Свойства
 Ниже перечислены свойства класса DocumentLockModeWillChangeEventArgs.
 Ссылки
 DocumentLockModeWillChangeEventArgs Свойства, Топики, DocumentLockModeWillChangeEventArgs Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!