Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptDistanceOptions.BasePoint
 Послать отзыв
 Свойство возвращает или устанавливает базовую точку, относительно которой происходит интерактивный ввод расстояния.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d BasePoint { get; set; }
Копировать Код
Public Property BasePoint As Point3d
 Возвращает
 Возвращает объект типа Point3d, представляющий координаты базовой точки в мировой системе координат (X, Y, Z). Если точка не задана, возвращается Point3d.Null.
 Описание
 Свойство используется для задания опорной точки, от которой может отсчитываться расстояние при интерактивном вводе — например, при построении направления, смещении объектов или полярном вводе. Оно позволяет установить начальную позицию, от которой пользователь указывает вторую точку или вводит значение расстояния.
 Свойство доступно как для чтения, так и для записи, что даёт возможность программно задавать координаты базовой точки в мировой системе координат (WCS). Часто используется совместно с другими параметрами, такими как UseBasePoint, чтобы включить привязку к этой точке.
 Условия
 Чтение и запись
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { [Teigha.Runtime.CommandMethod("PromptDistanceOptionsExample_BasePoint")] public void PromptDistanceOptionsExample_BasePoint() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создаём запрос пользователю PromptDistanceOptions options = new PromptDistanceOptions("\nВведите расстояние:"); // Установка базовой точки options.BasePoint = new Point3d(100, 200, 0); // Включение использования базовой точки options.UseBasePoint = true; // Вызов метода GetDistance для запроса расстояния PromptDoubleResult result = editor.GetDistance(options); // Если данные введены, выводим результат в командную строку if (result.Status == PromptStatus.OK) { double distance = result.Value; editor.WriteMessage( $"\nВведено расстояние: {distance} относительно точки {options.BasePoint}"); } else { editor.WriteMessage("\nОперация отменена."); } } }
 Ссылки
 HostMgd.EditorInput.PromptDistanceOptions, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!