Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.BeginPageEventArgs.BeginPageEventArgs
 Послать отзыв
 Конструктор класса BeginPageEventArgs. Создает экземпляр класса с указанными параметрами.
 Синтаксис
C#
Visual Basic
Копировать Код
public BeginPageEventArgs( ref HostMgd.PlottingServices.PlotPageInfo plotPageInfo, ref HostMgd.PlottingServices.PlotInfo plotInfo, bool lastPage );
Копировать Код
Public Sub New( ByRef plotPageInfo As HostMgd.PlottingServices.PlotPageInfo, ByRef plotInfo As HostMgd.PlottingServices.PlotInfo, lastPage As Boolean )
 Параметры
 Параметры
 Описание
 plotPageInfo
 Входные параметры печатаемой страницы. Тип HostMgd.PlottingServices.PlotPageInfo.
 plotInfo
 Входные параметры печати документа. Тип HostMgd.PlottingServices.PlotInfo.
 lastPage
 Флаг последней страницы документа. Тип bool. Значение true соответствует последней странице.
 Описание
 Конструктор класса BeginPageEventArgs. Создает экземпляр класса с указанными параметрами.
 Ссылки
 HostMgd.PlottingServices.BeginPageEventArgs, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!