Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.TraceBoundary(Point3d,bool)
 Послать отзыв
 Метод возвращает коллекцию полилиний, образующих замкнутый контур вокруг указанной точки, с возможностью поиска внутренних областей (островков).
 Синтаксис
C#
Visual Basic
Копировать Код
public DBObjectCollection TraceBoundary(Point3d seedPoint, bool detectIslands);
Копировать Код
Public Function TraceBoundary(seedPoint As Point3d, detectIslands As bool) As DBObjectCollection
 Параметры
 Параметры
 Описание
 seedPoint
 Точка в мировой системе координат (WCS), вокруг которой производится поиск замкнутого контура.
 detectIslands
 Флаг, указывающий, следует ли обнаруживать внутренние замкнутые области (островки) внутри найденного контура:
 Тип
 Point3d
 Возвращает
 Возвращает объект типа DBObjectCollection, содержащий все найденные полилинии, которые формируют замкнутый контур вокруг указанной точки. Если контур не найден, возвращается пустая коллекция.
 Описание
 Метод используется для автоматического определения замкнутого контура в чертеже, образованного геометрическими объектами (обычно полилиниями), окружающими заданную точку. Точка seedPoint служит начальным ориентиром для поиска. Если параметр detectIslands установлен в true, метод также учитывает внутренние замкнутые области (островки) внутри основного контура. Метод может применяться, например, при создании штриховки или анализе замкнутых зон чертежа.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("TraceBoundaryExample")] public void TraceBoundaryExample() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создаём точку для поиска ограничивающего контура Point3d point = new Point3d(100, 100, 0); // Вызываем метод DBObjectCollection boundary = editor.TraceBoundary(point, true); // Если контур найден, выводим сообщение в командную строку if (boundary.Count > 0) { editor.WriteMessage( $"\nНайдено {boundary.Count} объектов контура."); } else { editor.WriteMessage("\nЗамкнутый контур не найден."); } } }
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!