Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.DsdEntryCollection.Insert
 Послать отзыв
 Метод вставляет в коллекцию заданный объект DsdEntry по указанному индексу.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Insert( int index, ref HostMgd.PlottingServices.DsdEntry value );
Копировать Код
Public Sub Insert( index As Integer, ByRef value As HostMgd.PlottingServices.DsdEntry )
 Параметры
 Параметры
 Описание
 index
 Входной индекс вставленного в коллекцию элемента. Тип int.
 value
 Входной объект, вставляемый в коллекцию. Тип HostMgd.PlottingServices.DsdEntry.
 Описание
 Метод вставляет в коллекцию объект типа DsdEntry по указанному индексу index. Индекс должен иметь допустимое значение.
 Ссылки
 HostMgd.PlottingServices.DsdEntryCollection, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!