Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.PromptForEntityEnding
 Послать отзыв
 Событие возникает после завершения операции выбора геометрического объекта, но до фиксации результата. Событие не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public event PromptForEntityEndingEventHandler PromptForEntityEnding;
Копировать Код
Public Event PromptForEntityEnding As PromptForEntityEndingEventHandler
 Описание
 Событие вызывается в момент завершения операции выбора объекта пользователем — например, при использовании методов GetEntity, GetPoint или других команд, где требуется указание на геометрический объект. Оно является вторым в последовательности событий, связанных с выбором объекта:
PromptingForEntity — начало запроса.
PromptForEntityEnding — завершение выборки, можно получить и модифицировать результат.
PromptedForEntity — пост-обработка после завершения выбора.
 Это событие позволяет обработать данные о выбранном объекте перед тем, как он будет использован в дальнейших операциях, например, изменить его параметры, проверить допустимость выбора или выполнить дополнительные действия.
 Замечания
 Событие реализуется через делегат PromptForEntityEndingEventHandler и может быть использовано для работы с PromptEntityResult. Событие особенно полезно при разработке надстроек, где необходимо отслеживать или изменять поведение при выборе объектов в чертеже.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события PromptForEntityEnding [Teigha.Runtime.CommandMethod("PromptForEntityEndingExample")] public void PromptForEntityEndingExample() { // Подписка на событие PromptForEntityEnding editor.PromptForEntityEnding += OnEditorPromptForEntityEnding; } // Реализация отработки события PromptForEntityEnding private void OnEditorPromptForEntityEnding(object sender, PromptForEntityEndingEventArgs e) { if (!e.Result.ObjectId.IsNull) { // Вывод сообщения в командную строку editor.WriteMessage( $"\nВыбран объект: {e.Result.ObjectId.ObjectClass.Name}"); } } }
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!