Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptAngleOptionsEventHandler(object,PromptAngleOptionsEventArgs)
 Послать отзыв
 Делегат предназначен для обработки события, возникающего при начале операции ввода угла, и позволяет динамически настраивать параметры ввода.
 Синтаксис
C#
Visual Basic
Копировать Код
public delegate void PromptAngleOptionsEventHandler(object sender, PromptAngleOptionsEventArgs e);
Копировать Код
Public Delegate Sub PromptAngleOptionsEventHandler(sender As Object, e As PromptAngleOptionsEventArgs)
 Параметры
 Параметры
 Описание
 sender
 Источник события, обычно представляет экземпляр редактора (Editor), в котором происходит ввод угла. Тип object
 e
 Объект, содержащий данные о параметрах ввода угла:
 Описание
 Делегат используется как сигнатура метода-обработчика для события PromptingForAngle, которое возникает перед началом интерактивного ввода угла. Он позволяет разработчикам надстроек nanoCAD модифицировать параметры команды ввода — такие как начальное значение, сообщение, допустимый диапазон угла и другие. Это обеспечивает гибкую настройку команды в зависимости от контекста, например, при построении объектов, вращении или других операциях, требующих ввода угла.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события PromptingForAngle [Teigha.Runtime.CommandMethod("PromptingForAngleExample")] public void PromptingForAngleExample() { // Подписка на событие PromptingForAngle editor.PromptingForAngle += OnEditorPromptingForAngle; } // Реализация отработки события PromptingForAngle private void OnEditorPromptingForAngle(object sender, PromptAngleOptionsEventArgs e) { // Установить начальное значение угла e.Options.DefaultValue = Math.PI / 2; // 90 градусов // Установить сообщение e.Options.Message = "Введите угол поворота:"; } }
 Ваши комментарии по поводу этого топика: Послать отзыв!