Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Publisher.FireAboutToBeginBackgroundPublishing
 Послать отзыв
 This is FireAboutToBeginBackgroundPublishing, a member of class Publisher.
 Синтаксис
C#
Visual Basic
public void FireAboutToBeginBackgroundPublishing(ref HostMgd::Publishing::AboutToBeginBackgroundPublishingEventArgs e);
Public Sub FireAboutToBeginBackgroundPublishing(ByRef e As HostMgd.Publishing.AboutToBeginBackgroundPublishingEventArgs)
 Ссылки
 Publisher Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!