Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.Application.UserConfigurationManager
 Послать отзыв
 Свойство предназначено для доступа к менеджеру конфигурации пользователя.
 Синтаксис
C#
Visual Basic
Копировать Код
public static UserConfigurationManager UserConfigurationManager
Копировать Код
Public Shared ReadOnly Property UserConfigurationManager As UserConfigurationManager
 Возвращает
 Возвращает ссылку на менеджер конфигурации пользователя. Тип UserConfigurationManager.
 Описание
 Свойство предоставляет доступ к менеджеру конфигурации пользователя, с помощью которого можно управлять глобальными переменными, профилем пользователя, секциями диалога в реестре Windows для приложения nanoCAD.
 Условия
 Только чтение.
 Ссылки
 HostMgd.ApplicationServices.Application, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!