Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptSelectionOptions.MessageForAdding
 Послать отзыв
 Свойство возвращает или устанавливает сообщение, отображаемое при добавлении объектов в выборку.
 Синтаксис
C#
Visual Basic
Копировать Код
public string MessageForAdding { get; set; }
Копировать Код
Public Property MessageForAdding As String
 Возвращает
 Возвращает строку (string), которая отображается в командной строке при добавлении объектов к существующей выборке.
Если значение null или пустое — используется Message или сообщение по умолчанию.
Если задано — отображается только при добавлении объектов (не при первом выборе).
 Описание
 Свойство предназначено для задания текста приглашения, который отображается пользователю во время добавления объектов в текущий набор выбора — например, при многократном выборе с возможностью добавления (режим "Выберите больше объектов...").
 Оно позволяет улучшить пользовательский интерфейс, делая его более понятным: вместо стандартного сообщения система может показать контекстное, например: "Выберите объекты для копирования (добавьте ещё):" или "Добавьте элементы к выборке:".
 Условия
 Чтение и запись
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("PromptSelectionOptionsExample_MessageForAdding")] public void PromptSelectionOptionsExample_MessageForAdding() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создаём набор параметров для запроса PromptSelectionOptions options = new PromptSelectionOptions(); options.MessageForAdding = "Выберите линии для объединения:"; // Фильтр: только объекты типа Line TypedValue[] filterList = new TypedValue[] { new TypedValue((int)DxfCode.Start, "LINE") }; SelectionFilter filter = new SelectionFilter(filterList); // Создаём запрос пользователю PromptSelectionResult result = editor.GetSelection(options, filter); // Если все данные введены, выводим результат в командную строку if (result.Status == PromptStatus.OK) { SelectionSet selSet = result.Value; editor.WriteMessage( $"\nВыбрано объектов: {selSet.Count}"); } else { editor.WriteMessage( "\nНе удалось получить выделение."); } } }
 Ссылки
 HostMgd.EditorInput.PromptSelectionOptions, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!