Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.DsdEntry.Layout
 Послать отзыв
 Свойство Layout представляет имя листа в файле DWG с именем DwgName. Не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public System.String Layout;
Копировать Код
Public Property Layout As System.String
 Возвращает
 Возвращает имя листа в файле DWG. Тип System.String.
 Описание
 Свойство Layout представляет имя публикуемого листа в файле DWG, имя которого возвращает свойство DwgName.
 В текущей версии не реализовано.
 Условия
 Чтение и запись.
 Ссылки
 HostMgd.PlottingServices.DsdEntry, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!