Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.PlotConfig.TagLine
 Послать отзыв
 Свойство TagLine представляет тег устройства. Не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public System.String TagLine;
Копировать Код
Public ReadOnly Property TagLine As System.String
 Возвращает
 Возвращает тег устройства. Тип System.String.
 Описание
 Свойство TagLine представляет тег устройства.
 В текущей версии не реализовано.
 Условия
 Только чтение.
 Ссылки
 HostMgd.PlottingServices.PlotConfig, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!