Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод SelectionSet.GetObjectIds
 Послать отзыв
 Синтаксис
C#
Visual Basic
public array<Teigha::DatabaseServices::ObjectId> GetObjectIds();
Public Function GetObjectIds() As array<Teigha.DatabaseServices.ObjectId>
 Описание
 Возвращает массив Id выбранных объектов.
 Ссылки
 SelectionSet Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!