Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.DsdData.PlotStampOn
 Послать отзыв
 Свойство PlotStampOn позволяет определить, включена ли простановка штемпеля чертежа. Не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool PlotStampOn;
Копировать Код
Public Property PlotStampOn As Boolean
 Возвращает
 Возвращает true, если флаг простановки штемпеля чертежа установлен. В противном случае возвращает false.
 Описание
 Свойство PlotStampOn позволяет определить, включена ли простановка штемпеля чертежа. Если данный флаг установлен и указан допустимый путь к файлу PSS (Plot Stamp Settings), все листы в задании на публикацию будут проштампованы.
 В текущей версии не реализовано.
 Условия
 Чтение и запись.
 Ссылки
 HostMgd.PlottingServices.DsdData, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!