Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.Windows.ToolPalette.CustomToolBase.CreateFlyoutTool
 Послать отзыв
 Метод создает выпадающий инструмент, который может содержать пакеты других инструментов. Не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public HostMgd.Windows.ToolPalette.Tool CreateFlyoutTool( ref HostMgd.Windows.ToolPalette.Package palette, ref HostMgd.Windows.ToolPalette.Package shapePackage, ref System.String toolNameOverride );
Копировать Код
Public Function CreateFlyoutTool( ByRef palette As HostMgd.Windows.ToolPalette.Package, ByRef shapePackage As HostMgd.Windows.ToolPalette.Package, ByRef toolNameOverride As System.String ) As HostMgd.Windows.ToolPalette.Tool
 Параметры
 Параметры
 Описание
 palette
 Входной пакет инструментов. Тип HostMgd.Windows.ToolPalette.Package.
 shapePackage
 Входная форма пакета инструментов. Тип HostMgd.Windows.ToolPalette.Package.
 toolNameOverride
 Входное переопределение имени инструмента. Тип System.String.
 Возвращает
 Возвращает созданный выпадающий инструмент. Тип HostMgd.Windows.ToolPalette.Tool.
 Описание
 Метод создает выпадающий инструмент, который может содержать пакеты других инструментов.
 В текущей версии не реализован.
 Ссылки
 HostMgd.Windows.ToolPalette.CustomToolBase, HostMgd.Windows.ToolPalette
 Ваши комментарии по поводу этого топика: Послать отзыв!