Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Класс HostMgd.EditorInput.SelectionTextInputEventArgs
 Послать отзыв
 Иерархия классов
HostMgd::EditorInput::SelectionTextInputEventArgs
 Синтаксис
C#
Visual Basic
public class SelectionTextInputEventArgs : System.EventArgs;
Public Class SelectionTextInputEventArgs Inherits System.EventArgs
 Описание
 Класс, обеспечивающий данными события KeywordInput и KeywordInput класса PromptSelectionOptions.
 Топики
 Имя
 Описание
 SelectionTextInputEventArgs Методы
 Ниже перечислены методы класса SelectionTextInputEventArgs.
 SelectionTextInputEventArgs Свойства
 Ниже перечислены свойства класса SelectionTextInputEventArgs.
 Ссылки
 SelectionTextInputEventArgs Методы, SelectionTextInputEventArgs Свойства, Топики, SelectionTextInputEventArgs Методы, SelectionTextInputEventArgs Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!