Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.Windows.ToolPalette.CustomToolBase.ToolGuid
 Послать отзыв
 Свойство ToolGuid представляет уникальный идентификатор данного пользовательского инструмента. Не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public Guid ToolGuid;
Копировать Код
Public ReadOnly Property ToolGuid As Guid
 Возвращает
 Возвращает идентификатор пользовательского инструмента. Тип Guid.
 Описание
 Свойство ToolGuid представляет уникальный идентификатор данного пользовательского инструмента.
 В текущей версии не реализовано.
 Условия
 Только чтение.
 Ссылки
 HostMgd.Windows.ToolPalette.CustomToolBase, HostMgd.Windows.ToolPalette
 Ваши комментарии по поводу этого топика: Послать отзыв!