Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PlotProgress.StatusMsgString
 Послать отзыв
 Синтаксис
C#
Visual Basic
public System.String StatusMsgString;
Public Property StatusMsgString() As System.String
 Ссылки
 PlotProgress Класс, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!