Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.InplaceTextEditor.MultiAttribute
 Послать отзыв
 Свойство MultiAttribute позволяет проверить, является ли многострочный атрибут текущим объектом в данном текстовом редакторе. В текущей версии не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool MultiAttribute;
Копировать Код
Public ReadOnly Property MultiAttribute As Boolean
 Возвращает
 Возвращает true, если многострочный атрибут является текущим объектом в данном текстовом редакторе. В противном случае возвращает false.
 Описание
 Свойство MultiAttribute позволяет проверить, является ли многострочный атрибут текущим объектом в данном встроенном текстовом редакторе. В текущей версии не реализовано.
 Условия
 Только чтение.
 Ссылки
 HostMgd.ApplicationServices.InplaceTextEditor, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!