Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Класс HostMgd.Windows.TrayItem
 Послать отзыв
 This is class HostMgd::Windows::TrayItem.
 Иерархия классов
HostMgd::Windows::StatusBarItem HostMgd::Windows::TrayItem
 Синтаксис
C#
Visual Basic
public class TrayItem : StatusBarItem;
Public Class TrayItem Inherits StatusBarItem
 Методы
 Конструкторы
 Класс HostMgd.Windows.TrayItem
 Имя
 Описание
 TrayItem
 This is TrayItem, a member of class TrayItem.
 Топики
 Имя
 Описание
 StatusBarItem Методы
 Ниже перечислены методы класса StatusBarItem.
 StatusBarItem Свойства
 Ниже перечислены свойства класса StatusBarItem.
 StatusBarItem События
 Ниже перечислены события класса StatusBarItem.
 Класс HostMgd.Windows.TrayItem
 Имя
 Описание
 TrayItem Методы
 Ниже перечислены методы класса TrayItem.
 Ссылки
 TrayItem Методы, Методы, Топики, StatusBarItem Методы, StatusBarItem Свойства, StatusBarItem События
 Ваши комментарии по поводу этого топика: Послать отзыв!