Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.MediaBounds.UpperRightPrintableArea
 Послать отзыв
 Свойство UpperRightPrintableArea позволяет задать или получить точку правого верхнего угла области печати. Не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public Teigha.Geometry.Point2d UpperRightPrintableArea;
Копировать Код
Public Property UpperRightPrintableArea As Teigha.Geometry.Point2d
 Возвращает
 Возвращает точку правого верхнего угла области печати. Тип Teigha.Geometry.Point2d.
 Описание
 Свойство UpperRightPrintableArea позволяет задать или получить точку правого верхнего угла области печати.
 В текущей версии не реализовано.
 Условия
 Чтение и запись.
 Ссылки
 HostMgd.PlottingServices.MediaBounds, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!