Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Класс HostMgd.Publishing.PublishSheetEventArgs
 Послать отзыв
 This is class HostMgd::Publishing::PublishSheetEventArgs.
 Иерархия классов
HostMgd::Publishing::PublishSheetEventArgs
 Синтаксис
C#
Visual Basic
public class PublishSheetEventArgs : System.EventArgs;
Public Class PublishSheetEventArgs Inherits System.EventArgs
 Методы
 Конструкторы
 Имя
 Описание
 PublishSheetEventArgs
 This is PublishSheetEventArgs, a member of class PublishSheetEventArgs.
 Топики
 Имя
 Описание
 PublishSheetEventArgs Методы
 Ниже перечислены методы класса PublishSheetEventArgs.
 PublishSheetEventArgs Свойства
 Ниже перечислены свойства класса PublishSheetEventArgs.
 Ссылки
 PublishSheetEventArgs Методы, PublishSheetEventArgs Свойства, Методы, Топики, PublishSheetEventArgs Методы, PublishSheetEventArgs Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!