Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.Windows.ToolPalette.FlyoutEntryAttribute
 Послать отзыв
 Класс FlyoutEntryAttribute представляет атрибут, который идентифицирует выпадающие элементы. Не реализован.
 Иерархия классов
HostMgd::Windows::ToolPalette::FlyoutEntryAttribute
 Синтаксис
C#
Visual Basic
Копировать Код
public sealed class FlyoutEntryAttribute : Attribute
Копировать Код
Public NotInheritable Class FlyoutEntryAttribute Inherits Attribute
 Описание
 Класс FlyoutEntryAttribute представляет атрибут, который идентифицирует выпадающие элементы.
 В текущей версии не реализован.
 Методы
 Конструкторы
 Имя
 Описание
 FlyoutEntryAttribute
 Это обзор перегрузок FlyoutEntryAttribute.
 Топики
 Имя
 Описание
 FlyoutEntryAttribute Свойства
 Ниже перечислены свойства класса FlyoutEntryAttribute.
 Ссылки
 FlyoutEntryAttribute Конструктор, FlyoutEntryAttribute Свойства, Методы, Топики, FlyoutEntryAttribute Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!