Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.Document.PushDbmod()
 Послать отзыв
 Метод предназначен для копирования текущего значения системной переменной DBMOD, доступной только для чтения, в стэк. Метод не реализован.
 Синтаксис
C#
Visual Basic
public void PushDbmod();
Public Sub PushDbmod()
 Описание
 Метод копирует текущее значение системной переменной DBMOD в стек. Это позволяет сохранить текущее значение системной переменной DBMOD, доступной только для чтения, для последующего восстановления с помощью метода PopDbmod(). PushDbmod() и PopDbmod() позволяют вашему приложению изменять базу данных, не помечая ее как измененную, как это обычно делается приложениями во время инициализации сеанса редактирования. Это включает в себя изменение переменных заголовка базы данных или добавление и модификацию объектов в редактируемой базе данных, что приводит к установке флагов в системной переменной документа DBMOD. Когда значение DBMOD не равно нулю, при попытке пользователя выйти из чертежа выводится запрос "Сохранить ваш чертеж?". Чтобы избежать этого запроса в вашем приложении, скопируйте текущее значение DBMOD с помощью PushDbmod(), прежде чем начинать изменять базу данных таким образом, чтобы это не вызывало этого запроса, и восстановите DBMOD с помощью PopDbmod(), когда такие изменения будут завершены.
 Замечания
 Вызовы функции PushDbmod() должны быть сопряжены с вызовами функции PopDbmod(). Чтобы избежать перезаписи флагов DBMOD, установленных другими приложениями, старайтесь не вводить значение DBMOD, когда ваш код, загружающий приложение, выполняет какие-либо действия, которые могут привести к загрузке другого приложения, включая загрузку файлов DWG или DXF, вызов команд, определяемых приложением, и прямую загрузку программного обеспечения. Метод не реализован.
 Ссылки
 HostMgd.ApplicationServices.Document, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!