Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Событие Application.SystemVariableChanging
 Послать отзыв
 Событие, возникающее перед изменением значения системной переменной. Это событие обеспечивает приложению возможность запомнить исходное значение системной переменной до ее изменения.
 Синтаксис
C#
Visual Basic
public event SystemVariableChangingEventHandler SystemVariableChanging;
Public Event SystemVariableChanging As SystemVariableChangingEventHandler
 Описание
 Событие возникает всегда, когда системная переменная изменяется с помощью команды SETVAR или с помощью указания имени переменной в командной строке. Для остальных встроенных команд, которые вызывают изменение системных переменных, возникновение этого события не гарантировано.
 Ссылки
 HostMgd.ApplicationServices.Application, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!