Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.Windows.ToolPalette.CustomToolBase.InvokeCommand
 Послать отзыв
 Метод предназначен для выполнения пользовательских команд, связанных с данным инструментом и выполняющих дополнительные действия с инструментом. Не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void InvokeCommand( UInt32 idCommand, UInt32 window );
Копировать Код
Public Overridable Sub InvokeCommand( idCommand As UInt32, window As UInt32 )
 Параметры
 Параметры
 Описание
 idCommand
 Идентификатор пользовательской команды. Тип UInt32.
 window
 Дескриптор (HWND) родительского окна, в котором могут отображаться связанные с командой диалоги или всплывающие окна. Тип UInt32.
 Описание
 Метод предназначен для выполнения пользовательских команд, связанных с данным инструментом и выполняющих дополнительные действия с инструментом (например, при нажатии кнопки в расширенном UI инструмента).
 В текущей версии не реализован.
 Замечания
 Метод InvokeCommand() не вызывается при обычной активации инструмента, для этого используется метод Execute().
 Ссылки
 HostMgd.Windows.ToolPalette.CustomToolBase, HostMgd.Windows.ToolPalette
 Ваши комментарии по поводу этого топика: Послать отзыв!