Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.PromptingForPoint
 Послать отзыв
 Событие возникает при начале операции ввода точки и позволяет настроить параметры команды до её запуска.
 Синтаксис
C#
Visual Basic
Копировать Код
public event PromptPointOptionsEventHandler PromptingForPoint;
Копировать Код
Public Event PromptingForPoint As PromptPointOptionsEventHandler
 Описание
 Событие инициируется перед началом интерактивного ввода точки — например, при вызове метода GetPoint() или GetCorner(). Оно предоставляет доступ к параметрам ввода через объект PromptPointOptionsEventArgs, что позволяет разработчику динамически изменять:
текст приглашения (Message),
базовую точку (BasePoint),
режимы привязки (UseBasePoint, UseDashedLine),
разрешение на пропуск ввода (AllowNone).
 Это событие особенно полезно при реализации команд, где требуется гибкая настройка поведения ввода точки в зависимости от контекста — например, при построении объектов, привязке к предыдущей точке или отображении визуальных подсказок.
 Событие реализуется через делегат PromptPointOptionsEventHandler и вызывается до отображения запроса пользователю, что позволяет адаптировать параметры ввода в реальном времени.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события PromptingForPoint [Teigha.Runtime.CommandMethod("PromptingForPointExample")] public void PromptingForPointExample() { // Подписка на событие PromptingForPoint editor.PromptingForPoint += OnEditorPromptingForPoint; } // Реализация отработки события PromptingForPoint private void OnEditorPromptingForPoint(object sender, PromptPointOptionsEventArgs e) { // Изменение сообщения приглашения e.Options.Message = "Укажите точку вставки:"; // Установка базовой точки и включение штриховой линии e.Options.BasePoint = new Point3d(0, 0, 0); e.Options.UseBasePoint = true; e.Options.UseDashedLine = true; } }
 Порядок работы с событием:
Вызывается метод GetPoint() или аналогичный.
Перед началом ввода генерируется событие PromptingForPoint.
Разработчик может изменить параметры через e.Options.
Пользователь указывает точку, и операция завершается событием PromptedForPoint.
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!