Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.PlotConfig.SaveToPC3
 Послать отзыв
 Метод сохраняет текущую конфигурацию плоттера в указанный файл PC3. Не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SaveToPC3( ref System.String name );
Копировать Код
Public Sub SaveToPC3( ByRef name As System.String )
 Параметры
 Параметры
 Описание
 name
 Входное имя файла PC3. Тип System.String.
 Описание
 Метод сохраняет текущую конфигурацию плоттера в указанный файл PC3.
 В текущей версии не реализован.
 Замечания
 Этот метод сохраняет файл PC3, но не загружает его в память. Любая операция, выполняемая над объектом PlotConfig, будет применяться к старой конфигурации.
 Ссылки
 HostMgd.PlottingServices.PlotConfig, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!