Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство DocumentDestroyedEventArgs.FileName
 Послать отзыв
 Синтаксис
C#
Visual Basic
public System.String FileName;
Public Property FileName() As System.String
 Описание
 Возвращает имя уничтоженного документа.
 Условия
 Только на чтение
 Ссылки
 DocumentDestroyedEventArgs Класс, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!