Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.PromptingForCorner
 Послать отзыв
 Событие возникает при начале операции ввода точки, используемой как угол прямоугольной области. Событие не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public event PromptPointOptionsEventHandler PromptingForCorner;
Копировать Код
Public Event PromptingForCorner As PromptPointOptionsEventHandler
 Описание
 Событие инициируется перед началом интерактивного ввода точки, которая будет использована как угол прямоугольной области — например, при вызове метода GetCorner(). Оно позволяет разработчикам надстроек nanoCAD динамически изменять параметры приглашения, такие как сообщение, базовая точка, допустимые ограничения и другие, до начала взаимодействия с пользователем.
 Событие реализуется через делегат PromptPointOptionsEventHandler, который передаёт объект PromptPointOptionsEventArgs, содержащий параметры ввода точки, и может быть использован для настройки контекста ввода в зависимости от логики команды.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события PromptingForCorner [Teigha.Runtime.CommandMethod("PromptingForCornerExample")] public void PromptingForCornerExample() { // Подписка на событие PromptingForCorner editor.PromptingForCorner += OnEditorPromptingForCorner; } // Реализация отработки события PromptingForCorner private void OnEditorPromptingForCorner(object sender, PromptPointOptionsEventArgs e) { // Изменение текста приглашения e.Options.Message = "Укажите второй угол прямоугольной области."; // Установка базовой точки e.Options.BasePoint = new Point3d(0, 0, 0); // Ограничение ввода только в первом квадранте e.Options.UseBasePoint = true; } }
 Порядок работы с событием:
Вызывается метод GetCorner() или аналогичный.
Перед началом ввода генерируется событие PromptingForCorner.
Разработчик может изменить параметры ввода точки.
Пользователь указывает точку, и операция завершается событием PromptedForCorner.
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!