Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.Windows.ToolPalette.CustomToolBase.Refreshed
 Послать отзыв
 Метод вызывается после обновления данного пользовательского инструмента. Не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void Refreshed( ref System.String url );
Копировать Код
Public Overridable Sub Refreshed( ByRef url As System.String )
 Параметры
 Параметры
 Описание
 url
 Входной URL, связанный с инструментом. Тип System.String.
 Описание
 Метод вызывается после обновления данного пользовательского инструмента. Метод обеспечивает обновление всех загруженных данных инструмента.
 В текущей версии не реализован.
 Ссылки
 HostMgd.Windows.ToolPalette.CustomToolBase, HostMgd.Windows.ToolPalette
 Ваши комментарии по поводу этого топика: Послать отзыв!