Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Camera.FieldOfView
 Послать отзыв
 Свойство FieldOfView представляет размер поля для данной камеры. Не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public double FieldOfView;
Копировать Код
Public ReadOnly Property FieldOfView As Double
 Возвращает
 Возвращает размер поля для данной камеры. Тип double.
 Описание
 Свойство FieldOfView представляет размер поля для данной камеры. В текущей версии не реализовано.
 Условия
 Только чтение.
 Ссылки
 HostMgd.EditorInput.Camera, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!