Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.SetImpliedSelection(ObjectId[])
 Послать отзыв
 Метод устанавливает массив объектов как текущее неявное выделение для последующих команд.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetImpliedSelection(ObjectId[] selectedObjects);
Копировать Код
Public Sub SetImpliedSelection(selectedObjects As ObjectId[])
 Параметры
 Параметры
 Описание
 selectedObjects
 Массив идентификаторов объектов (ObjectId), которые будут установлены как текущее неявное выделение. Тип ObjectId[]
 Описание
 Метод используется для программного задания набора объектов, который будет считаться неявно выделенным перед выполнением следующей команды. Это позволяет автоматически предоставлять выделение другим командам без необходимости повторного выбора объектов пользователем. Метод может быть полезен при создании скриптов или плагинов, где требуется сохранить и передать контекст выборки между операциями.
 Пример
C#
  using HostMgd.ApplicationServices; using HostMgd.EditorInput;
 public partial class Commands { [Teigha.Runtime.CommandMethod("SetImpliedSelectionExample_ObjectIdArr")] public void SetImpliedSelectionExample_ObjectIdArr() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor;
 // Получаем доступ к базе данных и менеджеру транзакций документа Database db = doc.Database; Teigha.DatabaseServices.TransactionManager tm = db.TransactionManager;
 // Создаём массив идентификаторов ObjectId[] objIdArray = new ObjectId[2];
 // Сохраняем идентификатор активного пространства в переменную ObjectId currentSpaceId = db.CurrentSpaceId;
 // Начинаем транзакцию с базой данных документа using (Transaction tr = tm.StartTransaction()) { // Открываем активное пространство, чтобы получить идентификаторы объектов чертежа BlockTableRecord btr = tr.GetObject(currentSpaceId, OpenMode.ForRead) as BlockTableRecord;
 // Добавляем в созданный ранее массив идентификаторов первые два объекта if (btr != null) { int i = 0; do { objIdArray[i] = btr.GetEnumerator().Current; btr.GetEnumerator().MoveNext(); i++; } while (i < 2);
 }
 // Завершение транзакции tr.Abort(); }
 // Установка массива идентификаторов как неявного выделения editor.SetImpliedSelection(objIdArray);
 // Вывод сообщения в командную строку editor.WriteMessage("\nНеявное выделение установлено."); } }
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!