Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.Windows.ToolPalette.CustomToolBase.IsFullView
 Послать отзыв
 Метод вызывается, чтобы выяснить требуемый размер отображаемого свойства данного инструмента в расширенном (full) виде (например, как многострочный текст). Не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void IsFullView( ref System.Object id, bool visible, UInt32 integralHeight );
Копировать Код
Public Overridable Sub IsFullView( ByRef id As System.Object, visible As Boolean, integralHeight As UInt32 )
 Параметры
 Параметры
 Описание
 id
 Входной идентификатор свойства, для которого запрашивается расширенный режим отображения. Тип System.Object.
 visible
 Флаг режима отображения свойства. Тип bool. Возвращает true, если свойство должно отображаться в full-режиме. В противном случае возвращает false.
 integralHeight
 Возвращает требуемую высоту (в пикселях) для отображения этого свойства в full-режиме. Тип UInt32.
 Описание
 Метод вызывается, чтобы определить, должно ли свойство с заданным идентификатором id отображаться в расширенном (full) виде и задать высоту integralHeight такого представления в пикселях. Метод полезен для отображения сложных свойств, представление которых не сводится к простому однострочному тексту.
 В текущей версии не реализован.
 Ссылки
 HostMgd.Windows.ToolPalette.CustomToolBase, HostMgd.Windows.ToolPalette
 Ваши комментарии по поводу этого топика: Послать отзыв!