Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор CommandClassAttribute.CommandClassAttribute (Type^)
 Послать отзыв
 This is CommandClassAttribute, a member of class CommandClassAttribute.
 Синтаксис
C#
Visual Basic
public CommandClassAttribute(ref Type name);
Public Sub New(ByRef name As Type)
 Ссылки
 CommandClassAttribute Класс, HostMgd.Runtime Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!