Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Класс HostMgd.Windows.PaletteAddContextMenuEventArgs
 Послать отзыв
 This is class HostMgd::Windows::PaletteAddContextMenuEventArgs.
 Иерархия классов
HostMgd::Windows::PaletteAddContextMenuEventArgs
 Синтаксис
C#
Visual Basic
public class PaletteAddContextMenuEventArgs : System.EventArgs;
Public Class PaletteAddContextMenuEventArgs Inherits System.EventArgs
 Методы
 Конструкторы
 Имя
 Описание
 PaletteAddContextMenuEventArgs
 This is PaletteAddContextMenuEventArgs, a member of class PaletteAddContextMenuEventArgs.
 Топики
 Имя
 Описание
 PaletteAddContextMenuEventArgs Свойства
 Ниже перечислены свойства класса PaletteAddContextMenuEventArgs.
 Ссылки
 PaletteAddContextMenuEventArgs Свойства, Методы, Топики, PaletteAddContextMenuEventArgs Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!