Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод KeywordCollection.GetEnumerator
 Послать отзыв
 Синтаксис
C#
Visual Basic
public System.Collections.IEnumerator GetEnumerator();
Public Function GetEnumerator() As System.Collections.IEnumerator
 Описание
 Метод возвращает IEnumerator коллекции.
 Ссылки
 KeywordCollection Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!