Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Класс HostMgd.Windows.TrayItemCollection
 Послать отзыв
 This is class HostMgd::Windows::TrayItemCollection.
 Иерархия классов
HostMgd::Windows::TrayItemCollection
 Синтаксис
C#
Visual Basic
public class TrayItemCollection : IList;
Public Class TrayItemCollection Inherits IList
 Топики
 Имя
 Описание
 TrayItemCollection Методы
 Ниже перечислены методы класса TrayItemCollection.
 TrayItemCollection Свойства
 Ниже перечислены свойства класса TrayItemCollection.
 Ссылки
 TrayItemCollection Методы, TrayItemCollection Свойства, Топики, TrayItemCollection Методы, TrayItemCollection Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!