Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PlotProgress.SheetCancelStatus
 Послать отзыв
 Синтаксис
C#
Visual Basic
public HostMgd::PlottingServices::SheetCancelStatus SheetCancelStatus;
Public Property SheetCancelStatus() As HostMgd.PlottingServices.SheetCancelStatus
 Ссылки
 PlotProgress Класс, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!