Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод TabbedDialogExtension.SetDirty (System::Windows::Forms::Control^, bool)
 Послать отзыв
 Синтаксис
C#
Visual Basic
public void SetDirty(ref System.Windows.Forms.Control control, bool dirty);
Public Sub SetDirty(ByRef control As System.Windows.Forms.Control, dirty As bool)
 Параметры
 Параметры
 Описание
 control
 Объект, для которого устанавливается признак
 dirty
 Значение устанавливаемого признака
 Описание
 Устанавливает "грязный" бит (признак того, что объект был изменен после последнего сохранения).
 Ссылки
 TabbedDialogExtension Класс, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!