Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.DocumentCollection.Count
 Послать отзыв
 Свойство предоставляет информацию о количестве документов в коллекции.
 Синтаксис
C#
Visual Basic
public int Count;
Public Property Count() As Integer
 Возвращает
 Возвращает количество документов в коллекции. Тип int
 Описание
 Свойство предоставляеи информацию о количестве документов в коллекции.
 Условия
 Только чтение
 Ссылки
 HostMgd.ApplicationServices.DocumentCollection, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!