Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.DeviceInputEventHandler(Object, DeviceInputEventArgs)
 Послать отзыв
 Делегат DeviceInputEventHandler используется в обработке пользовательских событий, связанных с устройствами ввода.
 Синтаксис
C#
Visual Basic
Копировать Код
public delegate void DeviceInputEventHandler( Object sender, DeviceInputEventArgs e );
Копировать Код
Public Delegate Sub DeviceInputEventHandler( sender As Object, e As DeviceInputEventArgs )
 Параметры
 Параметры
 Описание
 sender
 Объект, инициировавший событие. Тип Object.
 e
 Аргументы события. Тип DeviceInputEventArgs.
 Описание
 Делегат DeviceInputEventHandler используется для обработки пользовательских событий, связанных с устройствами ввода. Контекст события передается через параметры sender и e, где e передает параметры низкоуровневых пользовательских событий, связанных с изменениями состояния устройства ввода (например, мыши, клавиатуры или графического планшета).
 Ваши комментарии по поводу этого топика: Послать отзыв!