Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Делегат HostMgd.ApplicationServices.SystemVariableChangingEventHandler
 Послать отзыв
 Делегат события начала изменения переменной
 Синтаксис
C#
Visual Basic
public delegate SystemVariableChangingEventHandler();
Public Delegate Sub SystemVariableChangingEventHandler()
 Ваши комментарии по поводу этого топика: Послать отзыв!