Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Класс HostMgd.EditorInput.PromptSaveFileOptions
 Послать отзыв
 Иерархия классов
HostMgd::EditorInput::PromptFileOptions HostMgd::EditorInput::PromptSaveFileOptions
 Синтаксис
C#
Visual Basic
public class PromptSaveFileOptions : PromptFileOptions;
Public Class PromptSaveFileOptions Inherits PromptFileOptions
 Описание
 Этот класс содержит опции конфигурации окна диалога выбора имени файла, которые передаются в метод Editor.GetFileNameForSave().
 Методы
 Конструкторы
 Класс HostMgd.EditorInput.PromptSaveFileOptions
 Имя
 Описание
 PromptSaveFileOptions
 Топики
 Имя
 Описание
 PromptFileOptions Свойства
 Ниже перечислены свойства класса PromptFileOptions.
 Класс HostMgd.EditorInput.PromptSaveFileOptions
 Имя
 Описание
 PromptSaveFileOptions Свойства
 Ниже перечислены свойства класса PromptSaveFileOptions.
 Ссылки
 PromptSaveFileOptions Свойства, Методы, Топики, PromptFileOptions Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!