Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.DsdEntryCollection
 Послать отзыв
 Класс DsdEntryCollection представляет коллекцию объектов HostMgd.PlottingServices.DsdEntry.
 Иерархия классов
Teigha::Runtime::DisposableWrapper HostMgd::PlottingServices::DsdEntryCollection
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("AcPlDSDEntries")] public class DsdEntryCollection : DisposableWrapper, System.Collections.ICollection
Копировать Код
<Wrapper("AcPlDSDEntries")> Public Class DsdEntryCollection Inherits DisposableWrapper Implements System.Collections.ICollection
 Описание
 Класс DsdEntryCollection представляет коллекцию объектов HostMgd.PlottingServices.DsdEntry.
 Методы
 Конструкторы
 HostMgd.PlottingServices.DsdEntryCollection
 Имя
 Описание
 DsdEntryCollection
 Конструктор по умолчанию класса DsdEntryCollection.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 HostMgd.PlottingServices.DsdEntryCollection
 Имя
 Описание
 DsdEntryCollection Методы
 Ниже перечислены методы класса DsdEntryCollection.
 DsdEntryCollection Свойства
 Ниже перечислены свойства класса DsdEntryCollection.
 Ссылки
 DsdEntryCollection Методы, DsdEntryCollection Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!