Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.MediaBounds.IsEqualTo
 Послать отзыв
 Метод позволяет проверить, совпадают ли границы носителя в данном объекте и в указанном объекте MediaBounds с точностью по умолчанию. Не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsEqualTo( ref HostMgd.PlottingServices.MediaBounds a );
Копировать Код
Public Function IsEqualTo( ByRef a As HostMgd.PlottingServices.MediaBounds ) As Boolean
 Параметры
 Параметры
 Описание
 a
 Входной объект, с которым выполняется сравнение. Тип HostMgd.PlottingServices.MediaBounds.
 Возвращает
 Возвращает true, если в пределах точности по умолчанию границы листа, определенные данным объектом и объектом a, совпадают. В противном случае возвращает false.
 Описание
 Метод позволяет проверить, совпадают ли границы носителя (листа) в данном объекте и в указанном объекте MediaBounds с точностью по умолчанию. Для этого используется вызов метода MediaBounds.IsEqualTo(MediaBounds a, Tolerance tolerance) c точностью, равной Tolerance.Global.
 В текущей версии не реализован.
 Ссылки
 HostMgd.PlottingServices.MediaBounds, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!