Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.GetDouble(String)
 Послать отзыв
 Метод позволяет пользователю ввести вещественное число через командную строку, возвращая результат в виде объекта PromptDoubleResult.
 Синтаксис
C#
Visual Basic
Копировать Код
public PromptDoubleResult GetDouble(String message);
Копировать Код
Public Function GetDouble(message As String) As PromptDoubleResult
 Параметры
 Параметры
 Описание
 message
 Сообщение, отображаемое в командной строке для приглашения пользователя к вводу числа (например, "Введите радиус окружности:"). Тип String.
 Возвращает
 Возвращает объект типа PromptDoubleResult, который содержит:
Status — статус операции (OK, Cancel, Error и др.).
Value — введённое пользователем числовое значение типа double (если ввод успешен).
StringResult — строковое представление введённого значения.
 Описание
 Метод используется для интерактивного получения от пользователя числового значения типа double. Пользователь может ввести число с клавиатуры, при этом система автоматически проверяет корректность формата. Метод выводит заданное текстовое приглашение и ожидает ввода до тех пор, пока не будет получено допустимое значение или операция не будет прервана.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("GetDoubleExample_String")] public void GetDoubleExample_String() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создаём запрос пользователю PromptDoubleResult result = editor.GetDouble("\nВведите значение:"); // Если все данные введены, выводим результат в командную строку if (result.Status == PromptStatus.OK) { double value = result.Value; editor.WriteMessage($"\nВведено число: {value}"); } else { editor.WriteMessage("\nВвод отменён или произошла ошибка."); } } }
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!