Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.Windows.ToolPalette.CustomToolBase.GetData
 Послать отзыв
 Метод предоставляет COM-интерфейсы, необходимые для редактирования свойств пользовательского инструмента. Не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void GetData( ref System.Object staticProperties, ref System.Object dynamicProperties );
Копировать Код
Public Overridable Sub GetData( ByRef staticProperties As System.Object, ByRef dynamicProperties As System.Object )
 Параметры
 Параметры
 Описание
 staticProperties
 Статические свойства инструмента. Тип System.Object.
 dynamicProperties
 Динамические свойства инструмента. Тип System.Object.
 Описание
 Метод предоставляет COM-интерфейсы, необходимые для редактирования свойств пользовательского инструмента. Метод используется в случае, когда требуется редактирование свойств инструмента в модальном диалоговом окне инспектора свойств.
 В текущей версии не реализован.
 Ссылки
 HostMgd.Windows.ToolPalette.CustomToolBase, HostMgd.Windows.ToolPalette
 Ваши комментарии по поводу этого топика: Послать отзыв!