Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство EPlotPropertyBag.Properties
 Послать отзыв
 This is Properties, a member of class EPlotPropertyBag.
 Синтаксис
C#
Visual Basic
public HostMgd::Publishing::EPlotPropertyCollection Properties;
Public Property Properties() As HostMgd.Publishing.EPlotPropertyCollection
 Ссылки
 EPlotPropertyBag Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!