Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.PlotPageInfo.OleObjectCount
 Послать отзыв
 Свойство OleObjectCount предоставляет оценку количества OLE-объектов на странице.
 Синтаксис
C#
Visual Basic
Копировать Код
public int OleObjectCount;
Копировать Код
Public ReadOnly Property OleObjectCount As Integer
 Возвращает
 Возвращает количество OLE-объектов. Тип int.
 Описание
 Свойство OleObjectCount предоставляет оценку количества OLE-объектов на печатаемой странице.
 Условия
 Только чтение.
 Ссылки
 HostMgd.PlottingServices.PlotPageInfo, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!