Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Класс HostMgd.EditorInput.JigPromptDistanceOptions
 Послать отзыв
 Класс предназначен для хранения набора параметров, необходимых для запроса расстояния во время операции Jig с геометрическими объектами.
 Иерархия классов
HostMgd::EditorInput::PromptOptions HostMgd::EditorInput::JigPromptOptions HostMgd::EditorInput::JigPromptGeometryOptions HostMgd::EditorInput::JigPromptDistanceOptions
 Синтаксис
C#
Visual Basic
public class JigPromptDistanceOptions : JigPromptGeometryOptions;
Public Class JigPromptDistanceOptions Inherits JigPromptGeometryOptions
 Описание
 Класс предназначен для для хранения набора параметров, необходимых для запроса расстояния во время операции Jig с геометрическими объектами. Используется с методом AcquireDistance() класса JigPrompts и позволяет установить для запроса расстояния базовую точку, приглашающее сообщение, ключевые слова, значение по умолчанию, внешний вид курсора и изменить пользовательские настройки ввода.
 Методы
 Конструкторы
 Класс HostMgd.EditorInput.JigPromptGeometryOptions
 Имя
 Описание
 JigPromptGeometryOptions
 Это обзор перегрузок JigPromptGeometryOptions.
 Класс HostMgd.EditorInput.JigPromptDistanceOptions
 Имя
 Описание
 JigPromptDistanceOptions
 Это обзор перегрузок JigPromptDistanceOptions.
 Топики
 Имя
 Описание
 PromptOptions Методы
 Ниже перечислены методы класса PromptOptions.
 PromptOptions Свойства
 Ниже перечислены свойства класса PromptOptions.
 Класс HostMgd.EditorInput.JigPromptOptions
 Имя
 Описание
 JigPromptOptions Методы
 Ниже перечислены методы класса JigPromptOptions.
 JigPromptOptions Свойства
 Ниже перечислены свойства класса JigPromptOptions.
 Класс HostMgd.EditorInput.JigPromptGeometryOptions
 Имя
 Описание
 JigPromptGeometryOptions Свойства
 Ниже перечислены свойства класса JigPromptGeometryOptions.
 Класс HostMgd.EditorInput.JigPromptDistanceOptions
 Имя
 Описание
 JigPromptDistanceOptions Методы
 Ниже перечислены методы класса JigPromptDistanceOptions.
 JigPromptDistanceOptions Свойства
 Ниже перечислены свойства класса JigPromptDistanceOptions.
 Ссылки
 JigPromptDistanceOptions Конструктор, JigPromptDistanceOptions Методы, JigPromptDistanceOptions Свойства, Методы, Топики, PromptOptions Методы, PromptOptions Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!