Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PaletteSetSizeEventArgs.Width
 Послать отзыв
 This is Width, a member of class PaletteSetSizeEventArgs.
 Синтаксис
C#
Visual Basic
public int Width;
Public Property Width() As Integer
 Ссылки
 PaletteSetSizeEventArgs Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!