Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод IConfigurationSection.Contains
 Послать отзыв
 Синтаксис
C#
Visual Basic
bool Contains(ref String name);
Function Contains(ByRef name As String) As bool
 Параметры
 Параметры
 Описание
 name
 Имя для поиска
 Описание
 Возвращает признак того, содержит ли коллекция объект, имя которого содержит name.
 Ссылки
 IConfigurationSection Интерфейс, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!