Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.Dragging
 Послать отзыв
 Событие возникает перед началом операции перетаскивания объекта в чертеже. Событие не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public event DraggingEventHandler Dragging;
Копировать Код
Public Event Dragging As DraggingEventHandler
 Описание
 Событие предназначено для обработки действий, выполняемых перед началом интерактивной операции перетаскивания. Оно позволяет приложениям отслеживать момент начала перемещения объектов с помощью мыши и выполнять пользовательские действия — например, изменять внешний вид объекта, сохранять состояние или отменять операцию на уровне приложения. Событие реализуется через делегат DraggingEventHandler и вызывается до того, как начнётся фактическая операция перетаскивания.
 Замечания
 В текущей версии не реализовано.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события Dragging [Teigha.Runtime.CommandMethod("DraggingExample")] public void DraggingExample() { // Подписка на событие редактора Dragging editor.Dragging += OnEditorDragging; } // Реализация отработки события Dragging private void OnEditorDragging(object sender, EventArgs e) { // Вывод сообщения в командную строку editor.WriteMessage("\nНачало операции перетаскивания."); } }
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!