Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Событие Publisher.InitPublishOptionsDialog
 Послать отзыв
 This is InitPublishOptionsDialog, a member of class Publisher.
 Синтаксис
C#
Visual Basic
public event InitPublishOptionsDialogEventHandler InitPublishOptionsDialog;
Public Event InitPublishOptionsDialog As InitPublishOptionsDialogEventHandler
 Ссылки
 Publisher Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!