Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PointFilterEventArgs.CallNext
 Послать отзыв
 Свойство предназначено для определения, будет ли вызван следующий фильтр в цепочке обработки события PointFilter.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool CallNext { get; }
Копировать Код
Public ReadOnly Property CallNext As Boolean
 Возвращает
 Возвращает значение типа bool:
true — если будет вызван следующий фильтр в цепочке.
false — если дальнейшая фильтрация отменяется.
 Это значение доступно только для чтения и определяется системой на основе текущего контекста обработки события.
 Описание
 Свойство используется в контексте события PointFilter, чтобы указать, требуется ли продолжить фильтрацию точки другими зарегистрированными обработчиками после текущего. Это позволяет управлять порядком и поведением нескольких фильтров, задавая, должен ли результат текущего фильтра передаваться далее по цепочке или остановиться на этом этапе.
 Условия
 Только чтение
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события PointFilter [Teigha.Runtime.CommandMethod("PointFilterExample_CallNextProp")] public void PointFilterExample_CallNextProp() { // Подписка на событие PointFilter editor.PointFilter += OnEditorPointFilter; } // Реализация отработки события PointFilter private void OnEditorPointFilter(object sender, PointFilterEventArgs e) { InputPointContext context = e.Context; if (context != null) { editor.WriteMessage( $"\nТекущий режим привязки: {context.ObjectSnapMask}"); } // Пример: принудительное выравнивание Y-координаты e.Context.ComputedPoint = new Point3d(e.Context.LastPoint.X, 0, e.Context.LastPoint.Z); } }
 Ссылки
 HostMgd.EditorInput.PointFilterEventArgs, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!