Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Событие Application.QuitAborted
 Послать отзыв
 Событие, возникающее в случае отмены завершения работы приложения.
 Синтаксис
C#
Visual Basic
public event System.EventHandler QuitAborted;
Public Event QuitAborted As System.EventHandler
 Описание
 Событие возникает в случае отмены завершения работы приложения (например, при отмене действия при подтверждении сохранения документа).
 Ссылки
 HostMgd.ApplicationServices.Application, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!