Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Перечисление HostMgd.EditorInput.CursorType
 Послать отзыв
 Синтаксис
C#
Visual Basic
public enum CursorType { Crosshair = 0, CrosshairNoRotate = 6, EntitySelect = 8, EntitySelectNoPerspective = 10, Invisible = 7, NoSpecialCursor = -1, NotRotated = 3, Parallelogram = 9, PickfirstOrGrips = 11, RectangularCursor = 1, RotatedCrosshair = 5, RubberBand = 2, TargetBox = 4 }
Public Enum CursorType Crosshair = 0 CrosshairNoRotate = 6 EntitySelect = 8 EntitySelectNoPerspective = 10 Invisible = 7 NoSpecialCursor = -1 NotRotated = 3 Parallelogram = 9 PickfirstOrGrips = 11 RectangularCursor = 1 RotatedCrosshair = 5 RubberBand = 2 TargetBox = 4 End Enum
 Члены
 Члены
 Описание
 Crosshair
 Тип курсора С перекрестием
 CrosshairNoRotate
 Тип курсора С перекрестием без возможности поворота
 EntitySelect
 Тип курсора для выбранного объекта
 EntitySelectNoPerspective
 Тип курсора для выбранного объекта без отображения перспективы
 Invisible
 Невидимый курсор
 NoSpecialCursor
 Обычный вид курсора
 Parallelogram
 Курсор в виде параллелограма
 PickfirstOrGrips
 Курсор в виде указателя или ручки
 RectangularCursor
 Курсор в виде прямоугольника
 RotatedCrosshair
 Курсор в виде повернутого перекрестия
 RubberBand
 Курсор при рисовании резиновой линии
 TargetBox
 Курсор при указании на цель
 Описание
 Перечисление, определяющее различные типы курсора. Этот .NET класс соответствует перечислению NcEdJig::CursorType nanoCAD API.
 Члены
 Описание
 Crosshair = 0
 Тип курсора С перекрестием
 CrosshairNoRotate = 6
 Тип курсора С перекрестием без возможности поворота
 EntitySelect = 8
 Тип курсора для выбранного объекта
 EntitySelectNoPerspective = 10
 Тип курсора для выбранного объекта без отображения перспективы
 Invisible = 7
 Невидимый курсор
 NoSpecialCursor = -1
 Обычный вид курсора
 Parallelogram = 9
 Курсор в виде параллелограма
 PickfirstOrGrips = 11
 Курсор в виде указателя или ручки
 RectangularCursor = 1
 Курсор в виде прямоугольника
 RotatedCrosshair = 5
 Курсор в виде повернутого перекрестия
 RubberBand = 2
 Курсор при рисовании резиновой линии
 TargetBox = 4
 Курсор при указании на цель
 Ваши комментарии по поводу этого топика: Послать отзыв!