Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PerPropertyBrowsingEntryAttribute.ProgId
 Послать отзыв
 This is ProgId, a member of class PerPropertyBrowsingEntryAttribute.
 Синтаксис
C#
Visual Basic
public System.String ProgId;
Public Property ProgId() As System.String
 Ссылки
 PerPropertyBrowsingEntryAttribute Класс, HostMgd.Windows.ToolPalette
 Ваши комментарии по поводу этого топика: Послать отзыв!