Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Событие PaletteSet.PaletteSetDestroy
 Послать отзыв
 Событие генерируется перед уничтожением окна
 Синтаксис
C#
Visual Basic
public event HostMgd::Windows::PaletteSetDestroyEventHandler PaletteSetDestroy;
Public Event PaletteSetDestroy As HostMgd.Windows.PaletteSetDestroyEventHandler
 Ссылки
 PaletteSet Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!