Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Класс HostMgd.EditorInput.CrossingOrWindowSelectedSubObject
 Послать отзыв
 Иерархия классов
HostMgd::EditorInput::SelectedSubObject HostMgd::EditorInput::CrossingOrWindowSelectedSubObject
 Синтаксис
C#
Visual Basic
public class CrossingOrWindowSelectedSubObject : SelectedSubObject;
Public Class CrossingOrWindowSelectedSubObject Inherits SelectedSubObject
 Описание
 Класс, инкапсулирующий подобъект, который выбран при выделении окном или пересечением с окном.
 Методы
 Конструкторы
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 SelectedSubObject
 (Унаследован от SelectedSubObject)
 Класс HostMgd.EditorInput.CrossingOrWindowSelectedSubObject
 Имя
 Описание
 CrossingOrWindowSelectedSubObject
 Топики
 Имя
 Описание
 SelectedSubObject Методы
 Ниже перечислены методы класса SelectedSubObject.
 SelectedSubObject Свойства
 Ниже перечислены свойства класса SelectedSubObject.
 Класс HostMgd.EditorInput.CrossingOrWindowSelectedSubObject
 Имя
 Описание
 CrossingOrWindowSelectedSubObject Методы
 Ниже перечислены методы класса CrossingOrWindowSelectedSubObject.
 Ссылки
 CrossingOrWindowSelectedSubObject Методы, Методы, Топики, SelectedSubObject Методы, SelectedSubObject Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!