Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.GraphicsSystem.Manager.GetGsModel
 Послать отзыв
 Метод предоставляет модель GS, которая соответствует заданным режиму и подрежиму отрисовки временной графики, а также идентификационному номеру видового экрана.
 Синтаксис
C#
Visual Basic
Копировать Код
public Teigha.GraphicsSystem.Model GetGsModel( Teigha.GraphicsInterface.TransientDrawingMode mode, int subDrawingMode, int viewportNumber );
Копировать Код
Public Function GetGsModel( mode As Teigha.GraphicsInterface.TransientDrawingMode, subDrawingMode As Integer, viewportNumber As Integer ) As Teigha.GraphicsSystem.Model
 Параметры
 Параметры
 Описание
 mode
 Входной режим отрисовки временной графики. Тип Teigha.GraphicsInterface.TransientDrawingMode.
 subDrawingMode
 Входной подрежим для указанного режима отрисовки mode. Тип int. Значение не должно быть отрицательным.
 viewportNumber
 Входной идентификационный номер видового экрана. Тип int. Это тот же самое значение, которое возвращает системная переменная CVPORT.
 Возвращает
 Возвращает модель GS, соответствующую входным аргументам. Тип Teigha.GraphicsSystem.Model.
 Описание
 Метод предоставляет модель GS, которая соответствует переданным в метод входным параметрам: режиму и подрежиму отрисовки временной графики, а также идентификационному номеру видового экрана.
 Ссылки
 HostMgd.GraphicsSystem.Manager, HostMgd.GraphicsSystem
 Ваши комментарии по поводу этого топика: Послать отзыв!