Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.Document.CapturePreviewImage(UInt32,UInt32)
 Послать отзыв
 Метод предназначен для получения изображения предварительного просмотра документа. Метод не реализован.
 Синтаксис
C#
Visual Basic
public System.Drawing.Bitmap CapturePreviewImage(UInt32 width, UInt32 height);
Public Function CapturePreviewImage(width As UInt32, height As UInt32) As System.Drawing.Bitmap
 Параметры
 Параметры
 Описание
 width
 Ширина изображения. Тип UInt32
 height
 Длина изображения. Тип UInt32
 Описание
 Метод позволяет получить изображение предварительного просмотра для любого документа, даже если он не активен и не сохранен.
 Замечания
 Метод не реализован.
 Ссылки
 HostMgd.ApplicationServices.Document, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!