Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.DsdData.Password
 Послать отзыв
 Свойство Password представляет пароль, используемый для защиты содержимого выходного DWF-файла. Не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public System.String Password;
Копировать Код
Public Property Password As System.String
 Возвращает
 Возвращает строку пароля. Тип System.String.
 Описание
 Свойство Password представляет пароль, используемый для защиты содержимого выходного DWF-файла. Это поле сохраняется в DSD-файле.
 В текущей версии не реализовано.
 Условия
 Чтение и запись.
 Ссылки
 HostMgd.PlottingServices.DsdData, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!