Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод SelectionSet.FromObjectIds
 Послать отзыв
 Синтаксис
C#
Visual Basic
public SelectionSet FromObjectIds(ref array<Teigha::DatabaseServices::ObjectId> ids);
Public Function FromObjectIds(ByRef ids As array<Teigha.DatabaseServices.ObjectId>) As SelectionSet
 Параметры
 Параметры
 Описание
 ids
 Массив Id объектов
 Описание
 Создает новый выбранный набор, используя массив Id объектов
 Ссылки
 SelectionSet Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!