Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PerPropertyBrowsingEntryAttribute.Weight
 Послать отзыв
 This is Weight, a member of class PerPropertyBrowsingEntryAttribute.
 Синтаксис
C#
Visual Basic
public int Weight;
Public Property Weight() As Integer
 Ссылки
 PerPropertyBrowsingEntryAttribute Класс, HostMgd.Windows.ToolPalette
 Ваши комментарии по поводу этого топика: Послать отзыв!