Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.SwitchToPaperSpace()
 Послать отзыв
 Метод выполняет программное переключение текущего пространства чертежа в пространство листа.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SwitchToPaperSpace();
Копировать Код
Public Sub SwitchToPaperSpace()
 Описание
 Метод используется для смены активного контекста редактора из пространства модели (model space) в пространство листа (paper space), где обычно создаются видовые экраны, оформляется и печатается чертёж. Метод позволяет автоматически переключаться между пространствами без участия пользователя, что удобно при реализации команд, требующих работы именно в пространстве листа.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("SwitchToPaperSpaceExample")] public void SwitchToPaperSpaceExample() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Вызов метода editor.SwitchToPaperSpace(); // Вывод сообщения в командной строке editor.WriteMessage("\nПереключено в пространство листа."); } }
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!