Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptForEntityEndingEventArgs.RemoveSelectedObject()
 Послать отзыв
 Метод удаляет объект, выбранный пользователем в ходе интерактивного приглашения.
 Синтаксис
C#
Visual Basic
Копировать Код
public void RemoveSelectedObject();
Копировать Код
Public Sub RemoveSelectedObject()
 Описание
 Метод предназначен для программного удаления геометрического объекта, который был выбран пользователем во время операции ввода — например, после вызова метода GetEntity(), GetPoint() или другой интерактивной команды. Он позволяет избавиться от выбранного объекта в базе данных чертежа, сохраняя целостность модели и обновляя состояние редактора.
 Замечания
 Метод работает только с тем объектом, который был выбран в рамках текущего контекста ввода, например, через событие PromptForEntityEnding.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события PromptForEntityEnding [Teigha.Runtime.CommandMethod("PromptForEntityEndingExample_RemoveSelectedObject")] public void PromptForEntityEndingExample_RemoveSelectedObject() { // Подписка на событие PromptForEntityEnding editor.PromptForEntityEnding += OnEditorPromptForEntityEnding; } // Реализация отработки события PromptForEntityEnding private void OnEditorPromptForEntityEnding(object sender, PromptForEntityEndingEventArgs e) { if (!e.Result.ObjectId.IsNull) { // Вывод сообщения в командную строку editor.WriteMessage( $"\nВыбраный объект {e.Result.ObjectId.ObjectClass.Name} будет удален"); // Удаление выбранного объекта e.RemoveSelectedObject(); } } }
 Ссылки
 HostMgd.EditorInput.PromptForEntityEndingEventArgs, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!