Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PaletteSetSizeEventArgs.DeviceIndependentHeight
 Послать отзыв
 This is DeviceIndependentHeight, a member of class PaletteSetSizeEventArgs.
 Синтаксис
C#
Visual Basic
public double DeviceIndependentHeight;
Public Property DeviceIndependentHeight() As Double
 Ссылки
 PaletteSetSizeEventArgs Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!