Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PublishSheetEventArgs.PlotWindowMinX
 Послать отзыв
 This is PlotWindowMinX, a member of class PublishSheetEventArgs.
 Синтаксис
C#
Visual Basic
public double PlotWindowMinX;
Public Property PlotWindowMinX() As Double
 Ссылки
 PublishSheetEventArgs Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!