Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.UserInputControls
 Послать отзыв
 Данное перечисление определяет битовые маски всех настроек управления пользовательским вводом, которые действуют в данный момент для используемого варианта технологии Jig.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum UserInputControls { GovernedByOrthoMode = 0x1, NullResponseAccepted = 0x2, DoNotEchoCancelForCtrlC = 0x4, DoNotUpdateLastPoint = 0x8, NoDwgLimitsChecking = 0x10, NoZeroResponseAccepted = 0x20, NoNegativeResponseAccepted = 0x40, Accept3dCoordinates = 0x80, AcceptMouseUpAsPoint = 0x100, AnyBlankTerminatesInput = 0x200, InitialBlankTerminatesInput = 0x400, AcceptOtherInputString = 0x800, GovernedByUCSDetect = 0x1000, NoZDirectionOrtho = 0x2000, UseBasePointElevation = 0x8000 }
Копировать Код
Public Enum UserInputControls GovernedByOrthoMode = 0x1 NullResponseAccepted = 0x2 DoNotEchoCancelForCtrlC = 0x4 DoNotUpdateLastPoint = 0x8 NoDwgLimitsChecking = 0x10 NoZeroResponseAccepted = 0x20 NoNegativeResponseAccepted = 0x40 Accept3dCoordinates = 0x80 AcceptMouseUpAsPoint = 0x100 AnyBlankTerminatesInput = 0x200 InitialBlankTerminatesInput = 0x400 AcceptOtherInputString = 0x800 GovernedByUCSDetect = 0x1000 NoZDirectionOrtho = 0x2000 UseBasePointElevation = 0x8000 End Enum
 Члены
 Члены
 Описание
 Accept3dCoordinates
 Значение: 128 (0x80). Маска определяет режим "Принимать координату Z". По умолчанию ввод ограничен двумерным вводом.
 AcceptMouseUpAsPoint
 Значение: 256 (0x100). Маска определяет режим "Использовать событие отпускания кнопки мыши в момент, когда курсор находится над точкой". По умолчанию такие события не используются для указания точек.
 AcceptOtherInputString
 Значение: 2048 (0x800). Маска определяет режим "Допускать ввод строк, не являющихся ключевыми словами". По умолчанию этот режим отключен.
 AnyBlankTerminatesInput
 Значение: 512 (0x200). Маска определяет режим "Любой пробел завершает ввод". По умолчанию этот режим отключен.
 DoNotEchoCancelForCtrlC
 Значение: 4 (0x4). Маска определяет режим "Не выводить *Cancel* для Ctrl-C". По умолчанию этот режим отключен, и *Cancel* отображается.
 DoNotUpdateLastPoint
 Значение: 8 (0x8). Маска определяет режим "Не обновлять последнюю точку". Последняя точка обновляется по умолчанию.
 GovernedByOrthoMode
 Значение: 1 (0x1). Маска устанавливает бит "Учитывать системную переменную ORTHOMODE" в пакете запроса пользовательского ввода. По умолчанию этот бит не установлен. Заметим, что метод JigPrompts.AcquirePoint() всегда учитывает текущее значение системной переменной ORTHOMODE, независимо от состояния этого бита.
 GovernedByUCSDetect
 Значение: 4096 (0x1000). Описание будет представлено позже.
 InitialBlankTerminatesInput
 Значение: 1024 (0x400). Маска определяет режим "Начальный пробел завершает ввод". По умолчанию этот режим отключен.
 NoDwgLimitsChecking
 Значение: 16 (0x10). Маска определяет режим "Не проверять границы отрисовки для точек". Границы отрисовки проверяются по умолчанию.
 NoNegativeResponseAccepted
 Значение: 64 (0x40). Маска определяет режим "Не принимать отрицательные значения". По умолчанию отрицательные значения принимаются. Работает только для методов JigPrompts.AcquireDistance() и JigPrompts.AcquireAngle().
 NoZDirectionOrtho
 Значение: 8192 (0x2000). Описание будет представлено позже.
 NoZeroResponseAccepted
 Значение: 32 (0x20). Маска определяет режим "Не принимать нулевые значения". По умолчанию нулевые значения принимаются. Работает только для методов JigPrompts.AcquireDistance() и JigPrompts.AcquireAngle().
 NullResponseAccepted
 Значение: 2 (0x2). Маска определяет режим "Допускается пустой ввод (null)" в пакете запроса пользовательского ввода. По умолчанию этот бит сброшен, и пустой ввод недопустим.
 UseBasePointElevation
 Значение: 32768 (0x8000). Маска определяет режим "Использовать возвышение базовой точки".
 Описание
 Перечисление UserInputControls определяет битовые маски всех настроек управления пользовательским вводом, которые действуют в данный момент для используемого варианта технологии Jig.
 Ваши комментарии по поводу этого топика: Послать отзыв!