Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Application.IsQuiescent
 Послать отзыв
 Свойство предназначено для получения признака работы команды, скрипта в nanoCAD в настоящее время.
 Синтаксис
C#
Visual Basic
public bool IsQuiescent;
Public Property IsQuiescent() As bool
 Возвращает
 Тип bool: *true - nanoCAD свободен, возможен вызов команды, скрипта *false - nanoCAD занят выполнением команды или скрипта
 Описание
 Свойство предоставляет информацию о том, выполняется ли в данный момент в nanoCAD команда или скрипт.
 Условия
 Только чтение.
 Ссылки
 HostMgd.ApplicationServices.Application, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!