Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод PublishEntityEventArgs.AddNodeToMap
 Послать отзыв
 This is AddNodeToMap, a member of class PublishEntityEventArgs.
 Синтаксис
C#
Visual Basic
public bool AddNodeToMap(ObjectId entityId, ref Teigha::DatabaseServices::ObjectIdCollection objIds, int nodeId);
Public Function AddNodeToMap(entityId As ObjectId, ByRef objIds As Teigha.DatabaseServices.ObjectIdCollection, nodeId As Integer) As bool
 Ссылки
 PublishEntityEventArgs Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!