Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.PlotConfig.GetLocalMediaName
 Послать отзыв
 Метод предоставляет локализованное имя листа, которое соответствует указанному каноническому имени листа. Не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public System.String GetLocalMediaName( ref System.String canonicalMediaName );
Копировать Код
Public Function GetLocalMediaName( ByRef canonicalMediaName As System.String ) As System.String
 Параметры
 Параметры
 Описание
 canonicalMediaName
 Входное каноническое имя листа. Тип System.String.
 Возвращает
 Возвращает локализованное имя листа. Тип System.String.
 Описание
 Метод предоставляет локализованное имя листа, которое соответствует указанному каноническому имени листа.
 В текущей версии не реализован.
 Ссылки
 HostMgd.PlottingServices.PlotConfig, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!