Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PlotProgress.IsVisible
 Послать отзыв
 Свойство возвращает и устанавливает видимость формы.
 Синтаксис
C#
Visual Basic
public bool IsVisible;
Public Property IsVisible() As bool
 Описание
 Ссылки
 PlotProgress Класс, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!