Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.DraggingEventArgs
 Послать отзыв
 Класс предоставляет дополнительные данные о событии, возникающем перед началом операции перетаскивания в nanoCAD.
 Иерархия классов
HostMgd::EditorInput::DraggingEventArgs
 Синтаксис
C#
Visual Basic
Копировать Код
public sealed class DraggingEventArgs : EventArgs
Копировать Код
Public NotInheritable Class DraggingEventArgs Inherits EventArgs
 Описание
 Класс является производным от EventArgs и используется для передачи контекстной информации при возникновении события, связанного с началом операции перетаскивания. Он содержит данные и методы, позволяющие получить информацию о текущем состоянии перетаскивания, взаимодействовать с реакторами и при необходимости изменить поведение операции до её начала. Данный класс применяется совместно с делегатом DraggingEventHandler.
 Замечания
 Этот класс используется в пользовательских обработчиках событий для обеспечения гибкости и контроля над процессом перетаскивания объектов в интерактивном режиме.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события Dragging [Teigha.Runtime.CommandMethod("DraggingExample")] public void DraggingExample() { // Подписка на событие редактора Dragging editor.Dragging += OnEditorDragging; } // Реализация отработки события Dragging private void OnEditorDragging(object sender, EventArgs e) { // Получаем доступ к параметрам перетаскивания if (e != null && e.Prompt.Length>0) { editor.WriteMessage( $"\nТекст запроса: {e.Prompt}"); } // Вывод сообщения в командную строку editor.WriteMessage("\nНачало операции перетаскивания."); } }
 Методы
 Конструкторы
 Имя
 Описание
 DraggingEventArgs
 Конструктор создаёт новый экземпляр класса DraggingEventArgs, используя приглашающее сообщение.
 Топики
 Имя
 Описание
 DraggingEventArgs Свойства
 Ниже перечислены свойства класса DraggingEventArgs.
 Ссылки
 DraggingEventArgs Свойства, Методы, Топики, DraggingEventArgs Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!