Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptForSelectionEndingEventArgs
 Послать отзыв
 Класс предоставляет данные для события PromptForSelectionEnding, возникающего после завершения операции выбора объектов в редакторе nanoCAD.
 Иерархия классов
HostMgd::EditorInput::PromptForSelectionEndingEventArgs
 Синтаксис
C#
Visual Basic
Копировать Код
public sealed class PromptForSelectionEndingEventArgs : EventArgs, IDisposable
Копировать Код
Public NotInheritable Class PromptForSelectionEndingEventArgs Inherits EventArgs Implements IDisposable
 Описание
 Класс наследуется от EventArgs и реализует интерфейс IDisposable. Он используется при обработке событий, связанных с интерактивным выбором множества объектов, и предоставляет информацию о результате выборки — такую как набор выделенных объектов (SelectionSet), статус операции и дополнительные параметры. Объект этого класса создаётся системой при возникновении события PromptForSelectionEnding, и позволяет реагировать на изменения перед фиксацией выбора пользователем.
 Замечания
 Так как класс реализует интерфейс IDisposable, рекомендуется освобождать используемые ресурсы после обработки события.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события PromptForSelectionEnding [Teigha.Runtime.CommandMethod("PromptForSelectionEndingExample")] public void PromptForSelectionEndingExample() { // Подписка на событие PromptForSelectionEnding editor.PromptForSelectionEnding += OnEditorPromptForSelectionEnding; } // Реализация отработки события PromptForSelectionEnding private void OnEditorPromptForSelectionEnding(object sender, PromptForSelectionEndingEventArgs e) { if (e.Selection.Count > 0) { // Вывод сообщения в командную строку editor.WriteMessage( $"\nВыбрано объектов: {e.Selection.Count}"); } } }
 Топики
 Имя
 Описание
 PromptForSelectionEndingEventArgs Методы
 Ниже перечислены методы класса PromptForSelectionEndingEventArgs.
 PromptForSelectionEndingEventArgs Свойства
 Ниже перечислены свойства класса PromptForSelectionEndingEventArgs.
 Ссылки
 PromptForSelectionEndingEventArgs Методы, PromptForSelectionEndingEventArgs Свойства, Топики, PromptForSelectionEndingEventArgs Методы, PromptForSelectionEndingEventArgs Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!