Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор PublishEntityEventArgs.PublishEntityEventArgs
 Послать отзыв
 This is PublishEntityEventArgs, a member of class PublishEntityEventArgs.
 Синтаксис
C#
Visual Basic
public PublishEntityEventArgs();
Public Sub New()
 Ссылки
 PublishEntityEventArgs Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!