Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.InplaceTextEditor.TextUndoType
 Послать отзыв
 Данное перечисление определяет все типы отмены текстовых операций, реализованные во встроенном текстовом редакторе.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum TextUndoType { UndoTyping = 1, UndoBoldOn = 2, UndoBoldOff = 3, UndoItalicOn = 4, UndoItalicOff = 5, UndoUnderlineOn = 6, UndoUnderlineOff = 7, UndoOverlineOn = 8, UndoOverlineOff = 9, UndoFont = 10, UndoHeight = 11, UndoColor = 12, UndoObliqueAngle = 13, UndoWidthScale = 14, UndoTrackingFactor = 15, UndoLanguage = 16, UndoBackspace = 17, UndoDelete = 18, UndoPaste = 19, UndoCut = 20, UndoStack = 21, UndoUnstack = 22, UndoStackProperties = 23, UndoFieldInsert = 24, UndoFieldConvert = 25, UndoFieldUpdate = 26, UndoSymbolInsert = 27, UndoAutoField = 28, UndoAutoStack = 29, UndoAutoSymbol = 30, UndoAutoDTextEscape = 31, UndoAutoMifOrCif = 32, UndoAutoDimension = 33, UndoAutoDimBreak = 34, UndoAutoSpell = 35, UndoStyle = 36, UndoAttachment = 37, UndoChangeCase = 38, UndoImportText = 39, UndoCombineParagraphs = 40, UndoRemoveCharFormatting = 41, UndoRemoveParaFormatting = 42, UndoRemoveAllFormatting = 43, UndoReplaceAll = 44, UndoReplace = 45, UndoParagraphAttributes = 46, UndoSetDefinedWidth = 47, UndoSetDefinedHeight = 48, UndoCharAttributes = 49, UndoWipeout = 50, UndoDimensionInsert = 51, UndoDimBreakInsert = 52, UndoCustomConvert = 53, UndoDeleteAndMoveSelection = 54, UndoParagraphNumbering = 55, UndoCursorAttributes = 56, UndoColumns = 57, UndoAnnoState = 58, UndoDimensionTweak = 59, UndoDimensionSymbol = 60, UndoDimensionTemplate = 61 }
Копировать Код
Public Enum TextUndoType UndoTyping = 1 UndoBoldOn = 2 UndoBoldOff = 3 UndoItalicOn = 4 UndoItalicOff = 5 UndoUnderlineOn = 6 UndoUnderlineOff = 7 UndoOverlineOn = 8 UndoOverlineOff = 9 UndoFont = 10 UndoHeight = 11 UndoColor = 12 UndoObliqueAngle = 13 UndoWidthScale = 14 UndoTrackingFactor = 15 UndoLanguage = 16 UndoBackspace = 17 UndoDelete = 18 UndoPaste = 19 UndoCut = 20 UndoStack = 21 UndoUnstack = 22 UndoStackProperties = 23 UndoFieldInsert = 24 UndoFieldConvert = 25 UndoFieldUpdate = 26 UndoSymbolInsert = 27 UndoAutoField = 28 UndoAutoStack = 29 UndoAutoSymbol = 30 UndoAutoDTextEscape = 31 UndoAutoMifOrCif = 32 UndoAutoDimension = 33 UndoAutoDimBreak = 34 UndoAutoSpell = 35 UndoStyle = 36 UndoAttachment = 37 UndoChangeCase = 38 UndoImportText = 39 UndoCombineParagraphs = 40 UndoRemoveCharFormatting = 41 UndoRemoveParaFormatting = 42 UndoRemoveAllFormatting = 43 UndoReplaceAll = 44 UndoReplace = 45 UndoParagraphAttributes = 46 UndoSetDefinedWidth = 47 UndoSetDefinedHeight = 48 UndoCharAttributes = 49 UndoWipeout = 50 UndoDimensionInsert = 51 UndoDimBreakInsert = 52 UndoCustomConvert = 53 UndoDeleteAndMoveSelection = 54 UndoParagraphNumbering = 55 UndoCursorAttributes = 56 UndoColumns = 57 UndoAnnoState = 58 UndoDimensionTweak = 59 UndoDimensionSymbol = 60 UndoDimensionTemplate = 61 End Enum
 Члены
 Члены
 Описание
 UndoAnnoState
 Значение: 58. Отмена режима масштабирования аннотаций.
 UndoAttachment
 Значение: 37. Отмена операции присоединения (Attachment).
 UndoAutoDimBreak
 Значение: 34. Зарезервировано для внутреннего использования.
 UndoAutoDimension
 Значение: 33. Зарезервировано для внутреннего использования.
 UndoAutoDTextEscape
 Значение: 31. Зарезервировано для внутреннего использования.
 UndoAutoField
 Значение: 28. Зарезервировано для внутреннего использования.
 UndoAutoMifOrCif
 Значение: 32. Зарезервировано для внутреннего использования.
 UndoAutoSpell
 Значение: 35. Отмена режима автоматической проверки орфографии.
 UndoAutoStack
 Значение: 29. Зарезервировано для внутреннего использования.
 UndoAutoSymbol
 Значение: 30. Зарезервировано для внутреннего использования.
 UndoBackspace
 Значение: 17. Отмена ввода символа возврата каретки (Backspace).
 UndoBoldOff
 Значение: 3. Отмена выключения полужирного шрифта.
 UndoBoldOn
 Значение: 2. Отмена включения полужирного шрифта.
 UndoChangeCase
 Значение: 38. Отмена изменения регистра текста.
 UndoCharAttributes
 Значение: 49. Отмена изменения атрибутов символа.
 UndoColor
 Значение: 12. Отмена изменения цвета.
 UndoColumns
 Значение: 57. Отмена операции создания столбцов.
 UndoCombineParagraphs
 Значение: 40. Отмена объединения абзацев.
 UndoCursorAttributes
 Значение: 56. Отмена изменения атрибутов курсора.
 UndoCustomConvert
 Значение: 53. Зарезервировано для внутреннего использования.
 UndoCut
 Значение: 20. Отмена вырезания (Cut).
 UndoDelete
 Значение: 18. Отмена операции удаления.
 UndoDeleteAndMoveSelection
 Значение: 54. Отмена удаления и перемещения выделенного фрагмента.
 UndoDimBreakInsert
 Значение: 52. Зарезервировано для внутреннего использования.
 UndoDimensionInsert
 Значение: 51. Зарезервировано для внутреннего использования.
 UndoDimensionSymbol
 Значение: 60. Зарезервировано для внутреннего использования.
 UndoDimensionTemplate
 Значение: 61. Зарезервировано для внутреннего использования.
 UndoDimensionTweak
 Значение: 59. Зарезервировано для внутреннего использования.
 UndoFieldConvert
 Значение: 25. Отмена операции преобразования поля.
 UndoFieldInsert
 Значение: 24. Отмена операции вставки поля.
 UndoFieldUpdate
 Значение: 26. Отмена операции обновления поля.
 UndoFont
 Значение: 10. Отмена изменения типа шрифта (гарнитуры).
 UndoHeight
 Значение: 11. Отмена изменения высоты.
 UndoImportText
 Значение: 39. Отмена операции импорта текста.
 UndoItalicOff
 Значение: 5. Отмена выключения курсива.
 UndoItalicOn
 Значение: 4. Отмена включения курсива.
 UndoLanguage
 Значение: 16. Отмена изменения языка.
 UndoObliqueAngle
 Значение: 13. Отмена изменения угла наклона.
 UndoOverlineOff
 Значение: 9. Отмена выключения режима надчёркивания.
 UndoOverlineOn
 Значение: 8. Отмена включения режима надчёркивания.
 UndoParagraphAttributes
 Значение: 46. Отмена изменения атрибутов абзаца.
 UndoParagraphNumbering
 Значение: 55. Отмена режима нумерации абзацев.
 UndoPaste
 Значение: 19. Отмена вставки из буфера обмена (Paste).
 UndoRemoveAllFormatting
 Значение: 43. Отмена удаления всех видов форматирования.
 UndoRemoveCharFormatting
 Значение: 41. Отмена удаления форматирования символов.
 UndoRemoveParaFormatting
 Значение: 42. Отмена удаления форматирования абзацев.
 UndoReplace
 Значение: 45. Отмена операции замены вхождения текста.
 UndoReplaceAll
 Значение: 44. Отмена операции замены всех вхождений текста.
 UndoSetDefinedHeight
 Значение: 48. Отмена изменения предопределённой высоты.
 UndoSetDefinedWidth
 Значение: 47. Отмена изменения предопределённой ширины.
 UndoStack
 Значение: 21. Отмена создания дробного текста (Stack).
 UndoStackProperties
 Значение: 23. Отмена изменения свойств дробного текста.
 UndoStyle
 Значение: 36. Отмена изменения стиля текста.
 UndoSymbolInsert
 Значение: 27. Отмена вставки символа.
 UndoTrackingFactor
 Значение: 15. Отмена изменения коэффициента трекинга (регулирует расстояние между всеми символами в тексте).
 UndoTyping
 Значение: 1. Отмена ввода текста в текстовом редакторе.
 UndoUnderlineOff
 Значение: 7. Отмена выключения режима подчёркивания.
 UndoUnderlineOn
 Значение: 6. Отмена включения режима подчёркивания.
 UndoUnstack
 Значение: 22. Отмена преобразования дробного текста в обычный.
 UndoWidthScale
 Значение: 14. Отмена изменения масштаба по ширине.
 UndoWipeout
 Значение: 50. Отмена операции маскирования.
 Описание
 Перечисление TextUndoType определяет все типы отмены текстовых операций, используемые встроенным текстовым редактором.
 Ваши комментарии по поводу этого топика: Послать отзыв!