Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 JigPromptDistanceOptions.JigPromptDistanceOptions(String)
 Послать отзыв
 Конструктор класса с одним параметром.
 Синтаксис
C#
Visual Basic
public JigPromptDistanceOptions(ref System.String message);
Public Sub New(ByRef message As System.String)
 Параметры
 Параметры
 Описание
 message
 Текстовое сообщение, приглашающее указать расстояние для дальнейших действий с объектом или группой объектов.
 Описание
 Конструктор класса. Присваивает свойству Message значение параметра message Также конструктор устанавливает значение свойства Cursor равное CursorType.Crosshair (перекрестие).
 Пример
C#
 Копировать Код
 JigPromptDistanceOptions distanceOptions = new JigPromptDistanceOptions("Расстояние:");
Visual Basic
 Копировать Код
 Dim distanceOptions As JigPromptDistanceOptions = New JigPromptDistanceOptions("Расстояние:")
 Ссылки
 JigPromptDistanceOptions Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!