Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Jig.Sampler
 Послать отзыв
 Метод вызывается на каждое перемещение мыши и получает параметры положения курсора мыши на экране или данные, введенные с клавиатуры.
 Синтаксис
C#
Visual Basic
public SamplerStatus Sampler(ref JigPrompts prompts);
Public Function Sampler(ByRef prompts As JigPrompts) As SamplerStatus
 Параметры
 Параметры
 Описание
 prompts
 Параметры положения курсора мыши, либо данные, введенные с клавиатуры
 Возвращает
 Метод возвращает тип данных SamplerStatus, как результат получения параметров положения курсора мыши или ввода с клавиатуры.
 Описание
 Переопределяемый метод. Вызывается на каждое перемещение мыши и получает параметры положения курсора мыши на экране или данные, введенные с клавиатуры.
 Ссылки
 Jig Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!