Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Перечисление HostMgd.Windows.ToolPalette.ContextMenuMode
 Послать отзыв
 This is record HostMgd::Windows::ToolPalette::ContextMenuMode.
 Синтаксис
C#
Visual Basic
public enum ContextMenuMode : int { ContextMenuEditorImage = 1, ContextMenuPaletteBackground = 2, ContextMenuPaletteSetCaption = 4, ContextMenuPaletteSetOptionButton = 5, ContextMenuPaletteSetTab = 3, ContextMenuPaletteTool = 0, ContextNone = -(int)1 }
Public Enum ContextMenuMode Inherits int ContextMenuEditorImage = 1 ContextMenuPaletteBackground = 2 ContextMenuPaletteSetCaption = 4 ContextMenuPaletteSetOptionButton = 5 ContextMenuPaletteSetTab = 3 ContextMenuPaletteTool = 0 ContextNone = -(int)1 End Enum
 Ваши комментарии по поводу этого топика: Послать отзыв!