Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Перечисление HostMgd.Runtime.LispDataType
 Послать отзыв
 Значения типов
 Синтаксис
C#
Visual Basic
[Flags] [Teigha.Runtime.Wrapper("OdResBuf.ValueType")] public enum LispDataType { Angle = OdResBuf.kRtAngle, DottedPair = OdResBuf.kRtDote, Double = OdResBuf.kRtDouble, Int16 = OdResBuf.kRtInt16, Int32 = OdResBuf.kRtInt32, ListBegin = OdResBuf.kRtListBeg, ListEnd = OdResBuf.kRtListEnd, Nil = OdResBuf.kRtNil, None = OdResBuf.kRtNone, ObjectId = OdResBuf.kRtEntName, Orientation = OdResBuf.kRtOrient, Point2d = OdResBuf.kRtPoint2d, Point3d = OdResBuf.kRtPoint3d, SelectionSet = OdResBuf.kRtPickSet, T_atom = OdResBuf.kRtT, Text = OdResBuf.kRtString, Void = OdResBuf.kRtVoid }
<Flags> <Teigha.Runtime.Wrapper("OdResBuf.ValueType")> Public Enum LispDataType Angle = OdResBuf.kRtAngle DottedPair = OdResBuf.kRtDote Double = OdResBuf.kRtDouble Int16 = OdResBuf.kRtInt16 Int32 = OdResBuf.kRtInt32 ListBegin = OdResBuf.kRtListBeg ListEnd = OdResBuf.kRtListEnd Nil = OdResBuf.kRtNil None = OdResBuf.kRtNone ObjectId = OdResBuf.kRtEntName Orientation = OdResBuf.kRtOrient Point2d = OdResBuf.kRtPoint2d Point3d = OdResBuf.kRtPoint3d SelectionSet = OdResBuf.kRtPickSet T_atom = OdResBuf.kRtT Text = OdResBuf.kRtString Void = OdResBuf.kRtVoid End Enum
 Ваши комментарии по поводу этого топика: Послать отзыв!