Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.Document.IsNamedDrawing
 Послать отзыв
 Свойство позволяет проверить, был ли сохранен чертеж на диске.
 Синтаксис
C#
Visual Basic
public bool IsNamedDrawing;
Public Property IsNamedDrawing() As bool
 Возвращает
 Возвращает тип bool. Возвращает значение true, если чертежом для этого документа является именованный файл на диске (в отличие от нового чертежа, который еще не был сохранен).
 Описание
 Свойство позволяет проверить, был ли сохранен чертеж на диске.
 Условия
 Только чтение
 Ссылки
 HostMgd.ApplicationServices.Document, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!