Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptStringOptions.AllowSpaces
 Послать отзыв
 Свойство определяет, разрешены ли пробелы во вводимой пользователем строке.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool AllowSpaces { get; set; }
Копировать Код
Public Property AllowSpaces As Boolean
 Возвращает
 Возвращает значение типа bool:
true — пробелы разрешены во вводимой строке.
false — пробелы не разрешены, ввод строки завершается при первом пробеле.
 Описание
 Свойство указывает, может ли введённая пользователем строка содержать пробелы. По умолчанию ввод строк в командной строке nanoCAD завершается при нажатии пробела или Enter, что делает пробел разделителем. Если AllowSpaces установлено в true, пробелы в строке разрешаются, и ввод продолжается до нажатия Enter, что позволяет вводить многословные имена — например, "Главный чертёж", "Описание проекта", "Секция A — Пояснения".
 Если AllowSpaces = false (по умолчанию), пробел завершает ввод, и строка обрезается до первого пробела.
 Условия
 Чтение и запись
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("PromptStringOptionsExample_AllowSpaces")] public void PromptStringOptionsExample_AllowSpaces() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Определяем настройки запроса пользователю PromptStringOptions options = new PromptStringOptions("Введите имя"); options.DefaultValue = "Untitled"; // Разрешить ввод с пробелами options.AllowSpaces = true; // Создаём запрос пользователю PromptResult pr = editor.GetString(options); // Если все данные введены, выводим результат в командную строку if (pr.Status == PromptStatus.OK) { editor.WriteMessage( $"\nВы ввели: {pr.StringResult}"); } else { editor.WriteMessage( "\nВвод отменён."); } } }
 Ссылки
 HostMgd.EditorInput.PromptStringOptions, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!