Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptSelectionOptions.PromptNestedEntityOptions()
 Послать отзыв
 Конструктор инициализирует новый экземпляр класса с параметрами выбора объектов по умолчанию.
 Синтаксис
C#
Visual Basic
Копировать Код
public PromptSelectionOptions();
Копировать Код
Public Sub New()
 Описание
 Конструктор создаёт новый объект класса PromptSelectionOptions, используемый для настройки операции выбора объектов в nanoCAD. Он инициализирует все свойства значениями по умолчанию. После создания экземпляра разработчик может настроить параметры ввода в соответствии с требованиями команды — например, задать сообщение, добавить ключевые слова.
 Этот конструктор используется при программной инициализации выборки, когда нет необходимости в предварительно заданном сообщении или сложной конфигурации.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("PromptSelectionOptionsExample")] public void PromptSelectionOptionsExample() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создаём набор параметров для запроса PromptSelectionOptions options = new PromptSelectionOptions(); options.MessageForAdding = "Выберите линии для объединения:"; // Фильтр: только объекты типа Line TypedValue[] filterList = new TypedValue[] { new TypedValue((int)DxfCode.Start, "LINE") }; SelectionFilter filter = new SelectionFilter(filterList); // Создаём запрос пользователю PromptSelectionResult result = editor.GetSelection(options, filter); // Если все данные введены, выводим результат в командную строку if (result.Status == PromptStatus.OK) { SelectionSet selSet = result.Value; editor.WriteMessage( $"\nВыбрано объектов: {selSet.Count}"); } else { editor.WriteMessage( "\nНе удалось получить выделение."); } } }
 Ссылки
 HostMgd.EditorInput.PromptSelectionOptions, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!