Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод PublishSheetEventArgs.AddPagePropertyRange
 Послать отзыв
 This is AddPagePropertyRange, a member of class PublishSheetEventArgs.
 Синтаксис
C#
Visual Basic
public void AddPagePropertyRange(ref array<HostMgd::Publishing::EPlotProperty^> properties);
Public Sub AddPagePropertyRange(ByRef properties As array<HostMgd.Publishing.EPlotProperty^>)
 Ссылки
 PublishSheetEventArgs Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!