Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PromptFileOptions.PreferCommandLine
 Послать отзыв
 Синтаксис
C#
Visual Basic
public bool PreferCommandLine;
Public Property PreferCommandLine() As bool
 Описание
 Возвращает или устанавливает признак того, будет ли приоритетом ввод имени из командной строки.
 Условия
 На чтение и запись
 Ссылки
 PromptFileOptions Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!