Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PlotLogger.ErrorHasHappenedInJob
 Послать отзыв
 Только для чтения
 Синтаксис
C#
Visual Basic
public bool ErrorHasHappenedInJob;
Public Property ErrorHasHappenedInJob() As bool
 Ссылки
 PlotLogger Класс, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!