Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptEntityOptions.AddAllowedClass(System.Type,bool)
 Послать отзыв
 Метод добавляет тип объекта в список разрешённых для выбора, с возможностью указать, должен ли выбор быть точным или включать производные типы.
 Синтаксис
C#
Visual Basic
Копировать Код
public void AddAllowedClass(Type type, bool exactMatch);
Копировать Код
Public Sub AddAllowedClass(type As Type, exactMatch As Boolean)
 Параметры
 Параметры
 Описание
 type
 Тип объекта, который должен быть добавлен в список разрешённых для выбора.
 exactMatch
 Флаг, определяющий режим проверки типа:
 Пример
 typeof(Line), typeof(Circle), typeof(BlockReference). Тип System.Type
 Описание
 Метод используется для фильтрации объектов, которые пользователь может выбирать с помощью команды GetEntity(). Он позволяет ограничить выбор только объектами определённого типа (или наследниками этого типа), что полезно при реализации специализированных команд, требующих строгой типовой проверки.
 Поведение метода зависит от параметра exactMatch:
Если exactMatch = true, то для выбора разрешаются
 только объекты точно указанного типа .
Если exactMatch = false, то разрешаются объекты
 указанного типа и все объекты, производные от него. Это позволяет, например, разрешить выбор только Line (отрезков) или всех объектов, унаследованных от Curve (включая окружности, эллипсы и др.).
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("PromptEntityOptions_AddAllowedClass")] public void PromptEntityOptions_AddAllowedClass() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создаём запрос пользователю PromptEntityOptions options = new PromptEntityOptions("\nВыберите объект:"); // Разрешить выбор только объектов типа Line (не полилинии и др.) options.AddAllowedClass(typeof(Line), true); // Или разрешить выбор всех кривых (Line, Circle, Polyline и т.д.) // options.AddAllowedClass(typeof(Curve), false); PromptEntityResult result = editor.GetEntity(options); // Если все данные введены, выводим результат в командную строку if (result.Status == PromptStatus.OK) { editor.WriteMessage( $"\nВыбран объект с ID: {result.ObjectId}, точка: {result.PickedPoint}"); } else { editor.WriteMessage( "\nОперация выбора отменена или объект не найден."); } } }
 Ссылки
 HostMgd.EditorInput.PromptEntityOptions, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!