Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Класс HostMgd.Runtime.Converter
 Послать отзыв
 Иерархия классов
HostMgd::Runtime::Converter
 Синтаксис
C#
Visual Basic
public class Converter;
Public Class Converter
 Описание
 Этот .NET класс содержит утилиты преобразования числовых значений углов и расстояний в строковые, и наоборот.
 Топики
 Имя
 Описание
 Converter Методы
 Ниже перечислены методы класса Converter.
 Ссылки
 Converter Методы, Топики, Converter Методы
 Ваши комментарии по поводу этого топика: Послать отзыв!