Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.PlotPageInfo
 Послать отзыв
 Класс PlotPageInfo предоставляет информацию об объектах, содержащихся на печатаемой странице.
 Иерархия классов
HostMgd::PlottingServices::PlotPageInfo
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("AcPlPlotPageInfo")] public sealed class PlotPageInfo
Копировать Код
<Wrapper("AcPlPlotPageInfo")> Public NotInheritable Class PlotPageInfo
 Описание
 Класс PlotPageInfo предоставляет статистическую информацию об объектах, содержащихся на печатаемой странице. Приложения могут использовать эту информацию, чтобы при необходимости предупредить пользователя о том, что печать страницы потребует некоторого времени.
 Замечания
 Объект этого типа возвращает метод HostMgd.PlottingServices.PlotEngine.BeginPage().
 Методы
 Конструкторы
 Имя
 Описание
 PlotPageInfo
 Это обзор перегрузок PlotPageInfo.
 Топики
 Имя
 Описание
 PlotPageInfo Свойства
 Ниже перечислены свойства класса PlotPageInfo.
 Ссылки
 PlotPageInfo Конструктор, PlotPageInfo Свойства, Методы, Топики, PlotPageInfo Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!