Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Класс HostMgd.PlottingServices.PlotConfigInfo
 Послать отзыв
 Облегчённый класс, содержащий основную информацию об устройстве вывода.
 Иерархия классов
HostMgd::PlottingServices::PlotConfigInfo
 Синтаксис
C#
Visual Basic
[Wrapper("AcPlPlotConfigInfo")] public class PlotConfigInfo;
<Wrapper("AcPlPlotConfigInfo")> Public Class PlotConfigInfo
 Описание
 Методы
 Конструкторы
 Имя
 Описание
 PlotConfigInfo
 This is PlotConfigInfo, a member of class PlotConfigInfo.
 Топики
 Имя
 Описание
 PlotConfigInfo Методы
 Ниже перечислены методы класса PlotConfigInfo.
 PlotConfigInfo Свойства
 Ниже перечислены свойства класса PlotConfigInfo.
 Ссылки
 PlotConfigInfo Методы, PlotConfigInfo Свойства, Методы, Топики, PlotConfigInfo Методы, PlotConfigInfo Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!