Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.GraphicsSystem.Manager
 Послать отзыв
 Класс Manager представляет менеджер графической системы dwg-документа nanoCAD.
 Иерархия классов
HostMgd::GraphicsSystem::Manager
 Синтаксис
C#
Visual Basic
Копировать Код
public class Manager
Копировать Код
Public Class Manager
 Описание
 Класс Manager скрывает низкоуровневые подробности подключения приложений nanoCAD к графической системе (GS) платформы nanoCAD. Объекты класса взаимно однозначно сопоставлены клиентским окнам MDI и открытым документам nanoCAD. Доступ к объектам Manager предоставляет свойство HostMgd.ApplicationServices.Document.GraphicsManager dwg-документа.
 Топики
 Имя
 Описание
 Manager Методы
 Ниже перечислены методы класса Manager.
 Manager Свойства
 Ниже перечислены свойства класса Manager.
 Manager События
 Ниже перечислены события класса Manager.
 Ссылки
 Manager Методы, Manager Свойства, Manager События, Топики, Manager Методы, Manager Свойства, Manager События
 Ваши комментарии по поводу этого топика: Послать отзыв!