Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.Document.UserData
 Послать отзыв
 Свойство предоставляет доступ к пользовательским данным.
 Синтаксис
C#
Visual Basic
public System.Collections.Hashtable UserData;
Public Property UserData() As System.Collections.Hashtable
 Возвращает
 Возвращает объект, предоставляющий доступ к пользовательским данным — коллекцию пар ключ/значение. Тип System.Collections.Hashtable
 Описание
 Свойство предоставляет доступ к пользовательским данным.
 Условия
 Только чтение
 Ссылки
 HostMgd.ApplicationServices.Document, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!