Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство SelectionSet.SyncRoot
 Послать отзыв
 Синтаксис
C#
Visual Basic
public Object SyncRoot;
Public Property SyncRoot() As Object
 Описание
 Возвращает корневой синхронизированный объект.
 Условия
 Только на чтение
 Ссылки
 SelectionSet Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!