Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство XrefFileLock.OutOfSyncBlockIds
 Послать отзыв
 Синтаксис
C#
Visual Basic
public Teigha::DatabaseServices::ObjectIdCollection OutOfSyncBlockIds;
Public Property OutOfSyncBlockIds() As Teigha.DatabaseServices.ObjectIdCollection
 Описание
 Возвращает коллекцию ID рассинхронизированных записей таблицы блоков. Одно из возможных применений этой коллекции заключается в выделении тех элементов, к которым должны быть применены сделанные изменения.
 Условия
 Только на чтение
 Ссылки
 XrefFileLock Класс, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!