Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PaneCollection.IsSynchronized
 Послать отзыв
 This is IsSynchronized, a member of class PaneCollection.
 Синтаксис
C#
Visual Basic
public bool IsSynchronized;
Public Property IsSynchronized() As bool
 Ссылки
 PaneCollection Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!