Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.SelectCrossingPolygon(Point3dCollection,SelectionFilter)
 Послать отзыв
 Метод возвращает набор объектов, пересекающих или находящихся внутри заданного многоугольника и соответствующих указанному фильтру.
 Синтаксис
C#
Visual Basic
Копировать Код
public PromptSelectionResult SelectCrossingPolygon(Point3dCollection polygon, SelectionFilter filter);
Копировать Код
Public Function SelectCrossingPolygon(polygon As Point3dCollection, filter As SelectionFilter) As PromptSelectionResult
 Параметры
 Параметры
 Описание
 polygon
 Коллекция трёхмерных точек (Point3d), представляющих вершины многоугольника в мировой системе координат (WCS). Многоугольник должен быть замкнутым — если это не выполнено, система автоматически соединит первую и последнюю точки. Тип Point3dCollection.
 filter
 Фильтр, определяющий, какие объекты будут включены в выборку. Строится на основе массива TypedValue, где указываются условия по типу объекта, слою, цвету и другим свойствам. Тип SelectionFilter.
 Возвращает
 Возвращает объект типа PromptSelectionResult, содержащий результат выборки:
Status — статус выполнения (OK, Cancel, Error и др.). При успешной выборке статус равен PromptStatus.OK.
Value — объект типа SelectionSet, содержащий список идентификаторов (ObjectId) выбранных объектов, удовлетворяющих условиям многоугольника и фильтра.
StringResult — строковое значение.
 Если ни один объект не удовлетворяет условиям, Value может быть null, а статус — отличным от OK.
 Описание
 Метод используется для выбора геометрических объектов чертежа, которые находятся внутри или пересекают замкнутый многоугольник, с дополнительной фильтрацией по типу объекта, слою, цвету и другим параметрам. Многоугольник задается коллекцией точек в мировых координатах (WCS). Метод позволяет точно выделять объекты на чертеже с учётом как пространственного положения, так и внутренних свойств, что делает его удобным для массовых операций с определёнными категориями объектов.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("SelectCrossingPolygonExample_Point3dCollection_SelectionFilter")] public void SelectCrossingPolygonExample_Point3dCollection_SelectionFilter() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создание многоугольника, внутри которого необходимо выбрать объекты Point3dCollection polygon = new Point3dCollection(); polygon.Add(new Point3d(0, 0, 0)); polygon.Add(new Point3d(100, 0, 0)); polygon.Add(new Point3d(100, 100, 0)); polygon.Add(new Point3d(0, 100, 0)); // Задание фильтра: только объекты типа Line SelectionFilter filter = new SelectionFilter(new TypedValue[] { new TypedValue((int)DxfCode.Start, "LINE") }); // Вызываем метод PromptSelectionResult result = editor.SelectCrossingPolygon(polygon, filter); // Выводим сообщение в командную строку if (result.Status == PromptStatus.OK) { SelectionSet selSet = result.Value; editor.WriteMessage( $"\nВыбрано линий: {selSet.Count}"); } else { editor.WriteMessage( "\nНе найдено объектов, удовлетворяющих условиям."); } } }
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!