Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.Application.ShowModalDialog(System.Windows.Forms.Form)
 Послать отзыв
 Метод предназначен для вызова модального диалогового окна, построенного с помощью WinForms.
 Синтаксис
C#
Visual Basic
Копировать Код
public static System.Windows.Forms.DialogResult ShowModalDialog(System.Windows.Forms.Form formToShow);
Копировать Код
Public Shared Function ShowModalDialog(formToShow As System.Windows.Forms.Form) As System.Windows.Forms.DialogResult
 Параметры
 Параметры
 Описание
 formToShow
 Форма, которая должна быть показана
 Возвращает
 Возвращает результат работы окна, тип System.Windows.Forms.DialogResult
 Описание
 Метод показывает модальный диалог WinForms. Необходимо пользоваться именно этим методом вместо метода Form.ShowDialog(), который может привести к непредсказуемому результату. При исползовании метода, достигается согласованность с редактором приложения: при запросе данных с чертежа (напрмер, точки или объекта) через диалоговое окно, оно пропадает, потом снова появляется, когда данные получены.
 Ссылки
 HostMgd.ApplicationServices.Application, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!