Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.Application.IsInPlaceServer
 Послать отзыв
 СВОЙСТВО НЕ РЕАЛИЗОВАНО. ВСЕГДА ВОЗВРАЩАЕТ FALSE.
 Синтаксис
C#
Visual Basic
public bool IsInPlaceServer;
Public Property IsInPlaceServer() As bool
 Ссылки
 HostMgd.ApplicationServices.Application, HostMgd.ApplicationServices Пространство имен
 Исключения
 MGD NOT_IMPLEMENTED
 Ваши комментарии по поводу этого топика: Послать отзыв!