Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.Document.GraphicsManager
 Послать отзыв
 Метод предоставляет доступ к графическому менеджеру dwg-документа.
 Синтаксис
C#
Visual Basic
Копировать Код
public HostMgd.GraphicsSystem.Manager GraphicsManager;
Public Property GraphicsManager() As HostMgd.GraphicsSystem.Manager
 Возвращает
 Возвращает графический менеждер документа. Тип Manager
 Описание
 Метод предоставляет доступ к графическому менеджеру dwg-документа.
 Условия
 Только чтение
 Ссылки
 HostMgd.ApplicationServices.Document, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!