Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PaletteSetMoveEventArgs.X
 Послать отзыв
 This is X, a member of class PaletteSetMoveEventArgs.
 Синтаксис
C#
Visual Basic
public int X;
Public Property X() As Integer
 Ссылки
 PaletteSetMoveEventArgs Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!