Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство LayerTransparencyDialog.Percent
 Послать отзыв
 This is Percent, a member of class LayerTransparencyDialog.
 Синтаксис
C#
Visual Basic
public UInt32 Percent;
Public Property Percent() As UInt32
 Ссылки
 LayerTransparencyDialog Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!