Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PerPropertyBrowsingEntryAttribute.EllipsisBmpResource
 Послать отзыв
 This is EllipsisBmpResource, a member of class PerPropertyBrowsingEntryAttribute.
 Синтаксис
C#
Visual Basic
public System.String EllipsisBmpResource;
Public Property EllipsisBmpResource() As System.String
 Ссылки
 PerPropertyBrowsingEntryAttribute Класс, HostMgd.Windows.ToolPalette
 Ваши комментарии по поводу этого топика: Послать отзыв!