Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PlotProgressDialog.IsSingleSheetPlot
 Послать отзыв
 Признак печати одной страницы
 Синтаксис
C#
Visual Basic
public bool IsSingleSheetPlot;
Public Property IsSingleSheetPlot() As bool
 Ссылки
 PlotProgressDialog Класс, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!