Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод KeywordCollection.Clear
 Послать отзыв
 Синтаксис
C#
Visual Basic
public void Clear();
Public Sub Clear()
 Описание
 Метод удаляет все элементы коллекции класса.
 Ссылки
 KeywordCollection Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!