Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Класс HostMgd.ApplicationServices.SystemVariableChangingEventArgs
 Послать отзыв
 Иерархия классов
HostMgd::ApplicationServices::SystemVariableChangingEventArgs
 Синтаксис
C#
Visual Basic
public class SystemVariableChangingEventArgs : System.EventArgs;
Public Class SystemVariableChangingEventArgs Inherits System.EventArgs
 Описание
 Содержит параметры, относящиеся к событиям, связанными с системными переменными.
 Топики
 Имя
 Описание
 SystemVariableChangingEventArgs Свойства
 Ниже перечислены свойства класса SystemVariableChangingEventArgs.
 Ссылки
 SystemVariableChangingEventArgs Свойства, Топики, SystemVariableChangingEventArgs Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!