Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.InplaceTextEditor.RulerHidden
 Послать отзыв
 Свойство RulerHidden позволяет определить, скрыта ли линейка. В текущей версии не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool RulerHidden;
Копировать Код
Public Property RulerHidden As Boolean
 Возвращает
 Возвращает true, если линейка не отображается. В противном случае возвращает false.
 Описание
 Свойство RulerHidden позволяет определить, скрыта ли линейка. В текущей версии не реализовано.
 Условия
 Чтение и запись.
 Ссылки
 HostMgd.ApplicationServices.InplaceTextEditor, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!