Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.PlotInfoValidator.MediaMatchingPolicy
 Послать отзыв
 Свойство MediaMatchingPolicy представляет политику сопоставления носителей в текущих настройках печати.
 Синтаксис
C#
Visual Basic
Копировать Код
public HostMgd.PlottingServices.MatchingPolicy MediaMatchingPolicy;
Копировать Код
Public Property MediaMatchingPolicy As HostMgd.PlottingServices.MatchingPolicy
 Возвращает
 Возвращает текущую политику сопоставления носителей. Перечисление HostMgd.PlottingServices.MatchingPolicy.
 Описание
 Свойство MediaMatchingPolicy представляет политику сопоставления носителей в текущей конфигурации печати, связанной с объектом PlotInfo. Доступные варианты приведены в перечислении MatchingPolicy.
 Условия
 Чтение и запись.
 Ссылки
 HostMgd.PlottingServices.PlotInfoValidator, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!