Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptDoubleOptions.GetDefaultValueString()
 Послать отзыв
 Метод возвращает строковое представление значения по умолчанию, заданного для ввода вещественного числа.
 Синтаксис
C#
Visual Basic
Копировать Код
public System.String GetDefaultValueString();
Копировать Код
Public Function GetDefaultValueString() As System.String
 Возвращает
 Возвращает значение типа string, представляющее собой отформатированное значение свойства DefaultValue. Например:
"1.5" — если DefaultValue = 1.5,
"0" — если значение по умолчанию не задано,
может возвращать пустую строку, если DefaultValue не определено.
 Описание
 Метод является вспомогательным и предназначен для преобразования числового значения свойства DefaultValue в форматированную строку, отображаемую пользователю. Он используется, например, при формировании подсказок, динамическом обновлении интерфейса или логировании, где требуется отобразить значение по умолчанию в читаемом виде.
 Метод автоматически учитывает:
текущие настройки единиц чертежа,
формат отображения чисел (разделитель, количество знаков после запятой),
региональные и языковые настройки системы.
 Это обеспечивает корректное отображение числа в зависимости от контекста nanoCAD.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("PromptDoubleOptionsExample_GetDefaultValueString")] public void PromptDoubleOptionsExample_GetDefaultValueString() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создаём запрос пользователю PromptDoubleOptions options = new PromptDoubleOptions("\nВведите значение масштаба:"); options.DefaultValue = 1.0; options.UseDefaultValue = true; // Вызываем метод GetDefaultValueString() string defaultStr = options.GetDefaultValueString(); // Выводим результат в командную строку editor.WriteMessage($"\nЗначение по умолчанию: {defaultStr}"); // Если все данные введены, выводим результат в командную строку if (result.Status == PromptStatus.OK) { double scale = result.Value; editor.WriteMessage( $"\nЗначение масштаба: {scale}"); } else { editor.WriteMessage("\nОперация отменена."); } } }
 Ссылки
 HostMgd.EditorInput.PromptDoubleOptions, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!