Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод SelectionTextInputEventArgs.SetErrorMessage
 Послать отзыв
 Синтаксис
C#
Visual Basic
public void SetErrorMessage(ref System.String errorMessage);
Public Sub SetErrorMessage(ByRef errorMessage As System.String)
 Параметры
 Параметры
 Описание
 errorMessage
 Тест сообщения об ошибке
 Описание
 Задает сообщение об ошибке, которое отображается пользователю.
 Ссылки
 SelectionTextInputEventArgs Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!