Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод KeywordCollection.Add (String^, String^, String^, bool, bool)
 Послать отзыв
 Синтаксис
C#
Visual Basic
public void Add(ref String globalName, ref String localName, ref String displayName, bool visible, bool enabled);
Public Sub Add(ByRef globalName As String, ByRef localName As String, ByRef displayName As String, visible As bool, enabled As bool)
 Параметры
 Параметры
 Описание
 globalName
 Глобальное имя. Оно никогда не показывается на экране, а применяется для того, чтобы доступ к ключевому слову производился независимо от локализации (используемого языка).
 localName
 Локальное имя. Это имя вводится пользователем для идентификации этого ключевого слова.
 displayName
 Отображаемое имя. Это имя отображается в командной строке и обычно совпадает с локальным именем.
 visible
 Свойство, определяющее, будет ли ключевое слово отображено для пользователя
 enabled
 Свойство, определяющее, может ли ключевое слово быть выбрано пользователем
 Описание
 Метод добавляет ключевое слово в коллекцию, задавая значения глобального, локального и отображаемого имени ключевого слова, а также значений свойств visible и enable.
 visible определяет, может ли ключевое слово быть показано пользователю.
 Ссылки
 KeywordCollection Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!