Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод PublishSheetEventArgs.AddPageResourceRange
 Послать отзыв
 This is AddPageResourceRange, a member of class PublishSheetEventArgs.
 Синтаксис
C#
Visual Basic
public void AddPageResourceRange(ref array<HostMgd::Publishing::EPlotResource^> resources);
Public Sub AddPageResourceRange(ByRef resources As array<HostMgd.Publishing.EPlotResource^>)
 Ссылки
 PublishSheetEventArgs Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!