Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод PaletteSet.Add
 Послать отзыв
 Добавление новой вкладки с использованием элемента управления Windows Forms
 Добавление новой вкладки с использованием элемента управления Windows Forms
 Синтаксис
C#
Visual Basic
public HostMgd::Windows::Palette Add(ref System.String name, ref System.Windows.Forms.Control control);
Public Function Add(ByRef name As System.String, ByRef control As System.Windows.Forms.Control) As HostMgd.Windows.Palette
 Возвращает
 При неудаче возвращает nullptr.
 Описание
 Ссылки
 PaletteSet Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!