Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PointInputEventArgs
 Послать отзыв
 Класс PointInputEventArgs представляет данные для пользовательских событий, связанных с выбором точки. В текущей версии не реализован.
 Иерархия классов
HostMgd::EditorInput::PointInputEventArgs
 Синтаксис
C#
Visual Basic
Копировать Код
public sealed class PointInputEventArgs : System.EventArgs;
Копировать Код
Public NotInheritable Class PointInputEventArgs Inherits System.EventArgs;
 Описание
 Класс PointInputEventArgs представляет данные для пользовательских событий, связанных с интерактивным указанием точки в редакторе nanoCAD.
 В текущей версии не реализован.
 Методы
 Конструкторы
 Имя
 Описание
 PointInputEventArgs
 Конструктор по умолчанию класса PointInputEventArgs.
 Топики
 Имя
 Описание
 PointInputEventArgs Свойства
 Ниже перечислены свойства класса PointInputEventArgs.
 Ссылки
 PointInputEventArgs Свойства, Методы, Топики, PointInputEventArgs Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!