Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Делегат HostMgd.ApplicationServices.DocumentLockModeChangeVetoedEventHandler
 Послать отзыв
 Делегат события класса DocumentCollection
 Синтаксис
C#
Visual Basic
public delegate DocumentLockModeChangeVetoedEventHandler();
Public Delegate Sub DocumentLockModeChangeVetoedEventHandler()
 Ваши комментарии по поводу этого топика: Послать отзыв!