Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.PlotConfig.PortName
 Послать отзыв
 Свойство PortName возвращает имя порта устройства. Не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public System.String PortName;
Копировать Код
Public ReadOnly Property PortName As System.String
 Возвращает
 Возвращает имя порта устройства. Тип System.String.
 Описание
 Свойство PortName возвращает имя порта устройства.
 В текущей версии не реализовано.
 Условия
 Только чтение.
 Ссылки
 HostMgd.PlottingServices.PlotConfig, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!