Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.DraggingEndedEventArgs
 Послать отзыв
 Класс предоставляет данные о завершении операции перетаскивания, включая её статус и конечную позицию.
 Иерархия классов
HostMgd::EditorInput::DraggingEndedEventArgs
 Синтаксис
C#
Visual Basic
Копировать Код
public sealed class DraggingEndedEventArgs : EventArgs
Копировать Код
Public NotInheritable Class DraggingEndedEventArgs Inherits EventArgs
 Описание
 Класс является наследником EventArgs и используется для передачи контекстной информации при возникновении события DraggingEnded, которое происходит после окончания операции перетаскивания объекта. Он содержит сведения о том, как завершилась операция — успешно, отменено пользователем или с ошибкой, а также координаты точки завершения перетаскивания. Этот класс применяется совместно с делегатом DraggingEndedEventHandler.
 Замечания
 Данный класс предоставляет расширенные данные о событии, что позволяет разработчику реагировать на результат перетаскивания в зависимости от его исхода.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события Dragging [Teigha.Runtime.CommandMethod("DraggingEndedExample")] public void DraggingEndedExample() { // Подписка на событие редактора DraggingEnded editor.DraggingEnded += OnEditorDraggingEnded; } // Реализация отработки события DraggingEnded private void OnEditorDraggingEnded(object sender, DraggingEndedEventArgs e) { // Вывод сообщения в командную строку editor.WriteMessage("\nПеретаскивание завершено."); } }
 Топики
 Имя
 Описание
 DraggingEndedEventArgs Свойства
 Ниже перечислены свойства класса DraggingEndedEventArgs.
 Ссылки
 DraggingEndedEventArgs Свойства, Топики, DraggingEndedEventArgs Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!