Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 JigPrompts.AcquireAngle()
 Послать отзыв
 Метод запрашивает у пользователя угол в °(градусах).
 Синтаксис
C#
Visual Basic
public HostMgd.EditorInput.PromptDoubleResult AcquireAngle();
Public Function AcquireAngle() As HostMgd.EditorInput.PromptDoubleResult
 Возвращает
 Возвращает результат типа double, который является углом, выраженным в радианах. Значение угла определяется либо исходя из текущего положения курсора мыши, либо посредством ввода с клавиатуры. При вводе с клавиатуры необходимо указывать угол в °(градусах).
 Описание
 Метод предназначен для запроса у пользователя угол в °(градусах). В основном применяется для интерактивного поворота объекта или группы объектов. После вызова создает пустой экземпляр класса JigPromptAngleOptions и вызывает свою перегрузку JigPrompts.AcquireAngle(JigPromptAngleOptions options).
 Пример
 В примере приведен отрывок кода из реализации метода Sampler() класса Jig.
C#
 Копировать Код
 PromptDoubleResult result = prompts.AcquireAngle();
Visual Basic
 Копировать Код
 Dim result As PromptDoubleResult = prompts.AcquireAngle()
 Ссылки
 JigPrompts Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!