Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptKeywordOptionsEventArgs
 Послать отзыв
 Класс предоставляет данные для события PromptingForKeyword, позволяя настроить параметры ввода ключевого слова перед началом операции.
 Иерархия классов
HostMgd::EditorInput::PromptKeywordOptionsEventArgs
 Синтаксис
C#
Visual Basic
Копировать Код
public sealed class PromptKeywordOptionsEventArgs : EventArgs
Копировать Код
Public NotInheritable Class PromptKeywordOptionsEventArgs Inherits EventArgs
 Описание
 Класс используется для передачи параметров, связанных с началом операции ввода ключевого слова — например, при вызове GetString() с набором ключевых слов. Он предоставляет доступ к объекту PromptKeywordOptions, содержащему:
текст приглашения (Message),
список доступных ключевых слов (Keywords),
глобальные ключевые слова ,
режимы ввода (например, обязательный выбор).
 Этот класс применяется в обработчике события PromptingForKeyword, где разработчик может динамически изменять параметры ввода в зависимости от контекста — например, показывать разные варианты выбора в зависимости от состояния чертежа.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события PromptingForKeyword [Teigha.Runtime.CommandMethod("PromptingForKeywordExample")] public void PromptingForKeywordExample() { // Подписка на событие PromptingForKeyword editor.PromptingForKeyword += OnEditorPromptingForKeyword; } // Реализация отработки события PromptingForKeyword private void OnEditorPromptingForKeyword(object sender, PromptKeywordOptionsEventArgs e) { // Изменение сообщения e.Options.Message = "Выберите действие:"; // Добавление ключевых слов e.Options.Keywords.Add("Включить"); e.Options.Keywords.Add("Отключить"); e.Options.Keywords.Add("По умолчанию"); } }
 Топики
 Имя
 Описание
 PromptKeywordOptionsEventArgs Свойства
 Ниже перечислены свойства класса PromptKeywordOptionsEventArgs.
 Ссылки
 PromptKeywordOptionsEventArgs Свойства, Топики, PromptKeywordOptionsEventArgs Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!