Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод TrayItemCollection.IndexOf (TrayItem^)
 Послать отзыв
 This is IndexOf, a member of class TrayItemCollection.
 Синтаксис
C#
Visual Basic
public int IndexOf(ref TrayItem value);
Public Function IndexOf(ByRef value As TrayItem) As Integer
 Ссылки
 TrayItemCollection Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!