Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор CrossingOrWindowSelectedSubObject.CrossingOrWindowSelectedSubObject
 Послать отзыв
 Синтаксис
C#
Visual Basic
public CrossingOrWindowSelectedSubObject(ref Teigha::DatabaseServices::FullSubentityPath path, HostMgd::EditorInput::SelectionMethod method, int gsMarker);
Public Sub New(ByRef path As Teigha.DatabaseServices.FullSubentityPath, method As HostMgd.EditorInput.SelectionMethod, gsMarker As Integer)
 Параметры
 Параметры
 Описание
 path
 Путь к объекту
 method
 Метод выбора объекта
 gsMarker
 GS маркер
 Описание
 Конструктор.
 Ссылки
 CrossingOrWindowSelectedSubObject Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!