Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Класс HostMgd.Publishing.PublishUIEventArgs
 Послать отзыв
 This is class HostMgd::Publishing::PublishUIEventArgs.
 Иерархия классов
HostMgd::Publishing::PublishUIEventArgs
 Синтаксис
C#
Visual Basic
public class PublishUIEventArgs : System.EventArgs;
Public Class PublishUIEventArgs Inherits System.EventArgs
 Методы
 Конструкторы
 Имя
 Описание
 PublishUIEventArgs
 This is PublishUIEventArgs, a member of class PublishUIEventArgs.
 Топики
 Имя
 Описание
 PublishUIEventArgs Методы
 Ниже перечислены методы класса PublishUIEventArgs.
 PublishUIEventArgs Свойства
 Ниже перечислены свойства класса PublishUIEventArgs.
 Ссылки
 PublishUIEventArgs Методы, PublishUIEventArgs Свойства, Методы, Топики, PublishUIEventArgs Методы, PublishUIEventArgs Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!