Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Converter.StringToDistance (String^)
 Послать отзыв
 Синтаксис
C#
Visual Basic
public double StringToDistance(ref String value);
Public Function StringToDistance(ByRef value As String) As Double
 Описание
 Конвертирует строку в расстояние в соответствии с текущими линейными единицами
 Ссылки
 Converter Класс, HostMgd.Runtime Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!