Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.GetAngle(String)
 Послать отзыв
 Метод предлагает пользователю ввести угол с учётом текущего значения системной переменной ANGBASE и возвращает результат в виде значения угла в радианах.
 Синтаксис
C#
Visual Basic
Копировать Код
public PromptDoubleResult GetAngle(String message);
Копировать Код
Public Function GetAngle(message As String) As PromptDoubleResult
 Параметры
 Параметры
 Описание
 message
 Сообщение, отображаемое в командной строке для приглашения пользователя к вводу угла (например, "Укажите угол поворота:"). Тип String.
 Возвращает
 Возвращается объект типа PromptDoubleResult, содержащий:
Status — статус операции (OK, Cancel, Error и др.).
Value — значение введённого угла в радианах (если операция завершена успешно).
StringResult — строковое представление введённого угла или имя ключевого слова (если использовалось).
 Описание
 Метод используется для интерактивного ввода угла пользователем через командную строку или графическое указание на чертеже. Угол отсчитывается относительно направления, заданного системной переменной ANGBASE. Пользователь может ввести значение с клавиатуры или указать угол мышью. Метод выводит указанное сообщение перед началом ввода и возвращает результат в виде объекта PromptDoubleResult.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("GetAngleExample_String")] public void GetAngleExample_String() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создаём запрос пользователю, чтобы он указал угол на чертеже PromptDoubleResult result = editor.GetAngle("\nУкажите угол поворота:"); // Если пользователь указал все необходимые данные, // выводим в командной строке сообщение if (result.Status == PromptStatus.OK) { double angleInRadians = result.Value; double angleInDegrees = result.Value * 180 / Math.PI; editor.WriteMessage($"\nВведен угол: {angleInRadians} радиан или {angleInDegrees} градусов"); } } }
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!