Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptNestedEntityResultEventHandler(object,PromptNestedEntityResultEventArgs)
 Послать отзыв
 Делегат предназначен для обработки событий, возникающих после завершения выбора вложенного геометрического объекта в чертеже nanoCAD.
 Синтаксис
C#
Visual Basic
Копировать Код
public delegate void PromptNestedEntityResultEventHandler(object sender, PromptNestedEntityResultEventArgs e);
Копировать Код
Public Delegate Sub PromptNestedEntityResultEventHandler(sender As Object, e As PromptNestedEntityResultEventArgs)
 Параметры
 Параметры
 Описание
 sender
 Источник события — обычно экземпляр редактора (Editor), в котором была выполнена команда выбора вложенного объекта. Тип object
 e
 Объект, содержащий информацию о результате выбора:
 Описание
 Делегат используется как сигнатура метода-обработчика для событий, связанных с операцией выбора вложенного объекта — например, при вызове метода GetNestedEntity() или внутри события PromptedForNestedEntity. Он позволяет получить доступ к результату выбора, включая идентификатор (ObjectId) выбранного элемента, точку ввода (PickedPoint) и матрицу преобразования блока. Эти данные предоставляются через параметр e, который представляет собой экземпляр класса PromptNestedEntityResultEventArgs.
 Этот тип делегата применяется при разработке надстроек, где требуется взаимодействовать с объектами, расположенными внутри блоков или внешних ссылок — например, для редактирования, анализа или построения на основе вложенных элементов.
 Ваши комментарии по поводу этого топика: Послать отзыв!