Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство TrayItemBubbleWindowClosedEventArgs.CloseReason
 Послать отзыв
 This is CloseReason, a member of class TrayItemBubbleWindowClosedEventArgs.
 Синтаксис
C#
Visual Basic
public HostMgd::Windows::TrayItemBubbleWindowCloseReason CloseReason;
Public Property CloseReason() As HostMgd.Windows.TrayItemBubbleWindowCloseReason
 Ссылки
 TrayItemBubbleWindowClosedEventArgs Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!