Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Делегат HostMgd.Windows.ToolPalette.DragHandler
 Послать отзыв
 This is type HostMgd::Windows::ToolPalette::DragHandler.
 Синтаксис
C#
Visual Basic
public delegate DragHandler();
Public Delegate Sub DragHandler()
 Ваши комментарии по поводу этого топика: Послать отзыв!