Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Событие Publisher.AboutToBeginBackgroundPublishing
 Послать отзыв
 This is AboutToBeginBackgroundPublishing, a member of class Publisher.
 Синтаксис
C#
Visual Basic
public event AboutToBeginBackgroundPublishingEventHandler AboutToBeginBackgroundPublishing;
Public Event AboutToBeginBackgroundPublishing As AboutToBeginBackgroundPublishingEventHandler
 Ссылки
 Publisher Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!