Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.SelectionRemoved
 Послать отзыв
 Событие возникает при удалении одного или нескольких объектов из текущего набора выделенных объектов в редакторе nanoCAD.
 Синтаксис
C#
Visual Basic
Копировать Код
public event SelectionRemovedEventHandler SelectionRemoved;
Копировать Код
Public Event SelectionRemoved As SelectionRemovedEventHandler
 Описание
 Событие инициируется системой nanoCAD при изменении набора выбранных объектов, когда один или несколько объектов удаляются из выборки — например, пользователь удерживает клавишу Shift и щелкает по объекту, использует режим "Удалить" в команде выбора или выполняет операцию, исключающую объекты из текущей выборки.
 Оно предоставляет доступ к списку удалённых объектов через объект SelectionSet, что позволяет разработчику плагина отслеживать изменения в выборке и реагировать на них — например, обновлять панель свойств, корректировать логику команды или визуализировать изменения.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; [Teigha.Runtime.CommandMethod("SelectionRemovedExample")] public void SelectionRemovedExample() { // Подписка на событие SelectionRemoved editor.SelectionRemoved += OnSelectionRemoved; } // Реализация отработки события SelectionRemoved private void OnSelectionRemoved(object sender, SelectionRemovedEventArgs e) { SelectionSet removedSet = e.Selection; foreach (ObjectId id in removedSet.GetObjectIds()) { editor.WriteMessage($"\nИз выборки удалён объект: {id}"); } } }
 Порядок работы с событием:
Пользователь выполняет действие, исключающее объекты из выборки.
Система формирует список удалённых объектов.
Генерируется событие SelectionRemoved.
Разработчик получает доступ к списку и может обработать изменение.
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!