Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство EPlotPropertyCollection.Item
 Послать отзыв
 This is Item, a member of class EPlotPropertyCollection.
 Синтаксис
C#
Visual Basic
public HostMgd::Publishing::EPlotProperty Item;
Public Property Item() As HostMgd.Publishing.EPlotProperty
 Ссылки
 EPlotPropertyCollection Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!