Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.MediaBounds.MediaBounds
 Послать отзыв
 Конструктор класса MediaBounds. Создает экземпляр класса с указанными параметрами. Не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public MediaBounds( Teigha.Geometry.Point2d pageSize, Teigha.Geometry.Point2d lowerLeftPrintableArea, Teigha.Geometry.Point2d upperRightPrintableArea );
Копировать Код
Public Sub New( pageSize As Teigha.Geometry.Point2d, lowerLeftPrintableArea As Teigha.Geometry.Point2d, upperRightPrintableArea As Teigha.Geometry.Point2d )
 Параметры
 Параметры
 Описание
 pageSize
 Размер страницы. Тип Teigha.Geometry.Point2d.
 lowerLeftPrintableArea
 Левый нижний угол области печати. Тип Teigha.Geometry.Point2d.
 upperRightPrintableArea
 Правый верхний угол области печати. Тип Teigha.Geometry.Point2d.
 Описание
 Конструктор класса MediaBounds. Создает экземпляр класса с указанными параметрами.
 В текущей версии не реализован.
 Ссылки
 HostMgd.PlottingServices.MediaBounds, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!