Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство StatusBar.Window
 Послать отзыв
 This is Window, a member of class StatusBar.
 Синтаксис
C#
Visual Basic
public HostMgd::Windows::Window Window;
Public Property Window() As HostMgd.Windows.Window
 Ссылки
 StatusBar Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!