Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.DocumentBeginCloseEventArgs.Veto
 Послать отзыв
 Метод запрещает продолжение операции закрытия документа.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Veto();
Копировать Код
Public Sub Veto()
 Описание
 Метод Veto() запрещает продолжение операции закрытия документа.
 Ссылки
 HostMgd.ApplicationServices.DocumentBeginCloseEventArgs, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!