Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.Windows.ToolPalette.CustomToolBase.Editable
 Послать отзыв
 Метод позволяет управлять возможностью редактирования пользовательского инструмента на панели инструментов. Не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void Editable( int dispatchId, int editable );
Копировать Код
Public Overridable Sub Editable( dispatchId As Integer, editable As Integer )
 Параметры
 Параметры
 Описание
 dispatchId
 Диспетчерский идентификатор. Тип int.
 editable
 Флаг редактируемости. Тип int. Если равен нулю, редактирование не допускается. В противном случае оно возможно.
 Описание
 Метод предназначен для управления редактируемостью пользовательского инструмента на панели инструментов. Он позволяет указать, может ли элемент инструмента (например, свойство), идентифицируемый по dispatchId, быть изменён пользователем через интерфейс панели инструментов.
 В текущей версии не реализован.
 Ссылки
 HostMgd.Windows.ToolPalette.CustomToolBase, HostMgd.Windows.ToolPalette
 Ваши комментарии по поводу этого топика: Послать отзыв!