Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PublishUIEventArgs.JobWillPublishInBackground
 Послать отзыв
 This is JobWillPublishInBackground, a member of class PublishUIEventArgs.
 Синтаксис
C#
Visual Basic
public bool JobWillPublishInBackground;
Public Property JobWillPublishInBackground() As bool
 Ссылки
 PublishUIEventArgs Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!