Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptDistanceOptions.UseDashedLine
 Послать отзыв
 Свойство включает или отключает отображение штриховой «резиновой» линии между базовой точкой и текущим положением курсора при вводе расстояния.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool UseDashedLine { get; set; }
Копировать Код
Public Property UseDashedLine As Boolean
 Возвращает
 Возвращает значение типа bool:
true — штриховая линия отображается.
false — штриховая линия скрыта.
 Описание
 Свойство используется для управления визуальной подсказкой при интерактивном вводе расстояния. Если свойство установлено в true, в редакторе отображается штриховая линия, соединяющая базовую точку (BasePoint) с текущим положением мыши. Эта линия помогает пользователю визуально оценить направление и длину вводимого расстояния, что особенно полезно при выполнении операций, таких как смещение, копирование или построение объектов.
 Для корректной работы UseDashedLine необходимо:
Установить BasePoint — точку начала линии.
Включить UseBasePoint = true.
 Если UseDashedLine равно false, визуальная линия не отображается, и пользователь работает без графической привязки.
 Условия
 Чтение и запись
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { [Teigha.Runtime.CommandMethod("PromptDistanceOptionsExample_UseDashedLine")] public void PromptDistanceOptionsExample_UseDashedLine() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создаём запрос пользователю PromptDistanceOptions options = new PromptDistanceOptions("\nВведите расстояние:"); // Устанавливаем базовую точку options.BasePoint = new Point3d(100, 100, 0); // Включаем использование базовой точки и штриховой линии options.UseBasePoint = true; options.UseDashedLine = true; // Вызов метода GetDistance() PromptDoubleResult result = editor.GetDistance(options); // Вывод результата в командную строку if (result.Status == PromptStatus.OK) { editor.WriteMessage($"\nВведено расстояние: {result.Value}"); } } }
 Ссылки
 HostMgd.EditorInput.PromptDistanceOptions, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!