Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод MenuItemCollection.CopyTo (array<HostMgd::Windows::MenuItem^>^, int)
 Послать отзыв
 This is CopyTo, a member of class MenuItemCollection.
 Синтаксис
C#
Visual Basic
public void CopyTo(ref array<HostMgd::Windows::MenuItem^> array, int index);
Public Sub CopyTo(ByRef array As array<HostMgd.Windows.MenuItem^>, index As Integer)
 Ссылки
 MenuItemCollection Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!