Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство TabbedDialogExtension.OnOk
 Послать отзыв
 Синтаксис
C#
Visual Basic
public TabbedDialogAction OnOk;
Public Property OnOk() As TabbedDialogAction
 Описание
 Возвращает обработчик события, который вызывается, когда в главном диалоге пользователь нажимает на кнопку OK, чтобы применить изменения и закрыть диалог.
 Условия
 Только на чтение
 Ссылки
 TabbedDialogExtension Класс, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!