Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.PlotInfoValidator.PlotInfoValidator
 Послать отзыв
 Конструктор по умолчанию класса PlotInfoValidator.
 Синтаксис
C#
Visual Basic
Копировать Код
public PlotInfoValidator();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса PlotInfoValidator.
 Ссылки
 HostMgd.PlottingServices.PlotInfoValidator, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!