Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PaletteSet.Item
 Послать отзыв
 Индексатор коллекции панелей.
 Синтаксис
C#
Visual Basic
public Palette Item;
Public Property Item() As Palette
 Описание
 Возвращает null при выходе индекса за границы коллекции. Только для чтения.
 Ссылки
 PaletteSet Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!