Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Класс HostMgd.Windows.PaletteSetSizeEventArgs
 Послать отзыв
 This is class HostMgd::Windows::PaletteSetSizeEventArgs.
 Иерархия классов
HostMgd::Windows::PaletteSetSizeEventArgs
 Синтаксис
C#
Visual Basic
public class PaletteSetSizeEventArgs : System.EventArgs;
Public Class PaletteSetSizeEventArgs Inherits System.EventArgs
 Методы
 Конструкторы
 Имя
 Описание
 PaletteSetSizeEventArgs
 This is PaletteSetSizeEventArgs, a member of class PaletteSetSizeEventArgs.
 Топики
 Имя
 Описание
 PaletteSetSizeEventArgs Свойства
 Ниже перечислены свойства класса PaletteSetSizeEventArgs.
 Ссылки
 PaletteSetSizeEventArgs Свойства, Методы, Топики, PaletteSetSizeEventArgs Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!