Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Делегат HostMgd.ApplicationServices.CommandEventHandler
 Послать отзыв
 Делегат коммандных событий класса Document
 Синтаксис
C#
Visual Basic
public delegate CommandEventHandler();
Public Delegate Sub CommandEventHandler()
 Ваши комментарии по поводу этого топика: Послать отзыв!