Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptSelectionOptions.ForceSubSelections
 Послать отзыв
 Свойство определяет, будет ли выбор ограничен только подмножествами объектов — например, сегментами полилинии или элементами блока.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool ForceSubSelections { get; set; }
Копировать Код
Public Property ForceSubSelections As Boolean
 Возвращает
 Возвращает значение типа bool:
true — выбор подмножества объекта обязателен; выбор целого объекта не разрешён.
false — выбор подмножества не обязателен; пользователь может выбрать как подмножество, так и весь объект.
 Описание
 Свойство указывает, обязательно ли пользователь должен выбрать именно подмножество объекта (например, вершину, ребро, сегмент), а не весь объект целиком. Если свойство установлено в true, система будет игнорировать выбор целого объекта и требовать указания его внутреннего компонента. Если false — выбор целого объекта разрешён.
 Это свойство применяется в связке с AllowSubSelections = true и используется в специализированных командах, где требуется строгое взаимодействие с элементами сложных объектов — например, при редактировании сегментов полилинии, работе с гранями 3D-тел или анализе структуры блоков.
 Условия
 Чтение и запись
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("PromptSelectionOptionsExample_ForceSubSelections")] public void PromptSelectionOptionsExample_ForceSubSelections() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создаём набор параметров для запроса PromptSelectionOptions options = new PromptSelectionOptions(); options.MessageForAdding = "Выберите линии для объединения:"; // Разрешить выбор части объекта options.AllowSubSelections = true; // Только сегмент, не вся полилиния options.ForceSubSelections = true; // Фильтр: только объекты типа Line TypedValue[] filterList = new TypedValue[] { new TypedValue((int)DxfCode.Start, "LINE") }; SelectionFilter filter = new SelectionFilter(filterList); // Создаём запрос пользователю PromptSelectionResult result = editor.GetSelection(options, filter); // Если все данные введены, выводим результат в командную строку if (result.Status == PromptStatus.OK) { SelectionSet selSet = result.Value; editor.WriteMessage( $"\nВыбрано объектов: {selSet.Count}"); } else { editor.WriteMessage( "\nНе удалось получить выделение."); } } }
 Ссылки
 HostMgd.EditorInput.PromptSelectionOptions, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!