Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.Windows.ToolPalette.CustomToolBase.CreatePalette
 Послать отзыв
 Метод создает панель инструментов с заданным именем и добавляет в неё указанный каталог. Не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public HostMgd.Windows.Palette CreatePalette( ref HostMgd.Windows.ToolPalette.Catalog catalogName, ref System.String paletteName );
Копировать Код
Public Function CreatePalette( ByRef catalogName As HostMgd.Windows.ToolPalette.Catalog, ByRef paletteName As System.String ) As HostMgd.Windows.Palette
 Параметры
 Параметры
 Описание
 catalogName
 Входное имя каталога. Тип HostMgd.Windows.ToolPalette.Catalog.
 paletteName
 Входное имя панели инструментов. Тип System.String.
 Возвращает
 Возвращает созданную панель инструментов. Тип HostMgd.Windows.Palette.
 Описание
 Метод создает панель инструментов с заданным именем catalogName и добавляет в неё указанный каталог catalogName.
 В текущей версии не реализован.
 Ссылки
 HostMgd.Windows.ToolPalette.CustomToolBase, HostMgd.Windows.ToolPalette
 Ваши комментарии по поводу этого топика: Послать отзыв!