Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.DocumentCollection.Open(string,bool)
 Послать отзыв
 Метод предназначен для открытия чертежа с указанным уровнем доступа.
 Синтаксис
C#
Visual Basic
Копировать Код
public Document Open(string fileName, bool forReadOnly);
Копировать Код
Public Function Open(fileName As string, forReadOnly As bool) As Document
 Параметры
 Параметры
 Описание
 fileName
 Полный путь к чертежу, который необходимо открыть. Тип string
 forReadOnly
 Параметр, указывающий, в каком режиме открыть чертеж: true - для чтения, false - для записи. Тип bool
 Возвращает
 Возвращает открытый документ. Тип Document
 Описание
 Метод открывает чертеж, путь к которому указан в параметре fileName, с уровнем доступа, указанным в параметре forReadOnly и возвращает объект типа Document, представляющий открытый чертеж. Этот объект добавляется к коллекции класса.
 Ссылки
 HostMgd.ApplicationServices.DocumentCollection, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!