Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство SystemVariableChangedEventArgs.Changed
 Послать отзыв
 Синтаксис
C#
Visual Basic
public bool Changed;
Public Property Changed() As bool
 Описание
 Указывает, успешно ли выполнено изменение системной переменной.
 Условия
 Только на чтение
 Ссылки
 SystemVariableChangedEventArgs Класс, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!