Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод JigPromptDistanceOptions.GetDefaultValueString
 Послать отзыв
 Вспомогательный метод.
 Синтаксис
C#
Visual Basic
public System.String GetDefaultValueString();
Public Function GetDefaultValueString() As System.String
 Возвращает
 Возвращает строку string, в которой указано значение расстояния, заданное по умолчанию.
 Описание
 Предназначен для преобразования значения расстояния по умолчанию в строку (string).
 Метод преобразовывает значение свойства DefaultValue в строку.
 Ссылки
 JigPromptDistanceOptions Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!