Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор PublishUIEventArgs.PublishUIEventArgs
 Послать отзыв
 This is PublishUIEventArgs, a member of class PublishUIEventArgs.
 Синтаксис
C#
Visual Basic
public PublishUIEventArgs();
Public Sub New()
 Ссылки
 PublishUIEventArgs Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!