Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.DsdEntry.Nps
 Послать отзыв
 Свойство Nps представляет именованную строку настроек страницы. Не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public System.String Nps;
Копировать Код
Public Property Nps As System.String
 Возвращает
 Возвращает именованную строку настроек страницы. Тип System.String.
 Описание
 Свойство Nps представляет именованную строку настроек страницы (Nps = named page setup).
 В текущей версии не реализовано.
 Условия
 Чтение и запись.
 Ссылки
 HostMgd.PlottingServices.DsdEntry, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!