Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.DsdData.SetUnrecognizedData
 Послать отзыв
 Метод позволяет сохранить в данном объекте DSDData кастомизированный (нераспознанный) раздел DSD и соответствующие данные, полученные при чтении из DSD-файла. Не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetUnrecognizedData( ref System.String sectionName, ref System.String sectionData );
Копировать Код
Public Sub SetUnrecognizedData( ByRef sectionName As System.String, ByRef sectionData As System.String )
 Параметры
 Параметры
 Описание
 sectionName
 Входное имя кастомизированной (нераспознанной) секции. Тип System.String.
 sectionData
 Входные данные кастомизированной (нераспознанной) секции. Тип System.String.
 Описание
 При чтении DSD-файла обнаруженные нераспознанные разделы классифицируются как «нераспознанные» данные. Этот метод позволяет сохранить в данном объекте DSDData загруженный из DSD-файла кастомизированный (нераспознанный) раздел DSD и соответствующие данные.
 В текущей версии не реализован.
 Ссылки
 HostMgd.PlottingServices.DsdData, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!