Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Перечисление HostMgd.Windows.PaletteSetHostMgdStyles
 Послать отзыв
 This is record HostMgd::Windows::PaletteSetHostMgdStyles.
 Синтаксис
C#
Visual Basic
[Flags] [HostMgdSpecific] public enum PaletteSetHostMgdStyles { DestroyOnClose = 0x1 }
<Flags> <HostMgdSpecific> Public Enum PaletteSetHostMgdStyles DestroyOnClose = &H1 End Enum
 Ваши комментарии по поводу этого топика: Послать отзыв!