Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.BeginPageEventHandler(Object, BeginPageEventArgs)
 Послать отзыв
 Делегат BeginPageEventHandler предназначен для обработки события PlotReactorManager.BeginPage, возникающего перед началом вывода страницы на печать.
 Синтаксис
C#
Visual Basic
Копировать Код
public delegate void BeginPageEventHandler( Object sender, BeginPageEventArgs e );
Копировать Код
Public Delegate Sub BeginPageEventHandler( sender As Object, e As BeginPageEventArgs )
 Параметры
 Параметры
 Описание
 sender
 Объект, инициировавший событие. Тип Object.
 e
 Аргументы события. Тип BeginPageEventArgs.
 Описание
 Делегат BeginPageEventHandler предназначен для обработки события PlotReactorManager.BeginPage, возникающего перед началом вывода страницы на печать.
 Контекст события передается через параметры sender и e, где sender определяет объект-инициатор события, а аргумент e типа BeginPageEventArgs передает объекты PlotInfo и PlotPageInfo, а также флаг последней страницы печатаемого документа.
 Ваши комментарии по поводу этого топика: Послать отзыв!