Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор PublishSheetEventArgs.PublishSheetEventArgs
 Послать отзыв
 This is PublishSheetEventArgs, a member of class PublishSheetEventArgs.
 Синтаксис
C#
Visual Basic
public PublishSheetEventArgs();
Public Sub New()
 Ссылки
 PublishSheetEventArgs Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!