Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.Drag(SelectionSet,String,DragCallback)
 Послать отзыв
 Метод предлагает пользователю переместить выделенный набор объектов с помощью перетаскивания, используя заданное сообщение и функцию обратного вызова.
 Синтаксис
C#
Visual Basic
Копировать Код
public PromptPointResult Drag(SelectionSet selection, System.String message, DragCallback callback);
Копировать Код
Public Function Drag(selection As SelectionSet, message As System.String, callback As DragCallback) As PromptPointResult
 Параметры
 Параметры
 Описание
 selection
 Набор выделенных объектов, которые будут перемещаться в процессе перетаскивания. Тип SelectionSet
 message
 Сообщение, выводимое в командной строке для информирования пользователя о выполняемом действии (например, "Перетащите объект сюда"). Тип String
 callback
 Функция обратного вызова, которая вызывается при каждом изменении положения во время перетаскивания. Используется для обновления геометрии или отображения промежуточных состояний объектов. Тип DragCallback
 Возвращает
 Возвращается значение типа PromptPointResult, представляющее результат выполнения операции перетаскивания. Содержит статус операции: OK (успешно завершена), Cancel (отменена пользователем), Error (ошибка) и другие. Если операция успешна, содержит конечную точку (Value типа Point3d), на которую были перемещены объекты. Используется для последующей обработки результата, например, фиксации нового положения объектов в чертеже.
 Описание
 Метод инициирует интерактивную операцию перетаскивания выделенного множества графических объектов в пространстве модели или листа текущего чертежа. Пользователь может перемещать объекты мышью, а система отслеживает изменение положения в реальном времени. Метод поддерживает только графические объекты — неграфические элементы и примитивы из других блоков не обрабатываются. При каждом изменении позиции вызывается функция обратного вызова (callback), позволяя динамически обновлять состояние объектов. После завершения возвращается результат с конечной точкой перемещения.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; using Teigha.DatabaseServices; using Teigha.Geometry; public partial class Commands { // Глобальная переменная для точки начала перемещения, т.к. она необходима // в нескольких методах. Можно сделать запрос пользователю, чтобы он указал эту точку // на чертеже Point3d basePoint = new Point3d(0, 0, 0); // Метод команды, который можно вызвать через командную строку nanoCAD [Teigha.Runtime.CommandMethod("DragExample_SelectionSet_String_DragCallback")] public void DragExample_SelectionSet_String_DragCallback() { // Получаем доступ к dwg-документу и через него к редактору и базе данных документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; Database db = doc.Database; // Сначала необходимо выбрать объекты на чертеже // Для этого делаем запрос пользователю PromptSelectionOptions selectionOpts = new PromptSelectionOptions(); selectionOpts.MessageForAdding = "Выберитае объект для перемещения"; selectionOpts.MessageForRemoval = "Выберите объект для удаления из выборки"; PromptSelectionResult selectionResult = editor.GetSelection(selectionOpts); // Если набор объектов получен, то далее запрашиваем у пользователя точку, // в которую необходимо переместить выбранные объекты if(selectionResult.Status == PromptStatus.OK&&selectionResult.Value.Count>0) { // Запрашиваем у пользователя точку, в которую необходимо переместить выбранные объекты. // На экране будет виден предпросмотр перемещения PromptPointResult result = editor.Drag(selectionResult.Value,"\nВыберите точку для перемещения объектов:",OnDrag); // Когда точка выбрана, изменяем положение объектов в базе данных черетжа if (result.Status == PromptStatus.OK) { // Рассчитываем матрицу перемещения Vector3d vector = basePoint.GetVectorTo(result.Value); Matrix3d mat = Matrix3d.Displacement(vector); // Запускаем транзакцию для изменения положения объектов using (Transaction trans = db.TransactionManager.StartTransaction()) { // Перебираем коллекцию объектов чертежа, положение которых нужно изменить foreach (SelectedObject ssobj in selectionResult.Value) { // Получаем доступ к объекту и изменяем его положение с помощью матрицы перемещения ObjectId objectId = ssobj.ObjectId; DBObject dbobj = trans.GetObject(objectId, OpenMode.ForWrite); Entity ent = dbobj as Entity; ent.TransformBy(mat); } // Сохраняем в базе данных чертежа изменения trans.Commit(); } editor.WriteMessage($"\nОбъекты перемещены в точку: {result.Value}"); } } } // Метод для делегата DragCallback, с помощью которого отображается // предпросмотр перемещения public SamplerStatus OnDrag(Point3d current, ref Matrix3d xform) { // Рассчитываем вектор перемещения от начальной точки basePoint Vector3d offset = basePoint.GetVectorTo(current); // Сдвиг объекта к курсору xform = Matrix3d.Displacement(offset); // Продолжаем операцию return SamplerStatus.OK; } }
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!