Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 JigPrompts.AcquireDistance(String,String)
 Послать отзыв
 Метод запрашивает у пользователя расстояние, используя в запросе приглашающее сообщение с ключевыми словами.
 Синтаксис
C#
Visual Basic
public HostMgd.EditorInput.PromptDoubleResult AcquireDistance(ref System.String messageAndKeywords, ref System.String globalKeywords);
Public Function AcquireDistance(ByRef messageAndKeywords As System.String, ByRef globalKeywords As System.String) As HostMgd.EditorInput.PromptDoubleResult
 Параметры
 Параметры
 Описание
 messageAndKeywords
 Строка, содержащая в себе сообщение запроса и ключевые слова к нему, которые будут выводиться на экране при запросе расстояния.
 globalKeywords
 Строка,содержащая в себе глобальные ключевые слова. Количество глобальных ключевых слов должно совпадать с количеством ключевых слов в приглашающем сообщении messageAndKeywords. Ключевые слова в строке globalKeywords должны отделяться друг от друга одним пробелом.
 Возвращает
 Возвращает результат типа double, который является расстоянием, полученным либо из текущего положения курсора мыши и значений настроек, выбранных пользователем, либо посредством ввода с клавиатуры.
 Описание
 Метод предназначен для запроса у пользователя расстояния. В основном применяется для интерактивного увеличения или уменьшения объекта или группы объектов, либо их перемещения. После вызова создает экземпляр класса JigPromptDistanceOptions, присваивает его свойству Message значение параметра messageAndKeywords, выделяет из этого параметра ключевые слова, записывает их в свойство Keywords как KeywordCollection вместе с глобальными ключевыми словами из параметра globalKeywords. Первому ключевому слову в сообщении будет соответствовать первое глобальное ключевое слово и т. д. Далее метод вызывает свою перегрузку JigPrompts.AcquireDistance(JigPromptDistanceOptions options), передавая в нее созданный экземпляр класса JigPromptDistanceOptions с присвоенными значениями свойств.
 Если список ключевых слов ошибочный или пустой, либо количество глобальных ключевых слов не совпадает с количеством отображаемых ключевых слов, то возникает событие System.ArgumentException.
 Набор отображаемых ключевых слов строки messageAndKeywords должен быть заключен в скобки: "[" в начале и "]" в конце. Сами ключевые слова должны быть отделены между собой символом "/". Каждое отображаемое в строке messageAndKeywords ключевое слово должно также быть представлено на той же позиции в строке globalKeywords.
 Пример
 В примере приведен отрывок кода из реализации метода Sampler() класса Jig.
C#
 Копировать Код
PromptDoubleResult result = prompts.AcquireDistance("Масштаб или Масштабировать с коэффициентом [УВЕЛИЧИТЬ1К2/УМЕНЬШИТЬ2К1]:", "Double Half");
Visual Basic
 Копировать Код
Dim result As PromptDoubleResult = prompts.AcquireDistance("Масштаб или Масштабировать с коэффициентом [УВЕЛИЧИТЬ1К2/УМЕНЬШИТЬ2К1]:", "Double Half")
 Ссылки
 JigPrompts Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!