Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.GetCurrentView()
 Послать отзыв
 Метод предоставляет ссылку на текущую активную конфигурацию вида (запись таблицы видов), или null, если получить вид не удалось.
 Синтаксис
C#
Visual Basic
Копировать Код
public ViewTableRecord GetCurrentView();
Копировать Код
Public Function GetCurrentView() As ViewTableRecord
 Возвращает
 Возвращает объект типа ViewTableRecord, представляющий текущий активный вид в чертеже. Если текущий вид не определён или произошла ошибка, возвращается null.
 Описание
 Метод используется для получения объекта ViewTableRecord, представляющего текущий активный вид в редакторе nanoCAD. Вид включает параметры отображения, такие как положение камеры, направление взгляда, окно просмотра и другие настройки, используемые при отрисовке чертежа. Метод может вернуть null, если активный вид недоступен или не установлен.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("GetCurrentViewExample")] public void GetCurrentViewExample() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Получаем именованный вид, установленный в данный момент ViewTableRecord currentView = editor.GetCurrentView(); // Если именованный вид установлен, выводим его название if (currentView!=null&&!String.IsNullOrEmpty(currentView.Name)) { editor.WriteMessage( $"\nТекущий вид: {currentView.Name}"); } else { editor.WriteMessage( "\nНе удалось получить текущий вид."); } } }
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!