Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.SelectImplied()
 Послать отзыв
 Метод возвращает набор объектов, выделенных пользователем до вызова команды, если таковые имеются.
 Синтаксис
C#
Visual Basic
Копировать Код
public PromptSelectionResult SelectImplied();
Копировать Код
Public Function SelectImplied() As PromptSelectionResult
 Возвращает
 Возвращает объект типа PromptSelectionResult, содержащий:
Status — статус выполнения (OK, Cancel, Error и др.). Если объекты были выделены ранее, статус равен PromptStatus.OK.
Value — объект типа SelectionSet, содержащий список идентификаторов (ObjectId) объектов из текущего выделения (если статус равен OK).
StringResult — строковое значение.
 Если предыдущее выделение отсутствует, Value может быть null.
 Описание
 Метод используется для получения текущего набора объектов, которые были предварительно выбраны пользователем в интерфейсе nanoCAD до начала выполнения команды. Это позволяет сохранить и использовать существующее выделение, вместо необходимости повторного выбора объектов. Если никакие объекты не были выделены заранее, результат может быть пустым или иметь статус Cancel.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("SelectImpliedExample")] public void SelectImpliedExample() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Вызываем метод PromptSelectionResult result = editor.SelectImplied(); // Выводим сообщение в командную строку if (result.Status == PromptStatus.OK) { SelectionSet selSet = result.Value; editor.WriteMessage( $"\nНайдено ранее выделенных объектов: {selSet.Count}"); } else { editor.WriteMessage( "\nНет предыдущего выделения."); } } }
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!