Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Событие Application.Idle
 Послать отзыв
 Событие, возникающее при переходе приложения в режим ожидания.
 Синтаксис
C#
Visual Basic
public event System.EventHandler Idle;
Public Event Idle As System.EventHandler
 Описание
 Событие возникает при переходе приложения nanoCAD в режим ожидания.
 Ссылки
 HostMgd.ApplicationServices.Application, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!