Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PointFilterEventArgs
 Послать отзыв
 Класс предоставляет данные для события PointFilter, происходящего при перемещении мыши в редакторе nanoCAD.
 Иерархия классов
HostMgd::EditorInput::PointFilterEventArgs
 Синтаксис
C#
Visual Basic
Копировать Код
public sealed class PointFilterEventArgs : EventArgs, IDisposable
Копировать Код
Public NotInheritable Class PointFilterEventArgs Inherits EventArgs Implements IDisposable
 Описание
 Класс наследуется от EventArgs и реализует интерфейс IDisposable. Он используется в связке с событием PointFilter редактора nanoCAD и предоставляет доступ к координатам точки, связанной с текущим положением мыши. Этот класс позволяет модифицировать точку ввода динамически — например, применять пользовательские привязки или ограничения во время интерактивных операций. Объект этого класса создаётся системой при каждом перемещении указателя и участвует в обработке фильтрации перед использованием точки в команде.
 Замечания
 Так как класс реализует IDisposable, его необходимо корректно освобождать после использования, особенно при работе с неуправляемыми ресурсами.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события PointFilter [Teigha.Runtime.CommandMethod("PointFilterExample")] public void PointFilterExample() { // Подписка на событие PointFilter editor.PointFilter += OnEditorPointFilter; } // Реализация отработки события PointFilter private void OnEditorPointFilter(object sender, PointFilterEventArgs e) { // Пример: принудительное выравнивание Y-координаты e.Context.ComputedPoint = new Point3d(e.Context.LastPoint.X, 0, e.Context.LastPoint.Z); } }
 Топики
 Имя
 Описание
 PointFilterEventArgs Свойства
 Ниже перечислены свойства класса PointFilterEventArgs.
 Ссылки
 PointFilterEventArgs Свойства, Топики, PointFilterEventArgs Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!