Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.GraphicsSystem.Manager.GetGUIDevice
 Послать отзыв
 Метод позволяет получить устройство, связанное с окном графического интерфейса nanoCAD.
 Синтаксис
C#
Visual Basic
Копировать Код
public Teigha.GraphicsSystem.Device GetGUIDevice();
Копировать Код
Public Function GetGUIDevice() As Teigha.GraphicsSystem.Device
 Возвращает
 Возвращает объект графического устройства. Тип Teigha.GraphicsSystem.Device.
 Описание
 Метод позволяет получить объект устройства, связанного с окном графического интерфейса nanoCAD, в котором отображается чертеж.
 Ссылки
 HostMgd.GraphicsSystem.Manager, HostMgd.GraphicsSystem
 Ваши комментарии по поводу этого топика: Послать отзыв!