Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PlotConfigManager.Devices
 Послать отзыв
 Свойство возвращает коллекцию объектов, описывающих устройства вывода в системе Только для чтения
 Синтаксис
C#
Visual Basic
public HostMgd::PlottingServices::PlotConfigInfoCollection Devices;
Public Property Devices() As HostMgd.PlottingServices.PlotConfigInfoCollection
 Ссылки
 PlotConfigManager Класс, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!