Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.PlotConfigInfoCollection.CopyTo
 Послать отзыв
 Метод предназначен для копирования элементов данной коллекции в указанный массив, начиная с заданной позиции в массиве.
 Синтаксис
C#
Visual Basic
Копировать Код
public void CopyTo( ref HostMgd.PlottingServices.PlotConfigInfo[] array, int index );
Копировать Код
Public Sub CopyTo( ByRef array() As HostMgd.PlottingServices.PlotConfigInfo, index As Integer )
 Параметры
 Параметры
 Описание
 array
 Целевой массив. Тип HostMgd.PlottingServices.PlotConfigInfo[].
 index
 Индекс позиции в массиве, начиная с которой в массив копируются элементы коллекции. Тип int. Нумерация индексов начинается с нуля.
 Описание
 Метод предназначен для копирования элементов данной коллекции в массив PlotConfigInfo[], начиная с позиции index в массиве.
 Ссылки
 HostMgd.PlottingServices.PlotConfigInfoCollection, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!