Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство TrayItemBubbleWindow.Text2
 Послать отзыв
 This is Text2, a member of class TrayItemBubbleWindow.
 Синтаксис
C#
Visual Basic
public System.String Text2;
Public Property Text2() As System.String
 Ссылки
 TrayItemBubbleWindow Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!