Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.TabbedDialogEventHandler(Object, TabbedDialogEventArgs)
 Послать отзыв
 Делегат используется для обработки событий, возникающих в диалоговых окнах с вкладками.
 Синтаксис
C#
Visual Basic
Копировать Код
public delegate void TabbedDialogEventHandler( Object sender, TabbedDialogEventArgs e );
Копировать Код
Public Delegate Sub TabbedDialogEventHandler( sender As Object, e As TabbedDialogEventArgs )
 Параметры
 Параметры
 Описание
 sender
 Объект, инициировавший событие. Тип Object.
 e
 Аргументы события. Тип TabbedDialogEventArgs.
 Описание
 Делегат TabbedDialogEventHandler используется классом TabbedDialogExtension для обработки событий в диалоговых окнах с вкладками, например, возникающих при нажатии кнопок. Контекст события передается через параметры sender и e, где e передает параметры и действия, относящиеся к событиям диалога с вкладками.
 Ваши комментарии по поводу этого топика: Послать отзыв!