Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.PreviewEndPlotInfo.PreviewEndPlotInfo
 Послать отзыв
 Конструктор по умолчанию класса PreviewEndPlotInfo. Не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public PreviewEndPlotInfo();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса PreviewEndPlotInfo. Не реализован.
 Ссылки
 HostMgd.PlottingServices.PreviewEndPlotInfo, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!