Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptPointOptionsEventArgs.Options
 Послать отзыв
 Свойство предоставляет доступ к параметрам приглашения, используемым при интерактивном вводе точки.
 Синтаксис
C#
Visual Basic
Копировать Код
public PromptPointOptions Options { get; }
Копировать Код
Public ReadOnly Property Options As PromptPointOptions
 Возвращает
 Возвращает объект типа PromptPointOptions, содержащий настройки команды ввода точки. Если параметры не были инициализированы, может вернуть null.
 Описание
 Свойство предназначено для получения объекта PromptPointOptions, который содержит параметры приглашения и настройки ввода точки при интерактивной команде — например, при вызове метода GetCorner() или GetPoint(). Оно позволяет программно изменять такие параметры, как:
сообщение приглашения (Message),
базовая точка (BasePoint),
режимы привязки (UseBasePoint, UseDashedLine),
разрешение на пропуск ввода (AllowNone) и другие.
 Это свойство особенно полезно при обработке событий PromptingForPoint и PromptingForCorner, где требуется динамически изменять поведение команды ввода точки в зависимости от контекста или состояния чертежа.
 Условия
 Только чтение
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события PromptingForCorner [Teigha.Runtime.CommandMethod("PromptingForCornerExample_Options")] public void PromptingForCornerExample_Options() { // Подписка на событие PromptingForCorner editor.PromptingForCorner += OnEditorPromptingForCorner; } // Реализация отработки события PromptingForCorner private void OnEditorPromptingForCorner(object sender, PromptPointOptionsEventArgs e) { // Изменение текста приглашения e.Options.Message = "Укажите второй угол прямоугольной области."; // Установка базовой точки e.Options.BasePoint = new Point3d(0, 0, 0); // Ограничение ввода только в первом квадранте e.Options.UseBasePoint = true; } }
 Ссылки
 HostMgd.EditorInput.PromptPointOptionsEventArgs, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!