Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.UpdateTiledViewportsFromDatabase()
 Послать отзыв
 Метод обновляет видовые экраны в текущем чертеже, используя сохранённые в базе данных настройки.
 Синтаксис
C#
Visual Basic
Копировать Код
public void UpdateTiledViewportsFromDatabase();
Копировать Код
Public Sub UpdateTiledViewportsFromDatabase()
 Описание
 Метод применяется для обновления конфигурации и параметров видовых экранов (viewport'ов), расположенных в пространстве листа (paper space), на основе данных, хранящихся в базе чертежа. Это позволяет восстановить или синхронизировать отображение видовых экранов после изменения их свойств или переключения между листами. Метод особенно полезен при работе с шаблонами чертежей или при программном управлении несколькими видовыми экранами.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("UpdateTiledViewportsFromDatabaseExample")] public void UpdateTiledViewportsFromDatabaseExample() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Вызываем метод editor.UpdateTiledViewportsFromDatabase(); // Вывод сообщения в командной строке editor.WriteMessage("\nВидовые экраны обновлены из базы данных."); } }
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!