Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод FenceSelectedSubObject.GetIntersectionPoints
 Послать отзыв
 Синтаксис
C#
Visual Basic
public array<HostMgd::EditorInput::PickPointDescriptor^> GetIntersectionPoints();
Public Function GetIntersectionPoints() As array<HostMgd.EditorInput.PickPointDescriptor^>
 Описание
 Возвращает массив точек линии, используемых для выбора объекта.
 Ссылки
 FenceSelectedSubObject Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!