Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.PromptingForAngle
 Послать отзыв
 Событие возникает при начале интерактивной операции ввода угла в редакторе nanoCAD, позволяя модифицировать параметры ввода перед его началом. Событие не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public event PromptAngleOptionsEventHandler PromptingForAngle;
Копировать Код
Public Event PromptingForAngle As PromptAngleOptionsEventHandler
 Описание
 Событие инициируется в момент запуска операции ввода угла — например, при вызове метода GetAngle(). Оно позволяет разработчикам надстроек nanoCAD обрабатывать или изменять параметры команды ввода угла, такие как сообщение, начальное значение, допустимые диапазоны и другие настройки, до того, как пользователь начнёт взаимодействовать с командой.
 Событие реализуется через делегат PromptAngleOptionsEventHandler, который передаёт объект PromptAngleOptionsEventArgs, содержащий:
параметры ввода угла (Options),
точку ввода (Point), если она уже определена,
контекст операции (Context).
 Это событие полезно при настройке поведения команды ввода угла в зависимости от контекста — например, для установки начального значения, задания ограничений или изменения сообщения приглашения.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события PromptingForAngle [Teigha.Runtime.CommandMethod("PromptingForAngleExample")] public void PromptingForAngleExample() { // Подписка на событие PromptingForAngle editor.PromptingForAngle += OnEditorPromptingForAngle; } // Реализация отработки события PromptingForAngle private void OnEditorPromptingForAngle(object sender, PromptAngleOptionsEventArgs e) { // Установить начальное значение угла e.Options.DefaultValue = Math.PI / 2; // 90 градусов // Установить сообщение e.Options.Message = "Введите угол поворота:"; } }
 Порядок работы с событием:
Вызывается метод GetAngle() или аналогичный.
Перед началом ввода генерируется событие PromptingForAngle.
Разработчик может изменить параметры команды в обработчике.
Пользователь вводит угол, и операция завершается событием PromptedForAngle.
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!