Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.InplaceTextEditor.InsertFile
 Послать отзыв
 Метод вставляет в данный редактор контент из указанного файла. В текущей версии не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public void InsertFile( ref System.String filename );
Копировать Код
Public Sub InsertFile( ByRef filename As System.String )
 Параметры
 Параметры
 Описание
 filename
 Входное имя вставляемого файла. Тип System.String.
 Описание
 Метод вставляет в данный редактор контент из файла с именем filename. В текущей версии не реализован.
 Ссылки
 HostMgd.ApplicationServices.InplaceTextEditor, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!