Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Класс HostMgd.EditorInput.PickPointSelectedSubObject
 Послать отзыв
 Иерархия классов
HostMgd::EditorInput::SelectedSubObject HostMgd::EditorInput::PickPointSelectedSubObject
 Синтаксис
C#
Visual Basic
public class PickPointSelectedSubObject : SelectedSubObject;
Public Class PickPointSelectedSubObject Inherits SelectedSubObject
 Описание
 Класс, описывающий объект, выбранный методом выбора по точке выбора.
 Методы
 Конструкторы
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 SelectedSubObject
 (Унаследован от SelectedSubObject)
 Класс HostMgd.EditorInput.PickPointSelectedSubObject
 Имя
 Описание
 PickPointSelectedSubObject
 Топики
 Имя
 Описание
 SelectedSubObject Методы
 Ниже перечислены методы класса SelectedSubObject.
 SelectedSubObject Свойства
 Ниже перечислены свойства класса SelectedSubObject.
 Класс HostMgd.EditorInput.PickPointSelectedSubObject
 Имя
 Описание
 PickPointSelectedSubObject Методы
 Ниже перечислены методы класса PickPointSelectedSubObject.
 PickPointSelectedSubObject Свойства
 Ниже перечислены свойства класса PickPointSelectedSubObject.
 Ссылки
 PickPointSelectedSubObject Методы, PickPointSelectedSubObject Свойства, Методы, Топики, SelectedSubObject Методы, SelectedSubObject Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!