Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptPointOptions.PromptPointOptions(string,string)
 Послать отзыв
 Конструктор инициализирует новый экземпляр класса с заданным сообщением, локальными ключевыми словами и глобальными ключевыми словами.
 Синтаксис
C#
Visual Basic
Копировать Код
public PromptPointOptions(string messageAndKeywords, string globalKeywords);
Копировать Код
Public Sub New(messageAndKeywords As String, globalKeywords As String)
 Параметры
 Параметры
 Описание
 messageAndKeywords
 Сообщение приглашения, которое может содержать встроенные локальные ключевые слова в квадратных скобках.
 globalKeywords
 Строка, содержащая глобальные ключевые слова, которые доступны на протяжении всей команды. Количество глобальных ключевых слов должно совпадать с количеством ключевых слов в приглашающем сообщении messageAndKeywords. Ключевые слова в строке globalKeywords должны отделяться друг от друга одним пробелом.
 Пример
 "Укажите точку [по центру/по краю]:". Тип string "Center Left Right" Тип string
 Описание
 Конструктор создаёт объект PromptPointOptions, который используется для настройки интерактивного ввода точки с поддержкой ключевых слов. Он позволяет задать:
сообщение приглашения , в которое можно включить локальные ключевые слова в формате [Ключ1/Ключ2/Ключ3] (например, "Укажите точку [по сетке/по объекту]:"),
глобальные ключевые слова , которые доступны в любой момент ввода и не зависят от контекста.
 Этот конструктор особенно полезен при реализации команд, где пользователь может выбрать между несколькими режимами ввода точки или прервать операцию, используя заранее заданные команды.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; [Teigha.Runtime.CommandMethod("PromptPointOptionsExample_string_string")] public void PromptPointOptionsExample_string_string() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создаём запрос пользователю PromptPointOptions options = new PromptPointOptions("Укажите точку [Отмена/Выход]:", "Cancel Exit"); PromptPointResult result = editor.GetPoint(options); // Если все данные введены, выводим результат в командную строку if (result.Status == PromptStatus.OK) { Point3d pt = result.Value; editor.WriteMessage( $"\nВыбранная точка: {pt}"); } else if (result.Status == PromptStatus.Keyword) { editor.WriteMessage($"\nВведено ключевое слово: {result.StringResult}"); } else { editor.WriteMessage( "\nВвод точки отменен или произошла ошибка."); } }
 Ссылки
 HostMgd.EditorInput.PromptPointOptions, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!