Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptNestedEntityResultEventArgs.Result
 Послать отзыв
 Свойство предоставляет доступ к результату операции выбора вложенного геометрического объекта, включая идентификатор объекта и точку выбора.
 Синтаксис
C#
Visual Basic
Копировать Код
public PromptNestedEntityResult Result { get; }
Копировать Код
Public ReadOnly Property Result As PromptNestedEntityResult
 Возвращает
 Возвращает экземпляр класса PromptNestedEntityResult, содержащий:
Status — статус выполнения операции ввода.
ObjectId — идентификатор выбранного вложенного объекта.
PickedPoint — точка, в которой пользователь указал на объект.
Transform — матрица преобразования, применённая к объекту внутри блока.
StringResult — строковое значение, если выбор был прерван клавиатурным вводом.
 Если операция не была успешно завершена, результат может содержать null или недопустимые значения.
 Описание
 Свойство возвращает объект типа PromptNestedEntityResult, который содержит данные о завершённой операции выбора вложенного объекта — например, после вызова метода GetNestedEntity() или при обработке события PromptedForNestedEntity. Оно позволяет получить:
статус операции (OK, Cancel, Error и др.),
идентификатор выбранного объекта (ObjectId),
точку выбора (Point3d) в мировой системе координат (WCS),
матрицу преобразования блока , если объект находится внутри блока.
 Это свойство используется для анализа результата и дальнейшей работы с вложенным элементом чертежа. Доступно только для чтения и автоматически обновляется после завершения интерактивной команды.
 Условия
 Только чтение
 Ссылки
 HostMgd.EditorInput.PromptNestedEntityResultEventArgs, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!