Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptKeywordOptionsEventArgs.Options
 Послать отзыв
 Свойство предоставляет доступ к параметрам приглашения, используемым при вводе ключевого слова.
 Синтаксис
C#
Visual Basic
Копировать Код
public PromptKeywordOptions Options { get; }
Копировать Код
Public ReadOnly Property Options As PromptKeywordOptions
 Возвращает
 Возвращает объект типа PromptKeywordOptions. Если параметры не были инициализированы, может вернуть null.
 Описание
 Свойство содержит настройки, применяемые к операции ввода ключевого слова — например, при вызове метода GetString() с заданными ключевыми словами. Оно используется в обработчике события PromptingForKeyword, чтобы дать разработчику возможность изменить параметры ввода до начала взаимодействия с пользователем.
 Через это свойство можно:
изменить текст приглашения (Message),
добавить или удалить ключевые слова через Keywords,
задать глобальные ключевые слова,
настроить поведение ввода (например, требуется ли выбор).
 Условия
 Только чтение
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события PromptingForKeyword [Teigha.Runtime.CommandMethod("PromptingForKeywordExample_Options")] public void PromptingForKeywordExample_Options() { // Подписка на событие PromptingForKeyword editor.PromptingForKeyword += OnEditorPromptingForKeyword; } // Реализация отработки события PromptingForKeyword private void OnEditorPromptingForKeyword(object sender, PromptKeywordOptionsEventArgs e) { // Изменение сообщения e.Options.Message = "Выберите действие:"; // Добавление ключевых слов e.Options.Keywords.Add("Включить"); e.Options.Keywords.Add("Отключить"); e.Options.Keywords.Add("По умолчанию"); } }
 Ссылки
 HostMgd.EditorInput.PromptKeywordOptionsEventArgs, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!