Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство TrayItemCollection.SyncRoot
 Послать отзыв
 This is SyncRoot, a member of class TrayItemCollection.
 Синтаксис
C#
Visual Basic
public Object SyncRoot;
Public Property SyncRoot() As Object
 Ссылки
 TrayItemCollection Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!