Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.DocumentCollection.DocumentToBeActivated
 Послать отзыв
 Событие, возникающее перед активацией документа.
 Синтаксис
C#
Visual Basic
public event DocumentCollectionEventHandler DocumentToBeActivated;
Public Event DocumentToBeActivated As DocumentCollectionEventHandler
 Возвращает
 Возвращает тип данных HostMgd.ApplicationServices.DocumentCollectionEventHandler
 Описание
 Событие, генерируемое перед активацией документа.
 Соответствует функции NRX API HostApDocManagerReactor.documentToBeActivated().
 Ссылки
 HostMgd.ApplicationServices.DocumentCollection, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!