Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptDistanceOptions.PromptDistanceOptions(string)
 Послать отзыв
 Конструктор инициализирует новый экземпляр класса с заданным приглашающим сообщением для ввода расстояния.
 Синтаксис
C#
Visual Basic
Копировать Код
public PromptDistanceOptions(string message);
Копировать Код
Public Sub New(message As String)
 Параметры
 Параметры
 Описание
 message
 Текст приглашения, выводимый в командной строке перед началом ввода расстояния. Может содержать инструкции или запрос к пользователю. Тип string
 Описание
 Конструктор создаёт объект класса PromptDistanceOptions, используемый при настройке интерактивного ввода расстояния — например, через метод GetDistance(). Он устанавливает текст приглашения, отображаемый пользователю в командной строке, а все остальные параметры (такие как DefaultValue, LowerLimit, AllowNone) инициализируются значениями по умолчанию. После создания объекта эти параметры можно дополнительно настроить в зависимости от требований команды.
 Этот конструктор является основным способом задания начального сообщения, которое подсказывает пользователю, что нужно сделать — например, "Введите длину:" или "Укажите расстояние смещения:".
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { [Teigha.Runtime.CommandMethod("PromptDistanceOptionsExample_String")] public void PromptDistanceOptionsExample_String() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создаём запрос пользователю PromptDistanceOptions options = new PromptDistanceOptions("\nВведите расстояние:"); // Устанавливаем значение по умолчанию и разрешаем использовать его options.DefaultValue = 100.0; options.UseDefaultValue = true; // Разрешаем использовать Enter, не вводя значений. // В этом случае применится значение по умолчанию options.AllowNone = true; PromptDoubleResult result = editor.GetDistance(options); // Если данные введены, выводим результат в командную строку if (result.Status == PromptStatus.OK) { double distance = result.Value; editor.WriteMessage( $"\nВведено расстояние: {distance}"); } } }
 Ссылки
 HostMgd.EditorInput.PromptDistanceOptions, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!