Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.InplaceTextEditor.Annotative
 Послать отзыв
 Свойство Annotative позволяет определить аннотативное состояние данного текстового редактора. В текущей версии не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool Annotative;
Копировать Код
Public Property Annotative As Boolean
 Возвращает
 Возвращает true, если текстовый редактор находится в аннотативном состоянии. В противном случае возвращает false.
 Описание
 Свойство Annotative позволяет определить аннотативное состояние данного текстового редактора. В текущей версии не реализовано.
 Условия
 Чтение и запись.
 Ссылки
 HostMgd.ApplicationServices.InplaceTextEditor, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!