Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод EPlotPropertyCollection.Add
 Послать отзыв
 This is Add, a member of class EPlotPropertyCollection.
 Синтаксис
C#
Visual Basic
public void Add(ref HostMgd::Publishing::EPlotProperty value);
Public Sub Add(ByRef value As HostMgd.Publishing.EPlotProperty)
 Ссылки
 EPlotPropertyCollection Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!