Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptSelectionOptions.UnknownInput
 Послать отзыв
 Событие возникает, когда пользователь вводит произвольный текст, не совпадающий с ключевыми словами, в ответ на приглашение выбора объектов.
 Синтаксис
C#
Visual Basic
Копировать Код
public event SelectionTextInputEventHandler UnknownInput;
Копировать Код
Public Event UnknownInput As SelectionTextInputEventHandler
 Описание
 Событие инициируется при операции выбора объектов — например, при вызове GetSelection() — если пользователь вводит строку, которая не распознана как ключевое слово, команда или допустимое значение. Вместо отклонения ввода, система вызывает это событие, позволяя разработчику обработать текст программно.
 Оно реализуется через делегат SelectionTextInputEventHandler и предоставляет доступ к:
введённой строке (Input),
возможности пометить ввод как обработанный (Handled = true),
управлению дальнейшим поведением команды.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { // Метод команды, которая отслеживает появление события UnknownInput [Teigha.Runtime.CommandMethod("PromptSelectionOptionsExample_UnknownInput")] public void PromptSelectionOptionsExample_UnknownInput() { // Создаём набор параметров для запроса PromptSelectionOptions options = new PromptSelectionOptions(); options.MessageForAdding = "Выберите линии для объединения:"; // Подписка на событие UnknownInput options.UnknownInput += OnEditorUnknownInput; // Фильтр: только объекты типа Line TypedValue[] filterList = new TypedValue[] { new TypedValue((int)DxfCode.Start, "LINE") }; SelectionFilter filter = new SelectionFilter(filterList); // Создаём запрос пользователю PromptSelectionResult result = editor.GetSelection(options, filter); // Если все данные введены, выводим результат в командную строку if (result.Status == PromptStatus.OK) { SelectionSet selSet = result.Value; editor.WriteMessage( $"\nВыбрано объектов: {selSet.Count}"); } else { editor.WriteMessage( "\nНе удалось получить выделение."); } } // Метод, реализующий отработку события UnknownInput private void OnEditorUnknownInput(object sender, SelectionTextInputEventArgs e) { // Получаем доступ к результату ввода string input = e.Input; // Попытка интерпретировать ввод как имя слоя // if (LayerExists(input)) /* Метод LayerExists() считывает коллекцию слоёв документа и проверяет, нет ли слоя с таким названием */ // { // SelectObjectsByLayer(input); /* Если слой с таким названием есть, автоматически выбираются все объекты этого слоя */ // } // Проверка ввода по шаблону поиска // else if (input.Contains("*") || input.Contains("?")) /* Если введённый текст содержит определённые символы, то происходит поиск объектов по определённым признакам */ // { // SelectObjectsByNamePattern(input); /* Метод ищет в документе объекты по определённому признаку */ // } } }
 Порядок работы с событием:
Пользователь вызывает команду выбора объектов.
Вводит текст, не являющийся ключевым словом.
Генерируется событие UnknownInput.
Разработчик анализирует ввод и при необходимости выполняет действия.
Устанавливает e.Handled = true, чтобы предотвратить стандартную ошибку ввода.
 Ссылки
 HostMgd.EditorInput.PromptSelectionOptions, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!