Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 JigPromptAngleOptions.JigPromptAngleOptions(String)
 Послать отзыв
 Конструктор класса с одним параметром.
 Синтаксис
C#
Visual Basic
public JigPromptAngleOptions(ref System.String message);
Public Sub New(ByRef message As System.String)
 Параметры
 Параметры
 Описание
 message
 Текстовое сообщение, приглашающее указать угол для дальнейших действий с объектом или группой объектов.
 Описание
 Конструктор класса. Присваивает свойству Message значение параметра message. Также конструктор устанавливает значение свойства Cursor равное CursorType.Crosshair (перекрестие).
 Пример
C#
 Копировать Код
 JigPromptAngleOptions angleOptions = new JigPromptAngleOptions("Угол поворота:");
Visual Basic
 Копировать Код
 Dim angleOptions As JigPromptAngleOptions = New JigPromptAngleOptions("Угол поворота:")
 Ссылки
 HostMgd.EditorInput.JigPromptAngleOptions, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!