Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Класс HostMgd.Windows.OpenFileDialog
 Послать отзыв
 Диалог открытия файла или выбора папки
 Иерархия классов
HostMgd::Windows::OpenFileDialog
 Синтаксис
C#
Visual Basic
public class OpenFileDialog;
Public Class OpenFileDialog
 Методы
 Конструкторы
 Имя
 Описание
 OpenFileDialog
 Конструктор класса
 Топики
 Имя
 Описание
 OpenFileDialog Перечисления
 Ниже перечислены перечисления класса OpenFileDialog.
 OpenFileDialog Методы
 Ниже перечислены методы класса OpenFileDialog.
 OpenFileDialog Свойства
 Ниже перечислены свойства класса OpenFileDialog.
 Ссылки
 OpenFileDialog Перечисления, OpenFileDialog Методы, OpenFileDialog Свойства, Методы, Топики, OpenFileDialog Перечисления, OpenFileDialog Методы, OpenFileDialog Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!