Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.DsdEntry
 Послать отзыв
 Класс DsdEntry представляет информацию для настройки публикации листа в составе подшивки листов. В текущей версии не реализован.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject HostMgd::PlottingServices::DsdEntry
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("AcPlDSDEntry")] public class DsdEntry : RXObject
Копировать Код
<Wrapper("AcPlDSDEntry")> Public Class DsdEntry Inherits RXObject
 Описание
 Класс DsdEntry представляет информацию для настройки публикации листа в составе подшивки листов. Коллекция объектов DsdEntry входит в объект HostMgd.PlottingServices.DsdData, который используется для настройки процесса публикации подшивок.
 В текущей версии не реализован.
 Методы
 Конструкторы
 HostMgd.PlottingServices.DsdEntry
 Имя
 Описание
 DsdEntry
 Конструктор по умолчанию класса DsdEntry. Не реализован.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 HostMgd.PlottingServices.DsdEntry
 Имя
 Описание
 DsdEntry Методы
 Ниже перечислены методы класса DsdEntry.
 DsdEntry Свойства
 Ниже перечислены свойства класса DsdEntry.
 Ссылки
 DsdEntry Методы, DsdEntry Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!