Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.CrossingOrWindowSelectedObject.GetPickPoints()
 Послать отзыв
 Синтаксис
C#
Visual Basic
public array<HostMgd::EditorInput::PickPointDescriptor^> GetPickPoints();
Public Function GetPickPoints() As array<HostMgd.EditorInput.PickPointDescriptor^>
 Описание
 Метод возвращает массив базовых точек, используемых для выбора объекта.
 Ссылки
 HostMgd.EditorInput.CrossingOrWindowSelectedObject, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!