Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptIntegerOptions.LowerLimit
 Послать отзыв
 Свойство возвращает или устанавливает минимально допустимое значение, которое пользователь может ввести при интерактивной команде.
 Синтаксис
C#
Visual Basic
Копировать Код
public int LowerLimit { get; set; }
Копировать Код
Public Property LowerLimit As Integer
 Возвращает
 Возвращает значение типа int, представляющее минимально допустимое значение для ввода.
 Описание
 Свойство используется для задания нижней границы допустимого диапазона значений при вводе целого числа — например, через метод GetInteger(). Если пользователь введёт число меньше этого значения, система отклонит ввод и может выдать сообщение об ошибке или запросить ввод повторно.
 Это свойство позволяет обеспечить корректность ввода, ограничивая возможные значения снизу — например, при вводе количества копий, номера слоя или параметра, который не может быть меньше определённого значения.
 ВАЖНО! Свойство LowerLimit работает совместно с UpperLimit. Если LowerLimit больше UpperLimit, поведение команды может быть некорректным.
 Условия
 Чтение и запись
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("PromptIntegerOptions_LowerLimit")] public void PromptIntegerOptions_LowerLimit() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создаём запрос пользователю PromptIntegerOptions options = new PromptIntegerOptions("Введите количество копий:"); // Значение по умолчанию options.DefaultValue = 1; // Разрешить нажатие Enter options.AllowNone = true; // Минимальное допустимое значение options.LowerLimit = 1; // Максимальное допустимое значение options.UpperLimit = 99; // Вызываем метод GetInteger() для запроса пользователю PromptIntegerResult ipr = editor.GetInteger(options); // Если все данные введены, выводим результат в командную строку if (PromptStatus.OK == ipr.Status) { editor.WriteMessage("\nКоличество копий: " + ipr.Value); } else { editor.WriteMessage("\nОтмена или ошибка ввода."); } } }
 Ссылки
 HostMgd.EditorInput.PromptIntegerOptions, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!