Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptForSelectionEndingEventArgs.Add(SelectedObject)
 Послать отзыв
 Метод добавляет указанный геометрический объект к текущему набору выделенных объектов.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Add(SelectedObject value);
Копировать Код
Public Sub Add(value As SelectedObject)
 Параметры
 Параметры
 Описание
 value
 Объект, представляющий геометрический элемент, который необходимо добавить в текущую выборку. Может содержать информацию о типе объекта, его идентификаторе и точке выбора. Тип SelectedObject
 Описание
 Метод используется для программного добавления объекта в набор выбранных элементов. Это позволяет формировать или изменять выборку перед выполнением массовых операций, таких как удаление, перемещение или изменение свойств группы объектов. Метод принимает объект типа SelectedObject, который содержит ссылку на идентификатор (ObjectId) и дополнительные данные о подобъекте.
 Замечания
 Этот метод часто применяется внутри обработчиков событий, таких как PromptForSelectionEnding, чтобы динамически управлять составом выделенных объектов.
 Пример
C#
 Копировать Код
SelectedObject selObj = new SelectedObject(promptResult.Value,null); editor.PromptForSelectionEnding += (s, e) => { e.Add(selObj); };
 Ссылки
 HostMgd.EditorInput.PromptForSelectionEndingEventArgs, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!