Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Класс HostMgd.EditorInput.SelectionSet
 Послать отзыв
 Иерархия классов
HostMgd::EditorInput::SelectionSet
 Синтаксис
C#
Visual Basic
[System.Reflection.DefaultMemberAttribute("Item")] public class SelectionSet : System.Collections.ICollection;
<System.Reflection.DefaultMemberAttribute("Item")> Public Class SelectionSet Inherits System.Collections.ICollection
 Описание
 Класс представляет собой колекцию объектов, обычно выбираемых пользователем
 Методы
 Конструкторы
 Имя
 Описание
 SelectionSet
 Топики
 Имя
 Описание
 SelectionSet Методы
 Ниже перечислены методы класса SelectionSet.
 SelectionSet Свойства
 Ниже перечислены свойства класса SelectionSet.
 Ссылки
 SelectionSet Методы, SelectionSet Свойства, Методы, Топики, SelectionSet Методы, SelectionSet Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!