Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.MergeStatus
 Послать отзыв
 Данное перечисление определяет флаги несоответствий между валидированными настройками печати и настройками печати объекта листа после успешного завершения валидации методом PlotInfoValidator.Validate().
 Синтаксис
C#
Visual Basic
Копировать Код
public enum MergeStatus { NoChanges = 0x0, PlotConfigurationName = 0x1, PlotPaperMargins = 0x2, PlotPaperSize = 0x4, CanonicalMediaName = 0x8, PlotOrigin = 0x10, PlotPaperUnits = 0x20, PlotViewportBorders = 0x40, PlotPlotStyles = 0x80, ShowPlotStyles = 0x100, PlotRotation = 0x200, PlotCentered = 0x400, PlotHidden = 0x800, ShadePlot = 0x1000, ShadePlotResLevel = 0x2000, ShadePlotCustomDpi = 0x4000, PlotType = 0x8000, PlotWindowArea = 0x10000, PlotViewName = 0x20000, Scale = 0x40000, CurrentStyleSheet = 0x80000, ScaleLineWeights = 0x100000, PrintLineWeights = 0x200000, DrawViewportsFirst = 0x400000, PlotTransparency = 0x800000 }
Копировать Код
Public Enum MergeStatus NoChanges = 0x0 PlotConfigurationName = 0x1 PlotPaperMargins = 0x2 PlotPaperSize = 0x4 CanonicalMediaName = 0x8 PlotOrigin = 0x10 PlotPaperUnits = 0x20 PlotViewportBorders = 0x40 PlotPlotStyles = 0x80 ShowPlotStyles = 0x100 PlotRotation = 0x200 PlotCentered = 0x400 PlotHidden = 0x800 ShadePlot = 0x1000 ShadePlotResLevel = 0x2000 ShadePlotCustomDpi = 0x4000 PlotType = 0x8000 PlotWindowArea = 0x10000 PlotViewName = 0x20000 Scale = 0x40000 CurrentStyleSheet = 0x80000 ScaleLineWeights = 0x100000 PrintLineWeights = 0x200000 DrawViewportsFirst = 0x400000 PlotTransparency = 0x800000 End Enum
 Члены
 Члены
 Описание
 CanonicalMediaName
 Значение: 8 (0x8). Отличается имя канонического носителя.
 CurrentStyleSheet
 Значение: 524288 (0x80000). Отличается текущая таблица стилей.
 DrawViewportsFirst
 Значение: 4194304 (0x400000). Отличается настройка приоритета видовых экранов при выводе на печать.
 NoChanges
 Значение: 0 (0x0). Несоответствия настроек печати и параметров листа отсутствуют.
 PlotCentered
 Значение: 1024 (0x400). Отличаются настройки центрирования при печати.
 PlotConfigurationName
 Значение: 1 (0x1). Отличается имя конфигурации печати.
 PlotHidden
 Значение: 2048 (0x800). Отличается настройка вывода на печать скрытых линий.
 PlotOrigin
 Значение: 16 (0x10). Отличается начало координат для вывода на печать.
 PlotPaperMargins
 Значение: 2 (0x2). Отличаются поля области печати.
 PlotPaperSize
 Значение: 4 (0x4). Отличается размер бумаги.
 PlotPaperUnits
 Значение: 32 (0x20). Отличаются единицы измерения бумажного носителя.
 PlotPlotStyles
 Значение: 128 (0x80). Отличаются настройки стилей печати.
 PlotRotation
 Значение: 512 (0x200). Отличается настройка разворота чертежа при печати.
 PlotTransparency
 Значение: 8388608 (0x800000). Отличается настройка прозрачности при печати.
 PlotType
 Значение: 32768 (0x8000). Отличается тип вывода на печать.
 PlotViewName
 Значение: 131072 (0x20000). Область печати определяется видом (View), но имя вида отличается.
 PlotViewportBorders
 Значение: 64 (0x40). Отличаются границы видового экрана области печати.
 PlotWindowArea
 Значение: 65536 (0x10000). Область печати задана окном (Window), но окно отличается.
 PrintLineWeights
 Значение: 2097152 (0x200000). Отличаются веса линий.
 Scale
 Значение: 262144 (0x40000). Отличаются масштабы вывода на печать.
 ScaleLineWeights
 Значение: 1048576 (0x100000). Отличаются настройки масштабирования весов линий.
 ShadePlot
 Значение: 4096 (0x1000). Отличаются настройки тонирования при печати.
 ShadePlotCustomDpi
 Значение: 16384 (0x4000). Отличается разрешение в точках на дюйм (DPI) при тонировании.
 ShadePlotResLevel
 Значение: 8192 (0x2000). Отличаются уровни разрешения при тонировании (высокое/низкое).
 ShowPlotStyles
 Значение: 256 (0x100). Отличается настройка использования стилей печати.
 Описание
 Перечисление MergeStatus определяет флаги несоответствий между валидированными настройками печати и настройками печати объекта листа после успешного завершения валидации методом PlotInfoValidator.Validate().
 Ваши комментарии по поводу этого топика: Послать отзыв!