Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Runtime.IMenuItem.Items
 Послать отзыв
 Свойство Items представляет коллекцию объектов IMenuItem, связанных с данным элементом меню.
 Синтаксис
C#
Visual Basic
Копировать Код
Collections.Generic.IEnumerable<IMenuItem> Items;
Копировать Код
ReadOnly Property Items As Collections.Generic.IEnumerable(Of IMenuItem)
 Возвращает
 Возвращает коллекцию объектов IMenuItem. Тип Collections.Generic.IEnumerable.
 Описание
 Свойство Items представляет коллекцию объектов IMenuItem, связанных с данным элементом меню.
 Условия
 Только чтение.
 Ссылки
 MenuItem Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!