Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод DocumentIterator.Reset
 Послать отзыв
 Синтаксис
C#
Visual Basic
public void Reset();
Public Sub Reset()
 Описание
 Установка указателя по коллекции в первоначальную позицию, перед первым документом.
 Ссылки
 DocumentIterator Класс, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!