Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PromptNumericalOptions.AllowArbitraryInput
 Послать отзыв
 Синтаксис
C#
Visual Basic
public bool AllowArbitraryInput;
Public Property AllowArbitraryInput() As bool
 Описание
 –азрешить произвольный ввод.
 Ссылки
 PromptNumericalOptions Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!