Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.Windows.ToolPalette.CustomToolBase.GetDisplayName
 Послать отзыв
 Метод предоставляет альтернативное или локализованное имя для свойства с заданным идентификатором. Не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void GetDisplayName( int dispatchId, ref System.String propertyName );
Копировать Код
Public Overridable Sub GetDisplayName( dispatchId As Integer, ByRef propertyName As System.String )
 Параметры
 Параметры
 Описание
 dispatchId
 Диспетчерский идентификатор свойства. Тип int.
 propertyName
 Имя свойства. Тип System.String.
 Описание
 Метод предоставляет альтернативное или локализованное имя для свойства с заданным идентификатором dispatchId. Эта строка переопределит имя свойства в информации о типе объекта.
 В текущей версии не реализован.
 Ссылки
 HostMgd.Windows.ToolPalette.CustomToolBase, HostMgd.Windows.ToolPalette
 Ваши комментарии по поводу этого топика: Послать отзыв!