Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Класс HostMgd.Windows.TrayItemBubbleWindowClosedEventArgs
 Послать отзыв
 This is class HostMgd::Windows::TrayItemBubbleWindowClosedEventArgs.
 Иерархия классов
HostMgd::Windows::TrayItemBubbleWindowClosedEventArgs
 Синтаксис
C#
Visual Basic
public class TrayItemBubbleWindowClosedEventArgs : System.EventArgs;
Public Class TrayItemBubbleWindowClosedEventArgs Inherits System.EventArgs
 Методы
 Конструкторы
 Имя
 Описание
 TrayItemBubbleWindowClosedEventArgs
 This is TrayItemBubbleWindowClosedEventArgs, a member of class TrayItemBubbleWindowClosedEventArgs.
 Топики
 Имя
 Описание
 TrayItemBubbleWindowClosedEventArgs Свойства
 Ниже перечислены свойства класса TrayItemBubbleWindowClosedEventArgs.
 Ссылки
 TrayItemBubbleWindowClosedEventArgs Свойства, Методы, Топики, TrayItemBubbleWindowClosedEventArgs Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!