Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.Document.LispWillStart
 Послать отзыв
 Событие, возникающее перед началом выполнения lisp выражения в документе.
 Синтаксис
C#
Visual Basic
public event LispWillStartEventHandler LispWillStart;
Public Event LispWillStart As LispWillStartEventHandler
 Возвращает
 Возвращает тип данных LispWillStartEventHandler
 Описание
 Событие, возникающее перед началом выполнения lisp выражения в документе. Соответствует функции NRX API HostEditorReactor.lispWillStart().
 Ссылки
 HostMgd.ApplicationServices.Document, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!