Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Класс HostMgd.Windows.Menu
 Послать отзыв
 Абстрактный класс меню.
 Иерархия классов
HostMgd::Windows::Menu
 Синтаксис
C#
Visual Basic
public class Menu;
Public Class Menu
 Описание
 Имеет единственное свойство - коллекцию строк меню
 Топики
 Имя
 Описание
 Menu Свойства
 Ниже перечислены свойства класса Menu.
 Ссылки
 Menu Свойства, Топики, Menu Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!