Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptKeywordOptions.PromptKeywordOptions(string,string)
 Послать отзыв
 Конструктор инициализирует новый экземпляр класса, задавая сообщение с локальными ключевыми словами и список глобальных ключевых слов.
 Синтаксис
C#
Visual Basic
Копировать Код
public PromptKeywordOptions(string messageAndKeywords, string globalKeywords);
Копировать Код
Public Sub New(messageAndKeywords As String, globalKeywords As String)
 Параметры
 Параметры
 Описание
 messageAndKeywords
 Строка, содержащая сообщение и список локальных ключевых слов в формате: "сообщение [ключ1/ключ2/ключN]".
 globalKeywords
 Строка, содержащая глобальные ключевые слова, разделённые пробелом. Эти команды доступны в любой момент ввода.
 Пример
 "Продолжить? [Да/Нет]". Тип string "Отмена Выход Повтор". Тип string
 Описание
 Конструктор создаёт объект класса PromptKeywordOptions, используемый для настройки диалога ввода ключевого слова. Он позволяет одновременно задать:
текст приглашения и список локальных ключевых слов , объединённые в одной строке,
глобальные ключевые слова , доступные независимо от контекста.
 Формат параметра messageAndKeywords предполагает, что ключевые слова передаются в квадратных скобках: "Выберите действие [Да/Нет/Отмена]". Эти слова автоматически добавляются в коллекцию Keywords. Параметр globalKeywords содержит строку с глобальными командами, разделёнными пробелом, такими как "Выход Отмена Повтор", которые остаются доступными в любой момент ввода.
 Этот конструктор удобен при создании диалогов с заранее известными вариантами выбора и системными командами.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("PromptKeywordOptionsExample_string_string")] public void PromptKeywordOptionsExample_string_string() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создаём запрос пользователю PromptKeywordOptions options = new PromptKeywordOptions( "Выберите режим [Точный/Быстрый/По умолчанию]", "Accurate Fast Default"); // Вызываем метод GetKeywords() для запроса пользователю PromptResult pr = editor.GetKeywords(options); // Если все данные введены, выводим результат в командную строку if (pr.Status == PromptStatus.Keyword) { editor.WriteMessage($"\nВыбрано: {pr.StringResult}"); } else { editor.WriteMessage("\nОперация отменена."); } } }
 Ссылки
 HostMgd.EditorInput.PromptKeywordOptions, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!