Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство WhoHasInfo.ComputerName
 Послать отзыв
 Синтаксис
C#
Visual Basic
public System.String ComputerName;
Public Property ComputerName() As System.String
 Описание
 Имя компьютера, используемое при редактировании чертежа, если файл открыт на редактирование.
 Условия
 Только на чтение
 Ссылки
 WhoHasInfo Структура, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!