Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PlotProgress.PlotProgressPos
 Послать отзыв
 Позиция индикатора печати
 Синтаксис
C#
Visual Basic
public int PlotProgressPos;
Public Property PlotProgressPos() As Integer
 Ссылки
 PlotProgress Класс, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!