Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 JigPromptPointOptions.JigPromptPointOptions(String,String)
 Послать отзыв
 Конструктор класса с двумя параметрами.
 Синтаксис
C#
Visual Basic
public JigPromptPointOptions(ref System.String messageAndKeywords, ref System.String globalKeywords);
Public Sub New(ByRef messageAndKeywords As System.String, ByRef globalKeywords As System.String)
 Параметры
 Параметры
 Описание
 messageAndKeywords
 Cтрока, содержащая в себе сообщение запроса точки и ключевые слова к нему, которые будут выводиться на экране при запросе данных. Набор отображаемых ключевых слов строки messageAndKeywords должен быть заключен в скобки: "[" в начале и "]" в конце. Сами ключевые слова должны быть отделены между собой символом "/". Каждое отображаемое в строке messageAndKeywords ключевое слово должно также быть представлено на той же позиции в строке globalKeywords.
 globalKeywords
 Строка,содержащая в себе глобальные ключевые слова. Количество глобальных ключевых слов должно совпадать с количеством ключевых слов в приглашающем сообщении messageAndKeywords. Ключевые слова в строке globalKeywords должны отделяться друг от друга одним пробелом.
 Описание
 Конструктор класса. Присваивает свойству Message значение параметра messageAndKeywords, выделяет из этого параметра ключевые слова, записывает их в свойство Keywords как KeywordCollection вместе с глобальными ключевыми словами из параметра globalKeywords. Первому ключевому слову в сообщении будет соответствовать первое глобальное ключевое слово и т. д. Также конструктор устанавливает значение свойства Cursor равное CursorType.Crosshair (перекрестие).
 Пример
C#
 Копировать Код
 JigPromptPointOptions pointOptions = new JigPromptPointOptions("Переместить или Переместить в [НачалоКоординат/ЦентрЛиста]:", "Origin Center");
Visual Basic
 Копировать Код
 Dim pointOptions As JigPromptPointOptions = New JigPromptPointOptions("Переместить или Переместить в [НачалоКоординат/ЦентрЛиста]:", "Origin Center")
 Ссылки
 JigPromptPointOptions Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!