Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.Document.CloseAborted
 Послать отзыв
 Событие, возникающее после того, как в обработчике ветируется закрытие документа.
 Синтаксис
C#
Visual Basic
public event EventHandler CloseAborted;
Public Event CloseAborted As EventHandler
 Возвращает
 Возвращает тип данных EventHandler
 Описание
 Событие, возникающее после того, как в обработчике ветируется закрытие документа. Это событие попадет во все реакторы, которые получают событие beginDocClose. Соответствует функции NRX API NcEditorReactor2.docCloseAborted().
 Ссылки
 HostMgd.ApplicationServices.Document, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!