Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство DocumentLockModeChangeVetoedEventArgs.GlobalCommandName
 Послать отзыв
 Синтаксис
C#
Visual Basic
public System.String GlobalCommandName;
Public Property GlobalCommandName() As System.String
 Описание
 Возвращает имя команды, которая требует произведения изменений.
 Условия
 Только на чтение
 Ссылки
 DocumentLockModeChangeVetoedEventArgs Класс, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!