Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.DsdData.LogFilePath
 Послать отзыв
 Свойство LogFilePath определяет полный путь к файлу с логами ошибок, зафиксированных в процессе публикации. Не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public System.String LogFilePath;
Копировать Код
Public Property LogFilePath As System.String
 Возвращает
 Возвращает полный путь к файлу с логами ошибок. Тип System.String.
 Описание
 Свойство LogFilePath определяет полный путь к файлу с логами ошибок, зафиксированных в процессе публикации. Это поле сохраняется в DSD-файле.
 В текущей версии не реализовано.
 Условия
 Чтение и запись.
 Ссылки
 HostMgd.PlottingServices.DsdData, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!