Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.DrawingOpenEventHandler(Object, DrawingOpenEventArgs)
 Послать отзыв
 Делегат предназначен для обработки события Document.EndDwgOpen, возникающего непосредственно после открытия файла чертежа в nanoCAD.
 Синтаксис
C#
Visual Basic
Копировать Код
public delegate void DrawingOpenEventHandler( Object sender, DrawingOpenEventArgs e );
Копировать Код
Public Delegate Sub DrawingOpenEventHandler( sender As Object, e As DrawingOpenEventArgs )
 Параметры
 Параметры
 Описание
 sender
 Объект, инициировавший событие. Тип Object.
 e
 Аргументы события. Тип DrawingOpenEventArgs.
 Описание
 Делегат DrawingOpenEventHandler определяет тип обработчика события Document.EndDwgOpen. Он передаёт контекст события через параметры sender и e, где e содержит имя файла и ссылку на базу данных чертежа.
 Ваши комментарии по поводу этого топика: Послать отзыв!