Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.DocumentCollection.Open(string)
 Послать отзыв
 Метод предназначен для открытия чертежа с уровнем доступа "для записи".
 Синтаксис
C#
Visual Basic
Копировать Код
public Document Open(string fileName);
Копировать Код
Public Function Open(fileName As string) As Document
 Параметры
 Параметры
 Описание
 fileName
 Полный путь к чертежу, который необходимо открыть. Тип string
 Возвращает
 Возвращает открытый документ. Тип Document
 Описание
 Метод открывает чертеж с уровнем доступа "для записи", путь к которому указан в параметре fileName, и возвращает объект типа Document, представляющий открытый чертеж. Этот объект добавляется к коллекции класса.
 Ссылки
 HostMgd.ApplicationServices.DocumentCollection, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!