Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство SelectedObject.GraphicsSystemMarker
 Послать отзыв
 Синтаксис
C#
Visual Basic
public int GraphicsSystemMarker;
Public Property GraphicsSystemMarker() As Integer
 Описание
 Возвращает значение, которое описывает какая часть объекта выбрана. Это уникальный целый индекс для части объекта, который был выбран.
 Условия
 Только на чтение
 Ссылки
 SelectedObject Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!