Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.InplaceTextEditor.AttachmentMenus
 Послать отзыв
 Метод вызывает меню прикрепления данного встроенного текстового редактора. В текущей версии не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public void AttachmentMenus( System.Drawing.Point pos, ref HostMgd.Windows.Window parent );
Копировать Код
Public Sub AttachmentMenus( pos As System.Drawing.Point, ByRef parent As HostMgd.Windows.Window )
 Параметры
 Параметры
 Описание
 pos
 Точка привязки вызываемого меню. Тип System.Drawing.Point. Задается в экранных координатах.
 parent
 Родительское окно для вызываемого меню. Тип HostMgd.Windows.Window.
 Описание
 Метод вызывает меню прикрепления данного встроенного текстового редактора в привязке к указанной точке экрана. В текущей версии не реализован.
 Ссылки
 HostMgd.ApplicationServices.InplaceTextEditor, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!