Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptDistanceOptions.DefaultValue
 Послать отзыв
 Свойство возвращает или устанавливает значение расстояния, которое будет использовано, если пользователь нажмёт Enter , не вводя другого значения.
 Синтаксис
C#
Visual Basic
Копировать Код
public double DefaultValue { get; set; }
Копировать Код
Public Property DefaultValue As Double
 Возвращает
 Возвращает значение типа double, представляющее расстояние по умолчанию в текущих единицах чертежа. Если значение не задано, возвращается 0.0.
 Описание
 Свойство используется для задания расстояния по умолчанию при интерактивном вводе — например, через метод GetDistance(). Если пользователь просто нажимает Enter , не указывая числовое значение или точку, то применяется это предустановленное значение. Это позволяет ускорить выполнение команд и упростить взаимодействие с пользователем, особенно когда есть типовое расстояние, используемое чаще других.
 Замечания
 Чтобы значение по умолчанию применялось, необходимо также установить AllowNone = true, чтобы разрешить завершение ввода без указания точки.
 Условия
 Чтение и запись
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { [Teigha.Runtime.CommandMethod("PromptDistanceOptionsExample_DefaultValue")] public void PromptDistanceOptionsExample_DefaultValue() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создаём запрос пользователю PromptDistanceOptions options = new PromptDistanceOptions("\nВведите расстояние:"); // Устанавливаем значение по умолчанию и разрешаем использовать его options.DefaultValue = 100.0; options.UseDefaultValue = true; // Разрешаем использовать Enter, не вводя значений. // В этом случае применится значение по умолчанию options.AllowNone = true; // Вызов метода GetDistance() PromptDoubleResult result = editor.GetDistance(options); // Вывод результата в командную строку if (result.Status == PromptStatus.OK) { editor.WriteMessage($"\nВведено расстояние: {result.Value}"); } else if (result.Status == PromptStatus.None) { editor.WriteMessage("\nИспользовано значение по умолчанию."); } } }
 Ссылки
 HostMgd.EditorInput.PromptDistanceOptions, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!