Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PerPropertyBrowsingEntryAttribute.TextColor
 Послать отзыв
 This is TextColor, a member of class PerPropertyBrowsingEntryAttribute.
 Синтаксис
C#
Visual Basic
public int TextColor;
Public Property TextColor() As Integer
 Ссылки
 PerPropertyBrowsingEntryAttribute Класс, HostMgd.Windows.ToolPalette
 Ваши комментарии по поводу этого топика: Послать отзыв!