Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.EnteringQuiescentState
 Послать отзыв
 Событие возникает, когда редактор переходит в состояние покоя — то есть пользователь завершил все действия и ожидает нового ввода.
 Синтаксис
C#
Visual Basic
Копировать Код
public event System.EventHandler EnteringQuiescentState;
Копировать Код
Public Event EnteringQuiescentState As System.EventHandler
 Описание
 Событие генерируется при переходе редактора nanoCAD в спокойное (неактивное) состояние, что означает, что текущая команда завершена, и система ожидает новых действий от пользователя. Это событие может быть использовано для выполнения фоновых операций, очистки временных данных или подготовки к следующей команде. Оно особенно полезно в надстройках, где требуется реагировать на момент завершения активности пользователя.
 Замечания
 Событие не предоставляет дополнительных данных (EventArgs.Empty) и реализовано как стандартный EventHandler.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события EnteringQuiescentState [Teigha.Runtime.CommandMethod("EnteringQuiescentStateExample")] public void EnteringQuiescentStateExample() { // Подписка на событие редактора EnteringQuiescentState editor.EnteringQuiescentState += OnEditorEnteringQuiescent; } // Реализация отработки события EditorEnteringQuiescent private void OnEditorEnteringQuiescent(object sender, EventArgs e) { // Вывод сообщения в командную строку editor.WriteMessage("\nРедактор перешёл в состояние покоя."); } }
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!