Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Класс HostMgd.Publishing.BeginAggregationEventArgs
 Послать отзыв
 This is class HostMgd::Publishing::BeginAggregationEventArgs.
 Иерархия классов
HostMgd::Publishing::BeginAggregationEventArgs
 Синтаксис
C#
Visual Basic
public class BeginAggregationEventArgs : System.EventArgs;
Public Class BeginAggregationEventArgs Inherits System.EventArgs
 Методы
 Конструкторы
 Имя
 Описание
 BeginAggregationEventArgs
 This is BeginAggregationEventArgs, a member of class BeginAggregationEventArgs.
 Топики
 Имя
 Описание
 BeginAggregationEventArgs Методы
 Ниже перечислены методы класса BeginAggregationEventArgs.
 BeginAggregationEventArgs Свойства
 Ниже перечислены свойства класса BeginAggregationEventArgs.
 Ссылки
 BeginAggregationEventArgs Методы, BeginAggregationEventArgs Свойства, Методы, Топики, BeginAggregationEventArgs Методы, BeginAggregationEventArgs Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!