Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptPointResult.Value
 Послать отзыв
 Свойство возвращает координаты точки, указанные пользователем в ходе интерактивного ввода.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d Value { get; }
Копировать Код
Public ReadOnly Property Value As Point3d
 Возвращает
 Возвращает объект типа Point3d, представляющий трёхмерную точку в мировых координатах (X, Y, Z), которую пользователь указал с помощью мыши или ввёл вручную через командную строку. Point3d содержит:
Координаты X, Y, Z.
Методы сравнения и преобразования.
Поддержку различных систем координат (WCS, OCS и др.).
 Если ввод точки не был завершён корректно, возвращается Point3d.Null.
 Описание
 Свойство используется для получения результата операции ввода точки, выполненной методами, такими как GetPoint(), GetCorner() и другими, которые позволяют пользователю выбрать или ввести координаты в чертеже. Значение доступно только для чтения и представляет собой точку в мировой системе координат (WCS), если операция завершена успешно. Если пользователь отменил ввод или произошла ошибка, значение может быть неопределённым или установлено в Point3d.Null.
 Условия
 Только чтение
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("PromptPointResultExample_Value")] public void PromptPointResultExample_Value() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создаём запрос пользователю PromptPointOptions options = new PromptPointOptions("nУкажите точку:"); options.BasePoint = new Point3d(0, 0, 0); // Вызов метода GetPoint() для запроса пользователю PromptPointResult result = editor.GetPoint(options); // Если все данные введены, выводим результат в командную строку if (result.Status == PromptStatus.OK) { Point3d pt = result.Value; editor.WriteMessage($"\nВыбранная точка: {pt}"); } else { editor.WriteMessage( "\nВвод точки отменен или произошла ошибка."); } } }
 Ссылки
 HostMgd.EditorInput.PromptPointResult, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!