Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.DsdEntry.Copy
 Послать отзыв
 Метод создает копию данного объекта DsdEntry. Не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public HostMgd.PlottingServices.DsdEntry Copy();
Копировать Код
Public Function Copy() As HostMgd.PlottingServices.DsdEntry
 Возвращает
 Возвращает копию данного объекта. Тип HostMgd.PlottingServices.DsdEntry.
 Описание
 Метод создает копию данного объекта DsdEntry.
 В текущей версии не реализован.
 Ссылки
 HostMgd.PlottingServices.DsdEntry, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!