Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Converter.StringToRawAngle (System::String^, AngularUnitFormat)
 Послать отзыв
 This is StringToRawAngle, a member of class Converter.
 Синтаксис
C#
Visual Basic
public double StringToRawAngle(ref System.String value, AngularUnitFormat units);
Public Function StringToRawAngle(ByRef value As System.String, units As AngularUnitFormat) As Double
 Ссылки
 Converter Класс, HostMgd.Runtime Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!