Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство SelectedObject.ObjectId
 Послать отзыв
 Синтаксис
C#
Visual Basic
public Teigha::DatabaseServices::ObjectId ObjectId;
Public Property ObjectId() As Teigha.DatabaseServices.ObjectId
 Описание
 Возвращает Id выбранного объекта.
 Условия
 Только для чтения
 Ссылки
 SelectedObject Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!