Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.InplaceTextEditorSettings
 Послать отзыв
 Класс InplaceTextEditorSettings представляет входные параметры для встроенного текстового редактора InplaceTextEditor. В текущей версии не реализован.
 Иерархия классов
HostMgd::ApplicationServices::InplaceTextEditorSettings
 Синтаксис
C#
Visual Basic
Копировать Код
public class InplaceTextEditorSettings : DisposableWrapper
Копировать Код
Public Class InplaceTextEditorSettings Inherits DisposableWrapper
 Описание
 Класс InplaceTextEditorSettings представляет входные параметры для встроенного текстового редактора InplaceTextEditor. Эти настройки влияют на пользовательский интерфейс и свойства редактора.
 В текущей версии не реализован.
 Методы
 Конструкторы
 Имя
 Описание
 InplaceTextEditorSettings
 Конструктор по умолчанию класса InplaceTextEditorSettings. В текущей версии не реализован.
 Топики
 Имя
 Описание
 InplaceTextEditorSettings Перечисления
 Ниже перечислены перечисления класса InplaceTextEditorSettings.
 InplaceTextEditorSettings Свойства
 Ниже перечислены свойства класса InplaceTextEditorSettings.
 Ссылки
 InplaceTextEditorSettings Перечисления, InplaceTextEditorSettings Свойства, Методы, Топики, InplaceTextEditorSettings Перечисления, InplaceTextEditorSettings Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!