Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Событие Publisher.BeginAggregation
 Послать отзыв
 This is BeginAggregation, a member of class Publisher.
 Синтаксис
C#
Visual Basic
public event BeginAggregationEventHandler BeginAggregation;
Public Event BeginAggregation As BeginAggregationEventHandler
 Ссылки
 Publisher Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!