Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.Application.Quit()
 Послать отзыв
 Метод предназначен для программного завершения работы приложения nanoCAD.
 Синтаксис
C#
Visual Basic
public void Quit();
Public Sub Quit()
 Описание
 Метод завершает работу приложения.
 Ссылки
 HostMgd.ApplicationServices.Application, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!