Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PublishSheetEventArgs.PlotBoundsMaxY
 Послать отзыв
 This is PlotBoundsMaxY, a member of class PublishSheetEventArgs.
 Синтаксис
C#
Visual Basic
public double PlotBoundsMaxY;
Public Property PlotBoundsMaxY() As Double
 Ссылки
 PublishSheetEventArgs Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!