Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.PlotInfoValidator.MediaGroupWeight
 Послать отзыв
 Свойство MediaGroupWeight представляет весовой коэффициент для текущей группы носителей, установленной в конфигурации печати.
 Синтаксис
C#
Visual Basic
Копировать Код
public int MediaGroupWeight;
Копировать Код
Public Property MediaGroupWeight As Integer
 Возвращает
 Возвращает весовой коэффициент для текущей группы носителей. Тип int.
 Описание
 Свойство MediaGroupWeight представляет весовой коэффициент для текущей группы носителей в конфигурации печати, связанной с объектом PlotInfo.
 Замечания
 См. описание свойства MediaMatchingThreshold.
 Условия
 Чтение и запись.
 Ссылки
 HostMgd.PlottingServices.PlotInfoValidator, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!