Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.PreviewEndPlotInfo
 Послать отзыв
 Класс PreviewEndPlotInfo представляет результаты предварительного просмотра операции вывода на печать. Не реализован.
 Иерархия классов
Teigha::Runtime::DisposableWrapper HostMgd::PlottingServices::PreviewEndPlotInfo
 Синтаксис
C#
Visual Basic
Копировать Код
public sealed class PreviewEndPlotInfo : Teigha.Runtime.DisposableWrapper;
Копировать Код
<Wrapper("ACPL_PREVIEWENDPLOT")> Public NotInheritable Class PreviewEndPlotInfo Inherits Teigha.Runtime.DisposableWrapper
 Описание
 Класс PreviewEndPlotInfo представляет результаты предварительного просмотра операции вывода на печать. Эти результаты обновляются после успешного завершения метода PlotEngine.EndPlot(). Состояние предварительного просмотра отражается в свойстве Status значениями из перечисления PreviewEndPlotStatus.
 В текущей версии не реализован.
 Методы
 Конструкторы
 HostMgd.PlottingServices.PreviewEndPlotInfo
 Имя
 Описание
 PreviewEndPlotInfo
 Конструктор по умолчанию класса PreviewEndPlotInfo. Не реализован.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 HostMgd.PlottingServices.PreviewEndPlotInfo
 Имя
 Описание
 PreviewEndPlotInfo Методы
 Ниже перечислены методы класса PreviewEndPlotInfo.
 PreviewEndPlotInfo Свойства
 Ниже перечислены свойства класса PreviewEndPlotInfo.
 Ссылки
 PreviewEndPlotInfo Методы, PreviewEndPlotInfo Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!