Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство EditorVisualStyle.IsVS3dType
 Послать отзыв
 Синтаксис
C#
Visual Basic
public bool IsVS3dType;
Public Property IsVS3dType() As bool
 Описание
 Возвращает true, если визуальный стиль является 3D стилем.
 Условия
 Только на чтение
 Ссылки
 EditorVisualStyle Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!