Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Camera.LensLength
 Послать отзыв
 Свойство LensLength представляет фокусное расстояние камеры в режиме перспективного проецирования. Не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public double LensLength;
Копировать Код
Public ReadOnly Property LensLength As Double
 Возвращает
 Возвращает фокусное расстояние камеры. Тип double.
 Описание
 Свойство LensLength представляет фокусное расстояние камеры в режиме перспективного проецирования. В текущей версии не реализовано.
 Условия
 Только чтение.
 Ссылки
 HostMgd.EditorInput.Camera, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!