Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 JigPrompts.AcquireDistance(String)
 Послать отзыв
 Метод запрашивает у пользователя расстояние, используя при запросе приглашающее сообщение.
 Синтаксис
C#
Visual Basic
public HostMgd.EditorInput.PromptDoubleResult AcquireDistance(ref System.String message);
Public Function AcquireDistance(ByRef message As System.String) As HostMgd.EditorInput.PromptDoubleResult
 Параметры
 Параметры
 Описание
 message
 Текстовое сообщение, приглашающее выбрать расстояние для дальнейших действий с объектом или группой объектов. Сообщение будет выводиться на экране во время работы метода.
 Возвращает
 Возвращает результат типа double, который является расстоянием, полученным либо из текущего положения курсора мыши и значений настроек, выбранных пользователем, либо посредством ввода с клавиатуры.
 Описание
 Метод предназначен для запроса у пользователя расстояния с приглашающим сообщением. В основном применяется для интерактивного увеличения или уменьшения объекта или группы объектов, либо их перемещения. После вызова создает экземпляр класса JigPromptDistanceOptions, присваивает его свойству Message значение параметра message и вызывает свою перегрузку JigPrompts.AcquireDistance(JigPromptDistanceOptions options).
 Пример
 В примере приведен отрывок кода из реализации метода Sampler() класса Jig.
C#
 Копировать Код
 PromptDoubleResult result = prompts.AcquireDistance("Расстояние:");
Visual Basic
 Копировать Код
 Dim result As PromptDoubleResult = prompts.AcquireDistance("Расстояние:")
 Ссылки
 JigPrompts Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!