Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство ColorDialog.Color
 Послать отзыв
 This is Color, a member of class ColorDialog.
 Синтаксис
C#
Visual Basic
public Teigha::Colors::Color Color;
Public Property Color() As Teigha.Colors.Color
 Ссылки
 ColorDialog Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!