Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.DraggingEndedEventArgs.PickPoint
 Послать отзыв
 Свойство предоставляет начальную точку, в которой была начата операция перетаскивания.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d PickPoint { get; }
Копировать Код
Public ReadOnly Property PickPoint As Point3d
 Возвращает
 Возвращает объект типа Point3d, представляющий трёхмерные координаты точки начала перетаскивания в мировой системе координат (WCS). Если точка не была зафиксирована (например, операция прервана до начала), возвращается недопустимая точка или значение по умолчанию.
 Описание
 Свойство возвращает координаты точки в мировой системе координат (WCS), где пользователь начал операцию перетаскивания. Оно используется для определения исходного положения объекта или как базовая точка при расчёте смещения. Это значение особенно полезно при обработке событий после завершения перетаскивания — например, для вычисления перемещения или изменения состояния объекта на основе начальной и конечной позиции.
 Условия
 Только чтение
 Пример
C#
 Копировать Код
public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события Dragging [Teigha.Runtime.CommandMethod("DraggingEndedExample_PickPointProp")] public void DraggingEndedExample_PickPointProp() { // Подписка на событие редактора DraggingEnded editor.DraggingEnded += OnEditorDraggingEnded; } // Реализация отработки события DraggingEnded private void OnEditorDraggingEnded(object sender, DraggingEndedEventArgs e) { // Получаем доступ к точке начала перетаскивания Point3d startPoint = e.PickPoint; // Выводим сообщение с данными о точке начала перетаскивания editor.WriteMessage( $"\nТочка начала перетаскивания: {startPoint}"); } }
 Ссылки
 HostMgd.EditorInput.DraggingEndedEventArgs, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!