Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Перечисление HostMgd.EditorInput.PickPointKind
 Послать отзыв
 Синтаксис
C#
Visual Basic
public enum PickPointKind { InfiniteLine, Ray, LineSegment }
Public Enum PickPointKind InfiniteLine Ray LineSegment End Enum
 Члены
 Члены
 Описание
 InfiniteLine
 Базовая точка линии
 Ray
 Базовая точка луча
 LineSegment
 Базовая точка отрезка
 Описание
 Перечисление, определяющее возможные виды базовых точек.
 Члены перечисления
 Описание
 InfiniteLine
 Базовая точка линии
 Ray
 Базовая точка луча
 LineSegment
 Базовая точка отрезка
 Ваши комментарии по поводу этого топика: Послать отзыв!