Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.BeginPageEventArgs
 Послать отзыв
 Класс BeginPageEventArgs инкапсулирует необходимую для события BeginPage информацию, относящуюся к выводу на печать.
 Иерархия классов
HostMgd::PlottingServices::BeginPageEventArgs
 Синтаксис
C#
Visual Basic
Копировать Код
public class BeginPageEventArgs : System.EventArgs;
Копировать Код
Public Class BeginPageEventArgs Inherits System.EventArgs;
 Описание
 Класс BeginPageEventArgs служит контейнером для аргументов события BeginPage класса PlotReactorManager. Аргументы включают объекты PlotInfo и PlotPageInfo, а также флаг последней страницы печатаемого документа. Экземпляры класса используются делегатом HostMgd.PlottingServices.BeginPageEventHandler.
 Методы
 Конструкторы
 Имя
 Описание
 BeginPageEventArgs
 Конструктор класса BeginPageEventArgs. Создает экземпляр класса с указанными параметрами.
 Топики
 Имя
 Описание
 BeginPageEventArgs Свойства
 Ниже перечислены свойства класса BeginPageEventArgs.
 Ссылки
 BeginPageEventArgs Свойства, Методы, Топики, BeginPageEventArgs Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!