Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.InplaceTextEditor.FindMatchItem
 Послать отзыв
 Метод предназначен для поиска указанной строки с учетом заданных флагов поиска. В текущей версии не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public void FindMatchItem( int flags, ref System.String findStr );
Копировать Код
Public Sub FindMatchItem( flags As Integer, ByRef findStr As System.String )
 Параметры
 Параметры
 Описание
 flags
 Флаги поиска. Например, строка целиком, совпадение по регистру и т.п. Тип int.
 findStr
 Искомая строка. Тип System.String.
 Описание
 Метод реализует поиск в данном редакторе вхождения указанной строки с учетом заданной комбинации флагов поиска. В случае успеха найденная строка будет подсвечена. Если строку найти не удастся, будет выведено сообщение.
 В текущей версии метод не реализован.
 Ссылки
 HostMgd.ApplicationServices.InplaceTextEditor, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!