Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.RecentDocument.RecentDocument
 Послать отзыв
 Конструктор по умолчанию класса RecentDocument. Не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public RecentDocument();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса RecentDocument.
 Не реализован.
 Ссылки
 HostMgd.ApplicationServices.RecentDocument, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!