Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.DisposableSelectionSet.DisposableSelectionSet
 Послать отзыв
 Конструктор класса DisposableSelectionSet.
 Синтаксис
C#
Visual Basic
Копировать Код
public DisposableSelectionSet( ref HostMgd.EditorInput.SelectionSetDelayMarshalled selectionSet );
Копировать Код
Public Sub New( ByRef selectionSet As HostMgd.EditorInput.SelectionSetDelayMarshalled )
 Параметры
 Параметры
 Описание
 selectionSet
 Набор выбранных объектов чертежа. Тип HostMgd.EditorInput.SelectionSetDelayMarshalled.
 Описание
 Конструктор класса DisposableSelectionSet. Создает новый экземпляр класса на основе предоставленной выборки объектов чертежа.
 Ссылки
 HostMgd.EditorInput.DisposableSelectionSet, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!