Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.GetDistance(String)
 Послать отзыв
 Метод позволяет пользователю ввести значение линейного расстояния с клавиатуры или графически указать две точки на чертеже, возвращая результат в виде числового значения.
 Синтаксис
C#
Visual Basic
Копировать Код
public PromptDoubleResult GetDistance(String message);
Копировать Код
Public Function GetDistance(message As String) As PromptDoubleResult
 Параметры
 Параметры
 Описание
 message
 Сообщение, отображаемое в командной строке для приглашения пользователя к вводу расстояния (например, "Укажите длину:"). Тип String.
 Возвращает
 Возвращает объект типа PromptDoubleResult, который содержит:
Status — статус операции (OK, Cancel, Error и др.).
Value — значение расстояния в единицах чертежа (если ввод был успешным).
StringResult — строковое представление введённого значения или команды.
 Описание
 Метод используется для интерактивного получения значения расстояния от пользователя. Пользователь может либо ввести значение вручную в командной строке, либо указать две точки на чертеже мышью — в этом случае расстояние вычисляется автоматически. Метод выводит заданное приглашение и возвращает результат в виде объекта PromptDoubleResult, содержащего статус операции и значение расстояния в единицах чертежа.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("GetDistanceExample_String")] public void GetDistanceExample_String() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создаём запрос пользователю PromptDoubleResult result = editor.GetDistance("\nВведите расстояние:"); // Если данные введены, выводим результат в командную строку if (result.Status == PromptStatus.OK) { double distance = result.Value; editor.WriteMessage( $"\nВведено расстояние: {distance}"); } } }
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!