Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PlotProgress.LowerPlotProgressRange
 Послать отзыв
 Нижняя граница индикатора печати.
 Синтаксис
C#
Visual Basic
public int LowerPlotProgressRange;
Public Property LowerPlotProgressRange() As Integer
 Описание
 При её изменении происходит проверка верхней границы и при несоответствии,
 Ссылки
 PlotProgress Класс, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!