Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.GraphicsSystem.ViewEventArgs.ViewEventArgs
 Послать отзыв
 Конструктор по умолчанию класса ViewEventArgs.
 Синтаксис
C#
Visual Basic
Копировать Код
public ViewEventArgs();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса ViewEventArgs.
 Ссылки
 HostMgd.GraphicsSystem.ViewEventArgs, HostMgd.GraphicsSystem
 Ваши комментарии по поводу этого топика: Послать отзыв!