Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод PlotLogger.LogMessage
 Послать отзыв
 Синтаксис
C#
Visual Basic
public void LogMessage(ref System.String message);
Public Sub LogMessage(ByRef message As System.String)
 Ссылки
 PlotLogger Класс, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!