Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Palette.Name
 Послать отзыв
 This is Name, a member of class Palette.
 Синтаксис
C#
Visual Basic
public System.String Name;
Public Property Name() As System.String
 Ссылки
 Palette Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!