Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Converter.StringToDistance (String^, DistanceUnitFormat)
 Послать отзыв
 Синтаксис
C#
Visual Basic
public double StringToDistance(ref String value, DistanceUnitFormat units);
Public Function StringToDistance(ByRef value As String, units As DistanceUnitFormat) As Double
 Описание
 Конвертирует строку в расстояние в соответствии с заданными линейными единицами.
 Ссылки
 Converter Класс, HostMgd.Runtime Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!