Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PaletteAddContextMenuEventArgs.RemoveMenuItems
 Послать отзыв
 This is RemoveMenuItems, a member of class PaletteAddContextMenuEventArgs.
 Синтаксис
C#
Visual Basic
public System.Collections.Generic.List<int> RemoveMenuItems;
Public Property RemoveMenuItems() As System.Collections.Generic.List<int>
 Ссылки
 PaletteAddContextMenuEventArgs Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!