Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.PointToScreen(Point3d,int)
 Послать отзыв
 Метод преобразует трёхмерную точку из пространства чертежа в координаты экрана указанного видового экрана.
 Синтаксис
C#
Visual Basic
Копировать Код
public System.Drawing.Point PointToScreen(Point3d pt, int viewportNumber);
Копировать Код
Public Function PointToScreen(pt As Point3d, viewportNumber As Integer) As System.Drawing.Point
 Параметры
 Параметры
 Описание
 pt
 Трёхмерная точка в координатах чертежа, которую необходимо преобразовать. Тип Point3d.
 viewportNumber
 Номер видового экрана, относительно которого выполняется преобразование. Тип int.
 Возвращает
 Возвращает значение типа System.Drawing.Point, представляющее координаты точки на экране (в пикселях) относительно указанного видового экрана. Эта точка может быть использована, например, для вывода информации поверх чертежа или взаимодействия с интерфейсными элементами.
 Описание
 Метод используется для перевода точки из мировой системы координат (WCS) или системной координатной системы чертежа в экранные координаты относительно конкретного видового экрана. Это может быть полезно при отрисовке графических элементов поверх чертежа или при обработке пользовательского ввода, привязанного к определённому видовому экрану.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("PointToScreenExample")] public void PointToScreenExample() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Определяем переменные для параметров метода PointToScreen Point3d worldPoint = new Point3d(100, 100, 0); int viewport = 2; // Вызываем метод System.Drawing.Point screenPoint = editor.PointToScreen(worldPoint, viewport); // Выводим результат в командную строку editor.WriteMessage( $"\nЭкранные координаты точки: X={screenPoint.X}, Y={screenPoint.Y}"); } }
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!