Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.InplaceTextEditor.Undo
 Послать отзыв
 Метод отменяет последнюю выполненную операцию. В текущей версии не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Undo();
Копировать Код
Public Sub Undo()
 Описание
 Метод реализует отмену последней выполненной операции. В текущей версии данный метод не реализован.
 Ссылки
 HostMgd.ApplicationServices.InplaceTextEditor, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!