Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.DeviceInputEventArgs.Message
 Послать отзыв
 Свойство Message представляет передаваемое сообщение. Не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public int Message;
Копировать Код
Public ReadOnly Property Message As Integer
 Возвращает
 Возвращает передаваемое сообщение. Тип int.
 Описание
 Свойство Message представляет передаваемое сообщение.
 В текущей версии не реализовано.
 Условия
 Только чтение.
 Ссылки
 HostMgd.EditorInput.DeviceInputEventArgs, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!