Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PublishSheetEventArgs.DisplayMaxY
 Послать отзыв
 This is DisplayMaxY, a member of class PublishSheetEventArgs.
 Синтаксис
C#
Visual Basic
public double DisplayMaxY;
Public Property DisplayMaxY() As Double
 Ссылки
 PublishSheetEventArgs Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!