Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptNestedEntityOptions.AllowNone
 Послать отзыв
 Свойство определяет, разрешено ли завершить операцию выбора вложенного объекта нажатием клавиши Enter без указания объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool AllowNone { get; set; }
Копировать Код
Public Property AllowNone As Boolean
 Возвращает
 Возвращает значение типа bool:
true — завершение ввода нажатием Enter разрешено.
false — требуется обязательный выбор объекта или ввод команды.
 Описание
 Свойство позволяет указать, может ли пользователь завершить операцию выбора вложенного геометрического объекта без фактического выбора — просто нажав Enter . Если свойство установлено в true, такая возможность разрешена, и результат ввода будет иметь статус PromptStatus.None. Если false — пользователь обязан указать объект или ввести ключевое слово.
 Условия
 Чтение и запись
 Ссылки
 HostMgd.EditorInput.PromptNestedEntityOptions, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!