Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Событие Application.BeginQuit
 Послать отзыв
 Событие, возникающее перед выполнением действий по завершению работы приложения.
 Синтаксис
C#
Visual Basic
public event System.EventHandler BeginQuit;
Public Event BeginQuit As System.EventHandler
 Описание
 Событие возникает перед выполнением действий по завершению работы приложения.
 Ссылки
 HostMgd.ApplicationServices.Application, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!