Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.DocumentCollection.CloseAll()
 Послать отзыв
 Метод предназначен для закрытия всех открытых dwg-документов без сохранения.
 Синтаксис
C#
Visual Basic
public void CloseAll();
Public Sub CloseAll()
 Описание
 Метод закрывает все открытые dwg-документы без сохранения.
 Ссылки
 HostMgd.ApplicationServices.DocumentCollection, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!