Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.SelectionRemovedEventArgs.Selection
 Послать отзыв
 Свойство возвращает текущий набор объектов, выбранных в редакторе на данный момент.
 Синтаксис
C#
Visual Basic
Копировать Код
public SelectionSet Selection { get; }
Копировать Код
Public ReadOnly Property Selection As SelectionSet
 Возвращает
 Возвращает объект типа SelectionSet, который содержит:
Список ObjectId выбранных объектов.
Дополнительную информацию о выборе (например, точки выбора, матрицы трансформации — при наличии).
 Если объекты не выбраны, возвращается пустой SelectionSet (с Count = 0), а не null. Рекомендуется проверять количество элементов перед обработкой.
 Описание
 Свойство предоставляет доступ к объекту типа SelectionSet, содержащему коллекцию идентификаторов (ObjectId) всех объектов, находящихся в текущем выделении. Оно доступно только для чтения и используется для получения актуальной выборки без необходимости повторного запроса у пользователя.
 Свойство часто применяется в обработчиках событий, пользовательских панелях свойств или при запуске команд, где входные данные берутся из текущего выделения.
 Условия
 Только чтение
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; [Teigha.Runtime.CommandMethod("SelectionRemovedExample_Selection")] public void SelectionRemovedExample_Selection() { // Подписка на событие SelectionRemoved editor.SelectionRemoved += OnSelectionRemoved; } // Реализация отработки события SelectionRemoved private void OnSelectionRemoved(object sender, SelectionRemovedEventArgs e) { SelectionSet removedSet = e.Selection; foreach (ObjectId id in removedSet.GetObjectIds()) { editor.WriteMessage($"\nИз выборки удалён объект: {id}"); } } }
 Ссылки
 HostMgd.EditorInput.SelectionRemovedEventArgs, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!