Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Класс HostMgd.EditorInput.PromptCornerOptions
 Послать отзыв
 Иерархия классов
HostMgd::EditorInput::PromptOptions HostMgd::EditorInput::PromptEditorOptions HostMgd::EditorInput::PromptCornerOptions
 Синтаксис
C#
Visual Basic
public class PromptCornerOptions : PromptEditorOptions;
Public Class PromptCornerOptions Inherits PromptEditorOptions
 Описание
 Класс, представляющий необязательные параметры для приглашения ввода угловой точки.
 Методы
 Конструкторы
 Класс HostMgd.EditorInput.PromptCornerOptions
 Имя
 Описание
 PromptCornerOptions
 Это обзор перегрузок PromptCornerOptions.
 Топики
 Имя
 Описание
 PromptOptions Методы
 Ниже перечислены методы класса PromptOptions.
 PromptOptions Свойства
 Ниже перечислены свойства класса PromptOptions.
 Класс HostMgd.EditorInput.PromptCornerOptions
 Имя
 Описание
 PromptCornerOptions Свойства
 Ниже перечислены свойства класса PromptCornerOptions.
 Ссылки
 PromptCornerOptions Конструктор, PromptCornerOptions Свойства, Методы, Топики, PromptOptions Методы, PromptOptions Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!