Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptAngleOptions.DefaultValue
 Послать отзыв
 Свойство возвращает или устанавливает значение угла по умолчанию, которое будет использовано, если пользователь нажал Enter , не введя другое значение.
 Синтаксис
C#
Visual Basic
Копировать Код
public double DefaultValue { get; set; }
Копировать Код
Public Property DefaultValue As Double
 Возвращает
 Возвращает значение типа double, представляющее угол по умолчанию в радианах . Если значение не было задано, возвращается 0.0.
 Описание
 Свойство используется для задания угла (в радианах), который автоматически применяется, если пользователь завершил ввод нажатием Enter , не указав другое значение. Это позволяет реализовать удобный интерфейс команд, где пользователь может либо ввести собственное значение угла, либо принять предустановленное значение.
 Замечания
 Свойство часто применяется вместе с AllowNone, чтобы при нажатии Enter без ввода значения автоматически использовалось заданное по умолчанию.
 Условия
 Чтение и запись
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("PromptAngleOptionsExample_DefaultValue")] public void PromptAngleOptionsExample_DefaultValue() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создаём запрос пользователю, чтобы он указал угол на чертеже PromptAngleOptions options = new PromptAngleOptions("\nУкажите угол поворота:"); options.DefaultValue = Math.PI / 2; // Угол по умолчанию — 90 градусов options.AllowNone = true; // Разрешить нажатие Enter без ввода // Включаем использование значения по умолчанию options.UseDefaultValue = true; // Вызов метода GetAngle, запрашивающего угол у пользователя PromptDoubleResult result = editor.GetAngle(options); // Если пользователь указал все необходимые данные, // выводим в командной строке сообщение if (result.Status == PromptStatus.OK) { double angleInRadians = result.Value; double angleInDegrees = result.Value * 180 / Math.PI; editor.WriteMessage($"\nВведен угол: {angleInRadians} радиан или {angleInDegrees} градусов"); } else if (result.Status == PromptStatus.None) { editor.WriteMessage("\nИспользовано значение угла по умолчанию."); } } }
 Ссылки
 HostMgd.EditorInput.PromptAngleOptions, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!