Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор DwfNode.DwfNode (int, System::String^)
 Послать отзыв
 This is DwfNode, a member of class DwfNode.
 Синтаксис
C#
Visual Basic
public DwfNode(int nodeId, ref System.String nodeName);
Public Sub New(nodeId As Integer, ByRef nodeName As System.String)
 Ссылки
 DwfNode Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!