Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.InitCommandVersion(int)
 Послать отзыв
 Метод инициализирует версию команды и возвращает предыдущее значение версии. Метод не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public int InitCommandVersion(int nVersion);
Копировать Код
Public Function InitCommandVersion(nVersion As Integer) As Integer
 Параметры
 Параметры
 Описание
 nVersion
 Новое значение версии команды, которое должно быть установлено. Тип int.
 Возвращает
 Возвращает значение типа int, представляющее предыдущий номер версии команды до её изменения.
 Описание
 Метод используется для установки номера версии текущей команды, что может быть необходимо для обеспечения совместимости с различными реализациями команд или для отслеживания изменений в их поведении. Метод принимает новое значение версии команды, сохраняет его во внутреннем состоянии и возвращает предыдущее значение, позволяя при необходимости восстановить прежнюю версию. Метод не реализован.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("InitCommandVersionExample")] public void InitCommandVersionExample() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создаём запрос версии int previousVersion = editor.InitCommandVersion(2); // Устанавливаем версию команды 2 // Выводим результат в командную строку editor.WriteMessage( $"\nПредыдущая версия команды: {previousVersion}"); } }
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!