Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.InputPointContext.RawPoint
 Послать отзыв
 Свойство предназначено для получения исходной координаты курсора до применения привязок, фильтрации или выравнивания.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d RawPoint;
Копировать Код
Public Property RawPoint() As Point3d
 Возвращает
 Возвращает объект типа Point3d — координаты исходной точки ввода в мировой системе координат (WCS).
 Если PointComputed == true — значение актуально и отражает последнее положение курсора. Если PointComputed == false — значение может быть недействительным или относиться к предыдущему состоянию. ?? Важно: всегда проверяйте PointComputed, прежде чем использовать RawPoint.
 Пример:
C#
 Копировать Код
if (context.PointComputed) { Point3d raw = context.RawPoint; // Безопасно использовать }
 Описание
 Свойство возвращает точку в мировой системе координат (WCS), соответствующую непосредственному положению курсора на экране или значению, введённому с клавиатуры, до применения любых режимов коррекции — таких как объектная привязка (OSNAP), сетка, полярное отслеживание, автоматическое выравнивание и пользовательские фильтры. Это "сырая" позиция, отражающая первоначальный ввод пользователя.
 Значение RawPoint считается корректным только при условии, что свойство PointComputed установлено в true, что означает завершение базового этапа обработки точки. В противном случае значение может быть неактуальным или устаревшим.
 Это свойство особенно полезно при реализации:
пользовательских фильтров ввода (PointFilter),
динамических подсказок,
алгоритмов выравнивания,
команд, где необходимо сравнить исходное положение курсора с привязанной точкой.
 Оно позволяет разработчику определить, куда указывал пользователь изначально, и принять решение о дальнейшей обработке — например, активировать направляющую линию или применить собственную привязку.
 Свойство устанавливается системой nanoCAD.
 Условия
 Только чтение
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class InputPointContextExamples { // Метод команды, которая получает исходные координаты курсора // до применения привязок, фильтрации или выравнивания. [Teigha.Runtime.CommandMethod("RawPointExample")] public void RawPointExample() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Метод для отработки события редактора PointMonitor editor.PointMonitor += (sender, e) => { // Сохраняем контекст события в преременную InputPointContext context = e.Context; // Выводим в комнадную строку полученные данные if (context != null && context.PointComputed) { Point3d rawPt = context.RawPoint; editor.WriteMessage($"\nИсходная позиция курсора: {rawPt}"); } }; } }
 Ссылки
 HostMgd.EditorInput.InputPointContext, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!