Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Класс HostMgd.Windows.TrayItemBubbleWindow
 Послать отзыв
 This is class HostMgd::Windows::TrayItemBubbleWindow.
 Иерархия классов
HostMgd::Windows::TrayItemBubbleWindow
 Синтаксис
C#
Visual Basic
public class TrayItemBubbleWindow : DisposableWrapper;
Public Class TrayItemBubbleWindow Inherits DisposableWrapper
 Методы
 Конструкторы
 Имя
 Описание
 TrayItemBubbleWindow
 This is TrayItemBubbleWindow, a member of class TrayItemBubbleWindow.
 Топики
 Имя
 Описание
 TrayItemBubbleWindow Свойства
 Ниже перечислены свойства класса TrayItemBubbleWindow.
 TrayItemBubbleWindow События
 Ниже перечислены события класса TrayItemBubbleWindow.
 Ссылки
 TrayItemBubbleWindow Свойства, TrayItemBubbleWindow События, Методы, Топики, TrayItemBubbleWindow Свойства, TrayItemBubbleWindow События
 Ваши комментарии по поводу этого топика: Послать отзыв!