Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Класс HostMgd.ApplicationServices.DocumentWindowIterator
 Послать отзыв
 Иерархия классов
HostMgd::ApplicationServices::DocumentWindowIterator
 Синтаксис
C#
Visual Basic
public class DocumentWindowIterator : System.Collections.IEnumerator;
Public Class DocumentWindowIterator Inherits System.Collections.IEnumerator
 Описание
 Итератор перебора окон документов в коллекции документов
 Топики
 Имя
 Описание
 DocumentWindowIterator Методы
 Ниже перечислены методы класса DocumentWindowIterator.
 DocumentWindowIterator Свойства
 Ниже перечислены свойства класса DocumentWindowIterator.
 Ссылки
 DocumentWindowIterator Методы, DocumentWindowIterator Свойства, Топики, DocumentWindowIterator Методы, DocumentWindowIterator Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!