Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство JigPromptDistanceOptions.DefaultValue
 Послать отзыв
 Значение по умолчанию для запроса расстояния во время операции Jig.
 Синтаксис
C#
Visual Basic
public double DefaultValue;
Public Property DefaultValue() As Double
 Возвращает
 Возвращает значение расстояния, заданнное по умолчанию.
 Описание
 Свойство предназначено для чтения и определения значения расстояния по умолчанию для операции Jig с геометрическим объектом. Значение по умолчанию будет использовано, если пользователь во время запроса нажал клавишу ENTER без какого-либо ввода.
 Условия
 Чтение и запись.
 Ссылки
 JigPromptDistanceOptions Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!