Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство XrefFileLock.XloadCtlType
 Послать отзыв
 Синтаксис
C#
Visual Basic
public int XloadCtlType;
Public Property XloadCtlType() As Integer
 Описание
 Возвращает системную переменную XLOADCTL типа/режима файла внешней ссылки, относящегося к текущему ID записи таблицы блоков.
 Условия
 Только на чтение
 Ссылки
 XrefFileLock Класс, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!