Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.RecentDocument.Preview
 Послать отзыв
 Свойство Preview представляет растровое изображение предварительного просмотра, связанное с документом. В текущей версии данное свойство не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public System.Windows.Media.Imaging.BitmapSource Preview;
Копировать Код
Public ReadOnly Property Preview As System.Windows.Media.Imaging.BitmapSource
 Возвращает
 Возвращает изображение предпросмотра документа. Тип System.Windows.Media.Imaging.BitmapSource.
 Описание
 Свойство Preview представляет растровое изображение предварительного просмотра, связанное с документом.
 В текущей версии данное свойство не реализовано.
 Условия
 Только чтение.
 Ссылки
 HostMgd.ApplicationServices.RecentDocument, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!