Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.DsdData.SetUnrecognizedData
 Послать отзыв
 Метод позволяет сохранить в данном объекте DSDData массив настраиваемых (нераспознанных) разделов DSD и соответствующие данные, полученные при чтении из DSD-файла. Не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetUnrecognizedData( ref System.Collections.Specialized.StringCollection sectionNames, ref System.Collections.Specialized.StringCollection sectionData );
Копировать Код
Public Sub SetUnrecognizedData( ByRef sectionNames As System.Collections.Specialized.StringCollection, ByRef sectionData As System.Collections.Specialized.StringCollection )
 Параметры
 Параметры
 Описание
 sectionNames
 Входная коллекция заголовков настраиваемых (нераспознанных) разделов. Тип System.Collections.Specialized.StringCollection.
 sectionData
 Входная коллекция данных настраиваемых (нераспознанных) разделов. Тип System.Collections.Specialized.StringCollection.
 Описание
 При чтении DSD-файла обнаруженные нераспознанные разделы классифицируются как «нераспознанные» данные. Этот метод позволяет сохранить в данном объекте DSDData загруженный из DSD-файла массив настраиваемых (нераспознанных) разделов DSD и соответствующие данные.
 В текущей версии не реализован.
 Ссылки
 HostMgd.PlottingServices.DsdData, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!