Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Класс HostMgd.Windows.MenuItem
 Послать отзыв
 Пункт меню.
 Иерархия классов
HostMgd::Windows::Menu Teigha::Runtime::IMenuItem HostMgd::Windows::MenuItem
 Синтаксис
C#
Visual Basic
public class MenuItem : HostMgd::Windows::Menu, IMenuItem;
Public Class MenuItem Inherits HostMgd.Windows.Menu Inherits IMenuItem
 Описание
 Входит в коллекцию MenuItemCollection
 Методы
 Конструкторы
 Класс HostMgd.Windows.MenuItem
 Имя
 Описание
 MenuItem
 Это обзор перегрузок MenuItem.
 Топики
 Имя
 Описание
 Menu Свойства
 Ниже перечислены свойства класса Menu.
 Teigha.Runtime.IMenuItem
 Имя
 Описание
 IMenuItem Методы
 Ниже перечислены методы класса IMenuItem.
 IMenuItem Свойства
 Ниже перечислены свойства класса IMenuItem.
 IMenuItem События
 Ниже перечислены события класса IMenuItem.
 Класс HostMgd.Windows.MenuItem
 Имя
 Описание
 MenuItem Методы
 Ниже перечислены методы класса MenuItem.
 MenuItem Свойства
 Ниже перечислены свойства класса MenuItem.
 MenuItem События
 Ниже перечислены события класса MenuItem.
 Ссылки
 MenuItem Конструктор, MenuItem Методы, MenuItem Свойства, MenuItem События, Методы, Топики, IMenuItem Методы, Menu Свойства, IMenuItem События
 Ваши комментарии по поводу этого топика: Послать отзыв!