Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.DeviceInputEventArgs.WParam
 Послать отзыв
 Свойство WParam представляет компонент сообщения в виде указателя на параметр Windows WParam. Не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public System.IntPtr WParam;
Копировать Код
Public ReadOnly Property WParam As System.IntPtr
 Возвращает
 Возвращает указатель на параметр WParam. Тип System.IntPtr.
 Описание
 Свойство WParam представляет компонент в структуре сообщения MSG в виде указателя на параметр Windows WParam (Word Parameter).
 В текущей версии не реализовано.
 Условия
 Только чтение.
 Ссылки
 HostMgd.EditorInput.DeviceInputEventArgs, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!