Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Делегат HostMgd.ApplicationServices.UnknownCommandEventHandler
 Послать отзыв
 Делегат коммандных событий класса Document
 Синтаксис
C#
Visual Basic
public delegate UnknownCommandEventHandler();
Public Delegate Sub UnknownCommandEventHandler()
 Ваши комментарии по поводу этого топика: Послать отзыв!