Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptNestedEntityOptionsEventHandler(object,PromptNestedEntityOptionsEventArgs)
 Послать отзыв
 Делегат предназначен для обработки события, возникающего перед началом выбора вложенного геометрического объекта, и позволяет настроить параметры операции.
 Синтаксис
C#
Visual Basic
Копировать Код
public delegate void PromptNestedEntityOptionsEventHandler(object sender, PromptNestedEntityOptionsEventArgs e);
Копировать Код
Public Delegate Sub PromptNestedEntityOptionsEventHandler(sender As Object, e As PromptNestedEntityOptionsEventArgs)
 Параметры
 Параметры
 Описание
 sender
 Источник события — обычно экземпляр редактора (Editor), в котором происходит выбор вложенного объекта. Тип object
 e
 Объект, содержащий параметры операции выбора. Тип PromptNestedEntityOptionsEventArgs
 Описание
 Делегат используется как сигнатура метода-обработчика для события PromptingForNestedEntity, которое генерируется перед началом интерактивного выбора объекта, находящегося внутри блока или внешней ссылки. Он позволяет разработчику изменить параметры команды выбора до её запуска — такие как сообщение приглашения, режимы выбора и другие настройки.
 Этот делегат применяется при работе с методом GetNestedEntity(), когда требуется получить доступ к элементам, вложенным в составные объекты чертежа. Он обеспечивает гибкость при реализации команд редактирования, анализа или преобразования объектов внутри блоков.
 Ваши комментарии по поводу этого топика: Послать отзыв!