Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Класс HostMgd.Windows.Window
 Послать отзыв
 Иерархия классов
Teigha::Runtime::DisposableWrapper HostMgd::Windows::Window
 Синтаксис
C#
Visual Basic
public class Window : Teigha::Runtime::DisposableWrapper, System.Windows.Forms.IWin32Window;
Public Class Window Inherits Teigha.Runtime.DisposableWrapper Inherits System.Windows.Forms.IWin32Window
 Описание
 Класс представляет собой окно операционной системы.
 Методы
 Конструкторы
 Класс HostMgd.Windows.Window
 Имя
 Описание
 Window
 Это обзор перегрузок Window.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Класс HostMgd.Windows.Window
 Имя
 Описание
 Window Перечисления
 Ниже перечислены перечисления класса Window.
 Window Методы
 Ниже перечислены методы класса Window.
 Window Свойства
 Ниже перечислены свойства класса Window.
 Ссылки
 Window Конструктор, Window Перечисления, Window Методы, Window Свойства, Методы, Топики, Window Перечисления, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!