Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PaneCollection.IsFixedSize
 Послать отзыв
 This is IsFixedSize, a member of class PaneCollection.
 Синтаксис
C#
Visual Basic
public bool IsFixedSize;
Public Property IsFixedSize() As bool
 Ссылки
 PaneCollection Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!