Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Transient.CapturedDrawable
 Послать отзыв
 Свойство CapturedDrawable представляет связанный отображаемый объект в графическом интерфейсе. Не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public static Teigha.GraphicsInterface.Drawable CapturedDrawable;
Копировать Код
Public Shared Property CapturedDrawable As Teigha.GraphicsInterface.Drawable
 Возвращает
 Возвращает связанный отображаемый объект. Тип Teigha.GraphicsInterface.Drawable.
 Описание
 Свойство CapturedDrawable представляет связанный отображаемый объект в графическом интерфейсе.
 В текущей версии не реализовано.
 Условия
 Чтение и запись.
 Ссылки
 HostMgd.EditorInput.Transient, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!