Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.InplaceTextEditor.CanRedo
 Послать отзыв
 Свойство CanRedo позволяет проверить, возможно ли повторить последнюю выполненную операцию. В текущей версии не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool CanRedo;
Копировать Код
Public ReadOnly Property CanRedo As Boolean
 Возвращает
 Возвращает true, если повторить последнюю выполненную операцию возможно. В противном случае возвращает false.
 Описание
 Свойство CanRedo позволяет проверить, возможно ли повторить последнюю выполненную операцию. В текущей версии не реализовано.
 Условия
 Только чтение.
 Ссылки
 HostMgd.ApplicationServices.InplaceTextEditor, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!