Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Перечисление HostMgd.ApplicationServices.DocumentSaveFormat
 Послать отзыв
 Save formats possible for documents.
 Синтаксис
C#
Visual Basic
public enum DocumentSaveFormat { Native = 0x40, R12Dxf = 1, R13Dwg = 4, R13Dxf = 5, R14Dwg = 8, R14Dxf = 9, R2000Dwg = 12, R2000Dxf = 13, R2000Standard = 15, R2000Template = 14, R2000Xml = 0x10, R2004Dwg = 0x18, R2004Dxf = 0x19, R2004Standard = 0x1b, R2004Template = 0x1a, R2007Dwg = 0x24, R2007Dxf = 0x25, R2007Standard = 0x27, R2007Template = 0x26, R2010Dwg = 0x30, R2010Dxf = 0x31, R2010Standard = 0x33, R2010Template = 50, R2013Dwg = 60, R2013Dxf = 0x3d, R2013Standard = 0x3f, R2013Template = 0x3e, R2018Dwg = 0x40, R2018Dxf = 0x41, R2018Standard = 0x43, R2018Template = 0x42, Unknown = -1 }
Public Enum DocumentSaveFormat Native = &H40 R12Dxf = 1 R13Dwg = 4 R13Dxf = 5 R14Dwg = 8 R14Dxf = 9 R2000Dwg = 12 R2000Dxf = 13 R2000Standard = 15 R2000Template = 14 R2000Xml = &H10 R2004Dwg = &H18 R2004Dxf = &H19 R2004Standard = &H1b R2004Template = &H1a R2007Dwg = &H24 R2007Dxf = &H25 R2007Standard = &H27 R2007Template = &H26 R2010Dwg = &H30 R2010Dxf = &H31 R2010Standard = &H33 R2010Template = 50 R2013Dwg = 60 R2013Dxf = &H3d R2013Standard = &H3f R2013Template = &H3e R2018Dwg = &H40 R2018Dxf = &H41 R2018Standard = &H43 R2018Template = &H42 Unknown = -1 End Enum
 Члены
 Члены
 Описание
 Native
 Current dwg version
 R12Dxf
 AutoCAD R12/LT2 DXF (*.dxf)
 R13Dwg
 AutoCAD R13/LT95 Drawing (*.dwg)
 R13Dxf
 AutoCAD R13/LT95 DXF (*.dxf)
 R14Dwg
 AutoCAD R14/LT97 Drawing (*.dwg)
 R14Dxf
 AutoCAD R14/LT97 DXF (*.dxf)
 R2000Dwg
 AutoCAD 2000 Drawing (*.dwg)
 R2000Dxf
 AutoCAD 2000 DXF (*.dxf)
 R2000Standard
 AutoCAD 2000(+) Drawing Standard File (*.dws)
 R2000Template
 AutoCAD 2000 Drawing Template File (*.dwt)
 R2000Xml
 2000(+) = DesignXML v1.0 File (*.xml)
 R2004Dwg
 AutoCAD 2004 Drawing (*.dwg)
 R2004Dxf
 AutoCAD 2004 DXF (*.dxf)
 R2004Standard
 AutoCAD 2004 Drawing Standard File (*.dws)
 R2004Template
 AutoCAD 2004 Template File (*.dwt)
 R2007Dwg
 AutoCAD 2007 Drawing (*.dwg)
 R2007Dxf
 AutoCAD 2007 DXF (*.dxf)
 R2007Standard
 AutoCAD 2007 Drawing Standard File (*.dws)
 R2007Template
 AutoCAD 2007 Template File (*.dwt)
 R2010Dwg
 AutoCAD 2010 Drawing (*.dwg)
 R2010Dxf
 AutoCAD 2010 DXF (*.dxf)
 R2010Standard
 AutoCAD 2010 Standard File (*.dws)
 R2010Template
 AutoCAD 2010 Template File (*.dwt)
 R2013Dwg
 AutoCAD 2013 Drawing (*.dwg)
 R2013Dxf
 AutoCAD 2013 DXF (*.dxf)
 R2013Standard
 AutoCAD 2013 Drawing Standard File (*.dws)
 R2013Template
 AutoCAD 2013 Template File (*.dwt)
 R2018Dwg
 AutoCAD 2018 Drawing (*.dwg)
 R2018Dxf
 AutoCAD 2018 DXF (*.dxf)
 R2018Standard
 AutoCAD 2018 Drawing Standard File (*.dws)
 R2018Template
 AutoCAD 2018 Template File (*.dwt)
 Описание
 Wraps the AcApDocument::SaveFormat enum.
 Ваши комментарии по поводу этого топика: Послать отзыв!