Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.SelectCrossingPolygon(Point3dCollection)
 Послать отзыв
 Метод возвращает набор объектов, которые пересекают или полностью находятся внутри заданного многоугольника.
 Синтаксис
C#
Visual Basic
Копировать Код
public PromptSelectionResult SelectCrossingPolygon(Point3dCollection polygon);
Копировать Код
Public Function SelectCrossingPolygon(polygon As Point3dCollection) As PromptSelectionResult
 Параметры
 Параметры
 Описание
 polygon
 Коллекция трёхмерных точек (Point3d), представляющих вершины многоугольника в мировой системе координат (WCS). Многоугольник должен быть замкнутым — иначе он будет автоматически замкнут последним соединением первой и последней точки. Тип Point3dCollection.
 Возвращает
 Возвращает объект типа PromptSelectionResult, содержащий результат выборки:
Status — статус выполнения (OK, Cancel, Error и др.). При успешной выборке статус равен PromptStatus.OK.
Value — объект типа SelectionSet, содержащий список идентификаторов (ObjectId) выбранных объектов.
InputString — строковое значение, если операция была прервана пользователем.
 Если ни один объект не удовлетворяет условию попадания в/на многоугольник, Value может быть null.
 Описание
 Метод используется для выбора геометрических объектов чертежа, которые либо пересекаются с границей, либо полностью находятся внутри замкнутого многоугольника, заданного набором вершин. Этот метод особенно полезен при точном выделении объектов на сложных чертежах, где стандартные методы выбора рамкой могут быть недостаточно гибкими.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("SelectCrossingPolygonExample_Point3dCollection")] public void SelectCrossingPolygonExample_Point3dCollection() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создание многоугольника, внутри которого необходимо выбрать объекты Point3dCollection polygon = new Point3dCollection(); polygon.Add(new Point3d(0, 0, 0)); polygon.Add(new Point3d(100, 0, 0)); polygon.Add(new Point3d(100, 100, 0)); polygon.Add(new Point3d(0, 100, 0)); // Вызываем метод PromptSelectionResult result = editor.SelectCrossingPolygon(polygon); // Выводим сообщение в командную строку if (result.Status == PromptStatus.OK) { SelectionSet selSet = result.Value; editor.WriteMessage( $"\nВыбрано объектов: {selSet.Count}"); } else { editor.WriteMessage( "\nНе удалось выбрать объекты."); } } }
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!