Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.Document.Window
 Послать отзыв
 Свойство предоставляет доступ к окну dwg-документа.
 Синтаксис
C#
Visual Basic
Копировать Код
public HostMgd.Windows.Window Window;
Public Property Window() As HostMgd.Windows.Window
 Возвращает
 Возвращает окно dwg-документа. Тип HostMgd.Windows.Window
 Описание
 Свойство предоставляет доступ к окну dwg-документа.
 Условия
 Только чтение
 Ссылки
 HostMgd.ApplicationServices.Document, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!