Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptEntityOptions
 Послать отзыв
 Класс предоставляет параметры для настройки интерактивного выбора геометрического объекта в nanoCAD.
 Иерархия классов
HostMgd::EditorInput::PromptOptions HostMgd::EditorInput::PromptEditorOptions HostMgd::EditorInput::PromptEntityOptions
 Синтаксис
C#
Visual Basic
Копировать Код
public sealed class PromptEntityOptions : PromptEditorOptions
Копировать Код
Public NotInheritable Class PromptEntityOptions Inherits PromptEditorOptions
 Описание
 Класс используется при вызове методов выбора объектов — например, GetEntity() — для настройки поведения команды. С его помощью можно задать:
текст приглашения (Message),
допустимые типы объектов (линии, окружности, блоки и т.д.) с помощью методов AddAllowedClass...,
ключевые слова (Keywords),
режимы ввода (AllowNone, AllowObjectOnLockedLayer и др.).
 Этот класс позволяет гибко управлять пользовательским интерфейсом при выборе объектов, обеспечивая фильтрацию, подсказки и контекстную настройку поведения команды.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("GetEntityExample")] public void GetEntityExample() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создаём запрос пользователю PromptEntityOptions options = new PromptEntityOptions("\nВыберите объект:"); PromptEntityResult result = editor.GetEntity(options); // Если все данные введены, выводим результат в командную строку if (result.Status == PromptStatus.OK) { editor.WriteMessage( $"\nВыбран объект с ID: {result.ObjectId}, точка: {result.PickedPoint}"); } else { editor.WriteMessage( "\nОперация выбора отменена или объект не найден."); } } }
 Методы
 Конструкторы
 HostMgd.EditorInput.PromptEntityOptions
 Имя
 Описание
 PromptEntityOptions
 Это обзор перегрузок PromptEntityOptions.
 Топики
 Имя
 Описание
 PromptOptions Методы
 Ниже перечислены методы класса PromptOptions.
 PromptOptions Свойства
 Ниже перечислены свойства класса PromptOptions.
 HostMgd.EditorInput.PromptEntityOptions
 Имя
 Описание
 PromptEntityOptions Методы
 Ниже перечислены методы класса PromptEntityOptions.
 PromptEntityOptions Свойства
 Ниже перечислены свойства класса PromptEntityOptions.
 Ссылки
 PromptEntityOptions Конструктор, PromptEntityOptions Методы, PromptEntityOptions Свойства, Методы, Топики, PromptOptions Методы, PromptOptions Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!