Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptSelectionResultEventArgs.Result
 Послать отзыв
 Свойство предоставляет доступ к результату операции выбора объектов, включая статус и набор выделенных элементов.
 Синтаксис
C#
Visual Basic
Копировать Код
public PromptSelectionResult Result { get; }
Копировать Код
Public ReadOnly Property Result As PromptSelectionResult
 Возвращает
 Возвращает экземпляр класса PromptSelectionResult, содержащий следующие данные:
Status — статус выполнения команды (PromptStatus.OK, если выборка успешна).
Value — набор выделенных объектов (SelectionSet), если операция завершена успешно.
StringResult — строковое значение, если операция была прервана клавиатурой.
 Если операция не завершена успешно, значение может быть недопустимым или null.
 Описание
 Свойство возвращает объект типа PromptSelectionResult, который содержит данные о завершённой операции выбора объектов — например, после вызова метода GetSelection() или при обработке события PromptedForSelection. Оно позволяет получить:
статус операции (PromptStatus.OK, PromptStatus.Cancel, PromptStatus.Error и др.),
набор выбранных объектов (SelectionSet),
строковое представление ввода , если выбор был прерван пользователем.
 Свойство доступно только для чтения и автоматически обновляется после завершения интерактивной операции выбора.
 Условия
 Только чтение
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события PromptedForSelection [Teigha.Runtime.CommandMethod("PromptedForSelectionExample_Result")] public void PromptedForSelectionExample_Result() { // Подписка на событие PromptedForSelection editor.PromptedForSelection += OnEditorPromptedForSelection; } // Реализация отработки события PromptedForSelection private void OnEditorPromptedForSelection(object sender, PromptSelectionResultEventArgs e) { // Получаем доступ к результатам запроса PromptSelectionResult result = e.Result; // Вывод сообщения в командную строку if (result.Status == PromptStatus.OK && result.Value != null) { editor.WriteMessage($"\nВыбрано объектов: {result.Value.Count}"); } else { editor.WriteMessage("\nОперация выбора объектов отменена."); } } }
 Ссылки
 HostMgd.EditorInput.PromptNestedEntityResultEventArgs, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!