Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Класс HostMgd.EditorInput.JigPromptPointOptions
 Послать отзыв
 Класс предназначен для хранения набора параметров, необходимых для запроса точки во время операции Jig с геометрическими объектами.
 Иерархия классов
HostMgd::EditorInput::PromptOptions HostMgd::EditorInput::JigPromptOptions HostMgd::EditorInput::JigPromptGeometryOptions HostMgd::EditorInput::JigPromptPointOptions
 Синтаксис
C#
Visual Basic
public class JigPromptPointOptions : JigPromptGeometryOptions;
Public Class JigPromptPointOptions Inherits JigPromptGeometryOptions
 Описание
 Класс предназначен для для хранения набора параметров, необходимых для запроса точки во время операции Jig с геометрическими объектами. Используется с методом AcquirePoint() класса JigPrompts и позволяет установить для запроса базовую точку, приглашающее сообщение, ключевые слова, значение по умолчанию, внешний вид курсора и изменить пользовательские настройки ввода.
 Методы
 Конструкторы
 Класс HostMgd.EditorInput.JigPromptGeometryOptions
 Имя
 Описание
 JigPromptGeometryOptions
 Это обзор перегрузок JigPromptGeometryOptions.
 Класс HostMgd.EditorInput.JigPromptPointOptions
 Имя
 Описание
 JigPromptPointOptions
 Это обзор перегрузок JigPromptPointOptions.
 Топики
 Имя
 Описание
 PromptOptions Методы
 Ниже перечислены методы класса PromptOptions.
 PromptOptions Свойства
 Ниже перечислены свойства класса PromptOptions.
 Класс HostMgd.EditorInput.JigPromptOptions
 Имя
 Описание
 JigPromptOptions Методы
 Ниже перечислены методы класса JigPromptOptions.
 JigPromptOptions Свойства
 Ниже перечислены свойства класса JigPromptOptions.
 Класс HostMgd.EditorInput.JigPromptGeometryOptions
 Имя
 Описание
 JigPromptGeometryOptions Свойства
 Ниже перечислены свойства класса JigPromptGeometryOptions.
 Класс HostMgd.EditorInput.JigPromptPointOptions
 Имя
 Описание
 JigPromptPointOptions Свойства
 Ниже перечислены свойства класса JigPromptPointOptions.
 Ссылки
 JigPromptPointOptions Конструктор, JigPromptPointOptions Свойства, Методы, Топики, PromptOptions Методы, PromptOptions Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!