Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.BeginDocumentEventArgs
 Послать отзыв
 Класс BeginDocumentEventArgs представляет данные для события PlotReactorManager.BeginDocument, возникающего в процессе вывода на печать.
 Иерархия классов
HostMgd::PlottingServices::BeginDocumentEventArgs
 Синтаксис
C#
Visual Basic
Копировать Код
public class BeginDocumentEventArgs : System.EventArgs;
Копировать Код
Public Class BeginDocumentEventArgs Inherits System.EventArgs;
 Описание
 Класс BeginDocumentEventArgs представляет данные для событий PlotReactorManager.BeginDocument. Инкапсулируемая информация включает в себя объект PlotInfo, имя документа, количество копий, флаг печати в файл и имя файла. Экземпляры этого класса используются делегатами HostMgd.PlottingServices.BeginDocumentEventHandler.
 Методы
 Конструкторы
 Имя
 Описание
 BeginDocumentEventArgs
 Конструктор класса BeginDocumentEventArgs. Создает экземпляр класса с указанными параметрами.
 Топики
 Имя
 Описание
 BeginDocumentEventArgs Свойства
 Ниже перечислены свойства класса BeginDocumentEventArgs.
 Ссылки
 BeginDocumentEventArgs Свойства, Методы, Топики, BeginDocumentEventArgs Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!