Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод TrayItemCollection.Remove (TrayItem^)
 Послать отзыв
 This is Remove, a member of class TrayItemCollection.
 Синтаксис
C#
Visual Basic
public void Remove(ref TrayItem value);
Public Sub Remove(ByRef value As TrayItem)
 Ссылки
 TrayItemCollection Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!