Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.SelectPrevious()
 Послать отзыв
 Метод возвращает набор объектов, использованных в предыдущей команде, если такой набор существует.
 Синтаксис
C#
Visual Basic
Копировать Код
public PromptSelectionResult SelectPrevious();
Копировать Код
Public Function SelectPrevious() As PromptSelectionResult
 Возвращает
 Возвращает объект типа PromptSelectionResult, содержащий:
Status — статус выполнения (OK, если предыдущий набор объектов найден, и Cancel, если нет активной выборки).
Value — объект типа SelectionSet, содержащий список идентификаторов (ObjectId) объектов из предыдущей команды (если статус равен OK).
StringResult — строковое значение (обычно не используется в данном контексте).
 Если предыдущая команда не оставила выборку объектов, результат будет иметь статус Cancel.
 Описание
 Метод используется для получения множества объектов, которые были выбраны или задействованы в последней выполненной команде. Это позволяет повторно использовать выборку без необходимости заново выделять объекты вручную.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("SelectPreviousExample")] public void SelectPreviousExample() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Вызываем метод PromptSelectionResult result = editor.SelectPrevious(); // Выводим сообщение в командную строку if (result.Status == PromptStatus.OK) { SelectionSet prevSet = result.Value; editor.WriteMessage( $"\nНайдено объектов из предыдущей команды: {prevSet.Count}"); } else { editor.WriteMessage( "\nНет данных о предыдущем наборе объектов."); } } }
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!