Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.DsdData.WriteDsd
 Послать отзыв
 Метод записывает в DSD-файл информацию из данного объекта. Не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public void WriteDsd( ref System.String fileName );
Копировать Код
Public Sub WriteDsd( ByRef fileName As System.String )
 Параметры
 Параметры
 Описание
 fileName
 Полное имя файла для записи данных DSD. Тип System.String.
 Описание
 Метод записывает информацию из данного объекта в DSD-файл с указанным полным именем fileName.
 В текущей версии не реализован.
 Ссылки
 HostMgd.PlottingServices.DsdData, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!