Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Converter.DistanceToString (double)
 Послать отзыв
 Синтаксис
C#
Visual Basic
public String DistanceToString(double value);
Public Function DistanceToString(value As Double) As String
 Описание
 Конвертирует расстояние в строку в соответствии с текущими линейными единицами и текущей точностью (системная переменная LUPREC).
 Ссылки
 Converter Класс, HostMgd.Runtime Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!