Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptEntityOptions.PromptEntityOptions(string)
 Послать отзыв
 Конструктор инициализирует новый экземпляр класса с заданным приглашающим сообщением для выбора геометрического объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public PromptEntityOptions(string message);
Копировать Код
Public Sub New(message As String)
 Параметры
 Параметры
 Описание
 message
 Текст приглашения, отображаемый в командной строке при запросе выбора объекта. Может содержать инструкции или пояснения.
 Пример
 "Выберите линию для обрезки:". Тип string
 Описание
 Конструктор создаёт объект класса PromptEntityOptions, используемый при настройке интерактивного выбора объекта — например, при вызове метода GetEntity() в .NET API nanoCAD. Он устанавливает текст приглашения, отображаемый пользователю в командной строке, а все остальные параметры (такие как допустимые типы объектов, ключевые слова, режимы ввода) инициализируются значениями по умолчанию.
 Этот конструктор является основным способом задания начального сообщения, которое подсказывает пользователю, что нужно сделать — например, "Выберите объект:" или "Укажите границу области:".
 После создания объекта можно дополнительно настроить его параметры, такие как фильтрация типов объектов, разрешение на пропуск ввода и другие.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("PromptEntityOptions_string")] public void PromptEntityOptions_string() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создаём запрос пользователю PromptEntityOptions options = new PromptEntityOptions("\nВыберите объект:"); PromptEntityResult result = editor.GetEntity(options); // Если все данные введены, выводим результат в командную строку if (result.Status == PromptStatus.OK) { editor.WriteMessage( $"\nВыбран объект с ID: {result.ObjectId}, точка: {result.PickedPoint}"); } else { editor.WriteMessage( "\nОперация выбора отменена или объект не найден."); } } }
 Ссылки
 HostMgd.EditorInput.PromptEntityOptions, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!