Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод PickPointSelectedObject.ToString ()
 Послать отзыв
 ReportNotImplementedByManaged(); }
 PickPointSelectedObject(Teigha::DatabaseServices::ObjectId^ id, HostMgd::EditorInput::SelectionMethod method, long gsMarker, HostMgd::EditorInput::PickPointDescriptor^ descriptor) { / ReportNotImplementedByManaged();
 Синтаксис
C#
Visual Basic
public System.String ToString(); public System.String ToString(ref System.IFormatProvider provider);
Public Function ToString() As System.String Public Function ToString(ByRef provider As System.IFormatProvider) As System.String
 Ссылки
 PickPointSelectedObject Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!