Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.Document
 Послать отзыв
 Свойство предоставляет доступ к документу, с которым связан текущий редактор.
 Синтаксис
C#
Visual Basic
Копировать Код
public Document Document { get; }
Копировать Код
Public ReadOnly Property Document() As Document
 Возвращает
 Возвращает объект типа Document, который представляет текущий чертёж, связанный с редактором. Если документ не определён (например, редактор не привязан к какому-либо документу), может вернуть null.
 Описание
 Свойство используется для получения ссылки на объект Document, представляющий активный чертёж, открытый в nanoCAD, и связанный с текущим экземпляром редактора. Оно позволяет получать информацию о чертеже, управлять его состоянием, открывать и закрывать документы, а также взаимодействовать с базой данных чертежа.
 Условия
 Только чтение
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("DocumentExample")] public void DocumentExample() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Получаем текущий документ через свойство класса редактора Document currentDoc = editor.Document; // Вывод сообщения в командной строке if (currentDoc != null) { editor.WriteMessage( $"\nТекущий документ: {currentDoc.Name}"); } else { editor.WriteMessage( "\nРедактор не связан с документом."); } } }
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!