Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Перечисление HostMgd.Windows.ToolPalette.ReturnStatus
 Послать отзыв
 This is record HostMgd::Windows::ToolPalette::ReturnStatus.
 Синтаксис
C#
Visual Basic
public enum ReturnStatus { ContextMenuHide = 1, ContextMenuShow = 0, ContextMenuUpdatePalette = 4, ExecutionCanceled = 2, ExecutionCancelRejected = 3 }
Public Enum ReturnStatus ContextMenuHide = 1 ContextMenuShow = 0 ContextMenuUpdatePalette = 4 ExecutionCanceled = 2 ExecutionCancelRejected = 3 End Enum
 Ваши комментарии по поводу этого топика: Послать отзыв!