Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод MenuItemCollection.Remove (System::Object^)
 Послать отзыв
 This is Remove, a member of class MenuItemCollection.
 Синтаксис
C#
Visual Basic
public void Remove(ref System.Object value);
Public Sub Remove(ByRef value As System.Object)
 Ссылки
 MenuItemCollection Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!