Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод LayerTransparencyDialog.ShowDialog
 Послать отзыв
 This is ShowDialog, a member of class LayerTransparencyDialog.
 Синтаксис
C#
Visual Basic
public System.Windows.Forms.DialogResult ShowDialog();
Public Function ShowDialog() As System.Windows.Forms.DialogResult
 Ссылки
 LayerTransparencyDialog Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!