Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PromptOptions.AppendKeywordsToMessage
 Послать отзыв
 Признак отображения ключевых слов в приглашающем сообщении.
 Синтаксис
C#
Visual Basic
public bool AppendKeywordsToMessage;
Public Property AppendKeywordsToMessage() As bool
 Возвращает
 Возвращает признак отображения ключевых слов в приглашающем сообщении.
 Описание
 Возвращает или устанавилвает значение признака отображения ключевых слов в приглашающем сообщении. При значении равном true ключевые слова будут отображаться в приглашающем сообщении. При значении равном false ключевые слова не будут отображаться в приглашающем сообщении.
 Условия
 Чтение и запись.
 Ссылки
 HostMgd.EditorInput.PromptOptions, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!