Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод IConfigurationSection.Close
 Послать отзыв
 Синтаксис
C#
Visual Basic
void Close();
Sub Close()
 Описание
 Этот метод должен быть реализован для закрытия секции конфигурации.
 Ссылки
 IConfigurationSection Интерфейс, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!