Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.RecentDocument.Version
 Послать отзыв
 Свойство Version возвращает версию документа. В текущей версии данное свойство не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public System.String Version;
Копировать Код
Public ReadOnly Property Version As System.String
 Возвращает
 Возвращает версию документа. Тип System.String.
 Описание
 Свойство Version возвращает версию документа.
 В текущей версии данное свойство не реализовано.
 Условия
 Только чтение.
 Ссылки
 HostMgd.ApplicationServices.RecentDocument, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!