Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство TrayItemBubbleWindow.HyperText
 Послать отзыв
 This is HyperText, a member of class TrayItemBubbleWindow.
 Синтаксис
C#
Visual Basic
public System.String HyperText;
Public Property HyperText() As System.String
 Ссылки
 TrayItemBubbleWindow Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!