Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Camera.Target
 Послать отзыв
 Свойство Target возвращает положение точки цели камеры. Не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d Target;
Копировать Код
Public ReadOnly Property Target As Point3d
 Возвращает
 Возвращает положение точки цели камеры. Тип Point3d.
 Описание
 Свойство Target возвращает положение точки цели камеры. В текущей версии не реализовано.
 Условия
 Только чтение.
 Ссылки
 HostMgd.EditorInput.Camera, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!