Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.Document.PopDbmod()
 Послать отзыв
 Метод предназначен для копирования верхнего значения из стека значений системной переменной DBMOD в системную переменную DBMOD dwg-документа. Метод не реализован.
 Синтаксис
C#
Visual Basic
public void PopDbmod();
Public Sub PopDbmod()
 Описание
 Метод извлекает верхнее значение из стека системных переменных DBMOD и копирует это значение в системную переменную DBMOD документа.
 Замечания
 Этот метод должен вызываться после вызова метода PushDbmod(). Не реализован.
 Ссылки
 HostMgd.ApplicationServices.Document, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!