Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.DrawVector(Point3d,Point3d,int,bool)
 Послать отзыв
 Метод отрисовывает вектор между двумя точками с заданным цветом и возможностью подсветки.
 Синтаксис
C#
Visual Basic
Копировать Код
public void DrawVector(Point3d from, Point3d to, int color, bool drawHighlighted);
Копировать Код
Public Sub DrawVector(from As Point3d, to As Point3d, color As Integer, drawHighlighted As bool)
 Параметры
 Параметры
 Описание
 from
 Начальная точка вектора (координаты в мировой системе WCS). Тип Point3d.
 to
 Конечная точка вектора (координаты в мировой системе WCS). Тип Point3d.
 color
 Цвет вектора, заданный номером из текущей палитры цветов (например, 1 — красный, 3 — зелёный и т.д.). Тип int.
 drawHighlight
 Флаг, определяющий, будет ли вектор отрисован с подсветкой (выделенным стилем). Если true, вектор отображается более ярко или жирнее. Тип bool.
 Описание
 Метод используется для отображения вектора в трёхмерном пространстве nanoCAD, соединяя начальную и конечную точки прямой линией. Позволяет задать цвет линии и указать, требуется ли её подсветка. Применяется, например, для визуализации направлений, нормалей или динамических построений во время интерактивных операций.
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!