Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод PaneCollection.Insert (int, HostMgd::Windows::Pane^)
 Послать отзыв
 This is Insert, a member of class PaneCollection.
 Синтаксис
C#
Visual Basic
public void Insert(int index, ref HostMgd::Windows::Pane value);
Public Sub Insert(index As Integer, ByRef value As HostMgd.Windows.Pane)
 Ссылки
 PaneCollection Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!