Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Событие Application.BeginDoubleClick
 Послать отзыв
 Событие, возникающее при двойном щелчке в окне редактора.
 Синтаксис
C#
Visual Basic
public event BeginDoubleClickEventHandler BeginDoubleClick;
Public Event BeginDoubleClick As BeginDoubleClickEventHandler
 Описание
 Событие возникает при двойном щелчке в окне редактора и обеспечивает возможность приложению получить координаты курсора в этот момент.
 Ссылки
 HostMgd.ApplicationServices.Application, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!