Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор TabbedDialogExtension.TabbedDialogExtension (System::Windows::Forms::Control^, TabbedDialogAction^, TabbedDialogAction^, TabbedDialogAction^)
 Послать отзыв
 Синтаксис
C#
Visual Basic
public TabbedDialogExtension(ref System.Windows.Forms.Control control, ref TabbedDialogAction onOK, ref TabbedDialogAction onCancel, ref TabbedDialogAction onHelp);
Public Sub New(ByRef control As System.Windows.Forms.Control, ByRef onOK As TabbedDialogAction, ByRef onCancel As TabbedDialogAction, ByRef onHelp As TabbedDialogAction)
 Параметры
 Параметры
 Описание
 control
 Элемент управления С "владелец" данного расширения
 onOK
 Объект, определяющий действия, которые будут выполнены при нажатии на кнопку ОК
 onCancel
 Объект, определяющий действия, которые будут выполнены при нажатии на кнопку Cancel
 onHelp
 Объект, определяющий действия, которые будут выполнены при нажатии на кнопку Help
 Описание
 Конструктор, назначающий обработчик события, определенный как onOK, выполняемый при нажатии на кнопку ОК в диалоговом окне. Назначает обработчик события, определенный как onCancel, выполняемый при нажатии на кнопку Cancel в диалоговом окне. Он также назначает обработчик события, определенный как onHelp, выполняемый при нажатии на кнопку Help в диалоговом окне.
 Ссылки
 TabbedDialogExtension Класс, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!