Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.DocumentCollection.ExecuteInApplicationContext(ExecuteInApplicationContextCallback,object)
 Послать отзыв
 Метод предназначен для вызова функции, которая ничего не возвращает из контекста приложения.
 Синтаксис
C#
Visual Basic
Копировать Код
public void ExecuteInApplicationContext(ExecuteInApplicationContextCallback callback,object data);
Копировать Код
Public Function ExecuteInApplicationContext( callback As ExecuteInApplicationContextCallback, data As object ) As void
 Параметры
 Параметры
 Описание
 callback
 Делегат для вызова callback void функции из контекста приложения. Тип ExecuteInApplicationContextCallback
 data
 Любые данные, которые нужно использовать при вызове функции. Тип object
 Описание
 Метод позволяет вызывать функцию, которая ничего не возвращает из контекста приложения.
 Ссылки
 HostMgd.ApplicationServices.DocumentCollection, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!