Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод PlotFactory.CreatePreviewEngine
 Послать отзыв
 Синтаксис
C#
Visual Basic
public HostMgd::PlottingServices::PlotEngine CreatePreviewEngine(int previewFlags);
Public Function CreatePreviewEngine(previewFlags As Integer) As HostMgd.PlottingServices.PlotEngine
 Ссылки
 PlotFactory Класс, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!