Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.Application.ShowAlertDialog(System.String)
 Послать отзыв
 Метод предназначен для вызова диалогового окна с предупреждающим сообщением.
 Синтаксис
C#
Visual Basic
Копировать Код
public static void ShowAlertDialog(string message);
Копировать Код
Public Shared Sub ShowAlertDialog(message As String)
 Параметры
 Параметры
 Описание
 message
 Выводимое сообщение
 Описание
 Метод вызывает диалоговое окно с предупреждающим сообщением.
 Пример
 В качестве примера приведен фрагмент кода, который вызывает диалоговое окно с предупреждением.
C#
 Копировать Код
HostMgd.ApplicationServices.Application.ShowAlertDialog("Hello, alert dialog!");
 Результат работы такого кода приведен на рисунке:
 Ссылки
 HostMgd.ApplicationServices.Application, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!