Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Событие Publisher.BeginPublishingSheet
 Послать отзыв
 This is BeginPublishingSheet, a member of class Publisher.
 Синтаксис
C#
Visual Basic
public event BeginPublishingSheetEventHandler BeginPublishingSheet;
Public Event BeginPublishingSheet As BeginPublishingSheetEventHandler
 Ссылки
 Publisher Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!