Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Событие UserConfigurationManager.ProfileSaved
 Послать отзыв
 This is ProfileSaved, a member of class UserConfigurationManager.
 Синтаксис
C#
Visual Basic
public event ProfileEventHandler ProfileSaved;
Public Event ProfileSaved As ProfileEventHandler
 Ссылки
 UserConfigurationManager Класс, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!