Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод PlotEngine.BeginPlot
 Послать отзыв
 Метод начало печати.
 Синтаксис
C#
Visual Basic
public void BeginPlot(ref HostMgd::PlottingServices::PlotProgress plotProgress, ref System.Object parameters);
Public Sub BeginPlot(ByRef plotProgress As HostMgd.PlottingServices.PlotProgress, ByRef parameters As System.Object)
 Описание
 Параметрами этого метода является потомок класса PlotProgress. Обычно это PlotProgressDialog.
 Ссылки
 PlotEngine Класс, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!