Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство SelectedSubObject.SelectionMethod
 Послать отзыв
 Синтаксис
C#
Visual Basic
public HostMgd::EditorInput::SelectionMethod SelectionMethod;
Public Property SelectionMethod() As HostMgd.EditorInput.SelectionMethod
 Описание
 Возвращает метод выбора для выбранного подобъекта.
 Условия
 На чтение и запись
 Ссылки
 SelectedSubObject Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!