Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PromptSaveFileOptions.DeriveInitialFilenameFromDrawingName
 Послать отзыв
 Синтаксис
C#
Visual Basic
public bool DeriveInitialFilenameFromDrawingName;
Public Property DeriveInitialFilenameFromDrawingName() As bool
 Описание
 Используется для оценки, может ли имя файла по умолчанию быть именем файла чертежа.
 Условия
 На чтение и запись Note Это свойство предназначено для использования только, когда имя файла по умолчанию не обеспечено функцией, которое использует свойство (иногда бывает сложным понять, какие функции поддерживают какие свойства). Когда имя файла по умолчанию не обеспечено функцией, используйте это свойство, стобы оставить имя по умолчанию пустым. Если не учитывать данное свойство, то имя по умолчанию генерируется и отображается в диалоге, базируясь на имени текущего чертежа.
 Ссылки
 PromptSaveFileOptions Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!