Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptEntityOptions.RemoveAllowedClass(System.Type)
 Послать отзыв
 Метод удаляет указанный тип из списка классов, разрешённых для выбора при интерактивной операции.
 Синтаксис
C#
Visual Basic
Копировать Код
public void RemoveAllowedClass(Type type);
Копировать Код
Public Sub RemoveAllowedClass(type As Type)
 Параметры
 Параметры
 Описание
 type
 Тип объекта, который необходимо удалить из списка разрешённых для выбора.
 Пример
 typeof(Line), typeof(Circle), typeof(BlockReference). Тип System.Type
 Описание
 Метод используется для исключения определённого типа объекта из фильтра выбора, заданного ранее с помощью метода AddAllowedClass. Это позволяет уточнить или сузить круг допустимых объектов, которые пользователь может выбрать с помощью команды GetEntity().
 Если тип был добавлен в список разрешённых (через AddAllowedClass), его можно удалить с помощью этого метода, чтобы предотвратить его выбор в текущей операции.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("PromptEntityOptions_RemoveAllowedClass")] public void PromptEntityOptions_RemoveAllowedClass() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создаём запрос пользователю PromptEntityOptions options = new PromptEntityOptions("\nВыберите объект:"); // Разрешить выбор всех кривых (Line, Circle, Polyline и т.д.) options.AddAllowedClass(typeof(Curve), false); // Исключаем из выбора окружности options.RemoveAllowedClass(typeof(Circle)); PromptEntityResult result = editor.GetEntity(options); // Если все данные введены, выводим результат в командную строку if (result.Status == PromptStatus.OK) { editor.WriteMessage( $"\nВыбран объект с ID: {result.ObjectId}, точка: {result.PickedPoint}"); } else { editor.WriteMessage( "\nОперация выбора отменена или объект не найден."); } } }
 Ссылки
 HostMgd.EditorInput.PromptEntityOptions, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!