Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.EndDocumentEventHandler(Object, EndDocumentEventArgs)
 Послать отзыв
 Делегат EndDocumentEventHandler предназначен для обработки события PlotReactorManager.EndDocument, возникающего сразу после завершения вывода документа на плоттер.
 Синтаксис
C#
Visual Basic
Копировать Код
public delegate void EndDocumentEventHandler( Object sender, EndDocumentEventArgs e );
Копировать Код
Public Delegate Sub EndDocumentEventHandler( sender As Object, e As EndDocumentEventArgs )
 Параметры
 Параметры
 Описание
 sender
 Объект, инициировавший событие. Тип Object.
 e
 Аргументы события. Тип EndDocumentEventArgs.
 Описание
 Делегат EndDocumentEventHandler предназначен для обработки события PlotReactorManager.EndDocument, возникающего сразу после завершения вывода документа на плоттер.
 Контекст события передается через параметры sender и e, где sender определяет объект-инициатор события, а аргумент e типа EndDocumentEventArgs передает состояние флага PlotCancelStatus.
 Ваши комментарии по поводу этого топика: Послать отзыв!