Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptNestedEntityResult.GetContainers()
 Послать отзыв
 Метод GetContainers() предосталяет доступ к массиву идентификаторов контейнеров, в которые вложен геометрический объект.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectId[] GetContainers();
Копировать Код
Public Function GetContainers() As ObjectId()
 Возвращает
 Возвращает массив типа ObjectId[], содержащий идентификаторы всех контейнеров, в которые вложен объект:
Каждый элемент массива представляет собой ObjectId контейнера.
Если объект не вложен ни в один контейнер, возвращается null или пустой массив.
Порядок элементов в массиве соответствует иерархии вложенности: от самого внутреннего к внешнему.
 Описание
 Метод GetContainers() используется для получения списка идентификаторов (ObjectId) всех контейнеров (например, блоков или внешних ссылок), в которые вложен текущий геометрический объект. Это позволяет определить иерархическую структуру вложенности объекта в чертеже — например, если объект находится внутри нескольких уровней блоков или вложенных ссылок.
 Он особенно полезен при работе с PromptNestedEntityResult, чтобы получить информацию о том, в каких именно блоках или внешних ссылках находится выбранный объект.
 Ссылки
 HostMgd.EditorInput.PromptNestedEntityResult, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!