Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Делегат HostMgd.Windows.PressCloseButtonEventHandler
 Послать отзыв
 This is type HostMgd::Windows::PressCloseButtonEventHandler.
 Синтаксис
C#
Visual Basic
public delegate PressCloseButtonEventHandler();
Public Delegate Sub PressCloseButtonEventHandler()
 Ваши комментарии по поводу этого топика: Послать отзыв!