Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.Windows.ToolPalette.CustomToolBase.Customize
 Послать отзыв
 Метод реализует настройку инструмента любого типа, поддерживаемого панелями инструментов. Не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual UInt32 Customize( int contextFlag, UInt32 menuHandle, UInt32 idCommandFirst, UInt32 idCommandLast, Guid paletteId );
Копировать Код
Public Overridable Function Customize( contextFlag As Integer, menuHandle As UInt32, idCommandFirst As UInt32, idCommandLast As UInt32, paletteId As Guid ) As UInt32
 Параметры
 Параметры
 Описание
 contextFlag
 Входные флаги контекста вызова. Тип int.
 menuHandle
 Входной дескриптор меню для пользовательских команд. Тип UInt32.
 idCommandFirst
 Входной ID первой команды диапазона настраиваемых команд. Тип UInt32.
 idCommandLast
 Входной ID последней команды диапазона настраиваемых команд. Тип UInt32.
 paletteId
 Входной идентификатор настраиваемой панели инструментов. Тип Guid.
 Возвращает
 Возвращает идентификатор выбранной команды. Тип UInt32.
 Описание
 Метод реализует настройку инструмента любого типа, поддерживаемого панелями инструментов. В частности, метод позволяет настроить команды пользовательского меню, отражающие специфику инструмента.
 В текущей версии не реализован.
 Ссылки
 HostMgd.Windows.ToolPalette.CustomToolBase, HostMgd.Windows.ToolPalette
 Ваши комментарии по поводу этого топика: Послать отзыв!