Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Publisher.FireAboutToEndPublishing
 Послать отзыв
 This is FireAboutToEndPublishing, a member of class Publisher.
 Синтаксис
C#
Visual Basic
public void FireAboutToEndPublishing(ref HostMgd::Publishing::PublishEventArgs e);
Public Sub FireAboutToEndPublishing(ByRef e As HostMgd.Publishing.PublishEventArgs)
 Ссылки
 Publisher Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!