Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.Windows.ToolPalette.CustomToolBase.GetPropertyIcon
 Послать отзыв
 Метод позволяет добавлять пользовательские иконки для каждого свойства пользовательского инструмента. Не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void GetPropertyIcon( ref System.Object id, ref System.Object icon );
Копировать Код
Public Overridable Sub GetPropertyIcon( ByRef id As System.Object, ByRef icon As System.Object )
 Параметры
 Параметры
 Описание
 id
 Входной идентификатор свойства. Тип System.Object.
 icon
 Иконка для свойства с идентификатором id. Тип System.Object.
 Описание
 Метод позволяет добавлять пользовательские иконки размером 16x16 пикселей для каждого свойства пользовательского инструмента. Инспектор свойств отображает эти иконки слева от метки свойства.
 В текущей версии не реализован.
 Ссылки
 HostMgd.Windows.ToolPalette.CustomToolBase, HostMgd.Windows.ToolPalette
 Ваши комментарии по поводу этого топика: Послать отзыв!