Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 JigPrompts.AcquireDistance(JigPromptDistanceOptions)
 Послать отзыв
 Метод запрашивает у пользователя расстояние, используя при запросе свойства класса JigPromptDistanceOptions.
 Синтаксис
C#
Visual Basic
public HostMgd.EditorInput.PromptDoubleResult AcquireDistance(ref HostMgd.EditorInput.JigPromptDistanceOptions options);
Public Function AcquireDistance(ByRef options As HostMgd.EditorInput.JigPromptDistanceOptions) As HostMgd.EditorInput.PromptDoubleResult
 Параметры
 Параметры
 Описание
 options
 Набор данных типа JigPromptDistanceOptions, которые используются при запросе расстояния.
 Возвращает
 Возвращает результат типа double, который является расстоянием, полученным либо из текущего положения курсора мыши и значений настроек, выбранных пользователем, либо посредством ввода с клавиатуры.
 Описание
 Метод предназначен для запроса у пользователя расстояния. В основном применяется для интерактивного увеличения или уменьшения объекта или группы объектов, либо их перемещения.
 Пример
 В примере приведен отрывок кода из реализации метода Sampler() класса Jig.
C#
 Копировать Код
 JigPromptDistanceOptions distanceOptions = new JigPromptDistanceOptions("Расстояние:"); distanceOptions.UseBasePoint = true; distanceOptions.BasePoint = basePoint; PromptDoubleResult result = prompts.AcquireDistance(distanceOptions);
Visual Basic
 Копировать Код
 Dim distanceOptions As JigPromptDistanceOptions = New JigPromptDistanceOptions("Расстояние:") distanceOptions.UseBasePoint = True distanceOptions.BasePoint = basePoint Dim result As PromptDoubleResult = prompts.AcquireDistance(distanceOptions)
 Ссылки
 JigPrompts Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!