Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Делегат HostMgd.Windows.InfoToolbarResizeTo
 Послать отзыв
 This is type HostMgd::Windows::InfoToolbarResizeTo.
 Синтаксис
C#
Visual Basic
public delegate InfoToolbarResizeTo();
Public Delegate Sub InfoToolbarResizeTo()
 Ваши комментарии по поводу этого топика: Послать отзыв!