Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PublishSheetEventArgs.EffectivePlotOffsetXDevice
 Послать отзыв
 This is EffectivePlotOffsetXDevice, a member of class PublishSheetEventArgs.
 Синтаксис
C#
Visual Basic
public int EffectivePlotOffsetXDevice;
Public Property EffectivePlotOffsetXDevice() As Integer
 Ссылки
 PublishSheetEventArgs Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!