Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Перечисление HostMgd.Windows.OpenFileDialog.OpenFileDialogFlags
 Послать отзыв
 This is record HostMgd::Windows::OpenFileDialog::OpenFileDialogFlags.
 Синтаксис
C#
Visual Basic
[Flags] public enum OpenFileDialogFlags { AllowAnyExtension = 4, AllowFoldersOnly = 0x800, AllowMultiple = 0x1000, DefaultIsFolder = 0x10, DoNotTransferRemoteFiles = 0x40, ForceDefaultFolder = 0x100, NoFtpSites = 0x200, NoShellExtensions = 0x400, NoUrls = 0x80, SearchPath = 8 }
<Flags> Public Enum OpenFileDialogFlags AllowAnyExtension = 4 AllowFoldersOnly = &H800 AllowMultiple = &H1000 DefaultIsFolder = &H10 DoNotTransferRemoteFiles = &H40 ForceDefaultFolder = &H100 NoFtpSites = &H200 NoShellExtensions = &H400 NoUrls = &H80 SearchPath = 8 End Enum
 Ваши комментарии по поводу этого топика: Послать отзыв!