Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Класс HostMgd.Windows.PalettePersistEventArgs
 Послать отзыв
 This is class HostMgd::Windows::PalettePersistEventArgs.
 Иерархия классов
HostMgd::Windows::PalettePersistEventArgs
 Синтаксис
C#
Visual Basic
public class PalettePersistEventArgs : System.EventArgs;
Public Class PalettePersistEventArgs Inherits System.EventArgs
 Методы
 Конструкторы
 Имя
 Описание
 PalettePersistEventArgs
 This is PalettePersistEventArgs, a member of class PalettePersistEventArgs.
 Топики
 Имя
 Описание
 PalettePersistEventArgs Свойства
 Ниже перечислены свойства класса PalettePersistEventArgs.
 Ссылки
 PalettePersistEventArgs Свойства, Методы, Топики, PalettePersistEventArgs Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!