Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptForEntityEndingEventArgs.ReplaceSelectedObject(SelectedObject)
 Послать отзыв
 Метод заменяет выделенный объект на новый, переданный в параметре.
 Синтаксис
C#
Visual Basic
Копировать Код
public void ReplaceSelectedObject(SelectedObject newValue);
Копировать Код
Public Sub ReplaceSelectedObject(newValue As SelectedObject)
 Параметры
 Параметры
 Описание
 newValue
 Новый объект, который будет использован для замены текущего выделенного объекта в контексте операции. Объект должен содержать допустимый ObjectId и ассоциированные данные о подобъекте (если применимо). Тип SelectedObject
 Описание
 Метод используется для замены ранее выбранного пользователем объекта на другой объект, который должен быть подготовлен и передан в виде экземпляра класса SelectedObject. Метод применяется в интерактивных командах, где требуется модифицировать выборку — например, при редактировании или замене элементов чертежа. После вызова метода выбранный объект в контексте ввода заменяется на указанный newValue.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события PromptForEntityEnding [Teigha.Runtime.CommandMethod("PromptForEntityEndingExample_ReplaceSelectedObject")] public void PromptForEntityEndingExample_ReplaceSelectedObject() { // Подписка на событие PromptForEntityEnding editor.PromptForEntityEnding += OnEditorPromptForEntityEnding; } // Реализация отработки события PromptForEntityEnding private void OnEditorPromptForEntityEnding(object sender, PromptForEntityEndingEventArgs e) { if (!e.Result.ObjectId.IsNull) { // Вывод сообщения в командную строку editor.WriteMessage( $"\nВыбраный объект {e.Result.ObjectId.ObjectClass.Name} будет заменен"); // Замена объекта // Для примера замены используется тот же объект SelectedObject newObject = new SelectedObject(e.Result.ObjectId,null); e.ReplaceSelectedObject(newObject); // Вывод ссобщения в командную строку editor.WriteMessage("\nОбъект заменён."); } } }
 Ссылки
 HostMgd.EditorInput.PromptForEntityEndingEventArgs, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!