Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PromptSaveFileOptions.DisplaySaveOptionsMenuItem
 Послать отзыв
 Синтаксис
C#
Visual Basic
public bool DisplaySaveOptionsMenuItem;
Public Property DisplaySaveOptionsMenuItem() As bool
 Описание
 Используется для оценки, должны ли быть параметры сохранения отображены при выборе пункта меню.
 Условия
 На чтение и запись Note Это свойство не гарантирует, что все параметры являются доступными, но только что пункт меню не является скрытым.
 Ссылки
 PromptSaveFileOptions Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!