Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.PlotPageInfo.RasterCount
 Послать отзыв
 Свойство RasterCount предоставляет оценку количества растровых объектов на странице.
 Синтаксис
C#
Visual Basic
Копировать Код
public int RasterCount;
Копировать Код
Public ReadOnly Property RasterCount As Integer
 Возвращает
 Возвращает количество растровых объектов. Тип int.
 Описание
 Свойство RasterCount предоставляет оценку количества растровых объектов на печатаемой странице.
 Условия
 Только чтение.
 Ссылки
 HostMgd.PlottingServices.PlotPageInfo, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!