Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор SaveFileDialog.SaveFileDialog
 Послать отзыв
 This is SaveFileDialog, a member of class SaveFileDialog.
 Синтаксис
C#
Visual Basic
public SaveFileDialog(ref String title, ref String defaultName, ref String extension, ref String dialogName, SaveFileDialogFlags flags);
Public Sub New(ByRef title As String, ByRef defaultName As String, ByRef extension As String, ByRef dialogName As String, flags As SaveFileDialogFlags)
 Ссылки
 SaveFileDialog Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!