Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.PromptingForInteger
 Послать отзыв
 Событие возникает при начале операции ввода целого числа, позволяя настроить параметры команды до её запуска. Событие не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public event PromptIntegerOptionsEventHandler PromptingForInteger;
Копировать Код
Public Event PromptingForInteger As PromptIntegerOptionsEventHandler
 Описание
 Событие инициируется в момент начала интерактивного ввода целого числа — например, перед вызовом метода GetInteger() в .NET API nanoCAD. Оно предоставляет доступ к параметрам ввода через объект PromptIntegerOptionsEventArgs, что позволяет динамически изменять:
текст приглашения (Message),
значение по умолчанию (DefaultValue),
допустимый диапазон (LowerLimit, UpperLimit),
режимы ввода (AllowNone, AllowZero и др.).
 Это событие особенно полезно при разработке интерактивных команд, где требуется гибкая настройка параметров ввода целого числа в зависимости от контекста — например, при задании количества копий, номера слоя, параметра массива и других целочисленных значений.
 Событие вызывается до отображения запроса пользователю, что позволяет модифицировать параметры ввода в реальном времени.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события PromptingForInteger [Teigha.Runtime.CommandMethod("PromptingForIntegerExample")] public void PromptingForIntegerExample() { // Подписка на событие PromptingForInteger editor.PromptingForInteger += OnEditorPromptingForInteger; } // Реализация отработки события PromptingForInteger private void OnEditorPromptingForInteger(object sender, PromptIntegerOptionsEventArgs e) { // Установка сообщения e.Options.Message = "Введите количество копий:"; // Задание диапазона e.Options.LowerLimit = 1; e.Options.UpperLimit = 100; // Установка значения по умолчанию e.Options.DefaultValue = 5; } }
 Порядок работы с событием:
Вызывается метод GetInteger() или аналогичный.
Перед началом ввода генерируется событие PromptingForInteger.
Разработчик может изменить параметры ввода через e.Options.
Пользователь вводит значение или отменяет операцию.
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!