Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Делегат HostMgd.ApplicationServices.DocumentCollectionEventHandler
 Послать отзыв
 Делегат событий класса DocumentCollection
 Синтаксис
C#
Visual Basic
public delegate DocumentCollectionEventHandler();
Public Delegate Sub DocumentCollectionEventHandler()
 Ваши комментарии по поводу этого топика: Послать отзыв!