Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.PromptingForDistance
 Послать отзыв
 Событие возникает при начале интерактивной операции ввода расстояния, позволяя настроить параметры команды до её запуска. Событие не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public event PromptDistanceOptionsEventHandler PromptingForDistance;
Копировать Код
Public Event PromptingForDistance As PromptDistanceOptionsEventHandler
 Описание
 Событие инициируется в момент начала операции ввода расстояния — например, перед вызовом метода GetDistance() или GetAngle() с параметром расстояния. Оно предоставляет доступ к параметрам ввода через объект PromptDistanceOptionsEventArgs, что позволяет динамически изменять:
сообщение приглашения (Message),
начальное значение расстояния (DefaultValue),
режимы ввода (AllowNone, AllowNegative и др.).
 Это событие особенно полезно при разработке интерактивных команд, где требуется гибкая настройка параметров ввода расстояния в зависимости от контекста.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события PromptingForDistance [Teigha.Runtime.CommandMethod("PromptingForDistanceExample")] public void PromptingForDistanceExample() { // Подписка на событие PromptingForDistance editor.PromptingForDistance += OnEditorPromptingForDistance; } // Реализация отработки события PromptingForDistance private void OnEditorPromptingForDistance(object sender, PromptDistanceOptionsEventArgs e) { // Установка начального значения расстояния e.Options.DefaultValue = 100.0; // Задание сообщения приглашения e.Options.Message = "Введите расстояние для смещения:"; } }
 Порядок работы с событием:
Вызывается метод GetDistance() или другой, требующий ввода расстояния.
Перед началом ввода генерируется событие PromptingForDistance.
Разработчик может изменить параметры ввода через e.Options.
Пользователь вводит расстояние графически или с клавиатуры.
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!