Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор PrintForm.PrintForm
 Послать отзыв
 This is PrintForm, a member of class PrintForm.
 Синтаксис
C#
Visual Basic
public PrintForm();
Public Sub New()
 Ссылки
 PrintForm Класс, Пространство имен HostMgd
 Ваши комментарии по поводу этого топика: Послать отзыв!