Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PointFilterEventHandler(object,PointFilterEventArgs)
 Послать отзыв
 Делегат предназначен для обработки событий, связанных с фильтрацией и модификацией координат точки при перемещении мыши в редакторе nanoCAD.
 Синтаксис
C#
Visual Basic
Копировать Код
public delegate void PointFilterEventHandler(object sender, PointFilterEventArgs e);
Копировать Код
Public Delegate Sub PointFilterEventHandler(sender As Object, e As PointFilterEventArgs)
 Параметры
 Параметры
 Описание
 sender
 Источник события — обычно экземпляр редактора (Editor), инициирующий обработку фильтрации точки. Тип object
 e
 Объект события, содержащий:
 Описание
 Делегат используется как сигнатура метода-обработчика для события PointFilter, которое вызывается при каждом перемещении мыши в графической области чертежа. Он позволяет динамически изменять или фильтровать текущую точку ввода, что может применяться для реализации пользовательских привязок, ограничений по осям, интерактивной коррекции положения объектов и других задач, где требуется контроль над движением указателя.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события PointFilter [Teigha.Runtime.CommandMethod("PointFilterExample")] public void PointFilterExample() { // Подписка на событие PointFilter editor.PointFilter += OnEditorPointFilter; } // Реализация отработки события PointFilter private void OnEditorPointFilter(object sender, PointFilterEventArgs e) { InputPointContext context = e.Context; if (context != null) { editor.WriteMessage( $"\nТекущий режим привязки: {context.ObjectSnapMask}"); } // Пример: принудительное выравнивание Y-координаты e.Context.ComputedPoint = new Point3d(e.Context.LastPoint.X, 0, e.Context.LastPoint.Z); PointFilterResult result = e.Result; if (result != null) { // Пример: принудительная установка точки result.NewPoint = new Point3d(result.NewPoint.X, 0, result.NewPoint.Z); } } }
 Ваши комментарии по поводу этого топика: Послать отзыв!