Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptAngleOptions.BasePoint
 Послать отзыв
 Свойство возвращает или устанавливает базовую точку, относительно которой отсчитывается угол при интерактивном вводе.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d BasePoint { get; set; }
Копировать Код
Public Property BasePoint As Point3d
 Возвращает
 Возвращает объект типа Point3d, представляющий собой координаты базовой точки в мировой системе координат (WCS). Если точка не задана, возвращается значение Point3d.Null.
 Описание
 Свойство используется для задания точки, от которой будет отсчитываться угол при вводе — например, при работе с командой GetAngle(). Если базовая точка указана, пользователь может задавать угол относительно этой точки, что особенно полезно при построении объектов, повороте или других операциях, где угол отсчитывается от определённого положения на чертеже.
 Замечания
 Свойство особенно важно при использовании команд, где требуется привязка угла к конкретной точке чертежа — например, при построении направления, повороте объектов или отслеживании движения мыши. Оно помогает обеспечить точность и привязку к геометрии чертежа при вводе угла.
 Условия
 Чтение и запись
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("PromptAngleOptionsExample_BasePoint")] public void PromptAngleOptionsExample_BasePoint() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создаём запрос пользователю, чтобы он указал угол на чертеже PromptAngleOptions options = new PromptAngleOptions("\nУкажите угол поворота:"); // Установка базовой точки options.BasePoint = new Point3d(100, 100, 0); // Вызов метода GetAngle, запрашивающего угол у пользователя PromptDoubleResult result = editor.GetAngle(options); // Если пользователь указал все необходимые данные, // выводим в командной строке сообщение if (result.Status == PromptStatus.OK) { editor.WriteMessage($"\nУгол задан относительно точки {options.BasePoint}."); double angleInRadians = result.Value; double angleInDegrees = result.Value * 180 / Math.PI; editor.WriteMessage($"\nВведен угол: {angleInRadians} радиан или {angleInDegrees} градусов"); } } }
 Ссылки
 HostMgd.EditorInput.PromptAngleOptions, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!