Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.BeginDocumentEventArgs.DocumentName
 Послать отзыв
 Свойство DocumentName представляет имя документа.
 Синтаксис
C#
Visual Basic
Копировать Код
public System.String DocumentName;
Копировать Код
Public ReadOnly Property DocumentName As System.String
 Возвращает
 Возвращает имя документа. Тип System.String.
 Описание
 Свойство DocumentName представляет имя документа.
 Условия
 Только чтение.
 Ссылки
 HostMgd.PlottingServices.BeginDocumentEventArgs, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!