Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptNestedEntityResult.Transform
 Послать отзыв
 Свойство возвращает матрицу преобразования, применённую к выбранному объекту его контейнерами (например, блоками или внешними ссылками).
 Синтаксис
C#
Visual Basic
Копировать Код
public Matrix3d Transform { get; }
Копировать Код
Public ReadOnly Property Transform As Matrix3d
 Возвращает
 Возвращает объект типа Matrix3d, который представляет собой математическую матрицу 4x4, используемую для преобразования координат из системы контейнера в мировую систему координат (WCS). Если объект не вложен или преобразование не требуется, может возвращаться единичная матрица (Matrix3d.Identity), означающая отсутствие изменений.
Matrix3d.Identity — если преобразование отсутствует.
Ненулевая матрица — если объект находится внутри блока
 с заданными параметрами трансформации.
 Описание
 Свойство предоставляет доступ к объекту типа Matrix3d, представляющему собой матрицу аффинного преобразования, которая определяет, как выбранный вложенный геометрический объект трансформирован относительно родительского контейнера — например, повёрнут, смещён или отмасштабирован.
 Это значение особенно важно при работе с объектами, находящимися внутри блоков или внешних ссылок, так как позволяет учитывать текущее положение и ориентацию объекта в мировой системе координат (WCS), несмотря на то, что он хранится в локальной системе координат контейнера.
 Свойство доступно только для чтения и формируется автоматически при завершении операции выбора вложенного объекта, например, через метод GetNestedEntity().
 Условия
 Только чтение
 Ссылки
 HostMgd.EditorInput.PromptNestedEntityResult, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!