Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.PlotConfigInfoCollection
 Послать отзыв
 Класс PlotConfigInfoCollection представляет коллекцию объектов PlotConfigInfo.
 Иерархия классов
Teigha::Runtime::DisposableWrapper HostMgd::PlottingServices::PlotConfigInfoCollection
 Синтаксис
C#
Visual Basic
Копировать Код
public sealed class PlotConfigInfoCollection : Teigha.Runtime.DisposableWrapper, System.Collections.ICollection, System.Collections.IEnumerable;
Копировать Код
Public NotInheritable Class PlotConfigInfoCollection Inherits Teigha.Runtime.DisposableWrapper Inherits System.Collections.ICollection Inherits System.Collections.IEnumerable
 Описание
 Класс PlotConfigInfoCollection представляет коллекцию объектов PlotConfigInfo. Элементы этой коллекции содержат основную информацию о конкретных установленных устройствах вывода.
 Методы
 Конструкторы
 HostMgd.PlottingServices.PlotConfigInfoCollection
 Имя
 Описание
 PlotConfigInfoCollection
 Конструктор по умолчанию класса PlotConfigInfoCollection.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 HostMgd.PlottingServices.PlotConfigInfoCollection
 Имя
 Описание
 PlotConfigInfoCollection Методы
 Ниже перечислены методы класса PlotConfigInfoCollection.
 PlotConfigInfoCollection Свойства
 Ниже перечислены свойства класса PlotConfigInfoCollection.
 Ссылки
 PlotConfigInfoCollection Методы, PlotConfigInfoCollection Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!