Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство DocumentLockModeWillChangeEventArgs.MyNewMode
 Послать отзыв
 Синтаксис
C#
Visual Basic
public HostMgd::ApplicationServices::DocumentLockMode MyNewMode;
Public Property MyNewMode() As HostMgd.ApplicationServices.DocumentLockMode
 Описание
 Возвращает режим блокировки, который будет установлен.
 Условия
 Только на чтение
 Ссылки
 DocumentLockModeWillChangeEventArgs Класс, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!