Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Класс HostMgd.Windows.PaletteSetStateEventArgs
 Послать отзыв
 This is class HostMgd::Windows::PaletteSetStateEventArgs.
 Иерархия классов
HostMgd::Windows::PaletteSetStateEventArgs
 Синтаксис
C#
Visual Basic
public class PaletteSetStateEventArgs : System.EventArgs;
Public Class PaletteSetStateEventArgs Inherits System.EventArgs
 Методы
 Конструкторы
 Имя
 Описание
 PaletteSetStateEventArgs
 This is PaletteSetStateEventArgs, a member of class PaletteSetStateEventArgs.
 Топики
 Имя
 Описание
 PaletteSetStateEventArgs Свойства
 Ниже перечислены свойства класса PaletteSetStateEventArgs.
 Ссылки
 PaletteSetStateEventArgs Свойства, Методы, Топики, PaletteSetStateEventArgs Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!