Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.DsdData
 Послать отзыв
 Класс DsdData реализует чтение и запись DSD-файлов, включает коллекцию объектов DSDEntry, а также DSD-данные о подшивке. Не реализован.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject HostMgd::PlottingServices::DsdData
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("NcPlDSDData")] public sealed class DsdData : Teigha.Runtime.RXObject;
Копировать Код
<Wrapper("NcPlDSDData")> Public NotInheritable Class DsdData Inherits Teigha.Runtime.RXObject
 Описание
 Класс DsdData реализует чтение и запись DSD-файлов, включает коллекцию объектов DSDEntry, а также DSD-данные о подшивке.
 В текущей версии не реализован.
 Замечания
 Аббревиатура DSD означает "drawing set descriptions" - описание подшивки чертежей. Файлы формата DSD используются в качестве INI-файлов для настройки публикации группы листов с помощью команды PUBLISH. Пользователи nanoCAD могут загружать, редактировать и сохранять DSD-файлы в диалоговом окне публикации.
 Методы
 Конструкторы
 HostMgd.PlottingServices.DsdData
 Имя
 Описание
 DsdData
 Конструктор по умолчанию класса DsdData. Не реализован.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 HostMgd.PlottingServices.DsdData
 Имя
 Описание
 DsdData Методы
 Ниже перечислены методы класса DsdData.
 DsdData Свойства
 Ниже перечислены свойства класса DsdData.
 Ссылки
 DsdData Методы, DsdData Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!