Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PublishSheetEventArgs.PlotLayoutId
 Послать отзыв
 This is PlotLayoutId, a member of class PublishSheetEventArgs.
 Синтаксис
C#
Visual Basic
public ObjectId PlotLayoutId;
Public Property PlotLayoutId() As ObjectId
 Ссылки
 PublishSheetEventArgs Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!