Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.PointFilter
 Послать отзыв
 Событие возникает при перемещении мыши в окне редактора nanoCAD и позволяет фильтровать или изменять координаты указателя. Событие не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public event PointFilterEventHandler PointFilter;
Копировать Код
Public Event PointFilter As PointFilterEventHandler
 Описание
 Событие вызывается каждый раз, когда пользователь перемещает мышь в графической области чертежа, и предназначено для динамического изменения или фильтрации текущих координат курсора. Оно используется, например, для реализации пользовательских привязок, ограничений по осям или других интерактивных функций, связанных с движением мыши. С помощью этого события можно модифицировать положение точки, полученной от устройства ввода, до её применения в команде.
 Замечания
 Событие использует делегат PointFilterEventHandler, который предоставляет доступ к контексту перемещения и позволяет манипулировать точкой ввода.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события PointFilter [Teigha.Runtime.CommandMethod("PointFilterExample")] public void PointFilterExample() { // Подписка на событие PointFilter editor.PointFilter += OnEditorPointFilter; } // Реализация отработки события PointFilter private void OnEditorPointFilter(object sender, PointFilterEventArgs e) { InputPointContext context = e.Context; if (context != null) { editor.WriteMessage( $"\nТекущий режим привязки: {context.ObjectSnapMask}"); } // Пример: принудительное выравнивание Y-координаты e.Context.ComputedPoint = new Point3d(e.Context.LastPoint.X, 0, e.Context.LastPoint.Z); PointFilterResult result = e.Result; if (result != null) { // Пример: принудительная установка точки result.NewPoint = new Point3d(result.NewPoint.X, 0, result.NewPoint.Z); } } }
 Это позволит "привязывать" мышь к определённому уровню по оси Y при использовании соответствующих команд.
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!