Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PointMonitorEventArgs.Context
 Послать отзыв
 Свойство предоставляет объект, содержащий контекстную информацию о текущей операции ввода точки.
 Синтаксис
C#
Visual Basic
Копировать Код
public InputPointContext Context { get; }
Копировать Код
Public ReadOnly Property Context As InputPointContext
 Возвращает
 Возвращает объект типа InputPointContext, предоставляющий доступ к следующим данным о контексте и настройках курсора. Если контекст не определён или событие завершено, может вернуть null.
 Описание
 Свойство возвращает экземпляр класса InputPointContext, который содержит дополнительные данные о контексте интерактивного ввода точки. Оно используется при обработке событий, связанных с движением мыши и вводом координат, таких как PointMonitor или PointFilter. Через объект InputPointContext можно получить информацию о системе координат (UCS), активных привязках, графическом маркере и других параметрах, влияющих на поведение точки ввода.
 Условия
 Только чтение
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события PointMonitor [Teigha.Runtime.CommandMethod("PointMonitorExample_ContextProp")] public void PointMonitorExample_ContextProp() { // Подписка на событие PointMonitor editor.PointMonitor += OnEditorPointMonitor; } // Реализация отработки события PointMonitor private void OnEditorPointMonitor(object sender, PointMonitorEventArgs e) { // Сохраняем контекст в переменную InputPointContext context = e.Context; if (context != null) { // Сохраняем положение курсора в переменную Point3d cursorPosition = context.LastPoint; // Вывод сообщения в командную строку editor.WriteMessage( $"\nТекущая позиция мыши: {cursorPosition}"); // Добавляем текст-подсказку к отслеживанию положения курсора e.AppendToolTipText($"Текущая позиция: X={cursorPosition.X:F2}, Y={cursorPosition.Y:F2}, Z={cursorPosition.Z:F2}"); } } }
 Ссылки
 HostMgd.EditorInput.PointMonitorEventArgs, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!