Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.Application.ShowModalDialog(System.Windows.Forms.IWin32Window,System.Windows.Forms.Form)
 Послать отзыв
 Метод предназначен для вызова модального диалогового окна, построенного с помощью WinForms, с заданным окном-владельцем.
 Синтаксис
C#
Visual Basic
Копировать Код
public static System.Windows.Forms.DialogResult ShowModalDialog(System.Windows.Forms.IWin32Window owner, System.Windows.Forms.Form formToShow);
Копировать Код
Public Shared Function ShowModalDialog(owner As System.Windows.Forms.IWin32Window, formToShow As System.Windows.Forms.Form) As System.Windows.Forms.DialogResult
 Параметры
 Параметры
 Описание
 owner
 Окно владельца диалога. Тип IWin32Window
 formToShow
 Форма, которая должна быть показана. Тип Form
 Возвращает
 Возвращает результат работы окна, тип System.Windows.Forms.DialogResult
 Описание
 Метод показывает модальный диалог, построенный на WinForms, у которого указано окно-владелец. Необходимо пользоваться именно этим методом вместо метода Form.ShowDialog, который может привести к непредсказуемому результату.
 Ссылки
 HostMgd.ApplicationServices.Application, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!