Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PaletteSet.SyncRoot
 Послать отзыв
 This is SyncRoot, a member of class PaletteSet.
 Синтаксис
C#
Visual Basic
public Object SyncRoot;
Public Property SyncRoot() As Object
 Ссылки
 PaletteSet Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!