Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Runtime.IMenuItem.Icon
 Послать отзыв
 Свойство Icon представляет объект иконки, связанный с данным элементом меню.
 Синтаксис
C#
Visual Basic
Копировать Код
System.Drawing.Icon Icon;
Копировать Код
Property Icon As System.Drawing.Icon
 Возвращает
 Возвращает объект иконки. Тип System.Drawing.Icon.
 Описание
 Свойство Icon представляет объект иконки, связанный с данным элементом меню.
 Условия
 Чтение и запись.
 Ссылки
 MenuItem Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!