Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.LongTransactionManager.Aborted
 Послать отзыв
 Событие Aborted возникает после прерывания длительной транзакции. В текущей версии не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public event LongTransactionEventHandler Aborted;
Копировать Код
Public Event Aborted As LongTransactionEventHandler
 Описание
 Событие Aborted возникает после прерывания длительной транзакции.
 В текущей версии не реализовано.
 Ссылки
 HostMgd.ApplicationServices.LongTransactionManager, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!