Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.Application.ShowModalDialog(System.Windows.Forms.IWin32Window,System.Windows.Forms.Form,bool)
 Послать отзыв
 МЕТОД НЕ РЕАЛИЗОВАН. ВСЕГДА ВОЗВРАЩАЕТ System.Windows.Forms.DialogResult.None. Метод предназначен для вызова модального диалогового окна, построенного с помощью WinForms, с заданным окном-владельцем и флагом возможности изменять положение и размер окна.
 Синтаксис
C#
Visual Basic
Копировать Код
public static System.Windows.Forms.DialogResult ShowModalDialog(System.Windows.Forms.IWin32Window owner, System.Windows.Forms.Form formToShow, bool persistSizeAndPosition);
Копировать Код
Public Shared Function ShowModalDialog(owner As System.Windows.Forms.IWin32Window, formToShow As System.Windows.Forms.Form, persistSizeAndPosition As Boolean) As System.Windows.Forms.DialogResult
 Параметры
 Параметры
 Описание
 owner
 Окно владельца диалога. Тип IWin32Window
 formToShow
 Форма, которая должна быть показана. Тип Form
 persistSizeAndPosition
 Флаг, указывающий, можно ли изменять размер и положение окна. Тип bool: true - можно, false - нельзя
 Возвращает
 Возвращает результат работы окна, тип System.Windows.Forms.DialogResult
 Описание
 Метод показывает модальный диалог, построенный на WinForms, у которого указано окно-владелец и признак возможности изменения положения и размера окна. Необходимо пользоваться именно этим методом вместо метода Form.ShowDialog, который может привести к непредсказуемому результату.
 Ссылки
 HostMgd.ApplicationServices.Application, HostMgd.ApplicationServices Пространство имен
 Исключения
 MGD NOT_IMPLEMENTED
 Ваши комментарии по поводу этого топика: Послать отзыв!