Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор PaletteSet.PaletteSet (System::String^)
 Послать отзыв
 Конструктор класса
 Синтаксис
C#
Visual Basic
public PaletteSet(ref System.String name);
Public Sub New(ByRef name As System.String)
 Ссылки
 PaletteSet Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!