Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Window.Visible
 Послать отзыв
 Синтаксис
C#
Visual Basic
public bool Visible;
Public Property Visible() As bool
 Описание
 Обеспечивает доступ к режиму видимости окна.
 Условия
 На чтение и запись
 Ссылки
 Window Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!