Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод BeginAggregationEventArgs.AddGlobalPropertyRange
 Послать отзыв
 This is AddGlobalPropertyRange, a member of class BeginAggregationEventArgs.
 Синтаксис
C#
Visual Basic
public void AddGlobalPropertyRange(ref array<HostMgd::Publishing::EPlotProperty^> properties);
Public Sub AddGlobalPropertyRange(ByRef properties As array<HostMgd.Publishing.EPlotProperty^>)
 Ссылки
 BeginAggregationEventArgs Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!