Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.Windows.ToolPalette.CustomToolBase.InvokeMenuCommand
 Послать отзыв
 Метод вызывается при активации пользовательского пункта контекстного меню, связанного с данным инструментом. Не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual UInt32 InvokeMenuCommand( UInt32 idCmd, Guid paletteId, UInt32 windowHandle );
Копировать Код
Public Overridable Function InvokeMenuCommand( idCmd As UInt32, paletteId As Guid, windowHandle As UInt32 ) As UInt32
 Параметры
 Параметры
 Описание
 idCmd
 Пользовательский идентификатор команды. Тип UInt32.
 paletteId
 Идентификатор панели инструментов, на которой располагается инструмент. Тип Guid.
 windowHandle
 Дескриптор окна (HWND), который можно использовать как родительский для модальных диалогов. Тип UInt32.
 Возвращает
 Возвращает код результата выполнения метода. Тип UInt32.
 Описание
 Метод вызывается при активации пользовательского пункта контекстного меню, связанного с данным инструментом.
 В текущей версии не реализован.
 Ссылки
 HostMgd.Windows.ToolPalette.CustomToolBase, HostMgd.Windows.ToolPalette
 Ваши комментарии по поводу этого топика: Послать отзыв!