Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Converter.AreaToString (double)
 Послать отзыв
 Синтаксис
C#
Visual Basic
public String AreaToString(double value);
Public Function AreaToString(value As Double) As String
 Описание
 Конвертирует площадь в строку в соответствии с текущими квадратичными единицами и текущей точностью (системная переменная LUPREC).
 Ссылки
 Converter Класс, HostMgd.Runtime Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!