Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptIntegerOptions
 Послать отзыв
 Класс предоставляет параметры для настройки интерактивного ввода целого числа в nanoCAD, такие как сообщение, диапазон значений и значение по умолчанию.
 Иерархия классов
HostMgd::EditorInput::PromptOptions HostMgd::EditorInput::PromptEditorOptions HostMgd::EditorInput::PromptNumericalOptions HostMgd::EditorInput::PromptIntegerOptions
 Синтаксис
C#
Visual Basic
Копировать Код
public sealed class PromptIntegerOptions : PromptNumericalOptions
Копировать Код
Public NotInheritable Class PromptIntegerOptions Inherits PromptNumericalOptions
 Описание
 Класс используется при вызове метода GetInteger() или других команд, требующих ввода целого числа, для настройки поведения интерактивной операции. С его помощью можно задать:
текст приглашения (Message),
значение по умолчанию (DefaultValue),
допустимый диапазон (LowerLimit, UpperLimit),
режимы ввода (AllowNone, AllowNegative, AllowZero и др.).
 Этот класс позволяет гибко управлять пользовательским интерфейсом при вводе целых чисел, обеспечивая контроль над допустимыми значениями и улучшая взаимодействие с пользователем.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("GetIntegerExample")] public void GetIntegerExample() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создаём запрос пользователю PromptIntegerOptions iopts = new PromptIntegerOptions("Введите целое число"); iopts.DefaultValue = 10; iopts.LowerLimit = 0; iopts.UpperLimit = 100; // Вызываем метод GetInteger() для запроса пользователю PromptIntegerResult ipr = editor.GetInteger(iopts); // Если все данные введены, выводим результат в командную строку if (PromptStatus.OK == ipr.Status) { editor.WriteMessage("\nВы ввели: " + ipr.Value); } else { editor.WriteMessage("\nОтмена или ошибка ввода."); } } }
 Топики
 Имя
 Описание
 PromptOptions Методы
 Ниже перечислены методы класса PromptOptions.
 PromptOptions Свойства
 Ниже перечислены свойства класса PromptOptions.
 Класс HostMgd.EditorInput.PromptNumericalOptions
 Имя
 Описание
 PromptNumericalOptions Свойства
 Ниже перечислены свойства класса PromptNumericalOptions.
 HostMgd.EditorInput.PromptIntegerOptions
 Имя
 Описание
 PromptIntegerOptions Свойства
 Ниже перечислены свойства класса PromptIntegerOptions.
 Ссылки
 PromptIntegerOptions Свойства, Топики, PromptOptions Методы, PromptOptions Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!