Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.PlotConfig.ServerName
 Послать отзыв
 Свойство ServerName представляет имя сервера устройства. Не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public System.String ServerName;
Копировать Код
Public ReadOnly Property ServerName As System.String
 Возвращает
 Возвращает имя сервера. Тип System.String.
 Описание
 Свойство ServerName представляет имя сервера устройства.
 В текущей версии не реализовано.
 Условия
 Только чтение.
 Ссылки
 HostMgd.PlottingServices.PlotConfig, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!