Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Класс HostMgd.Publishing.AboutToBeginBackgroundPublishingEventArgs
 Послать отзыв
 This is class HostMgd::Publishing::AboutToBeginBackgroundPublishingEventArgs.
 Иерархия классов
HostMgd::Publishing::AboutToBeginBackgroundPublishingEventArgs
 Синтаксис
C#
Visual Basic
public class AboutToBeginBackgroundPublishingEventArgs : System.EventArgs;
Public Class AboutToBeginBackgroundPublishingEventArgs Inherits System.EventArgs
 Методы
 Конструкторы
 Имя
 Описание
 AboutToBeginBackgroundPublishingEventArgs
 This is AboutToBeginBackgroundPublishingEventArgs, a member of class AboutToBeginBackgroundPublishingEventArgs.
 Топики
 Имя
 Описание
 AboutToBeginBackgroundPublishingEventArgs Методы
 Ниже перечислены методы класса AboutToBeginBackgroundPublishingEventArgs.
 AboutToBeginBackgroundPublishingEventArgs Свойства
 Ниже перечислены свойства класса AboutToBeginBackgroundPublishingEventArgs.
 Ссылки
 AboutToBeginBackgroundPublishingEventArgs Методы, AboutToBeginBackgroundPublishingEventArgs Свойства, Методы, Топики, AboutToBeginBackgroundPublishingEventArgs Методы, AboutToBeginBackgroundPublishingEventArgs Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!