Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptNestedEntityOptions
 Послать отзыв
 Класс предоставляет параметры для настройки операции выбора вложенного геометрического объекта — например, внутри блока или внешней ссылки.
 Иерархия классов
HostMgd::EditorInput::PromptOptions HostMgd::EditorInput::PromptEditorOptions HostMgd::EditorInput::PromptNestedEntityOptions
 Синтаксис
C#
Visual Basic
Копировать Код
public class PromptNestedEntityOptions : PromptEditorOptions
Копировать Код
Public Class PromptNestedEntityOptions Inherits PromptEditorOptions
 Описание
 Класс используется при вызове метода GetNestedEntity() для настройки интерактивного выбора объекта, находящегося внутри составного элемента чертежа — такого как блок или внешняя ссылка. Он позволяет задать:
текст приглашения (Message),
разрешение на отмену ввода (AllowNone),
ключевые слова (Keywords),
другие режимы поведения команды .
 Этот класс обеспечивает гибкость при реализации команд, требующих работы с вложенными объектами, позволяя адаптировать интерфейс ввода под конкретный контекст — например, изменить сообщение, добавить подсказки или ограничить действия пользователя.
 Класс используется совместно с событиями PromptingForNestedEntity и PromptedForNestedEntity, что позволяет как настраивать параметры перед вводом, так и обрабатывать результат после выбора.
 Методы
 Конструкторы
 HostMgd.EditorInput.PromptNestedEntityOptions
 Имя
 Описание
 PromptNestedEntityOptions
 Это обзор перегрузок PromptNestedEntityOptions.
 Топики
 Имя
 Описание
 PromptOptions Методы
 Ниже перечислены методы класса PromptOptions.
 PromptOptions Свойства
 Ниже перечислены свойства класса PromptOptions.
 HostMgd.EditorInput.PromptNestedEntityOptions
 Имя
 Описание
 PromptNestedEntityOptions Свойства
 Ниже перечислены свойства класса PromptNestedEntityOptions.
 Ссылки
 PromptNestedEntityOptions Конструктор, PromptNestedEntityOptions Свойства, Методы, Топики, PromptOptions Методы, PromptOptions Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!