Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство EPlotResource.Role
 Послать отзыв
 This is Role, a member of class EPlotResource.
 Синтаксис
C#
Visual Basic
public System.String Role;
Public Property Role() As System.String
 Ссылки
 EPlotResource Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!