Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 JigPrompts.AcquirePoint()
 Послать отзыв
 Метод запрашивает у пользователя точку.
 Синтаксис
C#
Visual Basic
public HostMgd.EditorInput.PromptPointResult AcquirePoint();
Public Function AcquirePoint() As HostMgd.EditorInput.PromptPointResult
 Возвращает
 Возвращает результат типа Point3d, полученный либо из текущего положения курсора мыши и значений настроек, выбранных пользователем, либо посредством ввода координат точки с клавиатуры.
 Описание
 Метод предназначен для запроса у пользователя точки. В основном применяется для интерактивного перемещения объекта или группы объектов из одной точки в другую. После вызова создает пустой экземпляр класса JigPromptPointOptions и вызывает свою перегрузку JigPrompts.AcquirePoint(JigPromptPointOptions options).
 Пример
 В примере приведен отрывок кода из реализации метода Sampler() класса Jig.
C#
 Копировать Код
 PromptPointResult result = prompts.AcquirePoint();
Visual Basic
 Копировать Код
 Dim result As PromptPointResult = prompts.AcquirePoint()
 Ссылки
 JigPrompts Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!