Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Перечисление HostMgd.Runtime.AngularUnitFormat
 Послать отзыв
 Синтаксис
C#
Visual Basic
public enum AngularUnitFormat { Current = -1, Degrees = 0, DegreesMinutesSeconds = 1, Grads = 2, Radians = 3, Surveyor = 4 }
Public Enum AngularUnitFormat Current = -1 Degrees = 0 DegreesMinutesSeconds = 1 Grads = 2 Radians = 3 Surveyor = 4 End Enum
 Члены
 Члены
 Описание
 Current
 Текущий формат угловых единиц
 Degrees
 Градусы
 DegreesMinutesSeconds
 ГрадусыМинутыСекунды
 Grads
 Грады
 Radians
 Радианы
 Surveyor
 Surveyor
 Описание
 Перечисление возможных форматов угловых единиц.
 Члены
 Описание
 Current = -1
 Текущий формат угловых единиц
 Degrees = 0
 Градусы
 DegreesMinutesSeconds = 1
 ГрадусыМинутыСекунды
 Grads = 2
 Грады
 Radians = 3
 Радианы
 Surveyor = 4
 Топографические единицы
 Ваши комментарии по поводу этого топика: Послать отзыв!