Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство OpenFileDialog.Filename
 Послать отзыв
 This is Filename, a member of class OpenFileDialog.
 Синтаксис
C#
Visual Basic
public System.String Filename;
Public Property Filename() As System.String
 Ссылки
 OpenFileDialog Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!