Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptForSelectionEndingEventArgs.AddSubEntity(SelectedSubObject)
 Послать отзыв
 Метод добавляет указанный геометрический подобъект к текущему набору выделенных подобъектов.
 Синтаксис
C#
Visual Basic
Копировать Код
public void AddSubEntity(SelectedSubObject value);
Копировать Код
Public Sub AddSubEntity(value As SelectedSubObject)
 Параметры
 Параметры
 Описание
 value
 Объект, представляющий подобъект, который необходимо добавить в текущую выборку. Содержит ссылку на базовый объект и данные о его части (маркер, путь и т.д.). Тип SelectedSubObject
 Описание
 Метод используется для программного добавления подобъекта (например, ребра, вершины или контура) в состав текущей выборки. Это может быть полезно при работе с командами, которые требуют выделения отдельных частей сложных объектов — таких как полигоны, блоки или трехмерные тела. Метод позволяет динамически управлять содержимым выборки на уровне подобъектов перед выполнением операции.
 Замечания
 Этот метод применяется в интерактивных операциях, где требуется работать не с целыми объектами, а с их отдельными компонентами — например, при редактировании сложных геометрий или выполнении точечного выбора.
 Пример
C#
 Копировать Код
SelectedSubObject subObj = new SelectedSubObject(new FullSubentityPath(), SelectionMethod.PickPoint, 0); editor.PromptForSelectionEnding += (sender, e) => { e.AddSubEntity(subObj); };
 Ссылки
 HostMgd.EditorInput.PromptForSelectionEndingEventArgs, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!