Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.PlotInfoValidator
 Послать отзыв
 Класс PlotInfoValidator отвечает за формирование набора индикаторов возможных конфликтов при слиянии относящихся к печати настроек из таких объектов как слой, PlotSettings и переопределения устройства вывода, и помогает избежать ошибок, связанных с некорректной конфигурацией печати.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject HostMgd::PlottingServices::PlotInfoValidator
 Синтаксис
C#
Visual Basic
Копировать Код
public sealed class PlotInfoValidator : Teigha.Runtime.RXObject;
Копировать Код
Public NotInheritable Class PlotInfoValidator Inherits Teigha.Runtime.RXObject;
 Описание
 Класс PlotInfoValidator является вспомогательным классом для валидации параметров печати, прежде чем они будут использованы для фактической печати чертежа, и помогает избежать ошибок, связанных с некорректной конфигурацией печати.
 Экземпляр PlotInfoValidator представляет объект параметров печати, сформированный на основе относящихся к печати настроек из таких объектов как слой, PlotSettings и переопределения устройства вывода. Он отвечает за формирование набора кодов, служащих индикаторами возможных конфликтов при слиянии таких настроек.
 Замечания
 Валидатор в своем алгоритме проверки поддерживает правила (политики) сопоставления форматов носителей. В зависимости от настройки правил валидатор может попытаться найти подходящий формат бумаги, если на устройстве вывода отсутствует каноническое имя формата, указанное в объекте листа чертежа или в соответствующих переопределениях. Кроме того, валидатор поддерживает политики создания пользовательского формата бумаги (при возможности) в случае сбоя алгоритма сопоставления.
 Методы
 Конструкторы
 HostMgd.PlottingServices.PlotInfoValidator
 Имя
 Описание
 PlotInfoValidator
 Конструктор по умолчанию класса PlotInfoValidator.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 HostMgd.PlottingServices.PlotInfoValidator
 Имя
 Описание
 PlotInfoValidator Методы
 Ниже перечислены методы класса PlotInfoValidator.
 PlotInfoValidator Свойства
 Ниже перечислены свойства класса PlotInfoValidator.
 Ссылки
 PlotInfoValidator Методы, PlotInfoValidator Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!