Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Событие UserConfigurationManager.CurrentProfileSaved
 Послать отзыв
 This is CurrentProfileSaved, a member of class UserConfigurationManager.
 Синтаксис
C#
Visual Basic
public event ProfileEventHandler CurrentProfileSaved;
Public Event CurrentProfileSaved As ProfileEventHandler
 Ссылки
 UserConfigurationManager Класс, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!