Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.DocumentCollection.DocumentDestroyed
 Послать отзыв
 Событие, возникающее после полного уничтожения dwg-документа.
 Синтаксис
C#
Visual Basic
public event DocumentDestroyedEventHandler DocumentDestroyed;
Public Event DocumentDestroyed As DocumentDestroyedEventHandler
 Возвращает
 Возвращает тип данных HostMgd.ApplicationServices.DocumentCollectionEventHandler
 Описание
 Событие, возникающее, когда документ полностью разрушен и база данных, соответствующая этому документу, также уничтожена.
 Соответствует функции NRX API HostApDocManagerReactor.documentDestroyed().
 Ссылки
 HostMgd.ApplicationServices.DocumentCollection, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!