Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.InplaceTextEditor.ParagraphSupported
 Послать отзыв
 Свойство ParagraphSupported позволяет проверить, поддерживаются ли текстовые абзацы в данном редакторе. В текущей версии не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool ParagraphSupported;
Копировать Код
Public ReadOnly Property ParagraphSupported As Boolean
 Возвращает
 Возвращает true, если абзацы поддерживаются. В противном случае возвращает false.
 Описание
 Свойство ParagraphSupported позволяет проверить, поддерживаются ли текстовые абзацы в данном редакторе. В текущей версии не реализовано.
 Условия
 Только чтение.
 Ссылки
 HostMgd.ApplicationServices.InplaceTextEditor, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!