Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор SelectionSet.SelectionSet
 Послать отзыв
 Синтаксис
C#
Visual Basic
public SelectionSet();
Public Sub New()
 Описание
 Конструктор класса, создающий пустую коллекцию.
 Ссылки
 SelectionSet Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!