Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Событие PlotReactorManager.PageCancelled
 Послать отзыв
 Синтаксис
C#
Visual Basic
public event HostMgd::PlottingServices::PageCancelledEventHandler PageCancelled;
Public Event PageCancelled As HostMgd.PlottingServices.PageCancelledEventHandler
 Ссылки
 PlotReactorManager Класс, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!