Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.ProcessPlotState
 Послать отзыв
 Данное перечисление определяет значения, описывающие текущий процесс вывода чертежа на печать.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum ProcessPlotState { NotPlotting = 0, ForegroundPlotting = 1, BackgroundPlotting = 2 }
Копировать Код
Public Enum ProcessPlotState NotPlotting = 0 ForegroundPlotting = 1 BackgroundPlotting = 2 End Enum
 Члены
 Члены
 Описание
 BackgroundPlotting
 Значение: 2. Вывод на печать выполняется в фоновом режиме.
 ForegroundPlotting
 Значение: 1. Вывод на печать выполняется в текущем процессе.
 NotPlotting
 Значение: 0. Печать не выполняется.
 Описание
 Перечисление ProcessPlotState определяет значения, описывающие текущий процесс вывода чертежа на печать.
 Ваши комментарии по поводу этого топика: Послать отзыв!