Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Делегат HostMgd.ApplicationServices.DocumentDestroyedEventHandler
 Послать отзыв
 Делегат события уничтожения документа Событие класса DocumentCollection
 Синтаксис
C#
Visual Basic
public delegate DocumentDestroyedEventHandler();
Public Delegate Sub DocumentDestroyedEventHandler()
 Ваши комментарии по поводу этого топика: Послать отзыв!