Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.StdConfiguration
 Послать отзыв
 Данное перечисление определяет стандартные конфигурационные файлы PC3 устройств вывода, которые устанавливаются по умолчанию вместе с nanoCAD.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum StdConfiguration { NoneDevice = 0, DefaultWindowsSysPrinter = 1, Dwf6ePlot = 2, DwfEplotOptForPlotting = 3, DwfEplotOptForViewing = 4, PublishToWebDwf = 5, PublishToWebJpg = 6, PublishToWebPng = 7, DWFxePlot = 8, PublishToWebDWFx = 9 }
Копировать Код
Public Enum StdConfiguration NoneDevice = 0 DefaultWindowsSysPrinter = 1 Dwf6ePlot = 2 DwfEplotOptForPlotting = 3 DwfEplotOptForViewing = 4 PublishToWebDwf = 5 PublishToWebJpg = 6 PublishToWebPng = 7 DWFxePlot = 8 PublishToWebDWFx = 9 End Enum
 Члены
 Члены
 Описание
 DefaultWindowsSysPrinter
 Значение: 1. Устройство, представляющее принтер по умолчанию в системе Windows.
 Dwf6ePlot
 Значение: 2. Устройство, предназначенное для печати чертежа в файл формата DWF6.
 DwfEplotOptForPlotting
 Значение: 3. Устройство для печати чертежа в файл формата DWF с оптимизацией для вывода чертежей на печать.
 DwfEplotOptForViewing
 Значение: 4. Устройство для печати чертежа в файл формата DWF с оптимизацией для просмотра чертежей на экране.
 DWFxePlot
 Значение: 8. Устройство, предназначенное для печати чертежа в файл формата DWF.
 NoneDevice
 Значение: 0. Устройство "None", являющееся устройством по умолчанию в отсутствие реальных устройств вывода.
 PublishToWebDwf
 Значение: 5. Устройство, предназначенное для печати чертежа в файл формата DWF с целью последующей публикации в интернете.
 PublishToWebDWFx
 Значение: 9. Устройство, предназначенное для печати чертежа в файл формата DWFx с целью последующей публикации в интернете.
 PublishToWebJpg
 Значение: 6. Устройство, предназначенное для печати чертежа в файл формата JPG с целью последующей публикации в интернете.
 PublishToWebPng
 Значение: 7. Устройство, предназначенное для печати чертежа в файл формата PNG с целью последующей публикации в интернете.
 Описание
 Перечисление StdConfiguration определяет стандартные конфигурационные файлы PC3 устройств вывода, которые устанавливаются по умолчанию вместе с nanoCAD.
 Ваши комментарии по поводу этого топика: Послать отзыв!