Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Класс HostMgd.EditorInput.Jig
 Послать отзыв
 Класс Jig предназначен для создания пользовательских примитивов или группы пользовательских примитивов в интерактивном режиме.
 Иерархия классов
HostMgd::EditorInput::Jig
 Синтаксис
C#
Visual Basic
public class Jig;
Public Class Jig
 Описание
 Технология Jig позволяет создавать пользовательские примитивы/группы примитивов в динамике, посредством наблюдения за их изменением во время перетаскивания курсора мыши на экране.
 Абстрактный класс. Является базовым классом для классов DrawJig и EntityJig. Класс позволет создавать пользовательские примитивы или группы пользовательских примитивов в интерактивном режиме (далее технология Jig).
 Во время создания примитива/группы примитивов с помощью технологии Jig происходит цикличный процесс, во время которого:
берутся данные о положении курсора мыши на экране;
данные преобразуются в параметры, необходимые для построения создаваемого объекта/группы объектов;
вывод на экран графического представления создаваемого объекта/группы объектов.
 Таким образом, технология Jig позволяет создавать пользовательские примитивы/группы примитивов в динамике, посредством наблюдения за их изменением во время перетаскивания курсора мыши на экране.
 Топики
 Имя
 Описание
 Jig Методы
 Ниже перечислены методы класса Jig.
 Ссылки
 Jig Методы, Топики, Jig Методы
 Ваши комментарии по поводу этого топика: Послать отзыв!