Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.PromptingForKeyword
 Послать отзыв
 Событие возникает при начале операции ввода ключевого слова, позволяя настроить доступные варианты и сообщение приглашения. Событие не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public event PromptKeywordOptionsEventHandler PromptingForKeyword;
Копировать Код
Public Event PromptingForKeyword As PromptKeywordOptionsEventHandler
 Описание
 Событие инициируется перед началом интерактивного ввода ключевого слова — например, при вызове метода GetString() с заданным набором ключевых слов. Оно предоставляет доступ к параметрам ввода через объект PromptKeywordOptionsEventArgs, что позволяет динамически изменять:
текст приглашения (Message),
список доступных ключевых слов (Keywords),
глобальные ключевые слова ,
режимы ввода (например, обязательный выбор).
 Это событие особенно полезно при разработке команд, где требуется гибкая настройка диалога с пользователем — например, выбор действия из списка: "Да/Нет", "Включить/Отключить", "Сохранить/Отмена".
 Событие реализуется через делегат PromptKeywordOptionsEventHandler и вызывается до отображения запроса, что позволяет адаптировать параметры ввода в зависимости от контекста чертежа или состояния приложения.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события PromptingForKeyword [Teigha.Runtime.CommandMethod("PromptingForKeywordExample")] public void PromptingForKeywordExample() { // Подписка на событие PromptingForKeyword editor.PromptingForKeyword += OnEditorPromptingForKeyword; } // Реализация отработки события PromptingForKeyword private void OnEditorPromptingForKeyword(object sender, PromptKeywordOptionsEventArgs e) { // Изменение сообщения e.Options.Message = "Выберите действие:"; // Добавление ключевых слов e.Options.Keywords.Add("Включить"); e.Options.Keywords.Add("Отключить"); e.Options.Keywords.Add("По умолчанию"); } }
 Порядок работы с событием:
Вызывается команда, требующая ввода ключевого слова.
Перед началом ввода генерируется событие PromptingForKeyword.
Разработчик может изменить параметры через e.Options.
Пользователь выбирает или вводит ключевое слово.
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!