Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод MenuItemCollection.Clear
 Послать отзыв
 This is Clear, a member of class MenuItemCollection.
 Синтаксис
C#
Visual Basic
public void Clear();
Public Sub Clear()
 Ссылки
 MenuItemCollection Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!