Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptSelectionOptionsEventHandler(object,PromptSelectionOptionsEventArgs)
 Послать отзыв
 Делегат предназначен для обработки события, возникающего перед началом операции выбора объектов, и позволяет настроить параметры команды выборки.
 Синтаксис
C#
Visual Basic
Копировать Код
public delegate void PromptSelectionOptionsEventHandler(object sender, PromptSelectionOptionsEventArgs e);
Копировать Код
Public Delegate Sub PromptSelectionOptionsEventHandler(sender As Object, e As PromptSelectionOptionsEventArgs)
 Параметры
 Параметры
 Описание
 sender
 Источник события — обычно экземпляр редактора (Editor), в котором происходит операция выбора объектов. Тип object
 e
 Объект, содержащий параметры выбора. Тип PromptSelectionOptionsEventArgs
 Описание
 Делегат используется как сигнатура метода-обработчика для события PromptingForSelection, которое генерируется перед началом интерактивного выбора одного или нескольких объектов в редакторе nanoCAD. Он позволяет разработчику изменить параметры операции выбора — такие как сообщение, режим выбора, ключевые слова и разрешения — до того, как пользователь начнёт взаимодействовать с командой.
 Этот делегат применяется при реализации команд, требующих выделения объектов, и обеспечивает гибкость при настройке поведения выборки в зависимости от контекста — например, при фильтрации объектов, установке подсказок или управлении режимами выделения.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события PromptingForSelection [Teigha.Runtime.CommandMethod("PromptingForSelectionExample")] public void PromptingForSelectionExample() { // Подписка на событие PromptingForSelection editor.PromptingForSelection += OnEditorPromptingForSelection; } // Реализация отработки события PromptingForSelection private void OnEditorPromptingForSelection(object sender, PromptSelectionOptionsEventArgs e) { // Изменение текста приглашения e.Options.MessageForAdding = "Выберите объект для обработки:"; // Разрешить выбор только одного объекта e.Options.SingleOnly = true; // Добавление ключевых слов e.Options.Keywords.Add("Все"); e.Options.Keywords.Add("Фильтр"); } }
 Ваши комментарии по поводу этого топика: Послать отзыв!