Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор PromptCornerOptions.PromptCornerOptions (String^, Teigha::Geometry::Point3d)
 Послать отзыв
 Синтаксис
C#
Visual Basic
public PromptCornerOptions(ref String message, Teigha::Geometry::Point3d basePoint);
Public Sub New(ByRef message As String, basePoint As Teigha.Geometry.Point3d)
 Параметры
 Параметры
 Описание
 message
 Приглашающее сообщение
 basePoint
 Базовая точка
 Описание
 Конструктор.
 Ссылки
 PromptCornerOptions Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!