Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptStringResultEventArgs.Result
 Послать отзыв
 Свойство возвращает результат операции интерактивного ввода строки, включая статус и значение, введённое пользователем.
 Синтаксис
C#
Visual Basic
Копировать Код
public PromptResult Result { get; }
Копировать Код
Public ReadOnly Property Result As PromptResult
 Возвращает
 Возвращает экземпляр класса PromptResult, содержащий:
Status — статус завершения операции ввода (OK, Cancel, Error и др.).
StringResult — строковое значение, введённое пользователем.
InputString — исходная строка, если она была изменена или введена с клавиатуры.
 Если операция не завершена успешно, результат может содержать пустую строку или сообщение об отмене/ошибке.
 Описание
 Свойство предоставляет доступ к объекту типа PromptResult, который содержит информацию о завершении операции ввода строки или ключевого слова — например, после вызова метода GetString() или обработки события PromptedForKeyword. Оно позволяет получить:
статус операции (PromptStatus.OK, PromptStatus.Cancel, PromptStatus.Error и др.),
введённую строку через Value (если доступно),
исходный текстовый ввод , если пользователь ввёл значение вручную.
 Свойство доступно только для чтения и автоматически обновляется при завершении интерактивной команды ввода строки.
 Условия
 Только чтение
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события PromptedForKeyword [Teigha.Runtime.CommandMethod("PromptedForKeywordExample_Result")] public void PromptedForKeywordExample_Result() { // Подписка на событие PromptedForKeyword editor.PromptedForKeyword += OnEditorPromptedForKeyword; } // Реализация отработки события PromptedForKeyword  private void OnEditorPromptedForKeyword(object sender, PromptStringResultEventArgs e) { // Получаем доступ к результату запроса PromptResult result = e.Result; // Вывод сообщения в командную строку if (result.Status == PromptStatus.OK) { editor.WriteMessage($"\nВведено ключевое слово: {result.StringResult}"); } else { editor.WriteMessage("\nВвод ключевого слова отменён."); } } }
 Ссылки
 HostMgd.EditorInput.PromptStringResultEventArgs, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!