Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.Application.ShowModelessWindow(System.Windows.Window)
 Послать отзыв
 Метод предназначен для вызова WPF-формы в немодальном режиме.
 Синтаксис
C#
Visual Basic
Копировать Код
public static void ShowModelessWindow(System.Windows.Window formToShow);
Копировать Код
Public Shared Sub ShowModelessWindow(formToShow As System.Windows.Window)
 Параметры
 Параметры
 Описание
 formToShow
 Форма, которая должна быть показана
 Описание
 Метод вызывает WPF-форму в немодальном режиме.
 Ссылки
 HostMgd.ApplicationServices.Application, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!