Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 JigPromptGeometryOptions.JigPromptGeometryOptions(String)
 Послать отзыв
 Конструктор класса с одним параметром.
 Синтаксис
C#
Visual Basic
public JigPromptGeometryOptions(ref System.String message);
Public Sub New(ByRef message As System.String)
 Параметры
 Параметры
 Описание
 message
 Текстовое сообщение, приглашающее предоставить данные для дальнейших действий с объектом или группой объектов.
 Описание
 Конструктор класса. Присваивает свойству Message значение параметра message Также конструктор устанавливает значение свойства Cursor равное CursorType.Crosshair (перекрестие).
 Ссылки
 JigPromptGeometryOptions Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!