Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptForSelectionEndingEventArgs.Remove(int)
 Послать отзыв
 Метод удаляет объект из набора выделенных элементов по указанному индексу.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Remove(int index);
Копировать Код
Public Sub Remove(index As Integer)
 Параметры
 Параметры
 Описание
 index
 Порядковый номер удаляемого объекта в наборе выделенных элементов. Нумерация начинается с 0. Тип int
 Описание
 Метод используется для удаления объекта из коллекции выбранных элементов (SelectionSet) по его позиции в списке. Это позволяет программно изменять состав выделения, исключая определённые объекты перед выполнением команд, таких как перемещение, удаление или редактирование. Метод особенно полезен при обработке событий, где требуется фильтрация или коррекция выборки перед её использованием.
 Замечания
 Если указанный индекс выходит за пределы диапазона, будет выброшено исключение ArgumentOutOfRangeException.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события PromptForSelectionEnding [Teigha.Runtime.CommandMethod("PromptForSelectionEndingExample_Remove")] public void PromptForSelectionEndingExample_Remove() { // Подписка на событие PromptForSelectionEnding editor.PromptForSelectionEnding += OnEditorPromptForSelectionEnding; } // Реализация отработки события PromptForSelectionEnding private void OnEditorPromptForSelectionEnding(object sender, PromptForSelectionEndingEventArgs e) { if (e.Selection.Count > 0) { // Вывод сообщения в командную строку editor.WriteMessage( $"\nВыбрано объектов: {e.Selection.Count}"); // Удаляем первый объект из выборки e.Remove(0); editor.WriteMessage("\nПервый объект удален из выборки."); } } }
 Ссылки
 HostMgd.EditorInput.PromptForSelectionEndingEventArgs, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!