Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PointInputEventArgs.Context
 Послать отзыв
 Свойство Context возвращает контекст выделения точки как экземпляр класса InputPointContext. Не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public HostMgd.EditorInput.InputPointContext Context;
Копировать Код
Public ReadOnly Property Context As HostMgd.EditorInput.InputPointContext
 Возвращает
 Возвращает контекст выделения точки. Тип HostMgd.EditorInput.InputPointContext.
 Описание
 Свойство Context возвращает контекст выделения точки как экземпляр класса InputPointContext. Контекст обеспечивает доступ к таким свойствам как документ, ответственный за создание события, объектная привязка точки и многим другим.
 В текущей версии не реализовано.
 Условия
 Только чтение.
 Ссылки
 HostMgd.EditorInput.PointInputEventArgs, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!