Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PaletteSet.Size
 Послать отзыв
 Размеры окна.
 Синтаксис
C#
Visual Basic
public System.Drawing.Size Size;
Public Property Size() As System.Drawing.Size
 Описание
 Ссылки
 PaletteSet Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!