Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Перечисление HostMgd.Windows.PaletteSetStyles
 Послать отзыв
 This is record HostMgd::Windows::PaletteSetStyles.
 Синтаксис
C#
Visual Basic
[Flags] public enum PaletteSetStyles { NameEditable = 0x10, Notify = 0x400, ShowAutoHideButton = 2, ShowCloseButton = 8, ShowPropertiesMenu = 4, ShowTabForSingle = 0x40, SingleRowDock = 0x200, Snappable = 0x20, UsePaletteNameAsTitleForSingle = 0x80 }
<Flags> Public Enum PaletteSetStyles NameEditable = &H10 Notify = &H400 ShowAutoHideButton = 2 ShowCloseButton = 8 ShowPropertiesMenu = 4 ShowTabForSingle = &H40 SingleRowDock = &H200 Snappable = &H20 UsePaletteNameAsTitleForSingle = &H80 End Enum
 Ваши комментарии по поводу этого топика: Послать отзыв!