Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.InputPointContext.GetAlignmentPaths()
 Послать отзыв
 Метод предназначен для получения массива кривых, определяющих направления автоматического выравнивания при интерактивном вводе точки в nanoCAD.
 Синтаксис
C#
Visual Basic
Копировать Код
public Curve3d[] GetAlignmentPaths();
Копировать Код
Public Function GetAlignmentPaths() As Curve3d[]
 Возвращает
 Возвращает массив объектов типа Curve3d[], каждый из которых представляет собой направление или траекторию, используемую для выравнивания курсора.
 Если направления отсутствуют, возвращается пустой массив. Если контекст не поддерживает выравнивание, может вернуть null. Поддерживаемые типы:
Line3d — направления ортогонального/полярного отслеживания.
LineSeg3d — расширенные рёбра объектов.
EllipArc3d — дуговые направляющие.
 Описание
 Метод используется для извлечения геометрических путей выравнивания, активных в текущем контексте ввода — например, при включённом ортогональном режиме, полярном отслеживании или использовании объектной привязки.
 Эти пути формируют визуальные направляющие, которые помогают пользователю точно указывать точки при рисовании и редактировании. Метод особенно полезен при разработке пользовательских инструментов ввода — таких как PointFilter или PointMonitor, где требуется анализировать или дополнять стандартное поведение привязки.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class InputPointContextExamples { // Метод команды, которая получает массив кривых, // являющихся направляющими для автоматического выравнивания // при интерактивном вводе точки [Teigha.Runtime.CommandMethod("GetAlignmentPathsExample")] public void GetAlignmentPathsExample() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Метод для отработки события редактора PointMonitor editor.PointMonitor += (sender, e) => { // Сохраняем контекст события в преременную InputPointContext context = e.Context; if (context != null) { Curve3d[] paths = context.GetAlignmentPaths(); if (paths != null && paths.Length > 0) { foreach (Curve3d path in paths) { // Выводим в командную строку направление выравнивания // только если это прямая линия if (path is Line3d line) { editor.WriteMessage($"\nАктивное направление: {line.Direction}"); } } } } }; } }
 Ссылки
 HostMgd.EditorInput.InputPointContext, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!