Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptDoubleResult.ToString()
 Послать отзыв
 Метод возвращает строковое представление вещественного числа, введённого пользователем в ходе интерактивной операции.
 Синтаксис
C#
Visual Basic
Копировать Код
public override string ToString();
Копировать Код
Public Overrides Function ToString() As String
 Возвращает
 Возвращает значение типа string, представляющее собой текстовое отображение введённого пользователем вещественного числа (например, "45.0" или "3.14159"). Если значение не было введено или операция была отменена, может вернуть пустую строку или строку с информацией о статусе операции.
 Описание
 Метод переопределяет стандартный метод Object.ToString() и предоставляет строковое значение результата ввода угла или расстояния, полученного от пользователя через такие команды, как GetAngle() или GetDistance(). Он используется для удобного отображения или логгирования введённого значения, включая его форматированное представление в зависимости от контекста операции.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("PromptDoubleResultExample_ToString")] public void PromptDoubleResultExample_ToString() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Вызываем метод GetDistance для запроса данных у пользователя PromptDoubleResult result = editor.GetDistance("Введите расстояние:"); // Если все данные введены, выводим результат в командную строку if (result.Status == PromptStatus.OK) { string valueStr = result.ToString(); editor.WriteMessage($"\nВведённое расстояние: {valueStr}"); } else { editor.WriteMessage("\nВвод отменён."); } } }
 Ссылки
 HostMgd.EditorInput.PromptDoubleResult, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!