Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.Windows.ToolPalette.CustomToolBase.SetUnspecified
 Послать отзыв
 Метод позволяет определить, использует ли указанное свойство представление "не указано" (unspecified). Не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetUnspecified( ref System.Object id, bool isUnspecified );
Копировать Код
Public Overridable Sub SetUnspecified( ByRef id As System.Object, isUnspecified As Boolean )
 Параметры
 Параметры
 Описание
 id
 Входной идентификатор свойства. Тип System.Object.
 isUnspecified
 Флаг, определяющий, использует ли указанное по id свойство представление "не указано" (unspecified). Тип bool.
 Описание
 Метод позволяет определить, использует ли указанное по id свойство представление "не указано" (unspecified).
 В текущей версии не реализован.
 Ссылки
 HostMgd.Windows.ToolPalette.CustomToolBase, HostMgd.Windows.ToolPalette
 Ваши комментарии по поводу этого топика: Послать отзыв!