Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PlotLogger.WarningHasHappenedInSheet
 Послать отзыв
 Только для чтения
 Синтаксис
C#
Visual Basic
public bool WarningHasHappenedInSheet;
Public Property WarningHasHappenedInSheet() As bool
 Ссылки
 PlotLogger Класс, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!