Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.Document
 Послать отзыв
 Класс представляет dwg-документ. Каждый чертеж ассоциируется с этим классом.
 Иерархия классов
HostMgd::ApplicationServices::Document
 Синтаксис
C#
Visual Basic
[Wrapper("HostApDocument")] public class Document : DisposableWrapper;
<Wrapper("HostApDocument")> Public Class Document Inherits DisposableWrapper
 Описание
 Класс представляет dwg-документ. Каждый открытый чертёж ассоциируется с объектом Document. Этот объект содержит такую информацию об открытом чертеже, как имя файла, объект CDocument MFC, текущую базу данных и формат для сохранения текущего чертежа.
 Пример
 Копировать Код
// Получение ссылки на активный документ через менеджер документа HostMgd.ApplicationServices.Document doc = HostMgd.ApplicationServices.Application.DocumentManager.MdiActiveDocument; // Получение ссылки на редактор документа HostMgd.EditorInput.Editor ed = doc.Editor;
 Топики
 Имя
 Описание
 Document Методы
 Ниже перечислены методы класса Document.
 Document Свойства
 Ниже перечислены свойства класса Document.
 Document События
 Ниже перечислены события класса Document.
 Ссылки
 Document Методы, Document Свойства, Document События, Топики, Document Методы, Document Свойства, Document События
 Ваши комментарии по поводу этого топика: Послать отзыв!