Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.Rollover
 Послать отзыв
 Событие возникает при наведении курсора на графический примитив, вызывая его подсветку и позволяя выполнить действие на основе объекта под курсором. Событие не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public event RolloverEventHandler Rollover;
Копировать Код
Public Event Rollover As RolloverEventHandler
 Описание
 Событие инициируется системой nanoCAD при перемещении курсора над геометрическим объектом, который поддерживает подсветку (например, линия, окружность, полилиния и др.). Оно срабатывает до выбора объекта и используется для реализации интерактивного поведения — например, отображения подсказок, визуальных эффектов, контекстной информации или динамического анализа объекта под курсором.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события Rollover [Teigha.Runtime.CommandMethod("RolloverExample")] public void RolloverExample() { // Подписка на событие Rollover editor.Rollover += OnEditorRollover; } // Реализация отработки события Rollover private void OnEditorRollover(object sender, RolloverEventArgs e) { ObjectId[] objId = e.Highlighted.GetObjectIds(); // Вывод информации о подсвеченных объектах editor.WriteMessage($"\nКурсор над {objId.Length} объектом(ами)"); for (int i = 0; i < objId.Length; i++) editor.WriteMessage($"\n{objId}"); } }
 Порядок работы с событием:
Пользователь перемещает курсор по чертежу.
Курсор наводится на объект, поддерживающий подсветку.
Генерируется событие Rollover.
Разработчик получает доступ к объекту и может выполнить действие.
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!