Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод PublishEntityEventArgs.AddPropertyBag
 Послать отзыв
 This is AddPropertyBag, a member of class PublishEntityEventArgs.
 Синтаксис
C#
Visual Basic
public bool AddPropertyBag(ref HostMgd::Publishing::EPlotPropertyBag properties);
Public Function AddPropertyBag(ByRef properties As HostMgd.Publishing.EPlotPropertyBag) As bool
 Ссылки
 PublishEntityEventArgs Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!