Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Window.DeviceIndependentSize
 Послать отзыв
 This is DeviceIndependentSize, a member of class Window.
 Синтаксис
C#
Visual Basic
public System.Windows.Size DeviceIndependentSize;
Public Property DeviceIndependentSize() As System.Windows.Size
 Ссылки
 Window Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!