Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PaneCollection.Item
 Послать отзыв
 This is Item, a member of class PaneCollection.
 Синтаксис
C#
Visual Basic
public HostMgd::Windows::Pane Item;
Public Property Item() As HostMgd.Windows.Pane
 Ссылки
 PaneCollection Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!