Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.GraphicsSystem.Manager.ViewToBeDestroyed
 Послать отзыв
 Событие ViewToBeDestroyed выпускается непосредственно перед уничтожением вида.
 Синтаксис
C#
Visual Basic
Копировать Код
public event Teigha.GraphicsSystem.ViewToBeDestroyedEventHandler ViewToBeDestroyed;
Копировать Код
Public Event ViewToBeDestroyed As Teigha.GraphicsSystem.ViewToBeDestroyedEventHandler
 Возвращает
 Возвращает делегат типа Teigha.GraphicsSystem.ViewToBeDestroyedEventHandler.
 Описание
 Событие ViewToBeDestroyed выпускается непосредственно перед уничтожением вида.
 Ссылки
 HostMgd.GraphicsSystem.Manager, HostMgd.GraphicsSystem
 Ваши комментарии по поводу этого топика: Послать отзыв!