Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.DsdData.DsdData
 Послать отзыв
 Конструктор по умолчанию класса DsdData. Не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public DsdData();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса DsdData. В текущей версии не реализован.
 Ссылки
 HostMgd.PlottingServices.DsdData, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!