Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Делегат HostMgd.EditorInput.DraggingEndedEventHandler
 Послать отзыв
 Делегат уведомления о конце метода перетаскивания класса Edit
 Синтаксис
C#
Visual Basic
public delegate DraggingEndedEventHandler();
Public Delegate Sub DraggingEndedEventHandler()
 Ваши комментарии по поводу этого топика: Послать отзыв!