Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство StatusBarItem.Icon
 Послать отзыв
 This is Icon, a member of class StatusBarItem.
 Синтаксис
C#
Visual Basic
public System.Drawing.Icon Icon;
Public Property Icon() As System.Drawing.Icon
 Ссылки
 StatusBarItem Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!