Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PaletteAddContextMenuEventArgs.HitFlag
 Послать отзыв
 This is HitFlag, a member of class PaletteAddContextMenuEventArgs.
 Синтаксис
C#
Visual Basic
public int HitFlag;
Public Property HitFlag() As Integer
 Ссылки
 PaletteAddContextMenuEventArgs Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!