Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.PromptingForEntity
 Послать отзыв
 Событие возникает при начале операции выбора геометрического объекта и позволяет настроить параметры команды выбора до её запуска. Событие не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public event PromptEntityOptionsEventHandler PromptingForEntity;
Копировать Код
Public Event PromptingForEntity As PromptEntityOptionsEventHandler
 Описание
 Событие инициируется перед началом интерактивного выбора объекта — например, при вызове метода GetEntity() в .NET API nanoCAD. Оно предоставляет доступ к параметрам выбора через объект PromptEntityOptionsEventArgs, что позволяет разработчику динамически изменять:
текст приглашения (Message),
допустимые типы объектов (линии, окружности, блоки и др.),
ключевые слова ,
режимы ввода (например, AllowNone, AllowArbitraryInput).
 Это событие особенно полезно при реализации команд, где требуется фильтрация объектов или контекстная настройка поведения ввода — например, при создании редакторов, фильтров выборки или параметрических операций.
 Событие вызывается до отображения запроса пользователю, что позволяет модифицировать параметры ввода в реальном времени.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события PromptingForEntity [Teigha.Runtime.CommandMethod("PromptingForEntityExample")] public void PromptingForEntityExample() { // Подписка на событие PromptingForEntity editor.PromptingForEntity += OnEditorPromptingForEntity; } // Реализация отработки события PromptingForEntity private void OnEditorPromptingForEntity(object sender, PromptEntityOptionsEventArgs e) { // Изменение сообщения приглашения e.Options.Message = "Выберите линию или окружность:"; // Классы объектов, которые можно выбирать e.Options.AddAllowedClass(typeof(Line3d),true); e.Options.AddAllowedClass(typeof(Circle),true); // Можно ничего не выбрать e.Options.AllowNone = true; } }
 Порядок работы с событием:
Вызывается метод GetEntity().
Генерируется событие PromptingForEntity.
Разработчик изменяет параметры выбора.
Пользователь выбирает объект или отменяет операцию.
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!