Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство TrayItemBubbleWindow.Title
 Послать отзыв
 This is Title, a member of class TrayItemBubbleWindow.
 Синтаксис
C#
Visual Basic
public System.String Title;
Public Property Title() As System.String
 Ссылки
 TrayItemBubbleWindow Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!