Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор PalettePersistEventArgs.PalettePersistEventArgs
 Послать отзыв
 This is PalettePersistEventArgs, a member of class PalettePersistEventArgs.
 Синтаксис
C#
Visual Basic
public PalettePersistEventArgs(ref HostMgd::ApplicationServices::IConfigurationSection configurationSection);
Public Sub New(ByRef configurationSection As HostMgd.ApplicationServices.IConfigurationSection)
 Ссылки
 PalettePersistEventArgs Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!