Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.BeginPlotEventArgs.PlotProgress
 Послать отзыв
 Свойство PlotProgress предоставляет доступ к описанию поведения диалога прогресса печати.
 Синтаксис
C#
Visual Basic
Копировать Код
public HostMgd.PlottingServices.PlotProgress PlotProgress;
Копировать Код
Public ReadOnly Property PlotProgress As HostMgd.PlottingServices.PlotProgress
 Возвращает
 Возвращает объект типа HostMgd.PlottingServices.PlotProgress, который определяет поведение диалогового окна прогресса печати.
 Описание
 Свойство PlotProgress предоставляет доступ к описанию поведения диалога прогресса печати.
 Условия
 Только чтение.
 Ссылки
 HostMgd.PlottingServices.BeginPlotEventArgs, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!