Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PublishSheetEventArgs.EffectivePlotOffsetYDevice
 Послать отзыв
 This is EffectivePlotOffsetYDevice, a member of class PublishSheetEventArgs.
 Синтаксис
C#
Visual Basic
public int EffectivePlotOffsetYDevice;
Public Property EffectivePlotOffsetYDevice() As Integer
 Ссылки
 PublishSheetEventArgs Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!