Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.DsdData.IsSheetSet
 Послать отзыв
 Свойство IsSheetSet позволяет определить, представляет ли этот объект DsdData подшивку листов. Не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsSheetSet;
Копировать Код
Public Property IsSheetSet As Boolean
 Возвращает
 Возвращает true, если этот объект представляет данные подшивки листов. В противном случае возвращает false.
 Описание
 Свойство IsSheetSet позволяет определить, представляет ли этот объект DsdData данные подшивки листов. Это поле сохраняется в файле DSD.
 В текущей версии не реализовано.
 Условия
 Чтение и запись.
 Ссылки
 HostMgd.PlottingServices.DsdData, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!