Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.PlotInfoValidator.MediaMatchingThreshold
 Послать отзыв
 Свойство MediaMatchingThreshold представляет текущий порог соответствия носителей, который представляет собой максимум из всех значений ошибок, который допускается при сопоставлении характеристик носителей.
 Синтаксис
C#
Visual Basic
Копировать Код
public int MediaMatchingThreshold;
Копировать Код
Public Property MediaMatchingThreshold As Integer
 Возвращает
 Возвращает пороговое значение для сопоставления характеристик носителей. Тип int.
 Описание
 Свойство MediaMatchingThreshold представляет текущий порог соответствия носителей, который представляет собой максимум из всех значений ошибок, который допускается при сопоставлении характеристик носителей.
 Политика сопоставления носителей сопоставляет размеры носителей, сравнивая желаемые размер и комплекс свойств носителя (указанные в объекте листа (layout) или переопределениях) с размерами и свойствами носителей, доступными для указанного устройства вывода. Отклонения в этих свойствах умножаются на весовые коэффициенты, а затем суммируются. Совпадение фиксируется лишь в случае, если полученная взвешенная сумма отклонений не превышает пороговое значение для данного экземпляра носителя.
 Вычисление значения Match_Value для оценки соответствия можно представить следующим образом:
 Match_Value = (Разница в границах носителя * вес границ) (Разница в области печати * вес области печати) (Разница в размерах * вес размеров) (Разница в типе группы носителей * вес группы носителей)
 Подходящим считается любой носитель, для которого значение Match_Value меньше порогового значения соответствия носителя.
 Условия
 Чтение и запись.
 Ссылки
 HostMgd.PlottingServices.PlotInfoValidator, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!