Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.SelectAll(SelectionFilter)
 Послать отзыв
 Метод выбирает все объекты в текущем пространстве чертежа, соответствующие заданному фильтру, и возвращает их в виде набора выделенных объектов.
 Синтаксис
C#
Visual Basic
Копировать Код
public PromptSelectionResult SelectAll(SelectionFilter filter);
Копировать Код
Public Function SelectAll(filter As SelectionFilter) As PromptSelectionResult
 Параметры
 Параметры
 Описание
 filter
 Фильтр выборки, определяющий, какие объекты будут включены в результат. Фильтр строится на основе массива TypedValue, где указываются условия по типу объекта, слою, цвету и другим свойствам. Тип SelectionFilter.
 Возвращает
 Возвращает объект типа PromptSelectionResult, содержащий:
Status — статус выполнения (OK, Cancel, Error и др.). Если выборка успешна, статус равен PromptStatus.OK.
Value — объект типа SelectionSet, содержащий список идентификаторов (ObjectId) выбранных объектов, прошедших фильтрацию.
InputString — строковое значение, если операция была прервана пользователем с помощью клавиатуры.
 Если ни один объект не соответствует фильтру, Value может быть null, а статус — отличным от OK.
 Описание
 Метод предназначен для программного выбора всех доступных объектов в пространстве модели или листа с применением фильтра, который ограничивает выборку только теми объектами, которые удовлетворяют заданным критериям. Это позволяет выполнять массовые операции над определённым типом объектов — например, только линиями, окружностями или объектами конкретного слоя. Результат возвращается в виде объекта PromptSelectionResult.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("SelectAllExample_SelectionFilter")] public void SelectAllExample_SelectionFilter() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Фильтр: выбрать все объекты типа Line SelectionFilter filter = new SelectionFilter(new TypedValue[] { new TypedValue((int)DxfCode.Start, "LINE") }); // Вызываем метод PromptSelectionResult result = editor.SelectAll(filter); // Выводим сообщение в командную строку if (result.Status == PromptStatus.OK) { SelectionSet selectedLines = result.Value; editor.WriteMessage( $"\nВыбрано линий: {selectedLines.Count}"); } else { editor.WriteMessage( "\nНе найдено объектов, соответствующих фильтру."); } } }
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!