Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство SystemVariableChangedEventArgs.Name
 Послать отзыв
 Синтаксис
C#
Visual Basic
public System.String Name;
Public Property Name() As System.String
 Описание
 Возвращает имя измененной системной переменной.
 Условия
 Только на чтение
 Ссылки
 SystemVariableChangedEventArgs Класс, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!