Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Window.Location
 Послать отзыв
 Синтаксис
C#
Visual Basic
public System.Drawing.Point Location;
Public Property Location() As System.Drawing.Point
 Описание
 Предоставляет доступ к точке размещения окна, определенной экранными координатами верхнего левого угла.
 Условия
 На чтение и запись
 Ссылки
 Window Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!