Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Делегат HostMgd.Windows.PaletteSetSizeEventHandler
 Послать отзыв
 This is type HostMgd::Windows::PaletteSetSizeEventHandler.
 Синтаксис
C#
Visual Basic
public delegate PaletteSetSizeEventHandler();
Public Delegate Sub PaletteSetSizeEventHandler()
 Ваши комментарии по поводу этого топика: Послать отзыв!