Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод MenuItemCollection.Remove (HostMgd::Windows::MenuItem^)
 Послать отзыв
 This is Remove, a member of class MenuItemCollection.
 Синтаксис
C#
Visual Basic
public void Remove(ref HostMgd::Windows::MenuItem value);
Public Sub Remove(ByRef value As HostMgd.Windows.MenuItem)
 Ссылки
 MenuItemCollection Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!