Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство BeginPublishingSheetEventArgs.DsdEntry
 Послать отзыв
 This is DsdEntry, a member of class BeginPublishingSheetEventArgs.
 Синтаксис
C#
Visual Basic
public HostMgd::PlottingServices::DsdEntry DsdEntry;
Public Property DsdEntry() As HostMgd.PlottingServices.DsdEntry
 Ссылки
 BeginPublishingSheetEventArgs Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!