Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptEntityResult
 Послать отзыв
 Класс содержит результат операции выбора геометрического объекта, выполненной пользователем через интерактивное приглашение.
 Иерархия классов
HostMgd::EditorInput::PromptResult HostMgd::EditorInput::PromptEntityResult
 Синтаксис
C#
Visual Basic
Копировать Код
public class PromptEntityResult : PromptResult
Копировать Код
Public Class PromptEntityResult Inherits PromptResult
 Описание
 Класс наследуется от базового класса PromptResult и используется для хранения данных о результате операции выбора геометрического объекта в чертеже nanoCAD. Он применяется после вызова методов ввода, таких как GetEntity(), и предоставляет информацию:
Status — статус завершения операции (OK, Cancel, Error и др.).
ObjectId — идентификатор выбранного объекта.
PickedPoint — координата точки, где был выбран объект (в мировой системе координат, WCS).
InputString — строковое значение, если операция была прервана клавиатурным вводом.
 Этот класс играет ключевую роль при обработке пользовательского выбора объектов, позволяя разработчикам надстроек nanoCAD выполнять дальнейшие действия с выбранным элементом чертежа.
 Замечания
 Данный класс может быть использован совместно с событием PromptedForEntity или методами ввода, которые возвращают результат выборки объекта.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("GetEntityExample")] public void GetEntityExample() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создаём запрос пользователю PromptEntityOptions options = new PromptEntityOptions("\nВыберите объект:"); // Вызываем метод GetEntity() для запроса объекта PromptEntityResult result = editor.GetEntity(options); // Если все данные введены, выводим результат в командную строку if (result.Status == PromptStatus.OK) { editor.WriteMessage( $"\nВыбран объект с ID: {result.ObjectId}, точка: {result.PickedPoint}"); } else { editor.WriteMessage( "\nОперация выбора отменена или объект не найден."); } } }
 Топики
 Имя
 Описание
 PromptResult Методы
 Ниже перечислены методы класса PromptResult.
 PromptResult Свойства
 Ниже перечислены свойства класса PromptResult.
 HostMgd.EditorInput.PromptEntityResult
 Имя
 Описание
 PromptEntityResult Методы
 Ниже перечислены методы класса PromptEntityResult.
 PromptEntityResult Свойства
 Ниже перечислены свойства класса PromptEntityResult.
 Ссылки
 PromptEntityResult Методы, PromptEntityResult Свойства, Топики, PromptResult Методы, PromptResult Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!