Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.DoPrompt(PromptOptions)
 Послать отзыв
 Метод выводит приглашение пользователю с заданными параметрами и возвращает результат ввода.
 Синтаксис
C#
Visual Basic
Копировать Код
public PromptResult DoPrompt(PromptOptions opt);
Копировать Код
Public Function DoPrompt(opt As PromptOptions) As PromptResult
 Параметры
 Параметры
 Описание
 opt
 Параметры приглашения, такие как:
 Возвращает
 Возвращается значение типа PromptResult, представляющее результат выполнения приглашения. Содержит информацию о статусе операции (успешно, отменено, введено неизвестное значение). Если ввод был успешным — может содержать введённое пользователем значение (Value, StringResult и др.). Используется для дальнейшей обработки ввода в зависимости от выбора пользователя.
 Описание
 Метод используется для отображения текстового приглашения в командной строке nanoCAD, сопровождаемого возможными вариантами ввода, и ожидает ответа пользователя. Он предоставляет гибкие настройки отображения и поведения приглашения через объект PromptOptions. После завершения ввода метод возвращает объект PromptResult, содержащий информацию о том, что ввёл пользователь или какая операция была прервана.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("DoPromptExample")] public void DoPromptExample() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создаём переменные c данными для запроса пользователю и делаем запрос PromptStringOptions options = new PromptStringOptions("\nВведите текст"); PromptResult result = editor.DoPrompt(options); // Проверяем результат. Если проверка пройдена, выводим сообщение в командную строку if (result.Status == PromptStatus.OK) { editor.WriteMessage(result.StringResult); } } }
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!