Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Класс HostMgd.EditorInput.PromptFileOptions
 Послать отзыв
 Базовый класс для параметров диалогового окна, появляющегося при открытии и сохранении пользователем файлов.
 Иерархия классов
HostMgd::EditorInput::PromptFileOptions
 Синтаксис
C#
Visual Basic
public class PromptFileOptions;
Public Class PromptFileOptions
 Топики
 Имя
 Описание
 PromptFileOptions Свойства
 Ниже перечислены свойства класса PromptFileOptions.
 Ссылки
 PromptFileOptions Свойства, Топики, PromptFileOptions Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!