Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Класс HostMgd.PlottingServices.PlotReactorManager
 Послать отзыв
 Класс менеджера событий печати.
 Иерархия классов
HostMgd::PlottingServices::PlotReactorManager
 Синтаксис
C#
Visual Basic
public class PlotReactorManager;
Public Class PlotReactorManager
 Описание
 Имеет только события. Используется путЄм создания экземпляра этого класса и привязывания к нему своих реакторов на события.
 Методы
 Конструкторы
 Имя
 Описание
 PlotReactorManager
 This is PlotReactorManager, a member of class PlotReactorManager.
 Топики
 Имя
 Описание
 PlotReactorManager События
 Ниже перечислены события класса PlotReactorManager.
 Ссылки
 PlotReactorManager События, Методы, Топики, PlotReactorManager События
 Ваши комментарии по поводу этого топика: Послать отзыв!