Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод OpenFileDialog.GetFilenames
 Послать отзыв
 This is GetFilenames, a member of class OpenFileDialog.
 Синтаксис
C#
Visual Basic
public array<System.String^> GetFilenames();
Public Function GetFilenames() As array<System.String^>
 Ссылки
 OpenFileDialog Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!