Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.PlotConfig.Comment
 Послать отзыв
 Свойство Comment возвращает комментарий к текущему устройству. Не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public System.String Comment;
Копировать Код
Public ReadOnly Property Comment() As System.String
 Возвращает
 Возвращает комментарий для текущего устройства.
 Тип System.String.
 Описание
 Свойство Comment возвращает комментарий, сохраненный для текущего устройства.
 В текущей версии не реализовано.
 Условия
 Только чтение.
 Ссылки
 HostMgd.PlottingServices.PlotConfig, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!