Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.Application
 Послать отзыв
 Класс представляет приложение nanoCAD. Имеет только статические методы.
 Иерархия классов
HostMgd::ApplicationServices::Application
 Синтаксис
C#
Visual Basic
public class Application;
Public Class Application
 Описание
 Данный класс нельзя наследовать, как базовый класс. Он обеспечивает доступ к таким объектам, как редактор nanoCAD, менеджер документов и главное окно приложения. Он также содержит методы для обновления экрана nanoCAD, вызываемой и контекстной справки.
 Топики
 Имя
 Описание
 Application Методы
 Ниже перечислены методы класса Application.
 Application Свойства
 Ниже перечислены свойства класса Application.
 Application События
 Ниже перечислены события класса Application.
 Ссылки
 Application Методы, Application Свойства, Application События, Топики, Application Методы, Application Свойства, Application События
 Ваши комментарии по поводу этого топика: Послать отзыв!