Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод MenuItemCollection.Insert (int, HostMgd::Windows::MenuItem^)
 Послать отзыв
 This is Insert, a member of class MenuItemCollection.
 Синтаксис
C#
Visual Basic
public void Insert(int index, ref HostMgd::Windows::MenuItem value);
Public Sub Insert(index As Integer, ByRef value As HostMgd.Windows.MenuItem)
 Ссылки
 MenuItemCollection Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!