Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.Document.Database
 Послать отзыв
 Свойство предоставляет доступ к базе данных dwg-документа.
 Синтаксис
C#
Visual Basic
Копировать Код
public Database Database;
Public Property Database() As Teigha.DatabaseServices.Database
 Возвращает
 Возвращает базу данных dwg-документа. Тип Database
 Описание
 Свойство предоставляет доступ к базе данных dwg-документа.
 Условия
 Только чтение
 Ссылки
 HostMgd.ApplicationServices.Document, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!