Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.PlotCancelledEventHandler(Object, EventArgs)
 Послать отзыв
 Делегат PlotCancelledEventHandler предназначен для обработки события PlotReactorManager.PlotCancelled, возникающего, когда пользователь отменил вывод задания на плоттер.
 Синтаксис
C#
Visual Basic
Копировать Код
public delegate void PlotCancelledEventHandler( Object sender, EventArgs e );
Копировать Код
Public Delegate Sub PlotCancelledEventHandler( sender As Object, e As EventArgs )
 Параметры
 Параметры
 Описание
 sender
 Объект, инициировавший событие. Тип Object.
 e
 Аргументы события. Тип EventArgs.
 Описание
 Делегат PlotCancelledEventHandler предназначен для обработки события PlotReactorManager.PlotCancelled, возникающего, когда пользователь отменил вывод задания на плоттер. Контекст события передается через параметры sender и e, где sender определяет объект-инициатор события, а аргумент e содержит параметры события.
 Ваши комментарии по поводу этого топика: Послать отзыв!