Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptPointResultEventHandler(object,PromptPointResultEventArgs)
 Послать отзыв
 Делегат предназначен для обработки событий, возникающих после завершения интерактивного ввода точки пользователем в редакторе nanoCAD.
 Синтаксис
C#
Visual Basic
Копировать Код
public delegate void PromptPointResultEventHandler(object sender, PromptPointResultEventArgs e);
Копировать Код
Public Delegate Sub PromptPointResultEventHandler(sender As Object, e As PromptPointResultEventArgs)
 Параметры
 Параметры
 Описание
 sender
 Источник события, обычно представляющий экземпляр редактора (Editor), в котором произошёл ввод точки. Тип object
 e
 Объект, содержащий данные о результате ввода точки:
 Описание
 Делегат используется при работе с методами и событиями, связанными с вводом точек — такими как GetCorner(), GetPoint() и другими. Он позволяет обрабатывать результат выбора или ввода координат пользователем, предоставляя доступ к объекту PromptPointResultEventArgs, который содержит статус операции и значение точки (Point3d). Данный тип делегата применяется в таких событиях, как PromptedForCorner, PromptedForPoint и других, где требуется получение позиции в мировой системе координат (WCS) после завершения ввода.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события PromptedForCorner [Teigha.Runtime.CommandMethod("PromptedForCornerExample")] public void PromptedForCornerExample() { // Подписка на событие PromptedForCorner editor.PromptedForCorner += OnEditorPromptedForCorner; } // Реализация отработки события PromptedForCorner private void OnEditorPromptedForCorner(object sender, PromptPointResultEventArgs e) { // Вывод сообщения в командную строку if (e.Result.Status == PromptStatus.OK) { editor.WriteMessage($"\nУказана точка: {e.Result.Value}"); } else { editor.WriteMessage("\nВвод точки отменён."); } } }
 Ваши комментарии по поводу этого топика: Послать отзыв!