Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод InfoCenter.LaunchSubAwareModule
 Послать отзыв
 This is LaunchSubAwareModule, a member of class InfoCenter.
 Синтаксис
C#
Visual Basic
public void LaunchSubAwareModule(short resReqid, ref System.String strCourseId, ref System.String strModuleId);
Public Sub LaunchSubAwareModule(resReqid As short, ByRef strCourseId As System.String, ByRef strModuleId As System.String)
 Ссылки
 InfoCenter Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!