Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.DrawingOpenEventArgs.Database
 Послать отзыв
 Свойство Database представляет базу данных открываемого чертежа.
 Синтаксис
C#
Visual Basic
Копировать Код
public Database Database;
Копировать Код
Public ReadOnly Property Database As Database
 Возвращает
 Возвращает базу данных nanoCAD. Тип Database.
 Описание
 Свойство Database представляет базу данных открываемого чертежа.
 Условия
 Только чтение.
 Ссылки
 HostMgd.ApplicationServices.DrawingOpenEventArgs, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!