Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Converter.StringToAngle (String^)
 Послать отзыв
 Синтаксис
C#
Visual Basic
public double StringToAngle(ref String value);
Public Function StringToAngle(ByRef value As String) As Double
 Описание
 Конвертирует строку в угол в соответствии с текущими угловыми единицами
 Ссылки
 Converter Класс, HostMgd.Runtime Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!