Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.RecentDocument.LastSavedBy
 Послать отзыв
 Свойство LastSavedBy представляет имя пользователя, который последним модифицировал данный документ. В текущей версии данное свойство не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public System.String LastSavedBy;
Копировать Код
Public ReadOnly Property LastSavedBy As System.String
 Возвращает
 Возвращает имя пользователя. Тип System.String.
 Описание
 Свойство LastSavedBy представляет имя пользователя, который последним модифицировал данный документ.
 В текущей версии данное свойство не реализовано.
 Условия
 Только чтение.
 Ссылки
 HostMgd.ApplicationServices.RecentDocument, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!