Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод PromptFileNameResult.ToString ()
 Послать отзыв
 Синтаксис
C#
Visual Basic
public String ToString();
Public Function ToString() As String
 Описание
 Возвращает строковое значение, представляющее данный объект (полный путь к файлу).
 Ссылки
 PromptFileNameResult Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!