Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Класс HostMgd.Publishing.BeginPublishingSheetEventArgs
 Послать отзыв
 This is class HostMgd::Publishing::BeginPublishingSheetEventArgs.
 Иерархия классов
HostMgd::Publishing::BeginPublishingSheetEventArgs
 Синтаксис
C#
Visual Basic
public class BeginPublishingSheetEventArgs : System.EventArgs;
Public Class BeginPublishingSheetEventArgs Inherits System.EventArgs
 Методы
 Конструкторы
 Имя
 Описание
 BeginPublishingSheetEventArgs
 This is BeginPublishingSheetEventArgs, a member of class BeginPublishingSheetEventArgs.
 Топики
 Имя
 Описание
 BeginPublishingSheetEventArgs Свойства
 Ниже перечислены свойства класса BeginPublishingSheetEventArgs.
 Ссылки
 BeginPublishingSheetEventArgs Свойства, Методы, Топики, BeginPublishingSheetEventArgs Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!