Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.JigPromptAngleOptions
 Послать отзыв
 Класс предназначен для хранения набора параметров, необходимых для запроса угла во время операции Jig с геометрическими объектами.
 Иерархия классов
HostMgd::EditorInput::PromptOptions HostMgd::EditorInput::JigPromptOptions HostMgd::EditorInput::JigPromptGeometryOptions HostMgd::EditorInput::JigPromptAngleOptions
 Синтаксис
C#
Visual Basic
public class JigPromptAngleOptions : JigPromptGeometryOptions;
Public Class JigPromptAngleOptions Inherits JigPromptGeometryOptions
 Описание
 Класс предназначен для для хранения набора параметров, необходимых для запроса угла во время операции Jig с геометрическими объектами. Используется с методом AcquireAngle() класса JigPrompts и позволяет установить для запроса угла базовую точку, приглашающее сообщение, ключевые слова, значение по умолчанию, внешний вид курсора и изменить пользовательские настройки ввода.
 Методы
 Конструкторы
 Класс HostMgd.EditorInput.JigPromptGeometryOptions
 Имя
 Описание
 JigPromptGeometryOptions
 Это обзор перегрузок JigPromptGeometryOptions.
 HostMgd.EditorInput.JigPromptAngleOptions
 Имя
 Описание
 JigPromptAngleOptions
 Это обзор перегрузок JigPromptAngleOptions.
 Топики
 Имя
 Описание
 PromptOptions Методы
 Ниже перечислены методы класса PromptOptions.
 PromptOptions Свойства
 Ниже перечислены свойства класса PromptOptions.
 Класс HostMgd.EditorInput.JigPromptOptions
 Имя
 Описание
 JigPromptOptions Методы
 Ниже перечислены методы класса JigPromptOptions.
 JigPromptOptions Свойства
 Ниже перечислены свойства класса JigPromptOptions.
 Класс HostMgd.EditorInput.JigPromptGeometryOptions
 Имя
 Описание
 JigPromptGeometryOptions Свойства
 Ниже перечислены свойства класса JigPromptGeometryOptions.
 HostMgd.EditorInput.JigPromptAngleOptions
 Имя
 Описание
 JigPromptAngleOptions Методы
 Ниже перечислены методы класса JigPromptAngleOptions.
 JigPromptAngleOptions Свойства
 Ниже перечислены свойства класса JigPromptAngleOptions.
 Ссылки
 JigPromptAngleOptions Конструктор, JigPromptAngleOptions Методы, JigPromptAngleOptions Свойства, Методы, Топики, PromptOptions Методы, PromptOptions Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!