Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.SelectCrossingWindow(Point3d,Point3d,SelectionFilter,bool)
 Послать отзыв
 Метод предоставляет набор объектов, пересекающих или находящихся внутри прямоугольной области, с возможностью фильтрации и выбора подобъектов.
 Синтаксис
C#
Visual Basic
Копировать Код
public PromptSelectionResult SelectCrossingWindow(Point3d pt1, Point3d pt2, SelectionFilter filter, bool forceSubEntitySelection);
Копировать Код
Public Function SelectCrossingWindow(pt1 As Point3d, pt2 As Point3d, filter As SelectionFilter, forceSubEntitySelection As bool) As PromptSelectionResult
 Параметры
 Параметры
 Описание
 pt1
 Первая угловая точка прямоугольного окна выборки в мировых координатах. Тип Point3d.
 pt2
 Вторая угловая точка прямоугольного окна выборки. Тип Point3d.
 filter
 Фильтр, определяющий, какие объекты будут включены в выборку. Тип SelectionFilter.
 forceSubEntitySelection
 Флаг, определяющий возможность выбора подобъктов. Если значение равно true, разрешает выбор подобъектов (например, ребер, граней), если это поддерживается приложением и типом объекта. Тип bool.
 Возвращает
 Возвращает объект типа PromptSelectionResult, содержащий результат выборки:
Status — статус выполнения (OK, Cancel, Error и др.). При успешной выборке статус равен PromptStatus.OK.
Value — объект типа SelectionSet, содержащий список идентификаторов (ObjectId) выбранных объектов.
StringResult — строковое значение.
 Если ни один объект не удовлетворяет условиям выборки, Value может быть null.
 Описание
 Метод используется для выбора геометрических объектов, которые полностью находятся внутри или пересекаются с прямоугольной областью, заданной двумя угловыми точками. Выборка может быть дополнена фильтром по типу объекта, слою, цвету и другим свойствам. Если параметр forceSubEntitySelection установлен в true, разрешено выделять отдельные подобъекты (например, сегменты полилинии).
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("SelectCrossingWindowExample_Point3d_Point3d_SelectionFilter_bool")] public void SelectCrossingWindowExample_Point3d_Point3d_SelectionFilter_bool() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создание точек углов области, внутри которой необходимо выбрать объекты Point3d corner1 = new Point3d(0, 0, 0); Point3d corner2 = new Point3d(100, 100, 0); // Фильтр: только объекты типа Circle SelectionFilter filter = new SelectionFilter(new TypedValue[] { new TypedValue((int)DxfCode.Start, "CIRCLE") }); // Вызываем метод PromptSelectionResult result = editor.SelectCrossingWindow(corner1, corner2, filter, false); // Выводим сообщение в командную строку if (result.Status == PromptStatus.OK) { SelectionSet selSet = result.Value; editor.WriteMessage( $"\nВыбрано объектов: {selSet.Count}"); } else { editor.WriteMessage( "\nНе найдено объектов, удовлетворяющих условиям."); } } }
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!