Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Класс HostMgd.EditorInput.PromptNumericalOptions
 Послать отзыв
 Иерархия классов
HostMgd::EditorInput::PromptOptions HostMgd::EditorInput::PromptEditorOptions HostMgd::EditorInput::PromptNumericalOptions
 Синтаксис
C#
Visual Basic
public class PromptNumericalOptions : PromptEditorOptions;
Public Class PromptNumericalOptions Inherits PromptEditorOptions
 Описание
 Это базовый класс для ввода, который представляет необязательные параметры приглашения для числовых типов.
 Топики
 Имя
 Описание
 PromptOptions Методы
 Ниже перечислены методы класса PromptOptions.
 PromptOptions Свойства
 Ниже перечислены свойства класса PromptOptions.
 Класс HostMgd.EditorInput.PromptNumericalOptions
 Имя
 Описание
 PromptNumericalOptions Свойства
 Ниже перечислены свойства класса PromptNumericalOptions.
 Ссылки
 PromptNumericalOptions Свойства, Топики, PromptOptions Методы, PromptOptions Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!