Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод PlotProgressDialog.OnEndSheet
 Послать отзыв
 завершение печати страницы
 Синтаксис
C#
Visual Basic
public void OnEndSheet();
Public Sub OnEndSheet()
 Ссылки
 PlotProgressDialog Класс, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!