Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.SelectionSetDelayMarshalled.GetObjectIds
 Послать отзыв
 Метод предоставляет массив идентификаторов объектов для всех элементов данного набора. Не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public sealed override Teigha.DatabaseServices.ObjectId[] GetObjectIds();
Копировать Код
Public NotOverridable Overrides Function GetObjectIds() As Teigha.DatabaseServices.ObjectId
 Возвращает
 Возвращает массив идентификаторов объектов. Тип Teigha.DatabaseServices.ObjectId[].
 Описание
 Метод предоставляет массив идентификаторов объектов для всех элементов данного набора.
 В текущей версии не реализован.
 Ссылки
 HostMgd.EditorInput.SelectionSetDelayMarshalled, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!