Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Класс HostMgd.ApplicationServices.DocumentDestroyedEventArgs
 Послать отзыв
 Иерархия классов
HostMgd::ApplicationServices::DocumentDestroyedEventArgs
 Синтаксис
C#
Visual Basic
public class DocumentDestroyedEventArgs : System.EventArgs;
Public Class DocumentDestroyedEventArgs Inherits System.EventArgs
 Описание
 Класс, обеспечивающий данными событие DocumentDestroyed класса DocumentCollection.
 Топики
 Имя
 Описание
 DocumentDestroyedEventArgs Свойства
 Ниже перечислены свойства класса DocumentDestroyedEventArgs.
 Ссылки
 DocumentDestroyedEventArgs Свойства, Топики, DocumentDestroyedEventArgs Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!