Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.InplaceTextEditor.Invoke
 Послать отзыв
 Метод вызывает встроенный текстовый редактор для указанного текстового объекта. В текущей версии метод не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public static void Invoke( ref Teigha.DatabaseServices.DBText text, ref Teigha.DatabaseServices.ObjectId[] appendedEntities );
Копировать Код
Public Shared Sub Invoke( ByRef text As Teigha.DatabaseServices.DBText, ByRef appendedEntities() As Teigha.DatabaseServices.ObjectId )
 Параметры
 Параметры
 Описание
 text
 Текст, редактирование которого начнется во встроенном текстовом редакторе. Тип Teigha.DatabaseServices.DBText.
 appendedEntities
 Если объект text является новым и пока отсутствует в базе данных, пользователь, используя левую кнопку мыши, может начать другой сеанс редактирования этого текста. При закрытии редактора новые текстовые объекты будут сохранены в текущей базе данных. Этот параметр возвращает массив добавленных в базу данных объектов. Тип Teigha.DatabaseServices.ObjectId[].
 Описание
 Метод вызывает встроенный текстовый редактор для указанного текстового объекта. Если уже имеется активный встроенный редактор, он будет предварительно закрыт.
 В текущей версии метод не реализован.
 Ссылки
 HostMgd.ApplicationServices.InplaceTextEditor, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!