Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PublishSheetEventArgs.AreScalingLineWeights
 Послать отзыв
 This is AreScalingLineWeights, a member of class PublishSheetEventArgs.
 Синтаксис
C#
Visual Basic
public bool AreScalingLineWeights;
Public Property AreScalingLineWeights() As bool
 Ссылки
 PublishSheetEventArgs Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!