Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.CrossingOrWindowSelectedObject.ToString()
 Послать отзыв
 Синтаксис
C#
Visual Basic
public String ToString();
Public Function ToString() As String
 Описание
 Возвращает строковое представление данного объекта.
 Ссылки
 HostMgd.EditorInput.CrossingOrWindowSelectedObject, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!