Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.SelectionAddedEventArgs.RemoveSubEntity(int,int)
 Послать отзыв
 Метод удаляет геометрический подобъект из выборки по индексу объекта и индексу подобъекта внутри него.
 Синтаксис
C#
Visual Basic
Копировать Код
public void RemoveSubEntity(int entityIndex, int subEntityIndex);
Копировать Код
Public Sub RemoveSubEntity(entityIndex As Integer, subEntityIndex As Integer)
 Параметры
 Параметры
 Описание
 entityIndex
 Индекс объекта в коллекции выбранных объектов (SelectionSet). Должен быть в диапазоне от 0 до Count - 1. Тип int
 subEntityIndex
 Индекс подобъекта внутри указанного объекта. Определяет, какой именно элемент (сегмент, ребро и т.п.) должен быть удалён. Тип int
 Описание
 Метод используется для программного удаления конкретного подобъекта (например, сегмента полилинии, ребра 3D-тела или грани) из состава выбранного объекта. Он применяется в контексте работы с составными объектами, где выборка может включать не только целые объекты, но и их внутренние элементы.
 После вызова метода указанный подобъект удаляется из внутренней структуры выборки, что может повлиять на последующую обработку — например, при редактировании, анализе или визуализации.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события SelectionAdded [Teigha.Runtime.CommandMethod("SelectionAddedExample_RemoveSubEntity")] public void SelectionAddedExample_RemoveSubEntity() { // Подписка на событие Rollover editor.SelectionAdded += OnSelectionAdded; } // Реализация отработки события SelectionAdded private void OnSelectionAdded(object sender, SelectionAddedEventArgs e) { // Получаем доступ к выбранным объектам SelectionSet selection = e.Selection; // Удаление подобъекта из выборки e.RemoveSubEntity(0, 0); } }
 Ссылки
 HostMgd.EditorInput.SelectionAddedEventArgs, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!