Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство ImageInfo.ResourceName
 Послать отзыв
 This is ResourceName, a member of class ImageInfo.
 Синтаксис
C#
Visual Basic
public System.String ResourceName;
Public Property ResourceName() As System.String
 Ссылки
 ImageInfo Класс, HostMgd.Windows.ToolPalette
 Ваши комментарии по поводу этого топика: Послать отзыв!