Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Делегат HostMgd.ApplicationServices.DocumentBeginCloseEventHandler
 Послать отзыв
 Делегат события в начале метода сохранения класса Document
 Синтаксис
C#
Visual Basic
public delegate DocumentBeginCloseEventHandler();
Public Delegate Sub DocumentBeginCloseEventHandler()
 Ваши комментарии по поводу этого топика: Послать отзыв!