Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.InplaceTextEditor.ImportTextDialog
 Послать отзыв
 Метод вызывает диалог импорта текста. В текущей версии не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public void ImportTextDialog();
Копировать Код
Public Sub ImportTextDialog()
 Описание
 Метод вызывает диалог импорта текста. В текущей версии не реализован.
 Ссылки
 HostMgd.ApplicationServices.InplaceTextEditor, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!