Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.SelectionAddedEventArgs
 Послать отзыв
 Класс предоставляет данные для события SelectionAdded, возникающего при добавлении объектов в набор выделенных.
 Иерархия классов
HostMgd::EditorInput::SelectionAddedEventArgs
 Синтаксис
C#
Visual Basic
Копировать Код
public sealed class SelectionAddedEventArgs : EventArgs, IDisposable
Копировать Код
Public NotInheritable Class SelectionAddedEventArgs Inherits EventArgs Implements IDisposable
 Описание
 Класс используется для передачи информации о добавленных объектах при срабатывании события SelectionAdded. Класс предоставляет доступ к набору объектов, которые были добавлены в текущее выделение — например, при щелчке мышью, выделении рамкой или использовании режима добавления.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события SelectionAdded [Teigha.Runtime.CommandMethod("SelectionAddedExample")] public void SelectionAddedExample() { // Подписка на событие Rollover editor.SelectionAdded += OnSelectionAdded; } // Реализация отработки события SelectionAdded private void OnSelectionAdded(object sender, SelectionAddedEventArgs e) { SelectionSet addedSet = e.Selection; foreach (ObjectId id in addedSet.GetObjectIds()) { editor.WriteMessage($"\nК выборке добавлен объект: {id}"); } } }
 Топики
 Имя
 Описание
 SelectionAddedEventArgs Методы
 Ниже перечислены методы класса SelectionAddedEventArgs.
 SelectionAddedEventArgs Свойства
 Ниже перечислены свойства класса SelectionAddedEventArgs.
 Ссылки
 SelectionAddedEventArgs Методы, SelectionAddedEventArgs Свойства, Топики, SelectionAddedEventArgs Методы, SelectionAddedEventArgs Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!