Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод PlotEngine.EndPlot
 Послать отзыв
 Метод завершения печати.
 Синтаксис
C#
Visual Basic
public void EndPlot(ref System.Object parameters);
Public Sub EndPlot(ByRef parameters As System.Object)
 Описание
 Ссылки
 PlotEngine Класс, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!