Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод PaletteSet.Remove
 Послать отзыв
 Удаление панели из набора по её индексу
 Синтаксис
C#
Visual Basic
public void Remove(int index);
Public Sub Remove(index As Integer)
 Ссылки
 PaletteSet Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!