Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PaletteSet.Count
 Послать отзыв
 Количество панелей в наборе
 Синтаксис
C#
Visual Basic
public int Count;
Public Property Count() As Integer
 Ссылки
 PaletteSet Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!