Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Класс HostMgd.EditorInput.FenceSelectedSubObject
 Послать отзыв
 Иерархия классов
HostMgd::EditorInput::SelectedSubObject HostMgd::EditorInput::FenceSelectedSubObject
 Синтаксис
C#
Visual Basic
public class FenceSelectedSubObject : SelectedSubObject;
Public Class FenceSelectedSubObject Inherits SelectedSubObject
 Описание
 Класс, инкапулирующий подобъект, который выбран при выборе по пересечению с линией выбора.
 В настоящее время нигде не используется.
 Методы
 Конструкторы
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 SelectedSubObject
 (Унаследован от SelectedSubObject)
 Класс HostMgd.EditorInput.FenceSelectedSubObject
 Имя
 Описание
 FenceSelectedSubObject
 Топики
 Имя
 Описание
 SelectedSubObject Методы
 Ниже перечислены методы класса SelectedSubObject.
 SelectedSubObject Свойства
 Ниже перечислены свойства класса SelectedSubObject.
 Класс HostMgd.EditorInput.FenceSelectedSubObject
 Имя
 Описание
 FenceSelectedSubObject Методы
 Ниже перечислены методы класса FenceSelectedSubObject.
 Ссылки
 FenceSelectedSubObject Методы, Методы, Топики, SelectedSubObject Методы, SelectedSubObject Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!