Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.Application.IsConnectEnabled()
 Послать отзыв
 МЕТОД НЕ РЕАЛИЗОВАН. ВСЕГДА ВОЗВРАЩАЕТ FALSE. Метод позволяет проверить, есть ли соединение с интернетом.
 Синтаксис
C#
Visual Basic
Копировать Код
public static bool IsConnectEnabled();
Копировать Код
Public Shared Function IsConnectEnabled() As Boolean
 Возвращает
 Тип bool: true - соединение есть, false - соединения нет.
 Описание
 Метод проверяет, есть ли соединение с интернетом.
 Ссылки
 HostMgd.ApplicationServices.Application, HostMgd.ApplicationServices Пространство имен
 Исключения
 MGD NOT_IMPLEMENTED
 Ваши комментарии по поводу этого топика: Послать отзыв!