Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод XrefFileLock.LockFile
 Послать отзыв
 Синтаксис
C#
Visual Basic
public XrefFileLock LockFile(Teigha::DatabaseServices::ObjectId selectedBlockId);
Public Function LockFile(selectedBlockId As Teigha.DatabaseServices.ObjectId) As XrefFileLock
 Параметры
 Параметры
 Описание
 selectedBlockId
 ID записи таблицы блоков
 Описание
 Файл внешней ссылки по заданному ID записи таблицы блоков становится блокированным в режиме на монопольную запись. Всем, обращающиеся к файлу на чтение, чтение разрешено, но получение данных не гарантировано. Если файл внешней ссылки имеет значение системной переменной XLOADCTL, установленное в 1 (потребуется загрузка), то текущее значение этой переменой меняется на 0 (полностью загружен) или 2 (копия). Это позволяет файлу внешней ссылки быть заблокированным при блокировке объекта. При реализации посредством метода ReleaseFile(), значение переменной XLOADCTL для ссылки этого блока сохраняется (либо 0, либо 2).
 Ссылки
 XrefFileLock Класс, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!