Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор Publisher.Publisher
 Послать отзыв
 This is Publisher, a member of class Publisher.
 Синтаксис
C#
Visual Basic
public Publisher();
Public Sub New()
 Ссылки
 Publisher Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!