Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptAngleOptionsEventArgs
 Послать отзыв
 Класс предоставляет данные для события PromptingForAngle, включая параметры ввода угла и контекст операции.
 Иерархия классов
HostMgd::EditorInput::PromptAngleOptionsEventArgs
 Синтаксис
C#
Visual Basic
Копировать Код
public sealed class PromptAngleOptionsEventArgs : EventArgs
Копировать Код
Public NotInheritable Class PromptAngleOptionsEventArgs Inherits EventArgs
 Описание
 Класс наследуется от EventArgs и используется в .NET API nanoCAD для передачи данных при начале интерактивного ввода угла. Он применяется совместно с событием PromptingForAngle и делегатом PromptAngleOptionsEventHandler, чтобы дать разработчику возможность изменить параметры команды ввода угла — такие как начальное значение, сообщение, допустимый диапазон и другие.
 Этот класс предоставляет доступ к объекту PromptAngleOptions, который содержит настройки, передаваемые в команду ввода угла, и может включать точку (Point3d), если она уже определена в контексте ввода.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события PromptingForAngle [Teigha.Runtime.CommandMethod("PromptingForAngleExample")] public void PromptingForAngleExample() { // Подписка на событие PromptingForAngle editor.PromptingForAngle += OnEditorPromptingForAngle; } // Реализация отработки события PromptingForAngle private void OnEditorPromptingForAngle(object sender, PromptAngleOptionsEventArgs e) { // Установить начальное значение угла e.Options.DefaultValue = Math.PI / 2; // 90 градусов // Установить сообщение e.Options.Message = "Введите угол поворота:"; } }
 Топики
 Имя
 Описание
 PromptAngleOptionsEventArgs Свойства
 Ниже перечислены свойства класса PromptAngleOptionsEventArgs.
 Ссылки
 PromptAngleOptionsEventArgs Свойства, Топики, PromptAngleOptionsEventArgs Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!