Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Keyword.DisplayName
 Послать отзыв
 Синтаксис
C#
Visual Basic
public String DisplayName;
Public Property DisplayName() As String
 Описание
 Свойство возвращает или устанавливает отображаемое имя ключевого слова. это именно то имя, которое отображается в командной строке. Обычно это тоже имя, что и локальное имя.
 Условия
 На чтение и запись
 Ссылки
 Keyword Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!