Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство SelectedSubObject.OptionalDetails
 Послать отзыв
 Синтаксис
C#
Visual Basic
public HostMgd::EditorInput::SelectionDetails OptionalDetails;
Public Property OptionalDetails() As HostMgd.EditorInput.SelectionDetails
 Описание
 Устанавливает или возвращает необязательные детали выбранного подобъекта.
 Условия
 На чтение и запись
 Ссылки
 SelectedSubObject Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!