Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PaletteSet.HostMgdStyle
 Послать отзыв
 Расширенный стиль окна.
 Синтаксис
C#
Visual Basic
public HostMgd::Windows::PaletteSetHostMgdStyles HostMgdStyle;
Public Property HostMgdStyle() As HostMgd.Windows.PaletteSetHostMgdStyles
 Описание
 Только в HostMgd
 Ссылки
 PaletteSet Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!