Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.PlotInfoValidator.DimensionalWeight
 Послать отзыв
 Свойство DimensionalWeight представляет весовой коэффициент для размеров в текущих настройках печати.
 Синтаксис
C#
Visual Basic
Копировать Код
public int DimensionalWeight;
Копировать Код
Public Property DimensionalWeight As Integer
 Возвращает
 Возвращает весовой коэффициент для размеров в настройках печати. Тип int.
 Описание
 Свойство DimensionalWeight представляет весовой коэффициент для размеров в текущей конфигурации печати, связанной с объектом PlotInfo.
 Замечания
 См. описание свойства MediaMatchingThreshold.
 Условия
 Чтение и запись.
 Ссылки
 HostMgd.PlottingServices.PlotInfoValidator, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!