Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод LinetypeDialog.ShowDialog
 Послать отзыв
 This is ShowDialog, a member of class LinetypeDialog.
 Синтаксис
C#
Visual Basic
public System.Windows.Forms.DialogResult ShowDialog();
Public Function ShowDialog() As System.Windows.Forms.DialogResult
 Ссылки
 LinetypeDialog Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!