Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.PreviewEngineFlags
 Послать отзыв
 Данное перечисление определяет функциональность предварительного просмотра чертежа.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum PreviewEngineFlags { Plot = 1, NextSheet = 2, PreviousSheet = 4 }
Копировать Код
Public Enum PreviewEngineFlags Plot = 1 NextSheet = 2 PreviousSheet = 4 End Enum
 Члены
 Члены
 Описание
 NextSheet
 Значение: 2. Позволяет перейти к просмотру следующего листа из состояния предварительного просмотра.
 Plot
 Значение: 1. Позволяет вывод чертежа на печать график из состояния предварительного просмотра.
 PreviousSheet
 Значение: 4. Позволяет перейти к просмотру предыдущего листа из состояния предварительного просмотра.
 Описание
 Перечисление PreviewEngineFlags определяет функциональность предварительного просмотра чертежа.
 Ваши комментарии по поводу этого топика: Послать отзыв!