Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.DsdEntryCollection.DsdEntryCollection
 Послать отзыв
 Конструктор по умолчанию класса DsdEntryCollection.
 Синтаксис
C#
Visual Basic
Копировать Код
public DsdEntryCollection();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса DsdEntryCollection.
 Ссылки
 HostMgd.PlottingServices.DsdEntryCollection, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!