Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptStringOptionsEventArgs.Options
 Послать отзыв
 Свойство предоставляет доступ к параметрам приглашения, используемым при операции ввода строки.
 Синтаксис
C#
Visual Basic
Копировать Код
public PromptStringOptions Options { get; }
Копировать Код
Public ReadOnly Property Options As PromptStringOptions
 Возвращает
 Возвращает объект типа PromptStringOptions. Если параметры не были инициализированы, может вернуть null.
 Описание
 Свойство предоставляет доступ к настройкам, применяемым к интерактивной команде ввода текста — например, при вызове метода GetString(). Оно используется в обработчике события PromptingForString, чтобы дать разработчику возможность изменить параметры ввода до начала взаимодействия с пользователем.
 Через это свойство можно настроить:
текст приглашения,
ключевые слова,
глобальные ключевые слова,
разрешение на пустой ввод,
режим ввода (только ключевые слова или произвольный текст) и т.п.
 Условия
 Только чтение
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события PromptingForString [Teigha.Runtime.CommandMethod("PromptingForStringExample_Options")] public void PromptingForStringExample_Options() { // Подписка на событие PromptingForString editor.PromptingForString += OnEditorPromptingForString; } // Реализация отработки события PromptingForString private void OnEditorPromptingForString(object sender, PromptStringOptionsEventArgs e) { // Изменение сообщения приглашения e.Options.Message = "Введите имя стиля текста:"; // Добавление ключевых слов e.Options.Keywords.Add("По умолчанию"); e.Options.Keywords.Add("Новый"); e.Options.Keywords.Add("Текущий"); } }
 Ссылки
 HostMgd.EditorInput.PromptStringOptionsEventArgs, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!