Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptAngleOptions.PromptAngleOptions(string,string)
 Послать отзыв
 Конструктор инициализирует новый экземпляр класса с заданным сообщением и списком глобальных ключевых слов, отображаемых пользователю.
 Синтаксис
C#
Visual Basic
Копировать Код
public PromptAngleOptions(string messageAndKeywords, string globalKeywords);
Копировать Код
Public Sub New(messageAndKeywords As String, globalKeywords As String)
 Параметры
 Параметры
 Описание
 messageAndKeywords
 Сообщение, отображаемое пользователю, может содержать приглашение и локальные ключевые слова в формате [Ключ1/Ключ2/Ключ3].
 globalKeywords
 Строка, содержащая глобальные ключевые слова, которые доступны на протяжении всей команды. Количество глобальных ключевых слов должно совпадать с количеством ключевых слов в приглашающем сообщении messageAndKeywords. Ключевые слова в строке globalKeywords должны отделяться друг от друга одним пробелом.
 Пример
 "Введите угол поворота [по Часовой/Против часовой]" Тип string "Сlockwise Сounterclockwise" Тип string
 Описание
 Конструктор создаёт объект PromptAngleOptions, используемый при настройке интерактивного ввода угла в nanoCAD. Он позволяет указать:
текст приглашения , включая локальные ключевые слова, заключённые в квадратные скобки (например: "Введите угол [0/90/180]:"),
глобальные ключевые слова , которые будут доступны во время ввода и не зависят от контекста команды.
 Этот конструктор особенно полезен, когда требуется предоставить пользователю список предопределённых вариантов для выбора, например, стандартные углы или параметры, доступные в любой момент ввода.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("PromptAngleOptionsExample_string_string")] public void PromptAngleOptionsExample_string_string() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создаём запрос пользователю, чтобы он указал угол на чертеже PromptAngleOptions options = new PromptAngleOptions("Введите угол поворота [0/90/180]:", "0degrees 90degrees 180degrees"); // Вызов метода GetAngle, запрашивающего угол у пользователя PromptDoubleResult result = editor.GetAngle(options); if (result.Status == PromptStatus.OK) { double angleInRadians = result.Value; double angleInDegrees = result.Value * 180 / Math.PI; editor.WriteMessage($"\nВведен угол: {angleInRadians} радиан или {angleInDegrees} градусов"); } else if (result.Status == PromptStatus.Keyword) { editor.WriteMessage($"nВведено ключевое слово: {result.StringResult}"); } } }
 Ссылки
 HostMgd.EditorInput.PromptAngleOptions, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!