Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.PreTranslateMessageEventArgs.Message
 Послать отзыв
 Свойство Message позволяет получить или задать объект сообщения в формате структуры MSG. В текущей версии не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public System.Windows.Interop.MSG Message;
Копировать Код
Public Property Message As System.Windows.Interop.MSG
 Возвращает
 Возвращает объект сообщения. Тип System.Windows.Interop.MSG.
 Описание
 Свойство Message позволяет получить или задать объект сообщения в формате структуры MSG.
 В текущей версии не реализовано.
 Условия
 Чтение и запись.
 Ссылки
 HostMgd.ApplicationServices.PreTranslateMessageEventArgs, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!