Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод XrefFileLock.ReloadFile (Teigha::DatabaseServices::ObjectIdCollection^)
 Послать отзыв
 Синтаксис
C#
Visual Basic
public void ReloadFile(ref Teigha::DatabaseServices::ObjectIdCollection blocks);
Public Sub ReloadFile(ByRef blocks As Teigha.DatabaseServices.ObjectIdCollection)
 Параметры
 Параметры
 Описание
 blocks
 Список ID
 Описание
 Перезагрузка соответствующего файла (ов) внешней ссылки по списку ID записей таблицы блоков (рассинхронизированных) для текущего чертежа. После этого (т.е. после перезагрузки самих файлов внешних ссылок) файлы внешних ссылок будут снова синхронизированы для всех внешних ссылок.
 Ссылки
 XrefFileLock Класс, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!