Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptForEntityEndingEventArgs.RemoveSubEntity(int,int)
 Послать отзыв
 Метод удаляет указанный подобъект из составного объекта по заданным индексам геометрического объекта и подобъекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public void RemoveSubEntity(int entityIndex, int subEntityIndex);
Копировать Код
Public Sub RemoveSubEntity(entityIndex As Integer, subEntityIndex As Integer)
 Параметры
 Параметры
 Описание
 entityIndex
 Индекс геометрического объекта в наборе выделенных объектов, из которого нужно удалить подобъект. Тип int
 subEntityIndex
 Индекс подобъекта внутри указанного геометрического объекта, который требуется удалить. Тип int
 Описание
 Метод применяется при работе с составными геометрическими объектами, которые содержат подобъекты (например, полигоны, блоки, сложные линии и др.). Он позволяет программно удалить конкретный подобъект по его индексу внутри указанного объекта. Метод может использоваться в интерактивных командах или обработчиках выборки для изменения структуры выделения на уровне подобъектов.
 Замечания
 Если указанные индексы выходят за пределы допустимых значений, будет выброшено исключение ArgumentOutOfRangeException.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события PromptForSelectionEnding [Teigha.Runtime.CommandMethod("PromptForSelectionEndingExample_RemoveSubEntity")] public void PromptForSelectionEndingExample_RemoveSubEntity() { // Подписка на событие PromptForSelectionEnding editor.PromptForSelectionEnding += OnEditorPromptForSelectionEnding; } // Реализация отработки события PromptForSelectionEnding private void OnEditorPromptForSelectionEnding(object sender, PromptForSelectionEndingEventArgs e) { if (e.Selection.Count > 0) { // Вывод сообщения в командную строку editor.WriteMessage( $"\nВыбрано объектов: {e.Selection.Count}"); // Удаляем первый подобъект из первого объекта выборки e.RemoveSubEntity(0, 0);; editor.WriteMessage("\nПодобъект удален из выборки."); } } }
 Ссылки
 HostMgd.EditorInput.PromptForSelectionEndingEventArgs, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!