Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство DocumentActivationChangedEventArgs.NewValue
 Послать отзыв
 Синтаксис
C#
Visual Basic
public bool NewValue;
Public Property NewValue() As bool
 Описание
 Возвращает признак, является ли документ активным.
 Условия
 Только на чтение
 Ссылки
 DocumentActivationChangedEventArgs Класс, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!