Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Делегат HostMgd.EditorInput.DraggingEventHandler
 Послать отзыв
 Делегат уведомления в начале метода перетаскивания класса Edit
 Синтаксис
C#
Visual Basic
public delegate DraggingEventHandler();
Public Delegate Sub DraggingEventHandler()
 Ваши комментарии по поводу этого топика: Послать отзыв!