Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Делегат HostMgd.Windows.PaletteActivatedEventHandler
 Послать отзыв
 This is type HostMgd::Windows::PaletteActivatedEventHandler.
 Синтаксис
C#
Visual Basic
public delegate PaletteActivatedEventHandler();
Public Delegate Sub PaletteActivatedEventHandler()
 Ваши комментарии по поводу этого топика: Послать отзыв!