Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор PaletteSetStateEventArgs.PaletteSetStateEventArgs
 Послать отзыв
 This is PaletteSetStateEventArgs, a member of class PaletteSetStateEventArgs.
 Синтаксис
C#
Visual Basic
public PaletteSetStateEventArgs(HostMgd::Windows::StateEventIndex newState);
Public Sub New(newState As HostMgd.Windows.StateEventIndex)
 Ссылки
 PaletteSetStateEventArgs Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!