Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.InplaceTextEditor.LineSpaceMenus
 Послать отзыв
 Метод вызывает меню для изменения в данном текстовом редакторе текущего межстрочного интервала. В текущей версии не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public void LineSpaceMenus( System.Drawing.Point pos, ref HostMgd.Windows.Window parent );
Копировать Код
Public Sub LineSpaceMenus( pos As System.Drawing.Point, ByRef parent As HostMgd.Windows.Window )
 Параметры
 Параметры
 Описание
 pos
 Точка привязки вызываемого меню. Тип System.Drawing.Point. Задается в экранных координатах.
 parent
 Родительское окно для вызываемого меню. Тип HostMgd.Windows.Window.
 Описание
 Метод предназначен для вызова меню редактирования текущего межстрочного интервала в данном текстовом редакторе. В текущей версии не реализован.
 Ссылки
 HostMgd.ApplicationServices.InplaceTextEditor, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!