Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Класс HostMgd.ApplicationServices.DocumentLockModeChangeVetoedEventArgs
 Послать отзыв
 Иерархия классов
HostMgd::ApplicationServices::DocumentLockModeChangeVetoedEventArgs
 Синтаксис
C#
Visual Basic
public class DocumentLockModeChangeVetoedEventArgs : System.EventArgs;
Public Class DocumentLockModeChangeVetoedEventArgs Inherits System.EventArgs
 Описание
 Класс, обеспечивающий данными событие DocumentLockModeChangeVetoed класса DocumentCollection.
 Топики
 Имя
 Описание
 DocumentLockModeChangeVetoedEventArgs Свойства
 Ниже перечислены свойства класса DocumentLockModeChangeVetoedEventArgs.
 Ссылки
 DocumentLockModeChangeVetoedEventArgs Свойства, Топики, DocumentLockModeChangeVetoedEventArgs Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!