Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PointInputEventArgs.Result
 Послать отзыв
 Свойство Result представляет выходные данные события PointFilter, связанного с выделением точки. Не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public HostMgd.EditorInput.PointFilterResult Result;
Копировать Код
Public ReadOnly Property Result As HostMgd.EditorInput.PointFilterResult
 Возвращает
 Возвращает выходные данные события PointFilter. Тип HostMgd.EditorInput.PointFilterResult.
 Описание
 Свойство Result представляет выходные данные события PointFilter, связанного с выделением точки.
 В текущей версии не реализовано.
 Условия
 Только чтение.
 Ссылки
 HostMgd.EditorInput.PointInputEventArgs, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!