Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.CurrentUserCoordinateSystem
 Послать отзыв
 Свойство предоставляет доступ к матрице преобразования, описывающей текущую пользовательскую систему координат (ПСК) в чертеже.
 Синтаксис
C#
Visual Basic
Копировать Код
public Matrix3d CurrentUserCoordinateSystem { get; set; }
Копировать Код
Public Property CurrentUserCoordinateSystem() As Matrix3d
 Возвращает
 Возвращает объект типа Matrix3d, представляющий собой матрицу преобразования текущей пользовательской системы координат. Эта матрица включает информацию о положении начала координат и направлении осей X, Y и Z ПСК относительно МСК.
 Описание
 Свойство позволяет получать или устанавливать матрицу преобразования (Matrix3d), которая определяет ориентацию и положение пользовательской системы координат (ПСК) относительно мировой системы координат (МСК). Это свойство используется при работе с интерактивным вводом, построением объектов в заданной ориентации и других операциях, зависящих от текущей системы координат. Свойство доступно как для чтения, так и для записи.
 Условия
 Чтение и запись
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("CurrentUserCoordinateSystemExample")] public void CurrentUserCoordinateSystemExample() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Получаем текущую ПСК Matrix3d currentUcs = editor.CurrentUserCoordinateSystem; editor.WriteMessage( $"\nТекущая матрица ПСК: {currentUcs}"); // Устанавливаем новую ПСК (например, сдвинутую по X на 100 единиц) Matrix3d newUcs = Matrix3d.Displacement(new Vector3d(100, 0, 0)); editor.CurrentUserCoordinateSystem = newUcs; // Вывод сообщения в командной строке editor.WriteMessage("\nПСК изменена."); } }
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!