Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.InplaceTextEditorSettings.Flags
 Послать отзыв
 Свойство Flags предоставляет доступ к флагам редактирования. В текущей версии не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public InplaceTextEditorSettings.EditFlags Flags;
Копировать Код
Public Property Flags As InplaceTextEditorSettings.EditFlags
 Возвращает
 Возвращает флаги редактирования в настройках встроенного текстового редактора. Тип InplaceTextEditorSettings.EditFlags.
 Описание
 Свойство Flags предоставляет доступ на изменение к флагам редактирования в настройках встроенного текстового редактора.
 В текущей версии не реализовано.
 Условия
 Чтение и запись.
 Ссылки
 HostMgd.ApplicationServices.InplaceTextEditorSettings, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!