Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.PreTranslateMessageEventArgs.Handled
 Послать отзыв
 Свойство Handled позволяет указать или проверить, обработано ли событие. В текущей версии не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool Handled;
Копировать Код
Public Property Handled As Boolean
 Возвращает
 Возвращает true, если событие было обработано. В противном случае возвращает false.
 Описание
 Свойство Handled позволяет указать или проверить, обработано ли событие.
 В текущей версии не реализовано.
 Условия
 Чтение и запись.
 Ссылки
 HostMgd.ApplicationServices.PreTranslateMessageEventArgs, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!