Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.GetSelection(SelectionFilter)
 Послать отзыв
 Метод предназначени для получения набора объектов, выбранных пользователем и соответствующих заданному фильтру.
 Синтаксис
C#
Visual Basic
Копировать Код
public PromptSelectionResult GetSelection(SelectionFilter filter);
Копировать Код
Public Function GetSelection(filter As SelectionFilter) As PromptSelectionResult
 Параметры
 Параметры
 Описание
 filter
 Фильтр, определяющий допустимые для выбора объекты. Строится на основе массива TypedValue, где указываются условия по типам объектов, слоям, цветам и другим параметрам. Тип SelectionFilter.
 Возвращает
 Возвращает объект типа PromptSelectionResult, который содержит:
Status — статус выполнения операции (OK, Cancel, Error и др.).
Value — объект типа SelectionSet, содержащий список идентификаторов (ObjectId) выбранных и прошедших фильтрацию объектов (если операция успешна).
StringResult — строковое значение, если выбор был прерван с помощью клавиатуры или ключевого слова.
 Если операция завершена успешно, статус будет равен PromptStatus.OK, и в Value будет содержаться отфильтрованный набор выбранных объектов.
 Описание
 Метод используется для получения множества графических объектов, выделенных пользователем в интерактивном режиме, с последующей фильтрацией по заданным критериям. Пользователь может выбрать объекты на чертеже стандартными средствами (щелчок, рамка и т. д.), а затем к результату выбора применяется фильтр, который оставляет только те объекты, которые удовлетворяют условиям фильтрации — например, тип объекта, слой или другие свойства. Если ни один из выбранных объектов не проходит фильтр, операция завершается с ошибкой или отменяется.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("GetSelectionExample_SelectionFilter")] public void GetSelectionExample_SelectionFilter() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создание фильтра: только объекты типа Line SelectionFilter filter = new SelectionFilter(new TypedValue[] { new TypedValue((int)DxfCode.Start, "LINE") }); // Создаём запрос пользователю с фильтром объектов PromptSelectionResult result = editor.GetSelection(filter); // Если все данные введены, выводим результат в командную строку if (result.Status == PromptStatus.OK) { SelectionSet selSet = result.Value; editor.WriteMessage( $"\nВыбрано линий: {selSet.Count}"); } else { editor.WriteMessage( "\nНе выбрано ни одной линии."); } } }
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!