Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.Windows.ToolPalette.Catalog
 Послать отзыв
 Класс Catalog представляет каталоги в панелях инструментов.
 Иерархия классов
HostMgd::Windows::ToolPalette::CatalogItem HostMgd::Windows::ToolPalette::Category HostMgd::Windows::ToolPalette::Catalog
 Синтаксис
C#
Visual Basic
Копировать Код
public sealed class Catalog : Category
Копировать Код
Public NotInheritable Class Catalog Inherits Category
 Описание
 Класс Catalog представляет каталоги в панелях инструментов.
 Топики
 Имя
 Описание
 CatalogItem Методы
 Ниже перечислены методы класса CatalogItem.
 Ссылки
 Топики, CatalogItem Методы
 Ваши комментарии по поводу этого топика: Послать отзыв!