Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.LongTransactionManager.IsFiltered
 Послать отзыв
 Метод позволяет проверить,находится ли в фильтре указанный класс. В текущей версии не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsFiltered( ref Teigha.Runtime.RXClass rXClass );
Копировать Код
Public Function IsFiltered( ByRef rXClass As Teigha.Runtime.RXClass ) As Boolean
 Параметры
 Параметры
 Описание
 rXClass
 Входной указатель на объект RXClass проверяемого класса. Тип Teigha.Runtime.RXClass.
 Возвращает
 Возвращает true, если проверяемый класс находится в фильтре. В противном случае возвращает false.
 Описание
 Метод позволяет проверить,находится ли в фильтре класс, переданный аргументом rXClass.
 В текущей версии не реализован.
 Ссылки
 HostMgd.ApplicationServices.LongTransactionManager, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!