Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptForSelectionEndingEventHandler(object,PromptForSelectionEndingEventArgs)
 Послать отзыв
 Делегат предназначен для обработки события, возникающего при завершении операции выбора объектов в редакторе nanoCAD.
 Синтаксис
C#
Visual Basic
Копировать Код
public delegate void PromptForSelectionEndingEventHandler(object sender, PromptForSelectionEndingEventArgs e);
Копировать Код
Public Delegate Sub PromptForSelectionEndingEventHandler(sender As Object, e As PromptForSelectionEndingEventArgs)
 Параметры
 Параметры
 Описание
 sender
 Источник события, обычно представляющий экземпляр редактора (Editor), в котором произошла операция выбора. Тип object
 e
 Объект, содержащий данные о завершающейся операции выбора. Тип PromptForSelectionEndingEventArgs
 Описание
 Делегат используется как сигнатура метода, который обрабатывает событие PromptForSelectionEnding, происходящее после завершения интерактивного выбора множества объектов, но до фиксации результата. Это позволяет разработчику получить доступ к текущему набору выбранных объектов и выполнить дополнительные действия — например, проверить корректность выборки, изменить состав выделенных элементов или отменить операцию на уровне обработчика.
 Замечания
 Этот делегат применяется в надстройках и плагинах для гибкой обработки выборки объектов перед тем, как она будет использована командой или пользовательским интерфейсом.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события PromptForSelectionEnding [Teigha.Runtime.CommandMethod("PromptForSelectionEndingExample")] public void PromptForSelectionEndingExample() { // Подписка на событие PromptForSelectionEnding editor.PromptForSelectionEnding += OnEditorPromptForSelectionEnding; } // Реализация отработки события PromptForSelectionEnding private void OnEditorPromptForSelectionEnding(object sender, PromptForSelectionEndingEventArgs e) { if (e.Selection.Count > 0) { // Вывод сообщения в командную строку editor.WriteMessage( $"\nВыбрано объектов: {e.Selection.Count}"); } } }
 Ваши комментарии по поводу этого топика: Послать отзыв!