Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PromptOptions.Message
 Послать отзыв
 Приглашающее сообщение.
 Синтаксис
C#
Visual Basic
public String Message;
Public Property Message() As String
 Возвращает
 Возвращает строку с приглашающим сообщением.
 Описание
 Возвращает или устанавливает приглашающее сообщение в запросе данных у пользователя.
 Условия
 Чтение и запись.
 Ссылки
 HostMgd.EditorInput.PromptOptions, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!