Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.EndPlotEventHandler(Object, EndPlotEventArgs)
 Послать отзыв
 Делегат EndPlotEventHandler предназначен для обработки события PlotReactorManager.EndPlot, возникающего по окончании вывода на плоттер.
 Синтаксис
C#
Visual Basic
Копировать Код
public delegate void EndPlotEventHandler( Object sender, EndPlotEventArgs e );
Копировать Код
Public Delegate Sub EndPlotEventHandler( sender As Object, e As EndPlotEventArgs )
 Параметры
 Параметры
 Описание
 sender
 Объект, инициировавший событие. Тип Object.
 e
 Аргументы события. Тип EndPlotEventArgs.
 Описание
 Делегат EndPlotEventHandler предназначен для обработки события PlotReactorManager.EndPlot, возникающего по окончании вывода на плоттер. Контекст события передается через параметры sender и e, где sender определяет объект-инициатор события, а аргумент e типа EndPlotEventArgs передает состояние флага PlotCancelStatus.
 Ваши комментарии по поводу этого топика: Послать отзыв!