Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptSelectionOptionsEventArgs.Options
 Послать отзыв
 Свойство предоставляет доступ к параметрам приглашения, используемым при операции выбора объектов.
 Синтаксис
C#
Visual Basic
Копировать Код
public PromptSelectionOptions Options { get; }
Копировать Код
Public ReadOnly Property Options As PromptSelectionOptions
 Возвращает
 Возвращает объект типа PromptSelectionOptions. Если параметры не были инициализированы, может вернуть null.
 Описание
 Свойство предоставляет доступ к объекту типа PromptSelectionOptions, который содержит настройки, применяемые к интерактивной команде выбора объектов — например, при вызове метода GetSelection(). Оно используется в обработчике события PromptingForSelection, чтобы дать разработчику возможность изменить параметры выборки до начала взаимодействия с пользователем.
 Через это свойство можно настроить:
текст приглашения,
режим выбора,
разрешение на пустой ввод,
ключевые слова,
другие параметры выбора.
 Условия
 Только чтение
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события PromptingForSelection [Teigha.Runtime.CommandMethod("PromptingForSelectionExample_Options")] public void PromptingForSelectionExample_Options() { // Подписка на событие PromptingForSelection editor.PromptingForSelection += OnEditorPromptingForSelection; } // Реализация отработки события PromptingForSelection private void OnEditorPromptingForSelection(object sender, PromptSelectionOptionsEventArgs e) { // Изменение текста приглашения e.Options.MessageForAdding = "Выберите объект для обработки:"; // Разрешить выбор только одного объекта e.Options.SingleOnly = true; // Добавление ключевых слов e.Options.Keywords.Add("Все"); e.Options.Keywords.Add("Фильтр"); } }
 Ссылки
 HostMgd.EditorInput.PromptSelectionOptionsEventArgs, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!