Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.EndPlotEventArgs
 Послать отзыв
 Класс EndPlotEventArgs предоставляет данные, специфичные для вывода чертежа на печать и необходимые для события PlotReactorManager.EndPlot.
 Иерархия классов
HostMgd::PlottingServices::EndPlotEventArgs
 Синтаксис
C#
Visual Basic
Копировать Код
public class EndPlotEventArgs : System.EventArgs;
Копировать Код
Public Class EndPlotEventArgs Inherits System.EventArgs;
 Описание
 Класс EndPlotEventArgs является наследником класса System.EventArgs и в .NET API nanoCAD предоставляет данные, специфичные для вывода листа на печать и необходимые для события PlotReactorManager.EndPlot. Эти данные включают состояние флага PlotCancelStatus. Используется совместно с делегатом HostMgd.PlottingServices.EndPlotEventHandler.
 Методы
 Конструкторы
 Имя
 Описание
 EndPlotEventArgs
 Конструктор класса EndPlotEventArgs.
 Топики
 Имя
 Описание
 EndPlotEventArgs Свойства
 Ниже перечислены свойства класса EndPlotEventArgs.
 Ссылки
 EndPlotEventArgs Свойства, Методы, Топики, EndPlotEventArgs Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!