Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.InplaceTextEditorSettings.TabSupported
 Послать отзыв
 Свойство TabSupported позволяет указать, поддерживает ли текстовый редактор вставку символов табуляции. В текущей версии не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool TabSupported;
Копировать Код
Public Property TabSupported As Boolean
 Возвращает
 Возвращает true, если редактор поддерживает текстовые абзацы. В противном случае возвращает false.
 Описание
 Свойство TabSupported позволяет указать, поддерживает ли текстовый редактор вставку символов табуляции.
 Замечания
 Если текущим редактируемым объектом является ячейка таблицы или простой многострочный текст, эта настройка будет проигнорирована, т.к. в этих объектах символы табуляции не поддерживаются.
 В текущей версии не реализовано.
 Условия
 Чтение и запись.
 Ссылки
 HostMgd.ApplicationServices.InplaceTextEditorSettings, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!