Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Событие Publisher.AboutToMoveFile
 Послать отзыв
 This is AboutToMoveFile, a member of class Publisher.
 Синтаксис
C#
Visual Basic
public event AboutToMoveFileEventHandler AboutToMoveFile;
Public Event AboutToMoveFile As AboutToMoveFileEventHandler
 Ссылки
 Publisher Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!