Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.Document.LispEnded
 Послать отзыв
 Событие, возникающее при прерывании выполнения lisp выражения в документе.
 Синтаксис
C#
Visual Basic
public event EventHandler LispEnded;
Public Event LispEnded As EventHandler
 Возвращает
 Возвращает тип данных EventHandler
 Описание
 Событие, возникающее при прерывании выполнения lisp выражения в документе. Соответствует функции NRX API HostEditorReactor.lispEnded().
 Ссылки
 HostMgd.ApplicationServices.Document, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!