Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод PlotEngine.BeginPage
 Послать отзыв
 Синтаксис
C#
Visual Basic
public void BeginPage(ref HostMgd::PlottingServices::PlotPageInfo pageInfo, ref HostMgd::PlottingServices::PlotInfo plotInfo, bool lastPage, ref System.Object parameters);
Public Sub BeginPage(ByRef pageInfo As HostMgd.PlottingServices.PlotPageInfo, ByRef plotInfo As HostMgd.PlottingServices.PlotInfo, lastPage As bool, ByRef parameters As System.Object)
 Ссылки
 PlotEngine Класс, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!