Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.Windows.ToolPalette.CustomToolBase.Execute
 Послать отзыв
 Метод запускает в действие логику пользовательского инструмента при его активации на панели инструментов. Не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void Execute( int flag, UInt32 window, UInt32 point, UInt32 keyState );
Копировать Код
Public Overridable Sub Execute( flag As Integer, window As UInt32, point As UInt32, keyState As UInt32 )
 Параметры
 Параметры
 Описание
 flag
 Входной флаг способа активации инструмента. Тип int.
 window
 Дескриптор окна (HWND) nanoCAD, в котором будет работать инструмент. Тип UInt32.
 point
 Координаты точки, в которой начинается выполнение логики инструмента (в экранных координатах). Тип UInt32. Младшие 16 бит определяют координату X, а старшие 16 бит - координату Y.
 keyState
 Состояние клавиш-модификаторов (Ctrl, Shift, Alt и др.) в момент активации данного инструмента. Тип UInt32.
 Описание
 Метод предназначен для исполнения логики пользовательского инструмента при его активации на панели инструментов. Контекст активации (способ запуска, координаты, модификаторы) предоставляют аргументы. Код реализации инструмента может выполнять самые разнообразные действия: запускать команду, создавать объект, переопределять состояние объекта и т.д. Этот процесс является модальным.
 В текущей версии не реализован.
 Ссылки
 HostMgd.Windows.ToolPalette.CustomToolBase, HostMgd.Windows.ToolPalette
 Ваши комментарии по поводу этого топика: Послать отзыв!