Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Класс HostMgd.EditorInput.SelectionFilter
 Послать отзыв
 Класс, описывающий виды фильтров, которые применяются к объектам при выборе объектов после приглашения.
 Иерархия классов
HostMgd::EditorInput::SelectionFilter
 Синтаксис
C#
Visual Basic
public class SelectionFilter;
Public Class SelectionFilter
 Описание
 Класс, описывающий виды фильтров, которые применяются к объектам при выборе объектов после приглашения.
 Представляет собой контейнер для хранения массива значений TypedValue. Структура TypedValue является аналогом структуры resbuf в небезопасном коде и хранит два поля:
TypeCode (System.Int16)
Value (System.Object)
 Значение TypeCode является кодом, определяющим тип Value. Например:
 0 - Entity type group. Value = "CIRCLE", "LINE" и пр.
 2 - Имя блока. Value - строка.
 3 - имя DIMSTYLE
 6 - Line Type
 7 - text style
 8 - имя Layer. Возможно применение символа "*".
 40 - Radius
 62 - Entity color. Value - как строковое значение, так и индекс цвета.
 Методы
 Конструкторы
 Имя
 Описание
 SelectionFilter
 Топики
 Имя
 Описание
 SelectionFilter Методы
 Ниже перечислены методы класса SelectionFilter.
 Ссылки
 SelectionFilter Методы, Методы, Топики, SelectionFilter Методы
 Ваши комментарии по поводу этого топика: Послать отзыв!