Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PublishSheetEventArgs.PlotPaperUnit
 Послать отзыв
 This is PlotPaperUnit, a member of class PublishSheetEventArgs.
 Синтаксис
C#
Visual Basic
public Teigha::DatabaseServices::PlotPaperUnit PlotPaperUnit;
Public Property PlotPaperUnit() As Teigha.DatabaseServices.PlotPaperUnit
 Ссылки
 PublishSheetEventArgs Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!