Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод AboutToBeginPublishingEventArgs.WritePrivateSection
 Послать отзыв
 This is WritePrivateSection, a member of class AboutToBeginPublishingEventArgs.
 Синтаксис
C#
Visual Basic
public void WritePrivateSection(ref System.String sectionName, ref IDictionaryEnumerator data);
Public Sub WritePrivateSection(ByRef sectionName As System.String, ByRef data As IDictionaryEnumerator)
 Ссылки
 AboutToBeginPublishingEventArgs Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!