Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод PaneCollection.Remove (HostMgd::Windows::Pane^)
 Послать отзыв
 This is Remove, a member of class PaneCollection.
 Синтаксис
C#
Visual Basic
public void Remove(ref HostMgd::Windows::Pane value);
Public Sub Remove(ByRef value As HostMgd.Windows.Pane)
 Ссылки
 PaneCollection Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!