Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PromptNumericalOptions.AllowZero
 Послать отзыв
 Синтаксис
C#
Visual Basic
public bool AllowZero;
Public Property AllowZero() As bool
 Описание
 Возвращает или устанавливает признак того, разрешен ли ввод нулевого значения.
 Значение true означает, что ввод нулевого значения разрешен, и false в противном случае.
 Условия
 На чтение и запись
 Ссылки
 PromptNumericalOptions Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!