Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.PlotInfoValidator.IsCustomPossible
 Послать отзыв
 Метод позволяет проверить возможность создания пользовательского формата бумажного носителя, исходя из заданного объекта PlotInfo.
 Синтаксис
C#
Visual Basic
Копировать Код
public int IsCustomPossible( ref HostMgd.PlottingServices.PlotInfo info );
Копировать Код
Public Function IsCustomPossible( ByRef info As HostMgd.PlottingServices.PlotInfo ) As Integer
 Параметры
 Параметры
 Описание
 info
 Входной экземпляр сервисного класса HostMgd.PlottingServices.PlotInfo, который предоставляет свойства, определяющие печать.
 Возвращает
 Возвращает побитовую комбинацию флагов из перечисления HostMgd.PlottingServices.CustomSizeResults. Тип int.
 Описание
 Метод проверяет, возможно ли создать пользовательский формат (размер) бумажного носителя, исходя из заданного объекта PlotInfo.
 Этот метод не выполняет проверку входного объекта, и перед вызовом этого метода валидация объекта не требуется.
 Для определения размера страницы и типа устройства, которые будут использоваться для создания нестандартного размера носителя, используются свойства листа (layout), переопределения настроек ввода на плоттер и переопределения устройства, извлекаемые из объекта PlotInfo.
 Метод возвращает значение, содержащее побитовую комбинацию флагов из перечисления HostMgd.PlottingServices.CustomSizeResults, которые служат индикаторами возможных проблем (если таковые имеются) при создании нестандартного размера бумаги для устройства. Например, заявленный размер слишком велик для плоттера или при выводе потребуется разворот листа на 90 градусов.
 Ссылки
 HostMgd.PlottingServices.PlotInfoValidator, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!