Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Событие Application.SystemVariableChanged
 Послать отзыв
 Событие, возникающее при попытке изменения системной переменной (даже если реальное значение и не будет изменено).
 Синтаксис
C#
Visual Basic
public event SystemVariableChangedEventHandler SystemVariableChanged;
Public Event SystemVariableChanged As SystemVariableChangedEventHandler
 Описание
 Событие возникает всегда, когда системная переменная изменяется с помощью команды SETVAR или с помощью указания имени переменной в командной строке. Для остальных встроенных команд, которые вызывают изменение системных переменных, возникновение этого события не гарантировано.
 Ссылки
 HostMgd.ApplicationServices.Application, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!