Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.Windows.ToolPalette.CustomToolBase.CreateCommandTool
 Послать отзыв
 Метод вызывается фреймворком для стандартного инструмента при перетаскивании объекта на панель инструментов. Не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public HostMgd.Windows.ToolPalette.Tool CreateCommandTool( ref HostMgd.Windows.ToolPalette.Package palette, ref System.String toolName, ref HostMgd.Windows.ToolPalette.ImageInfo bitmapName, ref System.String macro );
Копировать Код
Public Function CreateCommandTool( ByRef palette As HostMgd.Windows.ToolPalette.Package, ByRef toolName As System.String, ByRef bitmapName As HostMgd.Windows.ToolPalette.ImageInfo, ByRef macro As System.String ) As HostMgd.Windows.ToolPalette.Tool
 Параметры
 Параметры
 Описание
 palette
 Пакет инструментов. Тип HostMgd.Windows.ToolPalette.Package.
 toolName
 Наименование инструмента. Тип System.String.
 bitmapName
 Связанное с инструментом изображение. Тип HostMgd.Windows.ToolPalette.ImageInfo.
 macro
 Имя макроса. Тип System.String.
 Возвращает
 Возвращает созданный инструмент в панели инструментов palette. Тип HostMgd.Windows.ToolPalette.Tool.
 Описание
 Метод вызывается фреймворком для стандартного инструмента при перетаскивании объекта на панель инструментов.
 В текущей версии не реализован.
 Ссылки
 HostMgd.Windows.ToolPalette.CustomToolBase, HostMgd.Windows.ToolPalette
 Ваши комментарии по поводу этого топика: Послать отзыв!