Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.GetString(PromptStringOptions)
 Послать отзыв
 Метод позволяет пользователю ввести текстовую строку, возвращая результат с информацией о статусе и введённом значении.
 Синтаксис
C#
Visual Basic
Копировать Код
public PromptResult GetString(PromptStringOptions options);
Копировать Код
Public Function GetString(options As PromptStringOptions) As PromptResult
 Параметры
 Параметры
 Описание
 options
 Объект, содержащий параметры ввода строки:
 Возвращает
 Возвращает объект типа PromptResult, который содержит:
Status — статус операции (OK, Cancel, Error и др.).
StringResult — введённая пользователем строка (если ввод успешен).
 Если пользователь ввёл допустимое значение, статус будет равен PromptStatus.OK.
 Описание
 Метод используется для интерактивного получения текстового ввода от пользователя через командную строку nanoCAD. Пользователь может ввести произвольную строку или выбрать значение из списка ключевых слов (если они заданы). Метод предоставляет гибкие настройки приглашения через объект PromptStringOptions, такие как сообщение, начальное значение, ограничения на ввод и возможность игнорировать пробелы. Результат операции возвращается в виде объекта PromptResult.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("GetStringExample_PromptStringOptions")] public void GetStringExample_PromptStringOptions() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Определяем настройки запроса пользователю PromptStringOptions options = new PromptStringOptions("Введите имя"); options.DefaultValue = "Untitled"; options.AllowSpaces = true; // Создаём запрос пользователю PromptResult pr = editor.GetString(options); // Если все данные введены, выводим результат в командную строку if (pr.Status == PromptStatus.OK) { editor.WriteMessage( $"\nВы ввели: {pr.StringResult}"); } else { editor.WriteMessage( "\nВвод отменён."); } } }
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!