Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод PlotProgressDialog.OnBeginPlot
 Послать отзыв
 При вызове этого метода форма процесса печати выводится на экран.
 Синтаксис
C#
Visual Basic
public void OnBeginPlot();
Public Sub OnBeginPlot()
 Описание
 Ссылки
 PlotProgressDialog Класс, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!