Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Делегат HostMgd.ApplicationServices.BeginDoubleClickEventHandler
 Послать отзыв
 Делегат события двойного щелчка
 Синтаксис
C#
Visual Basic
public delegate BeginDoubleClickEventHandler();
Public Delegate Sub BeginDoubleClickEventHandler()
 Ваши комментарии по поводу этого топика: Послать отзыв!