Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PointFilterResult.DisplayObjectSnapGlyph
 Послать отзыв
 Синтаксис
C#
Visual Basic
public bool DisplayObjectSnapGlyph;
Public Property DisplayObjectSnapGlyph() As bool
 Описание
 Если значение свойства С true, nanoCAD будет отображать значок объектной привязки, даже если вычисленная точка изменена приложением.
 Условия
 На чтение и запись
 Ссылки
 PointFilterResult Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!