Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PerPropertyBrowsingEntryAttribute.LeftIconType
 Послать отзыв
 This is LeftIconType, a member of class PerPropertyBrowsingEntryAttribute.
 Синтаксис
C#
Visual Basic
public int LeftIconType;
Public Property LeftIconType() As Integer
 Ссылки
 PerPropertyBrowsingEntryAttribute Класс, HostMgd.Windows.ToolPalette
 Ваши комментарии по поводу этого топика: Послать отзыв!