Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство SelectionSet.IsSynchronized
 Послать отзыв
 Синтаксис
C#
Visual Basic
public bool IsSynchronized;
Public Property IsSynchronized() As bool
 Описание
 Возвращает признак того, является ли набор синхронизированным.
 Условия
 Только на чтение
 Ссылки
 SelectionSet Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!