Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PickPointDescriptor.Kind
 Послать отзыв
 Синтаксис
C#
Visual Basic
public HostMgd::EditorInput::PickPointKind Kind;
Public Property Kind() As HostMgd.EditorInput.PickPointKind
 Описание
 Возвращает общую "форму" точки выбора.
 Условия
 Только на чтение
 Ссылки
 PickPointDescriptor Структура, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!