Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PlotStyleDialog.IncludeByBlockByLayer
 Послать отзыв
 This is IncludeByBlockByLayer, a member of class PlotStyleDialog.
 Синтаксис
C#
Visual Basic
public bool IncludeByBlockByLayer;
Public Property IncludeByBlockByLayer() As bool
 Ссылки
 PlotStyleDialog Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!