Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод StatusBarItem.PointToScreen
 Послать отзыв
 This is PointToScreen, a member of class StatusBarItem.
 Синтаксис
C#
Visual Basic
public System.Drawing.Point PointToScreen(System.Drawing.Point p);
Public Function PointToScreen(p As System.Drawing.Point) As System.Drawing.Point
 Ссылки
 StatusBarItem Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!