Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Converter.AngleToString (double, AngularUnitFormat, int)
 Послать отзыв
 Синтаксис
C#
Visual Basic
public String AngleToString(double value, AngularUnitFormat units, int precision);
Public Function AngleToString(value As Double, units As AngularUnitFormat, precision As Integer) As String
 Описание
 Конвертирует угол в строку в соответствии с заданными угловыми единицами и точностью.
 Ссылки
 Converter Класс, HostMgd.Runtime Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!