Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Camera.BackClipDistance
 Послать отзыв
 Свойство BackClipDistance предоставляет доступ к положению задней плоскости отсечения камеры. Не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public double BackClipDistance;
Копировать Код
Public ReadOnly Property BackClipDistance As Double
 Возвращает
 Возвращает расстояние до задней плоскости отсечения. Тип double.
 Описание
 Свойство BackClipDistance предоставляет доступ к положению задней плоскости отсечения камеры. В текущей версии не реализовано.
 Условия
 Только чтение.
 Ссылки
 HostMgd.EditorInput.Camera, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!