Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.DocumentCollection.DocumentToBeDeactivated
 Послать отзыв
 Событие, возникающее перед деактивацией документа.
 Синтаксис
C#
Visual Basic
public event DocumentCollectionEventHandler DocumentToBeDeactivated;
Public Event DocumentToBeDeactivated As DocumentCollectionEventHandler
 Возвращает
 Возвращает тип данных HostMgd.ApplicationServices.DocumentCollectionEventHandler
 Описание
 Событие, генерируемое перед деактивацией документа.
 Соответствует функции NRX API HostApDocManagerReactor.documentToBeDeactivated().
 Ссылки
 HostMgd.ApplicationServices.DocumentCollection, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!