Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор PickPointDescriptor.PickPointDescriptor
 Послать отзыв
 Синтаксис
C#
Visual Basic
public PickPointDescriptor(HostMgd::EditorInput::PickPointKind kind, Teigha::Geometry::Point3d pointOnLine, Teigha::Geometry::Vector3d direction);
Public Sub New(kind As HostMgd.EditorInput.PickPointKind, pointOnLine As Teigha.Geometry.Point3d, direction As Teigha.Geometry.Vector3d)
 Параметры
 Параметры
 Описание
 kind
 Тип базовой точки.
 pointOnLine
 Указатель на линию.
 direction
 Направление указателя.
 Описание
 Конструктор.
 Ссылки
 PickPointDescriptor Структура, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!