Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Класс HostMgd.EditorInput.DrawJig
 Послать отзыв
 Класс обеспечивает возможность создавать произвольную графику или одновременно несколько пользовательских примитивов в виде цельного графического объекта непосредственно на экране с помощью технологии Jig.
 Иерархия классов
HostMgd::EditorInput::Jig HostMgd::EditorInput::DrawJig
 Синтаксис
C#
Visual Basic
public class DrawJig : Jig;
Public Class DrawJig Inherits Jig
 Описание
 Класс обеспечивает возможность создавать произвольную графику или одновременно несколько пользовательских примитивов в виде цельного графического объекта непосредственно на экране путем указания курсором мыши начальной точки на экране и перетаскивания курсора мыши (далее технология Jig). При этом на экране будет отображаться предпросмотр создаваемого объекта. При необходимости создания подобным способом одного пользовательского примитива, используется класс EntityJig.
 Пример
 Шаги, которые нужно выполнить, чтобы реализовать команду построения произвольной графики или группы пользовательских примитивов как цельного графического объекта с помощью технологии Jig:
Создать класс -наследник класса DrawJig:
Реализовать в этом классе конструктор, принимающий в качестве параметра начальную точку, от которой будет создаваться графический объект.
Реализовать в классе метод Sampler(). В методе необходимо вызвать один из методов класса JigPrompts. Метод отслеживает перемещение курсора мыши, получая и запоминая данные о его положении.
Реализовать в классе метод WorldDraw(). Метод преобразовывает полученные методом Sampler() данные в формат, необходимый для построения примитива.
Если есть необходимость отображения графических объектов/текста, зависящих от свойств видового экрана, необходимо реализовать метод ViewportDraw() и методом WorldDraw() вернуть false, чтобы метод ViewportDraw() сработал.
Создать команду построения графического объекта:
В методе команды сделать запрос данных, необходимых для первоначальной инициализации графического объекта.
Запомнить полученные данные.
Запустить транзакцию с базой данных чертежа. Далее все действия происходят внутри транзакции.
Создать экземпляр класса из п.1, передав в него данные, полученные запросом данных для первоначальной инициализации графического объекта.
Вызвать метод Editor.Drag(), передать в него экземпляр класа из предыдущего пункта.
Проверить, что вернул метод Editor.Drag(). Если он вернул PromptStatus.OK, добавить графический объект в базу данных чертежа и завершить транзакцию.
 Результатом работы приведенного ниже примера будет построение полукруга, состоящего из двух пользовательских примитивов: дуги (Arc) и линии (Line).
C#
 Копировать Код
using System; using HostMgd.EditorInput; using HostMgd.ApplicationServices; using Teigha.DatabaseServices; using Teigha.Geometry; using Teigha.Runtime; using Teigha.GraphicsInterface; public class SemicircleDrawJig : DrawJig { public Point3d basePoint, newPoint; public Arc arc; public Line line; public SemicircleDrawJig(Point3d point) { this.basePoint = point; this.newPoint = point; } protected override SamplerStatus Sampler(JigPrompts prompts) { JigPromptPointOptions options = new JigPromptPointOptions("Радиус полукруга:"); PromptPointResult promptResult = prompts.AcquirePoint(options); if (promptResult.Status == PromptStatus.OK) { if (this.basePoint == promptResult.Value) { return SamplerStatus.NoChange; } else { this.newPoint = promptResult.Value; return SamplerStatus.OK; } } return SamplerStatus.Cancel; } //Отрисовка полукруга protected override bool WorldDraw(WorldDraw draw) { if (arc == null) { arc = new Arc(); arc.SetDatabaseDefaults(); } if (line == null) { line = new Line(); line.SetDatabaseDefaults(); } arc.Center = basePoint; arc.StartAngle = 0; arc.EndAngle = Math.PI; Line radius = new Line(this.basePoint, this.newPoint); arc.Radius = radius.Length; line.StartPoint = new Point3d(basePoint.X - radius.Length, basePoint.Y, basePoint.Z); line.EndPoint = new Point3d(basePoint.X + radius.Length, basePoint.Y, basePoint.Z); draw.Geometry.Draw(arc); draw.Geometry.Draw(line); //если метод возвращает true, то метод ViewportDraw не будет вызываться return false; } //Отрисовка вспомогательных линий protected override void ViewportDraw(ViewportDraw draw) { // Получение системы координат видового экрана Matrix3d ucs = draw.Viewport.EyeToWorldTransform; // Преобразование точки центра полукруга в систему координат видового экрана Point3d cen = arc.Center.TransformBy(ucs.Inverse()); double rad = arc.Radius; // Задаем зеленый цвет графическим объектам, привязанным к видовому экрану draw.SubEntityTraits.Color = 3; // Инициализация начальных и конечных точек линий и преобразование их в систему координат видового экрана Point3d line1Pt1 = new Point3d(cen.X - rad * 1.2, cen.Y, cen.Z).TransformBy(ucs); Point3d line1Pt2 = new Point3d(cen.X + rad * 1.2, cen.Y, cen.Z).TransformBy(ucs); Point3d line2Pt1 = new Point3d(cen.X, cen.Y - rad * 1.2, cen.Z).TransformBy(ucs); Point3d line2Pt2 = new Point3d(cen.X, cen.Y + rad * 1.2, cen.Z).TransformBy(ucs); // Отрисовка линий на экране draw.Geometry.WorldLine(line1Pt1, line1Pt2); draw.Geometry.WorldLine(line2Pt1, line2Pt2); } } public class Commands { [CommandMethod("SemicircleDrawJig")] public void SemicircleJigCommand() { Document doc = Application.DocumentManager.MdiActiveDocument; Editor ed = doc.Editor; Database db = doc.Database; // Запрос центра полукруга PromptPointOptions promptOptions = new PromptPointOptions("Центр полукруга:"); PromptPointResult promptResult = ed.GetPoint(promptOptions); // Проверка полученных данных if (promptResult.Status != PromptStatus.OK) return; // Инициализация переменной - точки центра полукруга Point3d point = promptResult.Value; using (Transaction transaction = db.TransactionManager.StartTransaction()) { // Получение доступа к пространству модели  BlockTable blockTable = transaction.GetObject(db.BlockTableId, OpenMode.ForRead) as BlockTable; BlockTableRecord modelSpace = transaction.GetObject(blockTable[BlockTableRecord.ModelSpace], OpenMode.ForWrite) as BlockTableRecord; // Создание экземпляра класса, отвечающего за отрисовку полукруга и вызов метода, позволяющего  // отрисовывать геометрические объекты путем перетаскивания курсора мыши SemicircleDrawJig semicircleJig = new SemicircleDrawJig(point); promptResult = (PromptPointResult)ed.Drag(semicircleJig); // Проверка полученных данных if (promptResult.Status == PromptStatus.OK) { if (semicircleJig.arc != null) { // Добавление дуги в пространство модели modelSpace.AppendEntity(semicircleJig.arc); transaction.AddNewlyCreatedDBObject(semicircleJig.arc, true); } if (semicircleJig.line != null) { // Добавление линии в пространство модели modelSpace.AppendEntity(semicircleJig.line); transaction.AddNewlyCreatedDBObject(semicircleJig.line, true); } transaction.Commit(); } } } }
Visual Basic
 Копировать Код
Imports System Imports HostMgd.EditorInput Imports HostMgd.ApplicationServices Imports Teigha.DatabaseServices Imports Teigha.Geometry Imports Teigha.Runtime Imports Teigha.GraphicsInterface Public Class SemicircleDrawJig Inherits DrawJig Public basePoint, newPoint As Point3d Public arc As Arc Public line As Line Public Sub New(ByVal point As Point3d) basePoint = point newPoint = point End Sub Protected Overrides Function Sampler(ByVal prompts As JigPrompts) As SamplerStatus Dim options As JigPromptPointOptions = New JigPromptPointOptions("Радиус полукруга:") Dim promptResult As PromptPointResult = prompts.AcquirePoint(options) If promptResult.Status <> PromptStatus.OK Then Return SamplerStatus.Cancel End If If basePoint <> promptResult.Value Then newPoint = promptResult.Value Return SamplerStatus.OK Else Return SamplerStatus.NoChange End If End Function ' Отрисовка полукруга Protected Overrides Function WorldDraw(ByVal draw As WorldDraw) As Boolean If arc Is Nothing Then arc = New Arc() arc.SetDatabaseDefaults() End If If line Is Nothing Then line = New Line() line.SetDatabaseDefaults() End If arc.Center = basePoint arc.StartAngle = 0 arc.EndAngle = Math.PI Dim radius As Line = New Line(basePoint, newPoint) arc.Radius = radius.Length line.StartPoint = New Point3d(basePoint.X - radius.Length, basePoint.Y, basePoint.Z) line.EndPoint = New Point3d(basePoint.X + radius.Length, basePoint.Y, basePoint.Z) draw.Geometry.Draw(arc) draw.Geometry.Draw(line) ' если метод возвращает true, то метод ViewportDraw не будет вызываться Return True End Function ' Отрисовка вспомогательных линий Protected Overrides Sub ViewportDraw(ByVal draw As ViewportDraw) ' Получение системы координат видового экрана Dim ucs As Matrix3d = draw.Viewport.EyeToWorldTransform ' Преобразование точки центра полукруга в систему координат видового экрана Dim cen As Point3d = arc.Center.TransformBy(ucs.Inverse()) Dim rad As Double = arc.Radius ' Задаем зеленый цвет графическим объектам, привязанным к видовому экрану draw.SubEntityTraits.Color = 3 ' Инициализация начальных и конечных точек линий и преобразование их в систему координат видового экрана Dim line1Pt1 As Point3d = New Point3d(cen.X - rad * 1.2, cen.Y, cen.Z).TransformBy(ucs) Dim line1Pt2 As Point3d = New Point3d(cen.X + rad * 1.2, cen.Y, cen.Z).TransformBy(ucs) Dim line2Pt1 As Point3d = New Point3d(cen.X, cen.Y - rad * 1.2, cen.Z).TransformBy(ucs) Dim line2Pt2 As Point3d = New Point3d(cen.X, cen.Y + rad * 1.2, cen.Z).TransformBy(ucs) ' Отрисовка линий на экране draw.Geometry.WorldLine(line1Pt1, line1Pt2) draw.Geometry.WorldLine(line2Pt1, line2Pt2) End Sub End Class Public Class Commands <CommandMethod("SemicircleDrawJig")> Public Sub SemicircleJigCommand() Dim doc As Document = Application.DocumentManager.MdiActiveDocument Dim ed As Editor = doc.Editor Dim db As Database = doc.Database ' Запрос центра полукруга Dim promptOptions As PromptPointOptions = New PromptPointOptions("Центр полукруга:") Dim promptResult As PromptPointResult = ed.GetPoint(promptOptions) Dim point As Point3d ' Проверка полученных данных ' Инициализация переменной - точки центра полукруга If promptResult.Status = PromptStatus.OK Then point = promptResult.Value Using transaction As Transaction = db.TransactionManager.StartTransaction() ' Получение доступа к пространству модели  Dim blockTable As BlockTable = TryCast(transaction.GetObject(db.BlockTableId, OpenMode.ForRead), BlockTable) Dim modelSpace As BlockTableRecord = TryCast(transaction.GetObject(blockTable(BlockTableRecord.ModelSpace), OpenMode.ForWrite), BlockTableRecord) ' Создание экземпляра класса, отвечающего за отрисовку полукруга и вызов метода, позволяющего отрисовывать геометрические объекты путем перетаскивания курсора мыши Dim semicircleJig As SemicircleDrawJig = New SemicircleDrawJig(point) promptResult = CType(ed.Drag(semicircleJig), PromptPointResult) ' Проверка полученных данных If promptResult.Status <> PromptStatus.OK Then Return End If If semicircleJig.arc IsNot Nothing Then ' Добавление дуги в пространство модели modelSpace.AppendEntity(semicircleJig.arc) transaction.AddNewlyCreatedDBObject(semicircleJig.arc, True) End If If semicircleJig.line IsNot Nothing Then ' Добавление линии в пространство модели modelSpace.AppendEntity(semicircleJig.line) transaction.AddNewlyCreatedDBObject(semicircleJig.line, True) End If transaction.Commit() End Using End Sub End Class
 Алгоритм работы приведенного примера:
Запускается работа команды SemicircleDrawJig, выполняется метод SemicircleJigCommand() класса Commands.
Запрос центра полукруга, проверка полученных данных.
Если введенные данные верны, создается экземпляр класса SemicircleDrawJig, позволяющий построить полукруг с помощью технологии Jig. При создании экземпляра этого класса в его конструктор передаеются координаты центра будущего полукруга.
Вызов метода Drag() класса Editor, в который передается экземпляр класса SemicircleDrawJig. Метод обращается к экземпляру класса SemicircleDrawJig при каждом передвижении курсора мыши на экране.
Запрос точки для расчета радиуса полукруга методом Sampler() класса SemicircleDrawJig.
Метод Sampler() получает точку расположения курсора мыши на экране и запускается метод WorldDraw() класса SemicircleDrawJig, в котором из полученной точки высчитывается радиус полукруга.
Если метод WorldDraw() возвращает true, то после его выполнения на экране появляется полукруг. При перемещении курсора мыши будет происходить пересчет радиуса полукруга и его изменение на экране.
Если метод WorldDraw() возвращает false, то после его выполнения будет вызван метод ViewportDraw(), в котором будут получены данные о системе координат активного видового экрана. С помощью этих данных и данных о создаваемых объектах будут определены параметры вспомогательных линий.
На экране вместе с графическим объектом из метода WorldDraw() появится графический объект, который будет зависеть от положения камеры видового экрана. В примере этим графическим объектом являются две перпендикулярные линии, которые пересекаются в центре полукруга и независимо от того, какое направление взгляда установлено на видовом экране, будут отображаться в плоскости видового экрана, как на виде сверху. Так как в методе установлена зависимость длины линий от радиуса полукруга, то при перемещении курсора мыши, длина линий будет пересчитываться и меняться на экране.
После того, как радиус полукруга был выбран, работа метода Editor.Drag() завершается, созданный примитив добавляется в базу данных чертежа. Работа команды SemicircleDrawJig завершается.
 Методы
 Конструкторы
 Класс HostMgd.EditorInput.DrawJig
 Имя
 Описание
 DrawJig
 Конструктор класса DrawJig
 Топики
 Имя
 Описание
 Jig Методы
 Ниже перечислены методы класса Jig.
 Класс HostMgd.EditorInput.DrawJig
 Имя
 Описание
 DrawJig Методы
 Ниже перечислены методы класса DrawJig.
 Ссылки
 DrawJig Методы, Методы, Топики, Jig Методы
 Ваши комментарии по поводу этого топика: Послать отзыв!