Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Класс HostMgd.ApplicationServices.UnknownCommandEventArgs
 Послать отзыв
 Иерархия классов
HostMgd::ApplicationServices::UnknownCommandEventArgs
 Синтаксис
C#
Visual Basic
public class UnknownCommandEventArgs : System.EventArgs;
Public Class UnknownCommandEventArgs Inherits System.EventArgs
 Описание
 Класс обеспечивает данными событие UnknownCommand класса Document.
 Топики
 Имя
 Описание
 UnknownCommandEventArgs Свойства
 Ниже перечислены свойства класса UnknownCommandEventArgs.
 Ссылки
 UnknownCommandEventArgs Свойства, Топики, UnknownCommandEventArgs Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!