Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.Windows.ToolPalette.CustomToolBase.GetMenuHelp
 Послать отзыв
 Метод вызывается для отображения всплывающей однострочной справки для команды, добавленной в контекстное меню методом GetContextMenu() инструмента. Не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual System.String GetMenuHelp( UInt32 idCmd );
Копировать Код
Public Overridable Function GetMenuHelp( idCmd As UInt32 ) As System.String
 Параметры
 Параметры
 Описание
 idCmd
 Входной идентификатор команды. Тип UInt32.
 Возвращает
 Возвращает строку справки для команды. Тип System.String.
 Описание
 Метод вызывается для отображения всплывающей однострочной справки для команды, добавленной в контекстное меню методом GetContextMenu() инструмента.
 В текущей версии не реализован.
 Ссылки
 HostMgd.Windows.ToolPalette.CustomToolBase, HostMgd.Windows.ToolPalette
 Ваши комментарии по поводу этого топика: Послать отзыв!