Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.LongTransactionEventArgs
 Послать отзыв
 Класс LongTransactionEventArgs представляет данные событий длительных транзакций. В текущей версии не реализован.
 Иерархия классов
HostMgd::ApplicationServices::LongTransactionEventArgs
 Синтаксис
C#
Visual Basic
Копировать Код
public sealed class LongTransactionEventArgs : EventArgs
Копировать Код
Public NotInheritable Class LongTransactionEventArgs Inherits EventArgs
 Описание
 Класс LongTransactionEventArgs является наследником класса EventArgs и используется для предоставления данных событий длительных транзакций, определенных в классе LongTransactionManager.
 В текущей версии не реализован.
 Замечания
 Типичным примером операций, выполняемых в рамках длительных транзакций, является редактирование внешних ссылок и блоков.
 Ваши комментарии по поводу этого топика: Послать отзыв!