Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.Document.ImpliedSelectionChanged
 Послать отзыв
 Событие, возникающее при изменении набора предварительно выбранных объектов в документе (pickfirst).
 Синтаксис
C#
Visual Basic
public event EventHandler ImpliedSelectionChanged;
Public Event ImpliedSelectionChanged As EventHandler
 Возвращает
 Возвращает тип данных EventHandler
 Описание
 Событие, возникающее при изменении набора предварительно выбранных объектов в документе (pickfirst). Оно возникает для всех действий, добавляющих или удаляющих объекты из этого набора. Действия, меняющие геометрию или свойства объектов из этого набора (растягивание, передвижение и т.д.) не вызывают этого события. Соответствует функции NRX API HostEditorReactor.pickfirstModified().
 Ссылки
 HostMgd.ApplicationServices.Document, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!