Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.DocumentCollection.DocumentCreationCanceled
 Послать отзыв
 Событие, возникающее после отмены создания dwg-документа.
 Синтаксис
C#
Visual Basic
public event DocumentCollectionEventHandler DocumentCreationCanceled;
Public Event DocumentCreationCanceled As DocumentCollectionEventHandler
 Возвращает
 Возвращает тип данных HostMgd.ApplicationServices.DocumentCollectionEventHandler
 Описание
 Событие возникает, когда пользователь отменил создание dwg-документа. Данное событие может возникнуть только в режиме MDI и после события DocumentCreateStarted.
 Соответствует функции NRX API HostApDocManagerReactor.documentCreationCanceled().
 Ссылки
 HostMgd.ApplicationServices.DocumentCollection, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!