Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptResult.StringResult
 Послать отзыв
 Свойство возвращает строковое значение, полученное после интерактивного приглашения, если операция завершена успешно или введено ключевое слово.
 Синтаксис
C#
Visual Basic
Копировать Код
public string StringResult { get; set; }
Копировать Код
Public Property StringResult As String
 Возвращает
 Возвращает значение типа string:
Если статус PromptStatus.OK — строка, введённая пользователем или выбранная из списка.
Если статус PromptStatus.Keyword — ключевое слово, введённое пользователем.
Если операция отменена или произошла ошибка — null или пустая строка.
 Описание
 Свойство используется для получения строкового результата операции ввода, выполненной пользователем после приглашения, например, через методы GetString() или GetKeywords(). Оно возвращает значение, введённое пользователем, если статус операции равен PromptStatus.OK или PromptStatus.Keyword. Если ввод был отменён или произошла ошибка, свойство может возвращать null или пустую строку.
 Условия
 Чтение и запись
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("PromptResultExample_StringResult")] public void PromptResultExample_StringResult() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Определяем настройки запроса пользователю PromptStringOptions options = new PromptStringOptions("Введите имя"); options.DefaultValue = "Untitled"; options.AllowSpaces = true; // Создаём запрос пользователю PromptResult pr = editor.GetString(options); // Если все данные введены, выводим результат в командную строку if (pr.Status == PromptStatus.OK) { editor.WriteMessage( $"\nВы ввели: {pr.StringResult}"); } else { editor.WriteMessage( "\nВвод отменён."); } } }
 Ссылки
 HostMgd.EditorInput.PromptResult, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!