Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PointHistoryBits
 Послать отзыв
 Данное перечисление определяет битовые маски в значениях истории ввода точек, позволяющие выяснить, какие способы фильтрации точек оказали влияние на ввод точки в конкретном системном событии.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum PointHistoryBits { DidNotPick = 0x0, Tablet = 0x1, NotDigitizer = 0x2, LastPoint = 0x4, Gripped = 0x8, CartSnapped = 0x10, Ortho = 0x20, CyclingPoint = 0x40, ObjectSnapped = 0x80, PolarAngle = 0x100, Aligned = 0x400, AppFiltered = 0x800, ForcedPick = 0x1000, UsedPickBox = 0x2000, UsedObjectSnapBox = 0x4000, PickAborted = 0x8000, PickMask = 0xe000, XPending = 0x10000, YPending = 0x20000, ZPending = 0x40000, CoordinatePending = 0x70000, FromKeyboard = 0x80000, NotInteractive = 0x100000 }
Копировать Код
Public Enum PointHistoryBits DidNotPick = 0x0 Tablet = 0x1 NotDigitizer = 0x2 LastPoint = 0x4 Gripped = 0x8 CartSnapped = 0x10 Ortho = 0x20 CyclingPoint = 0x40 ObjectSnapped = 0x80 PolarAngle = 0x100 Aligned = 0x400 AppFiltered = 0x800 ForcedPick = 0x1000 UsedPickBox = 0x2000 UsedObjectSnapBox = 0x4000 PickAborted = 0x8000 PickMask = 0xe000 XPending = 0x10000 YPending = 0x20000 ZPending = 0x40000 CoordinatePending = 0x70000 FromKeyboard = 0x80000 NotInteractive = 0x100000 End Enum
 Члены
 Члены
 Описание
 Aligned
 Значение: 0x0400. Включен режим автоматического выравнивания AutoAlign
 AppFiltered
 Значение: 0x0800. В приложении зарегистрирован фильтр точек (этот бит получат только мониторы).
 CartSnapped
 Значение: 0x0010. Включен режим декартовой привязки (старый стиль).
 CoordinatePending
 Значение: 0x70000. Маска для предшествующих ожидаемых координатных битов.
 CyclingPoint
 Значение: 0x0040. Вызывающий объект "зациклился", что указывает на то, что вычисленная привязка (или выравнивание), вероятно, не является наилучшей.
 DidNotPick
 Значение: 0 (0x0000). Выбор точки не выполнен, т.е. не имели места ни принудительное указание (ForcedPick), ни объектная привязка (OSNAP).
 ForcedPick
 Значение: 0x1000. Включен режим принудительного выбора точки.
 FromKeyboard
 Значение: 0x80000. Координаты были введены пользователем с клавиатуры.
 Gripped
 Значение: 8 (0x008) Сработало гравитационное притяжение ручки.
 LastPoint
 Значение: 4 (0x0004). Бит указывает, что последняя точка является действительной.
 NotDigitizer
 Значение: 2 (0x0002). Бит указывает, что выбор точки выполнен любым способом (указанием мышью, вводом с клавиатуры, скриптом, макросом), но точно не с использованием графического планшета (дигитайзера).
 NotInteractive
 Значение: 0x100000. Координата получена с использованием скрипта, макроса расширения меню, вызова команды AutoLISP или ads_command().
 ObjectSnapped
 Значение: 128 (0x0080). Включен режим объектной привязки (OSNAP).
 Ortho
 Значение: 32 (0x0020). Включен режим декартовой привязки.
 PickAborted
 Значение: 0x8000. Выбор объектов был прерван из-за необработанных сообщений в очереди сообщений nanoCAD о перемещении мыши.
 PickMask
 Значение: 0xE000. Маска AND для удаления битов "режима выбора" при сравнении с флагами DidNotPick, UsedPickBox и UsedOsnapBox как перечислениями.
 PolarAngle
 Значение: 256 (0x0100). Включен режим полярной привязки.
 Tablet
 Значение: 1 (0x0001). Бит указывает, что выбор точки выполнен с использованием графического планшета (дигитайзера).
 UsedObjectSnapBox
 Значение: 0x4000. "Принудительный выбор" в зоне объектной привязки (OSNAP).
 UsedPickBox
 Значение: 0x2000. "Принудительный выбор" в зоне выбора; используется как перечисление в этих пределах.
 XPending
 Значение: 0x10000. Ожидается координата X.
 YPending
 Значение: 0x20000. Ожидается координата Y.
 ZPending
 Значение: 0x40000. Ожидается координата Z.
 Описание
 Перечисление PointHistoryBits используется для анализа источника или способа ввода точек в системных событиях. Оно определяет битовые маски в значениях истории ввода точек, позволяющие выяснить, какие способы фильтрации точек оказали влияние на ввод точки в конкретном системном событии.
 Ваши комментарии по поводу этого топика: Послать отзыв!