Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство InfoCenter.SubAwareClientInfo
 Послать отзыв
 This is SubAwareClientInfo, a member of class InfoCenter.
 Синтаксис
C#
Visual Basic
public System.String SubAwareClientInfo;
Public Property SubAwareClientInfo() As System.String
 Ссылки
 InfoCenter Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!