Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.InplaceTextEditor.StackPropertyDialog
 Послать отзыв
 Метод вызывает диалоговое окно свойств дробного текста. В текущей версии не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public void StackPropertyDialog();
Копировать Код
Public Sub StackPropertyDialog()
 Описание
 Метод вызывает диалоговое окно свойств дробного текста. Оно позволяет настроить как верхний и нижний текст, так и опции форматирования дробного текста (стиль, выравнивание, высота текста). В текущей версии не реализован.
 Ссылки
 HostMgd.ApplicationServices.InplaceTextEditor, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!