Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство DocumentLockModeChangeVetoedEventArgs.Document
 Послать отзыв
 Синтаксис
C#
Visual Basic
public HostMgd::ApplicationServices::Document Document;
Public Property Document() As HostMgd.ApplicationServices.Document
 Описание
 Соответствует функции HostApDocManager::document() nanoCAD API.
 Ссылка на документ, принадлежащий входной базе данных.
 Условия
 Только на чтение
 Ссылки
 DocumentLockModeChangeVetoedEventArgs Класс, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!