Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.PromptedForDouble
 Послать отзыв
 Событие возникает после завершения интерактивного ввода вещественного числа пользователем в редакторе nanoCAD. Событие не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public event PromptDoubleResultEventHandler PromptedForDouble;
Копировать Код
Public Event PromptedForDouble As PromptDoubleResultEventHandler
 Описание
 Событие вызывается, когда пользователь завершает ввод значения типа double, например, через метод GetDouble(). Оно предоставляет доступ к результату операции — числовому значению, статусу (OK, Cancel, Error) и строковому представлению введённой величины. Это событие используется для обработки числового ввода, не привязанного к конкретным геометрическим параметрам (например, угол или расстояние), и позволяет разработчикам реагировать на ввод произвольных чисел при выполнении пользовательских команд.
 Событие реализуется через делегат PromptDoubleResultEventHandler, передающий объект PromptDoubleResultEventArgs, одержащий значение ввода и дополнительные данные о контексте.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события PromptedForDouble [Teigha.Runtime.CommandMethod("PromptedForDoubleExample")] public void PromptedForDoubleExample() { // Подписка на событие PromptedForDouble editor.PromptedForDouble += OnEditorPromptedForDouble; } // Реализация отработки события PromptedForDouble private void OnEditorPromptedForDouble(object sender, PromptDoubleResultEventArgs e) { // Вывод сообщения в командную строку if (e.Result.Status == PromptStatus.OK) { editor.WriteMessage($"\nВведено число: {e.Result.Value}"); } else { editor.WriteMessage("\nЧисло не введено."); } } }
 Порядок работы с событием:
Пользователь запускает ввод вещественного числа через команду, например GetString() с последующей конвертацией или GetDouble().
Ввод выполняется мышью, либо вручную через командную строку.
После завершения ввода генерируется событие PromptedForDouble.
Разработчик может получить доступ к числу и его статусу через аргументы события.
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!