Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.RolloverEventHandler(object,RolloverEventArgs)
 Послать отзыв
 Делегат предназначен для обработки события, возникающего при наведении курсора на графический объект в чертеже.
 Синтаксис
C#
Visual Basic
Копировать Код
public delegate void RolloverEventHandler(object sender, RolloverEventArgs e);
Копировать Код
Public Delegate Sub RolloverEventHandler(sender As Object, e As RolloverEventArgs)
 Параметры
 Параметры
 Описание
 sender
 Источник события — обычно экземпляр редактора (Editor), в котором происходит наведение курсора. Тип object
 e
 Объект, содержащий данные о текущем состоянии наведения:
 Описание
 Делегат используется как сигнатура метода-обработчика для события Rollover, которое генерируется в nanoCAD при перемещении курсора над геометрическим примитивом, поддерживающим подсветку. Он позволяет разработчику плагина или надстройки реагировать на положение курсора в реальном времени — например, отображать подсказки, анализировать свойства объекта, показывать контекстную информацию или изменять внешний вид интерфейса.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события Rollover [Teigha.Runtime.CommandMethod("RolloverExample")] public void RolloverExample() { // Подписка на событие Rollover editor.Rollover += OnEditorRollover; } // Реализация отработки события Rollover private void OnEditorRollover(object sender, RolloverEventArgs e) { ObjectId[] objId = e.Highlighted.GetObjectIds(); // Вывод информации о подсвеченных объектах editor.WriteMessage($"\nКурсор над {objId.Length} объектом(ами)"); for (int i = 0; i < objId.Length; i++) editor.WriteMessage($"\n{objId}"); } }
 Ваши комментарии по поводу этого топика: Послать отзыв!