Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Класс HostMgd.ApplicationServices.SystemVariableChangedEventArgs
 Послать отзыв
 Иерархия классов
HostMgd::ApplicationServices::SystemVariableChangedEventArgs
 Синтаксис
C#
Visual Basic
public class SystemVariableChangedEventArgs : System.EventArgs;
Public Class SystemVariableChangedEventArgs Inherits System.EventArgs
 Описание
 Содержит параметры, относящиеся к событиям изменения системной переменной.
 Топики
 Имя
 Описание
 SystemVariableChangedEventArgs Свойства
 Ниже перечислены свойства класса SystemVariableChangedEventArgs.
 Ссылки
 SystemVariableChangedEventArgs Свойства, Топики, SystemVariableChangedEventArgs Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!