Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.Document.CommandInProgress
 Послать отзыв
 Свойство предназначено для получения названия команды, которая выполняеся в данный момент.
 Синтаксис
C#
Visual Basic
public String CommandInProgress;
Public Property CommandInProgress() As String
 Возвращает
 Возвращает имя выполняемой команды. Тип String
 Описание
 Свойство предназначено для получения названия команды, которая выполняеся в данный момент. Например, пусть команда определена как cip, а ее локальное имя задано как deucip. Тогда, независимо от того, как команда была введена — , cip, _cip или deucip даннный метод всегда вернет cip.
 Замечания
 Строка всегда представляет английское имя команды, независимо от того, как оно было введено — как глобальное, локальное или на английском языке.
 Условия
 Только чтение
 Ссылки
 HostMgd.ApplicationServices.Document, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!