Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PointFilterResult.NewPoint
 Послать отзыв
 Синтаксис
C#
Visual Basic
public Teigha::Geometry::Point3d NewPoint;
Public Property NewPoint() As Teigha.Geometry.Point3d
 Описание
 Возвращает новую точку, если changedPoint равно true.
 Условия
 На чтение и запись
 Ссылки
 PointFilterResult Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!