Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор SelectedSubObject.SelectedSubObject
 Послать отзыв
 Синтаксис
C#
Visual Basic
public SelectedSubObject(ref Teigha::DatabaseServices::FullSubentityPath path, HostMgd::EditorInput::SelectionMethod method, int gsMarker);
Public Sub New(ByRef path As Teigha.DatabaseServices.FullSubentityPath, method As HostMgd.EditorInput.SelectionMethod, gsMarker As Integer)
 Параметры
 Параметры
 Описание
 path
 Путь к объекту
 method
 Метод выбора
 gsMarker
 GS маркер
 Описание
 Конструктор класса.
 Ссылки
 SelectedSubObject Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!