Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.Windows.ToolPalette.CustomToolBase.GetDisplayString
 Послать отзыв
 Метод предоставляет отображаемый текст, связанный со свойством пользовательского инструмента. Не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void GetDisplayString( int dispatchId, ref System.String value );
Копировать Код
Public Overridable Sub GetDisplayString( dispatchId As Integer, ByRef value As System.String )
 Параметры
 Параметры
 Описание
 dispatchId
 Диспетчерский идентификатор свойства. Тип int.
 value
 Строка, отображаемая для свойства. Тип System.String.
 Описание
 Метод предоставляет отображаемый текст, связанный со свойством пользовательского инструмента. Текстовая строка может быть, например, локализованной.
 В текущей версии не реализован.
 Ссылки
 HostMgd.Windows.ToolPalette.CustomToolBase, HostMgd.Windows.ToolPalette
 Ваши комментарии по поводу этого топика: Послать отзыв!