Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.InputPointContext.Document
 Послать отзыв
 Свойство предназначено для получения ссылки на документ, в котором произошло событие ввода точки.
 Синтаксис
C#
Visual Basic
Копировать Код
public Document Document;
Копировать Код
Public Property Document() As Document
 Возвращает
 Возвращает объект типа Document — ссылку на экземпляр документа nanoCAD, в котором выполняется операция ввода точки.
 Если событие возникло в активном чертеже — возвращается ссылка на этот документ. Если контекст повреждён или недоступен — может вернуть null.
 Описание
 Свойство предоставляет доступ к объекту HostMgd.ApplicationServices.Document, который является источником события, связанного с вводом точки — например, PointMonitor или PointFilter. Оно позволяет определить, в каком именно чертеже было инициировано событие, что особенно важно при работе с несколькими открытыми документами в одной сессии nanoCAD.
 Это свойство делает возможным использование единого обработчика событий для всех документов, так как разработчик может проверить, к какому документу относится текущее событие, и выполнить соответствующую логику. Например, можно избежать обработки ввода в фоновых или неактивных чертежах.
 Свойство устанавливается системой автоматически при генерации контекста ввода.
 Условия
 Только чтение
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class InputPointContextExamples { // Метод команды, которая получает ссылку на документ, в котором произошло событие ввода точки [Teigha.Runtime.CommandMethod("DocumentExample")] public void DocumentExample() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Метод для отработки события редактора PointMonitor editor.PointMonitor += (sender, e) => { // Сохраняем контекст события в преременную InputPointContext context = e.Context; // Выводим в комнадную строку данные о документе if (context != null) { Document doc = context.Document; if (doc == Application.DocumentManager.MdiActiveDocument) { // Обрабатываем ввод только в активном документе editor.WriteMessage($"\nВвод в документе: {doc.Name}"); } } }; } }
 Ссылки
 HostMgd.EditorInput.InputPointContext, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!