Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Класс HostMgd.EditorInput.KeywordCollection
 Послать отзыв
 Иерархия классов
HostMgd::EditorInput::KeywordCollection
 Синтаксис
C#
Visual Basic
[System.Reflection.DefaultMemberAttribute("Item")] public class KeywordCollection : System.Collections.ICollection, System.Collections.IEnumerable;
<System.Reflection.DefaultMemberAttribute("Item")> Public Class KeywordCollection Inherits System.Collections.ICollection Inherits System.Collections.IEnumerable
 Описание
 Класс представляет необязательные параметры приглашения при вводе ключевых слов.
 Методы
 Конструкторы
 Имя
 Описание
 KeywordCollection
 Топики
 Имя
 Описание
 KeywordCollection Методы
 Ниже перечислены методы класса KeywordCollection.
 KeywordCollection Свойства
 Ниже перечислены свойства класса KeywordCollection.
 Ссылки
 KeywordCollection Методы, KeywordCollection Свойства, Методы, Топики, KeywordCollection Методы, KeywordCollection Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!