Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.DraggingEndedEventArgs.Status
 Послать отзыв
 Свойство возвращает статус завершения операции перетаскивания, указывая на успешное выполнение, отмену или ошибку.
 Синтаксис
C#
Visual Basic
Копировать Код
public PromptStatus Status { get; }
Копировать Код
Public ReadOnly Property Status As PromptStatus
 Возвращает
 Возвращает значение типа PromptStatus, представляющее статус завершения операции перетаскивания. Возможные значения:
PromptStatus.OK — операция успешно завершена.
PromptStatus.Cancel — пользователь отменил операцию.
PromptStatus.Error — произошла ошибка во время операции.
 Другие специфичные статусы, в зависимости от реализации nanoCAD.
 Описание
 Свойство используется для получения информации о результате завершения операции перетаскивания. Оно возвращает значение из перечисления PromptStatus, которое может быть OK, Cancel, Error и другими — в зависимости от того, как была завершена операция. Это позволяет разработчику обрабатывать различные сценарии окончания перетаскивания и реагировать на них соответствующим образом, например, сохранять новое положение объекта при успешном завершении или отменять изменения, если операция была прервана.
 Условия
 Только чтение
 Пример
C#
 Копировать Код
public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события Dragging [Teigha.Runtime.CommandMethod("DraggingEndedExample_StatusProp")] public void DraggingEndedExample_StatusProp() { // Подписка на событие редактора DraggingEnded editor.DraggingEnded += OnEditorDraggingEnded; } // Реализация отработки события DraggingEnded private void OnEditorDraggingEnded(object sender, DraggingEndedEventArgs e) { // Получаем доступ к статусу операции PromptStatus result = e.Status; // Выводим сообщение в комнадную строку в зависимости от значения статуса if (result == PromptStatus.OK) { editor.WriteMessage( "\nПеретаскивание завершено успешно."); } else { editor.WriteMessage( $"\nОперация перетаскивания завершена со статусом: {result}"); } } }
 Ссылки
 HostMgd.EditorInput.DraggingEndedEventArgs, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!