Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.PlotInfoValidator.SheetMediaGroupWeight
 Послать отзыв
 Свойство SheetMediaGroupWeight представляет весовой коэффициент для группы носителей.
 Синтаксис
C#
Visual Basic
Копировать Код
public int SheetMediaGroupWeight;
Копировать Код
Public Property SheetMediaGroupWeight As Integer
 Возвращает
 Возвращает весовой коэффициент для группы носителей. Тип int.
 Описание
 Свойство SheetMediaGroupWeight представляет весовой коэффициент для группы носителей в конфигурации печати, связанной с объектом PlotInfo.
 Замечания
 См. описание свойства MediaMatchingThreshold
 Условия
 Чтение и запись.
 Ссылки
 HostMgd.PlottingServices.PlotInfoValidator, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!