Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.GetCorner(PromptCornerOptions)
 Послать отзыв
 Метод позволяет пользователю указать точку — второй угол прямоугольника, используя графический ввод или клавиатуру, с возможностью настройки через параметры приглашения.
 Синтаксис
C#
Visual Basic
Копировать Код
public PromptPointResult GetCorner(PromptCornerOptions options);
Копировать Код
Public Function GetCorner(options As PromptCornerOptions) As PromptPointResult
 Параметры
 Параметры
 Описание
 options
 Объект, содержащий параметры ввода угла прямоугольника:
 Возвращает
 Возвращает объект типа PromptPointResult, который содержит:
Status — статус операции (OK, Cancel, Error и др.).
Value — значение точки (Point3d), если ввод был успешным.
InputString — строковое представление введённых данных (если использовался ручной ввод).
 Описание
 Метод используется для интерактивного ввода пользователем второй угловой точки прямоугольника относительно заданной начальной точки. Позволяет ограничивать координаты по осям X и Y (как в команде RECTANG), обеспечивая прямоугольное выравнивание. Метод поддерживает как мышиный ввод, так и ввод координат вручную. Настройка поведения осуществляется через объект PromptCornerOptions.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("GetCornerExample")] public void GetCornerExample() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создаём запрос пользователю PromptCornerOptions options = new PromptCornerOptions("\nУкажите противоположный угол:", new Point3d(0, 0, 0)); PromptPointResult result = editor.GetCorner(options); // Если пользователь указал все данные, выводим сообщение в командой строке if (result.Status == PromptStatus.OK) { Point3d corner = result.Value; editor.WriteMessage( $"\nУказанная точка: {corner}"); } } }
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!