Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство WhoHasInfo.OpenTime
 Послать отзыв
 Синтаксис
C#
Visual Basic
public System.String OpenTime;
Public Property OpenTime() As System.String
 Описание
 Возвращает строку, содержащую детальное время и дату, когда файл чертежа был открыт в случае, если файл был открыт на редактирование.
 Условия
 Только на чтение
 Ссылки
 WhoHasInfo Структура, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!