Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Camera.BackClipEnabled
 Послать отзыв
 Свойство BackClipEnabled позволяет проверить, включен ли режим заднего отсечения. Не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool BackClipEnabled;
Копировать Код
Public ReadOnly Property BackClipEnabled As Boolean
 Возвращает
 Возвращает true, если режим заднего отсечения включен. В противном случае возвращает false.
 Описание
 Свойство BackClipEnabled позволяет проверить, включен ли режим заднего отсечения. В текущей версии не реализовано.
 Условия
 Только чтение.
 Ссылки
 HostMgd.EditorInput.Camera, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!