Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.DsdData.SheetType
 Послать отзыв
 Свойство SheetType представляет значение типа листа, хранящееся в DSD-файле. Не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public HostMgd.PlottingServices.SheetType SheetType;
Копировать Код
Public Property SheetType As HostMgd.PlottingServices.SheetType
 Возвращает
 Возвращает значение типа листа. Тип HostMgd.PlottingServices.SheetType.
 Описание
 Свойство SheetType представляет значение типа листа, который используется для публикации (многолистовой DWF, обычный DWF, многолистовой PDF и т.п.). Это поле хранится в файле DSD. Значение перечисления SheetType применимо только на уровне данных, а не на уровне записи отдельного листа.
 В текущей версии не реализовано.
 Условия
 Чтение и запись.
 Ссылки
 HostMgd.PlottingServices.DsdData, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!