Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.CrossingOrWindowSelectedObject.CrossingOrWindowSelectedObject(ObjectId,SelectionMethod,int)
 Послать отзыв
 Конструктор инициализирует новый экземпляр класса с указанием объекта, метода выбора и графического маркера.
 Синтаксис
C#
Visual Basic
Копировать Код
public CrossingOrWindowSelectedObject(ObjectId id, SelectionMethod method, int gsMarker);
Копировать Код
Public Sub New(id As ObjectId, method As SelectionMethod, gsMarker As Integer)
 Параметры
 Параметры
 Описание
 id
 Идентификатор объекта в базе данных чертежа. Тип ObjectId
 method
 Метод, использованный для выбора объекта.
Возможные значения:
 gsMarker
 Графический маркер (Graphics System Marker) — целочисленный идентификатор, используемый системой отрисовки nanoCAD для привязки к объекту при операциях выбора. Может быть использован для последующей идентификации объекта в процессе визуального поиска или фильтрации. Тип int
 Описание
 Конструктор создаёт объект типа CrossingOrWindowSelectedObject, который представляет собой выбранный геометрический элемент, включённый в выборку через окно или полигон. Он используется при программной или интерактивной обработке выборки, когда необходимо сохранить информацию о том, как именно был выбран объект — например, с помощью окна включения или режима пересечения.
 Этот конструктор позволяет задать:
идентификатор выбранного объекта,
метод выбора (окно, пересечение и др.),
графический маркер (gsMarker), используемый системой визуализации для отслеживания объекта.
 Он применяется в сложных сценариях выборки, особенно при реализации пользовательских фильтров, команд анализа или инструментов редактирования, где важно различать способ выделения.
 Замечания
 Конструктор позволяет точно контролировать контекст выбора, что особенно важно при работе с составными или плотно расположенными объектами. Использование gsMarker даёт дополнительную гибкость при реализации продвинутых механизмов выборки и фильтрации в надстройках nanoCAD.
 Ссылки
 HostMgd.EditorInput.CrossingOrWindowSelectedObject, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!