Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Класс HostMgd.PlottingServices.PlotLogger
 Послать отзыв
 Обычно экземпляр класса получается посредством статического свойства PlotLogger класса HostAppServices.
 Иерархия классов
Teigha::Runtime::DisposableWrapper HostMgd::PlottingServices::PlotLogger
 Синтаксис
C#
Visual Basic
public class PlotLogger : Teigha::Runtime::DisposableWrapper;
Public Class PlotLogger Inherits Teigha.Runtime.DisposableWrapper
 Описание
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Класс HostMgd.PlottingServices.PlotLogger
 Имя
 Описание
 PlotLogger Методы
 Ниже перечислены методы класса PlotLogger.
 PlotLogger Свойства
 Ниже перечислены свойства класса PlotLogger.
 Ссылки
 PlotLogger Методы, PlotLogger Свойства, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!