Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptNestedEntityResult
 Послать отзыв
 Класс содержит результат выбора вложенного геометрического объекта (внутри блока или внешней ссылки), включая его идентификатор, точку выбора и матрицу преобразования.
 Иерархия классов
HostMgd::EditorInput::PromptResult HostMgd::EditorInput::PromptEntityResult HostMgd::EditorInput::PromptNestedEntityResult
 Синтаксис
C#
Visual Basic
Копировать Код
public class PromptNestedEntityResult : PromptEntityResult
Копировать Код
Public Class PromptNestedEntityResult Inherits PromptEntityResult
 Описание
 Класс наследуется от PromptEntityResult и расширяет его функционал возможностью получения данных о вложенном объекте — элементе, находящемся внутри блока или внешней ссылки. Он используется при вызове метода GetNestedEntity() и предоставляет информацию:
ObjectId — идентификатор выбранного вложенного объекта.
PickedPoint — координаты точки выбора в мировой системе координат (WCS).
Transform — матрица преобразования, применённая к объекту внутри родительской структуры.
Status — статус выполнения операции (OK, Cancel, Error и др.).
 Этот класс играет ключевую роль при работе с вложенными объектами, позволяя разработчикам плагинов получать полную информацию о выбранном элементе и его положении внутри составной сущности чертежа.
 Топики
 Имя
 Описание
 PromptResult Методы
 Ниже перечислены методы класса PromptResult.
 PromptResult Свойства
 Ниже перечислены свойства класса PromptResult.
 HostMgd.EditorInput.PromptEntityResult
 Имя
 Описание
 PromptEntityResult Методы
 Ниже перечислены методы класса PromptEntityResult.
 PromptEntityResult Свойства
 Ниже перечислены свойства класса PromptEntityResult.
 HostMgd.EditorInput.PromptNestedEntityResult
 Имя
 Описание
 PromptNestedEntityResult Методы
 Ниже перечислены методы класса PromptNestedEntityResult.
 PromptNestedEntityResult Свойства
 Ниже перечислены свойства класса PromptNestedEntityResult.
 Ссылки
 PromptNestedEntityResult Методы, PromptNestedEntityResult Свойства, Топики, PromptResult Методы, PromptResult Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!