Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.PlotConfigInfoCollection.CopyTo
 Послать отзыв
 Метод предназначен для копирования элементов данной коллекции в указанный массив базового типа Array с указанием стартовой позиции в массиве.
 Синтаксис
C#
Visual Basic
Копировать Код
public void CopyTo( ref Array a, int index );
Копировать Код
Public Sub CopyTo( ByRef a As Array, index As Integer )
 Параметры
 Параметры
 Описание
 a
 Целевой массив. Тип Array.
 index
 Индекс позиции в массиве, начиная с которой в массив копируются элементы коллекции. Тип int. Нумерация индексов начинается с нуля.
 Описание
 Метод предназначен для копирования элементов данной коллекции в массив типа Array, начиная с позиции index в массиве.
 Ссылки
 HostMgd.PlottingServices.PlotConfigInfoCollection, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!