Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptPointOptions.UseBasePoint
 Послать отзыв
 Свойство определяет, будет ли использоваться базовая точка при интерактивном вводе новой точки в nanoCAD.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool UseBasePoint { get; set; }
Копировать Код
Public Property UseBasePoint As Boolean
 Возвращает
 Возвращает значение типа bool:
true — базовая точка используется при вводе новой точки.
false — базовая точка не учитывается.
 Описание
 Свойство используется для указания, следует ли учитывать базовую точку (BasePoint) при вводе новой точки. Если свойство установлено в true, вводимая пользователем точка отсчитывается относительно базовой, и может отображаться штриховая линия между ними, если включено UseDashedLine. Если false — пользователь вводит точку независимо от базовой.
 Это свойство особенно полезно при построении направлений, привязке к предыдущей точке или при работе с геометрическими построениями, где требуется визуальная или числовая привязка к начальной позиции.
 Замечания
 Свойство UseBasePoint часто применяется вместе с BasePoint и UseDashedLine, чтобы обеспечить визуальную привязку и улучшить точность ввода точки в интерактивных командах nanoCAD.
 Условия
 Чтение и запись
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; [Teigha.Runtime.CommandMethod("PromptPointOptionsExample_UseBasePoint")] public void PromptPointOptionsExample_UseBasePoint() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создаём запрос пользователю PromptPointOptions options = new PromptPointOptions("\nУкажите точку:"); // Установка базовой точки options.BasePoint = new Point3d(100, 100, 0); // Включаем использование базовой точки options.UseBasePoint = true; // Вызов метода GetPoint() для запроса пользователю PromptPointResult result = editor.GetPoint(options); // Если все данные введены, выводим результат в командную строку if (result.Status == PromptStatus.OK) { Point3d pt = result.Value; editor.WriteMessage( $"\nВыбранная точка: {pt}"); } else { editor.WriteMessage( "\nВвод точки отменен или произошла ошибка."); } }
 Ссылки
 HostMgd.EditorInput.PromptPointOptions, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!