Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Событие PaletteSet.Save
 Послать отзыв
 This is Save, a member of class PaletteSet.
 Синтаксис
C#
Visual Basic
public event PalettePersistEventHandler Save;
Public Event Save As PalettePersistEventHandler
 Ссылки
 PaletteSet Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!