Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.PlotPageInfo.GradientCount
 Послать отзыв
 Свойство GradientCount предоставляет оценку количества градиентных объектов на странице.
 Синтаксис
C#
Visual Basic
Копировать Код
public int GradientCount;
Копировать Код
Public ReadOnly Property GradientCount As Integer
 Возвращает
 Возвращает количество градиентов. Тип int.
 Описание
 Свойство GradientCount позволяет получить оценку количества градиентных объектов на печатаемой странице.
 Условия
 Только чтение.
 Ссылки
 HostMgd.PlottingServices.PlotPageInfo, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!