Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод PublishEntityEventArgs.Add3DDwfProperty
 Послать отзыв
 This is Add3DDwfProperty, a member of class PublishEntityEventArgs.
 Синтаксис
C#
Visual Basic
public bool Add3DDwfProperty(ref System.String category, ref System.String name, ref System.String value);
Public Function Add3DDwfProperty(ByRef category As System.String, ByRef name As System.String, ByRef value As System.String) As bool
 Ссылки
 PublishEntityEventArgs Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!