Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptEntityOptions.SetRejectMessage(string)
 Послать отзыв
 Метод устанавливает пользовательское сообщение, которое отображается, если выбранный объект не соответствует критериям фильтрации.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetRejectMessage(string message);
Копировать Код
Public Sub SetRejectMessage(message As String)
 Параметры
 Параметры
 Описание
 message
 Текст сообщения, которое будет отображаться при попытке выбрать недопустимый объект. Может содержать инструкции или пояснения. Тип string
 Описание
 Метод используется для задания текста, который будет показан пользователю при попытке выбрать объект, запрещённый текущими настройками фильтрации — например, если объект не входит в список разрешённых типов, заданных через AddAllowedClass или другие методы фильтрации.
 По умолчанию система может выводить стандартное сообщение вроде "Недопустимый объект", но с помощью SetRejectMessage можно заменить его на более информативное и понятное, например: "Можно выбирать только линии и полилинии."
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("PromptEntityOptions_SetRejectMessage")] public void PromptEntityOptions_SetRejectMessage() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создаём запрос пользователю PromptEntityOptions options = new PromptEntityOptions("\nВыберите объект:"); // Разрешить выбор только объектов типа Line (не полилинии и др.) options.AddAllowedClass(typeof(Line), true); // Устанавливаем пользовательское сообщение об ошибке options.SetRejectMessage("Выбранный объект не является отрезком. Необходимо выбрать другой."); PromptEntityResult result = editor.GetEntity(options); // Если все данные введены, выводим результат в командную строку if (result.Status == PromptStatus.OK) { editor.WriteMessage( $"\nВыбран объект с ID: {result.ObjectId}, точка: {result.PickedPoint}"); } else { editor.WriteMessage( "\nОперация выбора отменена или объект не найден."); } } }
 Ссылки
 HostMgd.EditorInput.PromptEntityOptions, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!