Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Publisher.FireCancelledOrFailedPublishing
 Послать отзыв
 This is FireCancelledOrFailedPublishing, a member of class Publisher.
 Синтаксис
C#
Visual Basic
public void FireCancelledOrFailedPublishing(ref HostMgd::Publishing::PublishEventArgs e);
Public Sub FireCancelledOrFailedPublishing(ByRef e As HostMgd.Publishing.PublishEventArgs)
 Ссылки
 Publisher Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!