Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptDoubleOptionsEventArgs
 Послать отзыв
 Класс предоставляет данные для события PromptingForDouble, позволяя настроить параметры ввода вещественного числа перед началом операции.
 Иерархия классов
HostMgd::EditorInput::PromptDoubleOptionsEventArgs
 Синтаксис
C#
Visual Basic
Копировать Код
public sealed class PromptDoubleOptionsEventArgs : EventArgs
Копировать Код
Public NotInheritable Class PromptDoubleOptionsEventArgs Inherits EventArgs
 Описание
 Класс используется в .NET API nanoCAD для передачи параметров при начале интерактивного ввода вещественного числа — например, при вызове метода GetDouble(). Он применяется в обработчике события PromptingForDouble и предоставляет доступ к объекту PromptDoubleOptions, содержащему настройки команды ввода.
 Через этот класс можно:
изменить текст приглашения (Message),
задать значение по умолчанию (DefaultValue),
управлять режимами ввода (AllowNone, AllowNegative, AllowZero и др.).
 Класс позволяет динамически настраивать поведение команды в зависимости от контекста, что особенно полезно при реализации гибких интерактивных команд — таких как масштабирование, параметризация или математические операции.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события PromptingForDouble [Teigha.Runtime.CommandMethod("PromptingForDoubleExample")] public void PromptingForDoubleExample() { // Подписка на событие PromptingForDouble editor.PromptingForDouble += OnEditorPromptingForDouble; } // Реализация отработки события PromptingForDouble private void OnEditorPromptingForDouble(object sender, PromptDoubleOptionsEventArgs e) { // Установка начального значения e.Options.DefaultValue = 5.75; // Изменение сообщения приглашения e.Options.Message = "Введите коэффициент масштабирования:"; } }
 Топики
 Имя
 Описание
 PromptDoubleOptionsEventArgs Свойства
 Ниже перечислены свойства класса PromptDoubleOptionsEventArgs.
 Ссылки
 PromptDoubleOptionsEventArgs Свойства, Топики, PromptDoubleOptionsEventArgs Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!