Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.GraphicsInterface.Drawable.SubSetAttributes
 Послать отзыв
 Метод устанавливает значения графических атрибутов подобъектов этого объекта и возвращает их вместе с графическими атрибутами подобъектов вызывающего объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public int SubSetAttributes( ref GraphicsInterface.DrawableTraits traits );
Копировать Код
Public Function SubSetAttributes( ByRef traits As GraphicsInterface.DrawableTraits ) As Integer
 Параметры
 Параметры
 Описание
 traits
 Входной объект GraphicsInterface.DrawableTraits, который необходимо задать. Атрибуты заполняются значениями атрибутов подобъектов вызывающих объектов.
 Возвращает
 Возвращает комбинацию атрибутных флагов из перечисления Teigha.GraphicsInterface.AttributesFlags. Тип int.
 Описание
 Метод принимает входной объект DrawableTraits, устанавливает значения графических атрибутов подобъектов этого объекта. и возвращает их вместе с атрибутами подобъектов вызывающего объекта.
 Замечания
 В случае переопределения метода SubSetAttributes() вы должны вызвать базовый класс и объединить OR (|) возвращаемое им значение с любыми дополнительными флагами, которые вы добавляете. Флаги не могут быть удалены производным классом ни по какой причине, поскольку это приведет к неопределенным результатам. Реализация по умолчанию просто возвращает значение DrawableIsAnEntity (значение 1), ее можно переопределить в пользовательских классах.
 Ссылки
 HostMgd.EditorInput.Transient, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!