Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.LispWillStartEventHandler(Object, LispWillStartEventArgs)
 Послать отзыв
 Делегат предназначен для обработки события LispWillStart класса Document, возникающего перед началом исполнения кода интерпретатором AutoLISP.
 Синтаксис
C#
Visual Basic
Копировать Код
public delegate void LispWillStartEventHandler( Object sender, LispWillStartEventArgs e );
Копировать Код
Public Delegate Sub LispWillStartEventHandler( sender As Object, e As LispWillStartEventArgs )
 Параметры
 Параметры
 Описание
 sender
 Объект, инициировавший событие. Как правило это Document. Тип Object.
 e
 Аргументы события. Тип LispWillStartEventArgs.
 Описание
 Делегат LispWillStartEventHandler предназначен для обработки события LispWillStart класса Document, возникающего перед началом исполнения кода интерпретатором AutoLISP.
 Контекст события передается через параметры sender и e, где sender определяет объект Document, а e передает первую строку Lisp-процедуры, которую надлежит выполнить.
 Ваши комментарии по поводу этого топика: Послать отзыв!