Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор TabbedDialogExtension.TabbedDialogExtension (System::Object^, TabbedDialogAction^, TabbedDialogAction^, TabbedDialogAction^, TabbedDialogAction^)
 Послать отзыв
 This is TabbedDialogExtension, a member of class TabbedDialogExtension.
 Синтаксис
C#
Visual Basic
public TabbedDialogExtension(ref System.Object control, ref TabbedDialogAction onOK, ref TabbedDialogAction onCancel, ref TabbedDialogAction onHelp, ref TabbedDialogAction onApply);
Public Sub New(ByRef control As System.Object, ByRef onOK As TabbedDialogAction, ByRef onCancel As TabbedDialogAction, ByRef onHelp As TabbedDialogAction, ByRef onApply As TabbedDialogAction)
 Ссылки
 TabbedDialogExtension Класс, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!