Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Событие PaletteSet.PressCloseButton
 Послать отзыв
 Событие генерируется по нажатию на кнопку закрытия панели
 Синтаксис
C#
Visual Basic
public event HostMgd::Windows::PressCloseButtonEventHandler PressCloseButton;
Public Event PressCloseButton As HostMgd.Windows.PressCloseButtonEventHandler
 Ссылки
 PaletteSet Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!