Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.DocumentCollection.CurrentDocument
 Послать отзыв
 Свойство предназначено для получения активного dwg-документа или переключения между открытыми dwg-документами.
 Синтаксис
C#
Visual Basic
public Document CurrentDocument;
Public Property CurrentDocument() As Document
 Возвращает
 Возвращает активный dwg-документ. Тип Document
 Описание
 Свойство предназначено для получения активного dwg-документа или переключения между открытыми dwg-документами.
 Условия
 Чтение и запись
 Ссылки
 HostMgd.ApplicationServices.DocumentCollection, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!