Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.DocumentCollection.GetEnumerator()
 Послать отзыв
 Метод GetEnumerator() позволяет получить перечислитель для этой коллекции.
 Синтаксис
C#
Visual Basic
Копировать Код
public System.Collections.IEnumerator GetEnumerator();
Копировать Код
Public Function GetEnumerator() As System.Collections.IEnumerator
 Возвращает
 Возвращает перечислитель. Тип System.Collections.IEnumerator.
 Описание
 Метод GetEnumerator() позволяет получить перечислитель для этой коллекции.
 Ссылки
 HostMgd.ApplicationServices.DocumentCollection, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!