Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.InputPointContext.ObjectSnapOverrides
 Послать отзыв
 Свойство предназначено для получения текущего режима объектной привязки, активированного пользователем вручную (например, через клавишу Shift + ПКМ), независимо от того, участвует ли он в вычислении точки.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectSnapMasks ObjectSnapOverrides;
Копировать Код
Public Property ObjectSnapOverrides() As ObjectSnapMasks
 Возвращает
 Возвращает значение типа ObjectSnapMasks — побитовую маску, указывающую на текущий активный режим переопределения объектной привязки. Пример проверки:
C#
 Копировать Код
if ((context.ObjectSnapOverrides & ObjectSnapMasks.Center) != 0) { // Пользователь выбрал привязку "Центр" }
 Описание
 Свойство возвращает значение типа ObjectSnapMasks, представляющее собой активный временный режим объектной привязки, установленный с помощью переопределения (override) — например, при вызове контекстного меню привязок или использовании горячих клавиш. В отличие от свойства ObjectSnapMask, это свойство возвращает тип привязки даже в тех случаях, когда она ещё не была применена к вычисляемой точке (ComputedPoint) или процесс привязки находится в стадии анализа.
 Это позволяет разработчику:
определить, какую именно привязку пытается использовать пользователь,
предоставить соответствующую визуальную подсказку,
адаптировать поведение команды до завершения ввода,
реализовать "умные" направляющие или динамические подсказки, соответствующие выбранному OSNAP.
 Свойство особенно полезно при создании интерактивных инструментов (Jig, PointMonitor), где важно реагировать на намерения пользователя ещё до фактической привязки.
 Свойство обновляется системой в реальном времени при изменении режима привязки.
 Условия
 Только чтение
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class InputPointContextExamples { // Метод команды, которая получает текущий режим объектной привязки, // активированного пользователем вручную (например, через клавишу Shift + ПКМ), // независимо от того, участвует ли он в вычислении точки. [Teigha.Runtime.CommandMethod("ObjectSnapOverridesExample")] public void ObjectSnapOverridesExample() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Метод для отработки события редактора PointMonitor editor.PointMonitor += (sender, e) => { // Сохраняем контекст события в преременную InputPointContext context = e.Context; // Выводим в комнадную строку полученные данные if (context != null) { ObjectSnapMasks overrideOsnap = context.ObjectSnapOverrides; if (overrideOsnap != ObjectSnapMasks.NoneOverride) { editor.WriteMessage($"\nАктивна привязка (override): {overrideOsnap}"); } } }; } }
 Ссылки
 HostMgd.EditorInput.InputPointContext, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!