Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.AppPlotStatus
 Послать отзыв
 Данное перечисление определяет состояния задания на печать, условия или результаты выполнения задания на печать.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum AppPlotStatus { DwfFilePlotted = -3, NoPlotYet = -1, PlotHadErrors = 3, PlotHadSystemError = 4, PlotStart = 0, PlotSuccessful = 2, PlottingMessage = -2, ViewPlotLog = 1 }
Копировать Код
Public Enum AppPlotStatus DwfFilePlotted = -3 NoPlotYet = -1 PlotHadErrors = 3 PlotHadSystemError = 4 PlotStart = 0 PlotSuccessful = 2 PlottingMessage = -2 ViewPlotLog = 1 End Enum
 Члены
 Члены
 Описание
 DwfFilePlotted
 Значение: -3. Статус означает, что печать DWF-файла была завершена успешно.
 NoPlotYet
 Значение: -1. Статус означает, что в текущем сеансе nanoCAD пока не предпринимались попытки печати. Является значением по умолчанию при старте платформы и предназначено исключительно для внутреннего использования.
 PlotHadErrors
 Значение: 3. Статус означает, что при выполнении задания печати были обнаружены ошибки.
 PlotHadSystemError
 Значение: 4. Статус означает, что выполнение задания на печать было прервано из-за системной ошибки.
 PlotStart
 Значение: 0. Статус означает, что выполнение задания на печать стартовало.
 PlotSuccessful
 Значение: 2. Статус означает, что задание на печать завершено успешно.
 PlottingMessage
 Значение: -2. Статус означает, что имеется сообщение о задании на печать.
 ViewPlotLog
 Значение: 1. Статус означает, что необходимо вызвать средство просмотра журнала печати.
 Описание
 Перечисление AppPlotStatus определяет состояния задания на печать, условия или результаты выполнения задания на печать.
 Ваши комментарии по поводу этого топика: Послать отзыв!