Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Camera.ViewTwist
 Послать отзыв
 Свойство ViewTwist предоставляет доступ к углу поворота камеры. Не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public double ViewTwist;
Копировать Код
Public ReadOnly Property ViewTwist As Double
 Возвращает
 Возвращает угол поворота камеры. Тип double.
 Описание
 Свойство ViewTwist предоставляет доступ к величине угла поворота (в радианах) камеры. В текущей версии не реализовано.
 Условия
 Только чтение.
 Ссылки
 HostMgd.EditorInput.Camera, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!