Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptDistanceOptionsEventHandler(object,PromptDistanceOptionsEventArgs)
 Послать отзыв
 Делегат предназначен для обработки события, возникающего перед началом операции ввода расстояния, и позволяет изменить параметры команды ввода.
 Синтаксис
C#
Visual Basic
Копировать Код
public delegate void PromptDistanceOptionsEventHandler(object sender, PromptDistanceOptionsEventArgs e);
Копировать Код
Public Delegate Sub PromptDistanceOptionsEventHandler(sender As Object, e As PromptDistanceOptionsEventArgs)
 Параметры
 Параметры
 Описание
 sender
 Источник события, обычно представляет экземпляр редактора (Editor), в котором происходит ввод расстояния. Тип object
 e
 Объект, содержащий параметры ввода расстояния:
 Описание
 Делегат используется как сигнатура метода-обработчика для события PromptingForDistance, которое инициируется перед началом интерактивного ввода расстояния — например, при вызове метода GetDistance() или GetAngle() с параметром расстояния. Он предоставляет доступ к параметрам ввода через объект PromptDistanceOptionsEventArgs, что позволяет программно изменять:
сообщение приглашения (Message),
начальное значение (DefaultValue),
режимы ввода (AllowNone, AllowNegative и др.).
 Этот делегат особенно полезен при разработке надстроек, где требуется динамически изменять поведение команды ввода расстояния в зависимости от контекста.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события PromptingForDistance [Teigha.Runtime.CommandMethod("PromptingForDistanceExample")] public void PromptingForDistanceExample() { // Подписка на событие PromptingForDistance editor.PromptingForDistance += OnEditorPromptingForDistance; } // Реализация отработки события PromptingForDistance private void OnEditorPromptingForDistance(object sender, PromptDistanceOptionsEventArgs e) { // Сохраняем параметры запроса в переменную PromptDistanceOptions eOptions = e.Options; // Установка начального значения расстояния eOptions.DefaultValue = 100.0; // Задание сообщения приглашения eOptions.Message = "Введите расстояние для смещения:"; } }
 Ваши комментарии по поводу этого топика: Послать отзыв!