Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство SelectedObject.SelectionMethod
 Послать отзыв
 Синтаксис
C#
Visual Basic
public HostMgd::EditorInput::SelectionMethod SelectionMethod;
Public Property SelectionMethod() As HostMgd.EditorInput.SelectionMethod
 Описание
 Возвращает величину, описывающую метод выделения объекта.
 Условия
 Только для чтения
 Ссылки
 SelectedObject Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!