Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 JigPrompts.AcquireAngle(String,String)
 Послать отзыв
 Метод запрашивает у пользователя угол в °(градусах), используя при запросе приглашающее сообщение с ключевыми словами.
 Синтаксис
C#
Visual Basic
public HostMgd.EditorInput.PromptDoubleResult AcquireAngle(ref System.String messageAndKeywords, ref System.String globalKeywords);
Public Function AcquireAngle(ByRef messageAndKeywords As System.String, ByRef globalKeywords As System.String) As HostMgd.EditorInput.PromptDoubleResult
 Параметры
 Параметры
 Описание
 messageAndKeywords
 Cтрока, содержащая в себе сообщение запроса и ключевые слова к нему, которые будут выводиться на экране при запросе угла. Набор отображаемых ключевых слов строки messageAndKeywords должен быть заключен в скобки: "[" в начале и "]" в конце. Сами ключевые слова должны быть отделены между собой символом "/". Каждое отображаемое в строке messageAndKeywords ключевое слово должно также быть представлено на той же позиции в строке globalKeywords.
 globalKeywords
 Строка,содержащая в себе глобальные ключевые слова. Количество глобальных ключевых слов должно совпадать с количеством ключевых слов в приглашающем сообщении messageAndKeywords. Ключевые слова в строке globalKeywords должны отделяться друг от друга одним пробелом.
 Возвращает
 Возвращает результат типа double, который является углом, выраженным в радианах. Значение угла может быть получено исходя из текущего положения курсора мыши, либо посредством ввода с клавиатуры. При вводе с клавиатуры необходимо указывать угол в °(градусах).
 Описание
 Метод предназначен для запроса у пользователя угла в °(градусах). В основном применяется для интерактивного поворота объекта или группы объектов. После вызова создает экземпляр класса JigPromptAngleOptions, присваивает его свойству Message значение параметра messageAndKeywords, выделяет из этого параметра ключевые слова, записывает их в свойство Keywords как KeywordCollection вместе с глобальными ключевыми словами из параметра globalKeywords. Первому ключевому слову в сообщении будет соответствовать первое глобальное ключевое слово и т. д. Далее метод вызывает свою перегрузку JigPrompts.AcquireAngle(JigPromptAngleOptions options), передавая в нее созданный экземпляр класса JigPromptAngleOptions.
 Если список ключевых слов ошибочный или пустой, либо количество глобальных ключевых слов не совпадает с количеством отображаемых ключевых слов, то возникает событие System.ArgumentException.
 Пример
 В примере приведен отрывок кода из реализации метода Sampler() класса Jig.
C#
 Копировать Код
PromptDoubleResult result = prompts.AcquireAngle("Угол поворота или Повернуть на [ПОЛНЫЙ360/ПОЛОБОРОТА180/ЧЕТВЕРТЬОБОРОТА90]:", "FullTurn HalfTurn QuarterTurn");
Visual Basic
 Копировать Код
Dim result As PromptDoubleResult = prompts.AcquireAngle("Угол поворота или Повернуть на [ПОЛНЫЙ360/ПОЛОБОРОТА180/ЧЕТВЕРТЬОБОРОТА90]:", "FullTurn HalfTurn QuarterTurn")
 Ссылки
 JigPrompts Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!