Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Jig.OnDimensionValueChanged
 Послать отзыв
 Обработчик события перемещения курсора мыши
 Синтаксис
C#
Visual Basic
public OnDimensionValueChanged(ref Teigha.DatabaseServices.DynamicDimensionChangedEventArgs e);
Public Sub OnDimensionValueChanged(ByRef e As Teigha.DatabaseServices.DynamicDimensionChangedEventArgs)
 Параметры
 Параметры
 Описание
 e
 Аргумент события перемещения курсора мыши
 Описание
 Переопределяемый метод. Вызывается на каждое перемещение мыши для обработки этого события.
 Ссылки
 Jig Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!