Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Класс HostMgd.EditorInput.FenceSelectedObject
 Послать отзыв
 Иерархия классов
HostMgd::EditorInput::SelectedObject HostMgd::EditorInput::FenceSelectedObject
 Синтаксис
C#
Visual Basic
public class FenceSelectedObject : SelectedObject;
Public Class FenceSelectedObject Inherits SelectedObject
 Описание
 Класс, описывающий объект, выбранный с помощью линии выбора (выбранными будут те объекты, которые эта линия пересекает).
 В настоящее время нигде не используется.
 Методы
 Конструкторы
 Класс HostMgd.EditorInput.FenceSelectedObject
 Имя
 Описание
 FenceSelectedObject
 Топики
 Имя
 Описание
 SelectedObject Методы
 Ниже перечислены методы класса SelectedObject.
 SelectedObject Свойства
 Ниже перечислены свойства класса SelectedObject.
 Класс HostMgd.EditorInput.FenceSelectedObject
 Имя
 Описание
 FenceSelectedObject Методы
 Ниже перечислены методы класса FenceSelectedObject.
 Ссылки
 FenceSelectedObject Методы, Методы, Топики, SelectedObject Методы, SelectedObject Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!