Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.Document.LockDocument()
 Послать отзыв
 Метод предназначен для блокировки dwg-документа в режиме DocumentLockMode.Write.
 Синтаксис
C#
Visual Basic
public DocumentLock LockDocument();
Public Function LockDocument() As DocumentLock
 Возвращает
 Возвращает заблокированный документ. Тип DocumentLock
 Описание
 Метод блокирует dwg-документ от записи, просмотр при таком режиме доступен.
 Ссылки
 HostMgd.ApplicationServices.Document, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!