Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор PickPointSelectedSubObject.PickPointSelectedSubObject
 Послать отзыв
 Синтаксис
C#
Visual Basic
public PickPointSelectedSubObject(ref Teigha::DatabaseServices::FullSubentityPath path, HostMgd::EditorInput::SelectionMethod method, int gsMarker, ref HostMgd::EditorInput::PickPointDescriptor descriptor);
Public Sub New(ByRef path As Teigha.DatabaseServices.FullSubentityPath, method As HostMgd.EditorInput.SelectionMethod, gsMarker As Integer, ByRef descriptor As HostMgd.EditorInput.PickPointDescriptor)
 Параметры
 Параметры
 Описание
 path
 Полный путь к геометрическому подобъекту
 method
 Метод выбора
 gsMarker
 GS маркеры
 descriptor
 Описание точки выбора
 Описание
 Конструктор.
 Ссылки
 PickPointSelectedSubObject Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!