Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.Windows.ToolPalette.CustomToolBase.DragEnter
 Послать отзыв
 Метод вызывается, когда перетаскиваемый объект стандартного инструмента попадает в область панели инструментов. Не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void DragEnter( ref System.Windows.Forms.IDataObject data, UInt32 keyState, ref HostMgd.ApplicationServices.POINTL point, UInt32 effect );
Копировать Код
Public Overridable Sub DragEnter( ByRef data As System.Windows.Forms.IDataObject, keyState As UInt32, ByRef point As HostMgd.ApplicationServices.POINTL, effect As UInt32 )
 Параметры
 Параметры
 Описание
 data
 Входной объект данных, связанный с перетаскиваемым инструментом. Тип System.Windows.Forms.IDataObject.
 keyState
 Входное состояние клавиш-модификаторов (например, Ctrl, Shift, Alt) и кнопок мыши во время перетаскивания. Тип UInt32.
 point
 Позиция курсора мыши в момент входа в область панели инструментов (в экранных координатах). Тип HostMgd.ApplicationServices.POINTL.
 effect
 Входной/выходной параметр, определяющий эффект перетаскивания (копирование, перемещение и т.п.). Тип UInt32.
 Описание
 Метод DragEnter() используется для настройки поведения панели инструментов в процессе перетаскивания (Drag-and-Drop) и вызывается, когда перетаскиваемый объект стандартного инструмента попадает в область панели инструментов. Метод позволяет сообщить системе, какое действие разрешено (например, копирование, перемещение или запрет операции), а также учитывать типы данных и состояния клавиш-модификаторов и кнопок мыши.
 В текущей версии не реализован.
 Ссылки
 HostMgd.Windows.ToolPalette.CustomToolBase, HostMgd.Windows.ToolPalette
 Ваши комментарии по поводу этого топика: Послать отзыв!