Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.CurrentViewportObjectId
 Послать отзыв
 Свойство предназначено для получения идентификатора текущего видового экрана, активного на вкладке "Лист".
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectId CurrentViewportObjectId { get; }
Копировать Код
Public ReadOnly Property CurrentViewportObjectId() As ObjectId
 Возвращает
 Возвращает значение типа ObjectId, представляющее собой ссылку на объект Viewport в базе данных чертежа. Если активный видовой экран не определён или находится в пространстве модели, возвращается ObjectId.Null.
 Описание
 Свойство предоставляет доступ к идентификатору (ObjectId) объекта Viewport, который является активным в пространстве листа (paper space) в данный момент. Оно позволяет программно определить, какой именно видовой экран используется для отображения модели в текущем контексте. Свойство доступно только для чтения и актуально при работе с несколькими видовыми экранами на листе.
 Условия
 Только чтение
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("CurrentViewportObjectIdExample")] public void CurrentViewportObjectIdExample() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Получаем идентификатор активного видового экрана ObjectId currentVpId = editor.CurrentViewportObjectId; // Вывод сообщения в командной строке if (!currentVpId.IsNull) { editor.WriteMessage( $"\nИдентификатор текущего видового экрана: {currentVpId}"); } else { editor.WriteMessage( "\nТекущий видовой экран не определён."); } } }
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!