Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод TransactionManager.EnableGraphicsFlush
 Послать отзыв
 This is EnableGraphicsFlush, a member of class TransactionManager.
 Синтаксис
C#
Visual Basic
public void EnableGraphicsFlush(bool doEnable);
Public Sub EnableGraphicsFlush(doEnable As bool)
 Ссылки
 TransactionManager Класс, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!