Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод IConfigurationSection.CreateSubsection
 Послать отзыв
 Синтаксис
C#
Visual Basic
IConfigurationSection CreateSubsection(ref String name);
Function CreateSubsection(ByRef name As String) As IConfigurationSection
 Параметры
 Параметры
 Описание
 name
 Имя создаваемой подсекции
 Описание
 Создает конфигурационную подсекцию с именем name.
 Ссылки
 IConfigurationSection Интерфейс, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!