Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.PlotConfigInfoCollection.PlotConfigInfoCollection
 Послать отзыв
 Конструктор по умолчанию класса PlotConfigInfoCollection.
 Синтаксис
C#
Visual Basic
Копировать Код
public PlotConfigInfoCollection();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса PlotConfigInfoCollection.
 Ссылки
 HostMgd.PlottingServices.PlotConfigInfoCollection, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!