Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Класс HostMgd.EditorInput.PointFilterResult
 Послать отзыв
 Иерархия классов
HostMgd::EditorInput::PointFilterResult
 Синтаксис
C#
Visual Basic
public class PointFilterResult : System.IDisposable;
Public Class PointFilterResult Inherits System.IDisposable
 Описание
 Класс обеспечивает выходными данными событие PointFilter класса Editor. Он соответтсвует выходным параметрам HostEdInputPointFilter.processInputPoint() nanoCAD API.
 Топики
 Имя
 Описание
 PointFilterResult Свойства
 Ниже перечислены свойства класса PointFilterResult.
 Ссылки
 PointFilterResult Свойства, Топики, PointFilterResult Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!