Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.GetFileNameForOpen(PromptOpenFileOptions)
 Послать отзыв
 Метод эмулирует ввод имени файла для открытия, выводя приглашение в командной строке, если диалоговые окна отключены или выполняется скрипт.
 Синтаксис
C#
Visual Basic
Копировать Код
public PromptFileNameResult GetFileNameForOpen(PromptOpenFileOptions options);
Копировать Код
Public Function GetFileNameForOpen(options As PromptOpenFileOptions) As PromptFileNameResult
 Параметры
 Параметры
 Описание
 options
 Объект, содержащий параметры запроса имени файла:
 Возвращает
 Возвращает объект типа PromptFileNameResult, который содержит:
Status — статус операции (OK, Cancel, Error и др.).
StringResult — строку с путём к выбранному файлу, если операция успешна.
 Описание
 Метод используется для получения пути и имени файла, который пользователь намерен открыть. Если значение системной переменной FILEDIA равно 0 (диалоговые окна отключены) или команда вызвана из LISP-скрипта, метод выводит приглашение в командной строке и ожидает ввода пользователем имени файла. В противном случае может быть показан стандартный диалог открытия файла. Метод предоставляет гибкие настройки через параметр PromptOpenFileOptions.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("GetFileNameForOpenExample_PromptOpenFileOptions")] public void GetFileNameForOpenExample_PromptOpenFileOptions() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создаём запрос пользователю PromptOpenFileOptions options = new PromptOpenFileOptions("Выберите файл DWG"); options.Filter = "Чертежи (*.dwg)|*.dwg"; PromptFileNameResult result = editor.GetFileNameForOpen(options); // Если все данные введены, выводим результат в командную строку if (result.Status == PromptStatus.OK) { Application.DocumentManager.MdiActiveDocument.Editor.WriteMessage( $"\nВыбран файл: {result.StringResult}"); } else { Application.DocumentManager.MdiActiveDocument.Editor.WriteMessage( "\nФайл не выбран."); } } }
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!