Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Перечисление HostMgd.Windows.ToolPalette.ToolEditFlags
 Послать отзыв
 This is record HostMgd::Windows::ToolPalette::ToolEditFlags.
 Синтаксис
C#
Visual Basic
public enum ToolEditFlags { EditCustom = 1, EditDefault = 0, EditMultiple = 4, EditNone = 2 }
Public Enum ToolEditFlags EditCustom = 1 EditDefault = 0 EditMultiple = 4 EditNone = 2 End Enum
 Ваши комментарии по поводу этого топика: Послать отзыв!