Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.GraphicsSystem.Manager.SetViewportFromView
 Послать отзыв
 Метод переопределяет параметры видового экрана, используя указанный вид в качестве источника значений параметров. Опционально можно потребовать синхронизацию параметров двумерного вида.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetViewportFromView( int viewportNumber, ref Teigha.GraphicsSystem.View view, bool syncRequired );
Копировать Код
Public Sub SetViewportFromView( viewportNumber As Integer, ByRef view As Teigha.GraphicsSystem.View, syncRequired As Boolean )
 Параметры
 Параметры
 Описание
 viewportNumber
 Номер переопределяемого видового экрана. Тип int.
 view
 Вид-источник параметров. Тип Teigha.GraphicsSystem.View.
 syncRequired
 Флаг синхронизации. Тип bool. Передать значение true, если требуется синхронизация двумерного вида, и false в противном случае.
 Описание
 Метод позволяет переопределить параметры видового экрана, используя указанный вид view в качестве источника значений параметров. Флаг syncRequired используется для синхронизации параметров 2D-вида. Это бывает полезно после изменения вида в 3D-видовых экранах, когда регенерация больше не требуется, но нужна синхронизация 2D-вида.
 Ссылки
 HostMgd.GraphicsSystem.Manager, HostMgd.GraphicsSystem
 Ваши комментарии по поводу этого топика: Послать отзыв!