Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.Application.DocumentManager
 Послать отзыв
 Свойство предназначено для доступа к коллекции документов, открытых в приложении nanoCAD.
 Синтаксис
C#
Visual Basic
public DocumentCollection DocumentManager;
Public Property DocumentManager() As DocumentCollection
 Возвращает
 Возвращает коллекцию документов типа DocumentCollection, в которой расположены документы типа Document. Количество документов равно количеству документов, открытых в приложении nanoCAD.
 Описание
 Свойство предоставляет доступ к коллекции документов DocumentCollection, открытых в приложении nanoCAD.
 Условия
 Только чтение.
 Ссылки
 HostMgd.ApplicationServices.Application, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!