Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptSelectionResultEventHandler(object,PromptSelectionResultEventArgs)
 Послать отзыв
 Делегат предназначен для обработки событий, возникающих после завершения операции выбора одного или нескольких объектов в редакторе nanoCAD.
 Синтаксис
C#
Visual Basic
Копировать Код
public delegate void PromptSelectionResultEventHandler(object sender, PromptSelectionResultEventArgs e);
Копировать Код
Public Delegate Sub PromptSelectionResultEventHandler(sender As Object, e As PromptSelectionResultEventArgs)
 Параметры
 Параметры
 Описание
 sender
 Источник события, обычно представляет собой экземпляр редактора (Editor), в котором была выполнена операция выборки. Тип object
 e
 Объект, содержащий данные о результате выборки:
 Описание
 Делегат используется как сигнатура метода-обработчика для событий, связанных с выбором геометрических объектов на чертеже. Он применяется, например, при работе с событием PromptedForSelection, которое вызывается после завершения интерактивного выделения объектов — мышью, рамкой или программно. Делегат позволяет получить доступ к результату выборки через параметр e, который содержит:
набор выделенных объектов (SelectionSet),
статус выполнения операции (PromptStatus.OK, PromptStatus.Cancel и др.),
параметры команды ввода ,
строковое представление введённых данных .
 Этот тип делегата играет ключевую роль при разработке плагинов, где требуется обрабатывать множественный выбор объектов перед выполнением массовых операций — таких как удаление, модификация или анализ свойств.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события PromptedForSelection [Teigha.Runtime.CommandMethod("PromptedForSelectionExample")] public void PromptedForSelectionExample() { // Подписка на событие PromptedForSelection editor.PromptedForSelection += OnEditorPromptedForSelection; } // Реализация отработки события PromptedForSelection private void OnEditorPromptedForSelection(object sender, PromptSelectionResultEventArgs e) { // Вывод сообщения в командную строку if (e.Result.Status == PromptStatus.OK && e.Result.Value != null) { editor.WriteMessage($"\nВыбрано объектов: {e.Result.Value.Count}"); } else { editor.WriteMessage("\nОперация выбора объектов отменена."); } } }
 Ваши комментарии по поводу этого топика: Послать отзыв!