Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Класс HostMgd.EditorInput.JigPromptStringOptions
 Послать отзыв
 Класс предназначен для хранения набора параметров, необходимых для запроса текстовых данных во время операции Jig.
 Иерархия классов
HostMgd::EditorInput::PromptOptions HostMgd::EditorInput::JigPromptOptions HostMgd::EditorInput::JigPromptStringOptions
 Синтаксис
C#
Visual Basic
public class JigPromptStringOptions : JigPromptOptions;
Public Class JigPromptStringOptions Inherits JigPromptOptions
 Описание
 Класс предназначен для для хранения набора параметров, необходимых для запроса текстовых данных во время операции Jig. Используется с методом AcquireString() класса JigPrompts и позволяет установить для запроса приглашающее сообщение, ключевые слова, значение по умолчанию, внешний вид курсора и изменить пользовательские настройки ввода.
 Методы
 Конструкторы
 Класс HostMgd.EditorInput.JigPromptStringOptions
 Имя
 Описание
 JigPromptStringOptions
 Это обзор перегрузок JigPromptStringOptions.
 Топики
 Имя
 Описание
 PromptOptions Методы
 Ниже перечислены методы класса PromptOptions.
 PromptOptions Свойства
 Ниже перечислены свойства класса PromptOptions.
 Класс HostMgd.EditorInput.JigPromptOptions
 Имя
 Описание
 JigPromptOptions Методы
 Ниже перечислены методы класса JigPromptOptions.
 JigPromptOptions Свойства
 Ниже перечислены свойства класса JigPromptOptions.
 Класс HostMgd.EditorInput.JigPromptStringOptions
 Имя
 Описание
 JigPromptStringOptions Свойства
 Ниже перечислены свойства класса JigPromptStringOptions.
 Ссылки
 JigPromptStringOptions Конструктор, JigPromptStringOptions Свойства, Методы, Топики, PromptOptions Методы, PromptOptions Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!