Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.PlotConfig.PlotToFileCapability
 Послать отзыв
 Свойство PlotToFileCapability позволяет проверить возможность печати в файл на данном устройстве. Не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public HostMgd.PlottingServices.PlotToFileCapability PlotToFileCapability;
Копировать Код
Public ReadOnly Property PlotToFileCapability As HostMgd.PlottingServices.PlotToFileCapability
 Возвращает
 Возвращает значение из перечисления HostMgd.PlottingServices.PlotToFileCapability, которое отражает возможность печати в файл на данном устройстве.
 Описание
 Свойство PlotToFileCapability позволяет проверить возможность печати в файл на данном устройстве. Возможные варианты определены в перечислении PlotToFileCapability (только в файл / возможна / не предусмотрена).
 В текущей версии не реализовано.
 Условия
 Только чтение.
 Ссылки
 HostMgd.PlottingServices.PlotConfig, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!