Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Класс HostMgd.EditorInput.SelectedSubObject
 Послать отзыв
 Иерархия классов
HostMgd::EditorInput::SelectedSubObject
 Синтаксис
C#
Visual Basic
public class SelectedSubObject;
Public Class SelectedSubObject
 Описание
 Это базовый класс для описания подобъектов, выбранных различными методами. Он определяет базовые данные, описывающие выбранный подобъект С полный путь к геометрическому подобъекту, GS маркер, метод выбора подобъекта, а также необязательные детали.
 Методы
 Конструкторы
 Имя
 Описание
 SelectedSubObject
 Топики
 Имя
 Описание
 SelectedSubObject Методы
 Ниже перечислены методы класса SelectedSubObject.
 SelectedSubObject Свойства
 Ниже перечислены свойства класса SelectedSubObject.
 Ссылки
 SelectedSubObject Методы, SelectedSubObject Свойства, Методы, Топики, SelectedSubObject Методы, SelectedSubObject Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!