Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Класс HostMgd.EditorInput.PromptOpenFileOptions
 Послать отзыв
 Иерархия классов
HostMgd::EditorInput::PromptFileOptions HostMgd::EditorInput::PromptOpenFileOptions
 Синтаксис
C#
Visual Basic
public class PromptOpenFileOptions : PromptFileOptions;
Public Class PromptOpenFileOptions Inherits PromptFileOptions
 Описание
 Класс содержит параметры конфигурации окна диалога выбора имени файла, которые передаются в метод Editor.GetFileNameForOpen().
 Методы
 Конструкторы
 Класс HostMgd.EditorInput.PromptOpenFileOptions
 Имя
 Описание
 PromptOpenFileOptions
 Топики
 Имя
 Описание
 PromptFileOptions Свойства
 Ниже перечислены свойства класса PromptFileOptions.
 Класс HostMgd.EditorInput.PromptOpenFileOptions
 Имя
 Описание
 PromptOpenFileOptions Свойства
 Ниже перечислены свойства класса PromptOpenFileOptions.
 Ссылки
 PromptOpenFileOptions Свойства, Методы, Топики, PromptFileOptions Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!