Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство UnknownCommandEventArgs.GlobalCommandName
 Послать отзыв
 Синтаксис
C#
Visual Basic
public System.String GlobalCommandName;
Public Property GlobalCommandName() As System.String
 Описание
 Имя команды, которая привела к возникновению события.
 Условия
 Только на чтение
 Ссылки
 UnknownCommandEventArgs Класс, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!