Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PrintForm.SheetProgressPos
 Послать отзыв
 This is SheetProgressPos, a member of class PrintForm.
 Синтаксис
C#
Visual Basic
public int SheetProgressPos;
Public Property SheetProgressPos() As Integer
 Ссылки
 PrintForm Класс, Пространство имен HostMgd
 Ваши комментарии по поводу этого топика: Послать отзыв!