Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PointMonitorEventArgs
 Послать отзыв
 Класс предоставляет данные для события PointMonitor, возникающего при перемещении мыши в редакторе nanoCAD.
 Иерархия классов
HostMgd::EditorInput::PointMonitorEventArgs
 Синтаксис
C#
Visual Basic
Копировать Код
public sealed class PointMonitorEventArgs : EventArgs, IDisposable
Копировать Код
Public NotInheritable Class PointMonitorEventArgs Inherits EventArgs Implements IDisposable
 Описание
 Класс наследуется от EventArgs и реализует интерфейс IDisposable. Он используется в связке с событием PointMonitor редактора nanoCAD и содержит информацию о текущем положении указателя, контексте ввода и активном виде. Этот класс позволяет разработчикам получать актуальные координаты точки, над которой находится курсор, а также устанавливать дополнительные параметры отображения — такие как цвет маркера или тип курсора. Объект этого класса создаётся системой при каждом событии перемещения мыши и должен быть корректно освобождён после использования.
 Замечания
 Так как класс реализует IDisposable, рекомендуется использовать его внутри блока using или вручную вызывать метод Dispose() для освобождения неуправляемых ресурсов.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события PointMonitor [Teigha.Runtime.CommandMethod("PointMonitorExample")] public void PointMonitorExample() { // Подписка на событие PointMonitor editor.PointMonitor += OnEditorPointMonitor; } // Реализация отработки события PointMonitor private void OnEditorPointMonitor(object sender, PointMonitorEventArgs e) { // Вывод сообщения в командную строку editor.WriteMessage( $"\nТекущая позиция мыши: {e.Context.LastPoint}"); } }
 Топики
 Имя
 Описание
 PointMonitorEventArgs Методы
 Ниже перечислены методы класса PointMonitorEventArgs.
 PointMonitorEventArgs Свойства
 Ниже перечислены свойства класса PointMonitorEventArgs.
 Ссылки
 PointMonitorEventArgs Методы, PointMonitorEventArgs Свойства, Топики, PointMonitorEventArgs Методы, PointMonitorEventArgs Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!