Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptStringOptionsEventHandler(object,PromptStringOptionsEventArgs)
 Послать отзыв
 Делегат предназначен для обработки события, возникающего перед началом ввода строки, и позволяет настроить параметры приглашения.
 Синтаксис
C#
Visual Basic
Копировать Код
public delegate void PromptStringOptionsEventHandler(object sender, PromptStringOptionsEventArgs e);
Копировать Код
Public Delegate Sub PromptStringOptionsEventHandler(sender As Object, e As PromptStringOptionsEventArgs)
 Параметры
 Параметры
 Описание
 sender
 Источник события — обычно экземпляр редактора (Editor), в котором происходит ввод строки. Тип object
 e
 Объект, содержащий параметры ввода строки: Options — объект PromptStringOptions, позволяющий изменить сообщение, ключевые слова, режимы ввода и другие настройки. Context — контекст ввода (при наличии), содержащий дополнительную информацию о текущей операции. Тип PromptStringOptionsEventArgs
 Описание
 Делегат используется как сигнатура метода-обработчика для события PromptingForString, которое генерируется перед началом интерактивного ввода текстовой строки в редакторе nanoCAD. Он позволяет разработчику изменить параметры команды ввода — такие как сообщение, ключевые слова, режимы ввода и разрешения — до того, как пользователь начнёт ввод.
 Этот делегат применяется при реализации команд, требующих ввода текста или выбора из списка ключевых слов — например, при задании имён стилей, слоёв, режимов работы и других параметров. Он обеспечивает гибкость и контроль над поведением ввода в зависимости от контекста.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события PromptingForString [Teigha.Runtime.CommandMethod("PromptingForStringExample")] public void PromptingForStringExample() { // Подписка на событие PromptingForString editor.PromptingForString += OnEditorPromptingForString; } // Реализация отработки события PromptingForString private void OnEditorPromptingForString(object sender, PromptStringOptionsEventArgs e) { // Изменение сообщения приглашения e.Options.Message = "Введите имя стиля текста:"; // Добавление ключевых слов e.Options.Keywords.Add("По умолчанию"); e.Options.Keywords.Add("Новый"); e.Options.Keywords.Add("Текущий"); } }
 Ваши комментарии по поводу этого топика: Послать отзыв!