Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Класс HostMgd.Publishing.Publisher
 Послать отзыв
 This is class HostMgd::Publishing::Publisher.
 Иерархия классов
HostMgd::Publishing::Publisher
 Синтаксис
C#
Visual Basic
public class Publisher : MarshalByRefObject;
Public Class Publisher Inherits MarshalByRefObject
 Методы
 Конструкторы
 Имя
 Описание
 Publisher
 This is Publisher, a member of class Publisher.
 Топики
 Имя
 Описание
 Publisher Методы
 Ниже перечислены методы класса Publisher.
 Publisher Свойства
 Ниже перечислены свойства класса Publisher.
 Publisher События
 Ниже перечислены события класса Publisher.
 Ссылки
 Publisher Методы, Publisher Свойства, Publisher События, Методы, Топики, Publisher Методы, Publisher Свойства, Publisher События
 Ваши комментарии по поводу этого топика: Послать отзыв!