Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод MenuItemCollection.GetEnumerator
 Послать отзыв
 This is GetEnumerator, a member of class MenuItemCollection.
 Синтаксис
C#
Visual Basic
public Generic.IEnumerator<IMenuItem^> GetEnumerator();
Public Function GetEnumerator() As Generic.IEnumerator<IMenuItem^>
 Ссылки
 MenuItemCollection Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!