Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.Application.EvaluateDiesel(String)
 Послать отзыв
 МЕТОД НЕ РЕАЛИЗОВАН. ВОЗВРАЩАЕТ NULL. Метод предназначен для интерпретации строки в строковый результат.
 Синтаксис
C#
Visual Basic
Копировать Код
public static string EvaluateDiesel(string dieselCmd);
Копировать Код
Public Shared Function EvaluateDiesel(dieselCmd As String) As String
 Параметры
 Параметры
 Описание
 dieselCmd
 Строка, которую нужно интерпретировать. Тип String
 Возвращает
 Возвращает интерпретированную строку. Тип String.
 Описание
 Метод использует DIESEL для интерпретации строки, переданной через параметр dieselCmd. DIESEL - Direct Interpretively Evaluated String Expression Language, язык строковых выражений с прямой интерпретацией. Метод интерпретирует строку в тип данных PronptStringResult, который потом можно использовать в интерфейсе программы. Строки, сгенерированные выражениями DIESEL, могут быть использованы для:
управления надписями и поведением кнопок на ленточных панелях и панелях инструментов;
отображения текста в строке состояния с помощью системной переменной MODEMACRO;
манипуляций строковыми значениями с помощью функции LISP menucmd.
 Ссылки
 HostMgd.ApplicationServices.Application, HostMgd.ApplicationServices Пространство имен
 Исключения
 MGD NOT_IMPLEMENTED
 Ваши комментарии по поводу этого топика: Послать отзыв!