Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.Document.CommandFailed
 Послать отзыв
 Событие, означающее что команда cmdStr аварийно завершена.
 Синтаксис
C#
Visual Basic
public event CommandEventHandler CommandFailed;
Public Event CommandFailed As CommandEventHandler
 Возвращает
 Возвращает тип данных CommandEventHandler
 Описание
 Событие, означающее что команда cmdStr аварийно завершена. Соответствует функции NRX API HostEditorReactor.commandFailed().
 Ссылки
 HostMgd.ApplicationServices.Document, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!