Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Camera.Position
 Послать отзыв
 Свойство Position представляет точку положения камеры. Не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d Position;
Копировать Код
Public ReadOnly Property Position As Point3d
 Возвращает
 Возвращает точку положения камеры. Тип Point3d.
 Описание
 Свойство Position представляет точку положения камеры. В текущей версии не реализовано.
 Условия
 Только чтение.
 Ссылки
 HostMgd.EditorInput.Camera, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!