Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Класс HostMgd.Windows.ToolPalette.Tool
 Послать отзыв
 This is class HostMgd::Windows::ToolPalette::Tool.
 Иерархия классов
HostMgd::Windows::ToolPalette::CatalogItem HostMgd::Windows::ToolPalette::Tool
 Синтаксис
C#
Visual Basic
public class Tool : CatalogItem;
Public Class Tool Inherits CatalogItem
 Топики
 Имя
 Описание
 CatalogItem Методы
 Ниже перечислены методы класса CatalogItem.
 Класс HostMgd.Windows.ToolPalette.Tool
 Имя
 Описание
 Tool Методы
 Ниже перечислены методы класса Tool.
 Tool Свойства
 Ниже перечислены свойства класса Tool.
 Ссылки
 Tool Методы, Tool Свойства, Топики, CatalogItem Методы, Tool Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!