Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.DocumentCollection.MdiActiveDocument
 Послать отзыв
 Метод предназначен для получения объекта активного dwg-документа.
 Синтаксис
C#
Visual Basic
public Document MdiActiveDocument;
Public Property MdiActiveDocument() As Document
 Возвращает
 Возвращает текущий (активный) MDI документ. Тип Document
 Описание
 Метод предназначен для получения объекта активного dwg-документа.
 Условия
 Чтение и запись
 Ссылки
 HostMgd.ApplicationServices.DocumentCollection, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!