Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.InplaceTextEditor.ColumnsDialog
 Послать отзыв
 Метод вызывает диалог редактирования столбцов данного текстового редактора. В текущей версии не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public void ColumnsDialog( int staticColumnCount );
Копировать Код
Public Sub ColumnsDialog( staticColumnCount As Integer )
 Параметры
 Параметры
 Описание
 staticColumnCount
 Текущее количество столбцов. Тип int.
 Описание
 Метод вызывает диалог редактирования столбцов данного текстового редактора. В текущей версии не реализован.
 Ссылки
 HostMgd.ApplicationServices.InplaceTextEditor, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!