Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PointFilterResult.ToolTipText
 Послать отзыв
 Синтаксис
C#
Visual Basic
public System.String ToolTipText;
Public Property ToolTipText() As System.String
 Описание
 Возвращает строку подсказки инструмента.
 Условия
 На чтение и запись
 Ссылки
 PointFilterResult Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!