Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство TabbedDialogExtension.Control
 Послать отзыв
 Синтаксис
C#
Visual Basic
public System.Object Control;
Public Property Control() As System.Object
 Описание
 Возвращает элемент управления, который заполняет диалоговое окно.
 Условия
 Только на чтение
 Ссылки
 TabbedDialogExtension Класс, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!