Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство SelectionSet.Item
 Послать отзыв
 This is Item, a member of class SelectionSet.
 Синтаксис
C#
Visual Basic
public HostMgd::EditorInput::SelectedObject Item;
Public Property Item() As HostMgd.EditorInput.SelectedObject
 Ссылки
 SelectionSet Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!