Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.Windows.ToolPalette.CustomToolBase.MapPropertyToPage
 Послать отзыв
 Метод выполняет сопоставление идентификатора COM-класса CLSID со страницей свойств в диалоговом окне для указанного свойства данного инструмента. Не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void MapPropertyToPage( int dispatchId, Guid clsid );
Копировать Код
Public Overridable Sub MapPropertyToPage( dispatchId As Integer, clsid As Guid )
 Параметры
 Параметры
 Описание
 dispatchId
 Диспетчерский идентификатор (DispID) свойства инструмента. Тип int.
 clsid
 Идентификатор COM-класса, представляющего страницу свойств. Тип Guid.
 Описание
 Метод выполняет сопоставление идентификатора COM-класса CLSID со страницей свойств в диалоговом окне для указанного свойства данного инструмента.
 В текущей версии не реализован.
 Ссылки
 HostMgd.Windows.ToolPalette.CustomToolBase, HostMgd.Windows.ToolPalette
 Ваши комментарии по поводу этого топика: Послать отзыв!