Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.GetFileNameForSave(PromptSaveFileOptions)
 Послать отзыв
 Метод эмулирует ввод имени файла для сохранения, выводя приглашение в командной строке, если диалоговые окна отключены или выполняется скрипт.
 Синтаксис
C#
Visual Basic
Копировать Код
public PromptFileNameResult GetFileNameForSave(PromptSaveFileOptions options);
Копировать Код
Public Function GetFileNameForSave(options As PromptSaveFileOptions) As PromptFileNameResult
 Параметры
 Параметры
 Описание
 options
 Объект, содержащий параметры запроса имени файла:
 Возвращает
 Возвращает объект типа PromptFileNameResult, который содержит:
Status — статус операции (OK, Cancel, Error и др.).
StringResult — строку с путём, под которым будет сохранён файл (если операция успешна).
 Описание
 Метод используется для получения пути и имени файла, под которым пользователь намерен сохранить документ. Если значение системной переменной FILEDIA равно 0 (диалоговые окна отключены) или команда вызвана из LISP-скрипта, метод выводит приглашение в командной строке и ожидает ввода пользователем имени файла. В противном случае может быть показан стандартный диалог сохранения файла. Метод предоставляет гибкие настройки через параметр PromptSaveFileOptions.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("GetFileNameForSaveExample_PromptSaveFileOptions")] public void GetFileNameForSaveExample_PromptSaveFileOptions() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создаём запрос пользователю PromptSaveFileOptions options = new PromptSaveFileOptions("Сохранить как"); options.Filter = "Чертежи (*.dwg)|*.dwg"; PromptFileNameResult result = editor.GetFileNameForSave(options); // Если все данные введены, выводим результат в командную строку if (result.Status == PromptStatus.OK) { editor.WriteMessage( $"\nФайл будет сохранён как: {result.StringResult}"); } else { editor.WriteMessage( "\nИмя файла не указано."); } } }
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!