Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptDoubleResult.Value
 Послать отзыв
 Свойство предоставляет значение вещественного числа, введённого пользователем в ходе интерактивной операции ввода угла или расстояния.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Value { get; }
Копировать Код
Public ReadOnly Property Value As Double
 Возвращает
 Возвращает значение типа double, представляющее собой число, введённое пользователем. Возможные значения зависят от контекста:
Для угла : значение в радианах.
Для расстояния : числовое значение в текущих единицах чертежа.
 Если операция была прервана (например, пользователь нажал Esc) или ввод не был выполнен, значение может быть неопределённым или равным 0, в зависимости от реализации.
 Описание
 Свойство используется для получения числового значения, введённого пользователем при выполнении команд, таких как GetAngle(), GetDistance() и другие, которые возвращают результат в виде объекта PromptDoubleResult. Это свойство доступно только для чтения и содержит значение после успешного завершения операции ввода. Например, при запросе угла — возвращает значение в радианах, при запросе расстояния — в единицах чертежа.
 Условия
 Только чтение
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("PromptDoubleResultExample_Value")] public void PromptDoubleResultExample_Value() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Вызываем метод GetDistance для запроса данных у пользователя PromptDoubleResult result = editor.GetDistance("Введите расстояние:"); // Если все данные введены, выводим результат в командную строку if (result.Status == PromptStatus.OK) { double distance = result.Value; editor.WriteMessage($"\nВы ввели расстояние: {distance}"); } else { editor.WriteMessage("\nВвод отменён."); } } }
 Ссылки
 HostMgd.EditorInput.PromptDoubleResult, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!