Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.CheckingOutEventHandler(Object, CheckingOutEventArgs)
 Послать отзыв
 Делегат CheckingOutEventHandler определяет тип, используемый для обработки события LongTransactionManager.CheckingOut.
 Синтаксис
C#
Visual Basic
Копировать Код
public delegate void CheckingOutEventHandler( Object sender, CheckingOutEventArgs e );
Копировать Код
Public Delegate Sub CheckingOutEventHandler( sender As Object, e As CheckingOutEventArgs )
 Параметры
 Параметры
 Описание
 sender
 Объект, инициировавший событие. Тип Object.
 e
 Аргументы события. Тип CheckingOutEventArgs.
 Описание
 Делегат CheckingOutEventHandler определяет тип, используемый для обработки события LongTransactionManager.CheckingOut.
 Ваши комментарии по поводу этого топика: Послать отзыв!