Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.Application.HostApplication
 Послать отзыв
 Свойство предназначено для доступа к COM-объекту приложения nanoCAD.
 Синтаксис
C#
Visual Basic
public System.Object HostApplication;
Public Property HostApplication() As System.Object
 Возвращает
 Возвращает ссылку на COM-объект приложения nanoCAD. Тип object, который нужно преобразовать в nanoCAD.Application из COM-библиотеки.
 Описание
 Свойство предоставляет доступ к COM-объекту приложения nanoCAD.
 Условия
 Только чтение.
 Ссылки
 HostMgd.ApplicationServices.Application, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!