Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Camera.FrontClipEnabled
 Послать отзыв
 Свойство FrontClipEnabled позволяет определить, включен ли режим переднего отсечения. Не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool FrontClipEnabled;
Копировать Код
Public ReadOnly Property FrontClipEnabled As Boolean
 Возвращает
 Возвращает true, если режим переднего отсечения включен. В противном случае возвращает false.
 Описание
 Свойство FrontClipEnabled позволяет определить, включен ли режим переднего отсечения. В текущей версии не реализовано.
 Условия
 Только чтение.
 Ссылки
 HostMgd.EditorInput.Camera, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!