Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Делегат HostMgd.Publishing.BeginPublishingSheetEventHandler
 Послать отзыв
 This is type HostMgd::Publishing::BeginPublishingSheetEventHandler.
 Синтаксис
C#
Visual Basic
public delegate BeginPublishingSheetEventHandler();
Public Delegate Sub BeginPublishingSheetEventHandler()
 Ваши комментарии по поводу этого топика: Послать отзыв!