Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод PublishEntityEventArgs.SetNodeName
 Послать отзыв
 This is SetNodeName, a member of class PublishEntityEventArgs.
 Синтаксис
C#
Visual Basic
public bool SetNodeName(int nodeId, ref System.String nodeName);
Public Function SetNodeName(nodeId As Integer, ByRef nodeName As System.String) As bool
 Ссылки
 PublishEntityEventArgs Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!