Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.PageCancelledEventHandler(Object, EventArgs)
 Послать отзыв
 Делегат PageCancelledEventHandler предназначен для обработки события PlotReactorManager.PageCancelled, возникающего, когда пользователь отменил вывод на плоттер текущей страницы.
 Синтаксис
C#
Visual Basic
Копировать Код
public delegate void PageCancelledEventHandler( Object sender, EventArgs e );
Копировать Код
Public Delegate Sub PageCancelledEventHandler( sender As Object, e As EventArgs )
 Параметры
 Параметры
 Описание
 sender
 Объект, инициировавший событие. Тип Object.
 e
 Аргументы события. Тип EventArgs.
 Описание
 Делегат PageCancelledEventHandler предназначен для обработки события PlotReactorManager.PageCancelled, возникающего, когда пользователь отменил вывод на плоттер текущей страницы.
 Контекст события передается через параметры sender и e, где sender определяет объект-инициатор события, а аргумент e содержит параметры события.
 Ваши комментарии по поводу этого топика: Послать отзыв!