Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptIntegerResultEventArgs
 Послать отзыв
 Класс предоставляет данные для события, возникающего после завершения интерактивного ввода целого числа пользователем в редакторе nanoCAD.
 Иерархия классов
HostMgd::EditorInput::PromptIntegerResultEventArgs
 Синтаксис
C#
Visual Basic
Копировать Код
public class PromptIntegerResultEventArgs : EventArgs
Копировать Код
Public Class PromptIntegerResultEventArgs Inherits EventArgs
 Описание
 Класс наследуется от EventArgs и используется для передачи информации о результате ввода целого числа в обработчик событий. Он применяется совместно с событием PromptedForInteger, которое генерируется после вызова метода GetInteger() или других команд, где требуется ввод числового значения типа int.
 Этот класс содержит:
Value — целочисленное значение, введённое пользователем.
Status — статус выполнения операции (OK, Cancel, Error и др.).
StringResult — строковое представление введённого значения или команды.
 Он позволяет разработчикам надстроек nanoCAD реагировать на результат ввода, проверять допустимость значения и выполнять дальнейшие действия в зависимости от введённых данных.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события PromptedForInteger [Teigha.Runtime.CommandMethod("PromptedForIntegerExample")] public void PromptedForIntegerExample() { // Подписка на событие PromptedForInteger editor.PromptedForInteger += OnEditorPromptedForInteger; } // Реализация отработки события PromptedForInteger private void OnEditorPromptedForInteger(object sender, PromptIntegerResultEventArgs e) { // Вывод сообщения в командную строку if (e.Result.Status == PromptStatus.OK) { editor.WriteMessage($"\nВведено число: {e.Result.Value}"); } else { editor.WriteMessage("\nЧисло не введено."); } } }
 Топики
 Имя
 Описание
 PromptIntegerResultEventArgs Свойства
 Ниже перечислены свойства класса PromptIntegerResultEventArgs.
 Ссылки
 PromptIntegerResultEventArgs Свойства, Топики, PromptIntegerResultEventArgs Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!