Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PublishSheetEventArgs.Database
 Послать отзыв
 This is Database, a member of class PublishSheetEventArgs.
 Синтаксис
C#
Visual Basic
public Teigha::DatabaseServices::Database Database;
Public Property Database() As Teigha.DatabaseServices.Database
 Ссылки
 PublishSheetEventArgs Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!