Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PublishSheetEventArgs.PlotWindowMaxX
 Послать отзыв
 This is PlotWindowMaxX, a member of class PublishSheetEventArgs.
 Синтаксис
C#
Visual Basic
public double PlotWindowMaxX;
Public Property PlotWindowMaxX() As Double
 Ссылки
 PublishSheetEventArgs Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!