Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.InputPointContext.ObjectSnapMask
 Послать отзыв
 Свойство предназначено для получения текущего режима объектной привязки (OSNAP), если точка была вычислена и активирована привязка к объекту.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectSnapMasks ObjectSnapMask;
Копировать Код
Public Property ObjectSnapMask() As ObjectSnapMasks
 Возвращает
 Возвращает значение типа ObjectSnapMasks — побитовое перечисление, указывающее текущий активный режим объектной привязки. Пример проверки:
C#
 Копировать Код
if ((context.ObjectSnapMask & ObjectSnapMasks.End) != 0) { // Активна привязка к конечной точке }
 Описание
 Свойство возвращает значение перечисления ObjectSnapMasks, представляющее собой битовую маску, которая определяет, какой именно тип объектной привязки используется в текущий момент при вводе точки. Значение свойства доступно только при выполнении двух условий:
Флаг pointComputed установлен в true — система завершила расчёт точки.
В истории (History) установлен бит Osnapped — указывает, что активирована объектная привязка.
 Это свойство особенно полезно в обработчиках событий PointMonitor и PointFilter, где необходимо:
определить, к какому элементу геометрии привязывается курсор,
адаптировать поведение команды в зависимости от типа OSNAP,
избежать конфликтов с пользовательскими подсказками или направляющими.
 Условия
 Только чтение
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class InputPointContextExamples { // Метод команды, которая получает текущий режим объектной привязки (OSNAP), // если точка была вычислена и активирована привязка к объекту. [Teigha.Runtime.CommandMethod("ObjectSnapMaskExample")] public void ObjectSnapMaskExample() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Метод для отработки события редактора PointMonitor editor.PointMonitor += (sender, e) => { // Сохраняем контекст события в преременную InputPointContext context = e.Context; if (context != null && (context.History & PointHistoryBits.ObjectSnapped) != 0) { // Выводим в комнадную строку полученные данные ObjectSnapMasks currentOsnap = context.ObjectSnapMask; editor.WriteMessage($"\nТекущая привязка: {currentOsnap}"); } }; } }
 Ссылки
 HostMgd.EditorInput.InputPointContext, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!