Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.Document.ViewChanged
 Послать отзыв
 Событие, возникающее перед уничтожением документа.
 Синтаксис
C#
Visual Basic
public event DocumentCollectionEventHandler DocumentToBeDestroyed;
Public Event DocumentToBeDestroyed As DocumentCollectionEventHandler
 Возвращает
 Возвращает тип данных HostMgd.ApplicationServices.DocumentCollectionEventHandler
 Описание
 Событие, возникающее перед уничтожением документа.
 Соответствует функции NRX API HostApDocManagerReactor.documentToBeDestroyed().
 Ссылки
 HostMgd.ApplicationServices.DocumentCollection, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!