Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Перечисление HostMgd.EditorInput.SamplerStatus
 Послать отзыв
 Синтаксис
C#
Visual Basic
public enum SamplerStatus { OK, NoChange, Cancel }
Public Enum SamplerStatus OK NoChange Cancel End Enum
 Члены
 Члены
 Описание
 OK
 Изменения приняты
 NoChange
 Нет изменений
 Cancel
 Отмена операции
 Описание
 Перечисление, представляющее возможные результаты действия по приглашению.
 Наименование
 Описание
 Ok
 Изменения приняты
 NoChange
 Нет изменений
 Cancel
 Отмена операции
 Ваши комментарии по поводу этого топика: Послать отзыв!