Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Делегат HostMgd.Windows.PaletteSetMoveEventHandler
 Послать отзыв
 This is type HostMgd::Windows::PaletteSetMoveEventHandler.
 Синтаксис
C#
Visual Basic
public delegate PaletteSetMoveEventHandler();
Public Delegate Sub PaletteSetMoveEventHandler()
 Ваши комментарии по поводу этого топика: Послать отзыв!