Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.PromptingForSelection
 Послать отзыв
 Событие возникает при начале операции выбора объектов и позволяет настроить параметры команды выборки до её запуска. Событие не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public event PromptSelectionOptionsEventHandler PromptingForSelection;
Копировать Код
Public Event PromptingForSelection As PromptSelectionOptionsEventHandler
 Описание
 Событие инициируется перед началом интерактивного выбора одного или нескольких объектов — например, при вызове метода GetSelection() или при активации команды, требующей выделения. Оно предоставляет доступ к объекту PromptSelectionOptionsEventArgs, содержащему параметры операции выбора, такие как:
сообщение приглашения,
режим выбора,
ключевые слова,
ограничения выборки .
 Это событие позволяет разработчику динамически изменять поведение команды выбора в зависимости от контекста — например, задать типы допустимых объектов, изменить сообщение или добавить пользовательские ключевые слова.
 Событие реализуется через делегат PromptSelectionOptionsEventHandler и вызывается до начала взаимодействия с пользователем, что делает его идеальным для предварительной настройки выборки.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события PromptingForSelection [Teigha.Runtime.CommandMethod("PromptingForSelectionExample")] public void PromptingForSelectionExample() { // Подписка на событие PromptingForSelection editor.PromptingForSelection += OnEditorPromptingForSelection; } // Реализация отработки события PromptingForSelection private void OnEditorPromptingForSelection(object sender, PromptSelectionOptionsEventArgs e) { // Изменение текста приглашения e.Options.MessageForAdding = "Выберите объект для обработки:"; // Разрешить выбор только одного объекта e.Options.SingleOnly = true; // Добавление ключевых слов e.Options.Keywords.Add("Все"); e.Options.Keywords.Add("Фильтр"); } }
 Порядок работы с событием:
Вызывается метод GetSelection() или другая команда, требующая выбора объектов.
Перед началом ввода генерируется событие PromptingForSelection.
Разработчик может изменить параметры выбора через e.Options.
Пользователь выполняет выбор, и операция завершается событием PromptedForSelection.
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!