Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.Windows.ToolPalette.CatalogItem.AddChild
 Послать отзыв
 Метод добавляет дочерний элемент к данному элементу.
 Синтаксис
C#
Visual Basic
Копировать Код
public int AddChild( ref CatalogItem newItem );
Копировать Код
Public Function AddChild( ByRef newItem As CatalogItem ) As Integer
 Параметры
 Параметры
 Описание
 newItem
 Элемент, добавляемый в качестве дочернего. Тип CatalogItem.
 Возвращает
 Возвращает индекс только что добавленного дочернего элемента. Тип int.
 Описание
 Метод добавляет newItem в качестве последнего дочернего элемента данного элемента и возвращает его индекс.
 Ссылки
 HostMgd.Windows.ToolPalette.CatalogItem, HostMgd.Windows.ToolPalette
 Ваши комментарии по поводу этого топика: Послать отзыв!