Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.Application.LoadPartialMenu(String)
 Послать отзыв
 МЕТОД НЕ РЕАЛИЗОВАН. ВСЕГДА ВОЗВРАЩАЕТ FALSE. Метод загружает из указанного файла частичное меню к основному.
 Синтаксис
C#
Visual Basic
Копировать Код
public static bool LoadPartialMenu(string filename);
Visual Studio Syntax
Копировать Код
Public Shared Function LoadPartialMenu(filename As String) As Boolean
Public Function LoadPartialMenu(ByRef filename As System.String) As bool
 Параметры
 Параметры
 Описание
 filename
 имя файла меню или полный путь к файлу с именем. Если файл меню по указанному пути не найден или в параметре указано название файла без пути, то метод ищет файл по пути поиска вспомогательных файлов. Вызов метода отклоняется, если строка является нулевой, пустой или ".". Тип String
 Возвращает
 Возвращает тип bool: true - файл меню успешно найден, false - при загрузке меню произошла ошибка, либо это частичное меню уже было загружено.
 Описание
 Метод загружает частичное меню из указанного cuix-файла к основному. Он не поддерживает добавление частичного меню в корпоративной версии nanoCAD. Если файл меню не найден по указанному пути или если в имени файла нет пути, выполняется поиск файла меню по пути поиска вспомогательных файлов. Метод автоматически сохраняет изменения в главном меню (со списком нового частичного меню).
 Ссылки
 HostMgd.ApplicationServices.Application, HostMgd.ApplicationServices Пространство имен
 Исключения
 MGD NOT_IMPLEMENTED
 Ваши комментарии по поводу этого топика: Послать отзыв!