Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptPointResult
 Послать отзыв
 Класс содержит результат операции интерактивного ввода точки пользователем в редакторе nanoCAD.
 Иерархия классов
HostMgd::EditorInput::PromptResult HostMgd::EditorInput::PromptPointResult
 Синтаксис
C#
Visual Basic
Копировать Код
public sealed class PromptPointResult : PromptResult
Копировать Код
Public NotInheritable Class PromptPointResult Inherits PromptResult
 Описание
 Класс наследуется от PromptResult и используется для хранения данных, полученных в результате вызова методов ввода точки — таких как GetPoint(), GetCorner() и других. Он предоставляет информацию о статусе завершения операции (Status), значение точки в мировой системе координат (Value), а также строковое представление введённой пользователем информации (InputString). Этот класс служит основным контейнером данных при обработке графического ввода точки, что позволяет разработчикам надстроек nanoCAD реагировать на успешный выбор, отмену или ошибку ввода.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("GetPointExample")] public void GetPointExample() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создаём запрос пользователю PromptPointOptions options = new PromptPointOptions("nУкажите точку:"); options.BasePoint = new Point3d(0, 0, 0); // Вызов метода GetPoint() для запроса пользователю PromptPointResult result = editor.GetPoint(options); // Если все данные введены, выводим результат в командную строку if (result.Status == PromptStatus.OK) { Point3d pt = result.Value; editor.WriteMessage( $"\nВыбранная точка: {pt}"); } else { editor.WriteMessage( "\nВвод точки отменен или произошла ошибка."); } } }
 Топики
 Имя
 Описание
 PromptResult Методы
 Ниже перечислены методы класса PromptResult.
 PromptResult Свойства
 Ниже перечислены свойства класса PromptResult.
 HostMgd.EditorInput.PromptPointResult
 Имя
 Описание
 PromptPointResult Методы
 Ниже перечислены методы класса PromptPointResult.
 PromptPointResult Свойства
 Ниже перечислены свойства класса PromptPointResult.
 Ссылки
 PromptPointResult Методы, PromptPointResult Свойства, Топики, PromptResult Методы, PromptResult Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!