Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Класс HostMgd.ApplicationServices.CommandEventArgs
 Послать отзыв
 Класс предназначен для хранения данных о событиях, произошедших в документе.
 Иерархия классов
HostMgd::ApplicationServices::CommandEventArgs
 Синтаксис
C#
Visual Basic
public class CommandEventArgs : System.EventArgs;
Public Class CommandEventArgs Inherits System.EventArgs
 Описание
 Класс обеспечивает данными различные события класса Document.
 Методы
 Конструкторы
 Имя
 Описание
 CommandEventArgs
 Конструктор по умолчанию.
 Топики
 Имя
 Описание
 CommandEventArgs Свойства
 Ниже перечислены свойства класса CommandEventArgs.
 Ссылки
 CommandEventArgs Свойства, Методы, Топики, CommandEventArgs Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!