Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptAngleOptions.AllowZero
 Послать отзыв
 Свойство определяет, разрешён ли ввод нулевого значения угла в интерактивной команде.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool AllowZero { get; set; }
Копировать Код
Public Property AllowZero As Boolean
 Возвращает
 Возвращает значение типа bool:
true — ввод нулевого угла разрешён.
false — ввод нулевого угла запрещён.
 Описание
 Свойство используется для указания, допускается ли ввод нулевого угла (0 радиан) при выполнении команды ввода угла. Если свойство установлено в true, пользователь может ввести значение 0 как допустимый угол. Если в false — ввод нулевого угла блокируется, и система считает его недопустимым, даже если он попадает в диапазон LowerLimit и UpperLimit.
 Это свойство применяется для дополнительного контроля над значениями, которые может ввести пользователь, особенно в тех случаях, когда нулевой угол имеет особое значение или должен быть исключён из допустимых.
 Замечания
 Свойство позволяет настроить правила ввода угла для случаев, когда значение 0 считается недопустимым.
 Условия
 Чтение и запись
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("PromptAngleOptionsExample_AllowZero")] public void PromptAngleOptionsExample_AllowZero() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создаём запрос пользователю, чтобы он указал угол на чертеже PromptAngleOptions options = new PromptAngleOptions("Введите угол поворота:"); options.AllowZero = false; // Нулевой угол запрещён // Вызов метода GetAngle, запрашивающего угол у пользователя PromptDoubleResult result = editor.GetAngle(options); if (result.Status == PromptStatus.OK) { double angleInRadians = result.Value; double angleInDegrees = result.Value * 180 / Math.PI; editor.WriteMessage($"\nВведен угол: {angleInRadians} радиан или {angleInDegrees} градусов"); } else if (result.Status == PromptStatus.None) { editor.WriteMessage("\nНулевой угол запрещён."); } else { editor.WriteMessage("\nОперация отменена."); } } }
 Ссылки
 HostMgd.EditorInput.PromptAngleOptions, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!