Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptSelectionOptions.Keywords
 Послать отзыв
 Свойство предоставляет доступ к коллекции ключевых слов, доступных для выбора при операции ввода.
 Синтаксис
C#
Visual Basic
Копировать Код
public KeywordCollection Keywords { get; }
Копировать Код
Public ReadOnly Property Keywords As KeywordCollection
 Возвращает
 Возвращает объект типа KeywordCollection — изменяемую коллекцию строк, представляющих ключевые слова.
Если коллекция пуста — пользователь не имеет вариантов выбора (кроме глобальных команд).
Каждое ключевое слово должно быть корректной строкой без пробелов.
Первое добавленное ключевое слово может быть установлено как значение по умолчанию через свойство Default.
 Описание
 Свойство предоставляет доступ к объекту типа KeywordCollection, содержащему список ключевых слов, которые могут быть введены пользователем в ходе интерактивной команды выбора объекта. Эти слова отображаются в командной строке в формате [Ключ1/Ключ2/Ключ3] и позволяют пользователю выбрать действие из предложенных вариантов: например, "Да/Нет", "Включить/Отключить", "Все/Фильтр".
 Условия
 Только чтение
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("PromptSelectionOptionsExample_Keywords")] public void PromptSelectionOptionsExample_Keywords() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создаём набор параметров для запроса PromptSelectionOptions options = new PromptSelectionOptions(); options.MessageForAdding = "Выберите линии для объединения:"; // Разрешить выбор части объекта options.AllowSubSelections = true; // Только сегмент, не вся полилиния options.ForceSubSelections = true; // Добавление ключевых слов options.Keywords.Add("Все"); options.Keywords.Add("Группа"); options.Keywords.Add("Фильтр"); // Установка значения по умолчанию options.Keywords.Default = "Все"; // Фильтр: только объекты типа Line TypedValue[] filterList = new TypedValue[] { new TypedValue((int)DxfCode.Start, "LINE") }; SelectionFilter filter = new SelectionFilter(filterList); // Создаём запрос пользователю PromptSelectionResult result = editor.GetSelection(options, filter); // Если все данные введены, выводим результат в командную строку if (result.Status == PromptStatus.OK) { SelectionSet selSet = result.Value; editor.WriteMessage( $"\nВыбрано объектов: {selSet.Count}"); } else { editor.WriteMessage( "\nНе удалось получить выделение."); } } }
 Ссылки
 HostMgd.EditorInput.PromptSelectionOptions, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!