Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.InplaceTextEditor.AddUndoMarker
 Послать отзыв
 Метод добавляет маркер отмены в очередь отмены действий данного объекта. В текущей версии не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public void AddUndoMarker( InplaceTextEditor.TextUndoType undoType );
Копировать Код
Public Sub AddUndoMarker( undoType As InplaceTextEditor.TextUndoType )
 Параметры
 Параметры
 Описание
 undoType
 Тип маркера отмены из перечисления InplaceTextEditor.TextUndoType.
 Описание
 Метод AddUndoMarker() добавляет маркер отмены в очередь отмены действий данного объекта. В текущей версии не реализован.
 Ссылки
 HostMgd.ApplicationServices.InplaceTextEditor, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!