Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Publisher.PublishExecute
 Послать отзыв
 This is PublishExecute, a member of class Publisher.
 Синтаксис
C#
Visual Basic
public void PublishExecute(ref HostMgd::PlottingServices::DsdData dsdData, ref HostMgd::PlottingServices::PlotConfig plotConfig);
Public Sub PublishExecute(ByRef dsdData As HostMgd.PlottingServices.DsdData, ByRef plotConfig As HostMgd.PlottingServices.PlotConfig)
 Ссылки
 Publisher Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!