Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptDoubleResultEventArgs
 Послать отзыв
 Класс предоставляет данные для событий, возникающих после завершения пользовательского ввода числового значения типа double, например, угла или расстояния.
 Иерархия классов
HostMgd::EditorInput::PromptDoubleResultEventArgs
 Синтаксис
C#
Visual Basic
Копировать Код
public class PromptDoubleResultEventArgs : EventArgs
Копировать Код
Public Class PromptDoubleResultEventArgs Inherits EventArgs
 Описание
 Класс наследуется от EventArgs и используется в .NET API nanoCAD как тип данных события, связанных с интерактивным вводом чисел. Он содержит информацию о результате операции: значение типа double, статус выполнения (успех, отмена, ошибка), а также строковое представление введённого значения. Объект этого класса передаётся обработчику события, такого как PromptedForAngle, PromptedForDistance и другие, предоставляя разработчику доступ к результату ввода пользователя.
 Замечания
 Этот класс применяется совместно с делегатом PromptDoubleResultEventHandler и используется для анализа или обработки результата ввода числа в контексте редактора nanoCAD.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события PromptedForAngle [Teigha.Runtime.CommandMethod("PromptedForAngleExample")] public void PromptedForAngleExample() { // Подписка на событие PromptedForAngle editor.PromptedForAngle += OnEditorPromptedForAngle; } // Реализация отработки события PromptedForAngle private void OnEditorPromptedForAngle(object sender, PromptDoubleResultEventArgs e) { // Вывод сообщения в командную строку if (e.Result.Status == PromptStatus.OK) { editor.WriteMessage( $"\nВведённый угол (радианы): {e.Result.Value}"); } else { editor.WriteMessage( "\nВвод угла отменён или произошла ошибка."); } } }
 Топики
 Имя
 Описание
 PromptDoubleResultEventArgs Свойства
 Ниже перечислены свойства класса PromptDoubleResultEventArgs.
 Ссылки
 PromptDoubleResultEventArgs Свойства, Топики, PromptDoubleResultEventArgs Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!