Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Класс HostMgd.EditorInput.PickPointSelectedObject
 Послать отзыв
 Иерархия классов
HostMgd::EditorInput::SelectedObject HostMgd::EditorInput::PickPointSelectedObject
 Синтаксис
C#
Visual Basic
public class PickPointSelectedObject : SelectedObject;
Public Class PickPointSelectedObject Inherits SelectedObject
 Описание
 Класс, описывающий подобъект, который выбранн по одиночной точке выбора.
 Методы
 Конструкторы
 Класс HostMgd.EditorInput.PickPointSelectedObject
 Имя
 Описание
 PickPointSelectedObject
 Топики
 Имя
 Описание
 SelectedObject Методы
 Ниже перечислены методы класса SelectedObject.
 SelectedObject Свойства
 Ниже перечислены свойства класса SelectedObject.
 Класс HostMgd.EditorInput.PickPointSelectedObject
 Имя
 Описание
 PickPointSelectedObject Методы
 Ниже перечислены методы класса PickPointSelectedObject.
 PickPointSelectedObject Свойства
 Ниже перечислены свойства класса PickPointSelectedObject.
 Ссылки
 PickPointSelectedObject Методы, PickPointSelectedObject Свойства, Методы, Топики, SelectedObject Методы, SelectedObject Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!