Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.BeginPlotEventHandler(Object, BeginPlotEventArgs)
 Послать отзыв
 Делегат BeginPlotEventHandler предназначен для обработки события PlotReactorManager.BeginPlot, возникающего перед началом вывода на плоттер
 Синтаксис
C#
Visual Basic
Копировать Код
public delegate void BeginPlotEventHandler( Object sender, BeginPlotEventArgs e );
Копировать Код
Public Delegate Sub BeginPlotEventHandler( sender As Object, e As BeginPlotEventArgs )
 Параметры
 Параметры
 Описание
 sender
 Объект, инициировавший событие. Тип Object.
 e
 Аргументы события. Тип BeginPlotEventArgs.
 Описание
 Делегат BeginPlotEventHandler предназначен для обработки события PlotReactorManager.BeginPlot, возникающего перед началом вывода на плоттер.
 Контекст события передается через параметры sender и e, где sender определяет объект-инициатор события, а аргумент e типа BeginPlotEventArgs передает объекты PlotProgress и PlotType, которые определяют поведение диалога прогресса печати и тип печати, соответственно.
 Ваши комментарии по поводу этого топика: Послать отзыв!