Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство LineWeightDialog.IncludeByBlockByLayer
 Послать отзыв
 This is IncludeByBlockByLayer, a member of class LineWeightDialog.
 Синтаксис
C#
Visual Basic
public bool IncludeByBlockByLayer;
Public Property IncludeByBlockByLayer() As bool
 Ссылки
 LineWeightDialog Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!