Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Publisher.FireBeginSheet
 Послать отзыв
 This is FireBeginSheet, a member of class Publisher.
 Синтаксис
C#
Visual Basic
public void FireBeginSheet(ref HostMgd::Publishing::PublishSheetEventArgs e);
Public Sub FireBeginSheet(ByRef e As HostMgd.Publishing.PublishSheetEventArgs)
 Ссылки
 Publisher Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!