Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Pane.MaximumWidth
 Послать отзыв
 This is MaximumWidth, a member of class Pane.
 Синтаксис
C#
Visual Basic
public int MaximumWidth;
Public Property MaximumWidth() As Integer
 Ссылки
 Pane Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!