Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Класс HostMgd.EditorInput.Keyword
 Послать отзыв
 Иерархия классов
HostMgd::EditorInput::Keyword
 Синтаксис
C#
Visual Basic
public class Keyword;
Public Class Keyword
 Описание
 Класс определяет ключ в запросе при вводе значений пользователем
 Методы
 Конструкторы
 Имя
 Описание
 Keyword
 This is Keyword, a member of class Keyword.
 Топики
 Имя
 Описание
 Keyword Свойства
 Ниже перечислены свойства класса Keyword.
 Ссылки
 Keyword Свойства, Методы, Топики, Keyword Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!