Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.InputPointContext.ObjectSnappedPoint
 Послать отзыв
 Свойство предназначено для получения координат точки, к которой была выполнена объектная привязка (OSNAP), если таковая активирована и вычислена.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d ObjectSnappedPoint;
Копировать Код
Public Property ObjectSnappedPoint() As Point3d
 Возвращает
 Возвращает объект типа Point3d — координаты точки, полученной в результате объектной привязки.
 Если OSNAP активен и точка вычислена — содержит корректные координаты. Если привязка не применялась — значение может быть неопределённым или совпадать с RawPoint. Для надёжного использования необходимо проверять флаг в History:
C#
 Копировать Код
if ((context.History & PointHistoryBits.ObjectSnapped) != 0) { Point3d osnapPoint = context.ObjectSnappedPoint; // Использовать как привязанную точку }
 Описание
 Свойство предоставляет точку в мировой системе координат (WCS), которая была скорректирована с учётом объектной привязки — например, привязка к конечной точке линии, центру окружности или точке пересечения. Значение доступно только при одновременном выполнении двух условий:
Система завершила расчёт точки (pointComputed == true),
В истории ввода установлен флаг Osnapped, указывающий на использование OSNAP.
 Это свойство используется в обработчиках событий PointMonitor и PointFilter для определения фактического положения привязанной точки, что позволяет:
корректно отображать динамические подсказки,
выполнять дополнительные вычисления относительно привязанного положения,
избегать конфликтов между пользовательскими и системными режимами привязки.
 В отличие от ComputedPoint, которое может включать сетку, полярные направления и другие режимы, ObjectSnappedPoint отражает чистую привязку к геометрии объекта.
 Свойство устанавливается системой nanoCAD автоматически.
 Условия
 Только чтение
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class InputPointContextExamples { // Метод команды, которая получает координаты точки, // к которой была выполнена объектная привязка (OSNAP), // если таковая активирована и вычислена [Teigha.Runtime.CommandMethod("ObjectSnappedPointExample")] public void ObjectSnappedPointExample() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Метод для отработки события редактора PointMonitor editor.PointMonitor += (sender, e) => { // Сохраняем контекст события в преременную InputPointContext context = e.Context; // Выводим в комнадную строку полученные данные if (context != null && (context.History & PointHistoryBits.ObjectSnapped) != 0) { Point3d snapPt = context.ObjectSnappedPoint; editor.WriteMessage($"\nТочка привязки: {snapPt}"); } }; } }
 Ссылки
 HostMgd.EditorInput.InputPointContext, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!