Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Структура HostMgd.ApplicationServices.POINTL
 Послать отзыв
 Description
 Синтаксис
C#
Visual Basic
public struct POINTL { public long x; public long y; }
Public Structure POINTL Public x As long Public y As long End Structure
 Ваши комментарии по поводу этого топика: Послать отзыв!