Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство MenuItemCollection.IsFixedSize
 Послать отзыв
 This is IsFixedSize, a member of class MenuItemCollection.
 Синтаксис
C#
Visual Basic
public bool IsFixedSize;
Public Property IsFixedSize() As bool
 Ссылки
 MenuItemCollection Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!