Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор JigPromptStringOptions.JigPromptStringOptions ()
 Послать отзыв
 Конструктор класса без параметров.
 Синтаксис
C#
Visual Basic
public JigPromptStringOptions();
Public Sub New()
 Описание
 Конструктор класса. Присваивает свойству Message пустую строку. Также устанавливает значение свойства Cursor равное CursorType.Crosshair (перекрестие). Настройки пользовательского ввода из свойства UserInputControls остаются по умолчанию.
 Ссылки
 JigPromptStringOptions Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!