Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Publisher.FireAboutToMoveFile
 Послать отзыв
 This is FireAboutToMoveFile, a member of class Publisher.
 Синтаксис
C#
Visual Basic
public void FireAboutToMoveFile(ref HostMgd::Publishing::PublishEventArgs e);
Public Sub FireAboutToMoveFile(ByRef e As HostMgd.Publishing.PublishEventArgs)
 Ссылки
 Publisher Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!