Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Событие Publisher.EndSheet
 Послать отзыв
 This is EndSheet, a member of class Publisher.
 Синтаксис
C#
Visual Basic
public event EndSheetEventHandler EndSheet;
Public Event EndSheet As EndSheetEventHandler
 Ссылки
 Publisher Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!