Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptDistanceOptions.PromptDistanceOptions(string,string)
 Послать отзыв
 Конструктор инициализирует новый экземпляр класса с заданным сообщением, включающим локальные ключевые слова, и списком глобальных ключевых слов.
 Синтаксис
C#
Visual Basic
Копировать Код
public PromptDistanceOptions(string messageAndKeywords, string globalKeywords);
Копировать Код
Public Sub New(messageAndKeywords As String, globalKeywords As String)
 Параметры
 Параметры
 Описание
 messageAndKeywords
 Строка, содержащая текст приглашения и, опционально, список локальных ключевых слов в формате [Ключ1/Ключ2]. Эти слова отображаются как возможные варианты выбора. Тип string
 globalKeywords
 Строка, содержащая глобальные ключевые слова, разделённые пробелом. Они остаются доступными на протяжении всей команды, даже если не указаны в основном сообщении. Тип string
 Описание
 Конструктор создаёт объект класса PromptDistanceOptions, предназначенный для настройки интерактивного ввода расстояния с поддержкой выбора из ключевых слов. Он позволяет указать:
сообщение приглашения , в которое можно включить локальные ключевые слова в квадратных скобках (например: "Введите расстояние [короткое/длинное]:"),
глобальные ключевые слова , доступные в любой момент операции (например: "Cancel Exit"), независимо от контекста ввода.
 Этот конструктор особенно полезен при разработке команд, где требуется предоставить пользователю выбор между предопределёнными режимами или действиями во время ввода расстояния.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { [Teigha.Runtime.CommandMethod("PromptDistanceOptionsExample_string_string")] public void PromptDistanceOptionsExample_string_string() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создаём запрос пользователю PromptDistanceOptions options = new PromptDistanceOptions( "Введите расстояние [Стандарт/Минимум]:", "Standard Minimum"); // Устанавливаем значение по умолчанию и разрешаем использовать его options.DefaultValue = 100.0; options.UseDefaultValue = true; // Разрешаем использовать Enter, не вводя значений. // В этом случае применится значение по умолчанию options.AllowNone = true; PromptDoubleResult result = editor.GetDistance(options); // Если данные введены, выводим результат в командную строку if (result.Status == PromptStatus.OK) { double distance = result.Value; editor.WriteMessage( $"\nВведено расстояние: {distance}"); } else if (result.Status == PromptStatus.Keyword) { editor.WriteMessage($"\nВыбрано: {result.StringResult}"); } } }
 Ссылки
 HostMgd.EditorInput.PromptDistanceOptions, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!