Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Visuals.PickSetBitmap
 Послать отзыв
 This is PickSetBitmap, a member of class Visuals.
 Синтаксис
C#
Visual Basic
public Teigha::DatabaseServices::Image PickSetBitmap;
Public Property PickSetBitmap() As Teigha.DatabaseServices.Image
 Ссылки
 Visuals Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!