Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод XrefFileLock.ReloadFile (int)
 Послать отзыв
 Синтаксис
C#
Visual Basic
public void ReloadFile(int xldCtlType);
Public Sub ReloadFile(xldCtlType As Integer)
 Параметры
 Параметры
 Описание
 xldCtlType
 Список ID
 Описание
 Перезагрузка соответствующего файла (ов) по внешней ссылке по списку ID записей таблицы блоков (рассинхронизированных) для текущего чертежа. После этого (т.е. после перезагрузки самих файлов внешних ссылок) файлы внешних ссылок будут снова синхронизированы для всех внешних ссылок.
 Параметр xldCtlType разрешает установить системную переменую XLOADCTL для задания режима перезагрузки. Если этот параметр не указан, то используется значение по умолчанию переменной XLOADCTL.
 В настоящее время системная переменная XLOADCTL отсутствует в nanoCAD.
 Ссылки
 XrefFileLock Класс, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!