Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.DsdEntryCollection.CopyTo
 Послать отзыв
 Метод копирует все элементы данной коллекции в указанный одномерный массив типа HostMgd.PlottingServices.DsdEntry[].
 Синтаксис
C#
Visual Basic
Копировать Код
public void CopyTo( ref HostMgd.PlottingServices.DsdEntry[] a, int index );
Копировать Код
Public Sub CopyTo( ByRef a() As HostMgd.PlottingServices.DsdEntry, index As Integer )
 Параметры
 Параметры
 Описание
 a
 Целевой массив, в который копируются элементы коллекции. Тип HostMgd.PlottingServices.DsdEntry[].
 index
 Входной индекс в целевом массиве a, начиная с которого в массив копируются элементы коллекции. Тип int.
 Описание
 Метод копирует все элементы данной коллекции в указанный одномерный массив, начиная с указанного индекса в этом массиве.
 Ссылки
 HostMgd.PlottingServices.DsdEntryCollection, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!