Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.PromptingForString
 Послать отзыв
 Событие возникает при начале операции ввода строки, позволяя настроить параметры приглашения до начала ввода. Событие не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public event PromptStringOptionsEventHandler PromptingForString;
Копировать Код
Public Event PromptingForString As PromptStringOptionsEventHandler
 Описание
 Событие инициируется перед началом интерактивного ввода текстовой строки — например, при вызове метода GetString() или команды, требующей ввода текста. Оно предоставляет доступ к параметрам ввода через объект PromptStringOptionsEventArgs, что позволяет разработчику динамически изменять:
текст приглашения (Message),
ключевые слова (Keywords),
разрешение на пустой ввод (AllowNone),
режим ввода (например, только ключевые слова или произвольный текст).
 Событие реализуется через делегат PromptStringOptionsEventHandler и вызывается до отображения запроса пользователю, что позволяет адаптировать параметры ввода в реальном времени.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события PromptingForString [Teigha.Runtime.CommandMethod("PromptingForStringExample")] public void PromptingForStringExample() { // Подписка на событие PromptingForString editor.PromptingForString += OnEditorPromptingForString; } // Реализация отработки события PromptingForString private void OnEditorPromptingForString(object sender, PromptStringOptionsEventArgs e) { // Изменение сообщения приглашения e.Options.Message = "Введите имя стиля текста:"; // Добавление ключевых слов e.Options.Keywords.Add("По умолчанию"); e.Options.Keywords.Add("Новый"); e.Options.Keywords.Add("Текущий"); } }
 Порядок работы с событием:
Вызывается метод GetString() или аналогичный.
Перед началом ввода генерируется событие PromptingForString.
Разработчик может изменить параметры через e.Options.
Пользователь вводит строку или выбирает ключевое слово.
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!