Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство ColorDialog.IncludeByBlockByLayer
 Послать отзыв
 This is IncludeByBlockByLayer, a member of class ColorDialog.
 Синтаксис
C#
Visual Basic
public bool IncludeByBlockByLayer;
Public Property IncludeByBlockByLayer() As bool
 Ссылки
 ColorDialog Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!