Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PlotStyleDialog.PlotStyle
 Послать отзыв
 This is PlotStyle, a member of class PlotStyleDialog.
 Синтаксис
C#
Visual Basic
public System.String PlotStyle;
Public Property PlotStyle() As System.String
 Ссылки
 PlotStyleDialog Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!