Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор Window.Window (CWnd *, bool)
 Послать отзыв
 This is Window, a member of class Window.
 Синтаксис
C#
Visual Basic
public Window(ref CWnd pWnd, bool autoDelete);
Public Sub New(ByRef pWnd As CWnd, autoDelete As bool)
 Ссылки
 Window Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!