Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptForEntityEndingEventArgs
 Послать отзыв
 Класс предоставляет данные для события PromptForEntityEnding, возникающего при завершении операции выбора геометрического объекта в редакторе nanoCAD.
 Иерархия классов
HostMgd::EditorInput::PromptForEntityEndingEventArgs
 Синтаксис
C#
Visual Basic
Копировать Код
public sealed class PromptForEntityEndingEventArgs : EventArgs, IDisposable
Копировать Код
Public NotInheritable Class PromptForEntityEndingEventArgs Inherits EventArgs Implements IDisposable
 Описание
 Класс наследуется от EventArgs и реализует интерфейс IDisposable. Он используется для передачи контекстной информации при завершении операции выбора объекта — например, после вызова методов GetEntity() или других команд, где пользователь указывает на элемент чертежа. Объект этого класса содержит результат выборки (идентификатор объекта, точку выбора и статус), что позволяет обработать эти данные до окончательного применения.
 Класс создаётся системой при возникновении события PromptForEntityEnding и должен быть корректно освобождён после использования, так как реализует IDisposable.
 Замечания
 Этот класс применяется для пост-обработки выбора объекта — позволяет получить доступ к результату выборки и при необходимости изменить его или выполнить дополнительные действия перед тем, как результат будет использован в команде.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события PromptForEntityEnding [Teigha.Runtime.CommandMethod("PromptForEntityEndingExample")] public void PromptForEntityEndingExample() { // Подписка на событие PromptForEntityEnding editor.PromptForEntityEnding += OnEditorPromptForEntityEnding; } // Реализация отработки события PromptForEntityEnding private void OnEditorPromptForEntityEnding(object sender, PromptForEntityEndingEventArgs e) { if (!e.Result.ObjectId.IsNull) { // Вывод сообщения в командную строку editor.WriteMessage( $"\nВыбран объект: {e.Result.ObjectId.ObjectClass.Name}"); } } }
 Топики
 Имя
 Описание
 PromptForEntityEndingEventArgs Методы
 Ниже перечислены методы класса PromptForEntityEndingEventArgs.
 PromptForEntityEndingEventArgs Свойства
 Ниже перечислены свойства класса PromptForEntityEndingEventArgs.
 Ссылки
 PromptForEntityEndingEventArgs Методы, PromptForEntityEndingEventArgs Свойства, Топики, PromptForEntityEndingEventArgs Методы, PromptForEntityEndingEventArgs Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!