Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptDistanceOptionsEventArgs
 Послать отзыв
 Класс предоставляет данные для события PromptingForDistance и позволяет настроить параметры ввода расстояния перед началом интерактивной операции.
 Иерархия классов
HostMgd::EditorInput::PromptDistanceOptionsEventArgs
 Синтаксис
C#
Visual Basic
Копировать Код
public sealed class PromptDistanceOptionsEventArgs : EventArgs
Копировать Код
Public NotInheritable Class PromptDistanceOptionsEventArgs Inherits EventArgs
 Описание
 Класс наследуется от EventArgs и используется в .NET API nanoCAD для передачи параметров ввода расстояния в обработчик события PromptingForDistance. Он предоставляет доступ к объекту PromptDistanceOptions, который содержит настройки, передаваемые в команду ввода расстояния — такие как:
текст приглашения (Message),
начальное значение (DefaultValue),
допустимый диапазон (LowerLimit, UpperLimit),
режимы ввода (AllowNone, AllowNegative, AllowAngle и др.).
 Этот класс позволяет разработчикам надстроек динамически изменять параметры команды ввода расстояния в зависимости от контекста или состояния чертежа.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события PromptingForDistance [Teigha.Runtime.CommandMethod("PromptingForDistanceExample")] public void PromptingForDistanceExample() { // Подписка на событие PromptingForDistance editor.PromptingForDistance += OnEditorPromptingForDistance; } // Реализация отработки события PromptingForDistance private void OnEditorPromptingForDistance(object sender, PromptDistanceOptionsEventArgs e) { // Установка начального значения расстояния e.Options.DefaultValue = 100.0; // Задание сообщения приглашения e.Options.Message = "Введите расстояние для смещения:"; } }
 Топики
 Имя
 Описание
 PromptDistanceOptionsEventArgs Свойства
 Ниже перечислены свойства класса PromptDistanceOptionsEventArgs.
 Ссылки
 PromptDistanceOptionsEventArgs Свойства, Топики, PromptDistanceOptionsEventArgs Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!