Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор TrayItem.TrayItem
 Послать отзыв
 This is TrayItem, a member of class TrayItem.
 Синтаксис
C#
Visual Basic
public TrayItem();
Public Sub New()
 Ссылки
 TrayItem Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!