Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.RecentDocument.Path
 Послать отзыв
 Свойство Path представляет путь к файлу, связанному с документом. В текущей версии данное свойство не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public System.String Path;
Копировать Код
Public ReadOnly Property Path As System.String
 Возвращает
 Возвращает путь к файлу документа. Тип System.String.
 Описание
 Свойство Path представляет путь к файлу, связанному с документом.
 В текущей версии данное свойство не реализовано.
 Условия
 Только чтение.
 Ссылки
 HostMgd.ApplicationServices.RecentDocument, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!