Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptEntityOptions.AllowObjectOnLockedLayer
 Послать отзыв
 Свойство определяет, разрешён ли выбор геометрических объектов, расположенных на заблокированных слоях.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool AllowObjectOnLockedLayer { get; set; }
Копировать Код
Public Property AllowObjectOnLockedLayer As Boolean
 Возвращает
 Возвращает значение типа bool:
true — объекты на заблокированных слоях могут быть выбраны.
false — выбор объектов на заблокированных слоях запрещён.
 Описание
 Свойство используется для управления возможностью выбора объектов, принадлежащих слоям с состоянием "заблокирован". По умолчанию в nanoCAD объекты на заблокированных слоях нельзя редактировать или выбирать — это защита от случайных изменений.
 Если свойство установлено в true, пользователь может выбрать объект на заблокированном слое, даже если он не может быть изменён. Это полезно в командах, где требуется только чтение свойств объекта — например, анализ, измерение, копирование или получение информации.
 Если false (значение по умолчанию), попытка выбрать объект на заблокированном слое будет отклонена, и система может выдать сообщение об ошибке или проигнорировать выбор.
 Условия
 Чтение и запись
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("PromptEntityOptions_AllowObjectOnLockedLayer")] public void PromptEntityOptions_AllowObjectOnLockedLayer() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создаём запрос пользователю PromptEntityOptions options = new PromptEntityOptions("\nВыберите объект:"); // Разрешаем выбор даже на заблокированных слоях options.AllowObjectOnLockedLayer = true; PromptEntityResult result = editor.GetEntity(options); // Если все данные введены, выводим результат в командную строку if (result.Status == PromptStatus.OK) { editor.WriteMessage( $"\nВыбран объект с ID: {result.ObjectId}, точка: {result.PickedPoint}"); } else { editor.WriteMessage( "\nОперация выбора отменена или объект не найден."); } } }
 Ссылки
 HostMgd.EditorInput.PromptEntityOptions, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!