Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.PromptedForKeyword
 Послать отзыв
 Событие возникает после завершения операции ввода ключевого слова пользователем в редакторе nanoCAD. Событие не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public event PromptStringResultEventHandler PromptedForKeyword;
Копировать Код
Public Event PromptedForKeyword As PromptStringResultEventHandler
 Описание
 Событие инициируется, когда пользователь завершает ввод одного из допустимых ключевых слов через интерактивное приглашение — например, после вызова метода GetString() с заданным списком ключевых слов. Это событие позволяет получить результат ввода, включая введённое слово и статус операции (OK, Cancel, Error и др.).
 Событие используется в надстройках и плагинах для реакции на ввод пользователем определённых команд или параметров, таких как "Да/Нет", "Открыть/Сохранить" и т. д. Оно реализуется через делегат PromptStringResultEventHandler, который передаёт данные в виде объекта PromptStringResultEventArgs.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события PromptedForKeyword [Teigha.Runtime.CommandMethod("PromptedForKeywordExample")] public void PromptedForKeywordExample() { // Подписка на событие PromptedForKeyword editor.PromptedForKeyword += OnEditorPromptedForKeyword; } // Реализация отработки события PromptedForKeyword  private void OnEditorPromptedForKeyword(object sender, PromptStringResultEventArgs e) { // Вывод сообщения в командную строку if (e.Result.Status == PromptStatus.OK) { editor.WriteMessage($"\nВведено ключевое слово: {e.Result.StringResult}"); } else { editor.WriteMessage("\nВвод ключевого слова отменён."); } } }
 Порядок работы с событием:
Вызывается метод GetString() с настроенными ключевыми словами.
Пользователь вводит слово или выбирает его из списка.
После завершения ввода генерируется событие PromptedForKeyword.
Разработчик может обработать введённое значение или отмену операции.
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!