Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Делегат HostMgd.Publishing.BeginSheetEventHandler
 Послать отзыв
 This is type HostMgd::Publishing::BeginSheetEventHandler.
 Синтаксис
C#
Visual Basic
public delegate BeginSheetEventHandler();
Public Delegate Sub BeginSheetEventHandler()
 Ваши комментарии по поводу этого топика: Послать отзыв!