Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PublishSheetEventArgs.IsPlotJobCancelled
 Послать отзыв
 This is IsPlotJobCancelled, a member of class PublishSheetEventArgs.
 Синтаксис
C#
Visual Basic
public bool IsPlotJobCancelled;
Public Property IsPlotJobCancelled() As bool
 Ссылки
 PublishSheetEventArgs Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!