Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PrintForm.CancelSheetShow
 Послать отзыв
 This is CancelSheetShow, a member of class PrintForm.
 Синтаксис
C#
Visual Basic
public bool CancelSheetShow;
Public Property CancelSheetShow() As bool
 Ссылки
 PrintForm Класс, Пространство имен HostMgd
 Ваши комментарии по поводу этого топика: Послать отзыв!