Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство InfoCenter.Host
 Послать отзыв
 This is Host, a member of class InfoCenter.
 Синтаксис
C#
Visual Basic
public HwndSource Host;
Public Property Host() As HwndSource
 Ссылки
 InfoCenter Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!