Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.InplaceTextEditor.ToolbarOptionHidden
 Послать отзыв
 Свойство ToolbarOptionHidden позволяет управлять отображением опции панели инструментов. В текущей версии не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool ToolbarOptionHidden;
Копировать Код
Public Property ToolbarOptionHidden As Boolean
 Возвращает
 Возвращает true, если опция панели инструментов не отображается. В противном случае возвращает false.
 Описание
 Свойство ToolbarOptionHidden позволяет управлять отображением опции панели инструментов. В текущей версии не реализовано.
 Условия
 Чтение и запись.
 Ссылки
 HostMgd.ApplicationServices.InplaceTextEditor, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!