Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 JigPrompts.AcquireString(JigPromptStringtOptions)
 Послать отзыв
 Метод запрашивает у пользователя строку/текстовые данные, используя при запросе свойства класса JigPromptStringOptions
 Синтаксис
C#
Visual Basic
public HostMgd.EditorInput.PromptResult AcquireString(ref HostMgd.EditorInput.JigPromptStringOptions options);
Public Function AcquireString(ByRef options As HostMgd.EditorInput.JigPromptStringOptions) As HostMgd.EditorInput.PromptResult
 Параметры
 Параметры
 Описание
 options
 Набор данных типа JigPromptStringOptions, которые используются при запросе.
 Возвращает
 Возвращает результат типа string, который является строкой, введенной пользователем с клавиатуры в ответ на запрос.
 Описание
 Метод предназначен для запроса у пользователя текстовых данных, которые необходимо ввести с клавиатуры.
 Пример
 В примере приведен отрывок кода из реализации метода Sampler() класса Jig.
C#
 Копировать Код
 JigPromptStringOptions stringOptions = new JigPromptStringOptions("Текст:"); PromptResult result = prompts.AcquireString(stringOptions);
Visual Basic
 Копировать Код
 Dim stringOptions As JigPromptStringOptions = New JigPromptStringOptions("Текст:") Dim result As PromptResult = prompts.AcquireString(stringOptions)
 Ссылки
 JigPrompts Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!