Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.PlotType
 Послать отзыв
 Данное перечисление определяет поддерживаемые режимы вывода на печать.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum PlotType { Plot = 0, Preview = 1, BackgroundPackaging = 2, BackgroundPlot = 3 }
Копировать Код
Public Enum PlotType Plot = 0 Preview = 1 BackgroundPackaging = 2 BackgroundPlot = 3 End Enum
 Члены
 Члены
 Описание
 BackgroundPackaging
 Значение: 2. Печать комплекта чертежей в фоновом режиме.
 BackgroundPlot
 Значение: 3. Печать в фоновом режиме.
 Plot
 Значение: 0. Стандартный режим печати (не фоновый).
 Preview
 Значение: 1. Режим предварительной печати (образец).
 Описание
 Перечисление PlotType определяет поддерживаемые режимы вывода на печать.
 Ваши комментарии по поводу этого топика: Послать отзыв!