Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор SelectionFilter.SelectionFilter
 Послать отзыв
 Синтаксис
C#
Visual Basic
public SelectionFilter(ref array<Teigha::DatabaseServices::TypedValue> value);
Public Sub New(ByRef value As array<Teigha.DatabaseServices.TypedValue>)
 Параметры
 Параметры
 Описание
 value
 Опиание назначения парамтра приведено в описании класса
 Описание
 Конструктор класса.
 Ссылки
 SelectionFilter Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!