Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PromptFileOptions.InitialDirectory
 Послать отзыв
 Синтаксис
C#
Visual Basic
public System.String InitialDirectory;
Public Property InitialDirectory() As System.String
 Описание
 Возвращает или устанавливает строку с начальным каталогом (в диалоговом окне поиска имени файла).
 Условия
 На чтение и запись
 Ссылки
 PromptFileOptions Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!