Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.GraphicsSystem.Manager.CreateAutoCADOffScreenDevice
 Послать отзыв
 Метод создаёт новое устройство как объект Teigha.GraphicsSystem.Device для отрисовки объектов чертежа в невидимом режиме без визуализации в каком-либо отображаемом окне графического интерфейса.
 Синтаксис
C#
Visual Basic
Копировать Код
public Teigha.GraphicsSystem.Device CreateAutoCADOffScreenDevice();
Копировать Код
Public Function CreateAutoCADOffScreenDevice() As Teigha.GraphicsSystem.Device
 Возвращает
 Возвращает созданное устройство графической системы. Тип Teigha.GraphicsSystem.Device.
 Описание
 Метод создаёт новое устройство как объект Teigha.GraphicsSystem.Device, предназначенное для отрисовки объектов чертежа в невидимом режиме без отображения в каком-либо окне графического интерфейса.
 Ссылки
 HostMgd.GraphicsSystem.Manager, HostMgd.GraphicsSystem
 Ваши комментарии по поводу этого топика: Послать отзыв!