Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.Application.ShowModelessDialog(System.Windows.Forms.IWin32Window,System.Windows.Forms.Form,bool)
 Послать отзыв
 МЕТОД НЕ РЕАЛИЗОВАН. Метод предназначен для вызова немодального диалогового окна, построенного с помощью WinForms, с заданным окном-владельцем и признаком сохранения положения и размера окна.
 Синтаксис
C#
Visual Basic
Копировать Код
Public Shared Sub ShowModelessDialog(owner As System.Windows.Forms.IWin32Window, formToShow As System.Windows.Forms.Form, persistSizeAndPosition As Boolean)
Копировать Код
Public Shared Sub ShowModelessDialog(owner As System.Windows.Forms.IWin32Window, formToShow As System.Windows.Forms.Form, persistSizeAndPosition As Boolean)
 Параметры
 Параметры
 Описание
 owner
 Окно владельца диалога
 formToShow
 Форма, которая должна быть отображена
 persistSizeAndPosition
 Сохранять или нет позицию и размеры окна
 Описание
 Метод отображает немодальный диалог, построенный на WinForms, у которого указано окно-владелец и признак сохранения положения и размера. Необходимо пользоваться именно этим методом вместо метода Form.Show, который может привести к непредсказуемому результату.
 Ссылки
 HostMgd.ApplicationServices.Application, HostMgd.ApplicationServices Пространство имен
 Исключения
 MGD NOT_IMPLEMENTED
 Ваши комментарии по поводу этого топика: Послать отзыв!