Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор Keyword.Keyword
 Послать отзыв
 This is Keyword, a member of class Keyword.
 Синтаксис
C#
Visual Basic
public Keyword(ref HostMgd::EditorInput::KeywordCollection parent);
Public Sub New(ByRef parent As HostMgd.EditorInput.KeywordCollection)
 Ссылки
 Keyword Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!