Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.GraphicsSystem.Manager.SetViewportFromView
 Послать отзыв
 Метод позволяет переопределить настройки видового экрана на основе параметров указанного вида GS.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetViewportFromView( int viewportNumber, ref Teigha.GraphicsSystem.View view );
Копировать Код
Public Sub SetViewportFromView( viewportNumber As Integer, ByRef view As Teigha.GraphicsSystem.View )
 Параметры
 Параметры
 Описание
 viewportNumber
 Входной номер переопределяемого видового экрана. Тип int.
 view
 Вид, который служит источником значений параметров для видового экрана. Тип Teigha.GraphicsSystem.View.
 Описание
 Метод позволяет переопределить параметры указанного видового экрана на основе параметров вида GS view.
 Ссылки
 HostMgd.GraphicsSystem.Manager, HostMgd.GraphicsSystem
 Ваши комментарии по поводу этого топика: Послать отзыв!