Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство StatusBar.TrayItems
 Послать отзыв
 This is TrayItems, a member of class StatusBar.
 Синтаксис
C#
Visual Basic
public TrayItemCollection TrayItems;
Public Property TrayItems() As TrayItemCollection
 Ссылки
 StatusBar Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!