Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.SelectionSetDelayMarshalled.get_Item
 Послать отзыв
 Метод предоставляет доступ по индексу к элементам набора выделенных объектов чертежа. Не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public sealed override HostMgd.EditorInput.SelectedObject this[int index];
Копировать Код
Public Overrides NotOverridable ReadOnly Property Item( index As Integer ) As HostMgd.EditorInput.SelectedObject
 Параметры
 Параметры
 Описание
 index
 Входной индекс элемента в наборе выделенных объектов чертежа. Тип int.
 Возвращает
 Возвращает элемент с индексом index в наборе выделенных объектов чертежа. Тип HostMgd.EditorInput.SelectedObject.
 Описание
 Метод предоставляет доступ к элементу с индексом index в наборе выделенных объектов чертежа.
 В текущей версии не реализован.
 Ссылки
 HostMgd.EditorInput.SelectionSetDelayMarshalled, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!