Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.DsdData.ReadDsd
 Послать отзыв
 Метод читает данные из DSD-файла с указанным именем. Не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public void ReadDsd( ref System.String fileName );
Копировать Код
Public Sub ReadDsd( ByRef fileName As System.String )
 Параметры
 Параметры
 Описание
 fileName
 Входное имя файла. Тип System.String.
 Описание
 Метод реализует чтение данных из DSD-файла с именем fileName.
 В текущей версии не реализован.
 Ссылки
 HostMgd.PlottingServices.DsdData, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!