Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод PublishEntityEventArgs.getEntityBlockRefPath
 Послать отзыв
 This is getEntityBlockRefPath, a member of class PublishEntityEventArgs.
 Синтаксис
C#
Visual Basic
public Teigha::DatabaseServices::ObjectIdCollection getEntityBlockRefPath();
Public Function getEntityBlockRefPath() As Teigha.DatabaseServices.ObjectIdCollection
 Ссылки
 PublishEntityEventArgs Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!