Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PublishSheetEventArgs.IsModelLayout
 Послать отзыв
 This is IsModelLayout, a member of class PublishSheetEventArgs.
 Синтаксис
C#
Visual Basic
public bool IsModelLayout;
Public Property IsModelLayout() As bool
 Ссылки
 PublishSheetEventArgs Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!