Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор LinetypeDialog.LinetypeDialog
 Послать отзыв
 This is LinetypeDialog, a member of class LinetypeDialog.
 Синтаксис
C#
Visual Basic
public LinetypeDialog();
Public Sub New()
 Ссылки
 LinetypeDialog Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!