Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PublishEntityEventArgs.Entity
 Послать отзыв
 This is Entity, a member of class PublishEntityEventArgs.
 Синтаксис
C#
Visual Basic
public Teigha::DatabaseServices::Entity Entity;
Public Property Entity() As Teigha.DatabaseServices.Entity
 Ссылки
 PublishEntityEventArgs Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!