Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.DocumentCollection.GetDocument(Database)
 Послать отзыв
 Метод предназначен для поиска dwg-документа в базе данных.
 Синтаксис
C#
Visual Basic
Копировать Код
public Document GetDocument(Teigha.DatabaseServices.Database db);
Копировать Код
Public Function GetDocument( db As Database ) As Document
 Параметры
 Параметры
 Описание
 db
 База данных. Тип Teigha.DatabaseServices.Database
 Возвращает
 Возвращает dwg-документ. Тип Document
 Описание
 Метод предназначен для поиска dwg-документа в базе данных.
 Ссылки
 HostMgd.ApplicationServices.DocumentCollection, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!