Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.PlotMessageIndex
 Послать отзыв
 Перечисление определяет текстовые элементы оформления диалогового окна, предназначенного для отображения хода выполнения задания на печать.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum PlotMessageIndex { DialogTitle = 0, SheetName = 1, SheetNameToolTip = 2, Status = 3, SheetProgressCaption = 4, SheetSetProgressCaption = 5, MessageCanceling = 6, MessageCancelingCurrent = 7, CancelSheetButtonMessage = 8, CancelJobButtonMessage = 9, MessageCount = 10 }
Копировать Код
Public Enum PlotMessageIndex DialogTitle = 0 SheetName = 1 SheetNameToolTip = 2 Status = 3 SheetProgressCaption = 4 SheetSetProgressCaption = 5 MessageCanceling = 6 MessageCancelingCurrent = 7 CancelSheetButtonMessage = 8 CancelJobButtonMessage = 9 MessageCount = 10 End Enum
 Члены
 Члены
 Описание
 CancelJobButtonMessage
 Значение: 9. Строка сообщения для кнопки отмены всего задания на печать в целом.
 CancelSheetButtonMessage
 Значение: 8. Строка сообщения для кнопки отмены задания на печать текущего листа.
 DialogTitle
 Значение: 0. Заголовок диалогового окна, в котором отображается выполнение задания на печать.
 MessageCanceling
 Значение: 6. Сообщение об отмене задания на печать.
 MessageCancelingCurrent
 Значение: 7. Сообщение об отмене задания на печать текущего листа.
 MessageCount
 Значение: 10. Общее количество членов перечисления сообщений печати.
 SheetName
 Значение: 1. Имя листа, который выводится на печать.
 SheetNameToolTip
 Значение: 2. Подсказка, которая должна появляться при наведении указателя мыши на поле с именем листа.
 SheetProgressCaption
 Значение: 4. Заголовок индикатора прогресса печати текущего листа.
 SheetSetProgressCaption
 Значение: 5. Заголовок индикатора прогресса печати подшивки листов.
 Status
 Значение: 3. Состояние процесса печати листа, который выводится на печать.
 Описание
 Перечисление PlotMessageIndex определяет текстовые элементы оформления диалогового окна, предназначенного для отображения хода выполнения задания на печать.
 Ваши комментарии по поводу этого топика: Послать отзыв!