Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PromptCornerOptions.BasePoint
 Послать отзыв
 Синтаксис
C#
Visual Basic
public Teigha::Geometry::Point3d BasePoint;
Public Property BasePoint() As Teigha.Geometry.Point3d
 Описание
 Возвращает или устанавливает базовую точку, используемую в приглашении.
 Условия
 На чтение и запись
 Ссылки
 PromptCornerOptions Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!