Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptPointOptions.PromptPointOptions(string)
 Послать отзыв
 Конструктор инициализирует новый экземпляр класса с заданным сообщением приглашения для ввода точки.
 Синтаксис
C#
Visual Basic
Копировать Код
public PromptPointOptions(string message);
Копировать Код
Public Sub New(message As String)
 Параметры
 Параметры
 Описание
 message
 Текст приглашения, выводимый в командной строке перед вводом точки. Может быть пустым, но обычно содержит инструкцию или запрос. Тип string
 Описание
 Конструктор создаёт объект класса PromptPointOptions и устанавливает текст приглашения, отображаемый пользователю в командной строке при интерактивном вводе точки — например, через метод GetPoint() или GetCorner(). Сообщение может содержать инструкции или подсказки для пользователя, например: "Укажите точку вставки:". После создания объекта можно дополнительно настроить такие параметры, как:
базовая точка (BasePoint),
режимы привязки (UseBasePoint, UseDashedLine),
допустимость пропуска ввода (AllowNone).
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; [Teigha.Runtime.CommandMethod("PromptPointOptionsExample_String")] public void PromptPointOptionsExample_String() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создаём запрос пользователю PromptPointOptions options = new PromptPointOptions("\nУкажите точку:"); PromptPointResult result = editor.GetPoint(options); // Если все данные введены, выводим результат в командную строку if (result.Status == PromptStatus.OK) { Point3d pt = result.Value; editor.WriteMessage( $"\nВыбранная точка: {pt}"); } else { editor.WriteMessage( "\nВвод точки отменен или произошла ошибка."); } }
 Ссылки
 HostMgd.EditorInput.PromptPointOptions, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!