Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.LeavingQuiescentState
 Послать отзыв
 Событие возникает, когда пользователь выходит из состояния покоя и начинает новую активность в редакторе.
 Синтаксис
C#
Visual Basic
Копировать Код
public event System.EventHandler LeavingQuiescentState;
Копировать Код
Public Event LeavingQuiescentState As System.EventHandler
 Описание
 Событие генерируется в момент, когда редактор nanoCAD выходит из спокойного (ожидающего) состояния — например, при поступлении нового пользовательского ввода после завершения предыдущей команды. Оно позволяет отслеживать начало новой операции и выполнять необходимые действия для подготовки к взаимодействию с чертежом. Это событие особенно полезно в надстройках и плагинах, где требуется реагировать на начало активности пользователя.
 Замечания
 Событие реализовано как стандартный EventHandler, не передающий дополнительных данных (EventArgs.Empty).
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события EnteringQuiescentState [Teigha.Runtime.CommandMethod("LeavingQuiescentStateExample")] public void LeavingQuiescentStateExample() { // Подписка на событие редактора LeavingQuiescentState editor.LeavingQuiescentState += OnEditorLeavingQuiescent; } // Реализация отработки события LeavingQuiescentState private void OnEditorLeavingQuiescent(object sender, EventArgs e) { // Вывод сообщения в командную строку editor.WriteMessage("\nПользователь продолжил работу."); } }
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!