Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.PlotPageInfo.ShadedViewportType
 Послать отзыв
 Свойство ShadedViewportType предоставляет ненулевое значение, если на печатаемой странице имеются тонированные видовые экраны или видовые экраны с рендерами.
 Синтаксис
C#
Visual Basic
Копировать Код
public int ShadedViewportType;
Копировать Код
Public ReadOnly Property ShadedViewportType As Integer
 Возвращает
 Возвращает ноль, если на странице нет тонированных видовых экранов или видовых экранов с рендерами. В противном случае возвращает ненулевое значение. Тип int.
 Описание
 Свойство ShadedViewportType предоставляет ненулевое значение, если на печатаемой странице имеются тонированные видовые экраны или видовые экраны с рендерами. Возвращает ноль, если таких видовых экранов на странице нет.
 Условия
 Только чтение.
 Ссылки
 HostMgd.PlottingServices.PlotPageInfo, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!