Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Publisher.FireInitPublishOptionsDialog
 Послать отзыв
 This is FireInitPublishOptionsDialog, a member of class Publisher.
 Синтаксис
C#
Visual Basic
public void FireInitPublishOptionsDialog(ref HostMgd::Publishing::PublishUIEventArgs e);
Public Sub FireInitPublishOptionsDialog(ByRef e As HostMgd.Publishing.PublishUIEventArgs)
 Ссылки
 Publisher Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!