Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Делегат HostMgd.Windows.PaletteAddContextMenuEventHandler
 Послать отзыв
 This is type HostMgd::Windows::PaletteAddContextMenuEventHandler.
 Синтаксис
C#
Visual Basic
public delegate PaletteAddContextMenuEventHandler();
Public Delegate Sub PaletteAddContextMenuEventHandler()
 Ваши комментарии по поводу этого топика: Послать отзыв!