Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.GraphicsSystem.Manager.CreateAutoCADViewport
 Послать отзыв
 Метод создаёт объект Teigha.GraphicsSystem.View и добавляет в него объект Drawable, соответствующий указанной записи в таблице видовых экранов ViewportTableRecord.
 Синтаксис
C#
Visual Basic
Копировать Код
public Teigha.GraphicsSystem.View CreateAutoCADViewport( ref Teigha.DatabaseServices.ViewportTableRecord vp );
Копировать Код
Public Function CreateAutoCADViewport( ByRef vp As Teigha.DatabaseServices.ViewportTableRecord ) As Teigha.GraphicsSystem.View
 Параметры
 Параметры
 Описание
 vp
 Входная запись таблицы видовых экранов. Тип Teigha.DatabaseServices.ViewportTableRecord.
 Возвращает
 Возвращает созданный вид графической системы. Тип Teigha.GraphicsSystem.View.
 Описание
 Метод аналогичен CreateAutoCADView(Drawable) с той разницей, что к виду добавляется объект Drawable, соответствующий указанной записи в таблице видовых экранов ViewportTableRecord. Этот метод упрощает визуализацию всего видового экрана целиком.
 Ссылки
 HostMgd.GraphicsSystem.Manager, HostMgd.GraphicsSystem
 Ваши комментарии по поводу этого топика: Послать отзыв!