Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.ActiveViewportId
 Послать отзыв
 Свойство предназначено для получения идентификатора активного видового экрана в текущем чертеже.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectId ActiveViewportId { get; }
Копировать Код
Public ReadOnly Property ActiveViewportId() As ObjectId
 Возвращает
 Возвращает значение типа ObjectId, представляющее собой ссылку на запись таблицы видовых экранов (или сам видовой экран), которая является активной в текущем контексте документа. Если активный видовой экран не определён, возвращается ObjectId.Null.
 Описание
 Свойство предоставляет доступ к идентификатору (ObjectId) активного видового экрана, который может быть либо объектом типа ViewportTableRecord, либо Viewport, в зависимости от того — активна ли вкладка "Модель" или "Лист". Это позволяет программно определить, какой именно видовой экран используется в данный момент для отображения чертежа. Свойство доступно только для чтения и обновляется автоматически при переключении между видовыми экранами.
 Условия
 Только чтение
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("ActiveViewportIdExample")] public void ActiveViewportIdExample() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Получаем идентификатор активного видового экрана ObjectId activeVpId = editor.ActiveViewportId; // Вывод сообщения в командной строке if (!activeVpId.IsNull) { editor.WriteMessage( $"\nИдентификатор активного видового экрана: {activeVpId}"); } else { editor.WriteMessage( "\nАктивный видовой экран не найден."); } } }
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!