Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство SystemVariableChangingEventArgs.Name
 Послать отзыв
 Синтаксис
C#
Visual Basic
public System.String Name;
Public Property Name() As System.String
 Описание
 Имя системной переменной, которая должна быть изменена.
 Условия
 Только на чтение
 Ссылки
 SystemVariableChangingEventArgs Класс, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!