Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство TrayItemCollection.IsFixedSize
 Послать отзыв
 This is IsFixedSize, a member of class TrayItemCollection.
 Синтаксис
C#
Visual Basic
public bool IsFixedSize;
Public Property IsFixedSize() As bool
 Ссылки
 TrayItemCollection Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!