Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.SelectionAddedEventArgs.Selection
 Послать отзыв
 Свойство возвращает текущий набор выбранных в редакторе объектов.
 Синтаксис
C#
Visual Basic
Копировать Код
public SelectionSet Selection { get; }
Копировать Код
Public ReadOnly Property Selection As SelectionSet
 Возвращает
 Возвращает объект типа SelectionSet, содержащий:
Список ObjectId выбранных объектов.
Дополнительную информацию о выборе (точки, матрицы преобразования — при наличии).
 Если объекты не выбраны, возвращается пустой SelectionSet (с Count = 0), а не null.
 Описание
 Свойство предоставляет доступ к объекту типа SelectionSet, содержащему коллекцию идентификаторов (ObjectId) всех объектов, выделенных в текущий момент в чертеже. Оно доступно только для чтения и отражает состояние выборки на момент обращения к свойству — например, после завершения команды выбора или в ходе интерактивного редактирования.
 Условия
 Только чтение
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события SelectionAdded [Teigha.Runtime.CommandMethod("SelectionAddedExample_Selection")] public void SelectionAddedExample_Selection() { // Подписка на событие Rollover editor.SelectionAdded += OnSelectionAdded; } // Реализация отработки события SelectionAdded private void OnSelectionAdded(object sender, SelectionAddedEventArgs e) { SelectionSet addedSet = e.Selection; foreach (ObjectId id in addedSet.GetObjectIds()) { editor.WriteMessage($"\nК выборке добавлен объект: {id}"); } } }
 Ссылки
 HostMgd.EditorInput.SelectionAddedEventArgs, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!