Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Window.Handle
 Послать отзыв
 Синтаксис
C#
Visual Basic
public System.IntPtr Handle;
Public Property Handle() As System.IntPtr
 Описание
 Реализация IWin32Window.Handle.
 Условия
 Только на чтение
 Ссылки
 Window Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!