Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор ContextMenuExtension.ContextMenuExtension
 Послать отзыв
 This is ContextMenuExtension, a member of class ContextMenuExtension.
 Синтаксис
C#
Visual Basic
public ContextMenuExtension();
Public Sub New()
 Ссылки
 ContextMenuExtension Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!