Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.InplaceTextEditorSettings.EditFlags
 Послать отзыв
 Перечисление EditFlags определяет флаги редактирования, используемые при вызове встроенного текстового редактора.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum EditFlags { ForceOpaqueBackground = 1, SelectAll = 2, CursorAtEnd = 4 }
Копировать Код
Public Enum EditFlags ForceOpaqueBackground = 1 SelectAll = 2 CursorAtEnd = 4 End Enum
 Члены
 Члены
 Описание
 CursorAtEnd
 Значение: 4. Вызов текстового редактора с этим флагом предписывает изначальное позиционирование курсора в конце редактируемого текста. Данный флаг и флаг SelectAll являются взаимоисключающими.
Если флаг CursorAtEnd установлен, то состояние флага SelectAll игнорируется.
 ForceOpaqueBackground
 Значение: 1. Вызов текстового редактора с этим флагом предписывает непрозрачную фоновую заливку.
 SelectAll
 Значение: 2. Вызов текстового редактора с этим флагом предписывает изначальное выделение всего редактируемого текста. Если флаг SelectAll установлен, то состояние флага CursorAtEnd игнорируется.
 Описание
 Перечисление EditFlags определяет флаги редактирования, используемые при вызове встроенного текстового редактора. Допускается использование одного флага или их комбинации.
 Ваши комментарии по поводу этого топика: Послать отзыв!