Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор LineWeightDialog.LineWeightDialog
 Послать отзыв
 This is LineWeightDialog, a member of class LineWeightDialog.
 Синтаксис
C#
Visual Basic
public LineWeightDialog();
Public Sub New()
 Ссылки
 LineWeightDialog Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!