Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptDoubleResult
 Послать отзыв
 Класс содержит результат интерактивного ввода вещественного числа, такого как угол или расстояние, после выполнения соответствующего приглашения пользователю.
 Иерархия классов
HostMgd::EditorInput::PromptResult HostMgd::EditorInput::PromptDoubleResult
 Синтаксис
C#
Visual Basic
Копировать Код
public class PromptDoubleResult : PromptResult
Копировать Код
Public Class PromptDoubleResult Inherits PromptResult
 Описание
 Класс наследуется от базового класса PromptResult и используется для хранения результата операций ввода значений типа double, например, после вызова методов GetAngle(), GetDistance() или других команд, где требуется ввести число с плавающей точкой. Он предоставляет информацию о статусе завершения ввода (успешно, отменено, ошибка), а также само значение, введённое пользователем.
 Этот класс применяется совместно с событиями, такими как PromptedForAngle, PromptedForDistance и др., и позволяет обрабатывать результаты ввода пользователя, выполнять проверки, либо продолжать выполнение команд на основе полученного значения.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("GetDoubleExample")] public void GetDoubleExample() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создаём запрос пользователю PromptDoubleOptions options = new PromptDoubleOptions("\nВведите значение масштаба:"); options.DefaultValue = 1.0; options.UseDefaultValue = true; // Вызываем метод GetDouble для запроса числа у пользователя PromptDoubleResult result = editor.GetDouble(options); // Если все данные введены, выводим результат в командную строку if (result.Status == PromptStatus.OK) { double scale = result.Value; editor.WriteMessage( $"\nЗначение масштаба: {scale}"); } } }
 Топики
 Имя
 Описание
 PromptResult Методы
 Ниже перечислены методы класса PromptResult.
 PromptResult Свойства
 Ниже перечислены свойства класса PromptResult.
 HostMgd.EditorInput.PromptDoubleResult
 Имя
 Описание
 PromptDoubleResult Методы
 Ниже перечислены методы класса PromptDoubleResult.
 PromptDoubleResult Свойства
 Ниже перечислены свойства класса PromptDoubleResult.
 Ссылки
 PromptDoubleResult Методы, PromptDoubleResult Свойства, Топики, PromptResult Методы, PromptResult Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!