Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.Windows.ToolPalette.CustomToolBase.BeginMultipleEdit
 Послать отзыв
 Метод позволяет начать операцию группового редактирования сразу нескольких инструментов на панели инструментов. Не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void BeginMultipleEdit( ref System.Object tools, ref System.Object stockToolIds );
Копировать Код
Public Overridable Sub BeginMultipleEdit( ByRef tools As System.Object, ByRef stockToolIds As System.Object )
 Параметры
 Параметры
 Описание
 tools
 Входной массив инструментов. Тип System.Object.
 stockToolIds
 Входной массив идентификаторов стандартных инструментов. Тип System.Object.
 Описание
 Метод позволяет начать групповое редактирование сразу нескольких инструментов, заданных входными массивами.
 В текущей версии не реализован.
 Замечания
 Для завершения группового редактирование используется метод EndMultipleEdit().
 Ссылки
 HostMgd.Windows.ToolPalette.CustomToolBase, HostMgd.Windows.ToolPalette
 Ваши комментарии по поводу этого топика: Послать отзыв!