Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод MenuItemCollection.Insert (int, System::Object^)
 Послать отзыв
 This is Insert, a member of class MenuItemCollection.
 Синтаксис
C#
Visual Basic
public void Insert(int index, ref System.Object value);
Public Sub Insert(index As Integer, ByRef value As System.Object)
 Ссылки
 MenuItemCollection Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!