Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PublishSheetEventArgs.DisplayMinX
 Послать отзыв
 This is DisplayMinX, a member of class PublishSheetEventArgs.
 Синтаксис
C#
Visual Basic
public double DisplayMinX;
Public Property DisplayMinX() As Double
 Ссылки
 PublishSheetEventArgs Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!