Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PromptCornerOptions.UseDashedLine
 Послать отзыв
 Синтаксис
C#
Visual Basic
public bool UseDashedLine;
Public Property UseDashedLine() As bool
 Описание
 Включает и выключает штриховую "резиновую" линию, которая рисуется между базовой точкой и текущим положением курсора при вводе.
 Условия
 На чтение и запись
 Ссылки
 PromptCornerOptions Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!