Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.InplaceTextEditor.CanUndo
 Послать отзыв
 Свойство CanUndo позволяет проверить, возможно ли отменить последнюю выполненную операцию. В текущей версии не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool CanUndo;
Копировать Код
Public ReadOnly Property CanUndo As Boolean
 Возвращает
 Возвращает true, если отмена последней выполненной операции возможна. В противном случае возвращает false.
 Описание
 Свойство CanUndo позволяет проверить, возможна ли отмена последней выполненной операции. В текущей версии не реализовано.
 Условия
 Только чтение.
 Ссылки
 HostMgd.ApplicationServices.InplaceTextEditor, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!