Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.DocumentCollection.DocumentBecameCurrent
 Послать отзыв
 Событие, возникающее при переключении между открытыми dwg-документами.
 Синтаксис
C#
Visual Basic
public event DocumentCollectionEventHandler DocumentBecameCurrent;
Public Event DocumentBecameCurrent As DocumentCollectionEventHandler
 Возвращает
 Возвращает тип данных HostMgd.ApplicationServices.DocumentCollectionEventHandler
 Описание
 Событие возникает всегда, когда текущим становится другой документ. Не следует путать это событие с событием получения фокуса или активации после отсутствия активности. В таких случаях возможно, что активным станет тот же документ, что был до этого. Данное событие возникает только в случае, когда происходит активация dwg-документа при переключении между открытыми dwg-документами.
 Соответствует функции NRX API HostApDocManagerReactor.documentBecameCurrent().
 Ссылки
 HostMgd.ApplicationServices.DocumentCollection, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!