Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptSelectionOptions.KeywordInput
 Послать отзыв
 Событие возникает, когда пользователь вводит ключевое слово в ответ на приглашение выбора объектов.
 Синтаксис
C#
Visual Basic
Копировать Код
public event SelectionTextInputEventHandler KeywordInput;
Копировать Код
Public Event KeywordInput As SelectionTextInputEventHandler
 Описание
 Событие инициируется в процессе выполнения операции выбора объектов — например, при вызове GetSelection() с заданными ключевыми словами. Оно генерируется в момент, когда пользователь вводит одно из ключевых слов (например, "Все", "Фильтр", "Отмена") вместо указания объектов мышью. Это позволяет разработчику плагина немедленно отреагировать на выбор команды, не дожидаясь завершения операции ввода.
 Событие реализуется через делегат SelectionTextInputEventHandler и предоставляет доступ к:
введённому ключевому слову,
контексту операции,
возможности прервать или изменить дальнейшее поведение команды.
 Оно особенно полезно при реализации интерактивных команд, где ключевые слова управляют логикой выборки — например, "Все" для выбора всех объектов, "Группа" для выбора по группе, "Фильтр" для задания условий.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { // Метод команды, которая отслеживает появление события KeywordInput [Teigha.Runtime.CommandMethod("PromptSelectionOptionsExample_KeywordInput")] public void PromptSelectionOptionsExample_KeywordInput() { // Создаём набор параметров для запроса PromptSelectionOptions options = new PromptSelectionOptions(); options.MessageForAdding = "Выберите линии для объединения:"; // Добавление ключевых слов options.Keywords.Add("Все"); options.Keywords.Add("Фильтр"); // Подписка на событие KeywordInput options.KeywordInput += OnEditorKeywordInput; // Фильтр: только объекты типа Line TypedValue[] filterList = new TypedValue[] { new TypedValue((int)DxfCode.Start, "LINE") }; SelectionFilter filter = new SelectionFilter(filterList); // Создаём запрос пользователю PromptSelectionResult result = editor.GetSelection(options, filter); // Если все данные введены, выводим результат в командную строку if (result.Status == PromptStatus.OK) { SelectionSet selSet = result.Value; editor.WriteMessage( $"\nВыбрано объектов: {selSet.Count}"); } else { editor.WriteMessage( "\nНе удалось получить выделение."); } } // Метод, реализующий отработку события KeywordInput private void OnEditorKeywordInput(object sender, SelectionTextInputEventArgs e) { string keyword = e.Input; switch (keyword) { case "Все": // Вызов метода, который автоматически выберет все объекты // SelectAllObjects(); break; case "Фильтр": // Вызов метода, который применит пользовательский фильтр к выборке // ApplyCustomFilter(); break; default: break; } } }
 Порядок работы с событием:
Пользователь вызывает команду выбора с поддержкой ключевых слов.
Вместо выбора объектов вводит ключевое слово.
Генерируется событие KeywordInput.
Разработчик обрабатывает ввод и может прервать стандартное поведение.
 Ссылки
 HostMgd.EditorInput.PromptSelectionOptions, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!