Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство TabbedDialogExtension.OnHelp
 Послать отзыв
 Синтаксис
C#
Visual Basic
public TabbedDialogAction OnHelp;
Public Property OnHelp() As TabbedDialogAction
 Описание
 Возвращает обработчик события, который вызывается, когда в главном диалоге пользователь нажимает на кнопку Help.
 Условия
 Только на чтение
 Ссылки
 TabbedDialogExtension Класс, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!