Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.Windows.ToolPalette.CustomToolBase.ToolImage
 Послать отзыв
 Свойство ToolImage представляет имя связанного с инструментом изображения. Не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public System.String ToolImage;
Копировать Код
Public ReadOnly Property ToolImage As System.String
 Возвращает
 Возвращает имя связанного с инструментом изображения. Тип System.String.
 Описание
 Свойство ToolImage представляет имя связанного с инструментом изображения.
 В текущей версии не реализовано.
 Условия
 Только чтение.
 Ссылки
 HostMgd.Windows.ToolPalette.CustomToolBase, HostMgd.Windows.ToolPalette
 Ваши комментарии по поводу этого топика: Послать отзыв!