Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.DsdData.SetDsdEntryCollection
 Послать отзыв
 Метод переопределяет в данном объекте коллекцию сконфигурированных для публикации листов. Не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetDsdEntryCollection( ref HostMgd.PlottingServices.DsdEntryCollection entries );
Копировать Код
Public Sub SetDsdEntryCollection( ByRef entries As HostMgd.PlottingServices.DsdEntryCollection )
 Параметры
 Параметры
 Описание
 entries
 Входная коллекция объектов DsdEntry для выводимых на публикации листов. Тип HostMgd.PlottingServices.DsdEntryCollection.
 Описание
 Метод переопределяет в данном объекте коллекцию сконфигурированных для публикации листов, которые сохраняются в DSD-файле.
 В текущей версии не реализован.
 Ссылки
 HostMgd.PlottingServices.DsdData, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!