Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство SaveFileDialog.Filename
 Послать отзыв
 This is Filename, a member of class SaveFileDialog.
 Синтаксис
C#
Visual Basic
public String Filename;
Public Property Filename() As String
 Ссылки
 SaveFileDialog Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!