Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.Application.Version
 Послать отзыв
 Свойство предназначено для получения информации о версии сборки nanoCAD.
 Синтаксис
C#
Visual Basic
Копировать Код
public static Version Version
Копировать Код
Public Shared ReadOnly Property Version As Version
 Возвращает
 Возвращает версию сборки nanoCAD.
 Описание
 Свойство пердоставляет доступ к информации о версии сборки nanoCAD.
 Условия
 Только чтение.
 Ссылки
 HostMgd.ApplicationServices.Application, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!