Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PublishSheetEventArgs.PlotWindowMinY
 Послать отзыв
 This is PlotWindowMinY, a member of class PublishSheetEventArgs.
 Синтаксис
C#
Visual Basic
public double PlotWindowMinY;
Public Property PlotWindowMinY() As Double
 Ссылки
 PublishSheetEventArgs Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!