Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PrintForm.SheetNameToolTip
 Послать отзыв
 This is SheetNameToolTip, a member of class PrintForm.
 Синтаксис
C#
Visual Basic
public System.String SheetNameToolTip;
Public Property SheetNameToolTip() As System.String
 Ссылки
 PrintForm Класс, Пространство имен HostMgd
 Ваши комментарии по поводу этого топика: Послать отзыв!