Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.GraphicsSystem.Manager.ConfigWasModified
 Послать отзыв
 Событие ConfigWasModified генерируется после изменения конфигурации.
 Синтаксис
C#
Visual Basic
Копировать Код
public event ConfigWasModifiedEventHandler ConfigWasModified;
Копировать Код
Public Event ConfigWasModified As ConfigWasModifiedEventHandler
 Возвращает
 Возвращает делегат типа ConfigWasModifiedEventHandler.
 Описание
 Событие ConfigWasModified генерируется после изменения конфигурации.
 Ссылки
 HostMgd.GraphicsSystem.Manager, HostMgd.GraphicsSystem
 Ваши комментарии по поводу этого топика: Послать отзыв!