Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptSelectionOptions.SinglePickInSpace
 Послать отзыв
 Свойство включает режим :A для HostSSGet, позволяя выполнять выбор объектов только по одиночному щелчку без открытия рамки или окна выбора.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool SinglePickInSpace { get; set; }
Копировать Код
Public Property SinglePickInSpace As Boolean
 Возвращает
 Возвращает значение типа bool:
true — включён режим :A: выбор возможен только по одиночному щелчку (без рисования окна).
false — разрешены стандартные режимы выбора (окно, рамка и др.).
 Описание
 Свойство активирует режим :A (Aperture Only) функции HostSSGet. При установке в true выбор объектов происходит только по одному щелчку мыши — система использует текущую апертуру (выборную рамку) для определения объектов под курсором, не позволяя пользователю рисовать окно или рамку. Это обеспечивает быстрый и точный выбор одного или нескольких объектов в точке щелчка.
 Если SinglePickInSpace = false, пользователь может использовать стандартные режимы выбора — такие как окно, рамка, пересечение и т.д.
 Режим особенно полезен при реализации команд, требующих точечного выбора — например, редактирование свойств, измерение, выделение или редактирование отдельного элемента в плотной группе объектов.
 Условия
 Чтение и запись
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("PromptSelectionOptionsExample_SinglePickInSpace")] public void PromptSelectionOptionsExample_SinglePickInSpace() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создаём набор параметров для запроса PromptSelectionOptions options = new PromptSelectionOptions(); options.MessageForAdding = "Выберите линии для объединения:"; // Разрешить только одиночный выбор options.SinglePickInSpace = true; // Фильтр: только объекты типа Line TypedValue[] filterList = new TypedValue[] { new TypedValue((int)DxfCode.Start, "LINE") }; SelectionFilter filter = new SelectionFilter(filterList); // Создаём запрос пользователю PromptSelectionResult result = editor.GetSelection(options, filter); // Если все данные введены, выводим результат в командную строку if (result.Status == PromptStatus.OK) { SelectionSet selSet = result.Value; editor.WriteMessage( $"\nВыбрано объектов: {selSet.Count}"); } else { editor.WriteMessage( "\nНе удалось получить выделение."); } } }
 Ссылки
 HostMgd.EditorInput.PromptSelectionOptions, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!