Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.InputPointContext.ToolTipText
 Послать отзыв
 Свойство предназначено для получения текста всплывающей подсказки, ассоциированной с текущим инструментом или операцией ввода точки.
 Синтаксис
C#
Visual Basic
Копировать Код
public System.String ToolTipText;
Копировать Код
Public Property ToolTipText() As System.String
 Возвращает
 Возвращает объект типа string — текст всплывающей подсказки, отображаемый в данный момент у курсора.
 Если команда активна — содержит актуальное приглашение или пояснение. Если подсказка отсутствует — может возвращать null или пустую строку.
 Описание
 Свойство предоставляет строку, отображаемую системой nanoCAD в виде всплывающей подсказки (tooltip) при выполнении интерактивных команд — например, во время рисования, редактирования или привязки. Текст обычно определяется текущим активным инструментом (например, "Укажите первую точку", "Выберите объект" и т.п.) и управляется самим редактором.
 Это свойство доступно в контексте событий ввода (PointMonitor, PointFilter) и позволяет разработчику:
ознакомиться с текущим системным сообщением,
при необходимости проанализировать состояние команды по её описанию,
реализовать логику, зависящую от контекста подсказки (например, адаптацию поведения фильтра).
 Хотя в описании указано "может быть заменено на возвращение новой строки", в реальности это свойство только читается из контекста, и его нельзя программно изменить через присваивание — nanoCAD не предоставляет механизм переопределения ToolTipText на уровне InputPointContext.
 Условия
 Только чтение
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class InputPointContextExamples { // Метод команды, которая получает текст всплывающей подсказки, // ассоциированной с текущим инструментом или операцией ввода точки. [Teigha.Runtime.CommandMethod("ToolTipTextExample")] public void ToolTipTextExample() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Метод для отработки события редактора PointMonitor editor.PointMonitor += (sender, e) => { // Сохраняем контекст события в преременную InputPointContext context = e.Context; // Выводим в комнадную строку полученные данные if (context != null) { string tooltip = context.ToolTipText; if (!string.IsNullOrEmpty(tooltip)) { // Логирование или анализ контекста editor.WriteMessage($"\nПодсказка: {tooltip}"); } } }; } }
 Ссылки
 HostMgd.EditorInput.InputPointContext, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!