Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.RecentDocument
 Послать отзыв
 Класс RecentDocument представляет недавно открытый документ или чертеж. В текущей версии данный класс не реализован.
 Иерархия классов
Teigha::Runtime::DisposableWrapper HostMgd::ApplicationServices::RecentDocument
 Синтаксис
C#
Visual Basic
Копировать Код
public sealed class RecentDocument : Teigha.Runtime.DisposableWrapper;
Копировать Код
Public NotInheritable Class RecentDocument Inherits Teigha.Runtime.DisposableWrapper
 Описание
 Класс RecentDocument представляет недавно открытый документ или чертеж. В текущей версии данный класс не реализован.
 Методы
 Конструкторы
 HostMgd.ApplicationServices.RecentDocument
 Имя
 Описание
 RecentDocument
 Конструктор по умолчанию класса RecentDocument. Не реализован.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 HostMgd.ApplicationServices.RecentDocument
 Имя
 Описание
 RecentDocument Свойства
 Ниже перечислены свойства класса RecentDocument.
 Ссылки
 RecentDocument Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!