Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.GetNestedEntity(PromptNestedEntityOptions)
 Послать отзыв
 Метод позволяет пользователю выбрать геометрический объект, вложенный во внешнюю ссылку или блок, возвращая его идентификатор и точку выбора.
 Синтаксис
C#
Visual Basic
Копировать Код
public PromptNestedEntityResult GetNestedEntity(PromptNestedEntityOptions options);
Копировать Код
Public Function GetNestedEntity(options As PromptNestedEntityOptions) As PromptNestedEntityResult
 Параметры
 Параметры
 Описание
 options
 Объект, содержащий параметры приглашения:
 Возвращает
 Возвращает объект типа PromptNestedEntityResult, который содержит:
Status — статус операции (OK, Cancel, Error и др.).
ObjectId — идентификатор выбранного вложенного объекта.
PickedPoint — координата точки, в которой объект был выбран пользователем.
Transform — матрица преобразования, применённая к объекту внутри блока.
 Если пользователь отменил операцию или объект не был найден, статус будет отличаться от OK.
 Описание
 Метод используется для интерактивного выбора пользователем геометрического объекта, который находится внутри вложенной структуры — например, внутри блока или внешней ссылки. Метод ожидает указания мышью на объект и возвращает информацию о выбранном элементе и его расположении. Поведение и сообщения приглашения можно настроить через параметры PromptNestedEntityOptions.
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!