Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Делегат HostMgd.Publishing.AboutToBeginBackgroundPublishingEventHandler
 Послать отзыв
 This is type HostMgd::Publishing::AboutToBeginBackgroundPublishingEventHandler.
 Синтаксис
C#
Visual Basic
public delegate AboutToBeginBackgroundPublishingEventHandler();
Public Delegate Sub AboutToBeginBackgroundPublishingEventHandler()
 Ваши комментарии по поводу этого топика: Послать отзыв!