Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.DrawingOpenEventArgs
 Послать отзыв
 Класс DrawingOpenEventArgs представляет данные события EndDwgOpen класса Document.
 Иерархия классов
HostMgd::ApplicationServices::DrawingOpenEventArgs
 Синтаксис
C#
Visual Basic
Копировать Код
public sealed class DrawingOpenEventArgs : EventArgs
Копировать Код
Public NotInheritable Class DrawingOpenEventArgs Inherits EventArgs
 Описание
 Класс DrawingOpenEventArgs представляет контекст события Document.EndDwgOpen, позволяя передать в обработчик события имя открываемого файла и ссылку на объект базы данных чертежа.
 Топики
 Имя
 Описание
 DrawingOpenEventArgs Свойства
 Ниже перечислены свойства класса DrawingOpenEventArgs.
 Ссылки
 DrawingOpenEventArgs Свойства, Топики, DrawingOpenEventArgs Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!