Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.Marshaler.AdsNameToSelectionSet
 Послать отзыв
 Метод преобразует неуправляемый объект, переданный указателем, в управляемый объект SelectionSet. В текущей версии не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public static HostMgd.EditorInput.SelectionSet AdsNameToSelectionSet( System.IntPtr pointerToAdsName );
Копировать Код
Public Shared Function AdsNameToSelectionSet( pointerToAdsName As System.IntPtr ) As HostMgd.EditorInput.SelectionSet
 Параметры
 Параметры
 Описание
 pointerToAdsName
 Указатель на неуправляемый объект, представляющий набор выбранных объектов в формате ads_name. Тип System.IntPtr.
 Возвращает
 Возвращает набор выбранных объектов в управляемой среде. Тип HostMgd.EditorInput.SelectionSet.
 Описание
 Метод преобразует неуправляемый объект, переданный указателем IntPtr, в управляемый объект SelectionSet. В текущей версии не реализован.
 Ссылки
 HostMgd.ApplicationServices.Marshaler, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!