Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PointMonitorEventHandler(object,PointMonitorEventArgs)
 Послать отзыв
 Делегат предназначен для обработки событий, возникающих при перемещении мыши в окне редактора nanoCAD, без возможности изменения точки ввода.
 Синтаксис
C#
Visual Basic
Копировать Код
public delegate void PointMonitorEventHandler(object sender, PointMonitorEventArgs e);
Копировать Код
Public Delegate Sub PointMonitorEventHandler(sender As Object, e As PointMonitorEventArgs)
 Параметры
 Параметры
 Описание
 sender
 Источник события, обычно представляющий экземпляр редактора (Editor), в котором произошло перемещение мыши. Тип object
 e
 Объект события, содержащий данные о контексте и настройках курсора. Тип PointMonitorEventArgs
 Описание
 Делегат используется как сигнатура метода-обработчика для события PointMonitor, которое вызывается при каждом перемещении указателя в графической области чертежа. В отличие от PointFilterEventHandler, этот делегат не позволяет изменять точку — он предназначен только для наблюдения за движением мыши и отображения информации. Это может быть использовано для реализации подсказок, логгирования позиции курсора или контекстной помощи во время интерактивных операций.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события PointMonitor [Teigha.Runtime.CommandMethod("PointMonitorExample")] public void PointMonitorExample() { // Подписка на событие PointMonitor editor.PointMonitor += OnEditorPointMonitor; } // Реализация отработки события PointMonitor private void OnEditorPointMonitor(object sender, PointMonitorEventArgs e) { // Вывод сообщения в командную строку editor.WriteMessage( $"\nТекущая позиция мыши: {e.Context.LastPoint}"); } }
 Ваши комментарии по поводу этого топика: Послать отзыв!