Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptNestedEntityOptions.PromptNestedEntityOptions(string)
 Послать отзыв
 Конструктор инициализирует новый экземпляр класса с заданным приглашающим сообщением для операции выбора вложенного объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public PromptNestedEntityOptions(string message);
Копировать Код
Public Sub New(message As String)
 Параметры
 Параметры
 Описание
 message
 Текст приглашения, отображаемый пользователю перед началом выбора вложенного объекта.
 Пример
 "Выберите линию внутри блока:". Тип string
 Описание
 Конструктор создаёт объект класса PromptNestedEntityOptions, используемый при настройке интерактивного выбора геометрического объекта, вложенного в блок или внешнюю ссылку. Он устанавливает текст приглашения, который отображается в командной строке перед началом выбора, и служит основой для взаимодействия с пользователем.
 После создания объекта можно дополнительно настроить его параметры, такие как:
разрешение на отмену выбора (AllowNone),
добавление ключевых слов (Keywords),
установка глобальных команд (GlobalKeywords).
 Этот конструктор является основным способом инициализации параметров при работе с методом GetNestedEntity().
 Ссылки
 HostMgd.EditorInput.PromptNestedEntityOptions, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!