Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод DrawJig.ViewportDraw
 Послать отзыв
 Абстрактный метод, не обязателен к реализации.
 Синтаксис
C#
Visual Basic
public ViewportDraw(ref Teigha.GraphicsInterface.ViewportDraw draw);
Public Sub ViewportDraw(ByRef draw As Teigha.GraphicsInterface.ViewportDraw)
 Параметры
 Параметры
 Описание
 draw
 Параметры для отрисовки графичкских объектов
 Описание
 Метод должен быть реализован, если необходимо, чтобы отображение графических объектов или части графических объектов зависело от параметров видового экрана.
 Абстрактный метод, не обязателен к реализации.
 Метод должен быть реализован, если необходимо, чтобы отображение графических объектов или части графических объектов зависело от параметров видового экрана.Для этого используется переменная - параметр метода draw типа ViewportDraw.
 Тип данных ViewportDraw содержит в себе свойства, которые возвращают ссылки на объекты классов SubEntityTraits, WorldGeometry и Viewport.Класс SubEntityTraits позволяет управлять цветами, слоями, типами линий, типами заливки графических объектов.Класс WorldGeometry отвечает за кэширование графических объектов для последующего отображения на экране.Класс Viewport содержит сведения о системе координат видового экрана, положении камеры, определяющей направление взгляда на графический объект и другие параметры.
 Чтобы метод был вызван, необходимо, чтобы метод DrawJig.WorldDraw вернул значение false.
 Ссылки
 DrawJig Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!