Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод DropTarget.OnDrop
 Послать отзыв
 This is OnDrop, a member of class DropTarget.
 Синтаксис
C#
Visual Basic
public void OnDrop(ref System.Windows.Forms.DragEventArgs e);
Public Sub OnDrop(ByRef e As System.Windows.Forms.DragEventArgs)
 Ссылки
 DropTarget Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!