Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство OptionsDialogResult.DsdData
 Послать отзыв
 This is DsdData, a member of class OptionsDialogResult.
 Синтаксис
C#
Visual Basic
public HostMgd::PlottingServices::DsdData DsdData;
Public Property DsdData() As HostMgd.PlottingServices.DsdData
 Ссылки
 OptionsDialogResult Структура, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!