Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод SelectionDetails.GetContainers
 Послать отзыв
 Синтаксис
C#
Visual Basic
public array<Teigha::DatabaseServices::ObjectId> GetContainers();
Public Function GetContainers() As array<Teigha.DatabaseServices.ObjectId>
 Описание
 Возвращает массив Id объектов, представляющих контейнеры вложенного геометрического подобъекта.
 Ссылки
 SelectionDetails Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!