Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.Windows.ToolPalette.CustomToolBase.GetStockTool
 Послать отзыв
 Метод позволяет получить ссылку на стандартный инструмент, связанный с данным пользовательским инструментом. Не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual System.Object GetStockTool();
Копировать Код
Public Overridable Function GetStockTool() As System.Object
 Возвращает
 Возвращает экземпляр стандартного инструмента nanoCAD или null. Тип System.Object.
 Описание
 Метод позволяет получить ссылку на стандартный инструмент (stock tool), связанный с данным пользовательским инструментом. При отсутствии такой связи метод возвращает null.
 В текущей версии не реализован.
 Ссылки
 HostMgd.Windows.ToolPalette.CustomToolBase, HostMgd.Windows.ToolPalette
 Ваши комментарии по поводу этого топика: Послать отзыв!