Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptDistanceOptions.UseBasePoint
 Послать отзыв
 Свойство определяет, будет ли использоваться базовая точка при интерактивном вводе расстояния.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool UseBasePoint { get; set; }
Копировать Код
Public Property UseBasePoint As Boolean
 Возвращает
 Возвращает значение типа bool:
true — базовая точка будет использоваться при вводе.
false — базовая точка не учитывается.
 Описание
 Свойство используется для указания, следует ли учитывать базовую точку (BasePoint) при вводе расстояния. Если свойство установлено в true, вводимое расстояние отсчитывается относительно заданной базовой точки, и может отображаться визуальная подсказка — например, штриховая линия между базовой точкой и текущим положением курсора. Это особенно полезно при построении объектов, смещении, копировании или других операциях, где требуется привязка к определённой позиции на чертеже.
 Замечания
 Свойство часто используется в связке с BasePoint и UseDashedLine, чтобы обеспечить наглядную визуальную привязку при вводе расстояния, что улучшает точность и удобство работы пользователя в nanoCAD.
 Условия
 Чтение и запись
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { [Teigha.Runtime.CommandMethod("PromptDistanceOptionsExample_UseBasePoint")] public void PromptDistanceOptionsExample_UseBasePoint() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создаём запрос пользователю PromptDistanceOptions options = new PromptDistanceOptions("\nВведите расстояние:"); // Устанавливаем базовую точку options.BasePoint = new Point3d(100, 100, 0); // Включаем использование базовой точки options.UseBasePoint = true; // Вызов метода GetDistance() PromptDoubleResult result = editor.GetDistance(options); // Вывод результата в командную строку if (result.Status == PromptStatus.OK) { editor.WriteMessage($"\nВведено расстояние: {result.Value}"); } } }
 Ссылки
 HostMgd.EditorInput.PromptDistanceOptions, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!