Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.MatchingPolicy
 Послать отзыв
 Данное перечисление определяет поддерживаемые классом PlotInfoValidator политики сопоставления медиа-данных при слиянии настроек, относящихся к печати.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum MatchingPolicy { MatchDisabled = 1, MatchEnabled = 2, MatchEnabledCustom = 3, MatchEnabledTemporaryCustom = 4 }
Копировать Код
Public Enum MatchingPolicy MatchDisabled = 1 MatchEnabled = 2 MatchEnabledCustom = 3 MatchEnabledTemporaryCustom = 4 End Enum
 Члены
 Члены
 Описание
 MatchDisabled
 Значение: 1. Сопоставление носителей отключено.
 MatchEnabled
 Значение: 2. Сопоставление носителей включено.
 MatchEnabledCustom
 Значение: 3. Сопоставление носителей включено. Если носитель соответствующего размера не найден, создается пользовательский размер с последующим сохранением на диске.
 MatchEnabledTemporaryCustom
 Значение: 4. Сопоставление носителей включено. Если носитель соответствующего размера не найден, создается пользовательский размер и сохраняется во временном файле PC3/PMP, который удаляется при уничтожении проверенного объекта PlotInfo.
 Описание
 Перечисление MatchingPolicy определяет поддерживаемые классом PlotInfoValidator политики сопоставления медиа-данных при слиянии настроек, относящихся к печати.
 Ваши комментарии по поводу этого топика: Послать отзыв!