Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PublishSheetEventArgs.LayoutMarginMinY
 Послать отзыв
 This is LayoutMarginMinY, a member of class PublishSheetEventArgs.
 Синтаксис
C#
Visual Basic
public double LayoutMarginMinY;
Public Property LayoutMarginMinY() As Double
 Ссылки
 PublishSheetEventArgs Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!