Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Делегат HostMgd.Windows.PaletteSetDestroyEventHandler
 Послать отзыв
 This is type HostMgd::Windows::PaletteSetDestroyEventHandler.
 Синтаксис
C#
Visual Basic
public delegate PaletteSetDestroyEventHandler();
Public Delegate Sub PaletteSetDestroyEventHandler()
 Ваши комментарии по поводу этого топика: Послать отзыв!