Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство OptionsDialogResult.Status
 Послать отзыв
 This is Status, a member of class OptionsDialogResult.
 Синтаксис
C#
Visual Basic
public System.Windows.Forms.DialogResult Status;
Public Property Status() As System.Windows.Forms.DialogResult
 Ссылки
 OptionsDialogResult Структура, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!