Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод KeywordCollection.Add (String^, String^)
 Послать отзыв
 Синтаксис
C#
Visual Basic
public void Add(ref String globalName, ref String localName);
Public Sub Add(ByRef globalName As String, ByRef localName As String)
 Параметры
 Параметры
 Описание
 globalName
 Глобальное имя. Оно никогда не показывается на экране, а применяется для того, чтобы доступ к ключевому слову производился независимо от локализации (используемого языка).
 localName
 Локальное имя. Это имя вводится пользователем для идентификации этого ключевого слова.
 Описание
 Метод добавляет ключевое слово в коллекцию, задавая значения глобального и локального имени ключевого слова.
 Для определения ключевого слова пользователь вводит именно локальное имя.
 Ссылки
 KeywordCollection Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!