Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.Document.LockDocument(DocumentLockMode
 Послать отзыв
 Метод предназначен для блокировки dwg-документа в заданном режиме, для выполнения указанной команды.
 Синтаксис
C#
Visual Basic
public DocumentLock LockDocument(DocumentLockMode lockMode, ref String globalCommandName, ref String localCommandName, bool promptIfFails);
Public Function LockDocument(lockMode As DocumentLockMode, ByRef globalCommandName As String, ByRef localCommandName As String, promptIfFails As bool) As DocumentLock
 Параметры
 Параметры
 Описание
 lockMode
 Задает режим блокировки с помощью одного из значений, указанных в перечислении DocumentLockMode
 globalCommandName
 Глобальное имя команды, которая будет выполняться во время блокировки документа. Тип String. Может иметь значение null
 localCommandName
 Локальное название команды, которая будет выполняться во время блокировки документа. Тип String. Может иметь значение null
 promptIfFails
 Если документ не может быть заблокирован из-за того, что уже выпоняется команда над этим документом и значение параметра promptIfFails - true, появится стандартное приглашение и пользователь может дать возможность завершить выполнение команды. После этого документ будет заблокирован. Если же пользователь выберет в приглашении отмену действия или параметр promptIfFails равен false, то блокирование выполнено не будет. Тип bool
 Возвращает
 Возвращает заблокированный документ в случае его успешной блокировки. Тип DocumentLock
 Описание
 Метод блокирует dwg-документ в режиме, заданном в параметре lockMode. Также, можно указать глобальное и локализованное название команды, которая будет выполняться во время блокировки.
 Ссылки
 HostMgd.ApplicationServices.Document, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!