Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.InplaceTextEditor.Invoke
 Послать отзыв
 Метод вызывает встроенный текстовый редактор для указанного многострочного текста MTEXT. В текущей версии не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public static void Invoke( ref Teigha.DatabaseServices.MText mtext, ref InplaceTextEditorSettings settings );
Копировать Код
Public Shared Sub Invoke( ByRef mtext As Teigha.DatabaseServices.MText, ByRef settings As InplaceTextEditorSettings )
 Параметры
 Параметры
 Описание
 mtext
 Многострочный текст, редактирование которого начнётся во встроенном текстовом редакторе. Тип Teigha.DatabaseServices.MText.
 settings
 Настройки, с которыми вызывается встроенный текстовый редактор. Тип InplaceTextEditorSettings. Если передается значение NULL, при вызове редактора будут использоваться настройки по умолчанию.
 Описание
 Метод вызывает встроенный текстовый редактор для указанного многострочного текста MTEXT. Если уже имеется активный встроенный редактор, он будет предварительно закрыт.
 В текущей версии метод не реализован.
 Ссылки
 HostMgd.ApplicationServices.InplaceTextEditor, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!