Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptPointOptionsEventArgs
 Послать отзыв
 Класс предоставляет данные для события PromptingForPoint и позволяет настраивать параметры ввода точки перед началом интерактивной операции.
 Иерархия классов
HostMgd::EditorInput::PromptPointOptionsEventArgs
 Синтаксис
C#
Visual Basic
Копировать Код
public sealed class PromptPointOptionsEventArgs : EventArgs
Копировать Код
Public NotInheritable Class PromptPointOptionsEventArgs Inherits EventArgs
 Описание
 Класс наследуется от EventArgs и используется в .NET API nanoCAD для передачи параметров ввода точки при начале интерактивной команды — например, при вызове метода GetPoint() или GetCorner(). Он предоставляет доступ к объекту PromptPointOptions, через который можно изменить:
текст приглашения ,
базовую точку ,
режимы привязки ,
дополнительные флаги , такие как UseBasePoint, AllowNone и другие.
 Этот класс применяется совместно с событиями, такими как PromptingForPoint и PromptingForCorner, и позволяет динамически настраивать параметры ввода точки в зависимости от контекста.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события PromptingForCorner [Teigha.Runtime.CommandMethod("PromptingForCornerExample")] public void PromptingForCornerExample() { // Подписка на событие PromptingForCorner editor.PromptingForCorner += OnEditorPromptingForCorner; } // Реализация отработки события PromptingForCorner private void OnEditorPromptingForCorner(object sender, PromptPointOptionsEventArgs e) { // Изменение текста приглашения e.Options.Message = "Укажите второй угол прямоугольной области."; // Установка базовой точки e.Options.BasePoint = new Point3d(0, 0, 0); // Ограничение ввода только в первом квадранте e.Options.UseBasePoint = true; } }
 Топики
 Имя
 Описание
 PromptPointOptionsEventArgs Свойства
 Ниже перечислены свойства класса PromptPointOptionsEventArgs.
 Ссылки
 PromptPointOptionsEventArgs Свойства, Топики, PromptPointOptionsEventArgs Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!