Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PlotLogger.ErrorHasHappenedInSheet
 Послать отзыв
 Только для чтения
 Синтаксис
C#
Visual Basic
public bool ErrorHasHappenedInSheet;
Public Property ErrorHasHappenedInSheet() As bool
 Ссылки
 PlotLogger Класс, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!