Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод KeywordCollection.Add (String^, String^, String^)
 Послать отзыв
 Синтаксис
C#
Visual Basic
public void Add(ref String globalName, ref String localName, ref String displayName);
Public Sub Add(ByRef globalName As String, ByRef localName As String, ByRef displayName As String)
 Параметры
 Параметры
 Описание
 globalName
 Глобальное имя. Оно никогда не показывается на экране, а применяется для того, чтобы доступ к ключевому слову производился независимо от локализации (используемого языка).
 localName
 Локальное имя. Это имя вводится пользователем для идентификации этого ключевого слова.
 displayName
 Отображаемое имя. Это имя отображается в командной строке и обычно совпадает с локальным именем.
 Описание
 Метод добавляет ключевое слово в коллекцию, задавая значения глобального, локального и отображаемого имени ключевого слова.
 Отображаемое имя показывается в командной строке и обычно совпадает с локальным именем.
 Ссылки
 KeywordCollection Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!