Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptIntegerResult.Value
 Послать отзыв
 Свойство возвращает целое число, введённое пользователем через интерактивную команду ввода, например, с помощью метода GetInteger().
 Синтаксис
C#
Visual Basic
Копировать Код
public int Value { get; }
Копировать Код
Public ReadOnly Property Value As Integer
 Возвращает
 Возвращает значение типа int, представляющее собой число, введённое пользователем в результате интерактивной команды ввода. Если операция успешна (Status == OK) — корректное целое число. Если операция отменена или произошла ошибка — значение по умолчанию (0) или недопустимое значение, в зависимости от контекста. Для проверки успешности ввода рекомендуется использовать свойство Status.
 Описание
 Свойство предоставляет доступ к числовому значению, введённому пользователем в ходе интерактивного приглашения. Оно используется, например, после вызова метода GetInteger(), чтобы получить результат ввода — целое число в диапазоне от -32768 до 32767 (ограничение 16-битного целого). Свойство доступно только для чтения и содержит значение только в случае успешного завершения операции (Status == PromptStatus.OK). Если операция была отменена или завершена с ошибкой, значение может быть не определено или равно 0.
 Условия
 Только чтение
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("PromptIntegerResultExample_Value")] public void PromptIntegerResultExample_Value() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создаём запрос пользователю PromptIntegerOptions iopts = new PromptIntegerOptions("Введите целое число"); iopts.DefaultValue = 10; iopts.LowerLimit = 0; iopts.UpperLimit = 100; // Вызываем метод GetInteger() для запроса пользователю PromptIntegerResult result = editor.GetInteger(iopts); // Если все данные введены, выводим результат в командную строку if (PromptStatus.OK == result.Status) { int value = result.Value; editor.WriteMessage($"\nВы ввели: {value}"); } else { editor.WriteMessage("\nОтмена или ошибка ввода."); } } }
 Ссылки
 HostMgd.EditorInput.PromptIntegerResult, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!