Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство DocumentIterator.Current
 Послать отзыв
 Синтаксис
C#
Visual Basic
public System.Object Current;
Public Property Current() As System.Object
 Описание
 Указатель на документ, соответствующий текущему значению итератора. Возвращается значение Document^ или nullptr. Последнее - при выходе позиции за пределы коллекции. Позиция выходит за пределы при создании итератора (перед первым вызовом MoveNext()) и после возвращения методом MoveNext() значения false.
 Ссылки
 DocumentIterator Класс, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!