Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.Windows.ToolPalette.CustomToolBase.DragLeave
 Послать отзыв
 Метод вызывается, когда перетаскиваемый объект стандартного инструмента покидает область панели инструментов. Не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void DragLeave();
Копировать Код
Public Overridable Sub DragLeave()
 Описание
 Метод предназначен для поддержки панелями инструментов процесса перетаскивания (Drag-and-Drop) и вызывается, когда перетаскиваемый объект стандартного инструмента покидает область панели инструментов.
 В текущей версии не реализован.
 Ссылки
 HostMgd.Windows.ToolPalette.CustomToolBase, HostMgd.Windows.ToolPalette
 Ваши комментарии по поводу этого топика: Послать отзыв!