Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод PlotLogger.LogSevereError
 Послать отзыв
 Синтаксис
C#
Visual Basic
public void LogSevereError(ref System.String message);
Public Sub LogSevereError(ByRef message As System.String)
 Ссылки
 PlotLogger Класс, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!