Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод BeginAggregationEventArgs.AddGlobalResourceRange
 Послать отзыв
 This is AddGlobalResourceRange, a member of class BeginAggregationEventArgs.
 Синтаксис
C#
Visual Basic
public void AddGlobalResourceRange(ref array<HostMgd::Publishing::EPlotResource^> resources);
Public Sub AddGlobalResourceRange(ByRef resources As array<HostMgd.Publishing.EPlotResource^>)
 Ссылки
 BeginAggregationEventArgs Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!