Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 JigPromptPointOptions.JigPromptPointOptions(String)
 Послать отзыв
 Конструктор класса с одним параметром.
 Синтаксис
C#
Visual Basic
public JigPromptPointOptions(ref System.String message);
Public Sub New(ByRef message As System.String)
 Параметры
 Параметры
 Описание
 message
 Текстовое сообщение, приглашающее указать точку для дальнейших действий с объектом или группой объектов.
 Описание
 Конструктор класса. Присваивает свойству Message значение параметра message Также конструктор устанавливает значение свойства Cursor равное CursorType.Crosshair (перекрестие).
 Пример
C#
 Копировать Код
 JigPromptPointOptions pointOptions = new JigPromptPointOptions("Точка:");
Visual Basic
 Копировать Код
 Dim pointOptions As JigPromptPointOptions = New JigPromptPointOptions("Точка:")
 Ссылки
 JigPromptPointOptions Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!