Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.Drag(Jig)
 Послать отзыв
 Метод запускает операцию перетаскивания с использованием объекта Jig и возвращает результат этой операции.
 Синтаксис
C#
Visual Basic
Копировать Код
public PromptResult Drag(Jig jig);
Копировать Код
Public Function Drag(jig As Jig) As PromptResult
 Параметры
 Параметры
 Описание
 jig
 Объект, реализующий логику интерактивного перемещения или изменения геометрии. Может быть унаследован от класса Jig, чтобы определить поведение при перетаскивании (например, изменение положения точки, длины линии и т. д.). Тип Jig.
 Возвращает
 Возвращает значение типа PromptResult, содержащее результат выполнения операции перетаскивания. Статус может быть: OK (операция завершена успешно), Cancel (отменена пользователем), Error (ошибка во время операции) и другие. При необходимости содержит дополнительные данные, например, конечную позицию или введённое значение. Используется для дальнейшей обработки результата после завершения операции.
 Описание
 Метод используется для реализации интерактивного перемещения или изменения геометрического объекта в реальном времени в окне nanoCAD. Он инициирует операцию "привязки" (jig), позволяя пользователю манипулировать объектом через мышь или другие устройства ввода. Метод ожидает завершения операции и возвращает значение типа PromptResult, которое указывает на успешность выполнения или причину прерывания.
 Пример
 Примеры работы с методом приведены в описаниях классов DrawJig и EntityJig и в статьях Как использовать технологию EntityJig и Как использовать технологию DrawJig.
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!