Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.GraphicsSystem.Manager.DisplaySize
 Послать отзыв
 Свойство DisplaySize представляет текущий размер экрана.
 Синтаксис
C#
Visual Basic
Копировать Код
public System.Drawing.Size DisplaySize;
Копировать Код
Public ReadOnly Property DisplaySize As System.Drawing.Size
 Возвращает
 Возвращает текущий размер экрана. Тип System.Drawing.Size.
 Описание
 Свойство DisplaySize представляет текущий размер экрана.
 Условия
 Только чтение.
 Ссылки
 HostMgd.GraphicsSystem.Manager, HostMgd.GraphicsSystem
 Ваши комментарии по поводу этого топика: Послать отзыв!