Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.Windows.ToolPalette.CustomToolBase.CreateTool
 Послать отзыв
 Метод создаёт объект инструмента. Не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual System.Object CreateTool();
Копировать Код
Public Overridable Function CreateTool() As System.Object
 Возвращает
 Возвращает созданный объект инструмента. Тип System.Object.
 Описание
 Метод создаёт объект инструмента.
 В текущей версии не реализован.
 Ссылки
 HostMgd.Windows.ToolPalette.CustomToolBase, HostMgd.Windows.ToolPalette
 Ваши комментарии по поводу этого топика: Послать отзыв!