Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод XrefFileLock.GetXloadCtlType
 Послать отзыв
 Синтаксис
C#
Visual Basic
public int GetXloadCtlType(Teigha::DatabaseServices::ObjectId selectedBlockId);
Public Function GetXloadCtlType(selectedBlockId As Teigha.DatabaseServices.ObjectId) As Integer
 Параметры
 Параметры
 Описание
 selectedBlockId
 Выбранный ID записи таблицы блоков
 Описание
 Метод возвращает значение системной переменной XLOADCTL для текущего заблокированного объекта. Метод xloadctlType() работает в реальном времени (определяет ID внешней ссылки, когда метод выполняется) и не влияет на текущее значение режима блокировки объекта.
 Ссылки
 XrefFileLock Класс, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!