Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.Windows
 Послать отзыв
 Пространство имен HostMgd.Windows включает классы, делегаты и перечисления, предназначенные для создания пользовательского оконного интерфейса (окна, диалоги, панели инструментов, меню и т.п.).
 Описание
 Пространство имен HostMgd.Windows включает классы, делегаты и перечисления, предназначенные для создания пользовательского оконного интерфейса (окна, диалоги, панели инструментов, меню и т.п.).
 Классы
 Имя
 Описание
 ColorDialog
 Этот класс представляет диалоговое окно, позволяющее пользователю выбрать цвет.
 ContextMenuExtension
 DropTarget
 Приложение получает из этого класса орудие поведения при операции перетаскивания
 InfoCenter
 This is class HostMgd::Windows::InfoCenter.
 LayerTransparencyDialog
 This is class HostMgd::Windows::LayerTransparencyDialog.
 LineWeightDialog
 This is class HostMgd::Windows::LineWeightDialog.
 LinetypeDialog
 This is class HostMgd::Windows::LinetypeDialog.
 Menu
 Абстрактный класс меню.
 MenuItem
 Пункт меню.
 MenuItemCollection
 Коллекция, содержащая объекты MenuItem.
 OpenFileDialog
 Диалог открытия файла или выбора папки
 Palette
 This is class HostMgd::Windows::Palette.
 PaletteActivatedEventArgs
 This is class HostMgd::Windows::PaletteActivatedEventArgs.
 PaletteAddContextMenuEventArgs
 This is class HostMgd::Windows::PaletteAddContextMenuEventArgs.
 PalettePersistEventArgs
 This is class HostMgd::Windows::PalettePersistEventArgs.
 PaletteSet
 Набор панелей
 PaletteSetHelpEventArgs
 This is class HostMgd::Windows::PaletteSetHelpEventArgs.
 PaletteSetMoveEventArgs
 This is class HostMgd::Windows::PaletteSetMoveEventArgs.
 PaletteSetSizeEventArgs
 This is class HostMgd::Windows::PaletteSetSizeEventArgs.
 PaletteSetStateEventArgs
 This is class HostMgd::Windows::PaletteSetStateEventArgs.
 PaletteShowDockBarEventArgs
 This is class HostMgd::Windows::PaletteShowDockBarEventArgs.
 Pane
 This is class HostMgd::Windows::Pane.
 PaneCollection
 This is class HostMgd::Windows::PaneCollection.
 PlotStyleDialog
 This is class HostMgd::Windows::PlotStyleDialog.
 SaveFileDialog
 Диалог сохранения файла
 StatusBar
 This is class HostMgd::Windows::StatusBar.
 StatusBarItem
 This is class HostMgd::Windows::StatusBarItem.
 StatusBarMouseDownEventArgs
 This is class HostMgd::Windows::StatusBarMouseDownEventArgs.
 TrayItem
 This is class HostMgd::Windows::TrayItem.
 TrayItemBubbleWindow
 This is class HostMgd::Windows::TrayItemBubbleWindow.
 TrayItemBubbleWindowClosedEventArgs
 This is class HostMgd::Windows::TrayItemBubbleWindowClosedEventArgs.
 TrayItemCollection
 This is class HostMgd::Windows::TrayItemCollection.
 Visuals
 This is class HostMgd::Windows::Visuals.
 Window
 WindowOnHandle
 This is class HostMgd::Windows::WindowOnHandle.
 Пространства имен
 Имя
 Описание
 ToolPalette
 Пространство имен HostMgd.Windows.ToolPalette включает классы, перечисления и делегаты, предназначенные для создания в пользовательском интерфейсе разнообразных панелей инструментов.
 Ссылки
 Классы, Перечисления, Пространства имен, Делегаты
 Ваши комментарии по поводу этого топика: Послать отзыв!