Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.BeginPageEventArgs.PlotInfo
 Послать отзыв
 Свойство PlotInfo представляет данные конфигурации печати документа.
 Синтаксис
C#
Visual Basic
Копировать Код
public HostMgd.PlottingServices.PlotInfo PlotInfo;
Копировать Код
Public ReadOnly Property PlotInfo As HostMgd.PlottingServices.PlotInfo
 Возвращает
 Возвращает настройки печати документа. Тип HostMgd.PlottingServices.PlotInfo.
 Описание
 Свойство PlotInfo представляет настройки печати документа (конфигурация устройства печати, слои и др.).
 Условия
 Только чтение.
 Ссылки
 HostMgd.PlottingServices.BeginPageEventArgs, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!