Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.SelectionSetDelayMarshalled.GetEnumerator
 Послать отзыв
 Метод предоставляет перечислитель для данного набора выделенных объектов чертежа. Не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public sealed override System.Collections.IEnumerator GetEnumerator();
Копировать Код
Public NotOverridable Overrides Function GetEnumerator() As System.Collections.IEnumerator
 Возвращает
 Возвращает перечислитель для данного набора объектов. Тип System.Collections.IEnumerator.
 Описание
 Метод предоставляет перечислитель для данного набора выделенных объектов чертежа.
 В текущей версии не реализован.
 Ссылки
 HostMgd.EditorInput.SelectionSetDelayMarshalled, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!