Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.DsdEntryCollection.Add
 Послать отзыв
 Метод добавляет указанный объект в конец этой коллекции.
 Синтаксис
C#
Visual Basic
Копировать Код
public int Add( ref HostMgd.PlottingServices.DsdEntry value );
Копировать Код
Public Function Add( ByRef value As HostMgd.PlottingServices.DsdEntry ) As Integer
 Параметры
 Параметры
 Описание
 value
 Входной объект, который требуется ввести в коллекцию. Тип HostMgd.PlottingServices.DsdEntry.
 Возвращает
 Возвращает индекс вновь созданного элемента коллекции. Тип int.
 Описание
 Метод добавляет указанный объект в конец этой коллекции и возвращает индекс вновь созданного элемента коллекции. Индексация в коллекции начинается с нуля.
 Ссылки
 HostMgd.PlottingServices.DsdEntryCollection, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!