Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Класс HostMgd.PrintForm
 Послать отзыв
 Иерархия классов
HostMgd::PrintForm
 Синтаксис
C#
Visual Basic
public class PrintForm : System.Windows.Forms.Form;
Public Class PrintForm Inherits System.Windows.Forms.Form
 Методы
 Конструкторы
 Имя
 Описание
 PrintForm
 This is PrintForm, a member of class PrintForm.
 Топики
 Имя
 Описание
 PrintForm Свойства
 Ниже перечислены свойства класса PrintForm.
 Ссылки
 PrintForm Свойства, Методы, Топики, PrintForm Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!