Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.DocumentWindowCollection.ArrangeIcons
 Послать отзыв
 Метод предназначен для размещения иконок дочерних окон MDI. В текущей версии не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public void ArrangeIcons();
Копировать Код
Public Sub ArrangeIcons()
 Описание
 Метод предназначен для размещения иконок дочерних окон MDI (Multiple Document Interface). В текущей версии не реализован.
 Ссылки
 HostMgd.ApplicationServices.DocumentWindowCollection, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!