Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор TargetProductInfo.TargetProductInfo
 Послать отзыв
 This is TargetProductInfo, a member of class TargetProductInfo.
 Синтаксис
C#
Visual Basic
public TargetProductInfo();
Public Sub New()
 Ссылки
 TargetProductInfo Класс, HostMgd.Windows.ToolPalette
 Ваши комментарии по поводу этого топика: Послать отзыв!