Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Класс HostMgd.PlottingServices.PlotFactory
 Послать отзыв
 Класс реализующий ряд статических методов и свойств характеризующих текущее состояние печати
 Иерархия классов
HostMgd::PlottingServices::PlotFactory
 Синтаксис
C#
Visual Basic
[Wrapper("AcPlPlotFactory")] public class PlotFactory;
<Wrapper("AcPlPlotFactory")> Public Class PlotFactory
 Топики
 Имя
 Описание
 PlotFactory Методы
 Ниже перечислены методы класса PlotFactory.
 PlotFactory Свойства
 Ниже перечислены свойства класса PlotFactory.
 Ссылки
 PlotFactory Методы, PlotFactory Свойства, Топики, PlotFactory Методы, PlotFactory Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!