Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 JigPrompts.AcquireString(String)
 Послать отзыв
 Метод запрашивает у пользователя строку/текстовые данные, используя при запросе приглашающее сообщение.
 Синтаксис
C#
Visual Basic
public HostMgd.EditorInput.PromptResult AcquireString(ref System.String message);
Public Function AcquireString(ByRef message As System.String) As HostMgd.EditorInput.PromptResult
 Параметры
 Параметры
 Описание
 message
 Текстовое сообщение, приглашающее ввести текст для дальнейших действий с объектом или группой объектов. Сообщение будет выводиться на экране во время работы метода.
 Возвращает
 Возвращает результат типа string, который является строкой, введенной пользователем с клавиатуры в ответ на запрос.
 Описание
 Метод предназначен для запроса у пользователя текстовых данных, которые необходимо ввести с клавиатуры. После вызова создает экземпляр класса JigPromptStringOptions, присваивает его свойству Message значение параметра message и вызывает свою перегрузку JigPrompts.AcquireString(JigPromptStringOptions options).
 Пример
 В примере приведен отрывок кода из реализации метода Sampler() класса Jig.
C#
 Копировать Код
 PromptResult result = prompts.AcquireString("Текст:");
Visual Basic
 Копировать Код
 Dim result As PromptResult = prompts.AcquireString("Текст:")
 Ссылки
 JigPrompts Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!