Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.EndPageEventHandler(Object, EndPageEventArgs)
 Послать отзыв
 Делегат предназначен для обработки события PlotReactorManager.EndPage, возникающего сразу после завершения вывода страницы на плоттер.
 Синтаксис
C#
Visual Basic
Копировать Код
public delegate void EndPageEventHandler( Object sender, EndPageEventArgs e );
Копировать Код
Public Delegate Sub EndPageEventHandler( sender As Object, e As EndPageEventArgs )
 Параметры
 Параметры
 Описание
 sender
 Объект, инициировавший событие. Тип Object.
 e
 Аргументы события. Тип EndPageEventArgs.
 Описание
 Делегат EndPageEventHandler предназначен для обработки события PlotReactorManager.EndPage, возникающего сразу после завершения вывода страницы на плоттер.
 Контекст события передается через параметры sender и e, где sender определяет объект-инициатор события, а аргумент e типа EndPageEventArgs передает состояние флага SheetCancelStatus.
 Ваши комментарии по поводу этого топика: Послать отзыв!