Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство TrayItemCollection.IsSynchronized
 Послать отзыв
 This is IsSynchronized, a member of class TrayItemCollection.
 Синтаксис
C#
Visual Basic
public bool IsSynchronized;
Public Property IsSynchronized() As bool
 Ссылки
 TrayItemCollection Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!