Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptEntityResultEventArgs.Result
 Послать отзыв
 Свойство предоставляет доступ к результату операции выбора геометрического объекта, включая статус и данные о выбранном элементе.
 Синтаксис
C#
Visual Basic
Копировать Код
public PromptEntityResult Result { get; }
Копировать Код
Public ReadOnly Property Result As PromptEntityResult
 Возвращает
 Возвращает экземпляр класса PromptEntityResult, содержащий:
Status — статус завершения операции выбора (PromptStatus.OK, если выбор успешен).
Value — значение типа PromptEntityResult.ValueType, содержащее ObjectId и Point3d PickedPoint.
StringResult — строковое значение, если операция была прервана пользователем через клавиатуру.
 Если операция не была завершена корректно, результат может содержать null или статус, отличный от OK.
 Описание
 Свойство возвращает объект типа PromptEntityResult, который содержит информацию о завершении операции выбора объекта — например, после вызова метода GetEntity() или при обработке события PromptedForEntity. Оно позволяет получить:
ObjectId — идентификатор выбранного объекта.
PickedPoint — точку указания объекта в мировой системе координат (WCS).
Статус операции (OK, Cancel, Error и др.).
 Это свойство используется для анализа результата выбора объекта, проверки его допустимости и выполнения дальнейших действий с ним. Доступно только для чтения и обновляется автоматически при завершении интерактивной операции.
 Условия
 Только чтение
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события PromptedForEntity [Teigha.Runtime.CommandMethod("PromptedForEntityExample_Result")] public void PromptedForEntityExample_Result() { // Подписка на событие PromptedForEntity editor.PromptedForEntity += OnEditorPromptedForEntity; } // Реализация отработки события PromptedForEntity private void OnEditorPromptedForEntity(object sender, PromptEntityResultEventArgs e) { // Получаем доступ к результатам запроса PromptEntityResult result = e.Result; // Вывод сообщения в командную строку if (result != null && result.Status == PromptStatus.OK) { editor.WriteMessage($"\nВыбран объект: {result.ObjectId}"); } } }
 Ссылки
 HostMgd.EditorInput.PromptEntityResultEventArgs, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!