Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.StartUserInteraction(Control)
 Послать отзыв
 Метод скрывает указанную модальную форму и позволяет пользователю продолжить взаимодействие с чертежом, выполняя другие команды.
 Синтаксис
C#
Visual Basic
Копировать Код
public EditorUserInteraction StartUserInteraction(System.Windows.Forms.Control modalForm);
Копировать Код
Public Function StartUserInteraction(modalForm As System.Windows.Forms.Control) As EditorUserInteraction
 Параметры
 Параметры
 Описание
 modalForm
 Модальная форма (или элемент управления), которая была открыта и блокирует стандартное взаимодействие с чертежом. Передавая её в метод, вы предоставляете редактору информацию о том, что форма активна, но допускается выполнение других команд. Тип System.Windows.Forms.Control
 Возвращает
 Возвращает объект типа EditorUserInteraction, представляющий текущий контекст взаимодействия пользователя с редактором. Этот объект реализует IDisposable и должен быть использован внутри блока using, чтобы корректно завершить сессию взаимодействия после завершения операции.
 Описание
 Метод используется для временного освобождения интерфейса nanoCAD от блокировки, вызванной отображением модальной формы. Это позволяет продолжить выполнение других команд в редакторе, не закрывая форму полностью. Метод возвращает объект EditorUserInteraction, который управляет контекстом взаимодействия пользователя с чертежом до тех пор, пока форма остаётся открытой.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("StartUserInteractionExample")] public void StartUserInteractionExample() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Вызываем модальное окно, определённое заранее using (MyCustomForm form = new MyCustomForm()) { // Вызываем метод, указав, к какому окну его применять EditorUserInteraction interaction = editor.StartUserInteraction(form); // Позволяет пользователю взаимодействовать с чертежом PromptPointResult result = editor.GetPoint("Укажите точку:"); if (result.Status == PromptStatus.OK) { // Обработка точки } } // interaction.Dispose() вызывается автоматически при выходе из using } }
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!