Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство EntityJig.Entity
 Послать отзыв
 Возвращает пользовательский примитив.
 Синтаксис
C#
Visual Basic
public DatabaseServices.Entity Entity;
Public Property Entity() As DatabaseServices.Entity
 Описание
 Примечания
 Возвращает пользовательский примитив.
 Условия
 Только чтение.
 Ссылки
 EntityJig Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!