Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptPointOptions
 Послать отзыв
 Класс предоставляет параметры для настройки интерактивного ввода точки в nanoCAD, такие как сообщение, базовая точка и режимы привязки.
 Иерархия классов
HostMgd::EditorInput::PromptOptions HostMgd::EditorInput::PromptEditorOptions HostMgd::EditorInput::PromptCornerOptions HostMgd::EditorInput::PromptPointOptions
 Синтаксис
C#
Visual Basic
Копировать Код
public class PromptPointOptions : PromptCornerOptions
Копировать Код
Public Class PromptPointOptions Inherits PromptCornerOptions
 Описание
 Класс наследуется от PromptCornerOptions и используется для настройки параметров, передаваемых в методы ввода точки, такие как GetPoint() или GetCorner(). Он позволяет задать:
текст приглашения , отображаемый пользователю,
базовую точку , относительно которой будет происходить ввод,
режимы привязки и отображения (например, штриховая линия),
допустимость пропуска ввода с помощью клавиши Enter .
 Эти параметры дают разработчикам надстроек возможность гибко управлять поведением команды ввода точки, улучшая пользовательский интерфейс и взаимодействие с чертежом.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; [Teigha.Runtime.CommandMethod("GetPointExample")] public void GetPointExample() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создаём запрос пользователю PromptPointOptions options = new PromptPointOptions("\nУкажите точку:"); PromptPointResult result = editor.GetPoint(options); // Если все данные введены, выводим результат в командную строку if (result.Status == PromptStatus.OK) { Point3d pt = result.Value; editor.WriteMessage( $"\nВыбранная точка: {pt}"); } else { editor.WriteMessage( "\nВвод точки отменен или произошла ошибка."); } }
 Методы
 Конструкторы
 Класс HostMgd.EditorInput.PromptCornerOptions
 Имя
 Описание
 PromptCornerOptions
 Это обзор перегрузок PromptCornerOptions.
 HostMgd.EditorInput.PromptPointOptions
 Имя
 Описание
 PromptPointOptions
 Это обзор перегрузок PromptPointOptions.
 Топики
 Имя
 Описание
 PromptOptions Методы
 Ниже перечислены методы класса PromptOptions.
 PromptOptions Свойства
 Ниже перечислены свойства класса PromptOptions.
 Класс HostMgd.EditorInput.PromptCornerOptions
 Имя
 Описание
 PromptCornerOptions Свойства
 Ниже перечислены свойства класса PromptCornerOptions.
 HostMgd.EditorInput.PromptPointOptions
 Имя
 Описание
 PromptPointOptions Свойства
 Ниже перечислены свойства класса PromptPointOptions.
 Ссылки
 PromptPointOptions Конструктор, PromptPointOptions Свойства, Методы, Топики, PromptOptions Методы, PromptOptions Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!