Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод XrefFileLock.ConsistencyCheck (Teigha::DatabaseServices::ObjectId)
 Послать отзыв
 Синтаксис
C#
Visual Basic
public Teigha::DatabaseServices::ObjectIdCollection ConsistencyCheck(Teigha::DatabaseServices::ObjectId selectedBlockId);
Public Function ConsistencyCheck(selectedBlockId As Teigha.DatabaseServices.ObjectId) As Teigha.DatabaseServices.ObjectIdCollection
 Параметры
 Параметры
 Описание
 selectedBlockId
 ID записей таблицы блоков, которые возвращаются методом
 Описание
 По выбранному ID записи таблицы блоков для внешней ссылки этот метод определяет, является ли файл внешней ссылки все еще синхронизованым с тем файлом, который использовался во время загрузки чертежа. Он также определяет, являются ли любые другие записи таблицы блоков, относящиеся к тому же самому файлу внешней ссылки, также синхронизированными. Эта проверка выполняется путем проверки даты/времени файла внешней ссылки и его размера во время загрузки по сравнению с этими же его характеристиками, актуальными во время выполнения метода. Если внешняя ссылка не синхронизирована, то все ID записей таблицы блоков, которые относятся к файлу внешней ссылки, возвращаются.
 Ссылки
 XrefFileLock Класс, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!