Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Tool.ShapePackage
 Послать отзыв
 This is ShapePackage, a member of class Tool.
 Синтаксис
C#
Visual Basic
public HostMgd::Windows::ToolPalette::CatalogItem ShapePackage;
Public Property ShapePackage() As HostMgd.Windows.ToolPalette.CatalogItem
 Ссылки
 Tool Класс, HostMgd.Windows.ToolPalette
 Ваши комментарии по поводу этого топика: Послать отзыв!