Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод TrayItemCollection.CopyTo (array<TrayItem^>^, int)
 Послать отзыв
 This is CopyTo, a member of class TrayItemCollection.
 Синтаксис
C#
Visual Basic
public void CopyTo(ref array<TrayItem^> array, int index);
Public Sub CopyTo(ByRef array As array<TrayItem^>, index As Integer)
 Ссылки
 TrayItemCollection Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!