Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод DocumentIterator.MoveNext
 Послать отзыв
 Синтаксис
C#
Visual Basic
public bool MoveNext();
Public Function MoveNext() As bool
 Описание
 Метод перемещает текущий указатель на следующую запись. При перемещении указателя за пределы коллекции метод возвращает значение false, в противном случае метод возвращает значение true.
 Ссылки
 DocumentIterator Класс, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!