Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptAngleOptions.GetDefaultValueString()
 Послать отзыв
 Метод возвращает строковое представление угла по умолчанию, заданного в параметрах ввода угла.
 Синтаксис
C#
Visual Basic
Копировать Код
public System.String GetDefaultValueString();
Копировать Код
Public Function GetDefaultValueString() As System.String
 Возвращает
 Возвращает значение типа string, представляющее собой отформатированное значение угла по умолчанию (в градусах или радианах), например: "90" — если угол задан как Math.PI / 2. "0" — если DefaultValue равен 0. Если значение угла по умолчанию не задано (например, равно null или 0.0), метод может вернуть пустую строку или строковое представление угла 0.
 Описание
 Метод предназначен для получения значения угла по умолчанию, хранящегося в свойстве DefaultValue, в виде строки, отформатированной в градусах или радианах в зависимости от настроек локализации и контекста. Это удобно при отображении подсказок, сообщений или формировании строки ввода с предустановленным значением для пользователя.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("PromptAngleOptionsExample_GetDefaultValueString")] public void PromptAngleOptionsExample_GetDefaultValueStrin() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создаём запрос пользователю, чтобы он указал угол на чертеже PromptAngleOptions options = new PromptAngleOptions("Введите угол поворота:"); options.DefaultValue = Math.PI / 2; // Задаём угол по умолчанию 90 градусов // Вызываем метод GetDefaultValueString(), записав результат в переменную string defaultAngle = options.GetDefaultValueString(); // Вывод сообщения в командную строку editor.WriteMessage($"\nЗначение по умолчанию: {defaultAngle} радиан"); } }
 Ссылки
 HostMgd.EditorInput.PromptAngleOptions, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!