Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.Windows.ToolPalette.CustomToolBase.CurrentShapeId
 Послать отзыв
 Свойство CurrentShapeId представляет текущее значение идентификатора формы. Не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public Guid CurrentShapeId;
Копировать Код
Public Property CurrentShapeId As Guid
 Возвращает
 Возвращает текущее значение идентификатора формы. Тип Guid.
 Описание
 Свойство CurrentShapeId представляет текущее значение идентификатора формы (Guid).
 В текущей версии не реализовано.
 Условия
 Чтение и запись.
 Ссылки
 HostMgd.Windows.ToolPalette.CustomToolBase, HostMgd.Windows.ToolPalette
 Ваши комментарии по поводу этого топика: Послать отзыв!