Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.GraphicsSystem.Manager.GetDBModel
 Послать отзыв
 Метод предоставляет модель графической системы, связанную с базой данных чертежа.
 Синтаксис
C#
Visual Basic
Копировать Код
public Teigha.GraphicsSystem.Model GetDBModel();
Копировать Код
Public Function GetDBModel() As Teigha.GraphicsSystem.Model
 Возвращает
 Возвращает модель GS. Тип Teigha.GraphicsSystem.Model.
 Описание
 Метод предоставляет модель графической системы (GS), связанную с базой данных Database чертежа.
 Ссылки
 HostMgd.GraphicsSystem.Manager, HostMgd.GraphicsSystem
 Ваши комментарии по поводу этого топика: Послать отзыв!