Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.Windows.ToolPalette.CustomToolBase.BeginEdit
 Послать отзыв
 Метод начинает редактирование свойств инструмента. Вызывается фреймворком после вызова метода Load() перед отображением диалогового окна для редактирования свойств инструмента. Не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void BeginEdit();
Копировать Код
Public Overridable Sub BeginEdit()
 Описание
 Метод начинает редактирование свойств инструмента. Вызывается фреймворком после вызова метода Load() перед отображением диалогового окна для редактирования свойств инструмента. Этот метод вызывается только тогда, когда редактирование выполняется фреймворком, но не инструментом.
 В текущей версии не реализован.
 Ссылки
 HostMgd.Windows.ToolPalette.CustomToolBase, HostMgd.Windows.ToolPalette
 Ваши комментарии по поводу этого топика: Послать отзыв!