Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.PromptedForString
 Послать отзыв
 Событие возникает после завершения операции ввода строки пользователем в редакторе nanoCAD. Событие не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public event PromptStringResultEventHandler PromptedForString;
Копировать Код
Public Event PromptedForString As PromptStringResultEventHandler
 Описание
 Событие инициируется платформой nanoCAD при завершении интерактивного ввода текстовой строки — например, после вызова метода GetString() или других команд, где требуется ввод текста. Оно предоставляет разработчикам доступ к результату ввода, включая введённую строку (Value), статус выполнения (OK, Cancel, Error) и параметры команды.
 Событие реализуется через делегат PromptStringResultEventHandler, который передаёт данные в виде объекта PromptStringResultEventArgs. Это позволяет реагировать на действия пользователя, обрабатывать ввод, проверять допустимость значения или выполнять другие действия на основе введённой строки.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события PromptedForString [Teigha.Runtime.CommandMethod("PromptedForStringExample")] public void PromptedForStringExample() { // Подписка на событие PromptedForString editor.PromptedForString += OnEditorPromptedForString; } // Реализация отработки события PromptedForString private void OnEditorPromptedForString(object sender, PromptStringResultEventArgs e) { // Вывод сообщения в командную строку if (e.Result.Status == PromptStatus.OK) { editor.WriteMessage($"\nВведено: {e.Result.StringResult}"); } else { editor.WriteMessage("\nВвод строки отменён."); } } }
 Порядок работы с событием:
Вызывается метод GetString() или аналогичный.
Пользователь вводит строку или отменяет операцию.
Генерируется событие PromptedForString.
Разработчик получает доступ к результату ввода через параметры события.
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!