Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.Drag(PromptDragOptions)
 Послать отзыв
 Метод предлагает пользователю переместить выделенный набор графических объектов пространства модели или листа с помощью перетаскивания и возвращает результат операции.
 Синтаксис
C#
Visual Basic
Копировать Код
public PromptPointResult Drag(PromptDragOptions options);
Копировать Код
Public Function Drag(options As PromptDragOptions) As PromptPointResult
 Параметры
 Параметры
 Описание
 options
 Объект, задающий параметры операции перетаскивания:
 Возвращает
 Возвращается значение типа PromptPointResult, представляющее результат выполнения операции перетаскивания. Содержит статус операции: OK (успешно завершена), Cancel (отменена пользователем), Error (ошибка) и другие. Если операция успешна, содержит конечную точку (Value типа Point3d), на которую были перемещены объекты. Используется для последующей обработки результата, например, фиксации нового положения объектов.
 Описание
 Метод используется для инициации интерактивного перемещения одного или нескольких выделенных графических объектов в текущем чертеже nanoCAD. Пользователь может перетаскивать объекты мышью, а система отображает их новое положение. Метод поддерживает только графические объекты из пространства модели или пространства листа текущего документа — неграфические объекты и примитивы из других блоков не поддерживаются. После завершения операции метод возвращает результат, содержащий статус и конечную точку перемещения.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; using Teigha.DatabaseServices; using Teigha.Geometry; public partial class Commands { // Глобальная переменная для точки начала перемещения, т.к. она необходима // в нескольких методах. Можно сделать запрос пользователю, чтобы он указал эту точку // на чертеже Point3d basePoint = new Point3d(0, 0, 0); // Метод команды, который можно вызвать через командную строку nanoCAD [Teigha.Runtime.CommandMethod("DragExample_PromptDragOptions")] public void DragExample_PromptDragOptions() { // Получаем доступ к dwg-документу и через него к редактору и базе данных документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; Database db = doc.Database; // Сначала необходимо выбрать объекты на чертеже // Для этого делаем запрос пользователю PromptSelectionOptions selectionOpts = new PromptSelectionOptions(); selectionOpts.MessageForAdding = "Выберитае объект для перемещения"; selectionOpts.MessageForRemoval = "Выберите объект для удаления из выборки"; PromptSelectionResult selectionResult = editor.GetSelection(selectionOpts); // Если набор объектов получен, то далее запрашиваем у пользователя точку, // в которую необходимо переместить выбранные объекты if(selectionResult.Status == PromptStatus.OK&&selectionResult.Value.Count>0) { // Запрашиваем у пользователя точку, в которую необходимо переместить выбранные объекты. // На экране будет виден предпросмотр перемещения DragCallback callback = OnDrag; PromptDragOptions options = new PromptDragOptions(selectionResult.Value, "\nВыберите точку для перемещения объектов:", callback); PromptPointResult result = editor.Drag(options); // Когда точка выбрана, изменяем положение объектов в базе данных черетжа if (result.Status == PromptStatus.OK) { // Рассчитываем матрицу перемещения Vector3d vector = basePoint.GetVectorTo(result.Value); Matrix3d mat = Matrix3d.Displacement(vector); // Запускаем транзакцию для изменения положения объектов using (Transaction trans = db.TransactionManager.StartTransaction()) { // Перебираем коллекцию объектов чертежа, положение которых нужно изменить foreach (SelectedObject ssobj in selectionResult.Value) { // Получаем доступ к объекту и изменяем его положение с помощью матрицы перемещения ObjectId objectId = ssobj.ObjectId; DBObject dbobj = trans.GetObject(objectId, OpenMode.ForWrite); Entity ent = dbobj as Entity; ent.TransformBy(mat); } // Сохраняем в базе данных чертежа изменения trans.Commit(); } editor.WriteMessage($"\nОбъекты перемещены в точку: {result.Value}"); } } } // Метод для делегата DragCallback, с помощью которого отображается // предпросмотр перемещения public SamplerStatus OnDrag(Point3d current, ref Matrix3d xform) { // Рассчитываем вектор перемещения от начальной точки basePoint Vector3d offset = basePoint.GetVectorTo(current); // Сдвиг объекта к курсору xform = Matrix3d.Displacement(offset); // Продолжаем операцию return SamplerStatus.OK; } }
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!