Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод PickPointDescriptor.IsEqualTo (HostMgd::EditorInput::PickPointDescriptor^)
 Послать отзыв
 Синтаксис
C#
Visual Basic
public bool IsEqualTo(ref HostMgd::EditorInput::PickPointDescriptor a);
Public Function IsEqualTo(ByRef a As HostMgd.EditorInput.PickPointDescriptor) As bool
 Параметры
 Параметры
 Описание
 a
 Объект для сравнения
 Описание
 Этот метод сравнивает свойства PointOnLine (базовая точка) и Direction (направление) объекта a, являющегося параметром метода, с такими же свойствами данного объекта с допуском Global.
 Ссылки
 PickPointDescriptor Структура, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!