Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.GetKeywords(String,String[])
 Послать отзыв
 Метод позволяет пользователю ввести одно из заданных ключевых слов с клавиатуры, выводя сообщение-приглашение и проверяя ввод на соответствие списку допустимых вариантов.
 Синтаксис
C#
Visual Basic
Копировать Код
public PromptResult GetKeywords(String message, String[] globalKeywords);
Копировать Код
Public Function GetKeywords(message As String, globalKeywords As String[]) As PromptResult
 Параметры
 Параметры
 Описание
 message
 Сообщение, отображаемое в командной строке для приглашения пользователя к вводу (например, "Выберите действие:"). Тип String.
 globalKeywords
 Массив строк, представляющий список допустимых ключевых слов (например, new string[] { "Открыть", "Сохранить", "Выход" }). Пользователь должен выбрать одно из этих значений. Тип String[].
 Возвращает
 Возвращает объект типа PromptResult, который содержит:
Status — статус операции (OK, Cancel, Error и др.).
StringResult — введённое пользователем ключевое слово (если ввод успешен).
 Если пользователь ввёл допустимое ключевое слово, статус будет OK. Если операция была прервана или введено недопустимое значение, статус будет другим.
 Описание
 Метод используется для получения от пользователя одного из заранее определённых ключевых слов. Пользователь вводит значение в командной строке. Если введённое значение не совпадает ни с одним из списка globalKeywords, nanoCAD выводит сообщение об ошибке и предлагает повторный ввод. Нажатие Enter без текста возвращает пустую строку, если это не запрещено системой или настройками ввода. Метод поддерживает интерактивный выбор из ограниченного набора допустимых команд или параметров.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("GetKeywordsExample_String_StringArr")] public void GetKeywordsExample__String_StringArr() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создаём запрос пользователю string[] keywords = new string[] { "Да", "Нет", "Отмена" }; PromptResult pr = editor.GetKeywords("Продолжить выполнение?", keywords); // Если все данные введены, выводим результат в командную строку if (pr.Status == PromptStatus.OK) { editor.WriteMessage( $"\nВыбрано: {pr.StringResult}"); } else { editor.WriteMessage( "\nВвод отменён или произошла ошибка."); } } }
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!