Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.LongTransactionManager.CheckedOut
 Послать отзыв
 Событие CheckedOut возникает после успешного завершения выгрузки объектов в длительную транзакцию (операция CheckOut). В текущей версии не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public event LongTransactionEventHandler CheckedOut;
Копировать Код
Public Event CheckedOut As LongTransactionEventHandler
 Описание
 Событие CheckedOut возникает после успешного завершения выгрузки объектов в длительную транзакцию (операция CheckOut).
 В текущей версии не реализовано.
 Ссылки
 HostMgd.ApplicationServices.LongTransactionManager, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!