Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.EndDocumentEventArgs.PlotCancelStatus
 Послать отзыв
 Свойство PlotCancelStatus возвращает код из перечисления PlotCancelStatus, определяющий состояние отмены печати документа.
 Синтаксис
C#
Visual Basic
Копировать Код
public HostMgd.PlottingServices.PlotCancelStatus PlotCancelStatus;
Копировать Код
Public ReadOnly Property PlotCancelStatus As HostMgd.PlottingServices.PlotCancelStatus
 Возвращает
 Возвращает состояние отмены печати документа как значение из перечисления HostMgd.PlottingServices.PlotCancelStatus.
 Описание
 Свойство PlotCancelStatus возвращает код из перечисления PlotCancelStatus, определяющий состояние отмены печати документа.
 Условия
 Только чтение.
 Ссылки
 HostMgd.PlottingServices.EndDocumentEventArgs, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!