Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.DocumentCollection.DocumentActivationEnabled
 Послать отзыв
 Свойство предназначено для определения возможности переключения между открытыми dwg-документами.
 Синтаксис
C#
Visual Basic
public bool DocumentActivationEnabled;
Public Property DocumentActivationEnabled() As bool
 Возвращает
 Возвращает признак возможности переключения между dwg-документами: true - переключение возможно, false - переключение невозможно. Тип bool
 Описание
 Свойство, определяющее возможность переключения между открытыми документами (активировать требуемый документ).
 Условия
 Чтение и запись
 Ссылки
 HostMgd.ApplicationServices.DocumentCollection, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!