Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.Document.CommandEnded
 Послать отзыв
 Событие, означающее, что команда cmdStr завершена.
 Синтаксис
C#
Visual Basic
public event CommandEventHandler CommandEnded;
Public Event CommandEnded As CommandEventHandler
 Возвращает
 Возвращает тип данных CommandEventHandler
 Описание
 Событие, означающее, что команда cmdStr завершена. Соответствует функции NRX API HostEditorReactor.commandEnded().
 Ссылки
 HostMgd.ApplicationServices.Document, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!