Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Runtime.IMenuItem.Checked
 Послать отзыв
 Свойство Checked позволяет определить, отображается ли флажок на данном элементе меню.
 Синтаксис
C#
Visual Basic
Копировать Код
bool Checked;
Копировать Код
Property Checked As Boolean
 Возвращает
 Возвращает true, если флажок отображается. В противном случае возвращает false.
 Описание
 Свойство Checked позволяет определить, отображается ли флажок на данном элементе меню.
 Условия
 Чтение и запись.
 Ссылки
 MenuItem Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!