Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор AboutToBeginBackgroundPublishingEventArgs.AboutToBeginBackgroundPublishingEventArgs
 Послать отзыв
 This is AboutToBeginBackgroundPublishingEventArgs, a member of class AboutToBeginBackgroundPublishingEventArgs.
 Синтаксис
C#
Visual Basic
public AboutToBeginBackgroundPublishingEventArgs();
Public Sub New()
 Ссылки
 AboutToBeginBackgroundPublishingEventArgs Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!