Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.Windows.ToolPalette.CustomToolBase.New
 Послать отзыв
 Метод предназначен для создания нового пользовательского инструмента. Не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void New();
Копировать Код
Public Overridable Sub New()
 Описание
 Метод предназначен для создания нового пользовательского инструмента. При вызове инициализирует все элементы данных инструмента.
 В текущей версии не реализован.
 Ссылки
 HostMgd.Windows.ToolPalette.CustomToolBase, HostMgd.Windows.ToolPalette
 Ваши комментарии по поводу этого топика: Послать отзыв!