Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор TabbedDialogExtension.TabbedDialogExtension (System::Windows::Forms::Control^, TabbedDialogAction^)
 Послать отзыв
 Синтаксис
C#
Visual Basic
public TabbedDialogExtension(ref System.Windows.Forms.Control control, ref TabbedDialogAction onOK);
Public Sub New(ByRef control As System.Windows.Forms.Control, ByRef onOK As TabbedDialogAction)
 Параметры
 Параметры
 Описание
 control
 Элемент управления С "владелец" данного расширения
 onOK
 Объект, определяющий действия, которые будут выполнены при нажатии на кнопку ОК
 Описание
 Конструктор, назначающий обработчик события, определенный как onOK, выполняемый при нажатии на кнопку ОК в диалоговом окне.
 Ссылки
 TabbedDialogExtension Класс, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!