Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.DocumentWindowCollection.SyncRoot
 Послать отзыв
 Свойство SyncRoot предоставляет объект, используемый для синхронизации доступа к данной коллекции.
 Синтаксис
C#
Visual Basic
Копировать Код
public Object SyncRoot;
Копировать Код
Public ReadOnly Property SyncRoot As Object Implements ICollection.SyncRoot
 Возвращает
 Возвращает объект, используемый для синхронизации доступа к данной коллекции. Тип Object.
 Описание
 Свойство SyncRoot предоставляет объект, используемый для синхронизации доступа к данной коллекции.
 Условия
 Только чтение.
 Ссылки
 HostMgd.ApplicationServices.DocumentWindowCollection, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!