Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод PlotProgress.DeleteUnmanagedObject
 Послать отзыв
 This is DeleteUnmanagedObject, a member of class PlotProgress.
 Синтаксис
C#
Visual Basic
public void DeleteUnmanagedObject();
Public Sub DeleteUnmanagedObject()
 Ссылки
 PlotProgress Класс, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!