Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Camera.IsCameraPlottable
 Послать отзыв
 Свойство IsCameraPlottable позволяет проверить, доступна ли печать для данной камеры. Не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsCameraPlottable;
Копировать Код
Public ReadOnly Property IsCameraPlottable As Boolean
 Возвращает
 Возвращает true, если печать для камеры доступна. В противном случае возвращает false.
 Описание
 Свойство IsCameraPlottable позволяет проверить, доступна ли печать для данной камеры. В текущей версии не реализовано.
 Условия
 Только чтение.
 Ссылки
 HostMgd.EditorInput.Camera, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!