Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Runtime.IMenuItem.Text
 Послать отзыв
 Свойство Text представляет текст на данном элементе меню.
 Синтаксис
C#
Visual Basic
Копировать Код
String Text;
Копировать Код
Property Text As String
 Возвращает
 Возвращает текст для данного элемента меню. Тип String.
 Описание
 Свойство Text представляет текст на данном элементе меню.
 Условия
 Чтение и запись.
 Ссылки
 MenuItem Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!