Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Converter.DistanceToString (double, DistanceUnitFormat, int)
 Послать отзыв
 Синтаксис
C#
Visual Basic
public String DistanceToString(double value, DistanceUnitFormat units, int precision);
Public Function DistanceToString(value As Double, units As DistanceUnitFormat, precision As Integer) As String
 Описание
 Конвертирует расстояние в строку в соответствии с заданными линейными единицами и точностью.
 Ссылки
 Converter Класс, HostMgd.Runtime Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!