Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptEntityOptionsEventArgs.Options
 Послать отзыв
 Свойство предоставляет доступ к параметрам приглашения, используемым при интерактивном выборе геометрического объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public PromptEntityOptions Options { get; }
Копировать Код
Public ReadOnly Property Options As PromptEntityOptions
 Возвращает
 Возвращает объект типа PromptEntityOptions, содержащий параметры выбора объекта. Если объект не был инициализирован, может вернуть null.
 Описание
 Свойство предоставляет доступ к объекту PromptEntityOptions, содержащему настройки команды выбора объекта в nanoCAD. Оно используется в обработчике события PromptingForEntity для динамической модификации параметров ввода перед началом операции — например, при вызове метода GetEntity().
 Через это свойство можно:
задать текст приглашения (Message),
указать допустимые типы объектов с помощью методов SetAllow... (например, SetAllowLines, SetAllowCircles),
добавить ключевые слова,
разрешить или запретить пропуск ввода (AllowNone),
включить произвольный ввод (AllowArbitraryInput).
 Свойство доступно только для чтения, но сам объект PromptEntityOptions может быть изменён, что позволяет гибко настраивать поведение команды в реальном времени.
 Условия
 Только чтение
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события PromptingForEntity [Teigha.Runtime.CommandMethod("PromptingForEntityExample_Options")] public void PromptingForEntityExample_Options() { // Подписка на событие PromptingForEntity editor.PromptingForEntity += OnEditorPromptingForEntity; } // Реализация отработки события PromptingForEntity private void OnEditorPromptingForEntity(object sender, PromptEntityOptionsEventArgs e) { // Изменение сообщения приглашения e.Options.Message = "Выберите окружность:"; // Классы объектов, которые можно выбирать e.Options.AddAllowedClass(typeof(Circle),true); // Разрешаем отсутствие выбора e.Options.AllowNone = true; } }
 Ссылки
 HostMgd.EditorInput.PromptEntityOptionsEventArgs, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!