Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство EPlotPropertyBag.NamespaceUrl
 Послать отзыв
 This is NamespaceUrl, a member of class EPlotPropertyBag.
 Синтаксис
C#
Visual Basic
public System.String NamespaceUrl;
Public Property NamespaceUrl() As System.String
 Ссылки
 EPlotPropertyBag Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!