Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Window.Size
 Послать отзыв
 Синтаксис
C#
Visual Basic
public System.Drawing.Size Size;
Public Property Size() As System.Drawing.Size
 Описание
 Обеспечивает доступ к размерам окна.
 Условия
 На чтение и запись
 Ссылки
 Window Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!