Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptSelectionOptions.RejectObjectsOnLockedLayers
 Послать отзыв
 Свойство определяет, разрешён ли выбор объектов, расположенных на заблокированных слоях.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool RejectObjectsOnLockedLayers { get; set; }
Копировать Код
Public Property RejectObjectsOnLockedLayers As Boolean
 Возвращает
 Возвращает значение типа bool:
true — объекты на заблокированных слоях не могут быть выбраны.
false — объекты на заблокированных слоях могут быть выбраны.
 Описание
 Свойство позволяет контролировать, могут ли пользователи выбирать объекты, находящиеся на слоях с состоянием "заблокирован".
 Если свойство установлено в true — выбор объектов на заблокированных слоях запрещён . Если false — выбор разрешён, даже если объекты находятся на заблокированном слое. Это свойство особенно полезно при реализации команд редактирования, где важно предотвратить случайное изменение защищённых элементов чертежа. Оно работает независимо от возможности редактирования — объекты на заблокированных слоях всё равно нельзя изменять, но их выбор может быть разрешён или запрещён в зависимости от настройки.
 Условия
 Чтение и запись
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("PromptSelectionOptionsExample_RejectObjectsOnLockedLayers")] public void PromptSelectionOptionsExample_RejectObjectsOnLockedLayers() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создаём набор параметров для запроса PromptSelectionOptions options = new PromptSelectionOptions(); options.MessageForAdding = "Выберите линии для объединения:"; // Запретить выбор с заблокированных слоёв options.RejectObjectsOnLockedLayers = true; // Фильтр: только объекты типа Line TypedValue[] filterList = new TypedValue[] { new TypedValue((int)DxfCode.Start, "LINE") }; SelectionFilter filter = new SelectionFilter(filterList); // Создаём запрос пользователю PromptSelectionResult result = editor.GetSelection(options, filter); // Если все данные введены, выводим результат в командную строку if (result.Status == PromptStatus.OK) { SelectionSet selSet = result.Value; editor.WriteMessage( $"\nВыбрано объектов: {selSet.Count}"); } else { editor.WriteMessage( "\nНе удалось получить выделение."); } } }
 Ссылки
 HostMgd.EditorInput.PromptSelectionOptions, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!