Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод PaletteSet.AddVisual
 Послать отзыв
 Добавление новой вкладки с использованием визуального элемента WPF
 Добавление новой вкладки с использованием визуального элемента WPF
 Синтаксис
C#
Visual Basic
public HostMgd::Windows::Palette AddVisual(ref System.String name, ref System.Windows.Media.Visual control);
Public Function AddVisual(ByRef name As System.String, ByRef control As System.Windows.Media.Visual) As HostMgd.Windows.Palette
 Возвращает
 При неудаче возвращает nullptr.
 Описание
 Ссылки
 PaletteSet Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!