Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PaletteSet.Style
 Послать отзыв
 Стиль окна.
 Синтаксис
C#
Visual Basic
public HostMgd::Windows::PaletteSetStyles Style;
Public Property Style() As HostMgd.Windows.PaletteSetStyles
 Описание
 Ссылки
 PaletteSet Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!