Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Структура HostMgd.Windows.ToolPalette.ToolItemInfo
 Послать отзыв
 This is record HostMgd::Windows::ToolPalette::ToolItemInfo.
 Синтаксис
C#
Visual Basic
public struct ToolItemInfo { }
Public Structure ToolItemInfo End Structure
 Ваши комментарии по поводу этого топика: Послать отзыв!