Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.SelectionAddedEventHandler(object,SelectionAddedEventArgs)
 Послать отзыв
 Делегат предназначен для обработки события, возникающего при добавлении объектов в текущий набор выделенных объектов.
 Синтаксис
C#
Visual Basic
Копировать Код
public delegate void SelectionAddedEventHandler(object sender, SelectionAddedEventArgs e);
Копировать Код
Public Delegate Sub SelectionAddedEventHandler(sender As Object, e As SelectionAddedEventArgs)
 Параметры
 Параметры
 Описание
 sender
 Источник события — обычно экземпляр редактора (Editor), в котором произошло изменение выборки. Тип object
 e
 Объект, содержащий данные о добавленных в выборку объектах чертежа Тип SelectionAddedEventArgs
 Описание
 Делегат используется как сигнатура метода-обработчика для события SelectionAdded, которое генерируется в редакторе nanoCAD каждый раз, когда один или несколько объектов добавляются в выборку. Он позволяет разработчику плагина отслеживать изменения в наборе выбранных объектов и реагировать на них — например, обновлять пользовательский интерфейс, активировать команды, запускать анализ или визуализировать новые элементы.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события SelectionAdded [Teigha.Runtime.CommandMethod("SelectionAddedExample")] public void SelectionAddedExample() { // Подписка на событие Rollover editor.SelectionAdded += OnSelectionAdded; } // Реализация отработки события SelectionAdded private void OnSelectionAdded(object sender, SelectionAddedEventArgs e) { SelectionSet addedSet = e.Selection; foreach (ObjectId id in addedSet.GetObjectIds()) { editor.WriteMessage($"\nК выборке добавлен объект: {id}"); } } }
 Ваши комментарии по поводу этого топика: Послать отзыв!