Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.InplaceTextEditor.NewFeatureWorkShop
 Послать отзыв
 Метод вызывает диалоговое окно настройки новой функции текстового редактора. В текущей версии не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public void NewFeatureWorkShop();
Копировать Код
Public Sub NewFeatureWorkShop()
 Описание
 Метод вызывает диалоговое окно настройки новой функции текстового редактора. В текущей версии не реализован.
 Ссылки
 HostMgd.ApplicationServices.InplaceTextEditor, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!