Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод PickPointDescriptor.ToString (System::IFormatProvider^)
 Послать отзыв
 This is ToString, a member of class PickPointDescriptor.
 Синтаксис
C#
Visual Basic
public System.String ToString(ref System.IFormatProvider provider);
Public Function ToString(ByRef provider As System.IFormatProvider) As System.String
 Ссылки
 PickPointDescriptor Структура, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!