Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.GraphicsSystem.Manager.SetViewportFromView
 Послать отзыв
 Метод переопределяет параметры видового экрана, используя указанный вид в качестве источника значений параметров. Опционально можно потребовать регенерацию, либо масштабирование 2D-вида, а также синхронизацию его параметров.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetViewportFromView( int viewportNumber, ref Teigha.GraphicsSystem.View view, bool regenRequired, bool rescaleRequired, bool syncRequired );
Копировать Код
Public Sub SetViewportFromView( viewportNumber As Integer, ByRef view As Teigha.GraphicsSystem.View, regenRequired As Boolean, rescaleRequired As Boolean, syncRequired As Boolean )
 Параметры
 Параметры
 Описание
 viewportNumber
 Номер переопределяемого видового экрана. Тип int.
 view
 Вид-источник параметров. Тип Teigha.GraphicsSystem.View.
 regenRequired
 Задать true, если для видового экрана требуется регенерация. Тип bool.
 rescaleRequired
 Задать true, если для видового экрана требуется изменение масштаба. Тип bool.
 syncRequired
 Передать значение true, если требуется синхронизация двумерного вида. Тип bool.
 Описание
 Метод позволяет переопределить параметры видового экрана, используя указанный вид view в качестве источника значений параметров.
 Используйте значение regenRequired = true, если для корректной синхронизации нового вида требуется 2D-регенерация. В противном случае можно использовать значение rescaleRequired = true, если для корректной синхронизации 2D-3D достаточно простого 2D-масштабирования. Если не требуется ни то, ни другое, передайте значение false для обоих аргументов.
 Флаг syncRequired используется для синхронизации параметров 2D-вида. Это бывает полезно после изменения вида в 3D-видовых экранах, когда регенерация больше не требуется, но нужна синхронизация 2D-вида.
 Ссылки
 HostMgd.GraphicsSystem.Manager, HostMgd.GraphicsSystem
 Ваши комментарии по поводу этого топика: Послать отзыв!