Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.Windows.ToolPalette.CustomToolBase.DragOver
 Послать отзыв
 Метод вызывается, когда перетаскиваемый объект стандартного инструмента движется в пределах области панели инструментов. Не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void DragOver( UInt32 keyState, ref HostMgd.ApplicationServices.POINTL pt, UInt32 effect );
Копировать Код
Public Overridable Sub DragOver( keyState As UInt32, ByRef pt As HostMgd.ApplicationServices.POINTL, effect As UInt32 )
 Параметры
 Параметры
 Описание
 keyState
 Входное состояние клавиш-модификаторов (например, Ctrl, Shift, Alt) и кнопок мыши во время перетаскивания. Тип UInt32.
 pt
 Входная позиция курсора мыши в пределах области панели инструментов (в экранных координатах). Тип HostMgd.ApplicationServices.POINTL.
 effect
 Входной/выходной параметр, определяющий эффект перетаскивания (копирование, перемещение и т.п.). Тип UInt32.
 Описание
 Метод предназначен для поддержки панелями инструментов процесса перетаскивания (Drag-and-Drop) и вызывается, когда перетаскиваемый объект стандартного инструмента движется в пределах области панели инструментов.
 В текущей версии не реализован.
 Ссылки
 HostMgd.Windows.ToolPalette.CustomToolBase, HostMgd.Windows.ToolPalette
 Ваши комментарии по поводу этого топика: Послать отзыв!