Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.PromptedForPoint
 Послать отзыв
 Событие возникает после завершения операции ввода точки пользователем в редакторе nanoCAD.
 Синтаксис
C#
Visual Basic
Копировать Код
public event PromptPointResultEventHandler PromptedForPoint;
Копировать Код
Public Event PromptedForPoint As PromptPointResultEventHandler
 Описание
 Событие генерируется, когда пользователь успешно или с ошибкой завершает ввод точки — например, с помощью мыши или через командную строку. Оно применяется после вызова методов ввода точки, таких как GetPoint(), и предоставляет информацию о координатах выбранной точки, статусе выполнения (OK, Cancel, Error) и параметрах приглашения.
 Это событие позволяет разработчикам надстроек nanoCAD обрабатывать результат выбора или ввода точки, выполнять построения, модификации объектов или проверять допустимость значения.
 Событие реализуется через делегат PromptPointResultEventHandler, который передаёт:
объект PromptPointResultEventArgs , содержащий точку в мировой системе координат (WCS),
статус операции ,
строковое представление ввода ,
параметры приглашения.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события PromptedForPoint [Teigha.Runtime.CommandMethod("PromptedForPointExample")] public void PromptedForPointExample() { // Подписка на событие PromptedForPoint editor.PromptedForPoint += OnEditorPromptedForPoint; } // Реализация отработки события PromptedForPoint private void OnEditorPromptedForPoint(object sender, PromptPointResultEventArgs e) { // Вывод сообщения в командную строку if (e.Result.Status == PromptStatus.OK) { editor.WriteMessage($"\nВыбранная точка: {e.Result.Value}"); } else { editor.WriteMessage("\nВвод точки отменён."); } } }
 Порядок работы с событием:
Вызывается интерактивный метод ввода точки — GetPoint() или GetCorner().
Пользователь указывает точку или вводит её координаты.
После завершения ввода генерируется событие PromptedForPoint.
Разработчик получает доступ к точке и может обработать результат.
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!