Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод JigPromptOptions.CalculateResult
 Послать отзыв
 Вспомогательный метод, который проверяет значение переменной status во время операции Jig и сохраняет результат операции, т.е.
 Синтаксис
C#
Visual Basic
public void CalculateResult(HostEdJig.DragStatus status, PromptResult result);
Public Sub CalculateResult(status As HostEdJig.DragStatus, result As PromptResult)
 Параметры
 Параметры
 Описание
 status
 Одно из значений перечисления DragStatus, указывающее либо на то, что была выбрана начальная точка (DragStart=0), либо была выбрана конечная точка(DragEnd=1), либо после выбора начальной точки была отмена действия(DragAbort=2).
 result
 Набор данных, полученных от пользователя после запроса.
 Описание
 запрашиваемое значение, в переменную result.
 Вспомогательный метод, вызывается во всех методах класса JigPrompts. Метод проверяет значение переменной status во время операции Jig. В зависимости от этого значения присваивает значения переменной result.
 Ссылки
 JigPromptOptions Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!