Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PublishSheetEventArgs.LayoutMarginMaxX
 Послать отзыв
 This is LayoutMarginMaxX, a member of class PublishSheetEventArgs.
 Синтаксис
C#
Visual Basic
public double LayoutMarginMaxX;
Public Property LayoutMarginMaxX() As Double
 Ссылки
 PublishSheetEventArgs Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!