Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PromptNumericalOptions.AllowNegative
 Послать отзыв
 Синтаксис
C#
Visual Basic
public bool AllowNegative;
Public Property AllowNegative() As bool
 Описание
 Возвращает или устанавливает разрешение ввода отрицательного значения. Значение true означает, что отрицательные значения разрешены.
 Условия
 На чтение и запись
 Ссылки
 PromptNumericalOptions Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!