Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.DsdData.NoOfCopies
 Послать отзыв
 Свойство NoOfCopies представляет количество листов, подготовленных к публикации. Не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public int NoOfCopies;
Копировать Код
Public Property NoOfCopies As Integer
 Возвращает
 Возвращает количество листов, подготовленных к публикации. Тип int.
 Описание
 Свойство NoOfCopies представляет количество листов, подготовленных к публикации. Это поле сохраняется в файле DSD. Значение NoOfCopies имеет значение только в том случае, если публикация не выполняется в многолистовом файле DWF.
 В текущей версии не реализовано.
 Условия
 Чтение и запись.
 Ссылки
 HostMgd.PlottingServices.DsdData, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!