Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Класс HostMgd.EditorInput.PromptEditorOptions
 Послать отзыв
 Иерархия классов
HostMgd::EditorInput::PromptOptions HostMgd::EditorInput::PromptEditorOptions
 Синтаксис
C#
Visual Basic
public class PromptEditorOptions : PromptOptions;
Public Class PromptEditorOptions Inherits PromptOptions
 Описание
 Это базовый класс для команд настроек приглашения, используемый в различных типах сбора данных.
 Топики
 Имя
 Описание
 PromptOptions Методы
 Ниже перечислены методы класса PromptOptions.
 PromptOptions Свойства
 Ниже перечислены свойства класса PromptOptions.
 Ссылки
 Топики, PromptOptions Методы, PromptOptions Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!