Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.WriteMessage(String)
 Послать отзыв
 Метод выводит заданный текст в командной строке nanoCAD.
 Синтаксис
C#
Visual Basic
Копировать Код
public void WriteMessage(String message);
Копировать Код
Public Sub WriteMessage(message As String)
 Параметры
 Параметры
 Описание
 message
 Текстовое сообщение, которое будет выведено в командной строке. Может содержать обычный текст, числа, координаты и другую информацию. Тип String
 Описание
 Метод используется для отображения текстовой информации в командной строке приложения nanoCAD. Он предназначен для информирования пользователя о выполняемых действиях, результатах операций или возникших ошибках. Метод просто выводит переданную строку без форматирования.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("WriteMessageExample_String")] public void WriteMessageExample_String() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Вывод сообщения в командной строке editor.WriteMessage("\nВыберите объект для продолжения."); // Выведет: Выберите объект для продолжения. } }
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!