Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор PaletteActivatedEventArgs.PaletteActivatedEventArgs
 Послать отзыв
 This is PaletteActivatedEventArgs, a member of class PaletteActivatedEventArgs.
 Синтаксис
C#
Visual Basic
public PaletteActivatedEventArgs(ref HostMgd::Windows::Palette activated, ref HostMgd::Windows::Palette deactivated);
Public Sub New(ByRef activated As HostMgd.Windows.Palette, ByRef deactivated As HostMgd.Windows.Palette)
 Ссылки
 PaletteActivatedEventArgs Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!