Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.Command(params object[])
 Послать отзыв
 Метод выполняет встроенную команду nanoCAD с указанными параметрами.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Command(params object[] parameter);
Копировать Код
Public Function Command(parameter As params object[]) As void
 Параметры
 Параметры
 Описание
 parameter
 Массив объектов, представляющих параметры, передаваемые в команду. Каждый элемент может быть одного из следующих типов:
 Описание
 Метод позволяет вызывать внутренние команды nanoCAD, передавая им набор параметров в виде массива объектов. Он предназначен для программного взаимодействия с командной строкой редактора, что может использоваться для автоматизации действий или интеграции пользовательских функций в рабочий процесс nanoCAD. Метод принимает переменное число аргументов (params object[]), что упрощает передачу параметров различного типа.
 Замечания
Если необходимо приостановить выполнение команды для пользовательского ввода,
 можно использовать PauseToken ("\") как один из параметров.
Некоторые команды требуют интерактивного ввода или дополнительной обработки событий —
 в таких случаях следует учитывать контекст выполнения и правильно формировать последовательность параметров.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("CommandCallExample")] public void CommandCallExample() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Программно вызываем команду LINE и задаём параметры для отрисовки линии editor.Command("LINE", new Teigha.Geometry.Point3d(0, 0, 0), new Teigha.Geometry.Point3d(100, 100, 0)); } }
 Этот код вызывает команду LINE и строит отрезок между двумя точками.
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!