Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PointFilterEventArgs.Result
 Послать отзыв
 Свойство предоставляет доступ к объекту, позволяющему установить или изменить результат текущего события фильтрации точки.
 Синтаксис
C#
Visual Basic
Копировать Код
public PointFilterResult Result { get; }
Копировать Код
Public ReadOnly Property Result As PointFilterResult
 Возвращает
 Возвращает объект типа PointFilterResult, содержащий:
Point — текущая точка ввода (может быть изменена).
Color — цвет курсора или маркера.
CursorType — тип курсора, отображаемого при фильтрации.
Mode — режим фильтрации.
Другие параметры, управляющие поведением точки.
 Если событие ещё не инициализировало результат, может вернуть null.
 Описание
 Свойство возвращает объект типа PointFilterResult, который используется для управления итоговым значением точки ввода во время обработки события PointFilter. Оно позволяет не только получить текущий результат, но и изменить точку, цвет, стиль отображения и другие параметры, влияющие на интерактивный ввод мыши в nanoCAD. Это особенно полезно при реализации пользовательских привязок, ограничений по осям или визуальных подсказок.
 Условия
 Только чтение
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события PointFilter [Teigha.Runtime.CommandMethod("PointFilterExample_ResultProp")] public void PointFilterExample_ResultProp() { // Подписка на событие PointFilter editor.PointFilter += OnEditorPointFilter; } // Реализация отработки события PointFilter private void OnEditorPointFilter(object sender, PointFilterEventArgs e) { PointFilterResult result = e.Result; if (result != null) { // Пример: принудительная установка точки result.NewPoint = new Point3d(result.NewPoint.X, 0, result.NewPoint.Z); } } }
 Ссылки
 HostMgd.EditorInput.PointFilterEventArgs, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!