Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.GetKeywords(PromptKeywordOptions)
 Послать отзыв
 Метод позволяет пользователю ввести ключевое слово из заданного списка, возвращая результат с указанием статуса и выбранного значения.
 Синтаксис
C#
Visual Basic
Копировать Код
public PromptResult GetKeywords(PromptKeywordOptions options);
Копировать Код
Public Function GetKeywords(options As PromptKeywordOptions) As PromptResult
 Параметры
 Параметры
 Описание
 options
 Объект, содержащий параметры ввода ключевых слов:
 Возвращает
 Возвращает объект типа PromptResult, который содержит:
Status — статус операции (OK, Cancel, Error и др.).
StringResult — введённое пользователем ключевое слово (или пустая строка, если AllowNone = true).
 Статус OK возвращается, если введено допустимое ключевое слово или значение по умолчанию. При отмене или некорректном вводе статус будет другим.
 Описание
 Метод используется для получения от пользователя одного из допустимых ключевых слов, вводимого с клавиатуры. Если пользователь вводит значение, не входящее в список разрешённых, nanoCAD выводит сообщение об ошибке и предлагает повторный ввод. Нажатие Enter без ввода значения возвращает пустую строку, если это не запрещено настройками. Метод поддерживает настраиваемое приглашение и флаги поведения, такие как обязательность выбора или отмена операции.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("GetKeywordsExample_PromptKeywordOptions")] public void GetKeywordsExample_PromptKeywordOptions() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создаём запрос пользователю PromptKeywordOptions opts = new PromptKeywordOptions("Выберите действие"); opts.Keywords.Add("Open","Открыть"); opts.Keywords.Add("Save", "Сохранить"); opts.Keywords.Add("Exit", "Выход"); PromptResult pr = editor.GetKeywords(opts); // Если все данные введены, выводим результат в командную строку if (pr.Status == PromptStatus.OK) { editor.WriteMessage($"\nВыбрано: {pr.StringResult}"); } else { editor.WriteMessage("\nОперация отменена."); } } }
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!