Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PlotInfo.OverrideSettings
 Послать отзыв
 Синтаксис
C#
Visual Basic
public Teigha::DatabaseServices::PlotSettings OverrideSettings;
Public Property OverrideSettings() As Teigha.DatabaseServices.PlotSettings
 Ссылки
 PlotInfo Класс, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!