Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Publisher.PublishDsd
 Послать отзыв
 This is PublishDsd, a member of class Publisher.
 Синтаксис
C#
Visual Basic
public int PublishDsd(ref System.String dsdFile, ref HostMgd::PlottingServices::PlotProgressDialog plotProgressDialog);
Public Function PublishDsd(ByRef dsdFile As System.String, ByRef plotProgressDialog As HostMgd.PlottingServices.PlotProgressDialog) As Integer
 Ссылки
 Publisher Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!