Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.InplaceTextEditorSettings.EntityType
 Послать отзыв
 Данное перечисление определяет поддерживаемые типы исходных объектов для встроенного текстового редактора.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum EntityType { Default = 0, TableCell = 1, MultiAttribute = 2 }
Копировать Код
Public Enum EntityType Default = 0 TableCell = 1 MultiAttribute = 2 End Enum
 Члены
 Члены
 Описание
 Default
 Значение: 0. Исходным объектом является общий объект MTEXT.
 MultiAttribute
 Значение: 2. Исходным объектом является многострочный атрибут. Текущий объект MTEXT является копией содержимого многострочного атрибута.
 TableCell
 Значение: 1. Исходным объектом является ячейка таблицы. Текущий объект MTEXT является копией содержимого ячейки таблицы.
 Описание
 Перечисление EntityType определяет поддерживаемые типы исходных объектов для встроенного текстового редактора.
 Замечания
 В случае сложного исходного объекта, например, ячейки таблицы или многострочного атрибута, можно создавать копию объекта MTEXT в памяти.
 Ваши комментарии по поводу этого топика: Послать отзыв!