Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.Application.ShowModelessDialog(System.Windows.Forms.Form)
 Послать отзыв
 Метод предназначен для вызова немодального диалогового окна, построенного с помощью WinForms.
 Синтаксис
C#
Visual Basic
Копировать Код
public static bool? ShowModalWindow(System.Windows.Window formToShow);
Копировать Код
Public Shared Function ShowModalWindow(formToShow As System.Windows.Window) As Boolean?
 Параметры
 Параметры
 Описание
 formToShow
 Форма, которая должна быть отображена
 Описание
 Метод отображает немодальный диалог, построенный с помощью WinForms. Необходимо пользоваться именно этим методом вместо метода Form.Show, который может привести к непредсказуемому результату.
 Ссылки
 HostMgd.ApplicationServices.Application, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!