Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор PromptOpenFileOptions.PromptOpenFileOptions
 Послать отзыв
 Синтаксис
C#
Visual Basic
public PromptOpenFileOptions(ref System.String message);
Public Sub New(ByRef message As System.String)
 Параметры
 Параметры
 Описание
 message
 Приглашающее сообщение
 Описание
 Конструктор класса.
 Ссылки
 PromptOpenFileOptions Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!