Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptSelectionResult.StringResult
 Послать отзыв
 Свойство возвращает строковое значение, если операция выбора завершена с ключевым словом или пользователь ввёл текст вместо выбора объектов.
 Синтаксис
C#
Visual Basic
Копировать Код
public string StringResult { get; set; }
Копировать Код
Public Property StringResult As String
 Возвращает
 Возвращает значение типа string:
Если пользователь ввёл ключевое слово или строку — возвращается эта строка.
Если операция завершена успешно и объекты выбраны — StringResult может быть null.
Если операция отменена или произошла ошибка — может содержать сообщение об этом или быть пустой/null.
 Описание
 Свойство используется для получения строки, введённой пользователем в ходе интерактивной команды выборки объектов — например, при вызове метода GetSelection() с использованием ключевых слов. Оно содержит текстовое значение, если:
Пользователь нажал Enter без выбора объектов.
Было введено ключевое слово из списка, заданного через PromptSelectionOptions.Keywords.
Выборка была прервана клавиатурным вводом.
 При успешном завершении операции (Status == PromptStatus.OK) это свойство может быть null, если ввод не был выполнен. Если статус равен PromptStatus.Keyword, свойство возвращает соответствующее слово.
 Условия
 Чтение и запись
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("PromptSelectionResultExample_StringResult")] public void PromptSelectionResultExample_StringResult() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создаём набор параметров для запроса PromptSelectionOptions options = new PromptSelectionOptions(); options.MessageForAdding = "Выберите линии для объединения:"; options.Keywords.Add("Все"); // Фильтр: только объекты типа Line TypedValue[] filterList = new TypedValue[] { new TypedValue((int)DxfCode.Start, "LINE") }; SelectionFilter filter = new SelectionFilter(filterList); // Создаём запрос пользователю PromptSelectionResult result = editor.GetSelection(options, filter); // Если все данные введены, выводим результат в командную строку if (result.Status == PromptStatus.Keyword) { string keyword = result.StringResult; editor.WriteMessage($"\nВведено ключевое слово: {keyword}"); } else if (result.Status == PromptStatus.OK && result.Value != null) { editor.WriteMessage($"\nОбъектов выбрано: {result.Value.Count}"); } else { editor.WriteMessage("\nОперация отменена."); } } }
 Ссылки
 HostMgd.EditorInput.PromptSelectionResult, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!