Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод SelectedObject.ToString (IFormatProvider^)
 Послать отзыв
 Метод возвращает строковое представление объекта (ObjectId, метод выделения, gsMarker) в соответствии с заданным форматом, зависящим от локализации.
 Синтаксис
C#
Visual Basic
public String ToString(ref IFormatProvider provider);
Public Function ToString(ByRef provider As IFormatProvider) As String
 Параметры
 Параметры
 Описание
 provider
 Формат, зависящей от локализации
 Ссылки
 SelectedObject Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!