Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.DsdData.UnrecognizedDataSectionNames
 Послать отзыв
 Свойство UnrecognizedDataSectionNames представляет коллекцию имён настраиваемых (нераспознанных) разделов и данных DSD. Не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public System.Collections.Specialized.StringCollection UnrecognizedDataSectionNames;
Копировать Код
Public ReadOnly Property UnrecognizedDataSectionNames As System.Collections.Specialized.StringCollection
 Возвращает
 Возвращает коллекцию имён настраиваемых (нераспознанных) разделов и данных DSD. Тип System.Collections.Specialized.StringCollection.
 Описание
 Свойство UnrecognizedDataSectionNames представляет коллекцию имён настраиваемых (нераспознанных) разделов и данных DSD.
 В текущей версии не реализовано.
 Условия
 Только чтение.
 Ссылки
 HostMgd.PlottingServices.DsdData, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!