Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PublishSheetEventArgs.PaperScale
 Послать отзыв
 This is PaperScale, a member of class PublishSheetEventArgs.
 Синтаксис
C#
Visual Basic
public double PaperScale;
Public Property PaperScale() As Double
 Ссылки
 PublishSheetEventArgs Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!