Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Делегат HostMgd.Windows.PaletteSetTitleBarLocationChangeEventHandler
 Послать отзыв
 This is type HostMgd::Windows::PaletteSetTitleBarLocationChangeEventHandler.
 Синтаксис
C#
Visual Basic
public delegate PaletteSetTitleBarLocationChangeEventHandler();
Public Delegate Sub PaletteSetTitleBarLocationChangeEventHandler()
 Ваши комментарии по поводу этого топика: Послать отзыв!