Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод SelectionTextInputEventArgs.AddObjects
 Послать отзыв
 Синтаксис
C#
Visual Basic
public void AddObjects(ref array<Teigha::DatabaseServices::ObjectId> ids);
Public Sub AddObjects(ByRef ids As array<Teigha.DatabaseServices.ObjectId>)
 Параметры
 Параметры
 Описание
 ids
 Массив Id добавляемых объектов
 Описание
 Добавляет объекты в выбранный набор.
 Ссылки
 SelectionTextInputEventArgs Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!