Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Window.GetDeviceIndependentScale
 Послать отзыв
 This is GetDeviceIndependentScale, a member of class Window.
 Синтаксис
C#
Visual Basic
public Vector GetDeviceIndependentScale(System.IntPtr hWnd);
Public Function GetDeviceIndependentScale(hWnd As System.IntPtr) As Vector
 Ссылки
 Window Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!