Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PublishEntityEventArgs.UniqueEntityId
 Послать отзыв
 This is UniqueEntityId, a member of class PublishEntityEventArgs.
 Синтаксис
C#
Visual Basic
public System.String UniqueEntityId;
Public Property UniqueEntityId() As System.String
 Ссылки
 PublishEntityEventArgs Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!