Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод MenuItemCollection.Add (System::Object^)
 Послать отзыв
 Добавление объекта MenuItem в коллекцию.
 Синтаксис
C#
Visual Basic
public int Add(ref System.Object value);
Public Function Add(ByRef value As System.Object) As Integer
 Описание
 Ссылки
 MenuItemCollection Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!