Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 JigPrompts.AcquirePoint(String,String)
 Послать отзыв
 Метод запрашивает у пользователя точку, используя при запросе приглашающее сообщение с ключевыми словами.
 Синтаксис
C#
Visual Basic
public HostMgd.EditorInput.PromptPointResult AcquirePoint(ref System.String messageAndKeywords, ref System.String globalKeywords);
Public Function AcquirePoint(ByRef messageAndKeywords As System.String, ByRef globalKeywords As System.String) As HostMgd.EditorInput.PromptPointResult
 Параметры
 Параметры
 Описание
 messageAndKeywords
 Строка, содержащая в себе сообщение запроса и ключевые слова к нему, которые будут выводиться на экране при запросе точки.
 globalKeywords
 Строка,содержащая в себе глобальные ключевые слова. Количество глобальных ключевых слов должно совпадать с количеством ключевых слов в приглашающем сообщении messageAndKeywords. Ключевые слова в строке globalKeywords должны отделяться друг от друга одним пробелом.
 Возвращает
 Возвращает результат типа Point3d, полученный либо из текущего положения курсора мыши и значений настроек, выбранных пользователем, либо посредством ввода координат точки с клавиатуры.
 Описание
 Метод предназначен для запроса у пользователя точки. В основном применяется для интерактивного перемещения объекта или группы объектов из одной точки в другую. После вызова создает экземпляр класса JigPromptPointOptions, присваивает его свойству Message значение параметра messageAndKeywords, выделяет из этого параметра ключевые слова, записывает их в свойство Keywords как KeywordCollection вместе с глобальными ключевыми словами из параметра globalKeywords. Первому ключевому слову в сообщении будет соответствовать первое глобальное ключевое слово и т. д. Далее метод вызывает свою перегрузку JigPrompts.AcquirePoint(JigPromptPointOptions options), передавая в нее созданный экземпляр класса JigPromptPointOptions с присвоенными значениями свойств.
 Если список ключевых слов ошибочный или пустой, либо количество глобальных ключевых слов не совпадает с количеством отображаемых ключевых слов, то возникает событие System.ArgumentException.
 Набор отображаемых ключевых слов строки messageAndKeywords должен быть заключен в скобки: "[" в начале и "]" в конце. Сами ключевые слова должны быть отделены между собой символом "/". Каждое отображаемое в строке messageAndKeywords ключевое слово должно также быть представлено на той же позиции в строке globalKeywords.
 Пример
 В примере приведен отрывок кода из реализации метода Sampler() класса Jig.
C#
 Копировать Код
PromptPointResult result = prompts.AcquirePoint("Переместить или Переместить в [НачалоКоординат/ЦентрЛиста]:", "Origin Center");
Visual Basic
 Копировать Код
Dim result As PromptPointResult = prompts.AcquirePoint("Переместить или Переместить в [НачалоКоординат/ЦентрЛиста]:", "Origin Center")
 Ссылки
 JigPrompts Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!