Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Класс HostMgd.EditorInput.EntityJig
 Послать отзыв
 Класс обеспечивает возможность создавать пользовательский примитив непосредственно на экране путем указания начальной точки и перетаскивания курсора мыши(технология Jig).
 Иерархия классов
HostMgd::EditorInput::Jig HostMgd::EditorInput::EntityJig
 Синтаксис
C#
Visual Basic
public class EntityJig : Jig;
Public Class EntityJig Inherits Jig
 Описание
 Класс обеспечивает возможность создавать пользовательский примитив непосредственно на экране путем указания начальной точки и перетаскивания курсора мыши (далее технология Jig). При этом во время перетаскивания курсора мыши на экране будет отображаться предпросмотр создаваемого примитива. При необходимости создания подобным способом произвольной графики, в том числе одновременно нескольких пользовательских примитивов в виде цельного графического объекта, используется класс DrawJig.
 Пример
 Шаги, которые нужно выполнить, чтобы реализовать команду построения примитива с помощью технологии Jig:
Создать класс-наследник класса EntityJig:
Реализовать в этом классе конструктор, принимающий в качестве одного из параметров переменную типа создаваемого примитива (Line, Circle и т.п.). Тип создаваемого примитива должен быть наследником класса Entity.
Реализовать в классе метод Sampler(). В методе необходимо вызвать один из методов класса JigPrompts. Метод отслеживает перемещение курсора мыши, получая и запоминая данные о его положении.
Реализовать в классе метод Update(). Метод преобразовывает полученные методом Sampler() данные в формат, необходимый для построения примитива на экране.
Создать команду построения примитива:
В методе команды сделать запрос данных, необходимых для первоначальной инициализации примитива.
Запомнить полученные данные.
Запустить транзакцию с базой данных чертежа. Далее все действия происходят внутри транзакции.
Создать экземпляр класса создаваемого примитива.
Создать экземпляр класса из п.1, передав в него ссылку на экземпляр создаваемого примитива и данные, полученные запросом данных для первоначальной инициализации примитива.
Вызвать метод Editor.Drag(), передать в него экземпляр класа из предыдущего пункта.
Проверить, что вернул метод Editor.Drag(). Если он вернул PromptStatus.OK, добавить примитив в базу данных чертежа и завершить транзакцию.
 В результате работы примера на пространстве чертежа создается полукруг из пользовательского примитива Arc.
C#
 Копировать Код
using System; using HostMgd.EditorInput; using HostMgd.ApplicationServices; using Teigha.DatabaseServices; using Teigha.Geometry; using Teigha.Runtime; public class SemiсircleEntJig : EntityJig { public Point3d basePoint, newPoint; public SemiсircleEntJig(Arc semicircle, Point3d point) : base(semicircle) { this.basePoint = point; this.newPoint = point; } protected override SamplerStatus Sampler(JigPrompts prompts) { // Запрос второй точки для расчета радиуса полукруга  JigPromptPointOptions options = new JigPromptPointOptions("Радиус полукруга:"); PromptPointResult promptResult = prompts.AcquirePoint(options); // Проверка полученных данных if (promptResult.Status == PromptStatus.OK) { if (this.basePoint == promptResult.Value) { return SamplerStatus.NoChange; } else { this.newPoint = promptResult.Value; return SamplerStatus.OK; } } return SamplerStatus.Cancel; } protected override bool Update() { // Инициализация дуги  Arc semicircle=Entity as Arc; if (semicircle == null) return false; semicircle.Center = this.basePoint; semicircle.StartAngle = 0;semicircle.EndAngle = Math.PI; // Расчет радиуса полукруга по двум точкам Line radius = new Line(this.basePoint, this.newPoint); semicircle.Radius = radius.Length; return true; } } public class Commands { [CommandMethod("SemicircleEntityJig")] public void SemicircleJigCommand() { Document doc = Application.DocumentManager.MdiActiveDocument; Editor ed = doc.Editor; Database db = doc.Database; // Запрос центра полукруга PromptPointOptions promptOptions = new PromptPointOptions("Центр полукруга:"); PromptPointResult promptResult = ed.GetPoint(promptOptions); // Проверка полученных данных if (promptResult.Status != PromptStatus.OK) return; Point3d point = promptResult.Value; using (Transaction transaction = db.TransactionManager.StartTransaction()) { // Получение доступа к активному пространству (пространство модели или лист) BlockTableRecord currentSpace = transaction.GetObject(db.CurrentSpaceId, OpenMode.ForWrite) as BlockTableRecord; // Определение экземпляров примитива и класса-наследника EntityJig Arc semicircle = new Arc(); SemiсircleEntJig semicircleEntJig = new SemiсircleEntJig(semicircle, point); // Вызов метода, позволяющего отрисовывать геометрические объекты путем перетаскивания курсора мыши promptResult = (PromptPointResult)ed.Drag(semicircleEntJig); if (promptResult.Status == PromptStatus.OK) { // Добавление дуги в чертеж currentSpace.AppendEntity(semicircle); transaction.AddNewlyCreatedDBObject(semicircle, true); transaction.Commit(); } } } }
Visual Basic
 Копировать Код
Imports Teigha.DatabaseServices Imports Teigha.Geometry Imports Teigha.Runtime Imports HostMgd.EditorInput Imports HostMgd.ApplicationServices Public Class SemiсircleEntJig Inherits EntityJig Public basePoint, newPoint As Point3d Public Sub New(semicircle As Arc, point As Point3d) MyBase.New(semicircle) basePoint = point newPoint = point End Sub Protected Overrides Function Sampler(prompts As JigPrompts) As SamplerStatus ' Запрос второй точки для расчета радиуса полукруга  Dim options As JigPromptPointOptions = New JigPromptPointOptions("Радиус полукруга:") Dim promptResult As PromptPointResult = prompts.AcquirePoint(options) ' Проверка полученных данных If promptResult.Status <> PromptStatus.OK Then Return SamplerStatus.Cancel End If If basePoint <> promptResult.Value Then newPoint = promptResult.Value Return SamplerStatus.OK Else Return SamplerStatus.NoChange End If End Function Protected Overrides Function Update() As Boolean ' Инициализация дуги Dim semicircle As Arc = TryCast(Entity, Arc) If semicircle Is Nothing Then Return False semicircle.Center = basePoint semicircle.StartAngle = 0 semicircle.EndAngle = Math.PI ' Расчет радиуса полукруга по двум точкам Dim radius As Line = New Line(basePoint, newPoint) semicircle.Radius = radius.Length Return True End Function End Class Public Class Commands <CommandMethod("SemicircleJig")> Public Sub SemicircleJigCommand() Dim doc As Document = Application.DocumentManager.MdiActiveDocument Dim ed As Editor = doc.Editor Dim db As Database = doc.Database ' Запрос центра полукруга Dim promptOptions As PromptPointOptions = New PromptPointOptions("Центр полукруга:") Dim promptResult As PromptPointResult = ed.GetPoint(promptOptions) Dim point As Point3d ' Проверка полученных данных If promptResult.Status = PromptStatus.OK Then point = promptResult.Value Using transaction As Transaction = db.TransactionManager.StartTransaction() ' Получение доступа к активному пространству(пространство модели или лист)  Dim currentSpace As BlockTableRecord = TryCast(transaction.GetObject(db.CurrentSpaceId, OpenMode.ForWrite), BlockTableRecord) ' Определение экземпляров примитива и класса-наследника EntityJig Dim semicircle As Arc = New Arc() Dim semicircleEntJig As SemiсircleEntJig = New SemiсircleEntJig(semicircle, point) ' Вызов метода, позволяющего отрисовывать геометрические объекты путем перетаскивания курсора мыши promptResult = CType(ed.Drag(semicircleEntJig), PromptPointResult) If promptResult.Status <> PromptStatus.OK Then Return End If ' Добавление дуги в пространство модели currentSpace.AppendEntity(semicircle) transaction.AddNewlyCreatedDBObject(semicircle, True) transaction.Commit() End Using End Sub End Class
 Алгоритм работы приведенного примера:
Запускается работа команды SemicircleEntityJig, выполняется метод SemicircleJigCommand() класса Commands.
Запрос центра полукруга, проверка полученных данных.
Если введенные данные верны, создается примитив Arc и экземпляр класса SemicircleEntJig, позволяющий построить полукруг с помощью технологии Jig. При создании экземпляра этого класса в его конструктор передается ссылка на созданный ранее примитив Arc и координаты центра будущего полукруга.
Вызов метода Drag() класса Editor, в который передается экземпляр класса SemicircleEntJig. Метод обращается к экземпляру класса SemicircleEntJig при каждом передвижении курсора мыши на экране.
Запрос данных для расчета радиуса полукруга методом Sampler() класса SemicircleEntJig.
Метод Sampler() получает точку расположения курсора мыши на экране и запускается метод Update() класса SemicircleEntJig, в котором из полученной точки высчитывается радиус полукруга.
После выполнения метода Update() на экране появляется полукруг. При перемещении курсора мыши будет происходить пересчет радиуса полукруга и его изменение на экране.
После того, как радиус полукруга был выбран нажатием кнопки мыши на экране или путем ввода с клавиатуры, работа метода Drag() класса Editor завершается, созданный примитив добавляется в базу данных чертежа. Работа команды SemicircleEntityJig завершается.
 Методы
 Конструкторы
 Класс HostMgd.EditorInput.EntityJig
 Имя
 Описание
 EntityJig
 Конструктор класса EntityJig
 Топики
 Имя
 Описание
 Jig Методы
 Ниже перечислены методы класса Jig.
 Класс HostMgd.EditorInput.EntityJig
 Имя
 Описание
 EntityJig Методы
 Ниже перечислены методы класса EntityJig.
 EntityJig Свойства
 Ниже перечислены свойства класса EntityJig.
 Ссылки
 EntityJig Методы, EntityJig Свойства, Методы, Топики, Jig Методы, EntityJig Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!