Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.DraggingEventArgs.Prompt
 Послать отзыв
 Свойство предоставляет строку запроса, отображаемую пользователю при начале операции перетаскивания.
 Синтаксис
C#
Visual Basic
Копировать Код
public string Prompt { get; }
Копировать Код
Public ReadOnly Property Prompt As String
 Возвращает
 Возвращает значение типа string, представляющее собой строку запроса (приглашения) к пользователю — например, "Перетащите объект сюда". Если запрос не задан, может вернуть пустую строку или null.
 Описание
 Свойство возвращает текстовое сообщение, которое выводится в командной строке nanoCAD перед началом операции перетаскивания. Оно может использоваться для информирования пользователя о текущем действии или указании дальнейших шагов. Это свойство доступно только для чтения и инициализируется при создании объекта DraggingEventArgs.
 Условия
 Только чтение
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события Dragging [Teigha.Runtime.CommandMethod("DraggingExample_PromptProp")] public void DraggingExample_PromptProp() { // Подписка на событие редактора Dragging editor.Dragging += OnEditorDragging; } // Реализация отработки события Dragging private void OnEditorDragging(object sender, EventArgs e) { // Получаем доступ к параметрам перетаскивания if (e != null && e.Prompt.Length>0) { editor.WriteMessage( $"\nТекст запроса: {e.Prompt}"); } // Вывод сообщения в командную строку editor.WriteMessage("\nНачало операции перетаскивания."); } }
 Ссылки
 HostMgd.EditorInput.DraggingEventArgs, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!