Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство OptionsDialogResult.PlotConfig
 Послать отзыв
 This is PlotConfig, a member of class OptionsDialogResult.
 Синтаксис
C#
Visual Basic
public HostMgd::PlottingServices::PlotConfig PlotConfig;
Public Property PlotConfig() As HostMgd.PlottingServices.PlotConfig
 Ссылки
 OptionsDialogResult Структура, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!