Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.UpdateTiledViewportsInDatabase()
 Послать отзыв
 Метод обновляет информацию о видовых экранах в базе данных чертежа.
 Синтаксис
C#
Visual Basic
Копировать Код
public void UpdateTiledViewportsInDatabase();
Копировать Код
Public Sub UpdateTiledViewportsInDatabase()
 Описание
 Метод используется для сохранения текущих параметров и конфигурации видовых экранов (viewport'ов), расположенных в пространстве листа (paper space), обратно в базу данных чертежа. Это позволяет зафиксировать изменения, внесённые программно или пользователем, и обеспечить их корректное отображение при последующих операциях, таких как переключение между листами или регенерация чертежа. Метод применяется, например, при динамическом изменении размеров, положения или содержимого видовых экранов.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("UpdateTiledViewportsInDatabaseExample")] public void UpdateTiledViewportsInDatabaseExample() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Вызываем метод editor.UpdateTiledViewportsInDatabase(); // Вывод сообщения в командной строке editor.WriteMessage("\nИнформация о видовых экранах обновлена в базе данных."); } }
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!