Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод AboutToBeginBackgroundPublishingEventArgs.ReadPrivateSection
 Послать отзыв
 This is ReadPrivateSection, a member of class AboutToBeginBackgroundPublishingEventArgs.
 Синтаксис
C#
Visual Basic
public IDictionaryEnumerator ReadPrivateSection(ref System.String sectionName);
Public Function ReadPrivateSection(ByRef sectionName As System.String) As IDictionaryEnumerator
 Ссылки
 AboutToBeginBackgroundPublishingEventArgs Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!