Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PaletteSet.MinimumSize
 Послать отзыв
 Минимальные размеры
 Синтаксис
C#
Visual Basic
public System.Drawing.Size MinimumSize;
Public Property MinimumSize() As System.Drawing.Size
 Ссылки
 PaletteSet Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!