Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.Application.AddDefaultContextMenuExtension(HostMgd.Windows.ContextMenuExtension)
 Послать отзыв
 Метод предназначен для добавления пункта меню в контекстное меню по умолчанию.
 Синтаксис
C#
Visual Basic
Копировать Код
public static void AddDefaultContextMenuExtension(ContextMenuExtension menuExtension);
Копировать Код
Public Shared Sub AddDefaultContextMenuExtension(menuExtension As ContextMenuExtension)
 Параметры
 Параметры
 Описание
 menuExtension
 Пункт контекстного меню, который будет добавлен в контекстное меню по умолчанию
 Описание
 Метод добавляет пункт меню в контекстное меню по умолчанию.
 Ссылки
 HostMgd.ApplicationServices.Application, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!