Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Оператор PickPointDescriptor.==
 Послать отзыв
 Синтаксис
C#
Visual Basic
public bool operator ==(ref HostMgd::EditorInput::PickPointDescriptor a, ref HostMgd::EditorInput::PickPointDescriptor b);
Public Operator ==(ByRef a As HostMgd.EditorInput.PickPointDescriptor, ByRef b As HostMgd.EditorInput.PickPointDescriptor)
 Параметры
 Параметры
 Описание
 a
 Левый операнд
 b
 Правый операнд
 Описание
 Возвращает true, если а равно b.
 Ссылки
 PickPointDescriptor Структура, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!