Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 JigPrompts.AcquirePoint(JigPromptPointOptions)
 Послать отзыв
 Метод запрашивает у пользователя точку, используя при запросе свойства класса JigPromptPointOptions.
 Синтаксис
C#
Visual Basic
public HostMgd.EditorInput.PromptPointResult AcquirePoint(ref HostMgd.EditorInput.JigPromptPointOptions options);
Public Function AcquirePoint(ByRef options As HostMgd.EditorInput.JigPromptPointOptions) As HostMgd.EditorInput.PromptPointResult
 Параметры
 Параметры
 Описание
 options
 Набор данных типа JigPromptPointOptions, которые используются при запросе точки.
 Возвращает
 Возвращает результат типа Point3d, полученный либо из текущего положения курсора мыши и значений настроек, выбранных пользователем, либо посредством ввода координат точки с клавиатуры.
 Описание
 Метод предназначен для запроса у пользователя точки. В основном применяется для интерактивного перемещения объекта или группы объектов из одной точки в другую.
 Пример
 В примере приведен отрывок кода из реализации метода Sampler() класса Jig.
C#
 Копировать Код
 JigPromptPointOptions pointOptions = new JigPromptPointOptions("Точка:"); pointOptions.UseBasePoint = true; pointOptions.BasePoint = basePoint; PromptPointResult result = prompts.AcquirePoint(pointOptions);
Visual Basic
 Копировать Код
 Dim pointOptions As JigPromptPointOptions = New JigPromptPointOptions("Точка:") pointOptions.UseBasePoint = True pointOptions.BasePoint = basePoint Dim result As PromptPointResult = prompts.AcquirePoint(pointOptions)
 Ссылки
 JigPrompts Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!