Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Transient.IsPersistent
 Послать отзыв
 Свойство IsPersistent позволяет проверить, связан ли данный объект с постоянным объектом базы данных. Не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public sealed override bool IsPersistent;
Копировать Код
Public Overrides NotOverridable ReadOnly Property IsPersistent As Boolean
 Возвращает
 Возвращает true, если данный объект связан с постоянным объектом базы данных. В противном случае возвращает false.
 Описание
 Свойство IsPersistent позволяет проверить, связан ли данный объект с постоянным объектом базы данных.
 В текущей версии не реализовано.
 Условия
 Только чтение.
 Ссылки
 HostMgd.EditorInput.Transient, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!