Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PrintForm.LowerSheetProgressRange
 Послать отзыв
 Нижняя граница индикатора печати страницы.
 Синтаксис
C#
Visual Basic
public int LowerSheetProgressRange;
Public Property LowerSheetProgressRange() As Integer
 Описание
 Ссылки
 PrintForm Класс, Пространство имен HostMgd
 Ваши комментарии по поводу этого топика: Послать отзыв!