Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PlotLogger.WarningHasHappenedInJob
 Послать отзыв
 Только для чтения
 Синтаксис
C#
Visual Basic
public bool WarningHasHappenedInJob;
Public Property WarningHasHappenedInJob() As bool
 Ссылки
 PlotLogger Класс, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!