Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.DrawingOpenEventArgs.FileName
 Послать отзыв
 Свойство FileName представляет имя открываемого файла чертежа.
 Синтаксис
C#
Visual Basic
Копировать Код
public String FileName;
Копировать Код
Public ReadOnly Property FileName As String
 Возвращает
 Возвращает имя открываемого файла. Тип String.
 Описание
 Свойство FileName представляет имя открываемого файла чертежа.
 Условия
 Только чтение.
 Ссылки
 HostMgd.ApplicationServices.DrawingOpenEventArgs, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!