Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.Windows.ToolPalette.CustomToolBase.GetDropTarget
 Послать отзыв
 Метод предназначен для получения интерфейса IDropTarget от инструмента. Не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtua System.Object GetDropTarget();
Копировать Код
Public Overridable Function GetDropTarget() As System.Object
 Возвращает
 Возвращает ссылку на интерфейс IDropTarget инструмента. Тип System.Object.
 Описание
 Метод предназначен для получения интерфейса IDropTarget от инструмента. Если инструменту требуется поддержка перетаскивания объектов, он должен реализовать этот интерфейс и передать его фреймворку через этот метод.
 В текущей версии не реализован.
 Ссылки
 HostMgd.Windows.ToolPalette.CustomToolBase, HostMgd.Windows.ToolPalette
 Ваши комментарии по поводу этого топика: Послать отзыв!