Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.SelectionAddedEventArgs.Add(SelectedObject)
 Послать отзыв
 Метод добавляет объект в набор выбранных объектов, предварительно проверяя, отсутствует ли он в наборе по идентификатору.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Add(SelectedObject value);
Копировать Код
Public Sub Add(value As SelectedObject)
 Параметры
 Параметры
 Описание
 value
 Объект, который необходимо добавить в набор. Должен содержать корректный ObjectId и, при необходимости, дополнительную информацию (например, точку выделения, трансформационную матрицу и т.д.). Тип SelectedObject
 Описание
 Метод используется для добавления объекта типа SelectedObject в коллекцию выбранных объектов — например, вручную формируемую SelectionSet или при программной модификации текущего выделения. Перед вставкой метод проверяет, существует ли уже объект с таким же ObjectId в коллекции. Если объект с таким идентификатором уже присутствует, он не добавляется повторно, что предотвращает дублирование в выборке.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события SelectionAdded [Teigha.Runtime.CommandMethod("SelectionAddedExample_Add")] public void SelectionAddedExample_Add() { // Подписка на событие Rollover editor.SelectionAdded += OnSelectionAdded; } // Реализация отработки события SelectionAdded private void OnSelectionAdded(object sender, SelectionAddedEventArgs e) { // Объект, полученный через запрос SelectedObject someSelectedObject = default; // Добавление нового объекта к выборке e.Add(someSelectedObject); // Вывод сообщения в командную строку editor.WriteMessage($"\nК выборке добавлен объект: {someSelectedObject.ObjectId}. Всего выбрано {e.Selection.Count}"); } }
 Ссылки
 HostMgd.EditorInput.SelectionAddedEventArgs, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!