Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.DocumentCollection.DocumentCreated
 Послать отзыв
 Событие, возникающее после создания нового объекта типа Document.
 Синтаксис
C#
Visual Basic
public event DocumentCollectionEventHandler DocumentCreated;
Public Event DocumentCreated As DocumentCollectionEventHandler
 Возвращает
 Возвращает тип данных HostMgd.ApplicationServices.DocumentCollectionEventHandler
 Описание
 Событие, возникающее после создания нового объекта типа Document.
 Соответствует функции NRX API HostApDocManagerReactor.documentCreated().
 Ссылки
 HostMgd.ApplicationServices.DocumentCollection, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!