Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод SelectedObject.ToString ()
 Послать отзыв
 Синтаксис
C#
Visual Basic
public String ToString();
Public Function ToString() As String
 Описание
 Метод возвращает строковое представление объекта (ObjectId, метод выделения, gsMarker).
 Ссылки
 SelectedObject Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!