Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство KeywordCollection.Default
 Послать отзыв
 Синтаксис
C#
Visual Basic
public String Default;
Public Property Default() As String
 Описание
 Возвращает и устанавливает значение ключевого слова, подставляемого при нажатии пользователем ENTER без какого-либо ввода.
 Условия
 На чтение и запись
 Ссылки
 KeywordCollection Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!