Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PublishSheetEventArgs.LayoutMarginMinX
 Послать отзыв
 This is LayoutMarginMinX, a member of class PublishSheetEventArgs.
 Синтаксис
C#
Visual Basic
public double LayoutMarginMinX;
Public Property LayoutMarginMinX() As Double
 Ссылки
 PublishSheetEventArgs Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!