Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Делегат HostMgd.Windows.PaletteSetShowDockBarEventHandler
 Послать отзыв
 This is type HostMgd::Windows::PaletteSetShowDockBarEventHandler.
 Синтаксис
C#
Visual Basic
public delegate PaletteSetShowDockBarEventHandler();
Public Delegate Sub PaletteSetShowDockBarEventHandler()
 Ваши комментарии по поводу этого топика: Послать отзыв!