Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Menu.MenuItems
 Послать отзыв
 This is MenuItems, a member of class Menu.
 Синтаксис
C#
Visual Basic
public HostMgd::Windows::MenuItemCollection MenuItems;
Public Property MenuItems() As HostMgd.Windows.MenuItemCollection
 Ссылки
 Menu Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!