Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 JigPrompts.AcquireString(String,String)
 Послать отзыв
 Метод запрашивает у пользователя строку/текстовые данные, используя при запросе приглашающее сообщение с ключевыми словами.
 Синтаксис
C#
Visual Basic
public HostMgd.EditorInput.PromptResult AcquireString(ref System.String messageAndKeywords, ref System.String globalKeywords);
Public Function AcquireString(ByRef messageAndKeywords As System.String, ByRef globalKeywords As System.String) As HostMgd.EditorInput.PromptResult
 Параметры
 Параметры
 Описание
 messageAndKeywords
 Строка, содержащая в себе сообщение запроса и ключевые слова к нему, которые будут выводиться на экране при запросе текстовых данных.
 globalKeywords
 Строка,содержащая в себе глобальные ключевые слова. Количество глобальных ключевых слов должно совпадать с количеством ключевых слов в приглашающем сообщении messageAndKeywords. Ключевые слова в строке globalKeywords должны отделяться друг от друга одним пробелом.
 Возвращает
 Возвращает результат типа string, который является строкой, введенной пользователем с клавиатуры в ответ на запрос.
 Описание
 Метод предназначен для запроса у пользователя текстовых данных, которые необходимо ввести с клавиатуры. После вызова создает экземпляр класса JigPromptStringOptions, присваивает его свойству Message значение параметра messageAndKeywords, выделяет из этого параметра ключевые слова, записывает их в свойство Keywords как KeywordCollection вместе с глобальными ключевыми словами из параметра globalKeywords. Первому ключевому слову в сообщении будет соответствовать первое глобальное ключевое слово и т. д. Далее метод вызывает свою перегрузку JigPrompts.AcquireString(JigPromptStringOptions options), передавая в нее созданный экземпляр класса JigPromptStringOptions с присвоенными значениями свойств.
 Если список ключевых слов ошибочный или пустой, либо количество глобальных ключевых слов не совпадает с количеством отображаемых ключевых слов, то возникает событие System.ArgumentException.
 Набор отображаемых ключевых слов строки messageAndKeywords должен быть заключен в скобки: "[" в начале и "]" в конце. Сами ключевые слова должны быть отделены между собой символом "/". Каждое отображаемое в строке messageAndKeywords ключевое слово должно также быть представлено на той же позиции в строке globalKeywords.
 Пример
 В примере приведен отрывок кода из реализации метода Sampler() класса Jig.
C#
 Копировать Код
PromptResult result = prompts.AcquireString("Текст или Добавить текст [СимволДиаметра/СимволРадиуса]:", "DiameterSign RadiusSign");
Visual Basic
 Копировать Код
Dim result As PromptResult = prompts.AcquireString("Текст или Добавить текст [СимволДиаметра/СимволРадиуса]:", "DiameterSign RadiusSign")
 Ссылки
 JigPrompts Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!