Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PromptDragOptions.Selection
 Послать отзыв
 Синтаксис
C#
Visual Basic
public HostMgd::EditorInput::SelectionSet Selection;
Public Property Selection() As HostMgd.EditorInput.SelectionSet
 Описание
 Возвращает выбранные пользователем объекты.
 Условия
 Только на чтение
 Ссылки
 PromptDragOptions Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!