Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод PaneCollection.Contains (HostMgd::Windows::Pane^)
 Послать отзыв
 This is Contains, a member of class PaneCollection.
 Синтаксис
C#
Visual Basic
public bool Contains(ref HostMgd::Windows::Pane value);
Public Function Contains(ByRef value As HostMgd.Windows.Pane) As bool
 Ссылки
 PaneCollection Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!