Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод JigPromptOptions.CommonInit
 Послать отзыв
 Вспомогательный метод, который задает значения свойствам Cursor и UserInputControls при создании экземпляра класса.
 Синтаксис
C#
Visual Basic
public void CommonInit();
Public Sub CommonInit()
 Описание
 Вспомогательный метод, вызывается в конструкторах класса для установки значений свойств Cursor и UserInputControls. Свойству Cursor присваивается значение Crosshair, свойству UserInputControls присваивается значение 0, т.е. все настройки пользовательского ввода равны значениям по умолчанию.
 Ссылки
 JigPromptOptions Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!