Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.Windows.ToolPalette.CustomToolBase.Edit
 Послать отзыв
 Метод предназначен для редактирования свойства инструмента в окне, заданном указателем. Не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void Edit( ref System.Object property, System.IntPtr parentWindow, bool success );
Копировать Код
Public Overridable Sub Edit( ByRef property As System.Object, parentWindow As System.IntPtr, success As Boolean )
 Параметры
 Параметры
 Описание
 property
 Входной объект, определяющий редактируемое свойство. Тип System.Object.
 parentWindow
 Указатель на родительское окно. Тип System.IntPtr.
 success
 Флаг завершения процедуры. Тип bool. Возвращает true в случае успешного завершения и false в противном случае.
 Описание
 Метод предназначен для редактирования свойства property инструмента в окне, заданном указателем IntPtr.
 В текущей версии не реализован.
 Ссылки
 HostMgd.Windows.ToolPalette.CustomToolBase, HostMgd.Windows.ToolPalette
 Ваши комментарии по поводу этого топика: Послать отзыв!