Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.EndDocumentEventArgs.Status
 Послать отзыв
 Свойство Status возвращает текущий статус отмены печати документа.
 Синтаксис
C#
Visual Basic
Копировать Код
public HostMgd.PlottingServices.PlotCancelStatus Status;
Копировать Код
Public ReadOnly Property Status As HostMgd.PlottingServices.PlotCancelStatus
 Возвращает
 Возвращает текущий статус. Перечисление HostMgd.PlottingServices.PlotCancelStatus.
 Описание
 Свойство Status возвращает текущий статус отмены печати документа как значение из перечисления HostMgd.PlottingServices.PlotCancelStatus.
 Условия
 Только чтение.
 Ссылки
 HostMgd.PlottingServices.EndDocumentEventArgs, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!