Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор PromptCornerOptions.PromptCornerOptions (String^, String^, Teigha::Geometry::Point3d)
 Послать отзыв
 Синтаксис
C#
Visual Basic
public PromptCornerOptions(ref String messageAndKeywords, ref String globalKeywords, Teigha::Geometry::Point3d basePoint);
Public Sub New(ByRef messageAndKeywords As String, ByRef globalKeywords As String, basePoint As Teigha.Geometry.Point3d)
 Параметры
 Параметры
 Описание
 messageAndKeywords
 Приглашающая строка с ключевыми словами
 globalKeywords
 Ключевые слова (глобальные имена)
 basePoint
 Базовая точка
 Описание
 Конструктор.
 Ссылки
 PromptCornerOptions Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!