Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.DsdEntryCollection.Item
 Послать отзыв
 Свойство Item предоставляет или задаёт элемент коллекции с указанным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public HostMgd.PlottingServices.DsdEntry this[int index];
Копировать Код
Public Property Item( index As Integer ) As HostMgd.PlottingServices.DsdEntry
 Параметры
 Параметры
 Описание
 index
 Входной индекс требуемого элемента. Тип int. Значения индекса отсчитываются от нуля.
 Возвращает
 Возвращает элемент коллекции с указанным индексом. Тип HostMgd.PlottingServices.DsdEntry.
 Описание
 Свойство Item предоставляет или задаёт элемент коллекции с указанным индексом.
 Условия
 Чтение и запись.
 Ссылки
 HostMgd.PlottingServices.DsdEntryCollection, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!