Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство LineWeightDialog.LineWeight
 Послать отзыв
 This is LineWeight, a member of class LineWeightDialog.
 Синтаксис
C#
Visual Basic
public Teigha::DatabaseServices::LineWeight LineWeight;
Public Property LineWeight() As Teigha.DatabaseServices.LineWeight
 Ссылки
 LineWeightDialog Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!