Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.Windows.ToolPalette.CustomToolBase.ValidateEditChanges
 Послать отзыв
 Метод выполняет проверку изменений, внесённых пользователем в процессе редактирования свойств инструмента. Вызывается после нажатия кнопки "ОК" в редакторе свойств инструмента. Не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void ValidateEditChanges();
Копировать Код
Public Overridable Sub ValidateEditChanges()
 Описание
 Метод вызывается после завершения редактирования свойств инструмента нажатием кнопки "ОК" и выполняет проверку изменений, внесённых пользователем.
 В текущей версии не реализован.
 Ссылки
 HostMgd.Windows.ToolPalette.CustomToolBase, HostMgd.Windows.ToolPalette
 Ваши комментарии по поводу этого топика: Послать отзыв!