Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство JigPrompts.Result
 Послать отзыв
 Набор данных, полученных от пользователя после запроса
 Синтаксис
C#
Visual Basic
internal PromptResult Result;
Friend Property Result() As PromptResult
 Возвращает
 Возвращает набор данных, полученных от пользователя после запроса угла, расстояния, точки или текста.
 Описание
 Значение свойства меняется во время работы технологии Jig при каждом изменении положения курсора мыши на экране либо при вводе с клавиатуры. После ввода с клавиатуры, свойство DragStatus примет значение DragEnd и изменение объекта или группы объектов завершится с введенными данными.
 Условия
 Только чтение.
 Ссылки
 JigPrompts Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!