Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.SelectionRemovedEventHandler(object,SelectionRemovedEventArgs)
 Послать отзыв
 Делегат предназначен для обработки события, возникающего при удалении одного или нескольких объектов из текущего набора выделенных объектов.
 Синтаксис
C#
Visual Basic
Копировать Код
public delegate void SelectionRemovedEventHandler(object sender, SelectionRemovedEventArgs e);
Копировать Код
Public Delegate Sub SelectionRemovedEventHandler(sender As Object, e As SelectionRemovedEventArgs)
 Параметры
 Параметры
 Описание
 sender
 Источник события — обычно экземпляр редактора (Editor), в котором произошло изменение выборки. Тип object
 e
 Объект, содержащий данные о произошедшем удалении:
 Описание
 Делегат используется как сигнатура метода-обработчика для события SelectionRemoved, которое генерируется в редакторе nanoCAD каждый раз, когда объекты удаляются из выборки — например, при удерживании клавиши Shift и щелчке по объекту, использовании режима "Удалить" или программном изменении выделения.
 Он позволяет разработчику отслеживать изменения в наборе выбранных объектов и реагировать на удаление — например, обновлять интерфейс, корректировать логику команды или выполнять анализ.
 Событие предоставляет доступ к списку удалённых объектов через объект SelectionRemovedEventArgs, что обеспечивает точный контроль над динамикой выборки.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; [Teigha.Runtime.CommandMethod("SelectionRemovedExample")] public void SelectionRemovedExample() { // Подписка на событие SelectionRemoved editor.SelectionRemoved += OnSelectionRemoved; } // Реализация отработки события SelectionRemoved private void OnSelectionRemoved(object sender, SelectionRemovedEventArgs e) { SelectionSet removedSet = e.Selection; foreach (ObjectId id in removedSet.GetObjectIds()) { editor.WriteMessage($"\nИз выборки удалён объект: {id}"); } } }
 Ваши комментарии по поводу этого топика: Послать отзыв!