Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство KeywordCollection.IsReadOnly
 Послать отзыв
 Синтаксис
C#
Visual Basic
public bool IsReadOnly;
Public Property IsReadOnly() As bool
 Описание
 Возвращает или устанавливает значение, указывающее, используется ли коллекция в режиме "только для чтения".
 Значение true означает, что коллекция используется в режиме "только для чтения", в противном случае свойство имеет значение false.
 Условия
 На чтение и запись
 Ссылки
 KeywordCollection Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!