Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptNestedEntityOptions.NonInteractivePickPoint
 Послать отзыв
 Свойство устанавливает или возвращает точку выбора, используемую при программном (неинтерактивном) выборе вложенного геометрического объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d NonInteractivePickPoint { get; set; }
Копировать Код
Public Property NonInteractivePickPoint As Point3d
 Возвращает
 Возвращает или устанавливает объект типа Point3d:
Если точка задана — используется как позиция для автоматического выбора.
Если значение Point3d.Null — режим программного выбора отключён, и операция ожидает интерактивного ввода.
 Описание
 Свойство используется для задания точки, в которой должен быть "выбран" вложенный объект без участия пользователя — например, в автоматизированных или фоновых операциях. Оно применяется при программном вызове метода GetNestedEntity() в режиме без интерактивного ввода, когда выбор объекта должен быть выполнен автоматически на основе указанной точки.
 Точка задаётся в мировых координатах (WCS), но при обработке преобразуется в локальную систему координат контейнера (например, блока), чтобы корректно определить, какой вложенный объект находится в указанной позиции.
 Это свойство особенно полезно при реализации команд, где требуется:
автоматический выбор объектов внутри блоков,
анализ компонентов по заданным координатам,
массовая обработка вложенных элементов без пользовательского ввода.
 Условия
 Чтение и запись
 Ссылки
 HostMgd.EditorInput.PromptNestedEntityOptions, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!