Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.InplaceTextEditor.LayerColor
 Послать отзыв
 Свойство LayerColor позволяет проверить цвет слоя для данного объекта текстового редактора. В текущей версии не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public Color LayerColor;
Копировать Код
Public ReadOnly Property LayerColor As Color
 Возвращает
 Возвращает цвет слоя данного объекта. Тип Color.
 Описание
 Свойство LayerColor позволяет проверить цвет слоя для данного объекта текстового редактора. В текущей версии не реализовано.
 Условия
 Только чтение.
 Ссылки
 HostMgd.ApplicationServices.InplaceTextEditor, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!