Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.InplaceTextEditor.WipeoutDialog
 Послать отзыв
 Метод вызывает диалоговое окно маскирования текста. В текущей версии не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public void WipeoutDialog();
Копировать Код
Public Sub WipeoutDialog()
 Описание
 Метод вызывает диалоговое окно маскирования текста в данном встроенном текстовом редакторе. В текущей версии этот метод не реализован.
 Ссылки
 HostMgd.ApplicationServices.InplaceTextEditor, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!