Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.Application.InvokeContextHelp(IntPtr,int)
 Послать отзыв
 МЕТОД НЕ РЕАЛИЗОВАН. Метод вызывает контекстную справку.
 Синтаксис
C#
Visual Basic
Копировать Код
public static void InvokeContextHelp(IntPtr window, int contextId);
Копировать Код
Public Shared Sub InvokeContextHelp(window As IntPtr, contextId As Integer)
 Параметры
 Параметры
 Описание
 window
 Указатель на окно, для которого вызывается справка. Тип IntPtr
 contextId
 Идентификатор контекста, для которого вызывается справка. Тип Integer
 Описание
 Метод открывает окно с контекстной справкой ждя указанного контекста.
 Ссылки
 HostMgd.ApplicationServices.Application, HostMgd.ApplicationServices Пространство имен
 Исключения
 MGD NOT_IMPLEMENTED
 Ваши комментарии по поводу этого топика: Послать отзыв!