Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Publisher.FireBeginEntity
 Послать отзыв
 This is FireBeginEntity, a member of class Publisher.
 Синтаксис
C#
Visual Basic
public void FireBeginEntity(ref HostMgd::Publishing::PublishEntityEventArgs e);
Public Sub FireBeginEntity(ByRef e As HostMgd.Publishing.PublishEntityEventArgs)
 Ссылки
 Publisher Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!