Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.RecentDocument.CurrentlyOpenBy
 Послать отзыв
 Свойство CurrentlyOpenBy представляет имя приложения, в котором в настоящее время открыт данный документ. В текущей версии данное свойство не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public System.String CurrentlyOpenBy;
Копировать Код
Public ReadOnly Property CurrentlyOpenBy As System.String
 Возвращает
 Возвращает имя приложения, в котором открыт документ. Тип System.String.
 Описание
 Свойство CurrentlyOpenBy представляет имя приложения, в котором в настоящее время открыт данный документ.
 В текущей версии данное свойство не реализовано.
 Условия
 Только чтение.
 Ссылки
 HostMgd.ApplicationServices.RecentDocument, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!