Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptIntegerResult
 Послать отзыв
 Класс содержит результат интерактивного ввода целого числа пользователем в nanoCAD, включая значение, статус и строковое представление ввода.
 Иерархия классов
HostMgd::EditorInput::PromptResult HostMgd::EditorInput::PromptIntegerResult
 Синтаксис
C#
Visual Basic
Копировать Код
public sealed class PromptIntegerResult : PromptResult
Копировать Код
Public NotInheritable Class PromptIntegerResult Inherits PromptResult
 Описание
 Класс наследуется от PromptResult и используется для хранения данных о завершении операции ввода целого числа через метод GetInteger() или событие PromptedForInteger. Он предоставляет информацию о:
введённом числе (Value типа int),
статусе операции (Status, например OK, Cancel, Error),
строковом представлении ввода (InputString — если число было введено с клавиатуры или использовалось ключевое слово),
параметрах приглашения (Options), переданных в команду.
 Этот класс применяется при разработке плагинов и надстроек, где требуется обработка пользовательского ввода с проверкой допустимых значений, диапазона и контекста. Класс является sealed (ненаследуемым) и предназначен только для чтения после выполнения команды.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("GetIntegerExample")] public void GetIntegerExample() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создаём запрос пользователю PromptIntegerOptions iopts = new PromptIntegerOptions("Введите целое число"); iopts.DefaultValue = 10; iopts.LowerLimit = 0; iopts.UpperLimit = 100; // Вызываем метод GetInteger() для запроса пользователю PromptIntegerResult ipr = editor.GetInteger(iopts); // Если все данные введены, выводим результат в командную строку if (PromptStatus.OK == ipr.Status) { editor.WriteMessage("\nВы ввели: " + ipr.Value); } else { editor.WriteMessage("\nОтмена или ошибка ввода."); } } }
 Топики
 Имя
 Описание
 PromptResult Методы
 Ниже перечислены методы класса PromptResult.
 PromptResult Свойства
 Ниже перечислены свойства класса PromptResult.
 HostMgd.EditorInput.PromptIntegerResult
 Имя
 Описание
 PromptIntegerResult Методы
 Ниже перечислены методы класса PromptIntegerResult.
 PromptIntegerResult Свойства
 Ниже перечислены свойства класса PromptIntegerResult.
 Ссылки
 PromptIntegerResult Методы, PromptIntegerResult Свойства, Топики, PromptResult Методы, PromptResult Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!