Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство BeginDoubleClickEventArgs.Location
 Послать отзыв
 Свойство предназначено для хранения координат точки на чертеже, где произошел двойной щелчек.
 Синтаксис
C#
Visual Basic
public Teigha::Geometry::Point3d Location;
Public Property Location() As Teigha.Geometry.Point3d
 Возвращает
 Возвращает координаты точки. Тип Point3d.
 Описание
 В свойстве хранятся координатф точки на чертеже, где произошел двойной щелчек левой клавишей мыши.
 Указывает координаты события переменной.
 Указывает координаты события переменной.
 Условия
 Только чтение.
 Только на чтение
 Только на чтение
 Ссылки
 BeginDoubleClickEventArgs Класс, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!