Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PaletteSet.IsSynchronized
 Послать отзыв
 This is IsSynchronized, a member of class PaletteSet.
 Синтаксис
C#
Visual Basic
public bool IsSynchronized;
Public Property IsSynchronized() As bool
 Ссылки
 PaletteSet Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!