Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PromptNumericalOptions.UseDefaultValue
 Послать отзыв
 Синтаксис
C#
Visual Basic
public bool UseDefaultValue;
Public Property UseDefaultValue() As bool
 Описание
 Возвращает и выставляет признак того, будет ли использоваться значение по умолчанию в случае, если пользователь вводит Enter без какого-либо другого ввода. Это свойство позволяет использовать программный код для задания значения по умолчанию, определенного в производных классах.
 Условия
 На чтение и запись
 Ссылки
 PromptNumericalOptions Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!