Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Класс HostMgd.EditorInput.JigPromptGeometryOptions
 Послать отзыв
 Класс предназначен для хранения набора параметров, которые используются во время операции Jig с геометрическими объектами.
 Иерархия классов
HostMgd::EditorInput::PromptOptions HostMgd::EditorInput::JigPromptOptions HostMgd::EditorInput::JigPromptGeometryOptions
 Синтаксис
C#
Visual Basic
public class JigPromptGeometryOptions : JigPromptOptions;
Public Class JigPromptGeometryOptions Inherits JigPromptOptions
 Описание
 Абстрактный класс, предназначенный для для хранения набора параметров, которые используются во время операции Jig с геометрическими объектами. Является базовым классом для классов JigPromptAngleOptions, JigPromptDistanceOptions, JigPromptPointOptions.
 Класс предоставляет возможность установить для опрерации Jig базовую точку, приглашающее сообщение, ключевые слова, внешний вид курсора и изменить пользовательские настройки ввода.
 Методы
 Конструкторы
 Класс HostMgd.EditorInput.JigPromptGeometryOptions
 Имя
 Описание
 JigPromptGeometryOptions
 Это обзор перегрузок JigPromptGeometryOptions.
 Топики
 Имя
 Описание
 PromptOptions Методы
 Ниже перечислены методы класса PromptOptions.
 PromptOptions Свойства
 Ниже перечислены свойства класса PromptOptions.
 Класс HostMgd.EditorInput.JigPromptOptions
 Имя
 Описание
 JigPromptOptions Методы
 Ниже перечислены методы класса JigPromptOptions.
 JigPromptOptions Свойства
 Ниже перечислены свойства класса JigPromptOptions.
 Класс HostMgd.EditorInput.JigPromptGeometryOptions
 Имя
 Описание
 JigPromptGeometryOptions Свойства
 Ниже перечислены свойства класса JigPromptGeometryOptions.
 Ссылки
 JigPromptGeometryOptions Конструктор, JigPromptGeometryOptions Свойства, Методы, Топики, PromptOptions Методы, PromptOptions Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!