Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.Windows.ToolPalette.Category
 Послать отзыв
 Класс Category представляет элемент категории в каталоге инструментов.
 Иерархия классов
HostMgd::Windows::ToolPalette::CatalogItem HostMgd::Windows::ToolPalette::Category
 Синтаксис
C#
Visual Basic
Копировать Код
public class Category : CatalogItem
Копировать Код
Public Class Category Inherits CatalogItem
 Описание
 Класс Category представляет элемент категории в каталоге инструментов.
 Топики
 Имя
 Описание
 CatalogItem Методы
 Ниже перечислены методы класса CatalogItem.
 Ссылки
 Топики, CatalogItem Методы
 Ваши комментарии по поводу этого топика: Послать отзыв!