Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptAngleOptions.AllowNone
 Послать отзыв
 Свойство определяет, разрешено ли завершение ввода угла нажатием Enter без указания значения.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool AllowNone { get; set; }
Копировать Код
Public Property AllowNone As Boolean
 Возвращает
 Возвращает значение типа bool:
true — пользователь может завершить ввод нажатием Enter.
false — ввод угла обязателен.
 Описание
 Свойство используется для указания, может ли пользователь завершить операцию ввода угла простым нажатием клавиши Enter , без ввода конкретного значения. Если свойство установлено в true, это действие считается допустимым, и операция ввода завершается со статусом PromptStatus.None. Если false — пользователь обязан ввести значение угла или выбрать ключевое слово.
 Это свойство полезно при реализации команд, где требуется разрешить пропуск параметра угла, например, при использовании значения по умолчанию, заданного ранее.
 Замечания
 Свойство AllowNone часто применяется вместе с DefaultValue, чтобы обеспечить ввод угла по умолчанию при нажатии Enter. Это упрощает взаимодействие пользователя с командами, где угол не обязателен, но может быть изменён.
 Условия
 Чтение и запись
 Ссылки
 HostMgd.EditorInput.PromptAngleOptions, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!