Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.GetViewportNumber(Point)
 Послать отзыв
 Метод предназначен для получения номера видового экрана, в котором находится указанная точка на экране.
 Синтаксис
C#
Visual Basic
Копировать Код
public int GetViewportNumber(System.Drawing.Point point);
Копировать Код
Public Function GetViewportNumber(point As System.Drawing.Point) As Integer
 Параметры
 Параметры
 Описание
 point
 Точка в клиентных координатах окна (в пикселях), относительно которой определяется номер видового экрана. Тип System.Drawing.Point.
 Возвращает
 Возвращает значение типа int, представляющее номер видового экрана, в котором находится указанная точка. Если точка не принадлежит ни одному из видовых экранов, метод может вернуть -1.
 Описание
 Метод используется для определения, в каком видовом экране nanoCAD находится заданная точка, указанная в координатах клиентской области окна редактора. Это может быть полезно при обработке пользовательского ввода, связанного с несколькими видовыми экранами, например, при работе с мультимониторными интерфейсами или разделённым представлением чертежа.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("GetViewportNumberExample")] public void GetViewportNumberExample() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создаём запрос пользователю System.Drawing.Point screenPoint = new System.Drawing.Point(100, 100); int viewportNumber = editor.GetViewportNumber(screenPoint); // Если все данные введены, выводим результат в командную строку if (viewportNumber != -1) { editor.WriteMessage( $"\nТочка находится в видовом экране №{viewportNumber}"); } else { editor.WriteMessage( "\nТочка вне видовых экранов."); } } }
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!