Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.MouseHasMoved
 Послать отзыв
 Свойство предназначено для проверки, перемещался ли курсор мыши в текущем контексте редактора с момента последней обработки события.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool MouseHasMoved { get; }
Копировать Код
Public ReadOnly Property MouseHasMoved() As bool
 Возвращает
 Возвращает значение типа bool:
true — если курсор мыши был перемещён с момента последнего обновления.
false — если перемещения мыши не было и текущее положение остаётся актуальным.
 Описание
 Свойство используется при интерактивных операциях (например, при перетаскивании или динамической отрисовке) для определения, было ли зафиксировано новое движение мыши. Если событие движения произошло, это позволяет прервать текущую длительную операцию и немедленно обновить состояние на основе актуальных координат курсора, избегая устаревших вычислений. Свойство особенно полезно в методах, где важна отзывчивость к пользовательскому вводу.
 Условия
 Только чтение
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("MouseHasMovedExample")] public void MouseHasMovedExample() { // Получаем доступ к текущему документу и редактору Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Условная логика: имитируем позицию курсора System.Drawing.Point examplePoint = new System.Drawing.Point(5, 5); // Преобразуем в мировые координаты Point3d exampleWorldPoint = editor.PointToWorld(examplePoint); // Проверяем, изменилось ли положение мыши с момента последнего опроса if (editor.MouseHasMoved) { // Положение мыши изменилось — обновляем данные editor.WriteMessage($"\nКурсор переместился. Новая позиция: {exampleWorldPoint}"); // Здесь могла бы быть логика обновления превью (например, динамическая вставка) } else { // Курсор не двигался — используем предыдущие данные editor.WriteMessage($"\nКурсор неподвижен."); } } }
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!