Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptStringResultEventArgs
 Послать отзыв
 Класс предоставляет данные для события, возникающего после завершения операции ввода строки или ключевого слова в редакторе nanoCAD.
 Иерархия классов
HostMgd::EditorInput::PromptStringResultEventArgs
 Синтаксис
C#
Visual Basic
Копировать Код
public class PromptStringResultEventArgs : EventArgs
Копировать Код
Public Class PromptStringResultEventArgs Inherits EventArgs
 Описание
 Класс наследуется от EventArgs и используется в .NET API nanoCAD для передачи информации о результате ввода строки пользователем. Он применяется совместно с событиями, такими как PromptedForKeyword и PromptedForString, и предоставляет доступ к:
введённой строке (Value),
статусу операции (Status — OK, Cancel, Error и др.),
исходному вводу (StringResult, если пользователь ввёл значение вручную),
параметрам приглашения (Options, если были заданы).
 Этот класс играет важную роль при обработке текстового ввода в плагинах и надстройках, позволяя реагировать на выбор пользователя из списка ключевых слов или ручной ввод строки.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события PromptedForKeyword [Teigha.Runtime.CommandMethod("PromptedForKeywordExample")] public void PromptedForKeywordExample() { // Подписка на событие PromptedForKeyword editor.PromptedForKeyword += OnEditorPromptedForKeyword; } // Реализация отработки события PromptedForKeyword  private void OnEditorPromptedForKeyword(object sender, PromptStringResultEventArgs e) { // Вывод сообщения в командную строку if (e.Result.Status == PromptStatus.OK) { editor.WriteMessage($"\nВведено ключевое слово: {e.Result.StringResult}"); } else { editor.WriteMessage("\nВвод ключевого слова отменён."); } } }
 Топики
 Имя
 Описание
 PromptStringResultEventArgs Свойства
 Ниже перечислены свойства класса PromptStringResultEventArgs.
 Ссылки
 PromptStringResultEventArgs Свойства, Топики, PromptStringResultEventArgs Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!