Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.ProfileEventArgs
 Послать отзыв
 Класс ProfileEventArgs представляет данные события ProfileEvent. В текущей версии данный класс не реализован.
 Иерархия классов
HostMgd::ApplicationServices::ProfileEventArgs
 Синтаксис
C#
Visual Basic
Копировать Код
public sealed class ProfileEventArgs : System.EventArgs;
Копировать Код
Public NotInheritable Class ProfileEventArgs Inherits System.EventArgs
 Описание
 Класс ProfileEventArgs представляет данные события ProfileEvent.
 В текущей версии данный класс не реализован.
 Топики
 Имя
 Описание
 ProfileEventArgs Свойства
 Ниже перечислены свойства класса ProfileEventArgs.
 Ссылки
 ProfileEventArgs Свойства, Топики, ProfileEventArgs Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!