Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Класс HostMgd.ApplicationServices.UserConfigurationManager
 Послать отзыв
 Иерархия классов
HostMgd::ApplicationServices::UserConfigurationManager
 Синтаксис
C#
Visual Basic
public class UserConfigurationManager : System.MarshalByRefObject;
Public Class UserConfigurationManager Inherits System.MarshalByRefObject
 Описание
 Класс управялет глобальными переменными, профилем пользователя, секциями диалога в реестре Window's для приложения nanoCAD. /// /// Класс добавлен для совместимости.
 Топики
 Имя
 Описание
 UserConfigurationManager Методы
 Ниже перечислены методы класса UserConfigurationManager.
 UserConfigurationManager События
 Ниже перечислены события класса UserConfigurationManager.
 Ссылки
 UserConfigurationManager Методы, UserConfigurationManager События, Топики, UserConfigurationManager Методы, UserConfigurationManager События
 Ваши комментарии по поводу этого топика: Послать отзыв!