Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор ImageInfo.ImageInfo (System::Drawing::Size, System::String^, System::String^)
 Послать отзыв
 This is ImageInfo, a member of class ImageInfo.
 Синтаксис
C#
Visual Basic
public ImageInfo(System.Drawing.Size size, ref System.String resourceName, ref System.String resourceFile);
Public Sub New(size As System.Drawing.Size, ByRef resourceName As System.String, ByRef resourceFile As System.String)
 Ссылки
 ImageInfo Класс, HostMgd.Windows.ToolPalette
 Ваши комментарии по поводу этого топика: Послать отзыв!