Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Перечисление HostMgd.Windows.ToolPalette.TPOperationFlag
 Послать отзыв
 This is record HostMgd::Windows::ToolPalette::TPOperationFlag.
 Синтаксис
C#
Visual Basic
public enum TPOperationFlag { ContextMenu = 4, Drag = 2, Pick = 1 }
Public Enum TPOperationFlag ContextMenu = 4 Drag = 2 Pick = 1 End Enum
 Ваши комментарии по поводу этого топика: Послать отзыв!