Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор ToolAttribute.ToolAttribute ()
 Послать отзыв
 This is ToolAttribute, a member of class ToolAttribute.
 Синтаксис
C#
Visual Basic
public ToolAttribute();
Public Sub New()
 Ссылки
 ToolAttribute Класс, HostMgd.Windows.ToolPalette
 Ваши комментарии по поводу этого топика: Послать отзыв!