Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptSelectionOptions.SelectEverythingInAperture
 Послать отзыв
 Синтаксис
C#
Visual Basic
Копировать Код
public bool SelectEverythingInAperture { get; set; }
Копировать Код
Public Property SelectEverythingInAperture As Boolean
 Возвращает
 Возвращает значение типа bool:
true — включён режим :E: все объекты в пределах апертуры выбираются.
false — режим отключён, выбор зависит от текущего режима (Window, Crossing и т.д.).
 Описание
 Свойство влияет на поведение внутренней функции выбора объектов HostSSGet. Оно включает или отключает режим :E, при котором все объекты, пересекаемые прямоугольной апертурой (курсором выбора), автоматически добавляются в набор выбора , независимо от того, используется ли режим окна, рамки или одиночного выбора.
 Если свойство установлено в true, при щелчке мышью выбираются все объекты , попадающие под апертуру, даже если они частично её пересекают. Если false — применяется стандартное поведение, зависящее от режима выбора (например, только объекты, полностью внутри окна, или точное попадание). Этот режим особенно полезен при реализации команд, где требуется максимальная чувствительность выбора — например, при быстром редактировании или массовом выделении.
 Условия
 Чтение и запись
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("PromptSelectionOptionsExample_SelectEverythingInAperture")] public void PromptSelectionOptionsExample_SelectEverythingInAperture() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создаём набор параметров для запроса PromptSelectionOptions options = new PromptSelectionOptions(); options.MessageForAdding = "Выберите линии для объединения:"; // Включить режим :E options.SelectEverythingInAperture = true; // Фильтр: только объекты типа Line TypedValue[] filterList = new TypedValue[] { new TypedValue((int)DxfCode.Start, "LINE") }; SelectionFilter filter = new SelectionFilter(filterList); // Создаём запрос пользователю PromptSelectionResult result = editor.GetSelection(options, filter); // Если все данные введены, выводим результат в командную строку if (result.Status == PromptStatus.OK) { SelectionSet selSet = result.Value; editor.WriteMessage( $"\nВыбрано объектов: {selSet.Count}"); } else { editor.WriteMessage( "\nНе удалось получить выделение."); } } }
 Ссылки
 HostMgd.EditorInput.PromptSelectionOptions, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!