Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод MenuItemCollection.IndexOf (HostMgd::Windows::MenuItem^)
 Послать отзыв
 This is IndexOf, a member of class MenuItemCollection.
 Синтаксис
C#
Visual Basic
public int IndexOf(ref HostMgd::Windows::MenuItem value);
Public Function IndexOf(ByRef value As HostMgd.Windows.MenuItem) As Integer
 Ссылки
 MenuItemCollection Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!