Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.LongTransactionManager.AbortLongTransaction
 Послать отзыв
 Метод прерывает длительную транзакцию с указанным идентификатором. В текущей версии не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public void AbortLongTransaction( Teigha.DatabaseServices.ObjectId transId, bool keepObjs );
Копировать Код
Public Sub AbortLongTransaction( transId As Teigha.DatabaseServices.ObjectId, keepObjs As Boolean )
 Параметры
 Параметры
 Описание
 transId
 Идентификатор длительной транзакции. Тип Teigha.DatabaseServices.ObjectId.
 keepObjs
 Флаг сохранения созданных объектов. Тип bool. Если равен true, созданные в рамках транзакции объекты рабочего набора сохраняются в целевом блоке. В случае false они удаляются.
 Описание
 Метод предназначен для прерывания длительной транзакции с идентификатором transId. Дополнительно метод дает возможность сохранить в базе данных объекты, созданные в рамках транзакции.
 В текущей версии не реализован.
 Ссылки
 HostMgd.ApplicationServices.LongTransactionManager, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!