Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Класс HostMgd.Windows.ToolPalette.Package
 Послать отзыв
 This is class HostMgd::Windows::ToolPalette::Package.
 Иерархия классов
HostMgd::Windows::ToolPalette::CatalogItem HostMgd::Windows::ToolPalette::Package
 Синтаксис
C#
Visual Basic
public class Package : CatalogItem;
Public Class Package Inherits CatalogItem
 Топики
 Имя
 Описание
 CatalogItem Методы
 Ниже перечислены методы класса CatalogItem.
 Ссылки
 Топики, CatalogItem Методы
 Ваши комментарии по поводу этого топика: Послать отзыв!