Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PublishSheetEventArgs.OriginX
 Послать отзыв
 This is OriginX, a member of class PublishSheetEventArgs.
 Синтаксис
C#
Visual Basic
public double OriginX;
Public Property OriginX() As Double
 Ссылки
 PublishSheetEventArgs Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!