Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.Document.FromAcadDocument(System.Object)
 Послать отзыв
 Метод предназначен для преобразования объекта в тип данных Document. Метод не реализован.
 Синтаксис
C#
Visual Basic
public Document FromAcadDocument(ref System.Object acadDocument);
Public Function FromAcadDocument(ByRef acadDocument As System.Object) As Document
 Параметры
 Параметры
 Описание
 acadDocument
 Объект, который необходимо преобразовать. Тип System.Object
 Возвращает
 Возвращает преобразованный объект. Тип Document
 Описание
 Метод преобразует объект в тип данных Document.
 Замечания
 Метод не реализован.
 Ссылки
 HostMgd.ApplicationServices.Document, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!