Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Событие PaletteSet.PaletteAddContextMenu
 Послать отзыв
 This is PaletteAddContextMenu, a member of class PaletteSet.
 Синтаксис
C#
Visual Basic
public event PaletteAddContextMenuEventHandler PaletteAddContextMenu;
Public Event PaletteAddContextMenu As PaletteAddContextMenuEventHandler
 Ссылки
 PaletteSet Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!