Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.DocumentWindowCollection.IsSynchronized
 Послать отзыв
 Свойство IsSynchronized позволяет проверить, является ли доступ к данной коллекции потокобезопасным.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsSynchronized;
Копировать Код
Public ReadOnly Property IsSynchronized As Boolean Implements ICollection.IsSynchronized
 Возвращает
 Возвращает true, если доступ к этой коллекции является потокобезопасным. В противном случае возвращает false.
 Описание
 Свойство IsSynchronized позволяет проверить, является ли доступ к данной коллекции потокобезопасным.
 Условия
 Только чтение.
 Ссылки
 HostMgd.ApplicationServices.DocumentWindowCollection, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!