Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод EPlotAttributeCollection.Add
 Послать отзыв
 This is Add, a member of class EPlotAttributeCollection.
 Синтаксис
C#
Visual Basic
public void Add(ref HostMgd::Publishing::EPlotAttribute value);
Public Sub Add(ByRef value As HostMgd.Publishing.EPlotAttribute)
 Ссылки
 EPlotAttributeCollection Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!