Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.BeginDocumentEventArgs.FileName
 Послать отзыв
 Свойство FileName представляет имя файла.
 Синтаксис
C#
Visual Basic
Копировать Код
public System.String FileName;
Копировать Код
Public ReadOnly Property FileName As System.String
 Возвращает
 Возвращает имя файла. Тип System.String.
 Описание
 Свойство FileName представляет имя файла.
 Условия
 Только чтение.
 Ссылки
 HostMgd.PlottingServices.BeginDocumentEventArgs, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!