Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор PickPointSelectedObject.PickPointSelectedObject
 Послать отзыв
 Синтаксис
C#
Visual Basic
public PickPointSelectedObject(Teigha::DatabaseServices::ObjectId id, HostMgd::EditorInput::SelectionMethod method, int gsMarker, ref HostMgd::EditorInput::PickPointDescriptor descriptor);
Public Sub New(id As Teigha.DatabaseServices.ObjectId, method As HostMgd.EditorInput.SelectionMethod, gsMarker As Integer, ByRef descriptor As HostMgd.EditorInput.PickPointDescriptor)
 Параметры
 Параметры
 Описание
 id
 ID объекта
 method
 Метод выбора
 gsMarker
 GS маркеры
 descriptor
 Описание выбора точки
 Описание
 Конструктор.
 Ссылки
 PickPointSelectedObject Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!