Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PublishSheetEventArgs.StepsPerInch
 Послать отзыв
 This is StepsPerInch, a member of class PublishSheetEventArgs.
 Синтаксис
C#
Visual Basic
public double StepsPerInch;
Public Property StepsPerInch() As Double
 Ссылки
 PublishSheetEventArgs Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!