Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Tool.EnableFlyout
 Послать отзыв
 This is EnableFlyout, a member of class Tool.
 Синтаксис
C#
Visual Basic
public void EnableFlyout(bool useFlyout);
Public Sub EnableFlyout(useFlyout As bool)
 Ссылки
 Tool Класс, HostMgd.Windows.ToolPalette
 Ваши комментарии по поводу этого топика: Послать отзыв!