Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptEntityOptionsEventArgs
 Послать отзыв
 Класс предоставляет данные для события PromptingForEntity и позволяет настроить параметры выбора геометрического объекта перед началом операции.
 Иерархия классов
HostMgd::EditorInput::PromptEntityOptionsEventArgs
 Синтаксис
C#
Visual Basic
Копировать Код
public sealed class PromptEntityOptionsEventArgs : EventArgs
Копировать Код
Public NotInheritable Class PromptEntityOptionsEventArgs Inherits EventArgs
 Описание
 Класс используется в .NET API nanoCAD для передачи параметров при начале операции выбора объекта — например, перед вызовом метода GetEntity(). Объект этого класса передаётся в обработчик события PromptingForEntity, предоставляя доступ к настройкам выбора через свойство Options.
 Через этот класс можно:
изменить текст приглашения (Message),
ограничить типы допустимых объектов (линии, окружности, блоки и т.д.),
задать ключевые слова,
управлять режимами ввода (AllowNone, AllowArbitraryInput и др.).
 Это позволяет гибко настраивать поведение команды выбора в зависимости от контекста — например, при реализации фильтров, специализированных редакторов или параметрических операций.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события PromptingForEntity [Teigha.Runtime.CommandMethod("PromptingForEntityExample")] public void PromptingForEntityExample() { // Подписка на событие PromptingForEntity editor.PromptingForEntity += OnEditorPromptingForEntity; } // Реализация отработки события PromptingForEntity private void OnEditorPromptingForEntity(object sender, PromptEntityOptionsEventArgs e) { // Изменение сообщения приглашения e.Options.Message = "Выберите линию или окружность:"; // Классы объектов, которые можно выбирать e.Options.AddAllowedClass(typeof(Line3d),true); e.Options.AddAllowedClass(typeof(Circle),true); // Можно ничего не выбрать e.Options.AllowNone = true; } }
 Топики
 Имя
 Описание
 PromptEntityOptionsEventArgs Свойства
 Ниже перечислены свойства класса PromptEntityOptionsEventArgs.
 Ссылки
 PromptEntityOptionsEventArgs Свойства, Топики, PromptEntityOptionsEventArgs Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!