Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Делегат HostMgd.Publishing.BeginAggregationEventHandler
 Послать отзыв
 This is type HostMgd::Publishing::BeginAggregationEventHandler.
 Синтаксис
C#
Visual Basic
public delegate BeginAggregationEventHandler();
Public Delegate Sub BeginAggregationEventHandler()
 Ваши комментарии по поводу этого топика: Послать отзыв!