Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptSelectionOptionsEventArgs.GetPoints()
 Послать отзыв
 Метод возвращает коллекцию точек, связанных с операцией выбора объектов — например, точек указания, использованных при выборе.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3dCollection GetPoints();
Копировать Код
Public Function GetPoints() As Point3dCollection
 Возвращает
 Возвращает объект типа Point3dCollection — коллекцию трёхмерных точек (Point3d), заданных в мировой системе координат (WCS).
Если точки были указаны (например, при построении рамки или полигона), они включаются в коллекцию.
Если выбор выполнен без указания точек (например, через команду "Все"), коллекция может быть пустой или содержать одну точку.
Если операция не была запущена или точки не зафиксированы, возвращается пустая коллекция (не null).
 Описание
 Метод предназначен для получения массива точек (Point3dCollection), которые были указаны пользователем в ходе операции выбора объектов. Эти точки могут соответствовать:
начальной и конечной точкам рамки выбора,
точкам нажатия при выборе мышью,
промежуточным точкам при построении полигональной области выбора.
 Этот метод особенно полезен при реализации команд, где требуется анализ не только выбранных объектов, но и геометрии выборки — например, для фильтрации по области, построения границ или реализации пользовательских алгоритмов привязки.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события PromptingForSelection [Teigha.Runtime.CommandMethod("PromptingForSelectionExample_GetPoints")] public void PromptingForSelectionExample_GetPoints() { // Подписка на событие PromptingForSelection editor.PromptingForSelection += OnEditorPromptingForSelection; } // Реализация отработки события PromptingForSelection private void OnEditorPromptingForSelection(object sender, PromptSelectionOptionsEventArgs e) { // Получаем доступ к коллекции точек выбора Point3dCollection points = e.GetPoints(); // Если коллекция не пустая, то выводим информацию о точках выбора в командную строку if (points.Count > 0) { foreach (Point3d pt in points) { editor.WriteMessage($"\nТочка выбора: {pt}"); } } else { editor.WriteMessage("\nТочки выбора не заданы."); } } }
 Ссылки
 HostMgd.EditorInput.PromptSelectionOptionsEventArgs, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!