Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.Snap(String,Point3d)
 Послать отзыв
 Метод привязывает указанную точку к ближайшей точке привязки чертежа в соответствии с заданным режимом привязки. Метод не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d Snap(System.String snapMode, Point3d input);
Копировать Код
Public Function Snap(snapMode As System.String, input As Point3d) As Point3d
 Параметры
 Параметры
 Описание
 snapMode
 Режим привязки, указывающий, к какому типу опорной точки должна быть привязана входная координата. Поддерживаются стандартные режимы привязки, такие как:
 Возвращает
 Возвращает значение типа Point3d, представляющее собой скорректированную точку после применения привязки. Если привязка не может быть выполнена (например, подходящая точка не найдена), возвращается исходная точка input.
 Описание
 Метод используется для выполнения операции привязки точки в чертеже nanoCAD по заданному режиму. Он позволяет корректировать координаты входной точки (input) так, чтобы она совпадала с одной из опорных точек чертежа — например, узлом сетки, концом линии, центром окружности и т. д. Режим привязки задаётся строковым параметром snapMode, который определяет тип используемой привязки (например, "END", "MID", "CEN" и т. п.). Метод не реализован
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("SnapExample")] public void SnapExample() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создаём точку для привязки Point3d userInput = new Point3d(10.2, 5.6, 0); // Вызываем метод привязки, указав режим и точку Point3d snappedPoint = editor.Snap("END", userInput); // Выводим сообщение в командную строку editor.WriteMessage( $"\nПривязанная точка: {snappedPoint}"); } }
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!