Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор BeginPublishingSheetEventArgs.BeginPublishingSheetEventArgs
 Послать отзыв
 This is BeginPublishingSheetEventArgs, a member of class BeginPublishingSheetEventArgs.
 Синтаксис
C#
Visual Basic
public BeginPublishingSheetEventArgs();
Public Sub New()
 Ссылки
 BeginPublishingSheetEventArgs Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!