Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Делегат HostMgd.Windows.ToolPalette.DropPointHandler
 Послать отзыв
 This is type HostMgd::Windows::ToolPalette::DropPointHandler.
 Синтаксис
C#
Visual Basic
public delegate DropPointHandler();
Public Delegate Sub DropPointHandler()
 Ваши комментарии по поводу этого топика: Послать отзыв!