Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство BeginPublishingSheetEventArgs.UniqueId
 Послать отзыв
 This is UniqueId, a member of class BeginPublishingSheetEventArgs.
 Синтаксис
C#
Visual Basic
public System.String UniqueId;
Public Property UniqueId() As System.String
 Ссылки
 BeginPublishingSheetEventArgs Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!