Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Класс HostMgd.Windows.Pane
 Послать отзыв
 This is class HostMgd::Windows::Pane.
 Иерархия классов
HostMgd::Windows::StatusBarItem HostMgd::Windows::Pane
 Синтаксис
C#
Visual Basic
public class Pane : StatusBarItem;
Public Class Pane Inherits StatusBarItem
 Методы
 Конструкторы
 Класс HostMgd.Windows.Pane
 Имя
 Описание
 Pane
 This is Pane, a member of class Pane.
 Топики
 Имя
 Описание
 StatusBarItem Методы
 Ниже перечислены методы класса StatusBarItem.
 StatusBarItem Свойства
 Ниже перечислены свойства класса StatusBarItem.
 StatusBarItem События
 Ниже перечислены события класса StatusBarItem.
 Класс HostMgd.Windows.Pane
 Имя
 Описание
 Pane Свойства
 Ниже перечислены свойства класса Pane.
 Ссылки
 Pane Свойства, Методы, Топики, StatusBarItem Методы, StatusBarItem Свойства, StatusBarItem События
 Ваши комментарии по поводу этого топика: Послать отзыв!