Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.SelectFence(Point3dCollection,SelectionFilter)
 Послать отзыв
 Метод возвращает набор объектов, пересекаемых ломаной линией выбора, заданной точками, и соответствующих указанному фильтру.
 Синтаксис
C#
Visual Basic
Копировать Код
public PromptSelectionResult SelectFence(Point3dCollection fence, SelectionFilter filter);
Копировать Код
Public Function SelectFence(fence As Point3dCollection, filter As SelectionFilter) As PromptSelectionResult
 Параметры
 Параметры
 Описание
 fence
 Коллекция трёхмерных точек (Point3d), представляющих вершины линии выбора. Линия строится как ломаная, соединяющая эти точки. Тип Point3dCollection.
 filter
 Фильтр, задающий условия для выбираемых объектов. Может включать проверки по типу объекта, слою, цвету и другим свойствам. Если фильтр равен null, учитываются все объекты, пересекающие линию выбора. Тип SelectionFilter.
 Возвращает
 Возвращает объект типа PromptSelectionResult, содержащий:
Status — статус выполнения (OK, Cancel, Error и др.). При успешной выборке статус равен PromptStatus.OK.
Value — объект типа SelectionSet, содержащий список идентификаторов (ObjectId) выбранных объектов, удовлетворяющих условиям линии выбора и фильтра.
StringResult — строковое значение.
 Если ни один объект не удовлетворяет условиям выборки, Value может быть null.
 Описание
 Метод используется для выборки геометрических объектов чертежа, которые пересекаются с линией выбора — последовательностью отрезков, построенных по заданным вершинам. При этом дополнительно применяется фильтр, позволяющий ограничить выборку только теми объектами, которые удовлетворяют определённым критериям (например, типу объекта, слою или цвету). Метод удобен при выделении объектов вдоль произвольной траектории с учетом их свойств.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("SelectFenceExample_Point3dCollection_SelectionFilter")] public void SelectFenceExample_Point3dCollection_SelectionFilter() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Задание линии выбора Point3dCollection fencePoints = new Point3dCollection(); fencePoints.Add(new Point3d(0, 0, 0)); fencePoints.Add(new Point3d(100, 100, 0)); fencePoints.Add(new Point3d(200, 0, 0)); // Фильтр: выбрать только объекты типа Line SelectionFilter filter = new SelectionFilter(new TypedValue[] { new TypedValue((int)DxfCode.Start, "LINE") }); // Вызываем метод PromptSelectionResult result = editor.SelectFence(fencePoints, filter); // Выводим сообщение в командную строку if (result.Status == PromptStatus.OK) { SelectionSet selSet = result.Value; editor.WriteMessage( $"\nВыбрано линий: {selSet.Count}"); } else { editor.WriteMessage( "\nНе найдено объектов, удовлетворяющих условиям."); } } }
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!