Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод IConfigurationSection.WriteProperty
 Послать отзыв
 Синтаксис
C#
Visual Basic
void WriteProperty(ref String name, ref System.Object value);
Sub WriteProperty(ByRef name As String, ByRef value As System.Object)
 Параметры
 Параметры
 Описание
 name
 Имя свойства
 value
 Присваиваемое значение
 Описание
 Метод присваивает значение value свойству с именем name.
 Ссылки
 IConfigurationSection Интерфейс, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!