Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.InplaceTextEditor.Cut
 Послать отзыв
 Метод вырезает текущий выделенный текст и сохраняет его в буфере обмена. В текущей версии не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Cut();
Копировать Код
Public Sub Cut()
 Описание
 Метод вырезает текущий выделенный текст и сохраняет его в буфере обмена. В текущей версии метод не реализован.
 Замечания
 Следует иметь ввиду, что текущее выделение удаляется, и после завершения метода это выделение как объект более не существует.
 Ссылки
 HostMgd.ApplicationServices.InplaceTextEditor, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!