Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Перечисление HostMgd.Runtime.CommandFlags
 Послать отзыв
 This is record HostMgd::Runtime::CommandFlags.
 Синтаксис
C#
Visual Basic
public enum CommandFlags : int { ActionMacro = 0x8000000, Defun = 0x800, DocExclusiveLock = 0x100000, DocReadLock = 0x80000, InProgress = 0x400, Interruptible = 0x400000, Modal = 0, NoActionRecording = 0x4000000, NoBlockEditor = 0x2000000, NoHistory = 0x800000, NoInferConstraint = 0x40000000, NoInternalLock = 0x20000, NoMultiple = 0x10, NoNewStack = 0x10000, NoOem = 0x100, NoPaperSpace = 0x40, NoPerspective = 8, NoTileMode = 0x20, NoUndoMarker = 0x1000000, Redraw = 4, Session = 0x200000, TempShowDynDimension = -(int)2147483648, Transparent = 1, Undefined = 0x200, UsePickSet = 2 }
Public Enum CommandFlags Inherits int ActionMacro = &H8000000 Defun = &H800 DocExclusiveLock = &H100000 DocReadLock = &H80000 InProgress = &H400 Interruptible = &H400000 Modal = 0 NoActionRecording = &H4000000 NoBlockEditor = &H2000000 NoHistory = &H800000 NoInferConstraint = &H40000000 NoInternalLock = &H20000 NoMultiple = &H10 NoNewStack = &H10000 NoOem = &H100 NoPaperSpace = &H40 NoPerspective = 8 NoTileMode = &H20 NoUndoMarker = &H1000000 Redraw = 4 Session = &H200000 TempShowDynDimension = -(int)2147483648 Transparent = 1 Undefined = &H200 UsePickSet = 2 End Enum
 Ваши комментарии по поводу этого топика: Послать отзыв!