Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Publisher.ShowDwfOptionsDialog
 Послать отзыв
 This is ShowDwfOptionsDialog, a member of class Publisher.
 Синтаксис
C#
Visual Basic
public HostMgd::Publishing::OptionsDialogResult ShowDwfOptionsDialog(ref HostMgd::PlottingServices::DsdData dsdData, ref HostMgd::PlottingServices::PlotConfig plotConfig, ref System.String optionsDialogTitle);
Public Function ShowDwfOptionsDialog(ByRef dsdData As HostMgd.PlottingServices.DsdData, ByRef plotConfig As HostMgd.PlottingServices.PlotConfig, ByRef optionsDialogTitle As System.String) As HostMgd.Publishing.OptionsDialogResult
 Ссылки
 Publisher Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!