Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство ToolAttribute.ToolImage
 Послать отзыв
 This is ToolImage, a member of class ToolAttribute.
 Синтаксис
C#
Visual Basic
public System.String ToolImage;
Public Property ToolImage() As System.String
 Ссылки
 ToolAttribute Класс, HostMgd.Windows.ToolPalette
 Ваши комментарии по поводу этого топика: Послать отзыв!