Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.Document.UpgradeDocOpen()
 Послать отзыв
 Метод предназначен для повышения статуса открытого документа с "для чтения" до "для записи".
 Синтаксис
C#
Visual Basic
public void UpgradeDocOpen();
Public Sub UpgradeDocOpen()
 Описание
 Метод преобразует статус открытого dwg-документа из "только чтение" в "доступно для записи", если это возможно.
 Ссылки
 HostMgd.ApplicationServices.Document, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!