Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptStringOptions.UseDefaultValue
 Послать отзыв
 Свойство определяет, будет ли использоваться значение по умолчанию при вводе строки, если пользователь нажмёт Enter без ввода текста.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool UseDefaultValue { get; set; }
Копировать Код
Public Property UseDefaultValue As Boolean
 Возвращает
 Возвращает значение типа bool:
true — значение по умолчанию (DefaultValue) будет использовано при пустом вводе.
false — значение по умолчанию игнорируется, даже если оно задано.
 Описание
 Свойство указывает, должно ли значение, заданное в свойстве DefaultValue, применяться автоматически, когда пользователь завершает ввод нажатием Enter без ввода собственной строки.
 Если UseDefaultValue = true, и DefaultValue задано, оно будет возвращено как результат ввода. Если UseDefaultValue = false, значение по умолчанию игнорируется, даже если оно задано. Для корректной работы необходимо также установить AllowNone = true, чтобы разрешить завершение ввода без текста.
 Условия
 Чтение и запись
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("PromptStringOptionsExample_UseDefaultValue")] public void PromptStringOptionsExample_UseDefaultValue() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Определяем настройки запроса пользователю PromptStringOptions options = new PromptStringOptions("Введите имя"); // Значение по умолчанию options.DefaultValue = "Untitled"; // Использовать значение по умолчанию options.UseDefaultValue = true; // Разрешить ввод с пробелами options.AllowSpaces = true; // Создаём запрос пользователю PromptResult pr = editor.GetString(options); // Если все данные введены, выводим результат в командную строку if (pr.Status == PromptStatus.OK) { editor.WriteMessage( $"\nВы ввели: {pr.StringResult}"); } else { editor.WriteMessage( "\nВвод отменён."); } } }
 Ссылки
 HostMgd.EditorInput.PromptStringOptions, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!