Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptEntityResult.ToString(IFormatProvider)
 Послать отзыв
 Метод возвращает строковое представление результата выбора объекта, отформатированное с учётом текущей локализации.
 Синтаксис
C#
Visual Basic
Копировать Код
public override string ToString(IFormatProvider provider);
Копировать Код
Public Overrides Function ToString(provider As IFormatProvider) As String
 Параметры
 Параметры
 Описание
 provider
 Объект, предоставляющий информацию о правилах форматирования, например, CultureInfo.InvariantCulture или текущая культура пользователя (CultureInfo.CurrentCulture). Используется для форматирования чисел и других значений в зависимости от локализации. Тип IFormatProvider
 Возвращает
 Возвращает значение типа string, представляющее результат выбора объекта в виде строки. Строка содержит:
Статус операции (например, OK, Cancel).
Идентификатор выбранного объекта (ObjectId), если он был успешно выделен.
Координаты точки выбора (PickedPoint) в мировой системе координат (WCS), отформатированные с помощью переданного provider.
 Если объект не был выбран или операция была прервана, возвращается соответствующее текстовое сообщение.
 Описание
 Метод формирует строковое описание операции выбора геометрического объекта, применяя заданный провайдер форматирования. Это позволяет корректно отображать числовые значения (например, координаты точки) с учётом региональных настроек пользователя — таких как десятичный разделитель или формат дат. Метод может использоваться для вывода информации в командную строку, лог-файл или пользовательский интерфейс надстройки nanoCAD.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("PromptEntityResult_ToString_IFormatProvider")] public void PromptEntityResult_ToString_IFormatProvider() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Вызываем метод GetEntity() для запроса объекта PromptEntityResult result = editor.GetEntity("Выберите объект:"); // Если все данные введены, выводим результат в командную строку if (result.Status == PromptStatus.OK) { string formattedResult = result.ToString(CultureInfo.InvariantCulture); editor.WriteMessage($"\nРезультат выбора: {formattedResult}"); } else { editor.WriteMessage("\nНе удалось получить объект."); } } }
 Ссылки
 HostMgd.EditorInput.PromptEntityResult, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!