Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.PointToWorld(Point,int)
 Послать отзыв
 Метод преобразует точку из экранных координат в трёхмерную мировую координату с учётом указанного видового экрана.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d PointToWorld(System.Drawing.Point pt, int viewportNumber);
Копировать Код
Public Function PointToWorld(pt As System.Drawing.Point, viewportNumber As Integer) As Point3d
 Параметры
 Параметры
 Описание
 pt
 Точка в экранных координатах (в пикселях), заданная относительно клиентской области окна редактора. Тип System.Drawing.Point
 viewportNumber
 Номер видового экрана, используемого для преобразования точки из экранной в мировую систему координат. Тип int.
 Возвращает
 Возвращает объект типа Point3d, представляющий собой координаты точки в мировой системе координат (WCS), соответствующие указанному положению на экране и проекции текущего видового экрана.
 Описание
 Метод используется для перевода координат точки из клиентской области окна (в пикселях) в соответствующую точку в мировой системе координат (WCS), связанную с конкретным видовым экраном. Это позволяет определить, какая точка чертежа находится под указанным местом на экране — например, при обработке пользовательского ввода или построении графических элементов интерфейса.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("PointToWorldExample_Point_int")] public void PointToWorldExample_Point_int() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Определяем переменные для параметров метода PointToWorld System.Drawing.Point screenPoint = new System.Drawing.Point(300, 200); int viewport = 2; // Вызываем метод Point3d worldPoint = editor.PointToWorld(screenPoint, viewport); // Выводим результат в командную строку editor.WriteMessage( $"\nТочка в мировых координатах (экран {viewport}): {worldPoint}"); } }
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!