Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.Windows.ToolPalette.CustomToolBase.GetDragDropContextInfo
 Послать отзыв
 Метод вызывается во время перетаскивания правой кнопкой мыши (drag-and-drop) пользовательского инструмента из панели инструментов. Не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void GetDragDropContextInfo( ref System.Object pIUnknown, ref System.String toolName, UInt32 flag );
Копировать Код
Public Overridable Sub GetDragDropContextInfo( ByRef pIUnknown As System.Object, ByRef toolName As System.String, flag As UInt32 )
 Параметры
 Параметры
 Описание
 pIUnknown
 Входной объект, реализующий интерфейс IUnknown. Тип System.Object.
 toolName
 Выходное имя инструмента, отображаемое пользователю при перетаскивании. Тип System.String.
 flag
 Выходная комбинация флагов, уточняющих контекст операции перетаскивания. Тип UInt32.
 Описание
 Метод вызывается во время перетаскивания правой кнопкой мыши (drag-and-drop) пользовательского инструмента из панели инструментов. Ожидается, что метод предоставит контекстную информацию о перетаскиваемом инструменте, включая ссылку на COM-объект (IUnknown), представляющий данные перетаскивания, отображаемое имя инструмента и флаги, уточняющие контекст операции.
 В текущей версии не реализован.
 Ссылки
 HostMgd.Windows.ToolPalette.CustomToolBase, HostMgd.Windows.ToolPalette
 Ваши комментарии по поводу этого топика: Послать отзыв!