Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptIntegerOptions.DefaultValue
 Послать отзыв
 Свойство возвращает или устанавливает значение, которое будет использовано при нажатии Enter без ввода другого значения.
 Синтаксис
C#
Visual Basic
Копировать Код
public int DefaultValue { get; set; }
Копировать Код
Public Property DefaultValue As Integer
 Возвращает
 Возвращает значение типа int, представляющее собой число, используемое по умолчанию. Если значение не задано, возвращается 0.
 Описание
 Свойство используется в классе PromptIntegerOptions для задания целочисленного значения по умолчанию при интерактивном вводе — например, через метод GetInteger(). Если пользователь нажимает Enter , не вводя число, и при этом AllowNone = true, то применяется это значение. Это позволяет ускорить выполнение команд, предоставляя разумное значение по умолчанию, соответствующее типичному сценарию использования.
 Свойство доступно как для чтения, так и для записи, что даёт возможность динамически изменять его в зависимости от контекста — например, на основе предыдущих действий или настроек чертежа.
 Условия
 Чтение и запись
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("PromptIntegerOptionsExample_DefaultValue")] public void PromptIntegerOptionsExample_DefaultValue() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создаём запрос пользователю PromptIntegerOptions options = new PromptIntegerOptions("Введите количество копий:"); // Значение по умолчанию options.DefaultValue = 1; // Разрешить нажатие Enter options.AllowNone = true; options.LowerLimit = 1; options.UpperLimit = 99; // Вызываем метод GetInteger() для запроса пользователю PromptIntegerResult ipr = editor.GetInteger(options); // Если все данные введены, выводим результат в командную строку if (PromptStatus.OK == ipr.Status) { editor.WriteMessage("\nКоличество копий: " + ipr.Value); } else { editor.WriteMessage("\nОтмена или ошибка ввода."); } } }
 Ссылки
 HostMgd.EditorInput.PromptIntegerOptions, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!