Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство TrayItemCollection.IsReadOnly
 Послать отзыв
 This is IsReadOnly, a member of class TrayItemCollection.
 Синтаксис
C#
Visual Basic
public bool IsReadOnly;
Public Property IsReadOnly() As bool
 Ссылки
 TrayItemCollection Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!