Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Tool.GetActiveShapes
 Послать отзыв
 This is GetActiveShapes, a member of class Tool.
 Синтаксис
C#
Visual Basic
public array<HostMgd::Windows::ToolPalette::Tool^> GetActiveShapes();
Public Function GetActiveShapes() As array<HostMgd.Windows.ToolPalette.Tool^>
 Ссылки
 Tool Класс, HostMgd.Windows.ToolPalette
 Ваши комментарии по поводу этого топика: Послать отзыв!