Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Делегат HostMgd.Publishing.EndPublishEventHandler
 Послать отзыв
 This is type HostMgd::Publishing::EndPublishEventHandler.
 Синтаксис
C#
Visual Basic
public delegate EndPublishEventHandler();
Public Delegate Sub EndPublishEventHandler()
 Ваши комментарии по поводу этого топика: Послать отзыв!