Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.IsDragging
 Послать отзыв
 Свойство предназначено для проверки, находится ли редактор в состоянии обработки события перетаскивания мыши.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsDragging { get; }
Копировать Код
Public ReadOnly Property IsDragging() As bool
 Возвращает
 Возвращает значение типа bool:
true — если в очередь событий добавлено новое событие мыши, и текущее действие перетаскивания должно быть завершено как устаревшее.
false — если событие перетаскивания всё ещё актуально и его можно продолжить обрабатывать.
 Описание
 Свойство используется для определения, было ли вызвано новое событие мыши (например, движение или клик) во время выполнения текущего действия — например, при отрисовке или длительных вычислениях. Оно позволяет приложениям nanoCAD быстро реагировать на пользовательский ввод и прерывать выполнение ненужных операций, если событие перетаскивания уже устарело. Это особенно полезно при интерактивном перемещении объектов, чтобы избежать лишних вычислений для устаревших координат.
 Условия
 Только чтение
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("IsDraggingExample")] public void IsDraggingExample() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Проверяем, выполняется ли в данный момент операция перетаскивания (jig) if (editor.IsDragging) { editor.WriteMessage("\nОперация перетаскивания активна — обработка приостановлена."); return; } // Для демонстрации используем точку (10, 10) System.Drawing.Point samplePoint = new System.Drawing.Point(10, 10); Point3d worldPoint = editor.PointToWorld(samplePoint,editor.GetViewportNumber(samplePoint)); editor.WriteMessage($"\nТекущая точка: {worldPoint}"); } }
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!