Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод MenuItemCollection.RemoveAt
 Послать отзыв
 This is RemoveAt, a member of class MenuItemCollection.
 Синтаксис
C#
Visual Basic
public void RemoveAt(int index);
Public Sub RemoveAt(index As Integer)
 Ссылки
 MenuItemCollection Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!