Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.DsdData.PromptForDwfName
 Послать отзыв
 Свойство PromptForDwfName позволяет определить, включен ли запрос имени файла DWF. Не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool PromptForDwfName;
Копировать Код
Public Property PromptForDwfName As Boolean
 Возвращает
 Возвращает true, если запрос имени файла DWF включен. В противном случае возвращает false.
 Описание
 Свойство PromptForDwfName позволяет определить, включен ли запрос имени файла DWF.
 В текущей версии не реализовано.
 Условия
 Чтение и запись.
 Ссылки
 HostMgd.PlottingServices.DsdData, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!