Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.Application.ReloadAllMenus()
 Послать отзыв
 МЕТОД НЕ РЕАЛИЗОВАН. Метод обновляет загруженные в данный момент меню.
 Синтаксис
C#
Visual Basic
Копировать Код
public static void ReloadAllMenus();
Копировать Код
Public Shared Sub ReloadAllMenus()
 Описание
 Метод обновляет пользовательский интерфейс nanoCAD, чтобы отразить изменения в загруженных в данный момент пользоватльских меню. Метод следует использовать, когда меню было отредактировано программным способом и эти изменения необходимо отобразить в пользовательском интерфейсе. Функциональность метода аналогична редактированию меню через диалоговое окно CUI и сохранению измненений нажатием кнопки "ОК" или "Применить". Текущее рабочее пространство при этом не изменяется. Если свойства текущего рабочего пространства были отредактированы в главном меню, то после вызова ReloadAllMenus(), возможно, потребуется вызвать SetCurrentWorkspace(), чтобы увидеть изменения в рабочей области.
 Ссылки
 HostMgd.ApplicationServices.Application, HostMgd.ApplicationServices Пространство имен
 Исключения
 MGD NOT_IMPLEMENTED
 Ваши комментарии по поводу этого топика: Послать отзыв!