Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.Application.DocumentWindowCollection
 Послать отзыв
 Свойство предназначено для доступа к коллекции окон-документов, открытых в приложении nanoCAD.
 Синтаксис
C#
Visual Basic
Копировать Код
public static DocumentWindowCollection DocumentWindowCollection
Копировать Код
Public Shared ReadOnly Property DocumentWindowCollection As DocumentWindowCollection
 Возвращает
 Возвращает коллекцию документов типа DocumentWindowCollection, в которой расположены окна-документы типа DocumentWindow. Количество окон-документов равно количеству чертежей, открытых в приложении nanoCAD.
 Описание
 Свойство предоставляет доступ к коллекции окон-документов DocumentWindowCollection, открытых в приложении nanoCAD. Одно окно-документ - это один открытый и редактируемый чертеж.
 Условия
 Только чтение.
 Ссылки
 HostMgd.ApplicationServices.Application, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!