Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство JigPromptGeometryOptions.BasePoint
 Послать отзыв
 Базовая точка для операции Jig.
 Синтаксис
C#
Visual Basic
public Teigha.Geometry.Point3d BasePoint;
Public Property BasePoint() As Teigha.Geometry.Point3d
 Возвращает
 Возвращает выбранную базовую точку.
 Описание
 Свойство предназначено для определения базовой точки для операции Jig с геометрическим объектом.
 Условия
 Чтение и запись.
 Ссылки
 JigPromptGeometryOptions Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!