Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Класс HostMgd.Publishing.PublishEntityEventArgs
 Послать отзыв
 This is class HostMgd::Publishing::PublishEntityEventArgs.
 Иерархия классов
HostMgd::Publishing::PublishEntityEventArgs
 Синтаксис
C#
Visual Basic
public class PublishEntityEventArgs : System.EventArgs;
Public Class PublishEntityEventArgs Inherits System.EventArgs
 Методы
 Конструкторы
 Имя
 Описание
 PublishEntityEventArgs
 This is PublishEntityEventArgs, a member of class PublishEntityEventArgs.
 Топики
 Имя
 Описание
 PublishEntityEventArgs Методы
 Ниже перечислены методы класса PublishEntityEventArgs.
 PublishEntityEventArgs Свойства
 Ниже перечислены свойства класса PublishEntityEventArgs.
 Ссылки
 PublishEntityEventArgs Методы, PublishEntityEventArgs Свойства, Методы, Топики, PublishEntityEventArgs Методы, PublishEntityEventArgs Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!