Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.DocumentWindowCollection.TileHorizontally
 Послать отзыв
 Метод позволяет разместить дочерние окна MDI горизонтально. В текущей версии не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public void TileHorizontally();
Копировать Код
Public Sub TileHorizontally()
 Описание
 Метод позволяет разместить дочерние окна MDI данной коллекции горизонтально. В текущей версии не реализован.
 Ссылки
 HostMgd.ApplicationServices.DocumentWindowCollection, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!