Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.Document.CommandWillStart
 Послать отзыв
 Событие, возникающее перед началом выполнения комманды cmdStr.
 Синтаксис
C#
Visual Basic
public event CommandEventHandler CommandWillStart;
Public Event CommandWillStart As CommandEventHandler
 Возвращает
 Возвращает тип данных CommandEventHandler
 Описание
 Событие, возникающее перед началом выполнения комманды cmdStr. Соответствует функции NRX API HostEditorReactor.commandWillStart().
 Ссылки
 HostMgd.ApplicationServices.Document, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!