Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.PreTranslateMessageEventHandler(Object, PreTranslateMessageEventArgs)
 Послать отзыв
 Делегат предназначен для обработки события Application.PreTranslateMessage, возникающего непосредственно перед переводом сообщения.
 Синтаксис
C#
Visual Basic
Копировать Код
public delegate void PreTranslateMessageEventHandler( Object sender, PreTranslateMessageEventArgs e );
Копировать Код
Public Delegate Sub PreTranslateMessageEventHandler( sender As Object, e As PreTranslateMessageEventArgs )
 Параметры
 Параметры
 Описание
 sender
 Объект, инициировавший событие. Тип Object.
 e
 Аргументы события. Тип PreTranslateMessageEventArgs.
 Описание
 Делегат PreTranslateMessageEventHandler предназначен для обработки события PreTranslateMessage класса Application, которое возникает непосредственно перед переводом сообщения.
 Контекст события передается через параметры sender и e, где e содержит собственно объект сообщения в формате структуры MSG и флаг состояния события (обработано или нет).
 Ваши комментарии по поводу этого топика: Послать отзыв!