Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Pane.MinimumWidth
 Послать отзыв
 This is MinimumWidth, a member of class Pane.
 Синтаксис
C#
Visual Basic
public int MinimumWidth;
Public Property MinimumWidth() As Integer
 Ссылки
 Pane Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!