Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.SheetType
 Послать отзыв
 Данное перечисление определяет тип выводимого на печать листа (пакетная многолистовая печать или индивидуальная печать единственного листа, включая варианты вывода в DWF и PDF файлы).
 Синтаксис
C#
Visual Basic
Копировать Код
public enum SheetType { SingleDwf = 0, MultiDwf = 1, OriginalDevice = 2, SingleDwfx = 3, MultiDwfx = 4, SinglePdf = 5, MultiPdf = 6 }
Копировать Код
Public Enum SheetType SingleDwf = 0 MultiDwf = 1 OriginalDevice = 2 SingleDwfx = 3 MultiDwfx = 4 SinglePdf = 5 MultiPdf = 6 End Enum
 Члены
 Члены
 Описание
 MultiDwf
 Значение: 1. Вывод всех листов в один многолистовой DWF-файл.
 MultiDwfx
 Значение: 4. Вывод всех листов в один многолистовой DWFx-файл.
 MultiPdf
 Значение: 6. Вывод всех листов в один многолистовой PDF-файл.
 OriginalDevice
 Значение: 2. Для печати всех листов используется устройство вывода, сконфигурированное в параметрах листа.
 SingleDwf
 Значение: 0. Вывод каждого листа в отдельный DWF-файл.
 SingleDwfx
 Значение: 3. Вывод каждого листа в отдельный DWFx-файл.
 SinglePdf
 Значение: 5. Вывод каждого листа в отдельный PDF-файл.
 Описание
 Перечисление SheetType представляет тип выводимого на печать листа (пакетная многолистовая печать или индивидуальная печать единственного листа, включая варианты вывода в DWF и PDF файлы).
 Ваши комментарии по поводу этого топика: Послать отзыв!