Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.DocumentWindowCollection.GetEnumerator
 Послать отзыв
 Метод предоставляет перечислитель данной коллекции.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual System.Collections.IEnumerator GetEnumerator();
Копировать Код
Public Overridable Function GetEnumerator() As System.Collections.IEnumerator
 Возвращает
 Возвращает перечислитель коллекции окон документов. Тип System.Collections.IEnumerator.
 Описание
 Метод предоставляет перечислитель коллекции окон открытых документов.
 Ссылки
 HostMgd.ApplicationServices.DocumentWindowCollection, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!