Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство DocumentLockModeChangedEventArgs.MyPreviousMode
 Послать отзыв
 Синтаксис
C#
Visual Basic
public HostMgd::ApplicationServices::DocumentLockMode MyPreviousMode;
Public Property MyPreviousMode() As HostMgd.ApplicationServices.DocumentLockMode
 Описание
 Возвращает предыдущую блокировку документа, выполненую данным слоем.
 Условия
 Только на чтение
 Ссылки
 DocumentLockModeChangedEventArgs Класс, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!