Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.LongTransactionManager.AddClassFilter
 Послать отзыв
 Метод добавляет указанный класс в фильтр классов, которым разрешается участие в длительной транзакции. В текущей версии не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public void AddClassFilter( ref Teigha.Runtime.RXClass filter );
Копировать Код
Public Sub AddClassFilter( ByRef filter As Teigha.Runtime.RXClass )
 Параметры
 Параметры
 Описание
 filter
 Входной указатель на объект RXClass добавляемого класса. Тип Teigha.Runtime.RXClass.
 Описание
 Метод AddClassFilter() добавляет класс, ассоциированный с указанным объектом filter, в фильтр классов, которым разрешается участие в длительной транзакции.
 В текущей версии не реализован.
 Замечания
 Аргумент filter не может быть указателем на объект RxClass, представляющий классы DbObject или Entity.
 Ссылки
 HostMgd.ApplicationServices.LongTransactionManager, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!