Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Класс HostMgd.Windows.ContextMenuExtension
 Послать отзыв
 Иерархия классов
HostMgd::Windows::Menu HostMgd::Windows::ContextMenuExtension
 Синтаксис
C#
Visual Basic
public class ContextMenuExtension : HostMgd::Windows::Menu;
Public Class ContextMenuExtension Inherits HostMgd.Windows.Menu
 Методы
 Конструкторы
 Класс HostMgd.Windows.ContextMenuExtension
 Имя
 Описание
 ContextMenuExtension
 This is ContextMenuExtension, a member of class ContextMenuExtension.
 Топики
 Имя
 Описание
 Menu Свойства
 Ниже перечислены свойства класса Menu.
 Класс HostMgd.Windows.ContextMenuExtension
 Имя
 Описание
 ContextMenuExtension Свойства
 Ниже перечислены свойства класса ContextMenuExtension.
 ContextMenuExtension События
 Ниже перечислены события класса ContextMenuExtension.
 Ссылки
 ContextMenuExtension Свойства, ContextMenuExtension События, Методы, Топики, Menu Свойства, ContextMenuExtension События
 Ваши комментарии по поводу этого топика: Послать отзыв!