Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.DsdData.DestinationName
 Послать отзыв
 Свойство DestinationName определяет путь к выходному DWF-файлу. Это поле сохраняется в DSD-файле. Не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public System.String DestinationName;
Копировать Код
Public Property DestinationName As System.String
 Возвращает
 Возвращает путь к выходному DWF-файлу. Тип System.String.
 Описание
 Свойство DestinationName определяет путь к выходному DWF-файлу, который используется при публикации в файл DWF. Это поле сохраняется в DSD-файле.
 В текущей версии не реализовано.
 Условия
 Чтение и запись.
 Ссылки
 HostMgd.PlottingServices.DsdData, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!