Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.EndPageEventArgs.EndPageEventArgs
 Послать отзыв
 Конструктор класса EndPageEventArgs. Создает экземпляр класса с указанным значением флага HostMgd.PlottingServices.SheetCancelStatus.
 Синтаксис
C#
Visual Basic
Копировать Код
public EndPageEventArgs( HostMgd.PlottingServices.SheetCancelStatus status );
Копировать Код
Public Sub New( status As HostMgd.PlottingServices.SheetCancelStatus )
 Параметры
 Параметры
 Описание
 status
 Входное значение из перечисления HostMgd.PlottingServices.SheetCancelStatus.
 Описание
 Конструктор класса EndPageEventArgs. Создает экземпляр класса с указанным значением флага HostMgd.PlottingServices.SheetCancelStatus.
 Ссылки
 HostMgd.PlottingServices.EndPageEventArgs, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!