Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.Windows.ToolPalette.CustomToolBase.MultipleEdit
 Послать отзыв
 Метод предназначен для группового редактирования пользовательских инструментов. Не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void MultipleEdit( ref System.Object tools, ref System.Object stockToolIds, int parentWindow, bool success );
Копировать Код
Public Overridable Sub MultipleEdit( ByRef tools As System.Object, ByRef stockToolIds As System.Object, parentWindow As Integer, success As Boolean )
 Параметры
 Параметры
 Описание
 tools
 Входной массив инструментов. Тип System.Object.
 stockToolIds
 Входной массив идентификаторов стандартных инструментов. Тип System.Object.
 parentWindow
 Дескриптор родительского окна. Тип int.
 success
 Флаг завершения. Тип bool. Возвращает true в случае успешного завершения метода, в противном случае возвращает false.
 Описание
 Метод предназначен для группового редактирования пользовательских инструментов. В текущей версии не реализован.
 Ссылки
 HostMgd.Windows.ToolPalette.CustomToolBase, HostMgd.Windows.ToolPalette
 Ваши комментарии по поводу этого топика: Послать отзыв!