Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.SetImpliedSelection(SelectionSet)
 Послать отзыв
 Метод устанавливает набор объектов как текущее неявное выделение, доступное для следующей команды.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetImpliedSelection(SelectionSet selectionSet);
Копировать Код
Public Sub SetImpliedSelection(selectionSet As SelectionSet)
 Параметры
 Параметры
 Описание
 selectionSet
 Набор объектов (ObjectId), который будет установлен как текущее неявное выделение. Тип SelectionSet
 Описание
 Метод используется для программной установки набора объектов в качестве неявного выделения (implied selection), которое становится доступным для следующей выполняемой команды. Это позволяет имитировать ситуацию, когда пользователь уже выделил объекты до запуска команды — аналогично функции "previous selection" в некоторых командах nanoCAD. Метод полезен при автоматизации и последовательном выполнении команд без повторного выбора объектов.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("SetImpliedSelectionExample_SelectionSet")] public void SetImpliedSelectionExample() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Получаем доступ к базе данных и менеджеру транзакций документа Database db = doc.Database; Teigha.DatabaseServices.TransactionManager tm = db.TransactionManager; // Создаём массив идентификаторов ObjectId[] objIdArray = new ObjectId[2]; // Сохраняем идентификатор активного пространства в переменную ObjectId currentSpaceId = db.CurrentSpaceId; // Начинаем транзакцию с базой данных документа using (Transaction tr = tm.StartTransaction()) { // Открываем активное пространство, чтобы получить идентификаторы объектов чертежа BlockTableRecord btr = tr.GetObject(currentSpaceId, OpenMode.ForRead) as BlockTableRecord; // Добавляем в созданный ранее массив идентификаторов первые два объекта  if (btr != null) { int i = 0; do { objIdArray[i] = btr.GetEnumerator().Current; btr.GetEnumerator().MoveNext(); i++; } while (i < 2); } // Заверение транзакции tr.Abort(); } // Создание набора объектов SelectionSet selSet = SelectionSet.FromObjectIds(objIdArray); // Установка этого набора как неявного выделения editor.SetImpliedSelection(selSet); // Вывод сообщения в командную строку editor.WriteMessage("\nНеявное выделение установлено."); } }
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!