Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.LongTransactionEventHandler(Object, LongTransactionEventArgs)
 Послать отзыв
 Делегат предназначен для обработки событий, возникающих в процессе длительных транзакций.
 Синтаксис
C#
Visual Basic
Копировать Код
public delegate void LongTransactionEventHandler( Object sender, LongTransactionEventArgs e );
Копировать Код
Public Delegate Sub LongTransactionEventHandler( sender As Object, e As LongTransactionEventArgs )
 Параметры
 Параметры
 Описание
 sender
 Объект, инициировавший событие. Тип Object.
 e
 Аргументы события. Тип LongTransactionEventArgs.
 Описание
 Делегат LongTransactionEventHandler используется как тип обработчика таких событий как CheckedIn, CheckedOut, Aborted и др. в менеджере длительных транзакций LongTransactionManager.
 Типичным применением этого делегата являются плагины, где реализуется редактирование внешних ссылок и блоков.
 Ваши комментарии по поводу этого топика: Послать отзыв!