Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Publisher.ShowPublishDialog
 Послать отзыв
 This is ShowPublishDialog, a member of class Publisher.
 Синтаксис
C#
Visual Basic
public void ShowPublishDialog(ref HostMgd::PlottingServices::DsdData dsdData, ref HostMgd::PlottingServices::PlotConfig plotConfig, ref StringCollection namePageSetups, ref StringCollection namePageSetupPaths, ref System.String optionsDialogTitle, ref System.String optionsButtonText);
Public Sub ShowPublishDialog(ByRef dsdData As HostMgd.PlottingServices.DsdData, ByRef plotConfig As HostMgd.PlottingServices.PlotConfig, ByRef namePageSetups As StringCollection, ByRef namePageSetupPaths As StringCollection, ByRef optionsDialogTitle As System.String, ByRef optionsButtonText As System.String)
 Ссылки
 Publisher Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!