Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод ICondition.Evaluate
 Послать отзыв
 This is Evaluate, a member of class ICondition.
 Синтаксис
C#
Visual Basic
bool Evaluate();
Function Evaluate() As bool
 Ссылки
 ICondition Интерфейс, HostMgd.Runtime Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!