Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptNestedEntityResult.ToString(IFormatProvider)
 Послать отзыв
 Метод возвращает строковое представление результата выбора вложенного объекта, отформатированное с учётом заданного провайдера локализации.
 Синтаксис
C#
Visual Basic
Копировать Код
public override string ToString(IFormatProvider provider);
Копировать Код
Public Overrides Function ToString(provider As IFormatProvider) As String
 Параметры
 Параметры
 Описание
 provider
 Объект, предоставляющий информацию о правилах форматирования данных, таких как разделители десятичной точки или запятой. Может быть:
 Возвращает
 Возвращает значение типа string, представляющее результат операции выбора в виде строки:
При успешном завершении (Status == PromptStatus.OK)
 — содержит ObjectId и отформатированные координаты точки выбора.
При отмене или ошибке — текстовое сообщение, соответствующее статусу,
 например "Operation cancelled". Примеры:
Успешный результат: "Object ID: 12345, Point: (100.50, 200.25, 0.00)" (с InvariantCulture)
Отмена: "Operation cancelled"
 Описание
 Метод предоставляет строковое описание операции выбора вложенного геометрического объекта — например, идентификатор (ObjectId) выбранного элемента, точку выбора (PickedPoint) и статус операции. Форматирование значения точки или чисел производится с учетом переданного через параметр provider формата, что позволяет корректно отображать координаты и другие данные в соответствии с региональными настройками пользователя.
 Этот метод полезен при разработке мультиязычных надстроек nanoCAD, где важно сохранить единое представление чисел и дат для разных культур.
 Ссылки
 HostMgd.EditorInput.PromptNestedEntityResult, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!