Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PrintForm.PlotProgressPos
 Послать отзыв
 This is PlotProgressPos, a member of class PrintForm.
 Синтаксис
C#
Visual Basic
public int PlotProgressPos;
Public Property PlotProgressPos() As Integer
 Ссылки
 PrintForm Класс, Пространство имен HostMgd
 Ваши комментарии по поводу этого топика: Послать отзыв!