Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.LongTransactionManager
 Послать отзыв
 Класс LongTransactionManager представляет менеджер для создания и управления длительными транзакциями. В текущей версии не реализован.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject HostMgd::ApplicationServices::LongTransactionManager
 Синтаксис
C#
Visual Basic
Копировать Код
public class LongTransactionManager : Teigha::Runtime::RXObject;
Копировать Код
Public Class LongTransactionManager Inherits Teigha.Runtime.RXObject
 Описание
 Класс LongTransactionManager представляет менеджер для создания и управления длительными транзакциями.
 В текущей версии не реализован.
 Замечания
 Типичным примером операций, выполняемых в рамках длительных транзакций, является редактирование внешних ссылок и блоков.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 HostMgd.ApplicationServices.LongTransactionManager
 Имя
 Описание
 LongTransactionManager Методы
 Ниже перечислены методы класса LongTransactionManager.
 LongTransactionManager События
 Ниже перечислены события класса LongTransactionManager.
 Ссылки
 LongTransactionManager Методы, LongTransactionManager События, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства, LongTransactionManager События
 Ваши комментарии по поводу этого топика: Послать отзыв!