Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор PromptDragOptions.PromptDragOptions (SelectionSet^, String^, String^, HostMgd::EditorInput::DragCallback^)
 Послать отзыв
 Синтаксис
C#
Visual Basic
public PromptDragOptions(ref SelectionSet selection, ref String messageAndKeywords, ref String globalKeywords, ref HostMgd::EditorInput::DragCallback callback);
Public Sub New(ByRef selection As SelectionSet, ByRef messageAndKeywords As String, ByRef globalKeywords As String, ByRef callback As HostMgd.EditorInput.DragCallback)
 Параметры
 Параметры
 Описание
 selection
 Выбранное множество
 messageAndKeywords
 Приглашающее сообщение с ключевыми словами
 globalKeywords
 Список ключевых слов (их глобальные имена)
 callback
 Событие перетаскивания
 Описание
 Конструктор.
 Ссылки
 PromptDragOptions Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!