Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод TrayItemCollection.RemoveAt
 Послать отзыв
 This is RemoveAt, a member of class TrayItemCollection.
 Синтаксис
C#
Visual Basic
public void RemoveAt(int index);
Public Sub RemoveAt(index As Integer)
 Ссылки
 TrayItemCollection Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!