Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 JigPromptStringOptions.JigPromptStringOptions(String)
 Послать отзыв
 Конструктор класса с одним параметром.
 Синтаксис
C#
Visual Basic
public JigPromptStringOptions(ref System.String message);
Public Sub New(ByRef message As System.String)
 Параметры
 Параметры
 Описание
 message
 Текстовое сообщение, приглашающее ввести текст во время операции Jig.
 Описание
 Конструктор класса. Присваивает свойству Message значение параметра message Также конструктор устанавливает значение свойства Cursor равное CursorType.Crosshair (перекрестие).
 Пример
C#
 Копировать Код
 JigPromptStringOptions stringOptions = new JigPromptStringOptions("Текст:");
Visual Basic
 Копировать Код
 Dim stringOptions As JigPromptStringOptions = New JigPromptStringOptions("Текст:")
 Ссылки
 JigPromptStringOptions Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!