Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.SelectionTextInputEventHandler(Object, SelectionTextInputEventArgs)
 Послать отзыв
 Делегат используется для обработки пользовательских событий, возникающих в процессе ввода ключевых слов в редакторе nanoCAD.
 Синтаксис
C#
Visual Basic
Копировать Код
public delegate void SelectionTextInputEventHandler( Object sender, SelectionTextInputEventArgs e );
Копировать Код
Public Delegate Sub SelectionTextInputEventHandler( sender As Object, e As SelectionTextInputEventArgs )
 Параметры
 Параметры
 Описание
 sender
 Объект, инициировавший событие. Тип Object.
 e
 Аргументы события. Тип SelectionTextInputEventArgs.
 Описание
 Делегат SelectionTextInputEventHandler используется для обработки пользовательских событий, связанных с вводом ключевых слов в редакторе nanoCAD. Параметры события передаются через аргументы sender и e, где sender представляет объект-инициатор события, а аргумент e определяет контекст события в виде экземпляра класса HostMgd.EditorInput.SelectionTextInputEventArgs. Этот контекст обеспечивает доступ к введенному пользователем тексту, сообщениям об ошибках.
 Ваши комментарии по поводу этого топика: Послать отзыв!