Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.InplaceTextEditorSettings.InplaceTextEditorSettings
 Послать отзыв
 Конструктор по умолчанию класса InplaceTextEditorSettings. В текущей версии не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public InplaceTextEditorSettings();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса InplaceTextEditorSettings. Создаёт экземпляр InplaceTextEditorSettings с настройками по умолчанию для типичного объекта MTEXT.
 В текущей версии не реализован.
 Ссылки
 HostMgd.ApplicationServices.InplaceTextEditorSettings, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!