Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptIntegerResultEventArgs.Result
 Послать отзыв
 Свойство предоставляет доступ к результату операции ввода целого числа, включая статус и значение, введённое пользователем.
 Синтаксис
C#
Visual Basic
Копировать Код
public PromptIntegerResult Result { get; }
Копировать Код
Public ReadOnly Property Result As PromptIntegerResult
 Возвращает
 Возвращает экземпляр класса PromptIntegerResult, содержащий:
Value — значение типа int, если ввод был успешным.
Status — статус завершения операции (например, PromptStatus.OK, если пользователь ввёл корректное число, или PromptStatus.Cancel, если операция была прервана).
StringResult — строковое значение, если пользователь ввёл текст вместо числа или использовал клавишу Esc.
 Если операция не завершена успешно, результат может содержать null или нулевое значение.
 Описание
 Свойство возвращает объект типа PromptIntegerResult, который содержит данные о завершении интерактивного ввода целого числа — например, после вызова метода GetInteger() или при обработке события PromptedForInteger. Оно позволяет получить:
Value — введённое пользователем целое число.
Status — статус выполнения (OK, Cancel, Error и др.).
InputString — строковое представление введённого значения или команды.
 Это свойство используется для анализа результата ввода, проверки допустимости числа и выполнения дальнейших действий на основе введённых данных. Доступно только для чтения и обновляется автоматически при завершении операции ввода.
 Условия
 Только чтение
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события PromptedForInteger [Teigha.Runtime.CommandMethod("PromptedForIntegerExample_Result")] public void PromptedForIntegerExample() { // Подписка на событие PromptedForInteger editor.PromptedForInteger += OnEditorPromptedForInteger; } // Реализация отработки события PromptedForInteger private void OnEditorPromptedForInteger(object sender, PromptIntegerResultEventArgs e) { // Получаем доступ к результату запроса PromptIntegerResult result = e.Result; // Вывод сообщения в командную строку if (result != null && result.Status == PromptStatus.OK) { editor.WriteMessage($"\nВведено число: {result.Value}"); } } }
 Ссылки
 HostMgd.EditorInput.PromptIntegerResultEventArgs, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!