Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Window.Close
 Послать отзыв
 Синтаксис
C#
Visual Basic
public void Close();
Public Sub Close()
 Описание
 Закрывает окно.
 Ссылки
 Window Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!