Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.SheetCancelStatus
 Послать отзыв
 Данное перечисление определяет состояния отмены печати листа в сценарии вывода на печать чертежа на одном листе.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum SheetCancelStatus { Continue = 0, CanceledByCancelButton = 1, CanceledByCancelAllButton = 2, CanceledByCaller = 3 }
Копировать Код
Public Enum SheetCancelStatus Continue = 0 CanceledByCancelButton = 1 CanceledByCancelAllButton = 2 CanceledByCaller = 3 End Enum
 Члены
 Члены
 Описание
 CanceledByCaller
 Значение: 3. Печать листа была отменена конвейером печати.
 CanceledByCancelAllButton
 Значение: 2. Пользователь отменил выполнение всего задания на печать, используя элементы управления в пользовательском интерфейсе. Это означает, что отменяется вывод на печать всех листов, которые ожидают печати в текущем процессе печати.
 CanceledByCancelButton
 Значение: 1. Пользователь отменил печать текущего листа, используя элементы управления в пользовательском интерфейсе.
 Continue
 Значение: 0. Текущий процесс вывода листа на печать продолжает выполнение задания.
 Описание
 Перечисление SheetCancelStatus определяет состояния отмены печати листа в сценарии вывода на печать чертежа на одном листе.
 Ваши комментарии по поводу этого топика: Послать отзыв!