Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.PlotCancelStatus
 Послать отзыв
 Данное перечисление определяет состояния отмены печати в случае, когда печатается несколько листов.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum PlotCancelStatus { Continue = 0, CanceledByCaller = 1, CanceledByCancelAllButton = 2 }
Копировать Код
Public Enum PlotCancelStatus Continue = 0 CanceledByCaller = 1 CanceledByCancelAllButton = 2 End Enum
 Члены
 Члены
 Описание
 CanceledByCaller
 Значение: 1. Процесс выполнения задания на печать был отменен конвейером/механизмом печати.
 CanceledByCancelAllButton
 Значение: 2. Пользователь средствами пользовательского интерфейса отменил продолжение выполнения задания на печать. Как следствие, отменяется вывод на печать всех листов, ожидающих обработки в текущем процессе печати.
 Continue
 Значение: 0. Текущий процесс вывода на печать предполагает продолжение выполнения задания на печать.
 Описание
 Перечисление PlotCancelStatus определяет состояния отмены печати в случае, когда печатается несколько листов.
 Ваши комментарии по поводу этого топика: Послать отзыв!