Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Window.Focus
 Послать отзыв
 This is Focus, a member of class Window.
 Синтаксис
C#
Visual Basic
public bool Focus();
Public Function Focus() As bool
 Ссылки
 Window Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!