Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PromptDragOptions.Cursor
 Послать отзыв
 Синтаксис
C#
Visual Basic
public HostMgd::EditorInput::DragCursor Cursor;
Public Property Cursor() As HostMgd.EditorInput.DragCursor
 Описание
 Возвращает тип курсора при перетаскивании.
 Условия
 На чтение и запись
 Ссылки
 PromptDragOptions Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!