Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.Application.RecentDocuments
 Послать отзыв
 СВОЙСТВО НЕ РЕАЛИЗОВАНО. ВСЕГДА ВОЗВРАЩАЕТ NULL.
 Синтаксис
C#
Visual Basic
Копировать Код
public static IEnumerable<RecentDocument> RecentDocuments
Копировать Код
Public Shared ReadOnly Property RecentDocuments As IEnumerable(Of RecentDocument)
 Ссылки
 HostMgd.ApplicationServices.Application, HostMgd.ApplicationServices Пространство имен
 Исключения
 MGD NOT_IMPLEMENTED
 Ваши комментарии по поводу этого топика: Послать отзыв!