Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод PaletteSet.InitializeFloatingPosition
 Послать отзыв
 This is InitializeFloatingPosition, a member of class PaletteSet.
 Синтаксис
C#
Visual Basic
public void InitializeFloatingPosition(Rect value);
Public Sub InitializeFloatingPosition(value As Rect)
 Ссылки
 PaletteSet Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!