Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptAngleOptions.UseDashedLine
 Послать отзыв
 Свойство определяет, будет ли отображаться штриховая (резиновая) линия между базовой точкой и текущим положением курсора при интерактивном вводе угла.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool UseDashedLine { get; set; }
Копировать Код
Public Property UseDashedLine As Boolean
 Возвращает
 Возвращает значение типа bool:
true — штриховая линия отображается.
false — штриховая линия скрыта.
 Описание
 Свойство используется для включения или отключения визуальной подсказки в виде штриховой линии, которая динамически отображается между точкой, заданной через BasePoint, и текущим положением указателя при вводе угла. Если свойство установлено в true, пользователь видит линию, что улучшает наглядность ввода — например, при задании направления или повороте объекта. Если значение false, линия не отображается, и пользователь работает без визуального отслеживания направления.
 Условия
 Чтение и запись
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("PromptAngleOptionsExample_UseDashedLine")] public void PromptAngleOptionsExample_UseDashedLine() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создаём запрос пользователю, чтобы он указал угол на чертеже PromptAngleOptions options = new PromptAngleOptions("\nУкажите угол поворота:"); // Устанавливаем базовую точку options.BasePoint = new Point3d(100, 100, 0); // Включаем использование базовой точки options.UseBasePoint = true; // Включаем отображение штриховой линии options.UseDashedLine = true; // Вызов метода GetAngle, запрашивающего угол у пользователя PromptDoubleResult result = editor.GetAngle(options); // Если пользователь указал все необходимые данные, // выводим в командной строке сообщение if (result.Status == PromptStatus.OK) { double angleInRadians = result.Value; double angleInDegrees = result.Value * 180 / Math.PI; editor.WriteMessage($"\nУгол задан относительно точки {options.BasePoint}: {angleInRadians} радиан или {angleInDegrees} градусов"); } else if (result.Status == PromptStatus.None) { editor.WriteMessage("\nОперация отменена."); } } }
 Ссылки
 HostMgd.EditorInput.PromptAngleOptions, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!