Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Класс HostMgd.ApplicationServices.TransactionManager
 Послать отзыв
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::DatabaseServices::TransactionManager HostMgd::ApplicationServices::TransactionManager
 Синтаксис
C#
Visual Basic
public class TransactionManager : Teigha::DatabaseServices::TransactionManager;
Public Class TransactionManager Inherits Teigha.DatabaseServices.TransactionManager
 Методы
 Конструкторы
 Teigha.DatabaseServices.TransactionManager
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 TransactionManager
 Конструктор. (Унаследован от TransactionManager)
 Класс HostMgd.ApplicationServices.TransactionManager
 ПоказатьInternal
 Нет совпадений по текущему фильтру
 Имя
 Описание
 TransactionManager
 Конструктор.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.DatabaseServices.TransactionManager
 Имя
 Описание
 TransactionManager Методы
 Ниже перечислены методы класса TransactionManager.
 TransactionManager Свойства
 Ниже перечислены свойства класса TransactionManager.
 Класс HostMgd.ApplicationServices.TransactionManager
 Имя
 Описание
 TransactionManager Методы
 Ниже перечислены методы класса TransactionManager.
 Ссылки
 TransactionManager Методы, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!