Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод WindowOnHandle.GetWnd
 Послать отзыв
 This is GetWnd, a member of class WindowOnHandle.
 Синтаксис
C#
Visual Basic
public CWnd* GetWnd();
Public Function GetWnd() As CWnd*
 Ссылки
 WindowOnHandle Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!