Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.Windows.ToolPalette.CustomToolBase.ExecuteCallback
 Послать отзыв
 Метод реализует обратный вызов, используемый при выполнении логики пользовательского инструмента. Не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual bool ExecuteCallback();
Копировать Код
Public Overridable Function ExecuteCallback() As Boolean
 Возвращает
 Возвращает true, если вызов метода завершен успешно. В противном случае возвращает false.
 Описание
 Метод реализует обратный вызов, используемый при выполнении логики пользовательского инструмента.
 В текущей версии не реализован.
 Ссылки
 HostMgd.Windows.ToolPalette.CustomToolBase, HostMgd.Windows.ToolPalette
 Ваши комментарии по поводу этого топика: Послать отзыв!