Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Интерфейс HostMgd.ApplicationServices.IConfigurationSection
 Послать отзыв
 Иерархия классов
HostMgd::ApplicationServices::IConfigurationSection
 Синтаксис
C#
Visual Basic
public interface IConfigurationSection : IDisposable;
Public Interface IConfigurationSection Inherits IDisposable
 Описание
 Интерфейс для создания, хранения и управления данными конфигурации приложения.
 Топики
 Имя
 Описание
 IConfigurationSection Методы
 Ниже перечислены методы класса IConfigurationSection.
 IConfigurationSection Свойства
 Ниже перечислены свойства класса IConfigurationSection.
 Ссылки
 IConfigurationSection Методы, IConfigurationSection Свойства, Топики, IConfigurationSection Методы, IConfigurationSection Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!