Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.InplaceTextEditor.Redo
 Послать отзыв
 Метод повторяет последнюю выполненную операцию. В текущей версии не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Redo();
Копировать Код
Public Sub Redo()
 Описание
 Метод повторяет последнюю выполненную операцию. В текущей версии не реализован.
 Ссылки
 HostMgd.ApplicationServices.InplaceTextEditor, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!