Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор Dwf3dNavigationTreeNode.Dwf3dNavigationTreeNode (System::String^, bool, bool)
 Послать отзыв
 This is Dwf3dNavigationTreeNode, a member of class Dwf3dNavigationTreeNode.
 Синтаксис
C#
Visual Basic
public Dwf3dNavigationTreeNode(ref System.String displayName, bool isGroup, bool isBlock);
Public Sub New(ByRef displayName As System.String, isGroup As bool, isBlock As bool)
 Ссылки
 Dwf3dNavigationTreeNode Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!