Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Класс HostMgd.PlottingServices.PlotInfo
 Послать отзыв
 Сервисный класс, который предоставляет свойства, определяющие печать.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject HostMgd::PlottingServices::PlotInfo
 Синтаксис
C#
Visual Basic
[Wrapper("AcPlPlotInfo")] public class PlotInfo : Teigha::Runtime::RXObject;
<Wrapper("AcPlPlotInfo")> Public Class PlotInfo Inherits Teigha.Runtime.RXObject
 Описание
 Связан с классом Layout
 Методы
 Конструкторы
 Класс HostMgd.PlottingServices.PlotInfo
 Имя
 Описание
 PlotInfo
 This is PlotInfo, a member of class PlotInfo.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Класс HostMgd.PlottingServices.PlotInfo
 Имя
 Описание
 PlotInfo Методы
 Ниже перечислены методы класса PlotInfo.
 PlotInfo Свойства
 Ниже перечислены свойства класса PlotInfo.
 Ссылки
 PlotInfo Методы, PlotInfo Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!