Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.Application.UpdateScreen()
 Послать отзыв
 Метод предназначен принудительного обновления экрана.
 Синтаксис
C#
Visual Basic
public void UpdateScreen();
Public Sub UpdateScreen()
 Описание
 Метод вызывает принудительное обновление экрана.
 Ссылки
 HostMgd.ApplicationServices.Application, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!