Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.HostAppServices
 Послать отзыв
 Класс HostAppServices определяет интерфейс для базовых сервисов вывода на печать.
 Иерархия классов
HostMgd::PlottingServices::HostAppServices
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("AcPlHostAppServices")] public sealed class HostAppServices
Копировать Код
<Wrapper("AcPlHostAppServices")> Public NotInheritable Class HostAppServices
 Описание
 Класс HostAppServices определяет интерфейс, который должны реализовать хост-приложения, чтобы предоставлять базовые сервисы вывода на печать. Приложения, наследующие этот интерфейс, предоставляют свою реализацию методов этого класса.
 Топики
 Имя
 Описание
 HostAppServices Методы
 Ниже перечислены методы класса HostAppServices.
 HostAppServices Свойства
 Ниже перечислены свойства класса HostAppServices.
 Ссылки
 HostAppServices Методы, HostAppServices Свойства, Топики, HostAppServices Методы, HostAppServices Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!