Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PlotConfigManager.CurrentConfig
 Послать отзыв
 Используемая конфигурация печати.
 Синтаксис
C#
Visual Basic
public HostMgd::PlottingServices::PlotConfig CurrentConfig;
Public Property CurrentConfig() As HostMgd.PlottingServices.PlotConfig
 Описание
 Данная ссылка сохраняется только в текущей сессии после успешного выполнения метода SetCurrentConfig. В противном случае свойство возвращает null Только для чтения
 Ссылки
 PlotConfigManager Класс, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!