Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptIntegerResultEventHandler(object,PromptIntegerResultEventArgs)
 Послать отзыв
 Делегат предназначен для обработки событий, возникающих после завершения операции ввода целого числа пользователем в редакторе nanoCAD.
 Синтаксис
C#
Visual Basic
Копировать Код
public delegate void PromptIntegerResultEventHandler(object sender, PromptIntegerResultEventArgs e);
Копировать Код
Public Delegate Sub PromptIntegerResultEventHandler(sender As Object, e As PromptIntegerResultEventArgs)
 Параметры
 Параметры
 Описание
 sender
 Источник события, обычно представляет экземпляр редактора (Editor), в котором была вызвана команда ввода целого числа. Тип object
 e
 Объект, содержащий данные о результате ввода:
 Описание
 Делегат используется как сигнатура метода-обработчика для событий, связанных с вводом целочисленных значений через интерактивные команды — такие как GetInteger(). Он позволяет получать результат ввода, проверять статус операции и выполнять дальнейшие действия на основе введённого пользователем значения. Делегат передаёт данные события через объект PromptIntegerResultEventArgs, который содержит значение числа, статус выполнения (OK, Cancel, Error) и строковое представление ввода.
 Этот тип делегата применяется в надстройках и плагинах, где требуется реагировать на завершение ввода целого числа, например, при запросе количества копий, номера слоя или любого другого параметра, ограниченного диапазоном 16-битного целого (от -32768 до +32767).
 Замечания
 Делегат является частью .NET API nanoCAD и играет важную роль при создании интерактивных команд, требующих точного ввода целых чисел, что особенно актуально при построении массивов, задании параметров команд и других задачах автоматизации.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события PromptedForInteger [Teigha.Runtime.CommandMethod("PromptedForIntegerExample")] public void PromptedForIntegerExample() { // Подписка на событие PromptedForInteger editor.PromptedForInteger += OnEditorPromptedForInteger; } // Реализация отработки события PromptedForInteger private void OnEditorPromptedForInteger(object sender, PromptIntegerResultEventArgs e) { // Вывод сообщения в командную строку if (e.Result.Status == PromptStatus.OK) { editor.WriteMessage($"\nВведено число: {e.Result.Value}"); } else { editor.WriteMessage("\nЧисло не введено."); } } }
 Ваши комментарии по поводу этого топика: Послать отзыв!