Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор EPlotProperty.EPlotProperty (System::String^, System::String^)
 Послать отзыв
 This is EPlotProperty, a member of class EPlotProperty.
 Синтаксис
C#
Visual Basic
public EPlotProperty(ref System.String name, ref System.String val);
Public Sub New(ByRef name As System.String, ByRef val As System.String)
 Ссылки
 EPlotProperty Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!