Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство SelectedSubObject.FullSubentityPath
 Послать отзыв
 Синтаксис
C#
Visual Basic
public Teigha::DatabaseServices::FullSubentityPath FullSubentityPath;
Public Property FullSubentityPath() As Teigha.DatabaseServices.FullSubentityPath
 Описание
 Возвращает или задает полный путь геометричского подобъекта в выбранном подобъекте.
 Условия
 На чтение и запись
 Ссылки
 SelectedSubObject Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!