Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод ColorDialog.SetDialogTabs
 Послать отзыв
 This is SetDialogTabs, a member of class ColorDialog.
 Синтаксис
C#
Visual Basic
public void SetDialogTabs(ColorDialog.ColorTabs value);
Public Sub SetDialogTabs(value As ColorDialog.ColorTabs)
 Ссылки
 ColorDialog Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!