Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptStringOptions.DefaultValue
 Послать отзыв
 Свойство возвращает или устанавливает значение по умолчанию, используемое при вводе строки, если пользователь нажимает Enter без ввода текста.
 Синтаксис
C#
Visual Basic
Копировать Код
public string DefaultValue { get; set; }
Копировать Код
Public Property DefaultValue As String
 Возвращает
 Возвращает строку (string), установленную как значение по умолчанию.
Если значение задано — оно будет использовано при нажатии Enter без ввода.
Если null или пустая строка — по умолчанию будет возвращена пустая строка или ввод будет отклонён, если AllowNone = false.
 Описание
 Свойство позволяет задать строку, которая будет применена как результат ввода, если пользователь завершает команду нажатием Enter, не вводя собственное значение. Это особенно полезно при реализации команд, где требуется ввод текста, но допустимо использование стандартного значения — например, при задании имени слоя, стиля, комментария или метки.
 Для того чтобы значение по умолчанию применялось, необходимо также установить AllowNone = true, что разрешает завершение ввода без явного ввода.
 Условия
 Чтение и запись
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("PromptStringOptionsExample_DefaultValue")] public void PromptStringOptionsExample_DefaultValue() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Определяем настройки запроса пользователю PromptStringOptions options = new PromptStringOptions("Введите имя"); // Значение по умолчанию options.DefaultValue = "Untitled"; // Разрешить ввод с пробелами options.AllowSpaces = true; // Создаём запрос пользователю PromptResult pr = editor.GetString(options); // Если все данные введены, выводим результат в командную строку if (pr.Status == PromptStatus.OK) { editor.WriteMessage( $"\nВы ввели: {pr.StringResult}"); } else { editor.WriteMessage( "\nВвод отменён."); } } }
 Ссылки
 HostMgd.EditorInput.PromptStringOptions, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!