Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство PublishEntityEventArgs.IsCancelled
 Послать отзыв
 This is IsCancelled, a member of class PublishEntityEventArgs.
 Синтаксис
C#
Visual Basic
public bool IsCancelled;
Public Property IsCancelled() As bool
 Ссылки
 PublishEntityEventArgs Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!