Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод JigPrompts.SetInput
 Послать отзыв
 Вспомогательный метод, который инициирует процесс изменения объекта или группы объектов с помощью технологии Jig.
 Синтаксис
C#
Visual Basic
internal void SetInput(ref HostEdJig edJig, ref JigPromptOptions options);
Friend Sub SetInput(ByRef edJig As HostEdJig, ByRef options As JigPromptOptions)
 Параметры
 Параметры
 Описание
 edJig
 Ссылка на изменяемый объект или группу объектов
 options
 Набор параметров, с которыми будет происходить изменение объекта или группы объектов
 Описание
 Вспомогательный метод, вызывается в методах
JigPrompts.AcquireAngle(JigPromptAngleOptions options),
JigPrompts.AcquireDistance(JigPromptDistanceOptions options),
JigPrompts.AcquirePoint(JigPromptPointOptions options),
JigPrompts.AcquireString(JigPromptStringOptions options).
 Инициирует процесс изменения объекта или группы объектов с помощью технологии Jig с использованием параметров, определенных с помощью классов JigPromptAngleOptions, JigPromptDistanceOptions, JigPromptPointOptions или JigPromptStringOptions соответственно.
 Ссылки
 JigPrompts Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!