Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptEntityResultEventArgs
 Послать отзыв
 Класс предоставляет данные для события PromptedForEntity, включая информацию о выбранном геометрическом объекте и статусе операции.
 Иерархия классов
HostMgd::EditorInput::PromptEntityResultEventArgs
 Синтаксис
C#
Visual Basic
Копировать Код
public class PromptEntityResultEventArgs : EventArgs
Копировать Код
Public Class PromptEntityResultEventArgs Inherits EventArgs
 Описание
 Класс наследуется от EventArgs и используется в .NET API nanoCAD для передачи результатов выбора геометрического объекта пользователем. Он применяется совместно с событием PromptedForEntity и делегатом PromptEntityResultEventHandler. Объект этого класса содержит:
Идентификатор (ObjectId) выбранного объекта.
Точку выбора (PickedPoint) в мировых координатах (WCS).
Статус выполнения операции (PromptStatus.OK, PromptStatus.Cancel и др.).
 Этот класс позволяет разработчикам плагинов обрабатывать результаты выборки объектов, проверять допустимость выбора, а также выполнять действия на основе точки и объекта, указанных пользователем.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события PromptedForEntity [Teigha.Runtime.CommandMethod("PromptedForEntityExample")] public void PromptedForEntityExample() { // Подписка на событие PromptedForEntity editor.PromptedForEntity += OnEditorPromptedForEntity; } // Реализация отработки события PromptedForEntity private void OnEditorPromptedForEntity(object sender, PromptEntityResultEventArgs e) { // Вывод сообщения в командную строку if (e.Result.Status == PromptStatus.OK && !e.Result.ObjectId.IsNull) { editor.WriteMessage($"\nВыбран объект: {e.Result.ObjectId.ObjectClass.Name}, точка: {e.Result.PickedPoint}"); } else { editor.WriteMessage("\nНе удалось получить объект."); } } }
 Топики
 Имя
 Описание
 PromptEntityResultEventArgs Свойства
 Ниже перечислены свойства класса PromptEntityResultEventArgs.
 Ссылки
 PromptEntityResultEventArgs Свойства, Топики, PromptEntityResultEventArgs Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!