Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.Windows.ToolPalette
 Послать отзыв
 Пространство имен HostMgd.Windows.ToolPalette включает классы, перечисления и делегаты, предназначенные для создания в пользовательском интерфейсе разнообразных панелей инструментов.
 Описание
 Пространство имен HostMgd.Windows.ToolPalette включает классы, перечисления и делегаты, предназначенные для создания в пользовательском интерфейсе разнообразных панелей инструментов.
 Классы
 Имя
 Описание
 Catalog
 Класс Catalog представляет каталоги в панелях инструментов.
 CatalogItem
 Класс CatalogItem является базовым классом для всех элементов каталога, инкапсулируя их общие свойства и поведение.
 Category
 Класс Category представляет элемент категории в каталоге инструментов.
 CustomToolBase
 Класс CustomToolBase является абстрактным классом, который определяет универсальный пользовательский инструмент, пригодный для реализации инструмента любого типа, поддерживаемого панелями инструментов. В текущей версии не реализован.
 FlyoutEntryAttribute
 Класс FlyoutEntryAttribute представляет атрибут, который идентифицирует выпадающие элементы. Не реализован.
 ImageInfo
 This is class HostMgd::Windows::ToolPalette::ImageInfo.
 Package
 This is class HostMgd::Windows::ToolPalette::Package.
 PerPropertyBrowsingEntryAttribute
 This is class HostMgd::Windows::ToolPalette::PerPropertyBrowsingEntryAttribute.
 TargetProductInfo
 This is class HostMgd::Windows::ToolPalette::TargetProductInfo.
 Tool
 This is class HostMgd::Windows::ToolPalette::Tool.
 ToolAttribute
 This is class HostMgd::Windows::ToolPalette::ToolAttribute.
 ToolReactorManager
 This is class HostMgd::Windows::ToolPalette::ToolReactorManager.
 Ссылки
 Классы, Перечисления, Структуры, Делегаты
 Ваши комментарии по поводу этого топика: Послать отзыв!