Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.DocumentCollection
 Послать отзыв
 Класс представляет коллекцию открытых в приложении dwg-документов.
 Иерархия классов
HostMgd::ApplicationServices::DocumentCollection
 Синтаксис
C#
Visual Basic
[Wrapper("HostApDocManager")] public class DocumentCollection : MarshalByRefObject, System.Collections.ICollection;
<Wrapper("HostApDocManager")> Public Class DocumentCollection Inherits MarshalByRefObject Inherits System.Collections.ICollection
 Описание
 Класс является контейнером для всех документов (для каждого открытого и начавшего редактироваться чертежа создается один объект).
 Топики
 Имя
 Описание
 DocumentCollection Методы
 Ниже перечислены методы класса DocumentCollection.
 DocumentCollection Свойства
 Ниже перечислены свойства класса DocumentCollection.
 DocumentCollection События
 Ниже перечислены события класса DocumentCollection.
 Ссылки
 DocumentCollection Методы, DocumentCollection Свойства, DocumentCollection События, Топики, DocumentCollection Методы, DocumentCollection Свойства, DocumentCollection События
 Ваши комментарии по поводу этого топика: Послать отзыв!