Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.Editor.SelectWindowPolygon(Point3dCollection)
 Послать отзыв
 Метод возвращает набор объектов, полностью находящихся внутри заданного многоугольника, построенного по вершинам.
 Синтаксис
C#
Visual Basic
Копировать Код
public PromptSelectionResult SelectWindowPolygon(Point3dCollection polygon);
Копировать Код
Public Function SelectWindowPolygon(polygon As Point3dCollection) As PromptSelectionResult
 Параметры
 Параметры
 Описание
 polygon
 Коллекция трёхмерных точек (Point3d), представляющих вершины многоугольника в мировой системе координат (WCS). Многоугольник должен быть замкнутым — иначе он будет автоматически замкнут при обработке. Тип Point3dCollection.
 Возвращает
 Возвращает объект типа PromptSelectionResult, содержащий:
Status — статус выполнения (OK, Cancel, Error и др.). При успешной выборке статус равен PromptStatus.OK.
Value — объект типа SelectionSet, содержащий список идентификаторов (ObjectId) выбранных объектов.
StringResult — строковое значение.
 Если ни один объект не находится полностью внутри многоугольника, Value может быть null.
 Описание
 Метод используется для выборки геометрических объектов чертежа, которые полностью расположены внутри замкнутого многоугольника, заданного коллекцией точек. В отличие от перекрёстного выделения (SelectCrossingPolygon), данный метод включает только те объекты, которые полностью находятся внутри области многоугольника.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("SelectWindowPolygonExample_Point3dCollection")] public void SelectWindowPolygonExample_Point3dCollection() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Задание многоугольника Point3dCollection polygon = new Point3dCollection(); polygon.Add(new Point3d(0, 0, 0)); polygon.Add(new Point3d(100, 0, 0)); polygon.Add(new Point3d(100, 100, 0)); polygon.Add(new Point3d(0, 100, 0)); // Вызываем метод PromptSelectionResult result = editor.SelectWindowPolygon(polygon); // Выводим сообщение в командную строку if (result.Status == PromptStatus.OK) { SelectionSet selSet = result.Value; editor.WriteMessage( $"\nОбъектов внутри области: {selSet.Count}"); } else { editor.WriteMessage( "\nНет объектов, полностью находящихся внутри многоугольника."); } } }
 Ссылки
 HostMgd.EditorInput.Editor, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!