Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор PromptDragOptions.PromptDragOptions (SelectionSet^, String^, HostMgd::EditorInput::DragCallback^)
 Послать отзыв
 Синтаксис
C#
Visual Basic
public PromptDragOptions(ref SelectionSet selection, ref String message, ref HostMgd::EditorInput::DragCallback callback);
Public Sub New(ByRef selection As SelectionSet, ByRef message As String, ByRef callback As HostMgd.EditorInput.DragCallback)
 Параметры
 Параметры
 Описание
 selection
 Выбранное множество
 message
 Приглашающее сообщение
 callback
 Событие перетаскивания
 Описание
 Конструктор.
 Ссылки
 PromptDragOptions Класс, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!