Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство StatusBarMouseDownEventArgs.DoubleClick
 Послать отзыв
 This is DoubleClick, a member of class StatusBarMouseDownEventArgs.
 Синтаксис
C#
Visual Basic
public bool DoubleClick;
Public Property DoubleClick() As bool
 Ссылки
 StatusBarMouseDownEventArgs Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!