Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.GraphicsSystem.Manager.GsToBeUnloaded
 Послать отзыв
 Событие GsToBeUnloaded выпускается непосредственно перед выгрузкой графической системы из памяти.
 Синтаксис
C#
Visual Basic
Копировать Код
public event Teigha.GraphicsSystem.GsToBeUnloadedEventHandler GsToBeUnloaded;
Копировать Код
Public Event GsToBeUnloaded As Teigha.GraphicsSystem.GsToBeUnloadedEventHandler
 Возвращает
 Возвращает делегат типа Teigha.GraphicsSystem.GsToBeUnloadedEventHandler.
 Описание
 Событие GsToBeUnloaded выпускается непосредственно перед выгрузкой графической системы из памяти.
 Ссылки
 HostMgd.GraphicsSystem.Manager, HostMgd.GraphicsSystem
 Ваши комментарии по поводу этого топика: Послать отзыв!