Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Runtime.IMenuItem.Enabled
 Послать отзыв
 Свойство Enabled позволяет определить, включен ли данный элемент меню.
 Синтаксис
C#
Visual Basic
Копировать Код
bool Enabled;
Копировать Код
Property Enabled As Boolean
 Возвращает
 Возвращает true, если данный элемент меню включен (активен). В противном случае возвращает false.
 Описание
 Свойство Enabled позволяет определить, включен ли данный элемент меню.
 Условия
 Чтение и запись.
 Ссылки
 MenuItem Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!