Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.InplaceTextEditor.TableCell
 Послать отзыв
 Свойство TableCell позволяет проверить, является ли ячейка таблицы текущим объектом в данном редакторе. В текущей версии не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool TableCell;
Копировать Код
Public ReadOnly Property TableCell As Boolean
 Возвращает
 Возвращает true, если текущим объектом в редакторе является ячейка таблицы. В противном случае возвращает false.
 Описание
 Свойство TableCell позволяет проверить, является ли ячейка таблицы текущим объектом в данном редакторе. В текущей версии не реализовано.
 Условия
 Только чтение.
 Ссылки
 HostMgd.ApplicationServices.InplaceTextEditor, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!