Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.Document.IsReadOnly
 Послать отзыв
 Свойство позволяет проверить, доступен ли документ только для чтения.
 Синтаксис
C#
Visual Basic
public bool IsReadOnly;
Public Property IsReadOnly() As bool
 Возвращает
 Возвращает признак того, доступен документ только для чтения или нет. Тип bool
 Описание
 Свойство позволяет проверить, доступен ли документ только для чтения.
 Условия
 Только чтение
 Ссылки
 HostMgd.ApplicationServices.Document, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!