Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptDoubleResultEventHandler(object,PromptDoubleResultEventArgs)
 Послать отзыв
 Делегат предназначен для обработки событий, связанных с завершением ввода числового значения типа double, такого как угол или расстояние.
 Синтаксис
C#
Visual Basic
Копировать Код
public delegate void PromptDoubleResultEventHandler(object sender, PromptDoubleResultEventArgs e);
Копировать Код
Public Delegate Sub PromptDoubleResultEventHandler(sender As Object, e As PromptDoubleResultEventArgs)
 Параметры
 Параметры
 Описание
 sender
 Источник события — обычно экземпляр редактора (Editor), который вызвал ввод числового значения. Тип object
 e
 Объект, содержащий данные о результате ввода:
 Описание
 Делегат используется в .NET API nanoCAD для обработки событий, возникающих после завершения интерактивного ввода пользователем числовых значений типа double. Он применяется в таких операциях, как GetAngle(), GetDistance() и другие, где требуется ввод вещественного числа. Делегат принимает два параметра: источник события (sender) и объект PromptDoubleResultEventArgs, содержащий результат ввода — значение угла или расстояния, а также статус выполнения (успех, отмена, ошибка).
 Этот тип делегата часто используется при подписке на события, такие как PromptedForAngle, PromptedForDistance, и других, связанных с числовым вводом.
 Замечания
 Делегат обеспечивает гибкий способ обработки числового ввода в надстройках и плагинах nanoCAD, позволяя реагировать на результаты ввода угла, расстояния или другого double-значения в чертеже.
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class EditorCommands { // Глобальные переменные для текущего документа и редактора public static Document doc = Application.DocumentManager.MdiActiveDocument; public static Editor editor = doc.Editor; // Метод команды, которая отслеживает появление события PromptedForAngle [Teigha.Runtime.CommandMethod("PromptedForAngleExample")] public void PromptedForAngleExample() { // Подписка на событие PromptedForAngle editor.PromptedForAngle += OnEditorPromptedForAngle; } // Реализация отработки события PromptedForAngle private void OnEditorPromptedForAngle(object sender, PromptDoubleResultEventArgs e) { // Вывод сообщения в командную строку if (e.Result.Status == PromptStatus.OK) { editor.WriteMessage( $"\nВведённый угол (радианы): {e.Result.Value}"); } else { editor.WriteMessage( "\nВвод угла отменён или произошла ошибка."); } } }
 Ваши комментарии по поводу этого топика: Послать отзыв!