Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Событие Publisher.CancelledOrFailedPublishing
 Послать отзыв
 This is CancelledOrFailedPublishing, a member of class Publisher.
 Синтаксис
C#
Visual Basic
public event CancelledOrFailedPublishingEventHandler CancelledOrFailedPublishing;
Public Event CancelledOrFailedPublishing As CancelledOrFailedPublishingEventHandler
 Ссылки
 Publisher Класс, HostMgd.Publishing Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!