Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство TrayItemCollection.Item
 Послать отзыв
 This is Item, a member of class TrayItemCollection.
 Синтаксис
C#
Visual Basic
public HostMgd::Windows::TrayItem Item;
Public Property Item() As HostMgd.Windows.TrayItem
 Ссылки
 TrayItemCollection Класс, HostMgd.Windows
 Ваши комментарии по поводу этого топика: Послать отзыв!