Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptIntegerOptions.UpperLimit
 Послать отзыв
 Свойство возвращает или устанавливает максимально допустимое значение, которое пользователь может ввести при интерактивной команде.
 Синтаксис
C#
Visual Basic
Копировать Код
public int UpperLimit { get; set; }
Копировать Код
Public Property UpperLimit As Integer
 Возвращает
 Возвращает значение типа int, представляющее максимально допустимое значение для ввода.
 Описание
 Свойство используется для задания верхней границы допустимого диапазона значений при вводе целого числа — например, через метод GetInteger(). Если пользователь введёт число больше этого значения, система отклонит ввод и может запросить повторное введение корректного значения.
 Это свойство позволяет контролировать верхний предел ввода, предотвращая некорректные или чрезмерные значения — например, при вводе количества копий, номера слоя, размера массива и других параметров, ограниченных по верхней границе.
 ВАЖНО! Свойство UpperLimit должно быть больше или равно LowerLimit. В противном случае ввод может вести себя некорректно.
 Условия
 Чтение и запись
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("PromptIntegerOptions_UpperLimit")] public void PromptIntegerOptions_UpperLimit() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создаём запрос пользователю PromptIntegerOptions options = new PromptIntegerOptions("Введите количество копий:"); // Значение по умолчанию options.DefaultValue = 1; // Разрешить нажатие Enter options.AllowNone = true; // Минимальное допустимое значение options.LowerLimit = 1; // Максимальное допустимое значение options.UpperLimit = 99; // Вызываем метод GetInteger() для запроса пользователю PromptIntegerResult ipr = editor.GetInteger(options); // Если все данные введены, выводим результат в командную строку if (PromptStatus.OK == ipr.Status) { editor.WriteMessage("\nКоличество копий: " + ipr.Value); } else { editor.WriteMessage("\nОтмена или ошибка ввода."); } } }
 Ссылки
 HostMgd.EditorInput.PromptIntegerOptions, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!