Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод PlotProgressDialog.DeleteUnmanagedObject
 Послать отзыв
 This is DeleteUnmanagedObject, a member of class PlotProgressDialog.
 Синтаксис
C#
Visual Basic
public void DeleteUnmanagedObject();
Public Sub DeleteUnmanagedObject()
 Ссылки
 PlotProgressDialog Класс, HostMgd.PlottingServices
 Ваши комментарии по поводу этого топика: Послать отзыв!