Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.PlottingServices.Dwf3dOptions
 Послать отзыв
 Класс Dwf3dOptions представляет опции публикации в формате 3D DWF.
 Иерархия классов
HostMgd::PlottingServices::Dwf3dOptions
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("AcPublish3DDwfOptions")] public class Dwf3dOptions
Копировать Код
<Wrapper("AcPublish3DDwfOptions")> Public Class Dwf3dOptions
 Описание
 Класс Dwf3dOptions представляет опции публикации в формате 3D DWF.
 Топики
 Имя
 Описание
 Dwf3dOptions Свойства
 Ниже перечислены свойства класса Dwf3dOptions.
 Ссылки
 Dwf3dOptions Свойства, Топики, Dwf3dOptions Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!