Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.InplaceTextEditor.ReplaceAllMatches
 Послать отзыв
 Метод предназначен для замены всех вхождений указанной строки на заданную строку с учетом предписанных флагов поиска. В текущей версии не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public void ReplaceAllMatches( int flags, ref System.String findStr, ref System.String replaceStr );
Копировать Код
Public Sub ReplaceAllMatches( flags As Integer, ByRef findStr As System.String, ByRef replaceStr As System.String )
 Параметры
 Параметры
 Описание
 flags
 Флаги поиска. Например, строка целиком, совпадение по регистру и т.п. Тип int.
 findStr
 Заменяемая подстрока. Тип System.String.
 replaceStr
 Заменяющая подстрока. Тип System.String.
 Описание
 Метод предназначен для замены всех вхождений строки findStr на строку replaceStr с учетом предписанных флагов поиска flags. По окончании работы метода отображается окно сообщения о завершении операции. В текущей версии метод не реализован.
 Ссылки
 HostMgd.ApplicationServices.InplaceTextEditor, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!