Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.EditorInput.PromptAngleOptions.UseDefaultValue
 Послать отзыв
 Свойство определяет, будет ли использоваться значение по умолчанию при нажатии пользователем Enter без ввода другого значения угла.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool UseDefaultValue { get; set; }
Копировать Код
Public Property UseDefaultValue As Boolean
 Возвращает
 Возвращает значение типа bool:
true — значение по умолчанию будет использовано, если пользователь нажал Enter без ввода.
false — значение по умолчанию не применяется, пользователь должен ввести угол вручную.
 Описание
 Свойство используется для указания, следует ли применять значение, заданное в свойстве DefaultValue, если пользователь просто нажал Enter , не вводя собственного значения угла. Если свойство установлено в true, значение угла по умолчанию будет использоваться в команде (например, при вызове GetAngle()). Если false — пользователь обязан ввести угол вручную или выбрать его графически.
 Замечания
 Свойство работает вместе с DefaultValue и AllowNone, обеспечивая гибкое поведение интерактивного ввода угла.
 Условия
 Чтение и запись
 Пример
C#
 Копировать Код
using HostMgd.ApplicationServices; using HostMgd.EditorInput; public partial class Commands { [Teigha.Runtime.CommandMethod("PromptAngleOptionsExample_UseDefaultValue")] public void PromptAngleOptionsExample_UseDefaultValue() { // Получаем доступ к документу и через него к редактору документа Document doc = Application.DocumentManager.MdiActiveDocument; Editor editor = doc.Editor; // Создаём запрос пользователю, чтобы он указал угол на чертеже PromptAngleOptions options = new PromptAngleOptions("\nУкажите угол поворота:"); options.DefaultValue = Math.PI / 2; // Угол по умолчанию — 90 градусов options.AllowNone = true; // Разрешить нажатие Enter без ввода // Включаем использование значения по умолчанию options.UseDefaultValue = true; // Вызов метода GetAngle, запрашивающего угол у пользователя PromptDoubleResult result = editor.GetAngle(options); // Если пользователь указал все необходимые данные, // выводим в командной строке сообщение if (result.Status == PromptStatus.OK) { double angleInRadians = result.Value; double angleInDegrees = result.Value * 180 / Math.PI; editor.WriteMessage($"\nВведен угол: {angleInRadians} радиан или {angleInDegrees} градусов"); } else if (result.Status == PromptStatus.None) { editor.WriteMessage("\nИспользовано значение угла по умолчанию."); } } }
 Ссылки
 HostMgd.EditorInput.PromptAngleOptions, HostMgd.EditorInput
 Ваши комментарии по поводу этого топика: Послать отзыв!