Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.Application.SetSystemVariable(String,Object)
 Послать отзыв
 Метод предназначен для изменения значения системной переменной.
 Синтаксис
C#
Visual Basic
Копировать Код
public static void SetSystemVariable(string name, object value);
Копировать Код
Public Shared Sub SetSystemVariable(name As String, value As Object)
 Параметры
 Параметры
 Описание
 name
 Имя системной переменной, для которой задается значение
 value
 Задаваемое значение
 Описание
 Метод устанавливает новое значение системной переменной.
 Пример
 В примере приведен фрагмент кода, изменяющий размер курсора через системную переменную CURSORSIZE:
C#
 Копировать Код
HostMgd.ApplicationServices.Application.SetSystemVariable("CURSORSIZE",10);
 Ссылки
 HostMgd.ApplicationServices.Application, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!