Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 HostMgd.ApplicationServices.InplaceTextEditor.ParagraphDialog
 Послать отзыв
 Метод вызывает диалоговое окно редактирования текстового абзаца. В текущей версии не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public void ParagraphDialog();
Копировать Код
Public Sub ParagraphDialog()
 Описание
 Метод вызывает диалоговое окно редактирования текстового абзаца в данном редакторе. В текущей версии не реализован.
 Ссылки
 HostMgd.ApplicationServices.InplaceTextEditor, HostMgd.ApplicationServices Пространство имен
 Ваши комментарии по поводу этого топика: Послать отзыв!