Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.OffsetCurveExtensionType
 Послать отзыв
 Перечисление OffsetCurveExtensionType определяет варианты сопряжения смещаемых сегментов кривых в процессе операции смещения (offset).
 Синтаксис
C#
Visual Basic
Копировать Код
public enum OffsetCurveExtensionType { Fillet = 0, Chamfer = 1, Extend = 2 }
Копировать Код
Public Enum OffsetCurveExtensionType Fillet = 0 Chamfer = 1 Extend = 2 End Enum
 Члены
 Члены
 Описание
 Fillet
 Значение: 0. Для сопряжения смещаемых сегментов кривых в местах их спроецированных пересечений используется скругление (сопряжение).
 Chamfer
 Значение: 1. Для сопряжения смещаемых сегментов кривых в местах их спроецированных пересечений используется фаска.
 Extend
 Значение: 2. Для сопряжения смещаемых сегментов кривых используется удлинение сегментов до их спроецированных пересечений.
 Описание
 Перечисление OffsetCurveExtensionType определяет варианты сопряжения смещаемых сегментов кривых в процессе операции смещения (offset).
 Ваши комментарии по поводу этого топика: Послать отзыв!