Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Line.Length
 Послать отзыв
 Синтаксис
C#
Visual Basic
public double Length;
Public Property Length() As Double
 Описание
 Возвращает длину линии.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.Line, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!