Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.AltSuppressTrailingZeros
 Послать отзыв
 Свойство управляет подавлением замыкающих нулей в альтернативных значениях размеров.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool AltSuppressTrailingZeros;
Копировать Код
Public Property AltSuppressTrailingZeros As Boolean
 Возвращает
 Возвращает true, если подавление включено. В противном случае возвращает false.
 Описание
 Свойство позволяет включить или отменить подавление замыкающих нулей в альтернативных значениях размеров. Этот функционал работает только в случае, если для свойства Dimalt установлено значение true.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!