Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbCurve3d.SetFitPointAt
 Послать отзыв
 Метод изменяет определяющую точку с указанным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool SetFitPointAt( int index, Point3d point );
Копировать Код
Public Function SetFitPointAt( index As Integer, point As Point3d ) As Boolean
 Параметры
 Параметры
 Описание
 index
 Индекс определяющей точки. Тип int.
 point
 Новые координаты определяющей точки. Тип Point3d.
 Возвращает
 Возвращает true, если перевычисление сплайна после изменения определяющей точки завершилось успешно. В противном случае возвращает false.
 Описание
 Метод изменяет координаты определяющей точки с указанным индексом и перевычисляет сплайн.
 Ссылки
 Teigha.Geometry.NurbCurve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!