Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SectionManager.GetEnumerator
 Послать отзыв
 Метод предоставляет перечислитель для коллекции секущих плоскостей.
 Синтаксис
C#
Visual Basic
Копировать Код
public Collections.IEnumerator GetEnumerator();
Копировать Код
Public Function GetEnumerator() As Collections.IEnumerator
 Возвращает
 Возвращает объект перечислителя. Тип Collections.IEnumerator.
 Описание
 Метод предоставляет перечислитель для коллекции секущих плоскостей.
 Ссылки
 Teigha.DatabaseServices.SectionManager, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!