Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.OpenCloseTransaction
 Послать отзыв
 Класс OpenCloseTransaction предназначен для использования в определенных сценариях вместо класса Transaction.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::DatabaseServices::Transaction Teigha::DatabaseServices::OpenCloseTransaction
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdTransaction")] public class OpenCloseTransaction : Transaction
Копировать Код
Public Class OpenCloseTransaction Inherits Transaction
 Описание
 Класс OpenCloseTransaction предназначен для использования в определенных сценариях вместо класса Transaction. Он оборачивает методы ObjectId.Open/Close, но упрощает их корректное совместное применение, сохраняя ссылки на каждый открытый объект и обеспечивая автоматическое закрытие открытых объектов.
 Методы
 Конструкторы
 Teigha.DatabaseServices.Transaction
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 Transaction
 Конструктор. (Унаследован от Transaction)
 Teigha.DatabaseServices.OpenCloseTransaction
 Имя
 Описание
 OpenCloseTransaction
 Конструктор по умолчанию класса OpenCloseTransaction.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.DatabaseServices.Transaction
 Имя
 Описание
 Transaction Методы
 Ниже перечислены методы класса Transaction.
 Transaction Свойства
 Ниже перечислены свойства класса Transaction.
 Teigha.DatabaseServices.OpenCloseTransaction
 Имя
 Описание
 OpenCloseTransaction Методы
 Ниже перечислены методы класса OpenCloseTransaction.
 OpenCloseTransaction Свойства
 Ниже перечислены свойства класса OpenCloseTransaction.
 Ссылки
 OpenCloseTransaction Методы, OpenCloseTransaction Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!