Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LoftOptionsBuilder
 Послать отзыв
 Этот вспомогательный класс используется для формирования настроек для операции вытягивания поверхности по сечениям (лофт).
 Иерархия классов
Teigha::DatabaseServices::LoftOptionsBuilder
 Синтаксис
C#
Visual Basic
Копировать Код
public class LoftOptionsBuilder;
Копировать Код
Public Class LoftOptionsBuilder
 Описание
 Этот вспомогательный класс используется для наполнения объекта DatabaseServices.LoftOptions параметрами на основе значений системных переменных, относящихся к формообразующей операции вытягивания поверхности по сечениям (лофт).
 Методы
 Конструкторы
 Имя
 Описание
 LoftOptionsBuilder
 Это обзор перегрузок LoftOptionsBuilder.
 Топики
 Имя
 Описание
 LoftOptionsBuilder Методы
 Ниже перечислены методы класса LoftOptionsBuilder.
 LoftOptionsBuilder Свойства
 Ниже перечислены свойства класса LoftOptionsBuilder.
 Ссылки
 LoftOptionsBuilder Конструктор, LoftOptionsBuilder Методы, LoftOptionsBuilder Свойства, Методы, Топики, LoftOptionsBuilder Методы, LoftOptionsBuilder Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!