Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод RasterImage.GetVertices
 Послать отзыв
 Синтаксис
C#
Visual Basic
public Point3dCollection GetVertices();
Public Function GetVertices() As Point3dCollection
 Описание
 Возвращает вершины фрейма изображения. Эти точки могут представлять четыре угла прямоугольника или, если изображение задано в виде контура, вершины границ многоугольника контура изображения.
 Ссылки
 Teigha.DatabaseServices.RasterImage, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!