Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.LoftMag2
 Послать отзыв
 Синтаксис
C#
Visual Basic
public double LoftMag2;
Public Property LoftMag2() As Double
 Описание
 Возвращает или устанавливает текущее значение LOFTMAG2 для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!