Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.KnotCollection.GetMultiplicityAt
 Послать отзыв
 Метод определяет кратность узла с указанным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public int GetMultiplicityAt( int i );
Копировать Код
Public Function GetMultiplicityAt( i As Integer ) As Integer
 Параметры
 Параметры
 Описание
 i
 Индекс узла. Тип int.
 Возвращает
 Возвращает кратность узла с указанным индексом. Тип int.
 Описание
 Метод определяет кратность узла с указанным индексом (количество совпадающих последовательных узлов).
 Замечания
 Если последовательные узлы отличаются в пределах допуска, узлы считаются идентичными, а их кратности складываются.
 Ссылки
 Teigha.Geometry.KnotCollection, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!