Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство TextStyleTableRecord.IsShapeFile
 Послать отзыв
 Синтаксис
C#
Visual Basic
public bool IsShapeFile;
Public Property IsShapeFile() As bool
 Описание
 Обеспечивает доступ к признаку, равному true, если файл текстового шрифта интерпретируется как запись формы, и равному false, если он интерпретируется как текстовая запись.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.TextStyleTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!