Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DiametricDimension.LeaderLength
 Послать отзыв
 Свойство задает или получает длину от точки диаметра до точки начала полки диаметрального размера.
 Синтаксис
C#
Visual Basic
Копировать Код
public double LeaderLength;
Копировать Код
Public Property LeaderLength() As Double
 Возвращает
 Возвращает длину от точки диаметра до точки начала полки. Тип double.
 Описание
 Свойство задает или получает длину от точки диаметра до точки начала полки диаметрального размера.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.DiametricDimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!