Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CubicSplineCurve3d
 Послать отзыв
 Класс CubicSplineCurve3d представляет интерполяционный кубический сплайн в трехмерном пространстве.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Geometry::Entity3d Teigha::Geometry::Curve3d Teigha::Geometry::SplineEntity3d Teigha::Geometry::CubicSplineCurve3d
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdGeCubicSplineCurve3d")] public sealed class CubicSplineCurve3d : SplineEntity3d
Копировать Код
<Wrapper("OdGeCubicSplineCurve3d")> Public NotInheritable Class CubicSplineCurve3d Inherits SplineEntity3d
 Описание
 Класс CubicSplineCurve3d представляет интерполяционный кубический сплайн в трехмерном пространстве.
 Методы
 Конструкторы
 Teigha.Geometry.CubicSplineCurve3d
 Имя
 Описание
 CubicSplineCurve3d
 Это обзор перегрузок CubicSplineCurve3d.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Geometry.Entity3d
 Имя
 Описание
 Entity3d Методы
 Ниже перечислены методы класса Entity3d.
 Teigha.Geometry.Curve3d
 Имя
 Описание
 Curve3d Методы
 Ниже перечислены методы класса Curve3d.
 Curve3d Свойства
 Ниже перечислены свойства класса Curve3d.
 Teigha.Geometry.SplineEntity3d
 Имя
 Описание
 SplineEntity3d Методы
 Ниже перечислены методы класса SplineEntity3d.
 SplineEntity3d Свойства
 Ниже перечислены свойства класса SplineEntity3d.
 Teigha.Geometry.CubicSplineCurve3d
 Имя
 Описание
 CubicSplineCurve3d Методы
 Ниже перечислены методы класса CubicSplineCurve3d.
 CubicSplineCurve3d Свойства
 Ниже перечислены свойства класса CubicSplineCurve3d.
 Ссылки
 CubicSplineCurve3d Конструктор, CubicSplineCurve3d Методы, CubicSplineCurve3d Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!