Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.UpdateDataLink
 Послать отзыв
 Метод предназначен для обновления ссылки на внешние данные в указанной ячейке.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void UpdateDataLink( int row, int column, UpdateDirection dir, UpdateOption option );
Копировать Код
Public virtual Sub UpdateDataLink( row As Integer, column As Integer, dir As UpdateDirection, option As UpdateOption )
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 dir
 Направление обновления. Значение из перечисления Teigha.DatabaseServices.UpdateDirection.
 option
 Опции обновления. Значение из перечисления Teigha.DatabaseServices.UpdateOption.
 col
 Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
 Описание
 Метод позволяет обновить в указанной ячейке ссылку на внешние данные. Ячейка задается индексами строки и столбца. Метод поддерживает настройку направления и опций обновления.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!