Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Matrix2d.Inverse
 Послать отзыв
 Метод предоставляет матрицу, которая является обратной для данной матрицы.
 Синтаксис
C#
Visual Basic
Копировать Код
public Matrix2d Inverse();
Копировать Код
Public Function Inverse() As Matrix2d
 Возвращает
 Возвращает обратную матрицу. Тип Matrix2d.
 Описание
 Метод предоставляет матрицу, которая является обратной для данной матрицы.
 Ссылки
 Teigha.Geometry.Matrix2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!