Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbCurve2d.FitData
 Послать отзыв
 Свойство FitData представляет все определяющие данные, использованные для построения сплайна.
 Синтаксис
C#
Visual Basic
Копировать Код
public NurbCurve2dFitData FitData;
Копировать Код
Public ReadOnly Property FitData As NurbCurve2dFitData
 Возвращает
 Возвращает определяющие данные, использованные для построения сплайна. Тип NurbCurve2dFitData.
 Описание
 Свойство FitData представляет все определяющие данные, использованные для построения сплайна.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.NurbCurve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!