Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Shadedif
 Послать отзыв
 Синтаксис
C#
Visual Basic
public int Shadedif;
Public Property Shadedif() As Integer
 Описание
 Обеспечивает доступ к текущему значению SHADEDIF для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!