Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve3d.IsOn
 Послать отзыв
 Метод позволяет установить, находится ли указанная точка на данной кривой.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsOn( Point3d point );
Копировать Код
Public Function IsOn( point As Point3d ) As Boolean
 Параметры
 Параметры
 Описание
 point
 Произвольная точка Point3d.
 Возвращает
 Возвращает true в случае, если указанная точка находится на данной кривой, иначе - false.
 Описание
 Метод позволяет установить, находится ли указанная точка на данной кривой. Параметр point содержит значимые данные только тогда, когда метод возвращает значение true.
 Реализация метода использует вызов Curve3d.IsOn(Point3d point, Tolerance tolerance) с допуском, равным Tolerance.Global.
 Ссылки
 Teigha.Geometry.Curve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!