Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.SurfaceSurfaceIntersectorConfigurations.Surface1Right
 Послать отзыв
 Свойство Surface1Right представляет конфигурацию первой поверхности справа от кривой пересечения.
 Синтаксис
C#
Visual Basic
Копировать Код
public SurfaceSurfaceIntersectorConfiguration Surface1Right;
Копировать Код
Public ReadOnly Property Surface1Right As SurfaceSurfaceIntersectorConfiguration
 Возвращает
 Возвращает конфигурацию первой поверхности справа от кривой пересечения. Тип SurfaceSurfaceIntersectorConfiguration.
 Описание
 Свойство Surface1Right представляет конфигурацию первой поверхности справа от кривой пересечения.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.SurfaceSurfaceIntersectorConfigurations, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!