Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbCurve2dData.ControlPoints
 Послать отзыв
 Свойство ControlPoints представляет коллекцию управляющих вершин NURBS кривой.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point2dCollection ControlPoints;
Копировать Код
Public ReadOnly Property ControlPoints As Point2dCollection
 Возвращает
 Возвращает коллекцию управляющих вершин кривой. Тип Point2dCollection.
 Описание
 Свойство ControlPoints представляет коллекцию управляющих вершин NURBS кривой.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.NurbCurve2dData, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!