Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Событие Database.XrefSubCommandStart
 Послать отзыв
 Синтаксис
C#
Visual Basic
public event XrefSubCommandStartEventHandler XrefSubCommandStart;
Public Event XrefSubCommandStart As XrefSubCommandStartEventHandler
 Описание
 Событие посылается при начале выполнения подкоманды внешней ссылки.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!