Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FileDependencyManager.GetEntry
 Послать отзыв
 Метод предоставляет запись в разделе .dwg списка файловых зависимостей для указанного приложения или функции в заданном файле.
 Синтаксис
C#
Visual Basic
Копировать Код
public FileDependencyInfo GetEntry( ref String feature, ref String fullFileName );
Копировать Код
Public Function GetEntry( ByRef feature As String, ByRef fullFileName As String ) As FileDependencyInfo
 Параметры
 Параметры
 Описание
 feature
 Имя приложения или функции, создавших запись. Тип String.
 fullFileName
 Полное имя файла для искомой записи. Тип String.
 Возвращает
 Возвращает найденную запись. Тип FileDependencyInfo.
 Описание
 Метод предоставляет запись в разделе .dwg списка файловых зависимостей для указанного приложения или функции в заданном файле.
 Ссылки
 Teigha.DatabaseServices.FileDependencyManager, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!