Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AbstractViewTableRecord.DefaultLightingOn
 Послать отзыв
 Свойство DefaultLightingOn позволяет определить, включено ли освещение по умолчанию для видового экрана.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool DefaultLightingOn;
Копировать Код
Public Property DefaultLightingOn As Boolean
 Возвращает
 Возвращает true, если освещение по умолчанию включено. В противном случае возвращает false.
 Описание
 Свойство DefaultLightingOn позволяет определить, включено ли освещение по умолчанию для видового экрана.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.AbstractViewTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!