Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.ExternalBoundedSurface.IsCone
 Послать отзыв
 Свойство IsCone позволяет проверить, является ли неограниченная базовая поверхность данного объекта конусом.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsCone;
Копировать Код
Public ReadOnly Property IsCone As Boolean
 Возвращает
 Возвращает true, если неограниченная базовая поверхность является конусом. В противном случае возвращает false.
 Описание
 Свойство IsCone определяет тип неограниченной базовой поверхности данного объекта и возвращает true, если она является конусом.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.ExternalBoundedSurface, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!