Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Cone.Cone
 Послать отзыв
 Конструктор класса Cone. Создает конус с заданными центром и радиусом основания, осью конуса, косинусом и синусом угла между осью конуса и образующей, высотой конуса, а также начальным и конечным углами поворота образующей конуса.
 Синтаксис
C#
Visual Basic
Копировать Код
public Cone( double cosineAngle, double sineAngle, Point3d baseOrigin, double baseRadius, Vector3d axisOfSymmetry, Vector3d referenceAxis, ref Interval height, double startAngle, double endAngle );
Копировать Код
Public Sub New( cosineAngle As Double, sineAngle As Double, baseOrigin As Point3d, baseRadius As Double, axisOfSymmetry As Vector3d, referenceAxis As Vector3d, ByRef height As Interval, startAngle As Double, endAngle As Double )
 Параметры
 Параметры
 Описание
 cosineAngle
 Косинус угла между осью конуса и его образующей. Тип double.
 sineAngle
 Синус угла между осью конуса и его образующей. Тип double.
 baseOrigin
 Центр окружности в основании конуса. Тип Point3d.
 baseRadius
 Радиус основания конуса. Тип double.
 axisOfSymmetry
 Направление оси конуса. Тип Vector3d.
 referenceAxis
 Опорный вектор в основании конуса, задающий направление отсчета углов в основании. Тип Vector3d.
 height
 Высота конуса. Тип Interval.
 startAngle
 Начальный угол поворота образующей в радианах. Тип double.
 endAngle
 Конечный угол поворота образующей в радианах. Тип double.
 Описание
 Конструктор класса Cone. Создает конус с заданными центром и радиусом основания, осью конуса, косинусом и синусом угла между осью конуса и образующей, высотой конуса, а также начальным и конечным углами поворота образующей конуса.
 Ссылки
 Teigha.Geometry.Cone, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!