Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DataLink.GetUpdateStatus
 Послать отзыв
 Метод предоставляет статус последнего обновления ссылки на данные.
 Синтаксис
C#
Visual Basic
Копировать Код
public ErrorStatus GetUpdateStatus( out UpdateDirection pDir, out DateTime pTime, ref out String errMessage );
Копировать Код
Public Function GetUpdateStatus( pDir As out UpdateDirection%, pTime As out DateTime%, ByRef errMessage As out String ) As ErrorStatus
 Параметры
 Параметры
 Описание
 pDir
 Возвращает направление последнего обновления. Значение из перечисления UpdateDirection.
 pTime
 Возвращает время последнего обновления. Тип DateTime.
 errMessage
 Возвращает сообщение об ошибках при последнем обновлении. Тип String.
 Возвращает
 Возвращает статус операции как значение из перечисления Teigha.Runtime.ErrorStatus.
 Описание
 Метод предоставляет статус последнего обновления ссылки на данные.
 Ссылки
 Teigha.DatabaseServices.DataLink, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!