Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ResultBuffer.ResultBuffer
 Послать отзыв
 Конструктор. Создает буфер с заданным массивом типизированных значений.
 Синтаксис
C#
Visual Basic
Копировать Код
public ResultBuffer( ref params TypedValue[] values );
Копировать Код
Public Sub New( ByRef values As params TypedValue[] )
 Параметры
 Параметры
 Описание
 values
 Массив типизированных значений TypedValue[].
 Описание
 Конструктор. Создает буфер с заданным массивом типизированных значений.
 Ссылки
 Teigha.DatabaseServices.ResultBuffer, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!