Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AuditInfo.AuditInfo
 Послать отзыв
 Конструктор класса по умолчанию.
 Синтаксис
C#
Visual Basic
Копировать Код
public AuditInfo();
Копировать Код
Public Sub New()
 Описание
 Конструктор класса по умолчанию.
 Ссылки
 Teigha.DatabaseServices.AuditInfo, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!