Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SymbolUtilityServices.GetBlockModelSpaceId
 Послать отзыв
 Метод извлекает идентификатор пространства модели из таблицы предопределенных символов в указанной базе данных.
 Синтаксис
C#
Visual Basic
Копировать Код
public static ObjectId GetBlockModelSpaceId( ref Database databasePointer );
Копировать Код
Public Shared Function GetBlockModelSpaceId( ByRef databasePointer As Database ) As ObjectId
 Параметры
 Параметры
 Описание
 databasePointer
 База данных, в которой ищется идентификатор объекта. Тип Database.
 Возвращает
 Возвращает ненулевой идентификатор, представляющий пространство модели в указанной базе данных. Тип ObjectId.
 Описание
 Метод извлекает идентификатор пространства модели из таблицы предопределенных символов в указанной базе данных.
 Ссылки
 Teigha.DatabaseServices.SymbolUtilityServices, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!