Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CellBorders.Bottom
 Послать отзыв
 Свойство возвращает границу ячейки на верхней или нижней горизонтальной линиях сетки таблицы, в зависимости от направления данных в таблице.
 Синтаксис
C#
Visual Basic
Копировать Код
public CellBorder Bottom;
Копировать Код
Public Property Bottom() As CellBorder
 Возвращает
 Возвращает границу ячейки. Тип CellBorder.
 Описание
 Свойство возвращает границу ячейки на верхней или нижней горизонтальной линиях сетки таблицы, в зависимости от направления данных в таблице.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.CellBorders, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!