Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.SurfaceSurfaceIntersector.IntersectCurve
 Послать отзыв
 Метод возвращает 3D-кривую, представляющую пересечение с указанным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public Curve3d IntersectCurve( int number, bool isExternal );
Копировать Код
Public Function IntersectCurve( number As Integer, isExternal As Boolean ) As Curve3d
 Параметры
 Параметры
 Описание
 number
 Индекс кривой пересечения. Индексация начинается с нуля. Тип int.
 isExternal
 Флаг, указывающий, следует ли возвращать дескриптор внешней кривой. Тип bool. В текущей версии не реализован.
 Возвращает
 Возвращает 3D-кривую пересечения с индексом number. Тип Curve3d.
 Описание
 Метод возвращает 3D-кривую, представляющую пересечение с указанным индексом.
 Замечания
 Метод выбрасывает следующие исключения:
kXXIndexOutOfRange, если указанный методу индекс является недействительным.
kXXWrongDimensionAtIndex в случае неверной размерности указанного пересечения;
kXXUnknown, если данный объект пересечения не инициализирован.
 Ссылки
 Teigha.Geometry.SurfaceSurfaceIntersector, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!