Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Section.Normal
 Послать отзыв
 Свойство Normal представляет вектор нормали секущей плоскости.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d Normal;
Копировать Код
Public ReadOnly Property Normal As Vector3d
 Возвращает
 Возвращает вектор нормали плоскости. Тип Vector3d.
 Описание
 Свойство Normal представляет вектор нормали секущей плоскости.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Section, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!