Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeader.SetArrowSymbolId
 Послать отзыв
 Метод позволяет задать символ стрелки для указанной линии выноски.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetArrowSymbolId( int leaderLineIndex, DatabaseServices.ObjectId id );
Копировать Код
Public Sub SetArrowSymbolId( leaderLineIndex As Integer, id As DatabaseServices.ObjectId )
 Параметры
 Параметры
 Описание
 leaderLineIndex
 Индекс линии выноски. Тип int.
 id
 Идентификатор символа стрелки. Тип DatabaseServices.ObjectId.
 Описание
 Метод позволяет задать символ стрелки для линии выноски с указанным индексом.
 Ссылки
 Teigha.DatabaseServices.MLeader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!