Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FieldEvaluationOptions
 Послать отзыв
 Данное перечисление определяет варианты вычисления для поля.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum FieldEvaluationOptions { Automatic = 63, Disable = 0, OnDemand = 32, OnEtransmit = 8, OnOpen = 1, OnPlot = 4, OnRegen = 16, OnSave = 2 }
Копировать Код
Public Enum FieldEvaluationOptions Automatic = 63 Disable = 0 OnDemand = 32 OnEtransmit = 8 OnOpen = 1 OnPlot = 4 OnRegen = 16 OnSave = 2 End Enum
 Члены
 Члены
 Описание
 Disable
 Значение: 0. Отключить вычисление.
 OnOpen
 Значение: 1. Вычисление в процессе открытия чертежа.
 OnSave
 Значение: 2. Вычисление при сохранении чертежа.
 OnPlot
 Значение: 4. Вычисление в процессе печати.
 OnEtransmit
 Значение: 8. Вычисление в процессе eTransmit.
 OnRegen
 Значение: 16. Вычисление в процессе перестроения (регенерации) чертежа.
 OnDemand
 Значение: 32. Вычисление только по требованию пользователя или через API.
 Automatic
 Значение: 63. Автоматическое вычисление полей в ходе любых операций.
 Описание
 Данное перечисление определяет варианты вычисления для поля.
 Ваши комментарии по поводу этого топика: Послать отзыв!