Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DynamicDimensionData.HideIfValueIsZero
 Послать отзыв
 Свойство HideIfValueIsZero определяет, следует ли скрывать этот размер в случае нулевого значения.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool HideIfValueIsZero;
Копировать Код
Public Property HideIfValueIsZero As Boolean
 Возвращает
 Возвращает true, если динамичекий размер должен скрываться при нулевом значении. В противном случае возвращает false.
 Описание
 Свойство HideIfValueIsZero определяет, следует ли скрывать этот размер в случае нулевого значения.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.DynamicDimensionData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!