Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector3d.IsZeroLength
 Послать отзыв
 Метод позволяет проверить, является ли данный вектор нулевым в пределах заданной точности.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsZeroLength( Tolerance tolerance );
Копировать Код
Public Function IsZeroLength( tolerance As Tolerance ) As Boolean
 Параметры
 Параметры
 Описание
 tolerance
 Входная точность. Тип Tolerance.
 Возвращает
 Возвращает true, если данный вектор можно считать нулевым. В противном случае возвращает false.
 Описание
 Метод позволяет проверить, является ли данный вектор нулевым в пределах указанной точности tolerance. Возвращает true, если вектор можно считать нулевым. В противном случае возвращает false.
 Ссылки
 Teigha.Geometry.Vector3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!