Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocDependency
 Послать отзыв
 Класс AssocDependency является базовым классом для реализации ассоциативных зависимостей.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::GraphicsInterface::Drawable Teigha::DatabaseServices::DBObject Teigha::DatabaseServices::AssocDependency
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("AcDbAssocDependency")] public class AssocDependency : DBObject;
Копировать Код
<Wrapper("AcDbAssocDependency")> Public Class AssocDependency Inherits DBObject
 Описание
 Класс AssocDependency является базовым классом для реализации ассоциативных зависимостей в чертеже. Класс хранит информацию о том, какие ассоциативные действия (экземпляры AssocAction) зависят от соответствующих объектов базы данных DBObject или изменяют их. Владельцами зависимостей становятся ассоциативные действия. Зависимости подключаются к объектам базы данных как постоянные реакторы. Когда зависимый объект изменяется, он уведомляет зависимость, используя функционал постоянного реактора.
 Зависимость проверяет, актуально ли изменение, и в случае необходимости меняет свой статус, указывая, что ее необходимо перевычислить, а также изменяет статус действия-владельца, указывая, что оно также требует перевычисления. Действие, в свою очередь, меняет статус сети AssocNetwork, которой оно принадлежит.
 Базовый класс AssocDependency можно использовать и сам по себе, но предусмотрены также несколько конкретных производных классов зависимостей, которые представляют определенные виды зависимостей от конкретных объектов или подобъектов. Примерами являются зависимости от подобъектов геометрических объектов (граней, ребер, вершин), зависимости от объектов, которые предоставляют некоторое числовое значение и т.д. Скажем, зависимость геометрического объекта от подобъекта сохраняет AssocPersSubentId подобъекта и кэшированную геометрию подобъекта (скажем, координаты [x,y,z] подобъекта вершины, объект Curve ребра подобъекта и т.д.). Это дает возможность сравнивать кэшированную геометрию подобъекта с фактической, чтобы проверить, действительно ли подобъект изменился. В случае совпадения уведомление об изменении игнорируется.
 Методы
 Конструкторы
 Teigha.GraphicsInterface.Drawable
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 Drawable
 Конструктор класса Teigha.GraphicsInterface.Drawable. (Унаследован от Drawable)
 Teigha.DatabaseServices.DBObject
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 DBObject
 Конструктор. (Унаследован от DBObject)
 Teigha.DatabaseServices.AssocDependency
 Имя
 Описание
 AssocDependency
 Это обзор перегрузок AssocDependency.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.GraphicsInterface.Drawable
 Имя
 Описание
 Drawable Методы
 Ниже перечислены методы класса Drawable.
 Drawable Свойства
 Ниже перечислены свойства класса Drawable.
 Teigha.DatabaseServices.DBObject
 Имя
 Описание
 DBObject Методы
 Ниже перечислены методы класса DBObject.
 DBObject Свойства
 Ниже перечислены свойства класса DBObject.
 DBObject События
 Ниже перечислены события класса DBObject.
 Teigha.DatabaseServices.AssocDependency
 Имя
 Описание
 AssocDependency Методы
 Ниже перечислены методы класса AssocDependency.
 AssocDependency Свойства
 Ниже перечислены свойства класса AssocDependency.
 Ссылки
 AssocDependency Конструктор, AssocDependency Методы, AssocDependency Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства, DBObject События
 Ваши комментарии по поводу этого топика: Послать отзыв!