Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Extmax
 Послать отзыв
 Синтаксис
C#
Visual Basic
public Point3d Extmax;
Public Property Extmax() As Point3d
 Описание
 Возвращает или устанавливает текущее значение EXTMAX пространства модели базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!