Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Group.SetLayer
 Послать отзыв
 Метод позволяет для всех объектов данной группы задать слой с указанным идентификатором.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetLayer( DatabaseServices.ObjectId value );
Копировать Код
Public Sub SetLayer( value As DatabaseServices.ObjectId )
 Параметры
 Параметры
 Описание
 value
 Идентификатор объекта LayerTableRecord. Тип DatabaseServices.ObjectId.
 Описание
 Метод позволяет задать слой для всех объектов данной группы. После выполнения метода все объекты будут связаны со слоем с идентификатором value.
 Ссылки
 Teigha.DatabaseServices.Group, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!