Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GraphNode.Owner
 Послать отзыв
 Свойство возвращает объект Graph, которому принадлежит данный узел.
 Синтаксис
C#
Visual Basic
Копировать Код
public Graph Owner;
Копировать Код
Public ReadOnly Property Owner As Graph
 Возвращает
 Возвращает владельца данного узла. Тип Graph.
 Описание
 Свойство возвращает объект Graph, которому принадлежит данный узел.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.GraphNode, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!