Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Interferevpvs
 Послать отзыв
 Синтаксис
C#
Visual Basic
public DatabaseServices::ObjectId Interferevpvs;
Public Property Interferevpvs() As DatabaseServices.ObjectId
 Описание
 Возвращает или устанавливает визуальный стиль объектов взаимодействия, определенный в системной переменной INTERFEREVPVS для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!