Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MText.BackgroundTransparency
 Послать отзыв
 Свойство представляет прозрачность фона данного объекта MText.
 Синтаксис
C#
Visual Basic
Копировать Код
public Teigha.Colors.Transparency BackgroundTransparency;
Копировать Код
Public Property BackgroundTransparency As Teigha.Colors.Transparency
 Возвращает
 Возвращает прозрачность фона. Тип Teigha.Colors.Transparency.
 Описание
 Свойство представляет прозрачность фона данного объекта MText.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MText, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!