Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBDictionary.CopyTo
 Послать отзыв
 Копирует в данный словарь объекты из массива, начиная с указанного индекса.
 Синтаксис
C#
Visual Basic
Копировать Код
public void CopyTo( ref DBDictionaryEntry[] array, int index );
Копировать Код
Public Function CopyTo( ByRef array As DBDictionaryEntry[], index As Integer )
 Параметры
 Параметры
 Описание
 index
 Индекс элемента массива, начиная с которого копируются объекты.
 array
 Массив объектов DBDictionaryEntry, из которого копируются объекты.
 Описание
 Копирует в данный словарь объекты из массива, начиная с указанного индекса.
 Ссылки
 Teigha.DatabaseServices.DBDictionary, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!