Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.BoundBlock2d
 Послать отзыв
 Класс BoundBlock2d реализует двумерную граничную рамку геометрического объекта.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Geometry::Entity2d Teigha::Geometry::BoundBlock2d
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdGeBoundBlock2d")] public sealed class BoundBlock2d : Entity2d
Копировать Код
<Wrapper("OdGeBoundBlock2d")> Public NotInheritable Class BoundBlock2d Inherits Entity2d
 Описание
 Класс BoundBlock2d представляет реализацию двумерной граничной рамки геометрического объекта. Геометрически граничные рамки могут принимать форму как обычного прямоугольника, ориентированного по осям системы координат, так и параллелограмма.
 Методы
 Конструкторы
 Teigha.Geometry.BoundBlock2d
 Имя
 Описание
 BoundBlock2d
 Это обзор перегрузок BoundBlock2d.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Geometry.Entity2d
 Имя
 Описание
 Entity2d Методы
 Ниже перечислены методы класса Entity2d.
 Teigha.Geometry.BoundBlock2d
 Имя
 Описание
 BoundBlock2d Методы
 Ниже перечислены методы класса BoundBlock2d.
 BoundBlock2d Свойства
 Ниже перечислены свойства класса BoundBlock2d.
 Ссылки
 BoundBlock2d Конструктор, BoundBlock2d Методы, BoundBlock2d Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!