Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Material.Luminance
 Послать отзыв
 Свойство представляет значение яркости материала.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Luminance;
Копировать Код
Public Property Luminance As Double
 Возвращает
 Возвращает яркость материала. Тип double.
 Описание
 Свойство представляет значение яркости материала. Мерой воспринимаемой яркости или затемнённости поверхности материала служит интенсивность света, отражаемого поверхностью данного материала.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Material, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!