Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Matrix3d.ToString
 Послать отзыв
 Метод реализует эквивалентное представление данной матрицы в виде текстовой строки.
 Синтаксис
C#
Visual Basic
Копировать Код
public String ToString();
Копировать Код
Public Function ToString() As String
 Возвращает
 Возвращает строку. Тип String.
 Описание
 Метод реализует эквивалентное представление данной матрицы в виде текстовой строки.
 Ссылки
 Teigha.Geometry.Matrix3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!