Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Dimatfit
 Послать отзыв
 Синтаксис
C#
Visual Basic
public int Dimatfit;
Public Property Dimatfit() As Integer
 Описание
 Возвращает или устанавливает текущее значение DIMATFIT для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!