Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocArray.CreateArray
 Послать отзыв
 Метод позволяет создать объект AssocArray с заданными исходными объектами, базовой точкой и параметрами.
 Синтаксис
C#
Visual Basic
Копировать Код
public AssocArray CreateArray( ref ObjectIdCollection sourceEntities, ref VertexRef basePoint, ref AssocArrayParameters parameters );
Копировать Код
Public Function CreateArray( ByRef sourceEntities As ObjectIdCollection, ByRef basePoint As VertexRef, ByRef parameters As AssocArrayParameters ) As AssocArray
 Параметры
 Параметры
 Описание
 sourceEntities
 Коллекция идентификаторов исходных объектов. Тип ObjectIdCollection.
 basePoint
 Точка, являющаяся базовой для исходных объектов. Тип VertexRef.
 parameters
 Параметры массива. Тип AssocArrayParameters.
 Возвращает
 Возвращает новый экземпляр класса AssocArray.
 Описание
 Метод позволяет создать объект AssocArray с заданными исходными объектами, базовой точкой и параметрами. Вновь созданный объект AssocArray становится владельцем параметров.
 ///
 Ссылки
 Teigha.DatabaseServices.AssocArray, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!