Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство BlockReference.ScaleFactors
 Послать отзыв
 This is ScaleFactors, a member of class BlockReference.
 Синтаксис
C#
Visual Basic
public set ScaleFactors;
Public Property ScaleFactors() As set
 Ссылки
 Teigha.DatabaseServices.BlockReference, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!