Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CellRange.BottomRight
 Послать отзыв
 Свойство возвращает правую нижнюю ячейку диапазона.
 Синтаксис
C#
Visual Basic
Копировать Код
public Cell BottomRight;
Копировать Код
Public ReadOnly Property BottomRight As Cell
 Возвращает
 Возвращает ячейку диапазона. Тип Cell.
 Описание
 Свойство возвращает правую нижнюю ячейку диапазона.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.CellRange, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!