Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector3d.IsUnitLength
 Послать отзыв
 Метод проверяет, является ли данный вектор единичным.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsUnitLength();
Копировать Код
Public Function IsUnitLength() As Boolean
 Возвращает
 Возвращает true, если данный вектор можно считать единичным. В противном случае возвращает false.
 Описание
 Метод проверяет, является ли данный вектор единичным.
 Реализация использует вызов метода Vector3d.IsUnitLength(Tolerance tolerance) со значением аргумента tolerance, равным Tolerance.Global. Метод возвращает true, если это условие выполнено, и false в противном случае.
 Ссылки
 Teigha.Geometry.Vector3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!