Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.BoundBlock2d.GetMinimumPoint
 Послать отзыв
 Метод предоставляет минимальную точку данной граничной рамки.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point2d GetMinimumPoint();
Копировать Код
Public Function GetMinimumPoint() As Point2d
 Возвращает
 Возвращает экземпляр класса Point2d, который представляет минимальную точку граничной рамки.
 Описание
 Метод предоставляет минимальную точку данной граничной рамки.
 Ссылки
 Teigha.Geometry.BoundBlock2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!