Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.XrefComandeeredEventArgs.Id
 Послать отзыв
 Свойство Id представляет идентификатор объекта, который в данный момент находится под управлением по внешней ссылке.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectId Id;
Копировать Код
Public ReadOnly Property Id As ObjectId
 Возвращает
 Возвращает идентификатор объекта, на который указывает внешняя ссылка. Тип ObjectId.
 Описание
 Свойство Id представляет идентификатор объекта, который в данный момент находится под управлением по внешней ссылке.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.XrefComandeeredEventArgs, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!