Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.RenderGlobal.HighInfoLevel
 Послать отзыв
 Свойство HighInfoLevel позволяет проверить, отображаются ли настройки в пользовательском интерфейсе с высоким уровнем детализации.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool HighInfoLevel;
Копировать Код
Public Property HighInfoLevel As Boolean
 Возвращает
 Возвращает true, если настройки отображаются с высоким уровнем детализации. В противном случае возвращает false.
 Описание
 Свойство HighInfoLevel позволяет проверить, отображаются ли настройки в пользовательском интерфейсе с высоким уровнем детализации.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.RenderGlobal, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!