Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObject.GetField(string)
 Послать отзыв
 Метод предназначен для получения идентификатора поля с указанным названием из словаря полей.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectId GetField(String propertyName);
Копировать Код
Public Function GetField(propertyName As String) As ObjectId
 Параметры
 Параметры
 Описание
 propertyName
 Имя поля свойств объекта базы данных чертежа, которое необходимо получить. Тип string
 Возвращает
 Возвращает идентификатор указанного объекта. Тип ObjectId
 Описание
 Этот метод обеспечивает доступ к полю с указанным названием, возвращая его идентификатор.
 Ссылки
 Teigha.DatabaseServices.DBObject, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!