Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AbstractViewportData.SnapBase
 Послать отзыв
 Свойство SnapBase представляет в видовом экране базовую точку шаговой привязки относительно текущей UCS (ПСК).
 Синтаксис
C#
Visual Basic
Копировать Код
public Point2d SnapBase;
Копировать Код
Public Property SnapBase As Point2d
 Возвращает
 Возвращает базовую точку шаговой привязки. Тип Point2d.
 Описание
 Свойство SnapBase представляет положение базовой (начальной) точки шаговой привязки в данном видовом экране относительно текущей пользовательской системы координат (ПСК, UCS).
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.AbstractViewportData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!