Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CellRange.IsMerged
 Послать отзыв
 Свойство позволяет проверить, выполнено ли слияние ячеек диапазона.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool? IsMerged;
Копировать Код
Public ReadOnly Property IsMerged As Boolean?
 Возвращает
 Возвращает true, если слияние ячеек диапазона выполнено. В противном случае возвращает false.
 Описание
 Свойство позволяет проверить, выполнено ли слияние ячеек диапазона.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.CellRange, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!