Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Field.SetFieldCodeWithChildren
 Послать отзыв
 Метод позволяет задать код поля и группу вложенных (дочерних) полей для этого поля и его вложенных полей.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetFieldCodeWithChildren( ref FieldCodeWithChildren fieldCode );
Копировать Код
Public Sub SetFieldCodeWithChildren( ByRef fieldCode As FieldCodeWithChildren )
 Параметры
 Параметры
 Описание
 fieldCode
 Входной код поля и вложенные поля, которые следует задать. Тип FieldCodeWithChildren.
 Описание
 Метод позволяет задать код поля и группу вложенных (дочерних) полей для этого поля и его вложенных полей.
 Замечания
 Если это поле связано с объектом базы данных (DBObject), объект DBObject следует закрыть перед вызовом этого метода, чтобы гарантировать корректное обновление данных поля.
 Ссылки
 Teigha.DatabaseServices.Field, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!