Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SubentityId.Index
 Послать отзыв
 Свойство Index предоставляет индекс подобъекта в виде целочисленного значения.
 Синтаксис
C#
Visual Basic
Копировать Код
[Obsolete("Use the overload returning IntPtr.")] public int Index;
Копировать Код
<Obsolete("Use the overload returning IntPtr.")> Public ReadOnly Property Index As Integer
 Возвращает
 Возвращает целочисленный индекс подобъекта. Тип int.
 Описание
 Свойство Index предоставляет индекс подобъекта в виде целочисленного значения.
 Замечания
 Устарело. Рекомендуется использовать свойство Teigha.DatabaseServices.SubentityId.IndexPtr.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.SubentityId, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!