Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeader.MText
 Послать отзыв
 Свойство представляет многострочный текст, связанный с данной мультивыноской.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.MText MText;
Копировать Код
Public Property MText As DatabaseServices.MText
 Возвращает
 Возвращает объект многострочного текста. Тип DatabaseServices.MText.
 Описание
 Свойство представляет многострочный текст, связанный с данной мультивыноской.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MLeader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!