Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LoftedSurface.CrossSections
 Послать отзыв
 Свойство возвращает массив объектов, используемых в качестве профилей поперечных сечений.
 Синтаксис
C#
Visual Basic
Копировать Код
public Entity[] CrossSections;
Копировать Код
Public ReadOnly Property CrossSections As Entity()
 Возвращает
 Возвращает массив кривых поперечных сечений. Тип Entity[].
 Описание
 Свойство возвращает массив объектов, используемых в качестве профилей поперечных сечений.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.LoftedSurface, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!