Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Graph.RootNode
 Послать отзыв
 Свойство обеспечивает доступ к корневому (первому) узлу графа.
 Синтаксис
C#
Visual Basic
Копировать Код
public GraphNode RootNode;
Копировать Код
Public ReadOnly Property RootNode As GraphNode
 Возвращает
 Возвращает корневой узел графа. Тип GraphNode.
 Описание
 Свойство обеспечивает доступ к корневому (первому) узлу графа. В случае пустого графа возвращает null.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Graph, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!