Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GripData.ForcedPickOn
 Послать отзыв
 Свойство определяет, следует ли идентифицировать все объекты в пределах зоны выделения, независимо от того, получена ли точка и активны ли в данный момент какие-либо конкретные режимы объектной привязки OSNAP.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool ForcedPickOn;
Копировать Код
Public Property ForcedPickOn As Boolean
 Возвращает
 Возвращает true, если следует идентифицировать все объекты в пределах зоны выделения. В противном случае возвращает false.
 Описание
 Свойство определяет, следует ли идентифицировать все объекты в пределах зоны выделения, независимо от того, получена ли точка и активны ли в данный момент какие-либо конкретные режимы объектной привязки OSNAP.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.GripData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!