Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.Dimdec
 Послать отзыв
 Свойство задает или возвращает количество десятичных знаков после запятой в основном значении размера и допуске.
 Синтаксис
C#
Visual Basic
Копировать Код
public int Dimdec;
Копировать Код
Public Property Dimdec As Integer
 Возвращает
 Возвращает количество десятичных знаков после запятой. Тип int.
 Описание
 Свойство задает или возвращает количество десятичных знаков после запятой в основном значении размера и допуске. Если свойство Dimadec равно -1, то свойство Dimdec определяет количество десятичных знаков и для углового размера.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!