Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotSettingsValidator.GetCanonicalMediaNameList
 Послать отзыв
 Метод предоставляет коллекцию независимых от локализации (канонических) имен бумажных носителей для указанного объекта PlotSettings.
 Синтаксис
C#
Visual Basic
Копировать Код
public StringCollection GetCanonicalMediaNameList( ref PlotSettings plotSet );
Копировать Код
Public Function GetCanonicalMediaNameList( ByRef plotSet As PlotSettings ) As StringCollection
 Параметры
 Параметры
 Описание
 plotSet
 Входной объект PlotSettings.
 Возвращает
 Возвращает коллекцию независимых от локализации (канонических) имен бумажных носителей. Тип StringCollection.
 Описание
 Метод предоставляет коллекцию независимых от локализации (канонических) имен бумажных носителей для указанного объекта PlotSettings.
 Замечания
 Если какие-либо устройства печати, файлы PC3 или таблицы стилей печати изменяются после запуска приложения, то перед использованием других методов этого класса следует вызвать метод RefreshLists(), чтобы обновить списки стилей и устройств вывода.
 Ссылки
 Teigha.DatabaseServices.PlotSettingsValidator, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!