Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SweepOptionsBuilder.SetPathEntityTransform
 Послать отзыв
 Метод позволяет задать систему координат в начале/конце траектории вытягивания.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetPathEntityTransform( ref Entity pathEnt, bool displayErrorMessages );
Копировать Код
Public Sub SetPathEntityTransform( ByRef pathEnt As Entity, displayErrorMessages As Boolean )
 Параметры
 Параметры
 Описание
 pathEnt
 Объект траектории, который используется для вычисления геометрического преобразования траектории. Тип Entity.
 displayErrorMessages
 Флаг, определяющий, следует ли выводить сообщения об ошибках. Тип bool.
 Описание
 Метод позволяет задать систему координат в начале/конце траектории вытягивания.
 Ссылки
 Teigha.DatabaseServices.SweepOptionsBuilder, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!