Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.AugmentedPolylineCurve3d.SetPointAt
 Послать отзыв
 Метод позволяет задать новое положение точки с указанным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetPointAt( int index, Point3d point );
Копировать Код
Public Sub SetPointAt( index As Integer, point As Point3d )
 Параметры
 Параметры
 Описание
 index
 Входной индекс точки. Тип int.
 point
 Новые координаты точки. Тип Point3d.
 Описание
 Метод позволяет задать новое положение точки с указанным индексом.
 Ссылки
 Teigha.Geometry.AugmentedPolylineCurve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!