Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AbstractViewTableRecord.RenderMode
 Послать отзыв
 Свойство RenderMode представляет текущий режим рендеринга для объекта TableRecord.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.ViewTableRecordRenderMode RenderMode;
Копировать Код
Public Property RenderMode As DatabaseServices.ViewTableRecordRenderMode
 Возвращает
 Возвращает режим рендеринга. Значение из перечисления DatabaseServices.ViewTableRecordRenderMode.
 Описание
 Свойство RenderMode представляет текущий режим рендеринга (каркасное представление, скрытые линии, режим тонирования и т.п.).
 Замечания
 Код DXF 281.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.AbstractViewTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!