Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LayerStateManager.SetLayerStateDescription
 Послать отзыв
 Метод задает произвольную строку в качестве описания состояния слоя.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetLayerStateDescription( ref String name, ref String description );
Копировать Код
Public Function SetLayerStateDescription( ByRef name As String, ByRef description As String )
 Параметры
 Параметры
 Описание
 name
 Имя состояния слоя, у которого обновляется описание, тип String.
 Описание
 Метод задает произвольную строку (длиной до 255 символов) в качестве описания состояния слоя.
 Строка описания длиной до 256 символов, тип String.
 Ссылки
 Teigha.DatabaseServices.LayerStateManager, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!