Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SectionSettings.SetLineWeight
 Послать отзыв
 Метод позволяет задать вес линий для геометрии указанного типа.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetLineWeight( SectionType nSecType, SectionGeometry nGeometry, DatabaseServices.LineWeight nLineWeight );
Копировать Код
Public Sub SetLineWeight( nSecType As SectionType, nGeometry As SectionGeometry, nLineWeight As DatabaseServices.LineWeight )
 Параметры
 Параметры
 Описание
 nSecType
 Тип сечения. Перечисление SectionType.
 nGeometry
 Типы элементов геометрии сечения. Перечисление SectionGeometry.
 nLineWeight
 Вес линий. Перечисление DatabaseServices.LineWeight.
 Описание
 Метод позволяет задать вес (толщину) линий, используемых для построения геометрии указанного типа. Вес линий может определяться настройками родительских слоя или блока, значением по умолчанию или же задаваться конкретным числовым значением из перечисления DatabaseServices.LineWeight.
 Ссылки
 Teigha.DatabaseServices.SectionSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!