Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBDictionaryEntry.Value
 Послать отзыв
 Свойство обеспечивает доступ к идентификатору ObjectId включенного в словарь объекта документа/чертежа.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectId Value;
Копировать Код
Public Property Value() As ObjectId
 Возвращает
 Обеспечивает доступ к значению свойства Value в виде экземпляра ObjectId.
 Описание
 Свойство обеспечивает доступ к идентификатору ObjectId включенного в словарь объекта документа/чертежа.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.DBDictionaryEntry, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!