Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocArrayRectangularParameters
 Послать отзыв
 Класс предоставляет интерфейс для управления параметрами прямоугольного ассоциативного массива.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::DatabaseServices::AssocArrayParameters Teigha::DatabaseServices::AssocArrayCommonParameters Teigha::DatabaseServices::AssocArrayRectangularParameters
 Синтаксис
C#
Visual Basic
Копировать Код
[TypeDescriptionProvider("Teigha.ComponentModel.TypeDescriptionProvider`1[[Teigha.DatabaseServices.AssocArrayRectangularParameters, TD_MgdDbConstraints]], TD_MgdDbConstraints")] [Teigha.Runtime.Wrapper("AcDbAssocArrayRectangularParameters")] public class AssocArrayRectangularParameters : AssocArrayCommonParameters;
Копировать Код
<TypeDescriptionProvider("Teigha.ComponentModel.TypeDescriptionProvider`1[[Teigha.DatabaseServices.AssocArrayRectangularParameters, TD_MgdDbConstraints]], TD_MgdDbConstraints")> <Teigha.Runtime.Wrapper("AcDbAssocArrayRectangularParameters")> Public Class AssocArrayRectangularParameters Inherits AssocArrayCommonParameters
 Описание
 Класс AssocArrayRectangularParameters предоставляет интерфейс для управления параметрами прямоугольного ассоциативного массива.
 Методы
 Конструкторы
 Teigha.DatabaseServices.AssocArrayParameters
 ПоказатьInternalУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 AssocArrayParameters
 This is AssocArrayParameters, a member of class AssocArrayParameters. (Унаследован от AssocArrayParameters)
 Teigha.DatabaseServices.AssocArrayCommonParameters
 ПоказатьInternalУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 AssocArrayCommonParameters
 This is AssocArrayCommonParameters, a member of class AssocArrayCommonParameters. (Унаследован от AssocArrayCommonParameters)
 Teigha.DatabaseServices.AssocArrayRectangularParameters
 Имя
 Описание
 AssocArrayRectangularParameters
 Это обзор перегрузок AssocArrayRectangularParameters.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.DatabaseServices.AssocArrayParameters
 Имя
 Описание
 AssocArrayParameters Методы
 Ниже перечислены методы класса AssocArrayParameters.
 AssocArrayParameters Свойства
 Ниже перечислены свойства класса AssocArrayParameters.
 Teigha.DatabaseServices.AssocArrayCommonParameters
 Имя
 Описание
 AssocArrayCommonParameters Методы
 Ниже перечислены методы класса AssocArrayCommonParameters.
 AssocArrayCommonParameters Свойства
 Ниже перечислены свойства класса AssocArrayCommonParameters.
 Teigha.DatabaseServices.AssocArrayRectangularParameters
 Имя
 Описание
 AssocArrayRectangularParameters Методы
 Ниже перечислены методы класса AssocArrayRectangularParameters.
 AssocArrayRectangularParameters Свойства
 Ниже перечислены свойства класса AssocArrayRectangularParameters.
 Ссылки
 AssocArrayRectangularParameters Конструктор, AssocArrayRectangularParameters Методы, AssocArrayRectangularParameters Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!