Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DxfCode
 Послать отзыв
 Перечисление DxfCode определяет все основные групповые коды DXF.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum DxfCode { Alpha = 440, Angle = 50, ArbitraryHandle = 320, AttributePrompt = 3, AttributeTag = 2, BinaryChunk = 310, BlockName = 2, Bool = 290, CircleSides = 72, CLShapeName = 4, CLShapeText = 9, Color = 62, ColorName = 430, ColorRgb = 420, Comment = 999, ControlString = 102, DashLength = 49, Description = 3, DimBlk1 = 6, DimBlk2 = 7, DimensionAlternativePrefixSuffix = 4, DimensionBlock = 5, DimPostString = 3, DimStyleName = 3, DimVarHandle = 105, Elevation = 38, EmbeddedObjectStart = 101, End = -1, ExtendedDataAsciiString = 1000, ExtendedDataBinaryChunk = 1004, ExtendedDataControlString = 1002, ExtendedDataDist = 1041, ExtendedDataHandle = 1005, ExtendedDataInteger16 = 1070, ExtendedDataInteger32 = 1071, ExtendedDataLayerName = 1003, ExtendedDataReal = 1040, ExtendedDataRegAppName = 1001, ExtendedDataScale = 1042, ExtendedDataWorldXCoordinate = 1011, ExtendedDataWorldXDir = 1013, ExtendedDataWorldXDisp = 1012, ExtendedDataWorldYCoordinate = 1021, ExtendedDataWorldYDir = 1023, ExtendedDataWorldYDisp = 1022, ExtendedDataWorldZCoordinate = 1031, ExtendedDataWorldZDir = 1033, ExtendedDataWorldZDisp = 1032, ExtendedDataXCoordinate = 1010, ExtendedDataYCoordinate = 1020, ExtendedDataZCoordinate = 1030, ExtendedInt16 = 400, FirstEntityId = -2, GradientAngle = 460, GradientColCount = 453, GradientColVal = 463, GradientName = 470, GradientObjType = 450, GradientPatType = 451, GradientShift = 461, GradientTintType = 452, GradientTintVal = 462, Handle = 5, HardOwnershipId = 360, HardPointerId = 340, HasSubentities = 66, HeaderId = -2, Int16 = 70, Int32 = 90, Int8 = 280, Invalid = -9999, LayerLinetype = 61, LayerName = 8, LayoutName = 410, LinetypeAlign = 72, LinetypeElement = 49, LinetypeName = 6, LinetypePdc = 73, LinetypeProse = 3, LinetypeScale = 48, LineWeight = 370, MlineOffset = 49, MlineStyleName = 2, NormalX = 210, NormalY = 220, NormalZ = 230, Operator = -4, PixelScale = 47, PlotStyleNameId = 390, PlotStyleNameType = 380, PReactors = -5, Real = 40, RegAppFlags = 71, RenderMode = 281, ShapeName = 2, ShapeScale = 46, ShapeXOffset = 44, ShapeYOffset = 45, SoftOwnershipId = 350, SoftPointerId = 330, Start = 0, Subclass = 100, SymbolTableName = 2, SymbolTableRecordComments = 4, SymbolTableRecordName = 2, Text = 1, TextBigFontFile = 4, TextFontFile = 3, TextStyleName = 7, Thickness = 39, TxtSize = 40, TxtStyleFlags = 71, TxtStylePSize = 42, TxtStyleXScale = 41, UcsOrg = 110, UcsOrientationX = 111, UcsOrientationY = 112, ViewBackClip = 44, ViewFrontClip = 43, ViewHeight = 45, ViewLensLength = 42, ViewMode = 71, ViewportActive = 68, ViewportAspect = 41, ViewportGrid = 76, ViewportHeight = 40, ViewportIcon = 74, ViewportNumber = 69, ViewportSnap = 75, ViewportSnapAngle = 50, ViewportSnapPair = 78, ViewportSnapStyle = 77, ViewportTwist = 51, ViewportVisibility = 67, ViewportZoom = 73, ViewWidth = 41, Visibility = 60, XCoordinate = 10, XDataStart = -3, XDictionary = -6, XInt16 = 170, XReal = 140, XRefPath = 1, XTextString = 300, XXInt16 = 270, YCoordinate = 20, ZCoordinate = 30 }
Копировать Код
Public Enum DxfCode Alpha = 440 Angle = 50 ArbitraryHandle = 320 AttributePrompt = 3 AttributeTag = 2 BinaryChunk = 310 BlockName = 2 Bool = 290 CircleSides = 72 CLShapeName = 4 CLShapeText = 9 Color = 62 ColorName = 430 ColorRgb = 420 Comment = 999 ControlString = 102 DashLength = 49 Description = 3 DimBlk1 = 6 DimBlk2 = 7 DimensionAlternativePrefixSuffix = 4 DimensionBlock = 5 DimPostString = 3 DimStyleName = 3 DimVarHandle = 105 Elevation = 38 EmbeddedObjectStart = 101 End = -1 ExtendedDataAsciiString = 1000 ExtendedDataBinaryChunk = 1004 ExtendedDataControlString = 1002 ExtendedDataDist = 1041 ExtendedDataHandle = 1005 ExtendedDataInteger16 = 1070 ExtendedDataInteger32 = 1071 ExtendedDataLayerName = 1003 ExtendedDataReal = 1040 ExtendedDataRegAppName = 1001 ExtendedDataScale = 1042 ExtendedDataWorldXCoordinate = 1011 ExtendedDataWorldXDir = 1013 ExtendedDataWorldXDisp = 1012 ExtendedDataWorldYCoordinate = 1021 ExtendedDataWorldYDir = 1023 ExtendedDataWorldYDisp = 1022 ExtendedDataWorldZCoordinate = 1031 ExtendedDataWorldZDir = 1033 ExtendedDataWorldZDisp = 1032 ExtendedDataXCoordinate = 1010 ExtendedDataYCoordinate = 1020 ExtendedDataZCoordinate = 1030 ExtendedInt16 = 400 FirstEntityId = -2 GradientAngle = 460 GradientColCount = 453 GradientColVal = 463 GradientName = 470 GradientObjType = 450 GradientPatType = 451 GradientShift = 461 GradientTintType = 452 GradientTintVal = 462 Handle = 5 HardOwnershipId = 360 HardPointerId = 340 HasSubentities = 66 HeaderId = -2 Int16 = 70 Int32 = 90 Int8 = 280 Invalid = -9999 LayerLinetype = 61 LayerName = 8 LayoutName = 410 LinetypeAlign = 72 LinetypeElement = 49 LinetypeName = 6 LinetypePdc = 73 LinetypeProse = 3 LinetypeScale = 48 LineWeight = 370 MlineOffset = 49 MlineStyleName = 2 NormalX = 210 NormalY = 220 NormalZ = 230 Operator = -4 PixelScale = 47 PlotStyleNameId = 390 PlotStyleNameType = 380 PReactors = -5 Real = 40 RegAppFlags = 71 RenderMode = 281 ShapeName = 2 ShapeScale = 46 ShapeXOffset = 44 ShapeYOffset = 45 SoftOwnershipId = 350 SoftPointerId = 330 Start = 0 Subclass = 100 SymbolTableName = 2 SymbolTableRecordComments = 4 SymbolTableRecordName = 2 Text = 1 TextBigFontFile = 4 TextFontFile = 3 TextStyleName = 7 Thickness = 39 TxtSize = 40 TxtStyleFlags = 71 TxtStylePSize = 42 TxtStyleXScale = 41 UcsOrg = 110 UcsOrientationX = 111 UcsOrientationY = 112 ViewBackClip = 44 ViewFrontClip = 43 ViewHeight = 45 ViewLensLength = 42 ViewMode = 71 ViewportActive = 68 ViewportAspect = 41 ViewportGrid = 76 ViewportHeight = 40 ViewportIcon = 74 ViewportNumber = 69 ViewportSnap = 75 ViewportSnapAngle = 50 ViewportSnapPair = 78 ViewportSnapStyle = 77 ViewportTwist = 51 ViewportVisibility = 67 ViewportZoom = 73 ViewWidth = 41 Visibility = 60 XCoordinate = 10 XDataStart = -3 XDictionary = -6 XInt16 = 170 XReal = 140 XRefPath = 1 XTextString = 300 XXInt16 = 270 YCoordinate = 20 ZCoordinate = 30 End Enum
 Члены
 Члены
 Описание
 Alpha
 Значение: 440. Альфа.
 Angle
 Значение: 50. Угол.
 ArbitraryHandle
 Значение: 320. Произвольный дескриптор.
 AttributePrompt
 Значение: 3. Запрос атрибута.
 AttributeTag
 Значение: 2. Тэг атрибута.
 BinaryChunk
 Значение: 310. Двоичный фрагмент.
 BlockName
 Значение: 2. Имя блока.
 Bool
 Значение: 290. Логическое значение.
 CircleSides
 Значение: 72. Количество сторон окружности.
 CLShapeName
 Значение: 4. Имя скомпилированной формы.
 CLShapeText
 Значение: 9. Текст скомпилированной формы.
 Color
 Значение: 62. Цвет.
 ColorName
 Значение: 430. Имя цвета
 ColorRgb
 Значение: 420. Цвет RGB
 Comment
 Значение: 999. Комментарий
 ControlString
 Значение: 102. Управляющая строка
 DashLength
 Значение: 49. Длина штриха.
 Description
 Значение: 3. Описание.
 DimBlk1
 Значение: 6. Блок стрелки для первого конца размерной линии.
 DimBlk2
 Значение: 7. Блок стрелки для второго конца размерной линии.
 DimensionAlternativePrefixSuffix
 Значение: 4. Префикс и суффикс размера, представленного в альтернативных единицах измерения.
 DimensionBlock
 Значение: 5. Блок размера.
 DimPostString
 Значение: 3. Строка с префиксом и/или суффиксом размерного текста при использовании основных единиц измерения.
 DimStyleName
 Значение: 3. Имя размерного стиля
 DimVarHandle
 Значение: 105. Дескриптор объекта для записи DIMVAR в таблице символов.
 Elevation
 Значение: 38. Высота расположения объекта.
 EmbeddedObjectStart
 Значение: 101. Начало встроенного объекта.
 End
 Значение: -1. Конец
 ExtendedDataAsciiString
 Значение: 1000. ASCII строка в расширенных данных
 ExtendedDataBinaryChunk
 Значение: 1004. Двоичный фрагмент в расширенных данных
 ExtendedDataControlString
 Значение: 1002. Управляющая строка в расширенных данных
 ExtendedDataDist
 Значение: 1041. Значение расстояния в расширенных данных.
 ExtendedDataHandle
 Значение: 1005. Дескриптор в расширенных данных
 ExtendedDataInteger16
 Значение: 1070. 16-разрядное целое число со знаком в расширенных данных
 ExtendedDataInteger32
 Значение: 1071. 32-разрядное целое число со знаком в расширенных данных
 ExtendedDataLayerName
 Значение: 1003. Имя слоя в расширенных данных.
 ExtendedDataReal
 Значение: 1040. Действительное значение в расширенных данных.
 ExtendedDataRegAppName
 Значение: 1001. Имя зарегистрированного приложения в расширенных данных.
 ExtendedDataScale
 Значение: 1042. Масштаб в расширенных данных.
 ExtendedDataWorldXCoordinate
 Значение: 1011. X-координата в мировой системе координат (МСК, WCS) в расширенных данных.
 ExtendedDataWorldXDir
 Значение: 1013. Направление оси X в мировой системе координат (МСК, WCS) в расширенных данных.
 ExtendedDataWorldXDisp
 Значение: 1012. Смещение по оси X в WCS в расширенных данных.
 ExtendedDataWorldYCoordinate
 Значение: 1021. Y-координата в мировой системе координат (МСК, WCS) в расширенных данных.
 ExtendedDataWorldYDir
 Значение: 1023. Направление оси Y в мировой системе координат (МСК, WCS) в расширенных данных.
 ExtendedDataWorldYDisp
 Значение: 1022. Смещение по оси Y в WCS в расширенных данных.
 ExtendedDataWorldZCoordinate
 Значение: 1031. Z-координата в мировой системе координат (МСК, WCS) в расширенных данных.
 ExtendedDataWorldZDir
 Значение: 1033. Направление оси Z в мировой системе координат (МСК, WCS) в расширенных данных.
 ExtendedDataWorldZDisp
 Значение: 1032. Смещение по оси Z в WCS в расширенных данных.
 ExtendedDataXCoordinate
 Значение: 1010. X-координата в расширенных данных.
 ExtendedDataYCoordinate
 Значение: 1020. Y-координата в расширенных данных.
 ExtendedDataZCoordinate
 Значение: 1030. Z-координата в расширенных данных.
 ExtendedInt16
 Значение: 400. 16-разрядное целое число в расширенных данных
 FirstEntityId
 Значение: -2. Идентификатор первого объекта.
 GradientAngle
 Значение: 460. Угол градиента.
 GradientColCount
 Значение: 453. Количество цветов в градиенте.
 GradientColVal
 Значение: 463. Значение цвета в градиенте.
 GradientName
 Значение: 470. Имя градиента
 GradientObjType
 Значение: 450. Тип объекта градиента.
 GradientPatType
 Значение: 451. Тип градиентной заливки.
 GradientShift
 Значение: 461. Смещение градиента.
 GradientTintType
 Значение: 452. Тип оттенка градиента.
 GradientTintVal
 Значение: 462. Значение оттенка градиента.
 Handle
 Значение: 5. Дескриптор объекта.
 HardOwnershipId
 Значение: 360. Идентификатор жесткой ссылки владения объектом.
 HardPointerId
 Значение: 340. Идентификатор жесткой ссылки на указатель.
 HasSubentities
 Значение: 66. Имеет подобъекты.
 HeaderId
 Значение: -2. Идентификатор заголовка.
 Int16
 Значение: 70. 16-разрядное целое число со знаком.
 Int32
 Значение: 90. 32-разрядное целое число со знаком.
 Int8
 Значение: 280. 8-разрядное целое число со знаком.
 Invalid
 Значение: -9999. Недействительный
 LayerLinetype
 Значение: 61. Тип линий слоя.
 LayerName
 Значение: 8. Имя слоя.
 LayoutName
 Значение: 410. Имя листа.
 LinetypeAlign
 Значение: 72. Выравнивание типа линии.
 LinetypeElement
 Значение: 49. Элемент типа линии.
 LinetypeName
 Значение: 6. Имя типа линии.
 LinetypePdc
 Значение: 73. Количество элементов типов линий.
 LinetypeProse
 Значение: 3. Текстовое описание типа линии.
 LinetypeScale
 Значение: 48. Масштаб типа линии.
 LineWeight
 Значение: 370. Вес типа линии.
 MlineOffset
 Значение: 49. Смещение мультилинии.
 MlineStyleName
 Значение: 2. Имя стиля мультилинии.
 NormalX
 Значение: 210. X-компонента вектора нормали.
 NormalY
 Значение: 220. Y-компонента вектора нормали.
 NormalZ
 Значение: 230. Z-компонента вектора нормали.
 Operator
 Значение: -4. Оператор.
 PixelScale
 Значение: 47. Масштаб пикселя.
 PlotStyleNameId
 Значение: 390. Идентификатор стиля печати.
 PlotStyleNameType
 Значение: 380. Тип стиля печати.
 PReactors
 Значение: -5. Постоянные реакторы
 Real
 Значение: 40. Действительное число.
 RegAppFlags
 Значение: 71. Флаги зарегистрированного приложения.
 RenderMode
 Значение: 281. Режим рендеринга.
 ShapeName
 Значение: 2. Имя формы.
 ShapeScale
 Значение: 46. Масштаб формы.
 ShapeXOffset
 Значение: 44. X-смещение формы
 ShapeYOffset
 Значение: 45. Y-смещение формы
 SoftOwnershipId
 Значение: 350. Идентификатор мягкой ссылки владения объектом.
 SoftPointerId
 Значение: 330. Идентификатор мягкой ссылки на указатель.
 Start
 Значение: 0. Начало секции.
 Subclass
 Значение: 100. Подкласс
 SymbolTableName
 Значение: 2. Имя таблицы символов.
 SymbolTableRecordComments
 Значение: 4. Комментарии в записи таблицы символов.
 SymbolTableRecordName
 Значение: 2. Имя записи таблицы символов.
 Text
 Значение: 1. Текст.
 TextBigFontFile
 Значение: 4. Файл большого шрифта.
 TextFontFile
 Значение: 3. Файл текстового шрифта.
 TextStyleName
 Значение: 7. Имя текстового стиля.
 Thickness
 Значение: 39. Толщина.
 TxtSize
 Значение: 40. Высота текста.
 TxtStyleFlags
 Значение: 71. Флаги текстового стиля.
 TxtStylePSize
 Значение: 42. Горизонтальная ширина символов многострочного текста. Это значение всегда будет равно или меньше значения группового кода 41 (только для чтения, игнорируется, если оно указано).
 TxtStyleXScale
 Значение: 41. Масштаб текстового стиля по оси X.
 UcsOrg
 Значение: 110. Начало пользовательской системы координат.
 UcsOrientationX
 Значение: 111. Ось X пользовательской системы координат.
 UcsOrientationY
 Значение: 112. Ось Y пользовательской системы координат.
 ViewBackClip
 Значение: 44. Задняя плоскость отсечения на виде.
 ViewFrontClip
 Значение: 43. Передняя плоскость отсечения на виде.
 ViewHeight
 Значение: 45. Высота вида.
 ViewLensLength
 Значение: 42. Фокусное расстояние вида.
 ViewMode
 Значение: 71. Режим просмотра.
 ViewportActive
 Значение: 68. Видовой экран активен.
 ViewportAspect
 Значение: 41. Сторона видового экрана.
 ViewportGrid
 Значение: 76. Сетка видового экрана.
 ViewportHeight
 Значение: 40. Высота видового экрана.
 ViewportIcon
 Значение: 74. Иконка видового экрана.
 ViewportNumber
 Значение: 69. Номер видового экрана.
 ViewportSnap
 Значение: 75. Режим привязки в видовом экране.
 ViewportSnapAngle
 Значение: 50. Угол привязки в видовом экране.
 ViewportSnapPair
 Значение: 78. Плоскость изометрии для текущего видового экрана. Тип: 16-битное целое число. Допустимые значения:
 ViewportSnapStyle
 Значение: 77. Стиль привязок видового экрана.
 ViewportTwist
 Значение: 51. Поворот видового экрана.
 ViewportVisibility
 Значение: 67. Видимость видового экрана.
 ViewportZoom
 Значение: 73. Увеличение видового экрана.
 ViewWidth
 Значение: 41. Ширина видового экрана.
 Visibility
 Значение: 60. Видимость.
 XCoordinate
 Значение: 10. X-координата
 XDataStart
 Значение: -3. Начало расширенных данных.
 XDictionary
 Значение: -6. Словарь.
 XInt16
 Значение: 170. 16-разрядное целое число.
 XReal
 Значение: 140. Число с плавающей точкой двойной точности.
 XRefPath
 Значение: 1. Путь внешней ссылки.
 XTextString
 Значение: 300. Текстовая строка.
 XXInt16
 Значение: 270. 16-разрядное целое число.
 YCoordinate
 Значение: 20. Y-координата
 ZCoordinate
 Значение: 30. Z-координата
 Описание
 Перечисление DxfCode определяет все основные групповые коды DXF.
 Диапазоны групповых кодов DXF представляют определенные типы данных. Например, коды от 40 до 49 представляют собой значения данных с плавающей точкой. Для многих из этих диапазонов в перечислении представлен только первый код.
 Перечисление содержит члены с совпадающими целочисленными значениями. Например, ShapeName и BlockName имеют целочисленное значение 2. Дело в том, что один и тот же целочисленный код в разных контекстах может иметь различные интерпретации. Таким образом, каждый контекст получает в перечислении свое имя.
 Ваши комментарии по поводу этого топика: Послать отзыв!