Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Polyline2d.Straighten
 Послать отзыв
 Метод удаляет из полилинии все вершины сплайна и аппроксимирующей кривой и определяет все оставшиеся вершины в качестве простых вершин. Эта операция эквивалентна команде PEDIT с опцией "Decurve".
 Синтаксис
C#
Visual Basic
Копировать Код
public void Straighten();
Копировать Код
Public Sub Straighten()
 Описание
 Метод удаляет из полилинии все вершины сплайна и аппроксимирующей кривой и определяет все оставшиеся вершины в качестве простых вершин. Эта операция эквивалентна команде PEDIT с опцией "Decurve".
 Ссылки
 Teigha.DatabaseServices.Polyline2d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!