Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Plane.IntersectWith
 Послать отзыв
 Метод вычисляет линию пересечения данной плоскости и указанной плоскости. Используется предписанная точность.
 Синтаксис
C#
Visual Basic
Копировать Код
public Line3d IntersectWith( ref Plane otherPlane, Tolerance tolerance );
Копировать Код
Public Function IntersectWith( ByRef otherPlane As Plane, tolerance As Tolerance ) As Line3d
 Параметры
 Параметры
 Описание
 otherPlane
 Входная плоскость, линию пересечения с которой требуется вычислить. Тип Plane.
 tolerance
 Заданная геометрическая точность. Тип Tolerance.
 Возвращает
 Возвращает линию пересечения данной плоскости и плоскости otherPlane. Тип Line3d.
 Описание
 Метод вычисляет линию пересечения данной плоскости и плоскости otherPlane. Используется точность tolerance.
 Ссылки
 Teigha.Geometry.Plane, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!