Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbSurface.NumControlPointsInV
 Послать отзыв
 Свойство NumControlPointsInV представляет количество управляющих вершин в направлении V.
 Синтаксис
C#
Visual Basic
Копировать Код
public int NumControlPointsInV;
Копировать Код
Public ReadOnly Property NumControlPointsInV As Integer
 Возвращает
 Возвращает количество управляющих вершин в направлении V. Тип int.
 Описание
 Свойство NumControlPointsInV представляет количество управляющих вершин в направлении V.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.NurbSurface, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!