Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotSettings.CanonicalMediaName
 Послать отзыв
 Свойство CanonicalMediaName представляет независимое от локализации (каноническое) имя текущего настроенного бумажного носителя.
 Синтаксис
C#
Visual Basic
Копировать Код
public String CanonicalMediaName;
Копировать Код
Public ReadOnly Property CanonicalMediaName As String
 Возвращает
 Возвращает имя бумажного носителя. Тип String.
 Описание
 Свойство CanonicalMediaName представляет независимое от локализации (каноническое) имя текущего настроенного бумажного носителя.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.PlotSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!