Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.ExternalBoundedSurface.ExternalBoundedSurface
 Послать отзыв
 Конструктор по умолчанию класса ExternalBoundedSurface.
 Синтаксис
C#
Visual Basic
Копировать Код
public ExternalBoundedSurface();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса ExternalBoundedSurface.
 Создает пустой экземпляр по умолчанию с нулевым указателем на определение поверхности, неопределенным типом поверхности (другими словами, нет информации о системе, в которой была создана внешняя ограниченная поверхность) и опцией предотвращения копирования внешней поверхности.
 Ссылки
 Teigha.Geometry.ExternalBoundedSurface, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!