Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MentalRayRenderSettings.DiagnosticPhotonMode
 Послать отзыв
 Свойство DiagnosticPhotonMode представляет используемый режим фотонной диагностики.
 Синтаксис
C#
Visual Basic
Копировать Код
public GraphicsInterface.DiagnosticPhotonMode DiagnosticPhotonMode;
Копировать Код
Public Property DiagnosticPhotonMode As GraphicsInterface.DiagnosticPhotonMode
 Возвращает
 Возвращает режим фотонной диагностики как значение из перечисления GraphicsInterface.DiagnosticPhotonMode.
 Описание
 Свойство DiagnosticPhotonMode представляет используемый режим фотонной диагностики.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MentalRayRenderSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!