Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Point2d.RotateBy
 Послать отзыв
 Метод выполняет вращение этой точки вокруг заданного центра на заданный угол.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point2d RotateBy( double angle, Point2d origin );
Копировать Код
Public Function RotateBy( angle As Double, origin As Point2d ) As Point2d
 Параметры
 Параметры
 Описание
 angle
 Угол поворота в радианах. Тип double.
 origin
 Входная точка, которая служит центром вращения. Тип Point2d.
 Возвращает
 Возвращает 2D-точку, являющуюся результатом указанного вращения. Тип Point2d.
 Описание
 Метод строит 2D-точку, которая является результатом вращения этой точки вокруг центра вращения origin. Угол поворота задается аргументом angle. Положительным направлением вращения считается поворот от оси X к оси Y.
 Ссылки
 Teigha.Geometry.Point2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!