Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LinetypeTableRecord
 Послать отзыв
 Объекты этого класса представляют записи в LinetypeTable.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::GraphicsInterface::Drawable Teigha::DatabaseServices::DBObject Teigha::DatabaseServices::SymbolTableRecord Teigha::DatabaseServices::LinetypeTableRecord
 Синтаксис
C#
Visual Basic
[Wrapper("AcDbLinetypeTableRecord")] public class LinetypeTableRecord : SymbolTableRecord;
<Wrapper("AcDbLinetypeTableRecord")> Public Class LinetypeTableRecord Inherits SymbolTableRecord
 Описание
 Объекты этого класса представляют записи в LinetypeTable. Каждая из этих записей содержит информацию об одном типе линии в чертеже в базе данных.
 Внутри LinetypeTableRecord, штриховые линии (сегменты линий, которые составляют характеристику типа линий) хранятся в списке с индексом, отсчитывающимся от 0. Если тип линии является составным, то встроенные формы или текстовые строки хранятся в списке в строке с тем же индексом, что и штриховка, которая предшествует им в определении типа линии. Таким образом, всегда будет значение длины штриховки для любого корректного индекса в списке, даже если это форма или текстовая строка, разделяющие тот же самый индекс. Когда тип линии уточняется, точка вставки формы будет добавлена вместе с концом штриховки, с которым эта форма содержится под одним индексом.
 Методы
 Конструкторы
 Teigha.GraphicsInterface.Drawable
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 Drawable
 Конструктор класса Teigha.GraphicsInterface.Drawable. (Унаследован от Drawable)
 Teigha.DatabaseServices.DBObject
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 DBObject
 Конструктор. (Унаследован от DBObject)
 Teigha.DatabaseServices.SymbolTableRecord
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 SymbolTableRecord
 This is SymbolTableRecord, a member of class SymbolTableRecord. (Унаследован от SymbolTableRecord)
 Teigha.DatabaseServices.LinetypeTableRecord
 Имя
 Описание
 LinetypeTableRecord
 Это обзор перегрузок LinetypeTableRecord.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.GraphicsInterface.Drawable
 Имя
 Описание
 Drawable Методы
 Ниже перечислены методы класса Drawable.
 Drawable Свойства
 Ниже перечислены свойства класса Drawable.
 Teigha.DatabaseServices.DBObject
 Имя
 Описание
 DBObject Методы
 Ниже перечислены методы класса DBObject.
 DBObject Свойства
 Ниже перечислены свойства класса DBObject.
 DBObject События
 Ниже перечислены события класса DBObject.
 Teigha.DatabaseServices.SymbolTableRecord
 Имя
 Описание
 SymbolTableRecord Свойства
 Ниже перечислены свойства класса SymbolTableRecord.
 Teigha.DatabaseServices.LinetypeTableRecord
 Имя
 Описание
 LinetypeTableRecord Методы
 Ниже перечислены методы класса LinetypeTableRecord.
 LinetypeTableRecord Свойства
 Ниже перечислены свойства класса LinetypeTableRecord.
 Ссылки
 LinetypeTableRecord Конструктор, LinetypeTableRecord Методы, LinetypeTableRecord Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства, DBObject События
 Ваши комментарии по поводу этого топика: Послать отзыв!