Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DgnUnderlayItem.ShowRasterRef
 Послать отзыв
 Свойство позволяет определить, отображаются ли растровые изображения в файлах DGN, на которые имеются ссылки.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool ShowRasterRef;
Копировать Код
Public Property ShowRasterRef() As Boolean
 Возвращает
 Возвращает true, если растровые изображения в файлах DGN будут отображаться. В противном случае возвращает false.
 Описание
 Свойство позволяет определить, отображаются ли растровые изображения в файлах DGN, на которые имеются ссылки.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.DgnUnderlayItem, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!