Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Ole2Frame.setHimetricSize
 Послать отзыв
 Метод задает значения необрабатываемым полям. В текущей версии не используется, в будущих релизах будет удален или переименован.
 Синтаксис
C#
Visual Basic
Копировать Код
public void setHimetricSize( short Width, short Height );
Копировать Код
Public Sub setHimetricSize( Width As Short, Height As Short )
 Параметры
 Параметры
 Описание
 Width
 Ширина окна. Тип short.
 Height
 Высота окна. Тип short.
 Описание
 Метод задает значения необрабатываемым полям. В текущей версии не используется, в будущих релизах будет удален или переименован.
 Ссылки
 Teigha.DatabaseServices.Ole2Frame, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!