Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Делегат Teigha.DatabaseServices.LayerStateEventHandler
 Послать отзыв
 This is type Teigha::DatabaseServices::LayerStateEventHandler.
 Синтаксис
C#
Visual Basic
public delegate LayerStateEventHandler();
Public Delegate Sub LayerStateEventHandler()
 Ваши комментарии по поводу этого топика: Послать отзыв!