Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Dimdle
 Послать отзыв
 Синтаксис
C#
Visual Basic
public double Dimdle;
Public Property Dimdle() As Double
 Описание
 Возвращает или устанавливает текущее значение DIMDLE для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!