Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.RenderEnvironment.DoubleRangeParameter.Far
 Послать отзыв
 Свойство Far представляет расстояние для дальнего тумана.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Far;
Копировать Код
Public ReadOnly Property Far As Double
 Возвращает
 Возвращает дистанцию для дальнего тумана. Тип double.
 Описание
 Свойство Far представляет расстояние для дальнего тумана.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.RenderEnvironment.DoubleRangeParameter, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!