Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Cylinder.IsClosed
 Послать отзыв
 Метод позволяет убедиться, что с переданной в метод точностью основание данного цилиндра можно считать полной окружностью.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsClosed( Tolerance tolerance );
Копировать Код
Public Function IsClosed( tolerance As Tolerance ) As Boolean
 Параметры
 Параметры
 Описание
 tolerance
 Заданная геометрическая точность. Тип Tolerance.
 Возвращает
 Возвращает true, если с указанной точностью основание данного цилиндра можно считать полной окружностью. В противном случае возвращает false.
 Описание
 Метод позволяет убедиться, что с переданной в метод точностью основание данного цилиндра можно считать полной окружностью.
 Ссылки
 Teigha.Geometry.Cylinder, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!