Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Point3AngularDimension.CenterPoint
 Послать отзыв
 Свойство CenterPoint предоставляет доступ к трехмерным координатам (WCS) вершины угла данного размера.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d CenterPoint;
Копировать Код
Public Property CenterPoint As Point3d
 Возвращает
 Возвращает точку вершины угла в мировой системе координат (WCS). Тип Point3d.
 Описание
 Свойство CenterPoint предоставляет доступ к трехмерным координатам (WCS) вершины угла данного размера.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Point3AngularDimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!