Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Polyline.NumberOfVertices
 Послать отзыв
 Синтаксис
C#
Visual Basic
public int NumberOfVertices;
Public Property NumberOfVertices() As Integer
 Описание
 Возвращает количество вершин полилинии.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.Polyline, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!