Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LineAngularDimension2.xLine1Start
 Послать отзыв
 Свойство представляет начальную точку первой опорной линии данного размера.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d xLine1Start;
Копировать Код
Public Property xLine1Start As Point3d
 Возвращает
 Возвращает начальную точку первой опорной линии размера. Тип Point3d.
 Описание
 Свойство представляет начальную точку первой опорной линии данного размера.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.LineAngularDimension2, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!