Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocDependency.DependentOnObjectStatus
 Послать отзыв
 Свойство возвращает текущее состояние объекта DependentOnObject.
 Синтаксис
C#
Visual Basic
Копировать Код
public Teigha.Runtime.ErrorStatus DependentOnObjectStatus;
Копировать Код
Public Property DependentOnObjectStatus() As Teigha.Runtime.ErrorStatus
 Возвращает
 Возвращает состояние связанного объекта как значение из перечисления Teigha.Runtime.ErrorStatus. Возможные состояния: OK, NotInitializedYet или InvalidObjectId.
 Описание
 Свойство возвращает текущее состояние связанного объекта DependentOnObject как значение из перечисления Teigha.Runtime.ErrorStatus.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.AssocDependency, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!