Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.SurfaceSurfaceIntersector.SurfaceSurfaceIntersector
 Послать отзыв
 Конструктор класса SurfaceSurfaceIntersector. Создает объект пересечения двух указанных поверхностей, использующий геометрическую точность по умолчанию.
 Синтаксис
C#
Visual Basic
Копировать Код
public SurfaceSurfaceIntersector( ref Surface surface2, ref Surface surface1 );
Копировать Код
Public Sub New( ByRef surface2 As Surface, ByRef surface1 As Surface )
 Параметры
 Параметры
 Описание
 surface2
 Первая поверхность, участвующая в пересечении. Тип Surface.
 surface1
 Вторая поверхность, участвующая в пересечении. Тип Surface.
 Описание
 Конструктор класса SurfaceSurfaceIntersector. Создает объект пересечения двух указанных поверхностей, использующий геометрическую точность по умолчанию Geometry.Tolerance.Global.
 Замечания
 Конструктор не вычисляет геометрию пересечений указанных поверхностей. Эту задачу решают поддерживаемые данным классом запросы.
 Ссылки
 Teigha.Geometry.SurfaceSurfaceIntersector, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!