Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.NurbSurface.ControlPoints
 Послать отзыв
 Свойство возвращает коллекцию, в которой представлены управляющее вершины данной поверхности для обоих направлений u и v.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3dCollection ControlPoints;
Копировать Код
Public ReadOnly Property ControlPoints As Point3dCollection
 Возвращает
 Возвращает коллекцию управляющих вершин. Тип Point3dCollection.
 Описание
 Свойство возвращает коллекцию, в которой содержатся управляющее вершины данной поверхности (в координатах WCS) для обоих направлений u и v.
 Точки в коллекции представлены по строкам. Например, если поверхность имеет uCount управляющих вершин в направлении u и vCount управляющих вершин в направлении v, то последовательность управляющих вершин в коллекции имеет вид [0,0], [0,1], ...[0,vCount-1] , ..., [uCount-1,0], [uCount-1,1], ...[uCount-1,vCount-1].
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.NurbSurface, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!