Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocArrayCommonParameters.RowSpacing
 Послать отзыв
 Свойство обеспечивает доступ к расстоянию между рядами в массиве.
 Синтаксис
C#
Visual Basic
Копировать Код
public double RowSpacing;
Копировать Код
Public Property RowSpacing() As Double
 Возвращает
 Возвращает расстояние между рядами. Тип double.
 Описание
 Свойство обеспечивает доступ к расстоянию между рядами в массиве.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.AssocArrayCommonParameters, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!