Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBDictionary.NameAt
 Послать отзыв
 Метод ищет в словаре запись с заданным ObjectId и в случае успеха возвращает имя ключа найденной записи.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual String NameAt( DatabaseServices.ObjectId objId );
Копировать Код
Public virtual Function NameAt( objId As DatabaseServices.ObjectId ) As String
 Параметры
 Параметры
 Описание
 objId
 Идентификатор DObjectId искомого объекта.
 Возвращает
 В случае успеха возвращает имя ключа найденной записи. В противном случае возвращает пустую строку.
 Описание
 Метод ищет в словаре запись с заданным ObjectId и в случае успеха возвращает имя ключа найденной записи.
 Ссылки
 Teigha.DatabaseServices.DBDictionary, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!