Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LineEndStyle
 Послать отзыв
 Перечисление LineEndStyle определяет стиль концов линий.
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdPs.LineEndStyle")] public enum LineEndStyle { LesButt = 0, LesSquare = 1, LesRound = 2, LesDiamond = 3, LesUseObject = 4 }
Копировать Код
<Wrapper("OdPs.LineEndStyle")> Public Enum LineEndStyle LesButt = 0 LesSquare = 1 LesRound = 2 LesDiamond = 3 LesUseObject = 4 End Enum
 Члены
 Члены
 Описание
 LesButt
 Значение: 0. Линия завершается точно в конечной точке без какого-либо дополнительного оформления на конце.
 LesSquare
 Значение: 1. Конец линии обрезается под прямым углом, выходя за конечную точку на половину толщины линии (квадрат в конечной точке).
 LesRound
 Значение: 2. На конце линии отображается полукруг с центром в конечной точке (закругленный конец линии).
 LesDiamond
 Значение: 3. На конце линии отображается ромб с центром в конечной точке линии.
 LesUseObject
 Значение: 4. Конец линии оформляется предоставленным объектом.
 Описание
 Перечисление LineEndStyle определяет стиль концов линий.
 Ваши комментарии по поводу этого топика: Послать отзыв!