Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MInsertBlock.RowSpacing
 Послать отзыв
 Свойство представляет расстояние между строками изображения BlockTableRecord, отображаемого данным объектом.
 Синтаксис
C#
Visual Basic
Копировать Код
public double RowSpacing;
Копировать Код
Public Property RowSpacing As Double
 Возвращает
 Возвращает расстояние между строками. Тип double.
 Описание
 Свойство представляет расстояние между строками изображения BlockTableRecord, отображаемого данным объектом.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MInsertBlock, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!