Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocAction.Status
 Послать отзыв
 Свойство позволяет получить или установить текущий статус AssocStatus данного действия.
 Синтаксис
C#
Visual Basic
Копировать Код
public AssocStatus Status;
Копировать Код
Public Property Status() As AssocStatus
 Возвращает
 Возвращает текущий статус данного действия. Тип AssocStatus.
 Описание
 Свойство позволяет получить или установить текущий статус AssocStatus данного действия.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.AssocAction, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!