Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Planarity
 Послать отзыв
 Перечисление Planarity определяет плоскостность геометрических объектов (плоский, неплоский, линейный).
 Синтаксис
C#
Visual Basic
Копировать Код
public enum Planarity { NonPlanar = 0, Planar = 1, Linear = 2 }
Копировать Код
Public Enum Planarity NonPlanar = 0 Planar = 1 Linear = 2 End Enum
 Члены
 Члены
 Описание
 NonPlanar
 Значение: 0. Объект не является плоским.
 Planar
 Значение: 1. Объект является плоским.
 Linear
 Значение: 2. Объект является линейным.
 Описание
 Перечисление Planarity определяет плоскостность геометрических объектов.
 Ваши комментарии по поводу этого топика: Послать отзыв!