Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DwgFiler.ReadByte
 Послать отзыв
 Метод возвращает 8-разрядное целое число без знака (байт) из текущего элемента этого объекта Filer.
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract byte ReadByte();
Копировать Код
Public MustOverride Function ReadByte() As Byte
 Возвращает
 Возвращает значение типа UInt8 из текущего элемента этого объекта Filer.
 Описание
 Метод возвращает 8-разрядное целое число без знака (байт) из текущего элемента этого объекта Filer.
 Ссылки
 Teigha.DatabaseServices.DwgFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!