Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.CameraHeight
 Послать отзыв
 Синтаксис
C#
Visual Basic
public double CameraHeight;
Public Property CameraHeight() As Double
 Описание
 Возвращает или устанавливает текущее значение системной переменной CAMERAHEIGHT (значение этой переменной используется как значение по умолчанию при создании новой камеры).
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!