Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.HighlightOverrule.SetCustomFilter
 Послать отзыв
 Включает режим использования метода IsApplicable базового класса Overrule, чтобы установить допустимость применения объектных переопределений.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetCustomFilter();
Копировать Код
Public Sub SetCustomFilter()
 Описание
 Включает режим использования метода IsApplicable базового класса Overrule, чтобы установить допустимость применения объектных переопределений.
 Ссылки
 Teigha.DatabaseServices.HighlightOverrule, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!