Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GripData.GetHoverDimensionData
 Послать отзыв
 Метод позволяет получить данные подсвеченного размера.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual DynamicDimensionDataCollection GetHoverDimensionData( double dimScale );
Копировать Код
Public Overridable Function GetHoverDimensionData( dimScale As Double ) As DynamicDimensionDataCollection
 Параметры
 Параметры
 Описание
 dimScale
 Масштаб размера. Тип double.
 Возвращает
 Возвращает данные подсвеченного размера. Тип DynamicDimensionDataCollection.
 Описание
 Метод позволяет получить данные подсвеченного размера.
 Ссылки
 Teigha.DatabaseServices.GripData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!