Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DimStyleTable
 Послать отзыв
 Класс предназначен для хранения определений размерных стилей в базе данных чертежа.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::GraphicsInterface::Drawable Teigha::DatabaseServices::DBObject Teigha::DatabaseServices::SymbolTable Teigha::DatabaseServices::DimStyleTable
 Синтаксис
C#
Visual Basic
[Wrapper("AcDbDimStyleTable")] public class DimStyleTable : SymbolTable;
<Wrapper("AcDbDimStyleTable")> Public Class DimStyleTable Inherits SymbolTable
 Описание
 Класс предназначен для хранения определений размерных стилей в базе данных чертежа. Каждый размерный стиль определен записью DimStyleTableRecord, которая является вхождением коллекции DimStyleTable (таблицы размерных стилей).
 Размерные стили создаются для упрощения работы с различными видами размеров: угловыми, линейными, радиальными и т.д. Все размерные стили чертежа хранятся в таблице размерных стилей. На рисунке приведено окно размерных стилей, которое можно вызвать либо через меню nanoCAD, либо командой DIMSTYLE (она же в локализованном варианте ДИАЛРАЗМ).
 В окне слева перечислены все стили, которые есть в таблице размерных стилей.
 Пример
 В качестве примера работы с таблицей размерных стилей приведена команда DimStyleTableReading, которая открывает таблицу размерных стилей и перебирает её содержимое, выводя в командную строку название каждого стиля.
C#
 Копировать Код
public partial class Commands { [Teigha.Runtime.CommandMethod("DimStyleTableReading")] public void DimStyleTableReding() { // Получение ссылки на активный документ HostMgd.ApplicationServices.Document doc = HostMgd.ApplicationServices.Application.DocumentManager.MdiActiveDocument; // Получение ссылки на редактор докумена HostMgd.EditorInput.Editor ed = doc.Editor; // Получение ссылки на базу данных документа Teigha.DatabaseServices.Database db = doc.Database; // Начало транзакции с базой данных документа using (Teigha.DatabaseServices.Transaction trans = db.TransactionManager.StartTransaction()) { // Открываем таблицу размерных стилей для чтения Teigha.DatabaseServices.DimStyleTable dimStyleTable = trans.GetObject(db.DimStyleTableId, Teigha.DatabaseServices.OpenMode.ForRead) as Teigha.DatabaseServices.DimStyleTable; // Перебираем таблицу размерных стилей в цикле foreach (Teigha.DatabaseServices.ObjectId dstr in dimStyleTable) { // Открываем каждую запись таблицы Teigha.DatabaseServices.DimStyleTableRecord obj = trans.GetObject(dstr, Teigha.DatabaseServices.OpenMode.ForRead) as Teigha.DatabaseServices.DimStyleTableRecord; // Выводим в командную строку название каждого стиля ed.WriteMessage($"nTable record name: {obj.Name} "); } trans.Abort(); } } }
Visual Basic
 Копировать Код
Partial Public Class Commands <Teigha.Runtime.CommandMethod("DimStyleTableReading")> Public Sub DimStyleTableReding() ' Получение ссылки на активный документ Dim doc As HostMgd.ApplicationServices.Document = HostMgd.ApplicationServices.Application.DocumentManager.MdiActiveDocument ' Получение ссылки на редактор документа Dim ed As HostMgd.EditorInput.Editor = doc.Editor ' Получение ссылки на базу данных документа Dim db As Teigha.DatabaseServices.Database = doc.Database ' Начало транзакции с базой данных документа Using trans As Teigha.DatabaseServices.Transaction = db.TransactionManager.StartTransaction() ' Открываем таблицу размерных стилей для чтения Dim dimStyleTable As Teigha.DatabaseServices.DimStyleTable = TryCast(trans.GetObject(db.DimStyleTableId, Teigha.DatabaseServices.OpenMode.ForRead), Teigha.DatabaseServices.DimStyleTable) ' Перебираем таблицу размерных стилей в цикле For Each dstr As Teigha.DatabaseServices.ObjectId In dimStyleTable ' Открываем каждую запись таблицы Dim obj As Teigha.DatabaseServices.DimStyleTableRecord = TryCast(trans.GetObject(dstr, Teigha.DatabaseServices.OpenMode.ForRead), Teigha.DatabaseServices.DimStyleTableRecord) ' Выводим в командную строку название каждого стиля ed.WriteMessage($"nTable record name: {obj.Name} ") Next trans.Abort() End Using End Sub End Class
 На рисунке ниже приведен пример того, как отработала команда DimStyleTableReading в новом пустом документе, где еще не созданы новые размерные стили. Соответственно, в командной строке отобразятся только размерные стили, которые есть в шаблоне dwg-документа.
 Методы
 Конструкторы
 Teigha.GraphicsInterface.Drawable
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 Drawable
 Конструктор класса Teigha.GraphicsInterface.Drawable. (Унаследован от Drawable)
 Teigha.DatabaseServices.DBObject
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 DBObject
 Конструктор. (Унаследован от DBObject)
 Teigha.DatabaseServices.SymbolTable
 ПоказатьPrivateУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 SymbolTable
 This is SymbolTable, a member of class SymbolTable. (Унаследован от SymbolTable)
 Teigha.DatabaseServices.DimStyleTable
 ПоказатьInternal
 Нет совпадений по текущему фильтру
 Имя
 Описание
 DimStyleTable
 Констурктор класса.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.GraphicsInterface.Drawable
 Имя
 Описание
 Drawable Методы
 Ниже перечислены методы класса Drawable.
 Drawable Свойства
 Ниже перечислены свойства класса Drawable.
 Teigha.DatabaseServices.DBObject
 Имя
 Описание
 DBObject Методы
 Ниже перечислены методы класса DBObject.
 DBObject Свойства
 Ниже перечислены свойства класса DBObject.
 DBObject События
 Ниже перечислены события класса DBObject.
 Teigha.DatabaseServices.SymbolTable
 Имя
 Описание
 SymbolTable Методы
 Ниже перечислены методы класса SymbolTable.
 SymbolTable Свойства
 Ниже перечислены свойства класса SymbolTable.
 Ссылки
 Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства, DBObject События
 Ваши комментарии по поводу этого топика: Послать отзыв!