Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve3d.IsOn
 Послать отзыв
 Метод позволяет установить, находится ли указанная точка на данной кривой в пределах заданного допуска.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsOn( Point3d point, out double value, Tolerance tolerance );
Копировать Код
Public Function IsOn( point As Point3d, value As out double, tolerance As Tolerance ) As Boolean
 Параметры
 Параметры
 Описание
 point
 Произвольная точка Point3d.
 value
 Выходное значение параметра для точки на кривой (если точка лежит на кривой). Тип double.
 tolerance
 Геометрический допуск. Тип Tolerance.
 Возвращает
 Возвращает true в случае, если точка point находится на данной кривой, иначе - false.
 Описание
 Метод позволяет установить, находится ли точка point на данной кривой в пределах заданного допуска tolerance. Выходной параметр value возвращает значение параметра для точки point, если она лежит на кривой, и содержит значимые данные только тогда, когда метод возвращает значение true.
 Ссылки
 Teigha.Geometry.Curve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!