Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbCurve3dFitData.FitTolerance
 Послать отзыв
 Свойство FitTolerance представляет точность аппроксимации в определяющих точках.
 Синтаксис
C#
Visual Basic
Копировать Код
public Tolerance FitTolerance;
Копировать Код
Public ReadOnly Property FitTolerance As Tolerance
 Возвращает
 Возвращает точность аппроксимации в определяющих точках. Тип Tolerance.
 Описание
 Свойство FitTolerance представляет точность аппроксимации в определяющих точках.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.NurbCurve3dFitData, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!