Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LinkedTableData.GetBlockAttributeValue
 Послать отзыв
 Метод позволяет получить значение атрибута блока, если первый элемент содержимого ячейки представляет собой блок с атрибутами.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual String GetBlockAttributeValue( int row, int column, DatabaseServices.ObjectId attributeDefinitionId );
Копировать Код
Public Overridable Function GetBlockAttributeValue( row As Integer, column As Integer, attributeDefinitionId As DatabaseServices.ObjectId ) As String
 Параметры
 Параметры
 Описание
 row
 Индекс строки. Тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 column
 Индекс столбца. Тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице.
 attributeDefinitionId
 Идентификатор объекта определения атрибута блока. Тип DatabaseServices.ObjectId.
 Возвращает
 Возвращает значение указанного атрибута блока. Тип String.
 Описание
 Метод позволяет получить значение атрибута блока, если первый элемент содержимого ячейки представляет собой блок с атрибутами.
 Замечания
 Метод выбрасывает исключение eInvalidInput, если индексы строки и/или столбца меньше 0 или больше размера таблицы.
 Ссылки
 Teigha.DatabaseServices.LinkedTableData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!