Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GraphNode.AddRefTo
 Послать отзыв
 Метод создаёт в данном объекте GraphNode исходящее ребро (исходящую ссылку) на указанный узел GraphNode.
 Синтаксис
C#
Visual Basic
Копировать Код
public void AddRefTo( ref GraphNode outGoingNode );
Копировать Код
Public Sub AddRefTo( ByRef outGoingNode As GraphNode )
 Параметры
 Параметры
 Описание
 outGoingNode
 Конечный узел нового ребра. Тип GraphNode.
 Описание
 Метод позволяет создать в данном объекте GraphNode исходящее ребро (исходящую ссылку) на указанный узел outGoingNode. Кроме того, метод создает в узле outGoingNode входящую ссылку на данный объект GraphNode,
 Оба узла должны принадлежать одному объекту Graph, в противном случае генерируется ошибка eInvalidOwnerObject. Значение outGoingNode не должно равняться null.
 Замечания
 Для создания в графе новых рёбер можно использовать также метод Graph.AddEdge().
 Ссылки
 Teigha.DatabaseServices.GraphNode, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!