Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ObjectTypeAttribute.ObjectTypeAttribute
 Послать отзыв
 Конструктор класса ObjectTypeAttribute.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectTypeAttribute( ref Type type );
Копировать Код
Public Sub New( ByRef type As Type )
 Параметры
 Параметры
 Описание
 type
 Входной тип объекта. Тип Type.
 Описание
 Конструктор класса ObjectTypeAttribute.
 Ссылки
 Teigha.DatabaseServices.ObjectTypeAttribute, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!