Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.NewLayerNotification
 Послать отзыв
 Перечисление NewLayerNotification определяет допустимые значения переменной заголовка LAYERNOTIFY.
 Синтаксис
C#
Visual Basic
Копировать Код
[Flags] public enum NewLayerNotification { NoNewLayerNotification = 0, NotifyOnPlot = 1, NotifyOnOpen = 2, NotifyOnXrefAttachAndReload = 4, NotifyOnLayerStateRestore = 8, NotifyOnSave = 16, NotifyOnInsert = 32 }
Копировать Код
<Flags> Public Enum NewLayerNotification NoNewLayerNotification = 0 NotifyOnPlot = 1 NotifyOnOpen = 2 NotifyOnXrefAttachAndReload = 4 NotifyOnLayerStateRestore = 8 NotifyOnSave = 16 NotifyOnInsert = 32 End Enum
 Члены
 Члены
 Описание
 NoNewLayerNotification
 Значение: 0. Все состояния уведомлений отключены.
 NotifyOnInsert
 Значение: 32 = 0x20. Выводить уведомление всякий раз, когда новые слои создаются при вставке блока.
 NotifyOnLayerStateRestore
 Значение: 8. Выводить уведомление всякий раз, когда новые слои создаются вследствие восстановления состояния слоя.
 NotifyOnOpen
 Значение: 2. Выводить уведомление всякий раз, когда новые слои существуют при первом открытии чертежа.
 NotifyOnPlot
 Значение: 1. Выводить уведомление всякий раз, когда новые слои существуют и должен начаться вывод чертежа на плоттер.
 NotifyOnSave
 Значение: 16 = 0x10. Выводить уведомление всякий раз, когда новые слои существуют, и в данный момент идет сохранение чертежа.
 NotifyOnXrefAttachAndReload
 Значение: 4. Выводить уведомление всякий раз, когда новые слои существуют во внешней ссылке, которая на данный момент вставлена или перезагружена.
 Описание
 Перечисление NewLayerNotification определяет допустимые значения переменной заголовка LAYERNOTIFY. Эта переменная определяет условия, когда выводятся предупреждения об обнаружении несогласованных новых слоев.
 Ваши комментарии по поводу этого топика: Послать отзыв!