Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Light.IsPlottable
 Послать отзыв
 Свойство позволяет проверить, отображается ли этот источник света при печати.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsPlottable;
Копировать Код
Public Property IsPlottable As Boolean
 Возвращает
 Возвращает true, если источник при печати отображается. В противном случае возвращает false.
 Описание
 Свойство позволяет проверить, отображается ли этот источник света при печати.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Light, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!