Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.TableHitTestType
 Послать отзыв
 Данное перечисление определяет возможные результаты проверки попадания в таблицу.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum TableHitTestType { None = 0, Cell = 1 }
Копировать Код
Public Enum TableHitTestType None = 0 Cell = 1 End Enum
 Члены
 Члены
 Описание
 Cell
 Значение: 1. Попадание в одну из ячеек таблицы.
 None
 Значение: 0. Попадание мимо таблицы.
 Описание
 Данное перечисление определяет возможные результаты проверки попадания в таблицу.
 Ваши комментарии по поводу этого топика: Послать отзыв!