Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CustomScale
 Послать отзыв
 Этот класс предназначен для хранения значений числителя и знаменателя, используемых для формирования пользовательского масштаба печати.
 Иерархия классов
Teigha::DatabaseServices::CustomScale
 Синтаксис
C#
Visual Basic
Копировать Код
[StructLayout(LayoutKind.Sequential)] public class CustomScale;
Копировать Код
<StructLayout(LayoutKind.Sequential)> Public Class CustomScale
 Описание
 Этот класс предназначен для хранения значений числителя и знаменателя, используемых для формирования пользовательского масштаба печати.
 Методы
 Конструкторы
 Имя
 Описание
 CustomScale
 Конструктор класса CustomScale.
 Топики
 Имя
 Описание
 CustomScale Методы
 Ниже перечислены методы класса CustomScale.
 CustomScale Операторы
 Ниже перечислены операторы класса CustomScale.
 CustomScale Свойства
 Ниже перечислены свойства класса CustomScale.
 Ссылки
 CustomScale Методы, CustomScale Операторы, CustomScale Свойства, Методы, Топики, CustomScale Методы, CustomScale Операторы, CustomScale Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!