Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Делегат Teigha.DatabaseServices.BeginWblockObjectsEventHandler
 Послать отзыв
 This is type Teigha::DatabaseServices::BeginWblockObjectsEventHandler.
 Синтаксис
C#
Visual Basic
public delegate BeginWblockObjectsEventHandler();
Public Delegate Sub BeginWblockObjectsEventHandler()
 Ваши комментарии по поводу этого топика: Послать отзыв!