Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Entity.ExplodeGeometryToBlock(BlockTableRecord
 Послать отзыв
 Метод разбивает этот объект на набор более простых объектов, добавляет их в указанный блок и записывает идентификаторы созданных объектов в коллекцию objIdCollection.
 Синтаксис
C#
Visual Basic
Копировать Код
public void ExplodeGeometryToBlock(BlockTableRecord btr, ObjectIdCollection objIdCollection);
Копировать Код
Public Sub ExplodeGeometryToBlock(btr As BlockTableRecord, objIdCollection As ObjectIdCollection)
 Параметры
 Параметры
 Описание
 btr
 Блок, в который будет добавлен набор объектов, полученных в результате разбиения данного. Тип BlockTableRecord
 objIdCollection
 Коллекция, в которую записываются идентификаторы созданных объектов. Может содержать элементы до выполнения метода. В этом случает новые элементы добавляются в конец коллекции. Тип ObjectIdCollection
 Описание
 Метод раздивает этот объект на более простые объекты, добавляет их в указанный блок и записывает в коллекцию идентификаторы созданных объектов. Cозданные объекты могут являться или не являться резидентами базы данных в зависимости от владельца блока (BlockTableRecord). Если BlockTableRecord является резидентом базы данных, то созданные объекты также будут резидентами базы данных. Если BlockTableRecord не является резидентом базы данных, то созданные объекты также не будут резидентами базы данных.
 Идентификаторы объектов, которые получились в результате разбиения, добавляются в указанную коллекцию. Стандартная реализация этой функции вызывает subWorldDraw() и создает сущности из геометрии, сгенерированной subWorldDraw(). Этот метод может быть переопределен в пользовательских классах.
 Ссылки
 Teigha.DatabaseServices.Entity, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!