Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SymbolUtilityServices.LayerZeroName
 Послать отзыв
 Свойство LayerZeroName представляет предопределенную запись символа для имени слоя "0".
 Синтаксис
C#
Visual Basic
Копировать Код
public static String LayerZeroName;
Копировать Код
Public Shared ReadOnly Property LayerZeroName As String
 Возвращает
 Возвращает предопределенное имя слоя "0". Тип String.
 Описание
 Свойство LayerZeroName представляет предопределенную запись символа для имени слоя "0". Не может быть ни NULL, ни пустой строкой.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.SymbolUtilityServices, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!