Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Solid3dMassProperties.MomentsOfIntertia
 Послать отзыв
 Свойство MomentsOfIntertia представляет моменты инерции твердого тела относительно осей X, Y и Z.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d MomentsOfIntertia;
Копировать Код
Public ReadOnly Property MomentsOfIntertia As Vector3d
 Возвращает
 Возвращает моменты инерции твердого тела. Тип Vector3d.
 Описание
 Свойство MomentsOfIntertia представляет моменты инерции твердого тела относительно осей X, Y и Z.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Solid3dMassProperties, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!