Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CellContent.Rotation
 Послать отзыв
 Свойство Rotation контролирует угол поворота содержимого ячейки.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Rotation;
Копировать Код
Public Property Rotation As Double
 Возвращает
 Возвращает угол поворота содержимого ячейки. Тип double.
 Описание
 Свойство Rotation контролирует угол поворота содержимого ячейки.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.CellContent, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!