Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Surfv
 Послать отзыв
 Синтаксис
C#
Visual Basic
public int Surfv;
Public Property Surfv() As Integer
 Описание
 Обеспечивает доступ к текущему значению SURFV для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!