Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Assoc2dConstraintGroup.SolutionStatus
 Послать отзыв
 Метод позволяет получить статус решения, полученного для данной группы ограничений.
 Синтаксис
C#
Visual Basic
Копировать Код
public SolutionStatusType SolutionStatus( bool alsoCheckForConstraints );
Копировать Код
Public Function SolutionStatus( alsoCheckForConstraints As Boolean ) As SolutionStatusType
 Параметры
 Параметры
 Описание
 alsoCheckForConstraints
 Входной флаг, указывающий, следует ли выполнить проверку ограничений. Значение по умолчанию — true.
 Возвращает
 Возвращает элемент перечисления SolutionStatusType.
 Описание
 Метод позволяет получить статус решения, полученного для данной группы ограничений. Как правило этот метод следует вызывать только после получения решения.
 Ссылки
 Teigha.DatabaseServices.Assoc2dConstraintGroup, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!