Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbCurve3d.NurbCurve3d
 Послать отзыв
 Конструктор класса NurbCurve3d. Создает трехмерную NURBS кривую, которая интерполирует указанную трехмерную эллиптическую дугу.
 Синтаксис
C#
Visual Basic
Копировать Код
public NurbCurve3d( ref EllipticalArc3d ellipse );
Копировать Код
Public Sub New( ByRef ellipse As EllipticalArc3d )
 Параметры
 Параметры
 Описание
 ellipse
 Входная эллиптическая дуга. Тип EllipticalArc3d.
 Описание
 Конструктор класса NurbCurve3d. Создает трехмерную NURBS кривую, которая интерполирует указанную трехмерную эллиптическую дугу.
 Ссылки
 Teigha.Geometry.NurbCurve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!