Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PolylineVertex3d.PolylineVertex3d
 Послать отзыв
 Конструктор по умолчанию. Задает для вершины положение (0,0,0) и тип SimpleVertex.
 Синтаксис
C#
Visual Basic
Копировать Код
public PolylineVertex3d();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию. Задает для вершины положение (0,0,0) и тип SimpleVertex.
 Ссылки
 Teigha.DatabaseServices.PolylineVertex3d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!