Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Shadedge
 Послать отзыв
 Синтаксис
C#
Visual Basic
public int Shadedge;
Public Property Shadedge() As Integer
 Описание
 Обеспечивает доступ к текущему значению SHADEDGE для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!