Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство BlockReference.UnitFactor
 Послать отзыв
 Синтаксис
C#
Visual Basic
public double UnitFactor;
Public Property UnitFactor() As Double
 Описание
 Возвращает значение используемых единиц.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.BlockReference, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!