Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство TextStyleTableRecord.ObliquingAngle
 Послать отзыв
 Синтаксис
C#
Visual Basic
public double ObliquingAngle;
Public Property ObliquingAngle() As Double
 Описание
 Возвращает угол наклона символов для TextStyleTableRecord.
 Угол наклона текста представляет собой угол от текстовой вертикали, т.е. вершина символов наклоняется относительно их основания, как в курсиве. Положительный угол наклоняет символы вправо. К отрицательному значению добавляется 2 pi, чтобы они стали положительными.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.TextStyleTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!