Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.NumberOfSaves
 Послать отзыв
 Синтаксис
C#
Visual Basic
public int NumberOfSaves;
Public Property NumberOfSaves() As Integer
 Описание
 Возвращает или устанавливает, сколько раз сохранялась база данных в текущей сессии, или 0, если сохранение не производилось не разу.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!