Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.PointOnSurface.GetUDerivative
 Послать отзыв
 Метод вычисляет в текущей точке частную производную указанного порядка для поверхности в направлении U. В текущей версии этот метод не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d GetUDerivative( int order );
Копировать Код
Public Function GetUDerivative( order As Integer ) As Vector3d
 Параметры
 Параметры
 Описание
 order
 Порядок вычисляемой производной (1 или 2). Тип int.
 Возвращает
 Возвращает вектор частной производной порядка order в направлении U. Тип Vector3d.
 Описание
 Метод вычисляет в текущей точке частную производную порядка order для поверхности в направлении U. В текущей версии этот метод не реализован.
 Ссылки
 Teigha.Geometry.PointOnSurface, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!