Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PolygonMesh.MSize
 Послать отзыв
 Свойство предоставляет доступ к количеству вершин в направлении M.
 Синтаксис
C#
Visual Basic
Копировать Код
public short MSize;
Копировать Код
Public Property MSize() As short
 Возвращает
 Возвращает или задает значение M, тип short.
 Описание
 Свойство предоставляет доступ к количеству вершин в направлении M.
 Если тип сети PolyMeshType равен SimpleMesh, это количество вершин будет использоваться для создания М строк в PolygonMesh. Для любого другого типа сети в качестве размера строки будет использоваться поверхностная плотность M.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.PolygonMesh, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!