Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.Dimgap
 Послать отзыв
 Свойство задает или возвращает зазор между полем размерного текста и размерной линией, выносной линией или линией выноски с учетом с положения и ориентации текста.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Dimgap;
Копировать Код
Public Property Dimgap As Double
 Возвращает
 Возвращает зазор вокруг поля размерного текста. Тип double.
 Описание
 Свойство задает или возвращает зазор между полем размерного текста и размерной линией, выносной линией или линией выноски с учетом с положения и ориентации текста.
 Если свойство Dimgap равно нулю, объект размера прикрепляет поле размерного текста к размеру, выносной линии или линии выноски. Если свойство Dimgap отрицательное, вокруг поля размерного текста отображается рамка.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!