Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LayerStateManager.AbortLayerStateRename
 Послать отзыв
 Это событие создается, если прерван процесс переименования состояния слоя.
 Синтаксис
C#
Visual Basic
Копировать Код
public event LayerStateRenameEventHandler AbortLayerStateRename;
Копировать Код
Public Event AbortLayerStateRename As LayerStateRenameEventHandler
 Описание
 Это событие создается, если прерван процесс переименования состояния слоя.
 Ссылки
 Teigha.DatabaseServices.LayerStateManager, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!