Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.LineSegment2d.Length
 Послать отзыв
 Свойство Length представляет длину данного линейного сегмента.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Length;
Копировать Код
Public ReadOnly Property Length As Double
 Возвращает
 Возвращает длину линейного сегмента. Тип double.
 Описание
 Свойство Length представляет длину данного линейного сегмента (расстояние между его начальной и конечной точками).
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.LineSegment2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!