Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Entity.CollisionType
 Послать отзыв
 Свойство предназначено для получения типа взаимодействия геометрического объекта при обнаружении коллизий, что определяет его поведение в операциях, учитывающих пространственные пересечения.
 Синтаксис
C#
Visual Basic
Копировать Код
public CollisionType CollisionType;
Копировать Код
Public Property CollisionType() As CollisionType
 Возвращает
 Возвращает значение перечисления CollisionType, которое указывает, как объект участвует в обнаружении и обработке коллизий. Это значение может быть использовано в функциях, поддерживающих детектирование столкновений между объектами.
 Описание
 Свойство определяет трактовку того, как объект участвует в процессе обнаружения коллизий для данного геометрического объекта. Подклассы могут переопределять этот метод для определения того, как объекты взаимодействует в знающих о коллизиях функциях.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.Entity, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!