Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.ExternalBoundedSurface.ExternalBaseSurface
 Послать отзыв
 Свойство ExternalBaseSurface представляет внешнюю базовую поверхность в ее исходном виде.
 Синтаксис
C#
Visual Basic
Копировать Код
public Surface ExternalBaseSurface;
Копировать Код
Public ReadOnly Property ExternalBaseSurface As Surface
 Возвращает
 Возвращает внешнюю базовую поверхность. Тип Surface.
 Описание
 Свойство ExternalBaseSurface представляет внешнюю базовую поверхность в ее исходном виде. Знание точного определения внешнего объекта потенциально обеспечивает эффективный доступ к объекту в его исходном виде. Вызывающая сторона несет ответственность за высвобождение использованной при этом памяти.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.ExternalBoundedSurface, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!