Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Ellipse.Ellipse
 Послать отзыв
 Конструктор класса Ellipse по умолчанию.
 Синтаксис
C#
Visual Basic
Копировать Код
public Ellipse();
Копировать Код
Public Sub New()
 Описание
 Конструктор класса Ellipse по умолчанию. Результатом его работы является единичная окружность с центром (0,0,0).
 Ссылки
 Teigha.DatabaseServices.Ellipse, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!