Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ObjectOverrule.SetExtensionDictionaryEntryFilter
 Послать отзыв
 Метод реализует предварительную фильтрацию объектов в словаре расширений прежде чем применять переопределения.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetExtensionDictionaryEntryFilter( ref String entryName );
Копировать Код
Public Sub SetExtensionDictionaryEntryFilter( ByRef entryName As String )
 Параметры
 Параметры
 Описание
 entryName
 Имя искомой записи в словаре расширений, тип String.
 Описание
 Метод реализует предварительную фильтрацию объектов в словаре расширений прежде чем применять переопределения.
 При этом nanoCAD выполняет поиск в словаре расширений записи с именем entryName перед вызовом любого из ваших переопределений для соответствующего объекта. Если entryName отсутствует в словаре расширений, переопределения вызываться не будут.
 Ссылки
 Teigha.DatabaseServices.ObjectOverrule, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!