Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AbstractViewPE.FrontClipDistance
 Послать отзыв
 Свойство FrontClipDistance представляет положение передней плоскости отсечения вида.
 Синтаксис
C#
Visual Basic
Копировать Код
public double FrontClipDistance;
Копировать Код
Public Property FrontClipDistance As Double
 Возвращает
 Возвращает положение передней плоскости отсечения вида. Тип double.
 Описание
 Свойство FrontClipDistance представляет положение передней плоскости отсечения вида.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.AbstractViewPE, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!