Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MeshFaceterData.MeshFaceterData
 Послать отзыв
 Конструктор структуры MeshFaceterData.
 Синтаксис
C#
Visual Basic
Копировать Код
public MeshFaceterData( double surface, double normal, double gRatio, double eLength, unsigned short numGrid, unsigned short uGrid, unsigned short vGrid, short mType );
Копировать Код
Public Sub New( surface As Double, normal As Double, gRatio As Double, eLength As Double, numGrid As unsigned short, uGrid As unsigned short, vGrid As unsigned short, mType As short )
 Параметры
 Параметры
 Описание
 surface
 Значение, представляющее отклонение сети от грани. Тип double.
 normal
 Угол между соседними гранями сети. Тип double.
 gRatio
 Максимальное соотношение сторон для четырехугольников сети. Тип double.
 eLength
 Максимальная длина ребра. Тип double.
 numGrid
 Максимальное количество используемых линий сети. Тип unsigned short.
 uGrid
 Минимальное значение параметра U для линий сети. Тип unsigned short.
 vGrid
 Минимальное значение параметра V для линий сети. Тип unsigned short.
 mType
 Геометрический тип граней сети. Тип short. Допустимы следующие типы: 0 - только четырехугольные грани, 1 - смешанный тип (треугольные и четырехугольные грани), 2 - только треугольные грани.
 Описание
 Конструктор структуры MeshFaceterData. Создает новый экземпляр класса, используя указанные значения параметров.
 Ссылки
 Teigha.DatabaseServices.MeshFaceterData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!