Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotSettingsValidator
 Послать отзыв
 Этот класс определяет методы, которые позволяют проверить данные для настроек печати в объекте PlotSettings до фактического переопределения этих настроек в объектах.
 Иерархия классов
Teigha::DatabaseServices::PlotSettingsValidator
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdDbPlotSettingsValidator")] public sealed class PlotSettingsValidator : DisposableWrapper
Копировать Код
<Wrapper("OdDbPlotSettingsValidator")> Public NotInheritable Class PlotSettingsValidator Inherits DisposableWrapper
 Описание
 Этот класс определяет методы, которые позволяют проверить данные для настроек печати в объекте PlotSettings до фактического переопределения этих настроек в объектах.
 Топики
 Имя
 Описание
 PlotSettingsValidator Методы
 Ниже перечислены методы класса PlotSettingsValidator.
 PlotSettingsValidator Свойства
 Ниже перечислены свойства класса PlotSettingsValidator.
 Ссылки
 PlotSettingsValidator Методы, PlotSettingsValidator Свойства, Топики, PlotSettingsValidator Методы, PlotSettingsValidator Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!