Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Graph.Graph
 Послать отзыв
 Конструктор класса Graph. Создает новый объект Graph с указанным корневым узлом.
 Синтаксис
C#
Visual Basic
Копировать Код
public Graph( ref GraphNode root );
Копировать Код
Public Sub New( ByRef root As GraphNode )
 Параметры
 Параметры
 Описание
 root
 Корневой узел графа. Тип GraphNode.
 Описание
 Конструктор класса Graph. Создает новый объект Graph с указанным корневым узлом root.
 Ссылки
 Teigha.DatabaseServices.Graph, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!