Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.WblockNoticeEventArgs.To
 Послать отзыв
 Свойство To представляет базу данных, в которую записываются данные.
 Синтаксис
C#
Visual Basic
Копировать Код
public Database To;
Копировать Код
Public ReadOnly Property To As Database
 Возвращает
 Возвращает целевую базу данных. Тип Database.
 Описание
 Свойство To представляет базу данных, в которую записываются данные.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.WblockNoticeEventArgs, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!