Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.GetDataLink
 Послать отзыв
 Метод позволяет получить коллекцию ссылок на подлинкованные данные, если таблица связана с источником данных по ссылке.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual ObjectIdCollection GetDataLink();
Копировать Код
Public virtual Function GetDataLink() As ObjectIdCollection
 Возвращает
 Возвращает коллекцию типа ObjectIdCollection.
 Описание
 Метод позволяет получить коллекцию ссылок на подлинкованные данные, если таблица связана с источником данных по ссылке.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!