Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Событие Database.SystemVariableWillChange
 Послать отзыв
 Синтаксис
C#
Visual Basic
public event SystemVariableChangingEventHandler SystemVariableWillChange;
Public Event SystemVariableWillChange As SystemVariableChangingEventHandler
 Описание
 Событие показывает, что делается попытка изменить значение системной переменной.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!