Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.TableStyle.UnitType
 Послать отзыв
 Метод позволяет получить тип единиц измерения, назначенный для строк указанного типа.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual DatabaseServices.UnitType UnitType( RowType rowType );
Копировать Код
Public Overridable Function UnitType( rowType As RowType ) As DatabaseServices.UnitType
 Параметры
 Параметры
 Описание
 rowType
 Тип строки таблицы. Перечисление RowType.
 Возвращает
 Возвращает тип единиц измерения. Перечисление DatabaseServices.UnitType.
 Описание
 Метод позволяет получить тип единиц измерения, назначенный для строк указанного типа.
 Ссылки
 Teigha.DatabaseServices.TableStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!