Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ProxyEntity.GraphicsMetafileType
 Послать отзыв
 Свойство GraphicsMetafileType представляет тип графического метафайла данного прокси-объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.GraphicsMetafileType GraphicsMetafileType;
Копировать Код
Public ReadOnly Property GraphicsMetafileType As DatabaseServices.GraphicsMetafileType
 Возвращает
 Возвращает тип графического метафайла. Значение из перечисления DatabaseServices.GraphicsMetafileType.
 Описание
 Свойство GraphicsMetafileType представляет тип графического метафайла данного прокси-объекта.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.ProxyEntity, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!