Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CellContent.HasFormula
 Послать отзыв
 Свойство HasFormula позволяет проверить, хранится ли в ячейке формула.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool HasFormula;
Копировать Код
Public ReadOnly Property HasFormula As Boolean
 Возвращает
 Возвращает true, если в ячейке хранится формула. В противном случае возвращает false.
 Описание
 Свойство HasFormula позволяет проверить, хранится ли в ячейке формула.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.CellContent, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!