Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Layout.AddToLayoutDictionary
 Послать отзыв
 Этот метод добавляет лист в словарь листов указанной базы данных и определяет для использования запись таблицы блоков.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void AddToLayoutDictionary( ref DatabaseServices.Database toWhichDatabase, DatabaseServices.ObjectId blockTableRecordId );
Копировать Код
Public virtual Sub AddToLayoutDictionary( ByRef toWhichDatabase As DatabaseServices.Database, blockTableRecordId As DatabaseServices.ObjectId )
 Параметры
 Параметры
 Описание
 toWhichDatabase
 База данных, в которую добавляется лист, тип Database.
 blockTableRecordId
 Идентификатор используемой записи в таблице блоков, тип ObjectId.
 Описание
 Этот метод добавляет лист в словарь листов указанной базы данных и определяет для использования запись таблицы блоков.
 Ссылки
 Teigha.DatabaseServices.Layout, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!