Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector3d.YAxis
 Послать отзыв
 Свойство возвращает направление оси Y.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d YAxis;
Копировать Код
Public Property YAxis() As Vector3d
 Возвращает
 Возвращает направление оси Y. Тип Vector3d.
 Описание
 Свойство возвращает направление оси Y.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.Vector3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!