Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DimAssoc.RemovePointRef
 Послать отзыв
 Метод удаляет указатель на опорную точку, которая связывает размер с соответствующей геометрией.
 Синтаксис
C#
Visual Basic
Копировать Код
public void RemovePointRef();
Копировать Код
Public Sub RemovePointRef()
 Описание
 Метод удаляет указатель на опорную точку, которая связывает размер с соответствующей геометрией.
 Ссылки
 Teigha.DatabaseServices.DimAssoc, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!