Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Viewport.GetFrozenLayers
 Послать отзыв
 Метод предоставляет коллекцию всех слоёв, замороженных в данном видовом экране.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectIdCollection GetFrozenLayers();
Копировать Код
Public Function GetFrozenLayers() As ObjectIdCollection
 Возвращает
 Возвращает коллекцию идентификаторов замороженных слоёв. Тип ObjectIdCollection.
 Описание
 Метод предоставляет коллекцию всех слоёв, замороженных в данном видовом экране.
 Ссылки
 Teigha.DatabaseServices.Viewport, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!