Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Polyline.GetArcSegment2dAt
 Послать отзыв
 Синтаксис
C#
Visual Basic
public CircularArc2d GetArcSegment2dAt(int index);
Public Function GetArcSegment2dAt(index As Integer) As CircularArc2d
 Параметры
 Параметры
 Описание
 index
 Индекс (отсчитываемый от 0) вершины для начала дуги
 Описание
 Если сегмент с вершиной с номером, заданным index, является дугой, то метод создает дугу с 2D информацией указанного сегмента полилинии (радиус, центр и т.д.) в координатах OCS полилинии.
 Ссылки
 Teigha.DatabaseServices.Polyline, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!