Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SubentityOverrule.GetSubentPathGeomExtents
 Послать отзыв
 Данный метод переопределяет метод Entity.GetSubentityGeometricExtents() и вызывает его в случае реализации по умолчанию.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual Extents3d GetSubentPathGeomExtents( ref Entity entity, FullSubentityPath path );
Копировать Код
Public virtual Function GetSubentPathGeomExtents( ByRef entity As Entity, path As FullSubentityPath ) As Extents3d
 Параметры
 Параметры
 Описание
 entity
 Объект чертежа, тип Entity.
 path
 Полный путь к подобъекту. Тип FullSubentityPath.
 Возвращает
 Возвращает объект Extents3d с данными о габаритах подобъекта.
 Описание
 Данный метод переопределяет метод Entity.GetSubentityGeometricExtents() и вызывает его в случае реализации по умолчанию. Метод Entity.GetSubentityGeometricExtents() в реализации по умолчанию возвращает экземпляр класса Extents3d с данными о габаритах подобъекта. Метод GetSubentPathGeomExtents() настоящего класса позволяет переопределить механизм работы этого метода.
 Ссылки
 Teigha.DatabaseServices.SubentityOverrule, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!