Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.CenterMarkType
 Послать отзыв
 Свойство возвращает тип маркера центра для радиальных и диаметральных размеров.
 Синтаксис
C#
Visual Basic
Копировать Код
public DimensionCenterMarkType CenterMarkType;
Копировать Код
Public Property CenterMarkType As DimensionCenterMarkType
 Возвращает
 Возвращает тип маркера центра. Значение из перечисления DimensionCenterMarkType.
 Описание
 Свойство возвращает тип маркера центра для радиальных и диаметральных размеров.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!