Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeaderStyle.PostMLeaderStyleToDb
 Послать отзыв
 Метод позволяет добавить данный объект MLeaderStyle в указанную базу данных.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.ObjectId PostMLeaderStyleToDb( ref DatabaseServices.Database db, ref String styleName );
Копировать Код
Public Function PostMLeaderStyleToDb( ByRef db As DatabaseServices.Database, ByRef styleName As String ) As DatabaseServices.ObjectId
 Параметры
 Параметры
 Описание
 db
 Целевая база данных. Тип DatabaseServices.Database.
 styleName
 Имя стиля мультивыноски. Тип String.
 Возвращает
 Возвращает идентификатор добавленного в базу данных стиля мультивыноски. Тип DatabaseServices.ObjectId.
 Описание
 Метод позволяет добавить данный объект MLeaderStyle в указанную базу данных.
 Ссылки
 Teigha.DatabaseServices.MLeaderStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!