Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Matrix3d.*
 Послать отзыв
 Оператор реализует умножение матриц (a*b).
 Синтаксис
C#
Visual Basic
Копировать Код
public Matrix3d operator * ( Matrix3d a, Matrix3d b );
Копировать Код
Public Operator * ( a As Matrix3d, b As Matrix3d )
 Параметры
 Параметры
 Описание
 a
 Левый операнд. Тип Matrix3d.
 b
 Правый операнд. Тип Matrix3d.
 Возвращает
 Возвращает матрицу Matrix3d, которая является результатом матричного умножения матрицы a на матрицу b.
 Описание
 Оператор реализует умножение матриц (a*b).
 Ссылки
 Teigha.Geometry.Matrix3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!