Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.PointOnCurve3d
 Послать отзыв
 Этот класс представляет точку на трехмерной параметрической кривой.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Geometry::Entity3d Teigha::Geometry::PointEntity3d Teigha::Geometry::PointOnCurve3d
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdGePointOnCurve3d")] public class PointOnCurve3d : PointEntity3d;
Копировать Код
<Wrapper("OdGePointOnCurve3d")> Public Class PointOnCurve3d Inherits PointEntity3d
 Описание
 Этот класс представляет точку на трехмерной параметрической кривой. Он инкапсулирует всю геометрическую информацию о точке на трехмерной кривой, включая значение ее параметра, трехмерные координаты и производные.
 Методы
 Конструкторы
 Teigha.Geometry.PointOnCurve3d
 Имя
 Описание
 PointOnCurve3d
 Это обзор перегрузок PointOnCurve3d.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Geometry.Entity3d
 Имя
 Описание
 Entity3d Методы
 Ниже перечислены методы класса Entity3d.
 Teigha.Geometry.PointEntity3d
 Имя
 Описание
 PointEntity3d Методы
 Ниже перечислены методы класса PointEntity3d.
 Teigha.Geometry.PointOnCurve3d
 Имя
 Описание
 PointOnCurve3d Методы
 Ниже перечислены методы класса PointOnCurve3d.
 PointOnCurve3d Свойства
 Ниже перечислены свойства класса PointOnCurve3d.
 Ссылки
 PointOnCurve3d Конструктор, PointOnCurve3d Методы, PointOnCurve3d Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!