Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FormattedTableData.SetOverride
 Послать отзыв
 Метод позволяет задать переопределения для сетки в указанной строке, столбце или ячейке.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetOverride( int row, int column, GridLineType gridLinetype, GridProperties gridProperty );
Копировать Код
Public Overridable Sub SetOverride( row As Integer, column As Integer, gridLinetype As GridLineType, gridProperty As GridProperties )
 Параметры
 Параметры
 Описание
 row
 Индекс строки. Тип int. Может принимать значение -1.
 column
 Индекс столбца. Тип int. Может принимать значение -1.
 gridLinetype
 Тип линий сетки из перечисления GridLineType. Комбинацию типов линий сетки можно задать с помощью логического оператора OR.
 gridProperty
 Задаваемое переопределение из перечисления GridProperties.
 Описание
 Метод позволяет задать переопределения для сетки в указанной строке, столбце или ячейке.
 Чтобы указать ячейку, следует передать действительные индексы строки и столбца. Чтобы указать строку, следует передать действительный индекс строки и -1 в качестве индекса столбца. Чтобы указать столбец, следует передать действительный индекс столбца и -1 в качестве индекса строки.
 Ссылки
 Teigha.DatabaseServices.FormattedTableData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!