Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector3d.GetNormal
 Послать отзыв
 Метод позволяет получить единичный вектор, сонаправленный данному вектору. Используется точность Tolerance.Global.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d GetNormal();
Копировать Код
Public Function GetNormal() As Vector3d
 Возвращает
 Возвращает единичный вектор. Тип Vector3d.
 Описание
 Метод позволяет получить единичный вектор, сонаправленный данному вектору. Реализация метода использует вызов Vector3d.GetNormal(Tolerance) с точностью, равной Tolerance.Global.
 Ссылки
 Teigha.Geometry.Vector3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!