Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FeatureControlFrame.TextStyleId
 Послать отзыв
 Свойство TextStyleId представляет идентификатор текстового стиля, который используется данным объектом.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectId TextStyleId;
Копировать Код
Public Property TextStyleId As ObjectId
 Возвращает
 Возвращает идентификатор текстового стиля. Тип ObjectId.
 Описание
 Свойство TextStyleId представляет идентификатор текстового стиля, который используется данным объектом.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.FeatureControlFrame, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!