Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GeoLocationData.VerticalUnitsScale
 Послать отзыв
 Свойство обеспечивает доступ к текущему масштабу вертикальных единиц измерения. Этот коэффициент используется для умножения координат X или Y в базе данных для получения эквивалентного значения в метрах.
 Синтаксис
C#
Visual Basic
Копировать Код
public double VerticalUnitsScale;
Копировать Код
Public Property VerticalUnitsScale As Double
 Возвращает
 Возвращает масштаб вертикальных единиц измерения. Тип double.
 Описание
 Свойство обеспечивает доступ к текущему масштабу вертикальных единиц измерения. Этот коэффициент используется для умножения координат X или Y в базе данных для получения эквивалентного значения в метрах.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.GeoLocationData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!