Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.UnitType
 Послать отзыв
 Данное перечисление определяет типы единиц значений.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum UnitType { Angle = 2, AngleNotTransformed = 65536, Area = 4, Currency = 16, Distance = 1, Percentage = 32, Unitless = 0, Volume = 8 }
Копировать Код
Public Enum UnitType Angle = 2 AngleNotTransformed = 65536 Area = 4 Currency = 16 Distance = 1 Percentage = 32 Unitless = 0 Volume = 8 End Enum
 Члены
 Члены
 Описание
 Angle
 Значение: 2. Значение представляет угловую величину.
 AngleNotTransformed
 Значение: 65536 = 0x10000. Значение представляет непреобразованный угол.
 Area
 Значение: 4. Значение представляет площадь.
 Currency
 Значение: 16 = 0x10. Значение представляет денежную величину (валюту).
 Distance
 Значение: 1. Значение представляет расстояние.
 Percentage
 Значение: 32 = 0x20. Значение представляет долю, выраженную в процентах.
 Unitless
 Значение: 0. Значение представляет безразмерную величину.
 Volume
 Значение: 8. Значение представляет объем.
 Описание
 Данное перечисление определяет типы единиц значений.
 Ваши комментарии по поводу этого топика: Послать отзыв!