Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DbDictionaryEnumerator.Current
 Послать отзыв
 Свойство обеспечивает доступ к текущей записи перечислителя.
 Синтаксис
C#
Visual Basic
Копировать Код
public DBDictionaryEntry Current;
Копировать Код
Public Property Current() As DBDictionaryEntry
 Возвращает
 Возвращает текущую запись коллекции. Тип DBDictionaryEntry.
 Описание
 Свойство обеспечивает доступ к текущей записи перечислителя.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.DbDictionaryEnumerator, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!