Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.AnnotativeDwg
 Послать отзыв
 This is AnnotativeDwg, a member of class Database.
 Синтаксис
C#
Visual Basic
public bool AnnotativeDwg;
Public Property AnnotativeDwg() As bool
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!