Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CoordinateSystem2d.Origin
 Послать отзыв
 Свойство Origin представляет точку начала данной системы координат.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point2d Origin;
Копировать Код
Public ReadOnly Property Origin As Point2d
 Возвращает
 Возвращает точку начала системы координат. Тип Point2d.
 Описание
 Свойство Origin представляет точку начала данной системы координат.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.CoordinateSystem2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!