Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.HostApplicationServices.GRIPCOLOR
 Послать отзыв
 Свойство обеспечивает доступ к значению цвета невыделенных ручек. Индекс цвета принимает значения в диапазоне [1..255].
 Синтаксис
C#
Visual Basic
Копировать Код
public short GRIPCOLOR;
Копировать Код
Public Property GRIPCOLOR As Short
 Возвращает
 Возвращает индекс цвета невыделенных ручек. Тип short.
 Описание
 Свойство обеспечивает доступ к значению цвета невыделенных ручек. Индекс цвета принимает значения в диапазоне [1..255].
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.HostApplicationServices, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!