Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve3d.GetBoundBlockOf
 Послать отзыв
 Метод позволяет определить ориентированный граничный бокс для участка данной кривой на указанном параметрическом подынтервале.
 Синтаксис
C#
Visual Basic
Копировать Код
public BoundBlock3d GetBoundBlockOf( ref Interval range );
Копировать Код
Public Function GetBoundBlockOf( ByRef range As Interval ) As BoundBlock3d
 Параметры
 Параметры
 Описание
 range
 Параметрический подынтервал участка кривой, для которого строится ориентированный граничный бокс. Тип Interval.
 Возвращает
 Возвращает направленный ориентированный граничный бокс. Тип BoundBlock3d.
 Описание
 Метод позволяет определить ориентированный граничный бокс для участка данной кривой на указанном параметрическом подынтервале. Ребра такого бокса не обязаны быть параллельными координатным осям.
 Замечания
 Ориентированный граничный бокс представляет собой прямоугольный параллелепипед минимального объема, в котором целиком помещается целевой геометрический объект. Ориентация такого бокса определяется пространственной ориентацией геометрического объекта, таким образом, ребра этого бокса не обязаны быть параллельными координатным осям.
 Ссылки
 Teigha.Geometry.Curve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!