Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.PlanarEntity.Coefficients
 Послать отзыв
 Свойство Coefficients представляет коэффициенты общего уравнения плоскости данного объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public PlanarEquationCoefficients Coefficients;
Копировать Код
Public ReadOnly Property Coefficients As PlanarEquationCoefficients
 Возвращает
 Возвращает коэффициенты общего уравнения плоскости. Тип PlanarEquationCoefficients.
 Описание
 Свойство Coefficients представляет коэффициенты общего уравнения плоскости данного объекта.
 Это уравнение имеет вид:
 Копировать Код
 a * X + b * Y + c * Z + d = 0
 где a, b, c, d - некоторые действительные константы, удовлетворяющие условию невырожденности плоскости a^2 + b^2 + c^2 != 0 (другими словами, они не могут равняться нулю одновременно). Величины a, b, c служат компонентами вектора нормали этой плоскости.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.PlanarEntity, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!