Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Field.GetFieldCodeWithChildren
 Послать отзыв
 Метод позволяет извлечь код поля с дочерними полями в различных видах.
 Синтаксис
C#
Visual Basic
Копировать Код
public FieldCodeWithChildren GetFieldCodeWithChildren();
Копировать Код
Public Function GetFieldCodeWithChildren() As FieldCodeWithChildren
 Возвращает
 Возвращает код поля. Тип FieldCodeWithChildren.
 Описание
 Метод позволяет извлечь код поля с дочерними полями в различных видах.
 Ссылки
 Teigha.DatabaseServices.Field, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!