Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DynamicBlockReferenceProperty.UnitsType
 Послать отзыв
 Свойство UnitsType представляет типы единиц измерения данного свойства динамического блока.
 Синтаксис
C#
Visual Basic
Копировать Код
public DynamicBlockReferencePropertyUnitsType UnitsType;
Копировать Код
Public ReadOnly Property UnitsType As DynamicBlockReferencePropertyUnitsType
 Возвращает
 Возвращает тип единиц измерения из перечисления DynamicBlockReferencePropertyUnitsType.
 Описание
 Свойство UnitsType представляет типы единиц измерения данного свойства динамического блока (длины, площади, углы). Доступные типы определяются перечислением DynamicBlockReferencePropertyUnitsType.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.DynamicBlockReferenceProperty, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!