Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CubicSplineCurve2d.SetFirstDerivativeAt
 Послать отзыв
 Метод позволяет переопределить вектор первой производной в определяющей точке с указанным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetFirstDerivativeAt( int index, Vector2d derivative );
Копировать Код
Public Sub SetFirstDerivativeAt( index As Integer, derivative As Vector2d )
 Параметры
 Параметры
 Описание
 index
 Индекс определяющей точки. Тип int.
 derivative
 Новый вектор первой производной в указанной определяющей точке. Тип Vector2d.
 Описание
 Метод позволяет переопределить вектор первой производной в определяющей точке с указанным индексом.
 Ссылки
 Teigha.Geometry.CubicSplineCurve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!