Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Row.Height
 Послать отзыв
 Свойство Height представляет высоту строки.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Height;
Копировать Код
Public Property Height As Double
 Возвращает
 Возвращает высоту строки. Тип double.
 Описание
 Свойство Height представляет высоту данной строки.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Row, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!