Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FieldEvaluationStatusResult.Status
 Послать отзыв
 Свойство Status возвращает статус вычисления поля этого объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public FieldEvaluationStatus Status;
Копировать Код
Public ReadOnly Property Status As FieldEvaluationStatus
 Возвращает
 Возвращает статус вычисления поля. Значение из перечисления FieldEvaluationStatus.
 Описание
 Свойство Status возвращает статус вычисления поля этого объекта.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.FieldEvaluationStatusResult, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!