Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GraphNode.NumCycleIn
 Послать отзыв
 Свойство возвращает количество входящих циклических ссылок в данном узле графа.
 Синтаксис
C#
Visual Basic
Копировать Код
public int NumCycleIn;
Копировать Код
Public ReadOnly Property NumCycleIn As Integer
 Возвращает
 Возвращает количество входящих циклических ссылок. Тип int.
 Описание
 Свойство возвращает количество входящих циклических ссылок в данном узле графа.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.GraphNode, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!