Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Point3d.RotateBy
 Послать отзыв
 Метод создает новую точку, которая получается поворотом этой точки вокруг заданной оси на заданный угол.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d RotateBy( double angle, Vector3d vector, Point3d centerPoint );
Копировать Код
Public Function RotateBy( angle As Double, vector As Vector3d, centerPoint As Point3d ) As Point3d
 Параметры
 Параметры
 Описание
 angle
 Входной угол поворота в радианах. Тип double.
 vector
 Входной вектор, определяющий направление оси вращения. Тип Vector3d.
 centerPoint
 Входная точка, через которую проходит ось вращения. Тип Point3d.
 Возвращает
 Возвращает точку, являющуюся результатом поворота. Тип Point3d.
 Описание
 Метод создает новую точку, которая получается поворотом этой точки вокруг заданной оси на угол angle. Ось вращения определяется входной точкой и вектором.
 Ссылки
 Teigha.Geometry.Point3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!