Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.OpenCloseTransaction.OpenCloseTransaction
 Послать отзыв
 Конструктор по умолчанию класса OpenCloseTransaction.
 Синтаксис
C#
Visual Basic
Копировать Код
public OpenCloseTransaction();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса OpenCloseTransaction.
 Ссылки
 Teigha.DatabaseServices.OpenCloseTransaction, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!