Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve2d.IsOn
 Послать отзыв
 Метод позволяет проверить, лежит ли указанная точка на данной кривой в пределах указанной точности, и если это так, определяет соответствующее этой точке значение параметра.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsOn( Point2d point, out double value, Tolerance tolerance );
Копировать Код
Public Function IsOn( point As Point2d, ByRef value As Double, tolerance As Tolerance ) As Boolean
 Параметры
 Параметры
 Описание
 point
 Проверяемая точка. Тип Point2d.
 value
 Выходное значение параметра, соответствующее проверяемой точке. Тип double. Это значение действительно только в том случае, если метод возвращает значение true.
 tolerance
 Заданная геометрическая точность. Тип Tolerance.
 Возвращает
 Возвращает true, если точка point лежит на данной кривой. В противном случае возвращает false.
 Описание
 Метод позволяет проверить, лежит ли указанная точка на данной кривой в пределах указанной точности, и если это так, определяет соответствующее этой точке значение параметра.
 Ссылки
 Teigha.Geometry.Curve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!