Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FieldUpdateResult.NumEvaluated
 Послать отзыв
 Свойство NumEvaluated представляет количество вычисленных полей.
 Синтаксис
C#
Visual Basic
Копировать Код
public int NumEvaluated;
Копировать Код
Public NumEvaluated As Integer
 Возвращает
 Возвращает количество вычисленных полей. Тип int.
 Описание
 Свойство NumEvaluated представляет количество вычисленных полей.
 Ссылки
 Teigha.DatabaseServices.FieldUpdateResult, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!