Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.PointOnCurve2d.GetPointAtParameter
 Послать отзыв
 Метод переопределяет значение параметра у данного объекта и возвращает точку на кривой, соответствующую этому параметру.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point2d GetPointAtParameter( double parameter );
Копировать Код
Public Function GetPointAtParameter( parameter As Double ) As Point2d
 Параметры
 Параметры
 Описание
 parameter
 Новое значение параметра. Тип double.
 Возвращает
 Возвращает точку, соответствующую значению параметра parameter. Тип Point2d.
 Описание
 Метод переопределяет значение параметра у данного объекта и возвращает соответствующую этому значению точку на кривой.
 Ссылки
 Teigha.Geometry.PointOnCurve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!