Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotSettings.StdScale
 Послать отзыв
 Свойство StdScale представляет стандартный масштаб для этого объекта PlotSettings в виде значения с плавающей точкой.
 Синтаксис
C#
Visual Basic
Копировать Код
public double StdScale;
Копировать Код
Public ReadOnly Property StdScale As Double
 Возвращает
 Возвращает значение стандартного масштаба. Тип double.
 Описание
 Свойство StdScale представляет стандартный масштаб для этого объекта PlotSettings в виде значения с плавающей точкой.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.PlotSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!