Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SelectType
 Послать отзыв
 Перечисление SelectType определяет поддерживаемые типы выбора объектов.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum SelectType { Window = 1, Crossing = 2 }
Копировать Код
Public Enum SelectType Window = 1 Crossing = 2 End Enum
 Члены
 Члены
 Описание
 Crossing
 Значение: 2. Режим выбора секущей рамкой. Область выбора определяется двумя точками, которые задают прямоугольную рамку. Выбираются только те объекты, которые полностью находятся внутри рамки или пересекают ее.
 Window
 Значение: 1. Режим выбора рамкой (окном). Область выбора определяется двумя точками, которые задают прямоугольную рамку. Выбираются только те объекты, которые полностью находятся внутри рамки.
 Описание
 Перечисление SelectType определяет поддерживаемые типы выбора объектов (рамкой или секущей рамкой).
 Ваши комментарии по поводу этого топика: Послать отзыв!