Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Hatch.Associative
 Послать отзыв
 Синтаксис
C#
Visual Basic
public bool Associative;
Public Property Associative() As bool
 Описание
 Обеспечивает доступ к признаку, устанавливаемому в true или false в зависимости от того, ассоциируется ли объект заливки со своей исходной геометрией границ. Исходная геометрия границ должна быть представлена резидентными объектами базы данных nanoCAD, такими как линия, дуга и т.д. Использование ассоциированной заливки обеспечивает автоматическое перевычисление линий заливки при изменении исходной геометрии границ.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Hatch, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!