Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve2dCollection.Insert
 Послать отзыв
 Метод вставляет в коллекцию указанный элемент в позицию с заданным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Insert( int index, ref Curve2d value );
Копировать Код
Public Sub Insert( index As Integer, ByRef value As Curve2d )
 Параметры
 Параметры
 Описание
 index
 Позиция вставляемого элемента в коллекции. Тип int.
 value
 Вставляемый в коллекцию элемент. Тип Curve2d.
 Описание
 Метод вставляет в коллекцию указанный элемент value в позицию с заданным индексом index.
 Ссылки
 Teigha.Geometry.Curve2dCollection, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!