Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MText.SetContentsRtf
 Послать отзыв
 Метод позволяет сформировать многострочный текст объекта MText на основе текстовой строки в формате RTF.
 Синтаксис
C#
Visual Basic
Копировать Код
public int SetContentsRtf( ref String value );
Копировать Код
Public Function SetContentsRtf( ByRef value As String ) As Integer
 Параметры
 Параметры
 Описание
 value
 Новый текст в формате RTF. Тип String.
 Возвращает
 Возвращает длину текстовой строки, полученной в результате преобразования из формата RTF. Тип int.
 Описание
 Метод позволяет сформировать многострочный текст объекта MText на основе текстовой строки в формате RTF.
Коды RTF преобразуются в коды MText.
Шрифты, цвета, табуляция и отступы сохраняются.
Маркеры и нумерованные списки реализуются с использованием предусмотренных настроек табуляции и отступов.
 Ссылки
 Teigha.DatabaseServices.MText, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!