Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Group.NumEntities
 Послать отзыв
 Свойство возвращает текущее количество объектов в этой группе.
 Синтаксис
C#
Visual Basic
Копировать Код
public int NumEntities;
Копировать Код
Public ReadOnly Property NumEntities As Integer
 Возвращает
 Возвращает количество объектов в группе. Тип int.
 Описание
 Свойство возвращает текущее количество объектов в этой группе.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Group, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!