Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.EllipticalArc3d.MinorAxis
 Послать отзыв
 Свойство MinorAxis представляет направление малой оси данной эллиптической дуги.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d MinorAxis;
Копировать Код
Public ReadOnly Property MinorAxis As Vector3d
 Возвращает
 Возвращает направление малой оси эллиптической дуги. Тип Vector3d.
 Описание
 Свойство MinorAxis представляет направление малой оси данной эллиптической дуги.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.EllipticalArc3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!