Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CubicSplineCurve3d.FitPointAt
 Послать отзыв
 Метод позволяет получить определяющую точку этого сплайна с заданным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d FitPointAt( int i );
Копировать Код
Public Function FitPointAt( i As Integer ) As Point3d
 Параметры
 Параметры
 Описание
 i
 Индекс искомой определяющей точки данного сплайна. Тип int.
 Возвращает
 Возвращает определяющую точку сплайна с индексом i. Тип Point3d.
 Описание
 Метод позволяет получить определяющую точку этого сплайна с заданным индексом.
 Ссылки
 Teigha.Geometry.CubicSplineCurve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!