Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PropertiesOverrule.SetXDataFilter
 Послать отзыв
 Метод включает использование указанных расширенных данных в условии применимости объектного переопределения.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetXDataFilter( ref String registeredApplicationName );
Копировать Код
Public Sub SetXDataFilter( ByRef registeredApplicationName As String )
 Параметры
 Параметры
 Описание
 registeredApplicationName
 Имя зарегистрированного приложения, тип String.
 Описание
 Метод включает использование расширенных данных в условии применимости объектного переопределения.
 Ваши переопределения будут вызываться только для тех объектов, у которых в расширенных данных будет присутствовать registeredApplicationName.
 Ссылки
 Teigha.DatabaseServices.PropertiesOverrule, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!