Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 ViewTableRecord.Layout
 Послать отзыв
 В свойстве хранится ObjectId листа, к которому относится именованный вид.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectId Layout { get; set; }
Копировать Код
Public Property Layout As ObjectId
 Возвращает
 Возвращает тип данных ObjectId.
 Описание
 В свойстве хранится ObjectId листа, к которому относится именованный вид. Зная ObjectId листа, можно получить подробную информацию о нем из базы данных документа. Также, через свойство можно изменить лист, к которому относится именованный вид, заменив ObjectId текущего листа на ObjectId нового листа.
 Условия
 Чтение и запись.
 Ссылки
 ViewTableRecord Класс, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!