Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AnnotationScale.CollectionName
 Послать отзыв
 Свойство возвращает имя коллекции масштабов аннотаций.
 Синтаксис
C#
Visual Basic
Копировать Код
public String CollectionName;
Копировать Код
Public Property CollectionName() As String
 Возвращает
 Возвращает имя коллекции, тип String.
 Описание
 Свойство возвращает имя коллекции масштабов аннотаций.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.AnnotationScale, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!