Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MentalRayRenderSettings.ExportMIEnabled
 Послать отзыв
 Свойство ExportMIEnabled позволяет определить, следует ли экспортировать файл MI после рендеринга изображения.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool ExportMIEnabled;
Копировать Код
Public Property ExportMIEnabled As Boolean
 Возвращает
 Возвращает true, если требуется экспортировать файл MI. В противном случае возвращает false.
 Описание
 Свойство ExportMIEnabled позволяет определить, следует ли экспортировать файл MI после рендеринга изображения.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MentalRayRenderSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!