Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Solid3d.Extrude
 Послать отзыв
 Метод создает трехмерное твердое тело выдавливанием указанной области на заданную высоту и с заданным углом наклона.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void Extrude( ref Region region, double height, double taperAngle );
Копировать Код
Public Overridable Sub Extrude( ByRef region As Region, height As Double, taperAngle As Double )
 Параметры
 Параметры
 Описание
 region
 Область, используемая операцией выдавливания в качестве профиля выдавливания. Тип Region.
 height
 Высота выдавливания. Тип double.
 taperAngle
 Угол наклона при выдавливании (в радианах). Тип double.
 Описание
 Метод создает трехмерное твердое тело выдавливанием указанной области на заданную высоту и с заданным углом наклона.
 Выдавливаемая область не должна иметь самопересечений. Значение высоты может быть отрицательным. Направление выдавливания (экструзии) всегда параллельно вектору нормали области и совпадает с ним, если значение высоты положительно.
 Действуют следующие ограничения:
height| >= 1e-6;
taperAngle| < PI2 - 1e-6.
 Ссылки
 Teigha.DatabaseServices.Solid3d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!