Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeader.GetArrowSize
 Послать отзыв
 Метод возвращает размер стрелки для указанной линии выноски.
 Синтаксис
C#
Visual Basic
Копировать Код
public double GetArrowSize( int leaderLineIndex );
Копировать Код
Public Function GetArrowSize( leaderLineIndex As Integer ) As Double
 Параметры
 Параметры
 Описание
 leaderLineIndex
 Индекс линии выноски. Тип int.
 Возвращает
 Возвращает размер стрелки. Тип double.
 Описание
 Метод возвращает размер стрелки для линии выноски с указанным индексом.
 Ссылки
 Teigha.DatabaseServices.MLeader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!