Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CircularArc3d.GetTangent
 Послать отзыв
 Метод позволяет с заданной точностью найти трехмерную линию касательной в указанной точке этой дуги.
 Синтаксис
C#
Visual Basic
Копировать Код
public Line3d GetTangent( Point3d pointValue, Tolerance tolerance );
Копировать Код
Public Function GetTangent( pointValue As Point3d, tolerance As Tolerance ) As Line3d
 Параметры
 Параметры
 Описание
 pointValue
 Входная точка на дуге. Тип Point3d.
 tolerance
 Заданная точность вычислений. Тип Tolerance.
 Возвращает
 Возвращает 3D-линию касательной к дуге в заданной точке дуги. Тип Line3d.
 Описание
 Метод позволяет с заданной точностью найти трехмерную линию касательной в указанной точке этой дуги.
 Ссылки
 Teigha.Geometry.CircularArc3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!