Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MText.FontChange
 Послать отзыв
 Свойство возвращает строку изменения шрифта "F".
 Синтаксис
C#
Visual Basic
Копировать Код
public static String FontChange;
Копировать Код
Public Shared ReadOnly Property FontChange As String
 Возвращает
 Возвращает строку изменения шрифта. Тип String.
 Описание
 Свойство возвращает строку изменения шрифта "F". Может использоваться вместо строковой константы "F", чтобы сделать код более понятным. При использовании в строке, возвращаемой свойством MText.Contents, "F" означает смену шрифта.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.MText, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!