Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.SetGridVisibility
 Послать отзыв
 Метод позволяет задать видимость сетки с указанной стороны ячейки.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetGridVisibility( int row, int col, short edges, bool value );
Копировать Код
Public virtual Sub SetGridVisibility( row As Integer, col As Integer, edges As short, value As Boolean )
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 col
 Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
 edges
 Индекс стороны ячейки, тип short. См.перечисление CellEdgeMasks.
 value
 Флаг видимости сетки у ячейки, строки или столбца, bool.
 Описание
 Метод позволяет задать видимость сетки с указанной стороны ячейки.
 Замечания
 Для получения того же результата предпочтительнее использовать Table.Cells[row,column].{Top,Bottom,Left,Right}Edge.Visibility.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!