Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DatabaseSummaryInfoBuilder.HyperlinkBase
 Послать отзыв
 Свойство обеспечивает доступ к базовому URL данного объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public String HyperlinkBase;
Копировать Код
Public Property HyperlinkBase() As String
 Возвращает
 Возвращает базовый URL. Тип String.
 Описание
 Свойство обеспечивает доступ к базовому URL данного объекта.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.DatabaseSummaryInfoBuilder, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!