Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector2d.*
 Послать отзыв
 Оператор геометрического преобразования 2D-вектора.
 Синтаксис
C#
Visual Basic
Копировать Код
public static Vector2d Vector2d *( Matrix2d a, Vector2d b );
Копировать Код
Public Shared Operator *( a As Matrix2d, b As Vector2d ) As Vector2d
 Параметры
 Параметры
 Описание
 a
 Левый операнд. Тип Matrix2d.
 b
 Правый операнд. Тип Vector2d.
 Возвращает
 Возвращает вектор, являющийся результатом произведения a х b^T. Тип Vector2d.
 Описание
 Оператор геометрического преобразования 2D-вектора. Оператор возвращает вектор, равный произведению матрицы преобразования a на вектор b, представленный в виде столбца.
 Ссылки
 Teigha.Geometry.Vector2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!