Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Torus.Set
 Послать отзыв
 Метод позволяет переопределить все параметры данного объекта указанными в аргументах значениями.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Set( double majorRadius, double minorRadius, Point3d origin, Vector3d axisOfSymmetry, Vector3d refAxis, double startAngleU, double endAngleU, double startAngleV, double endAngleV );
Копировать Код
Public Sub Set( majorRadius As Double, minorRadius As Double, origin As Point3d, axisOfSymmetry As Vector3d, refAxis As Vector3d, startAngleU As Double, endAngleU As Double, startAngleV As Double, endAngleV As Double )
 Параметры
 Параметры
 Описание
 majorRadius
 Большой радиус тора (радиус направляющей окружности тора). Тип double.
 minorRadius
 Малый радиус тора (радиус образующей окружности тора). Тип double.
 origin
 Точка центра тора (начало координат тора). Тип Point3d.
 axisOfSymmetry
 Ось симметрии тора (ось вращения тора). Тип Vector3d.
 refAxis
 Вектор, определяющий начало отсчета угла поворота образующей окружности тора. Тип Vector3d.
 startAngleU
 Нижняя граница интервала параметра U. Начальный угол относительно оси симметрии тора. Тип double.
 endAngleU
 Верхняя граница интервала параметра U. Конечный угол относительно оси симметрии тора. Тип double.
 startAngleV
 Нижняя граница интервала параметра V. Начальный угол относительно трубы тора. Тип double.
 endAngleV
 Верхняя граница интервала параметра V. Конечный угол относительно трубы тора. Тип double.
 Описание
 Метод позволяет переопределить все параметры данного объекта указанными в аргументах значениями.
 Замечания
 Все углы задаются в радианах.
 Ссылки
 Teigha.Geometry.Torus, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!