Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SweepOptionsBuilder.DraftAngle
 Послать отзыв
 Свойство DraftAngle представляет угол сужения (или расширения), под которым профиль будет сужаться по мере вытягивания вдоль траектории.
 Синтаксис
C#
Visual Basic
Копировать Код
public double DraftAngle;
Копировать Код
Public Property DraftAngle As Double
 Возвращает
 Возвращает угол сужения (в радианах). Тип double.
 Описание
 Свойство DraftAngle представляет угол сужения (или расширения), под которым профиль будет сужаться по мере вытягивания вдоль траектории.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.SweepOptionsBuilder, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!