Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CircularArc2d.EndAngle
 Послать отзыв
 Свойство EndAngle представляет угол конечной точки дуги относительно опорного вектора.
 Синтаксис
C#
Visual Basic
Копировать Код
public double EndAngle;
Копировать Код
Public ReadOnly Property EndAngle As Double
 Возвращает
 Возвращает конечный угол дуги. Тип double.
 Описание
 Свойство EndAngle представляет угол конечной точки дуги относительно опорного вектора.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.CircularArc2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!