Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ProxyObject.ResurrectMeNow
 Послать отзыв
 Метод ResurrectMeNow предназначен для восстановления объекта, представленного в чертеже своим прокси-объектом.
 Синтаксис
C#
Visual Basic
Копировать Код
public void ResurrectMeNow( DatabaseServices.ObjectId id );
Копировать Код
Public Sub ResurrectMeNow( id As DatabaseServices.ObjectId )
 Параметры
 Параметры
 Описание
 id
 Входной идентификатор прокси-объекта. Тип DatabaseServices.ObjectId.
 Описание
 Метод ResurrectMeNow предназначен для восстановления объекта, представленного в чертеже своим прокси-объектом.
 Замена прокси-объекта его исходным "настоящим" объектом возможна при условии, что загружено приложение, определяющее класс объекта, котрый представлен указанным прокси-объектом.
 Обычно такое восстановление происходит автоматически во время загрузки чертежа или приложения NRX, однако последовательность автоматического восстановления определяется базой данных. Данный метод позволяет вмешаться в эту последовательность, чтобы принудительно и параллельно восстановить объекты, связанные с указанным объектом.
 Ссылки
 Teigha.DatabaseServices.ProxyObject, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!