Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.OsnapOverrule.GetObjectSnapPoints
 Послать отзыв
 Метод предназначен для получения точек объектной привязки.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void GetObjectSnapPoints( ref Entity entity, ObjectSnapModes snapMode, IntPtr gsSelectionMark, Point3d pickPoint, Point3d lastPoint, Matrix3d viewTransform, ref Point3dCollection snapPoints, ref IntegerCollection geometryIds );
Копировать Код
Public virtual Sub GetObjectSnapPoints( ByRef entity As Entity, snapMode As ObjectSnapModes, gsSelectionMark As IntPtr, pickPoint As Point3d, lastPoint As Point3d, viewTransform As Matrix3d, ByRef snapPoints As Point3dCollection, ByRef geometryIds As IntegerCollection )
 Параметры
 Параметры
 Описание
 entity
 Объект чертежа, тип Entity.
 snapMode
 Требуемый режим объектной привязки, тип ObjectSnapModes.
 gsSelectionMark
 Маркер GS подсущности, участвующей в операции объектной привязки, тип IntPtr.
 pickPoint
 Координаты в мировой системе координат (WCS) точки, указанной в ходе операции объектной привязки, тип Point3d.
 lastPoint
 Координаты WCS точки, выбранной непосредственно перед pickPoint, тип Point3d.
 viewTransform
 Матрица преобразования из WCS в систему координат видового экрана, тип Matrix3d.
 snapPoints
 Существующий массив для добавления точек привязки, тип Point3dCollection.
 geometryIds
 Аргумент зарезервирован для будущего использования.
 Описание
 Метод предназначен для получения точек объектной привязки.
 Ссылки
 Teigha.DatabaseServices.OsnapOverrule, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!