Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Делегат Teigha.DatabaseServices.XrefSubCommandAbortedEventHandler
 Послать отзыв
 This is type Teigha::DatabaseServices::XrefSubCommandAbortedEventHandler.
 Синтаксис
C#
Visual Basic
public delegate XrefSubCommandAbortedEventHandler();
Public Delegate Sub XrefSubCommandAbortedEventHandler()
 Ваши комментарии по поводу этого топика: Послать отзыв!