Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotStyleTable.AddPlotStyle
 Послать отзыв
 Метод добавляет в данную таблицу указанный стиль печати.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void AddPlotStyle( ref PlotStyle pPs );
Копировать Код
Public Overridable Sub AddPlotStyle( ByRef pPs As PlotStyle )
 Параметры
 Параметры
 Описание
 pPs
 Добавляемый стиль печати. Тип PlotStyle.
 Описание
 Метод добавляет в данную таблицу указанный стиль печати.
 Ссылки
 Teigha.DatabaseServices.PlotStyleTable, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!