Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.RotatedDimType
 Послать отзыв
 Перечисление RotatedDimType определяет поддерживаемые типы выравнивания повернутого размера.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum RotatedDimType { Unknown = 0, Parallel = 1, Perpendicular = 2 }
Копировать Код
Public Enum RotatedDimType Unknown = 0 Parallel = 1 Perpendicular = 2 End Enum
 Члены
 Члены
 Описание
 Unknown
 Значение: 0. Тип выравнивания повернутого размера неизвестен.
 Parallel
 Значение: 1. Параллельное выравнивание размера.
 Perpendicular
 Значение: 2. Перпендикулярное выравнивание размера.
 Описание
 Перечисление RotatedDimType определяет поддерживаемые типы выравнивания повернутого размера.
 Ваши комментарии по поводу этого топика: Послать отзыв!