Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 BlockTableRecord.GetErasedBlockReferenceIds()
 Послать отзыв
 Метод предназначен для получения коллекции ObjectId всех вставок данного определения блока, которые были удалены из чертежа.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectIdCollection GetErasedBlockReferenceIds();
Копировать Код
Public Function GetErasedBlockReferenceIds() As ObjectIdCollection
 Возвращает
 Метод возвращает коллекцию ObjectId в формате ObjectIdCollection.
 Описание
 Метод вовзращает коллекцию ObjectId вставок данного определения блока, которые были удалены из чертежа.
 Ссылки
 Teigha.DatabaseServices.BlockTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!