Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Tolerance.EqualVector
 Послать отзыв
 Свойство EqualVector представляет точность (допуск) для оценки равенства двух векторов.
 Синтаксис
C#
Visual Basic
Копировать Код
public double EqualVector;
Копировать Код
Public ReadOnly Property EqualVector As Double
 Возвращает
 Возвращает точность (допуск) для оценки равенства двух векторов. Тип double.
 Описание
 Свойство EqualVector представляет точность (допуск) для оценки равенства двух векторов.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.Tolerance, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!