Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AttributeReference.UpdateMTextAttribute
 Послать отзыв
 Метод обновляет внутренний объект MText из основных свойств AttributeReference.
 Синтаксис
C#
Visual Basic
Копировать Код
public void UpdateMTextAttribute();
Копировать Код
Public Sub UpdateMTextAttribute()
 Описание
 Метод обновляет внутренний объект MText многострочного атрибута, исходя из свойств объекта AttributeReference.
 Ссылки
 Teigha.DatabaseServices.AttributeReference, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!