Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LinkedTableData.DeleteColumn
 Послать отзыв
 Метод позволяет удалить из этой таблицы указанное количество столбцов, начиная со столбца с указанным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void DeleteColumn( int index, int columnsNumberToDelete );
Копировать Код
Public Overridable Sub DeleteColumn( index As Integer, columnsNumberToDelete As Integer )
 Параметры
 Параметры
 Описание
 index
 Индекс первого удаляемого столбца. Тип int.
 columnsNumberToDelete
 Количество удаляемых столбцов. Тип int.
 Описание
 Метод позволяет удалить из таблицы указанное количество столбцов, начиная со столбца с указанным индексом.
 Замечания
 Метод генерирует исключение eInvalidInput, если значение columnsNumberToDelete превышает текущее количество столбцов в таблице.
 Ссылки
 Teigha.DatabaseServices.LinkedTableData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!