Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 LayerTableRecord.PlotStyleNameId
 Послать отзыв
 В свойстве хранится ObjectId стиля печати, который установлен в слое.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectId PlotStyleNameId { get; set; }
Копировать Код
Public Property PlotStyleNameId As ObjectId
 Возвращает
 Возвращает тип данных ObjectId.
 Описание
 С помощью свойства можно получить ObjectId стиля печати, используемого в слое, и изменить его.
 Стиль печати, установленный в слое, будет у всех объектов чертежа, расположенных на этом слое, если стиль печати этих объектов установлен в значение «По слою».
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.LayerTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!