Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AttributeCollection.Item
 Послать отзыв
 Свойство реализует быстрый поиск элемента коллекции по его индексу.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectId Item;
Копировать Код
Public Property Item() As ObjectId
 Параметры
 Параметры
 Описание
 index
 Индекс искомого элемента массива, тип int.
 Возвращает
 Возвращает ObjectId элемента коллекции с индексом, равным параметру index.
 Описание
 Предоставляет доступ к элементу коллекции по его индексу.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.AttributeCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!