Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.PlotSettingsDictionaryId
 Послать отзыв
 Синтаксис
C#
Visual Basic
public DatabaseServices::ObjectId PlotSettingsDictionaryId;
Public Property PlotSettingsDictionaryId() As DatabaseServices.ObjectId
 Описание
 Возвращает Id словаря ACAD_PLOTSETTINGS.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!