Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Sphere.ReferenceAxis
 Послать отзыв
 Свойство ReferenceAxis представляет направление из центра сферы на нулевой меридиан.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d ReferenceAxis;
Копировать Код
Public ReadOnly Property ReferenceAxis As Vector3d
 Возвращает
 Возвращает направление из центра сферы на нулевой меридиан. Тип Vector3d.
 Описание
 Свойство ReferenceAxis представляет направление из центра сферы на нулевой меридиан.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.Sphere, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!