Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Surface.SliceBySurface
 Послать отзыв
 Метод позволяет рассечь данный объект другой поверхностью и преобразовать его в ту часть, которая остается со стороны от режущей поверхности с положительным направлением нормали.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtua SurfaceSliceResults SliceBySurface( ref Surface slicingSurface );
Копировать Код
Public Overridable Function SliceBySurface( ByRef slicingSurface As Surface ) As SurfaceSliceResults
 Параметры
 Параметры
 Описание
 slicingSurface
 Режущая поверхность. Тип Surface.
 Возвращает
 Возвращает объект SurfaceSliceResults, который включает как "отрицательную", так и "положительную" части разрезанной поверхности.
 Описание
 Метод позволяет рассечь данный объект другой поверхностью и преобразовать его в ту часть, которая остается со стороны от режущей поверхности с положительным направлением нормали.
 Замечания
 Этот метод реализован только в среде пространственного моделирования Spatial Modeler.
 Ссылки
 Teigha.DatabaseServices.Surface, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!