Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ResultBufferEnumerator
 Послать отзыв
 Класс ResultBufferEnumerator представляет перечислитель для класса ResultBuffer.
 Иерархия классов
Teigha::DatabaseServices::ResultBufferEnumerator
 Синтаксис
C#
Visual Basic
Копировать Код
public sealed class ResultBufferEnumerator : IEnumerator
Копировать Код
Public NotInheritable Class ResultBufferEnumerator Implements IEnumerator
 Описание
 Класс ResultBufferEnumerator представляет перечислитель для класса ResultBuffer.
 Топики
 Имя
 Описание
 ResultBufferEnumerator Методы
 Ниже перечислены методы класса ResultBufferEnumerator.
 ResultBufferEnumerator Свойства
 Ниже перечислены свойства класса ResultBufferEnumerator.
 Ссылки
 ResultBufferEnumerator Методы, ResultBufferEnumerator Свойства, Топики, ResultBufferEnumerator Методы, ResultBufferEnumerator Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!