Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CellContent.FieldId
 Послать отзыв
 Свойство FieldId представляет идентификатор ObjectId поля, хранящегося в ячейке.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectId FieldId;
Копировать Код
Public Property FieldId As ObjectId
 Возвращает
 Возвращает идентификатор поля в ячейке. Тип ObjectId.
 Описание
 Свойство FieldId представляет идентификатор ObjectId поля, хранящегося в ячейке.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.CellContent, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!