Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Insunits
 Послать отзыв
 Синтаксис
C#
Visual Basic
public DatabaseServices::UnitsValue Insunits;
Public Property Insunits() As DatabaseServices.UnitsValue
 Описание
 Возвращает или устанавливает текущее значение INSUNITS для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!