Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbCurve2d.HardTrimByParams
 Послать отзыв
 Метод позволяет обрезать данную NURBS кривую, задав ей новые значения начального и конечного параметров.
 Синтаксис
C#
Visual Basic
Копировать Код
public void HardTrimByParams( double newStartParameter, double newEndParameter );
Копировать Код
Public Sub HardTrimByParams( newStartParameter As Double, newEndParameter As Double )
 Параметры
 Параметры
 Описание
 newStartParameter
 Новое начальное значение параметра. Тип double.
 newEndParameter
 Новое конечное значение параметра. Тип double.
 Описание
 Метод позволяет обрезать данную NURBS кривую, задав ей новые значения начального и конечного параметров. Это делается путем добавления и удаления управляющих вершин и узлов, а не просто изменением параметрического интервала, на котором определен сплайн.
 Ссылки
 Teigha.Geometry.NurbCurve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!