Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DrawOrderTable.GetRelativeDrawOrder
 Послать отзыв
 Метод предназначен для получения коллекции идентификаторов объектов, относительный порядок которых определяется данным объектом DrawOrderTable. Ничего не делает в текущей реализации.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectIdCollection GetRelativeDrawOrder( unsigned char honorSortEntitiesMask );
Копировать Код
Public Function GetRelativeDrawOrder( honorSortEntitiesMask As unsigned char ) As ObjectIdCollection
 Параметры
 Параметры
 Описание
 honorSortEntitiesMask
 Маска порядка сортировки. Тип unsigned char. В текущей версии не используется.
 Возвращает
 Возвращает упорядоченную коллекцию идентификаторов объектов. Тип ObjectIdCollection.
 Описание
 Метод предназначен для получения коллекции идентификаторов объектов, относительный порядок которых определяется данным объектом DrawOrderTable.
 Ничего не делает в текущей реализации.
 Ссылки
 Teigha.DatabaseServices.DrawOrderTable, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!