Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.TableStyle.DataType
 Послать отзыв
 Метод позволяет получить тип данных в строке указанного типа.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual DatabaseServices.DataType DataType( RowType rowType );
Копировать Код
Public Overridable Function DataType( rowType As RowType ) As DatabaseServices.DataType
 Параметры
 Параметры
 Описание
 rowType
 Тип строки. Перечисление RowType.
 Возвращает
 Возвращает тип данных в строке согласно типу строки. Тип DatabaseServices.DataType.
 Описание
 Метод позволяет получить тип данных в строке указанного типа.
 Ссылки
 Teigha.DatabaseServices.TableStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!