Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbCurve2d.NurbCurve2d
 Послать отзыв
 Конструктор по умолчанию класса NurbCurve2d. Создаваемые им объекты не содержат никаких данных.
 Синтаксис
C#
Visual Basic
Копировать Код
public NurbCurve2d();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса NurbCurve2d. Создаваемые им объекты не содержат никаких данных.
 Ссылки
 Teigha.Geometry.NurbCurve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!