Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.PlotStyleNameDictionaryId
 Послать отзыв
 Синтаксис
C#
Visual Basic
public DatabaseServices::ObjectId PlotStyleNameDictionaryId;
Public Property PlotStyleNameDictionaryId() As DatabaseServices.ObjectId
 Описание
 Возвращает Id словаря имен стилей печати базы данных.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!