Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Solid3dMassProperties.Centroid
 Послать отзыв
 Свойство Centroid представляет центр тяжести твердого тела.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d Centroid;
Копировать Код
Public ReadOnly Property Centroid As Point3d
 Возвращает
 Возвращает координатную точку центра тяжести твердого тела. Тип Point3d.
 Описание
 Свойство Centroid представляет центр тяжести твердого тела.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Solid3dMassProperties, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!