Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotSettings.PlotTransparency
 Послать отзыв
 Свойство PlotTransparency позволяет определить, включён ли учет прозрачности при печати.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool PlotTransparency;
Копировать Код
Public Property PlotTransparency As Boolean
 Возвращает
 Возвращает true, если прозрачность учитывается при печати. В противном случае возвращает false.
 Описание
 Свойство PlotTransparency позволяет определить, включён ли учет прозрачности при печати.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.PlotSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!