Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CircularArc3d.ReferenceVector
 Послать отзыв
 Свойство ReferenceVector представляет опорный вектор отсчета углов дуги.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d ReferenceVector;
Копировать Код
Public ReadOnly Property ReferenceVector As Vector3d
 Возвращает
 Возвращает опорный вектор дуги. Тип Vector3d.
 Описание
 Свойство ReferenceVector представляет опорный вектор отсчета углов дуги.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.CircularArc3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!