Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Surface.ClosestPointTo
 Послать отзыв
 Метод вычисляет на данной поверхности точку, которая является ближайшей к указанной точке в пределах заданной точности.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d ClosestPointTo( Point3d point, Tolerance tolerance );
Копировать Код
Public Function ClosestPointTo( point As Point3d, tolerance As Tolerance ) As Point3d
 Параметры
 Параметры
 Описание
 point
 Входная точка, для которой следует найти ближайшую к ней точку на данной поверхности. Тип Point3d.
 tolerance
 Заданная геометрическая точность. Тип Tolerance.
 Возвращает
 Возвращает точку на поверхности, минимально удаленную от точки point. Тип Point3d.
 Описание
 Метод вычисляет на данной поверхности точку, которая является ближайшей к указанной точке в пределах заданной точности.
 Ссылки
 Teigha.Geometry.Surface, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!