Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CellRange.ContentColor
 Послать отзыв
 Свойство обеспечивает доступ к цвету содержимого ячеек диапазона.
 Синтаксис
C#
Visual Basic
Копировать Код
public Colors.Color ContentColor;
Копировать Код
Public Property ContentColor As Colors.Color
 Возвращает
 Возвращает цвет содержимого ячеек диапазона. Тип Colors.Color.
 Описание
 Свойство обеспечивает доступ к цвету содержимого ячеек диапазона.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.CellRange, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!