Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbCurve3d.NurbCurve3d
 Послать отзыв
 Конструктор класса NurbCurve3d. Создает трехмерную кривую, которая с предписанной точностью интерполирует заданный массив трехмерных точек и опционально учитывает указанные направления касательных в начальной и конечной точках.
 Синтаксис
C#
Visual Basic
Копировать Код
public NurbCurve3d( ref Point3dCollection fitPoints, Vector3d startTangent, Vector3d endTangent, bool startTangentDefined, bool endTangentDefined, Tolerance fitTolerance );
Копировать Код
Public Sub New( ByRef fitPoints As Point3dCollection, startTangent As Vector3d, endTangent As Vector3d, startTangentDefined As Boolean, endTangentDefined As Boolean, fitTolerance As Tolerance )
 Параметры
 Параметры
 Описание
 fitPoints
 Массив определяющих точек для интерполирующей кривой. Тип Point3dCollection.
 startTangent
 Вектор касательной в начальной точке. Тип Vector3d.
 endTangent
 Вектор касательной в конечной точке. Тип Vector3d.
 startTangentDefined
 Флаг, который указывает, что следует использовать аргумент startTangent. Тип bool.
 endTangentDefined
 Флаг, который указывает, что следует использовать аргумент endTangent. Тип bool.
 fitTolerance
 Заданная точность интерполяции. Тип Tolerance.
 Описание
 Конструктор класса NurbCurve3d. Создает трехмерную кривую, которая с предписанной точностью интерполирует заданный массив трехмерных точек и опционально учитывает указанные направления касательных в начальной и конечной точках.
 Замечания
 Если флаг startTangentDefined снят (равен false), аргумент startTangent игнорируется, а вектор касательной в начальной точке вычисляется конструктором. Соответственно, если снят флаг endTangentDefined (равен false), то игнорируется аргумент endTangent, а вектор касательной в конечной точке вычисляется конструктором.
 Ссылки
 Teigha.Geometry.NurbCurve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!