Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.BeginWblockEntireDatabaseEventArgs.From
 Послать отзыв
 Свойство предоставляет доступ к базе данных, для которой выполняется операция Wblock.
 Синтаксис
C#
Visual Basic
Копировать Код
public Database From;
Копировать Код
Public Property From() As Database
 Возвращает
 Возвращает объект базы данных. Тип Database.
 Описание
 Свойство предоставляет доступ к базе данных, для которой выполняется операция Wblock.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.BeginWblockEntireDatabaseEventArgs, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!