Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Matrix3d.Inverse
 Послать отзыв
 Метод позволяет получить матрицу, обратную по отношению к данной матрице.
 Синтаксис
C#
Visual Basic
Копировать Код
public Matrix3d Inverse();
Копировать Код
Public Function Inverse() As Matrix3d
 Возвращает
 Возвращает обратную матрицу. Тип Matrix3d.
 Описание
 Метод позволяет получить матрицу, обратную по отношению к данной матрице.
 Ссылки
 Teigha.Geometry.Matrix3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!