Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GradientBackground.ColorTop
 Послать отзыв
 Свойство обеспечивает доступ к верхнему цвету градиентного фона.
 Синтаксис
C#
Visual Basic
Копировать Код
public EntityColor ColorTop;
Копировать Код
Public Property ColorTop As EntityColor
 Возвращает
 Возвращает верхний цвет градиента. Тип Teigha.Colors.EntityColor.
 Описание
 Свойство обеспечивает доступ к верхнему цвету градиентного фона.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.GradientBackground, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!