Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Entity.MoveGripPointsAtSubentityPaths(FullSubentityPath[]
 Послать отзыв
 Метод применяет смещение, заданное вектором offset, к выбранным точкам растяжения геометрического объекта, определённым в массиве appData, и позволяет точно указать, какие подобъекты участвуют в операции с помощью массива subPaths. Порядок и значения индексов определяются согласованной реализацией метода GetStretchPoints() в производных классах.
 Синтаксис
C#
Visual Basic
Копировать Код
public void MoveGripPointsAtSubentityPaths(FullSubentityPath[] subPaths, IntPtr[] appData, Vector3d offset, MoveGripPointsFlags bitFlags);
Копировать Код
Public Sub MoveGripPointsAtSubentityPaths(subPaths As FullSubentityPath[], appData As IntPtr[], offset As Vector3d, bitFlags As MoveGripPointsFlags)
 Параметры
 Параметры
 Описание
 subPaths
 Массив путей к подобъектам, указывающий, какие именно подобъекты текущего объекта участвуют в операции. Каждый путь однозначно идентифицирует конкретный подобъект, например, ребро, вершину или грань сложного объекта. Тип FullSubentityPath[].
 appData
 Массив указателей на объекты, представляющие собой данные о ручках, связанных с подобъектами. Эти данные определяют, какие именно точки будут изменены при применении смещения. Тип IntPtr[]
 offset
 Вектор смещения в мировой системе координат (WCS), задающий направление и величину перемещения выбранных ручек. Все указанные ручки перемещаются на одно и то же значение этого вектора. Тип Vector3d
 bitFlags
 Битовая маска флагов из перечисления, которая управляет дополнительным поведением во время перемещения ручек. Может использоваться для указания специфичных режимов, таких как обновление привязок, отрисовка или другие действия, зависящие от реализации. Тип MoveGripPointsFlags
 Описание
 Использование метода
 Этот метод предназначен для вызова из nanoCAD во время выполнения команды растяжения геометрического объекта. Тем не менее, он может быть вызван из приложений, если это требуется.
 Вызову этого метода должен предшествовать вызов метода GetStretchPoints() геометрического объекта, чтобы получить действительные точки растяжения и порядок, в котором они приходят, чтобы определить значения индекса, которые передаются в массив indices.
 Вектор offset определяет направление и величину преобразования, которое применяется к точкам растяжения, определенным в indices.
 Конечный результат заключается в том, что метод изменяет геометрический объект любым способом, при котором точки растяжения, определенные индексными значениями в indices, будут передвинуты в направлении и на величину, определяемую вектором offset.
 Выполнение метода в производных классах
 Этот метод должен изменить геометрический объект так, что точки растяжения, определенные в массиве indices, преобразуются по направлению и величине, определенными вектором offset (заданном в WCS координатах). Как это воздействует на остальные точки геометрического объекта, зависит от вида объекта, но и другие обстоятельства также должны быть учтены методом, т.к. ожидается, что метод произведет изменение всего геометрического объекта в результате выполнения операции переноса.
 Если метод разрабатывается в производных классах, то также должен быть разработан метод GetStretchPoints(), поскольку значения индекса в массиве indices представляют начинающиеся с 0 индексы точек растяжения, добавляемые в массив методом GetGripPoints(). Так, значение индекса в массиве indices, равное 0, соответствует первой точке, которую метод GetStretchPoints() добавил в массив, переданный из этого метода, значение 1 индекса соответствует второй точке и т.д. Например, если пользователь "растягивал" бы объект по 1-ой и 3-им точкам, добавленным методом GetStretchPoints(), то массив indices имел бы 2 элемента. Первый был бы 0, а второй — 2.
 Из-за зависимости данного метода от метода GetStretchPoints(), является абсолютно необходимым, чтобы метод точно знал, какие точки задаются методом GetStretchPoints() и в каком порядке (это порядок, в каком точки добавляются в массив, передаваемый из метода GetStretchPoints()).
 Выполнение по умолчанию
 Заключается в вызове метода Entity.TransformBy() с матрицей преобразования, которая преобразовывает весь геометрический объект на основании offset. Он затем возвращает тот статус, который возвращает метод TransformBy().
 Ссылки
 Teigha.DatabaseServices.Entity, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!