Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CompositeParameter.IsEqualTo
 Послать отзыв
 Метод предназначен для проверки данного объекта на равенство переданному объекту CompositeParameter.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsEqualTo( CompositeParameter a );
Копировать Код
Public Function IsEqualTo( a As CompositeParameter ) As Boolean
 Параметры
 Параметры
 Описание
 a
 Входной объект, с которым проверяется равенство. Тип CompositeParameter.
 Возвращает
 Возвращает true, если оба объекта не являются нулевыми и одновременно выполняются следующие условия:
Индексы подкривых совпадают.
Значения локальных параметров равны.
 В противном случае возвращает false.
 Описание
 Метод предназначен для проверки данного объекта на равенство переданному объекту CompositeParameter.
 Ссылки
 Teigha.Geometry.CompositeParameter, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!