Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Section.BottomPlane
 Послать отзыв
 Свойство BottomPlane представляет высоту индикатора секущей плоскости ниже линии сечения.
 Синтаксис
C#
Visual Basic
Копировать Код
public double BottomPlane;
Копировать Код
Public Property BottomPlane As Double
 Возвращает
 Возвращает высоту индикатора. Тип double.
 Описание
 Свойство BottomPlane представляет высоту индикатора секущей плоскости ниже линии сечения.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Section, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!