Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CellRange.Item
 Послать отзыв
 Свойство возвращает ячейку с указанными индексами строки и столбца.
 Синтаксис
C#
Visual Basic
Копировать Код
public Cell this[int row, int column];
Копировать Код
Default Public ReadOnly Property Item( row As Integer, column As Integer ) As Cell
 Параметры
 Параметры
 Описание
 row
 Индекс строки. Тип int.
 column
 Индекс столбца. Тип int.
 Возвращает
 Возвращает ячейку диапазона с указанными индексами строки и столбца. Тип Cell.
 Описание
 Свойство возвращает ячейку с указанными индексами строки и столбца.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.CellRange, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!