Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LinkedTableData.SetDataLink
 Послать отзыв
 Метод позволяет задать в указанной ячейке идентификатор внешней ссылки.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetDataLink( int row, int column, DatabaseServices.ObjectId dataLinkId, bool bUpdate );
Копировать Код
Public Overridable Sub SetDataLink( row As Integer, column As Integer, dataLinkId As DatabaseServices.ObjectId, bUpdate As Boolean )
 Параметры
 Параметры
 Описание
 row
 Индекс строки. Тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 column
 Индекс столбца. Тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице.
 dataLinkId
 Идентификатор внешней ссылки. Тип DatabaseServices.ObjectId.
 bUpdate
 Флаг, указывающий, следует ли обновить данные по указанной внешней ссылке. Тип bool.
 Описание
 Метод позволяет задать в указанной ячейке идентификатор внешней ссылки.
 Замечания
 Метод выбрасывает исключение eNotThatKindOfClass, если переданный параметр dataLinkId не является идентификатором объекта DataLink.
 Ссылки
 Teigha.DatabaseServices.LinkedTableData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!