Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство IdPair.Key
 Послать отзыв
 This is Key, a member of class IdPair.
 Синтаксис
C#
Visual Basic
public ObjectId Key;
Public Property Key() As ObjectId
 Ссылки
 IdPair Структура, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!