Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.RevolveOptions.RevolveOptions
 Послать отзыв
 Конструктор класса RevolveOptions. Позволяет создать новый экземпляр как копию предоставленного объекта данного класса.
 Синтаксис
C#
Visual Basic
Копировать Код
public RevolveOptions( ref RevolveOptions opts );
Копировать Код
Public Sub New( ByRef opts As RevolveOptions )
 Параметры
 Параметры
 Описание
 opts
 Входной объект для копирования. Тип RevolveOptions.
 Описание
 Конструктор класса RevolveOptions. Позволяет создать новый экземпляр как копию предоставленного объекта данного класса.
 Ссылки
 Teigha.DatabaseServices.RevolveOptions, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!