Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.TransformOverrule.HideMeForDragging
 Послать отзыв
 Метод проверяет, должен ли указанный объект быть скрытым для операций перетаскивания.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual bool HideMeForDragging( ref Entity entity );
Копировать Код
Public virtual Function HideMeForDragging( ByRef entity As Entity ) As Boolean
 Параметры
 Параметры
 Описание
 entity
 Проверяемый объект чертежа, тип Entity.
 Возвращает
 Возвращает true, если объект entity должен быть скрыт для операции перетаскивания, в противном случае возвращает false.
 Описание
 Метод проверяет, должен ли указанный объект быть скрытым для операций перетаскивания.
 Ссылки
 Teigha.DatabaseServices.TransformOverrule, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!