Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocArray.AddSourceEntity
 Послать отзыв
 Метод добавляет указанный геометрический объект в список исходных элементов ассоциативного массива.
 Синтаксис
C#
Visual Basic
Копировать Код
public void AddSourceEntity( ObjectId sourceEntity, Point3d basePoint );
Копировать Код
Public Sub AddSourceEntity( sourceEntity As ObjectId, basePoint As Point3d )
 Параметры
 Параметры
 Описание
 sourceEntity
 Идентификатор добавляемого исходного объекта. Тип ObjectId.
 basePoint
 Точка, которая используется для позиционирования вновь добавленного исходного объекта. Тип Point3d.
 Описание
 Метод добавляет указанный геометрический объект в список исходных элементов ассоциативного массива. Добавленный объект отправляется на скрытый заблокированный слой и управляется соответствующим действием.
 Ссылки
 Teigha.DatabaseServices.AssocArray, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!