Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Filletrad
 Послать отзыв
 Синтаксис
C#
Visual Basic
public double Filletrad;
Public Property Filletrad() As Double
 Описание
 Возвращает или устанавливает текущее значение FILLETRAD для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!