Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Group.SetColorIndex
 Послать отзыв
 Метод позволяет назначить всем объектам данной группы новый цвет, указанный индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetColorIndex( int color );
Копировать Код
Public Sub SetColorIndex( color As Integer )
 Параметры
 Параметры
 Описание
 color
 Индекс нового цвета объектов группы. Тип int.
 Описание
 Метод позволяет назначить всем объектам данной группы новый цвет, указанный индексом color.
 Ссылки
 Teigha.DatabaseServices.Group, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!