Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AlignedDimension.AlignedDimension
 Послать отзыв
 Конструктор по умолчанию.
 Синтаксис
C#
Visual Basic
Копировать Код
public AlignedDimension();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию создает новый объект AlignedDimension, у которого точка привязки размерной линии и обе начальные точки выносных линий установлены в положение (0,0,0). Угол наклона размерной линии равен 0.0. Кроме того, выполняются конструкторы по умолчанию родительских классов Dimension, Entity и др.
 Ссылки
 Teigha.DatabaseServices.AlignedDimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!