Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbCurve3dData.Degree
 Послать отзыв
 Свойство Degree представляет степень NURBS кривой.
 Синтаксис
C#
Visual Basic
Копировать Код
public int Degree;
Копировать Код
Public ReadOnly Property Degree As Integer
 Возвращает
 Возвращает степень NURBS кривой. Тип int.
 Описание
 Свойство Degree представляет степень NURBS кривой.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.NurbCurve3dData, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!