Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.PointOnSurface.GetInverseTangentVector
 Послать отзыв
 Проецирует заданный 3D-вектор на плоскость, касательную к указанной поверхности в точке с заданными параметрическими координатами, и возвращает вектор в параметрическом 2D-пространстве, который отображается на полученный вектор-проекцию. В текущей версии не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public static Vector2d GetInverseTangentVector( Vector3d vector, ref Surface surf, Point2d point );
Копировать Код
Public Shared Function GetInverseTangentVector( vector As Vector3d, ByRef surf As Surface, point As Point2d ) As Vector2d
 Параметры
 Параметры
 Описание
 vector
 Входной вектор, который проецируется на касательную плоскость в точке point. Тип Vector3d.
 surf
 Входная поверхность. Тип Surface.
 point
 Входная точка на поверхности, заданная в пространстве параметров. Тип Point2d. Координата point.x определяет значение параметра точки по оси u, а координата point.y - значение параметра по оси v.
 Возвращает
 Возвращает 2D-вектор в пространстве параметров, который отображается на проекцию вектора vector. Тип Vector2d
 Описание
 Проецирует входной 3D-вектор vector на плоскость, касательную к входной поверхности surf в точке с заданными параметрическими координатами, и возвращает вектор в параметрическом 2D-пространстве, который отображается на полученный вектор-проекцию. В текущей версии этот метод не реализован.
 Ссылки
 Teigha.Geometry.PointOnSurface, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!