Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Point3d.Origin
 Послать отзыв
 Свойство возвращает начало координат 3D-пространства данной точки.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d Origin;
Копировать Код
Public Property Origin() As Point3d
 Возвращает
 Возвращает точку начала координат. Тип Point3d.
 Описание
 Свойство возвращает начало координат 3D-пространства данной точки.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.Point3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!