Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocArray.DeleteItem
 Послать отзыв
 Метод позволяет пометить указанный по индексу элемент ассоциативного массива для удаления или для отмены удаления.
 Синтаксис
C#
Visual Basic
Копировать Код
public void DeleteItem( ItemLocator index, bool bErase );
Копировать Код
Public Sub DeleteItem( index As ItemLocator, bErase As Boolean )
 Параметры
 Параметры
 Описание
 index
 Индекс элемента массива. Тип ItemLocator.
 bErase
 Флаг, указывающий, следует ли стереть (значение true) или отменить удаление элемента по указанному индексу (значение false). Тип bool.
 Описание
 Метод позволяет пометить элемент ассоциативного массива с указанным индексом для удаления или для отмены удаления. Элемент, помеченный как удаленный, переводится в скрытое состояние.
 Ссылки
 Teigha.DatabaseServices.AssocArray, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!