Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ImageOrg
 Послать отзыв
 Перечисление ImageOrg определяет схему организации пикселей в исходном файле изображения.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum ImageOrg { Bitonal = 0, Palette = 1, Gray = 2, RGBA = 3, BGRA = 4, ARGB = 5, ABGR = 6, BGR = 7, RGB = 8 }
Копировать Код
Public Enum ImageOrg Bitonal = 0 Palette = 1 Gray = 2 RGBA = 3 BGRA = 4 ARGB = 5 ABGR = 6 BGR = 7 RGB = 8 End Enum
 Члены
 Члены
 Описание
 Bitonal
 Значение: 0. Двухтональное изображение. 1 бит на пиксель.
 Palette
 Значение: 1. Палитра, использующая 8 бит на пиксель.
 Gray
 Значение: 2. Изображение в оттенках серого. 8 бит на пиксель, где значение 0 кодирует черный цвет, а 255 — белый цвет.
 RGBA
 Значение: 3. Изображение RGBA, красный-зеленый-синий-альфа (red-green-blue-alpha). 32 бита на пиксель.
 BGRA
 Значение: 4. Изображение BGRA, синий-зеленый-красный-альфа (blue-green-red-alpha). 32 бита на пиксель.
 ARGB
 Значение: 5. Изображение ARGB, альфа-красный-зеленый-синий (alpha-red-green-blue). 32 бита на пиксель.
 ABGR
 Значение: 6. Изображение ABGR, альфа-синий-зеленый-красный (alpha-blue-green-red). 32 бита на пиксель.
 BGR
 Значение: 7. Изображение BGR, синий-зеленый-красный (blue-green-red). 24 бита на пиксель.
 RGB
 Значение: 8. Изображение RGB, красный-зеленый-синий (red-green-blue). 24 бита на пиксель.
 Описание
 Перечисление ImageOrg определяет схему организации пикселей в исходном файле изображения.
 Ваши комментарии по поводу этого топика: Послать отзыв!