Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.SelectSubRegion
 Послать отзыв
 Метод позволяет выделить набор ячеек таблицы, используя заданное окно, направление взгляда и ориентацию, а также вернуть подобъекты ячейки.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual CellRange SelectSubRegion( Point3d cornerPoint1, Point3d cornerPoint2, Vector3d selectionViewDirection, Vector3d hitTestViewDirection, SelectType selectionType, bool includeCurrentSelection, bool inPickFirst, FullSubentityPath[] paths );
Копировать Код
Public virtual Function SelectSubRegion( cornerPoint1 As Point3d, cornerPoint2 As Point3d, selectionViewDirection As Vector3d, hitTestViewDirection As Vector3d, selectionType As SelectType, includeCurrentSelection As Boolean, inPickFirst As Boolean, ByRef paths As FullSubentityPath[] ) As CellRange
 Параметры
 Параметры
 Описание
 selectionViewDirection
 3D-вектор в WCS, задающий направление взгляда при выделении. Тип Vector3d. Vector3d hitTestViewDirection : 3D-вектор в WCS, задающий ориентацию вида при выделении. Тип Vector3d.
 selectionType
 Аргумент из перечисления SelectType, задающий тип выделения окном (Crossing или Window).
 includeCurrentSelection
 Флаг System.Boolean, определяющий, должен ли возвращаемый набор выделенных ячеек включать предварительно выделенные ячейки или только вновь выделенные ячейки.
 inPickFirst
 Флаг System.Boolean, который определяет, находится ли объект уже в наборе pickfirst (значение true) или логика pick first должна попытаться выделить объект напрямую (значение false).
 paths
 Выходной массив путей подобъектов. Тип FullSubentityPath[].
 anglePoint1
 3D-точка, задающая первый угол окна выделения. Тип Point3d. Задается в мировой системе координат (WCS).
 anglePoint2
 3D-точка, задающая второй угол окна выделения. Тип Point3d. Задается в WCS.
 Возвращает
 Возвращает диапазон выделенных ячеек. Тип CellRange.
 Описание
 Метод позволяет выделить набор ячеек таблицы, используя заданное окно, направление взгляда и ориентацию. Если массив paths не равен нулю, в нём будут возвращены подобъекты ячейки, включая обрамляющие линии сетки, MText и вхождения блоков.
 Замечания
 Метод не реализован.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!