Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FieldEvaluator.Evaluate
 Послать отзыв
 Метод предназначен для вычисления значения поля.
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract void Evaluate( ref Field pField, int nContext, ref Database pDb, ref FieldResult pResult );
Копировать Код
Public MustOverride Sub Evaluate( ByRef pField As Field, nContext As Integer, ByRef pDb As Database, ByRef pResult As FieldResult )
 Параметры
 Параметры
 Описание
 pField
 Поле, которое должно быть вычислено. Тип Field.
 nContext
 Контекст вычисления поля. Этот флаг контекста передается вычислителю и может быть одним из предопределенных флагов из перечисления FieldEvaluationOptions или пользовательским флагом контекста. Тип int.
 pDb
 Указатель базы данных, который может равняться null, если в текущем контексте база данных недоступна. Тип Database.
 pResult
 Объект результата вычисления поля, в котором задается сам результат вычисления и статус ошибки. Тип FieldResult.
 Описание
 Метод предназначен для вычисления значения поля.
 Замечания
 Этот метод вызывается фреймворком поля всякий раз, когда значение поля требуется перевычислить.
 Поле вычисляется только тогда, когда заданная в этом поле опция вычисления соответствует контексту, в котором вызывается вычисление поля. Например, если опцией предусмотрено вычисление только вручную, то вычисление производится только при обновлении определенного поля или всех полей в чертеже вручную.
 Вычислитель должен перевычислить поле и задать полученное значение с помощью метода FieldResult.SetFieldValue() и статус ошибки с помощью метода FieldResult.setEvaluationStatus() в переданном объекте FieldResult, который, в свою очередь, задает их в объекте Field.
 Переданный указатель базы данных может быть нулевым, если поле не является резидентным в базе данных, и база данных не может быть получена в текущем контексте. Если же для вычисления поля база данных необходима, этот метод может задать статус ошибки в объекте FieldResult поля и вернуть ошибку.
 Если вычисление не удалось, кэшированный ранее результат в объекте Field можно оставить без изменений и использовать в качестве значения поля. В качестве альтернативы кэшированный результат можно удалить и заменить строкой ошибки (например, "#ERR"), которая будет отображаться как значение поля.
 Ссылки
 Teigha.DatabaseServices.FieldEvaluator, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!