Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Row.MinimumHeight
 Послать отзыв
 Свойство MinimumHeight представляет минимальную высоту строки.
 Синтаксис
C#
Visual Basic
Копировать Код
public double MinimumHeight;
Копировать Код
Public Property MinimumHeight As Double
 Возвращает
 Возвращает минимальную высоту строки. Тип double.
 Описание
 Свойство MinimumHeight представляет минимально допустимую высоту данной строки.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Row, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!