Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство DBText.TextStyleName
 Послать отзыв
 Синтаксис
C#
Visual Basic
public String TextStyleName;
Public Property TextStyleName() As String
 Описание
 Возвращает имя используемого текстового стиля.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.DBText, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!