Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.GeoDataObject
 Послать отзыв
 This is GeoDataObject, a member of class Database.
 Синтаксис
C#
Visual Basic
public ObjectId GeoDataObject;
Public Property GeoDataObject() As ObjectId
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!