Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Line2d.Set
 Послать отзыв
 Метод позволяет переопределить данную прямую, используя новые опорную точку и направляющий вектор.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Set( Point2d point, Vector2d vector );
Копировать Код
Public Sub [Set]( point As Point2d, vector As Vector2d )
 Параметры
 Параметры
 Описание
 point
 Новая точка, через которую проходит прямая. Тип Point2d.
 vector
 Новый направляющий вектор прямой. Тип Vector2d.
 Описание
 Метод позволяет переопределить данную прямую, используя новые опорную точку и направляющий вектор.
 Ссылки
 Teigha.Geometry.Line2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!