Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.SplineEntity3d.NumberOfKnots
 Послать отзыв
 Свойство NumberOfKnots представляет количество узлов в узловом векторе данного сплайна. Не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public int NumberOfKnots;
Копировать Код
Public ReadOnly Property NumberOfKnots As Integer
 Возвращает
 Возвращает количество узлов в узловом векторе данного сплайна. Тип int.
 Описание
 Свойство NumberOfKnots представляет количество узлов в узловом векторе данного сплайна. Не реализовано.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.SplineEntity3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!