Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.IdMapping.OriginalDatabase
 Послать отзыв
 Свойство обеспечивает доступ к исходной базе данных для операции глубокого клонирования, в которой используется этот объект IdMapping.
 Синтаксис
C#
Visual Basic
Копировать Код
public Database OriginalDatabase;
Копировать Код
Public ReadOnly Property OriginalDatabase As Database
 Возвращает
 Возвращает исходную базу данных. Тип Database.
 Описание
 Свойство обеспечивает доступ к исходной базе данных для операции глубокого клонирования, в которой используется этот объект IdMapping.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.IdMapping, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!