Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.UnderlayHost.PdfHost
 Послать отзыв
 Свойство PdfHost представляет текущее хост-приложение для подложки PDF.
 Синтаксис
C#
Visual Basic
Копировать Код
public static UnderlayHost PdfHost;
Копировать Код
Public Shared ReadOnly Property PdfHost As UnderlayHost
 Возвращает
 Возвращает хост-приложение для подложки PDF. Тип UnderlayHost.
 Описание
 Свойство PdfHost представляет текущее хост-приложение для подложки PDF.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.UnderlayHost, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!