Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Solid.Thickness
 Послать отзыв
 Свойство Thickness представляет толщину данного 2D твердого тела (в единицах чертежа).
 Синтаксис
C#
Visual Basic
Копировать Код
public double Thickness;
Копировать Код
Public Property Thickness As Double
 Возвращает
 Возвращает толщину данного объекта в направлении вектора нормали. Тип double.
 Описание
 Свойство Thickness возвращает толщину этого 2D твердого тела (в единицах чертежа). Толщина представляет собой размер тела в направлении вектора нормали Normal. Для толщины используется группа DXF с кодом 39.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Solid, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!