Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Класс Teigha.DatabaseServices.ViewTableRecord
 Послать отзыв
 Класс предназначен для хранения определения именованного вида.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::GraphicsInterface::Drawable Teigha::DatabaseServices::DBObject Teigha::DatabaseServices::SymbolTableRecord Teigha::DatabaseServices::AbstractViewTableRecord Teigha::DatabaseServices::ViewTableRecord
 Синтаксис
C#
Visual Basic
[Wrapper("AcDbViewTableRecord")] public class ViewTableRecord : AbstractViewTableRecord;
<Wrapper("AcDbViewTableRecord")> Public Class ViewTableRecord Inherits AbstractViewTableRecord
 Описание
 Класс предназначен для хранения определения именованного вида. Определение именованного вида представляет из себя набор настроек вида. Именованный вид всегда относится к какому-либо листу.
 Управление настройками именованного вида возможно как через API, так и через пользовательский интерфейс с помощью команды ВИД -> Свойства вида. Все настройки именованных видов, которые есть в пользовательском интерфейсе, также доступны и через API в виде свойств класса ViewTableRecord.
 Для создания нового именованного вида необходимо обязательно указать его название. Все остальные свойства имеют значения по умолчанию.
 Пример
 В качестве примера приведена команда ADDNAMEDVIEW, которая создает именованный вид в чертеже для пространства модели и делает его активным.
C#
 Копировать Код
 public partial class Commands { [Teigha.Runtime.CommandMethod("AddNamedView")] public void AddNamedView() { // Получение ссылки на активный документ HostMgd.ApplicationServices.Document doc = HostMgd.ApplicationServices.Application.DocumentManager.MdiActiveDocument; // Получение ссылки на редактор докумена HostMgd.EditorInput.Editor ed = doc.Editor; // Получение ссылки на базу данных документа Teigha.DatabaseServices.Database db = doc.Database; // Создаем новый именованный вид, который по умолчанию будет относиться к пространству модели, // если не указать иное Teigha.DatabaseServices.ViewTableRecord newView = new Teigha.DatabaseServices.ViewTableRecord(); newView.Name = "newView"; // Начало транзакции с базой данных документа using (Teigha.DatabaseServices.Transaction trans = db.TransactionManager.StartTransaction()) { // Открываем таблицу именованных видов для записи Teigha.DatabaseServices.ViewTable viewTable = trans.GetObject(db.ViewTableId, Teigha.DatabaseServices.OpenMode.ForWrite) as Teigha.DatabaseServices.ViewTable; // Добавляем новый вид в таблицу именованных видов. // Той же операцией он добавится и в базу данных чертежа try { viewTable.Add(newView); } catch (Teigha.Runtime.Exception ex) { if (ex.ErrorStatus == Teigha.Runtime.ErrorStatus.DuplicateRecordName) { ed.WriteMessage($"Вид с названием {newView.Name} уже существует.");} } // Устанавливаем новому виду изометрический виду СВ изометрию newView.ViewDirection = new Teigha.Geometry.Vector3d(1, 1, 1); // Устанавливаем высоту и ширину вида, это влияет на масштаб // отображения чертежа на экране newView.Width = 90000; newView.Height = 37000; // Сохраняем именованный вид в чертеже, завершив транзакцию trans.Commit(); } // Устанавливаем новый именованный вид текущим string[] strings = { "View", "_restore", newView.Name }; ed.Command(strings); } }
 Проверим работу команды на 3D-модели кубика Рубика.
 Его начальный вид:
 На рисунке выше в левом нижнем углу видно, что именованные виды в документе отсутствуют. Вызываем команду ADDNAMEDVIEW. Что видим на экране в результате:
 Появился именованный вид пространства модели, отображение кубика поменялось с ЮВ на СЗ.
 Методы
 Конструкторы
 Teigha.GraphicsInterface.Drawable
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 Drawable
 Конструктор класса Teigha.GraphicsInterface.Drawable. (Унаследован от Drawable)
 Teigha.DatabaseServices.DBObject
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 DBObject
 Конструктор. (Унаследован от DBObject)
 Teigha.DatabaseServices.SymbolTableRecord
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 SymbolTableRecord
 This is SymbolTableRecord, a member of class SymbolTableRecord. (Унаследован от SymbolTableRecord)
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.GraphicsInterface.Drawable
 Имя
 Описание
 Drawable Методы
 Ниже перечислены методы класса Drawable.
 Drawable Свойства
 Ниже перечислены свойства класса Drawable.
 Teigha.DatabaseServices.DBObject
 Имя
 Описание
 DBObject Методы
 Ниже перечислены методы класса DBObject.
 DBObject Свойства
 Ниже перечислены свойства класса DBObject.
 DBObject События
 Ниже перечислены события класса DBObject.
 Teigha.DatabaseServices.SymbolTableRecord
 Имя
 Описание
 SymbolTableRecord Свойства
 Ниже перечислены свойства класса SymbolTableRecord.
 Teigha.DatabaseServices.AbstractViewTableRecord
 Имя
 Описание
 AbstractViewTableRecord Методы
 Ниже перечислены методы класса AbstractViewTableRecord.
 AbstractViewTableRecord Свойства
 Ниже перечислены свойства класса AbstractViewTableRecord.
 Класс Teigha.DatabaseServices.ViewTableRecord
 Имя
 Описание
 ViewTableRecord Методы
 Ниже перечислены методы класса ViewTableRecord.
 ViewTableRecord Свойства
 Ниже перечислены свойства класса ViewTableRecord.
 Ссылки
 ViewTableRecord Методы, ViewTableRecord Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства, DBObject События
 Ваши комментарии по поводу этого топика: Послать отзыв!