Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.RenderSettings.RenderSettings
 Послать отзыв
 Конструктор по умолчанию класса RenderSettings.
 Синтаксис
C#
Visual Basic
Копировать Код
public RenderSettings();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса RenderSettings.
 Ссылки
 Teigha.DatabaseServices.RenderSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!