Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.TableStyle.CellClass
 Послать отзыв
 Метод позволяет определить класс ячейки по имени стиля ячейки.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual DatabaseServices.CellClass CellClass( ref String styleName );
Копировать Код
Public Overridable Function CellClass( ByRef styleName As String ) As DatabaseServices.CellClass
 Параметры
 Параметры
 Описание
 styleName
 Имя стиля ячейки. Тип String.
 Возвращает
 Возвращает класс ячейки. Значение из перечисления DatabaseServices.CellClass.
 Описание
 Метод позволяет определить класс ячейки по имени стиля ячейки.
 Ссылки
 Teigha.DatabaseServices.TableStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!