Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbCurve2d.GetFitTangents
 Послать отзыв
 Метод предоставляет векторы касательных в начальной и конечной точках, если данный сплайн был построен методом определяющих точек.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector2d[] GetFitTangents();
Копировать Код
Public Function GetFitTangents() As Vector2d()
 Возвращает
 Возвращает векторы производных в начальной и конечной точках в виде массива из двух элементов. Тип Vector2d[].
 Описание
 Метод предоставляет векторы касательных в начальной и конечной точках, если данный сплайн был построен методом определяющих точек.
 Ссылки
 Teigha.Geometry.NurbCurve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!