Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector2d.IsPerpendicularTo
 Послать отзыв
 Метод проверяет перпендикулярность входного вектора данному вектору в пределах заданной точности.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsPerpendicularTo( Vector2d vector, Tolerance tolerance );
Копировать Код
Public Function IsPerpendicularTo( vector As Vector2d, tolerance As Tolerance ) As Boolean
 Параметры
 Параметры
 Описание
 vector
 Проверяемый вектор. Тип Vector2d.
 tolerance
 Заданная геометрическая точность. Тип Tolerance.
 Возвращает
 Возвращает true, если в пределах используемой точности векторы можно считать перпендикулярными. В противном случае возвращает false.
 Описание
 Метод проверяет перпендикулярность входного вектора vector данному вектору в пределах заданной точности tolerance.
 Замечания
 Реализация приводит оба вектора к единичной длине и вычисляет их скалярное произведение. Векторы считаются перпендикулярными, если полученное значение по модулю не превышает входное значение tolerance.
 Ссылки
 Teigha.Geometry.Vector2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!