Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Database.ForceWblockDatabaseCopy
 Послать отзыв
 Синтаксис
C#
Visual Basic
public void ForceWblockDatabaseCopy();
Public Sub ForceWblockDatabaseCopy()
 Описание
 Эта функция вызывается при последующем (и только при последующем) вызове метода Database.wblock() для данной базы данных, чтобы скопировать базу данных.
 При использовании этой функции замедляется работа операции wblock и увеличивается требуемая память. Однако, этот метод должен использоваться, если ваше приложение использует специальную обработку при выполнении событий WBLOCK*, которые могут возникнуть, если WBLOCK* копирует базу данных. Note Этот метод является нефункциональным, за исключением того, что он порождает событие wblockNotice.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!