Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.EdgeRef.EdgeRef
 Послать отзыв
 Конструктор класса EdgeRef по умолчанию.
 Синтаксис
C#
Visual Basic
Копировать Код
public EdgeRef();
Копировать Код
Public Sub New()
 Описание
 Конструктор класса EdgeRef по умолчанию.
 Ссылки
 Teigha.DatabaseServices.EdgeRef, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!