Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Hatch.SetGradient
 Послать отзыв
 Синтаксис
C#
Visual Basic
public void SetGradient(GradientPatternType gradientType, ref String gradientName);
Public Sub SetGradient(gradientType As GradientPatternType, ByRef gradientName As String)
 Параметры
 Параметры
 Описание
 gradientType
 Тип градиента
 gradientName
 Имя градиента для применения
 Описание
 Метод представляет механизм для задания определения заполнения градиента.
 Ссылки
 Teigha.DatabaseServices.Hatch, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!