Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SubDMesh.NumberOfEdges
 Послать отзыв
 Свойство представляеn доступ к количеству ребер на базовом уровне сети.
 Синтаксис
C#
Visual Basic
Копировать Код
public int NumberOfEdges;
Копировать Код
Public Property NumberOfEdges() As Integer
 Возвращает
 Возвращает количество ребер на базовом уровне сети, int.
 Описание
 Свойство представляеn доступ к количеству ребер на базовом уровне сети.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.SubDMesh, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!