Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.GetCustomData
 Послать отзыв
 Метод позволяет получить пользовательские данные, заданные в ячейке, строке или столбце.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual int GetCustomData( int row, int column );
Копировать Код
Public virtual Function GetCustomData( row As Integer, column As Integer ) As Integer
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс может равняться -1.
 col
 Индекс столбца, тип int. Индекс может равняться -1.
 Возвращает
 Возвращает значение типа int.
 Описание
 Метод позволяет получить пользовательские данные, заданные в ячейке, строке или столбце.
 Чтобы указать ячейку, следует задать допустимые индексы строки и столбца. Чтобы указать строку, следует задать допустимый индекс строки и -1 в качестве индекса столбца. Чтобы указать столбец, следует задать допустимый индекс столбца и -1 в качестве индекса строки.
 Замечания
 Для получения того же результата предпочтительнее использовать метод Table.Cells[row,column].GetCustomData.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!