Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DynamicBlockReferenceProperty
 Послать отзыв
 Класс DynamicBlockReferenceProperty является служебным классом, который обеспечивает доступ к свойствам вхождений динамических блоков.
 Иерархия классов
Teigha::DatabaseServices::DynamicBlockReferenceProperty
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdDbDynBlockReferenceProperty")] public class DynamicBlockReferenceProperty;
Копировать Код
<Wrapper("OdDbDynBlockReferenceProperty")> Public Class DynamicBlockReferenceProperty
 Описание
 Класс DynamicBlockReferenceProperty является служебным классом, который обеспечивает доступ к свойствам вхождений динамических блоков.
 Топики
 Имя
 Описание
 DynamicBlockReferenceProperty Методы
 Ниже перечислены методы класса DynamicBlockReferenceProperty.
 DynamicBlockReferenceProperty Свойства
 Ниже перечислены свойства класса DynamicBlockReferenceProperty.
 Ссылки
 DynamicBlockReferenceProperty Методы, DynamicBlockReferenceProperty Свойства, Топики, DynamicBlockReferenceProperty Методы, DynamicBlockReferenceProperty Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!