Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LineType
 Послать отзыв
 Перечисление LineType определяет поддерживаемые типы линий.
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdPs.LineType")] public enum LineType { LtpSolid = 0, LtpDashed = 1, LtpDotted = 2, LtpDashDot = 3, LtpShortDash = 4, LtpMediumDash = 5, LtpLongDash = 6, LtpShortDashX2 = 7, LtpMediumDashX2 = 8, LtpLongDashX2 = 9, LtpMediumLongDash = 10, LtpMediumDashShortDashShortDash = 11, LtpLongDashShortDash = 12, LtpLongDashDotDot = 13, LtpLongDashDot = 14, LtpMediumDashDotShortDashDot = 15, LtpSparseDot = 16, LtpISODash = 17, LtpISODashSpace = 18, LtpISOLongDashDot = 19, LtpISOLongDashDoubleDot = 20, LtpISOLongDashTripleDot = 21, LtpISODot = 22, LtpISOLongDashShortDash = 23, LtpISOLongDashDoubleShortDash = 24, LtpISODashDot = 25, LtpISODoubleDashDot = 26, LtpISODashDoubleDot = 27, LtpISODoubleDashDoubleDot = 28, LtpISODashTripleDot = 29, LtpISODoubleDashTripleDot = 30, LtpUseObject = 31, LtpLast = 31 }
Копировать Код
<Wrapper("OdPs.LineType")> Public Enum LineType LtpSolid = 0 LtpDashed = 1 LtpDotted = 2 LtpDashDot = 3 LtpShortDash = 4 LtpMediumDash = 5 LtpLongDash = 6 LtpShortDashX2 = 7 LtpMediumDashX2 = 8 LtpLongDashX2 = 9 LtpMediumLongDash = 10 LtpMediumDashShortDashShortDash = 11 LtpLongDashShortDash = 12 LtpLongDashDotDot = 13 LtpLongDashDot = 14 LtpMediumDashDotShortDashDot = 15 LtpSparseDot = 16 LtpISODash = 17 LtpISODashSpace = 18 LtpISOLongDashDot = 19 LtpISOLongDashDoubleDot = 20 LtpISOLongDashTripleDot = 21 LtpISODot = 22 LtpISOLongDashShortDash = 23 LtpISOLongDashDoubleShortDash = 24 LtpISODashDot = 25 LtpISODoubleDashDot = 26 LtpISODashDoubleDot = 27 LtpISODoubleDashDoubleDot = 28 LtpISODashTripleDot = 29 LtpISODoubleDashTripleDot = 30 LtpUseObject = 31 LtpLast = 31 End Enum
 Члены
 Члены
 Описание
 LtpSolid
 Значение: 0. Сплошная линия без разрывов.
 LtpDashed
 Значение: 1. Штриховая линия (чередование коротких штрихов и пробелов).
 LtpDotted
 Значение: 2. Пунктирная линия (чередование точек и пробелов).
 LtpDashDot
 Значение: 3. Штрихпунктирная линия (чередование штриха, точки и пробела).
 LtpShortDash
 Значение: 4. Штриховая линия с короткими штрихами (.5х).
 LtpMediumDash
 Значение: 5. Штриховая линия со штрихами средней длины.
 LtpLongDash
 Значение: 6. Штриховая линия с длинными штрихами (2х).
 LtpShortDashX2
 Значение: 7. Линия Фантом (.5х) с двойными короткими штрихами.
 LtpMediumDashX2
 Значение: 8. Линия Фантом с двойными штрихами обычной длины.
 LtpLongDashX2
 Значение: 9. Линия Фантом (2х) с двойными длинными штрихами.
 LtpMediumLongDash
 Значение: 10. Линия с чередованием средних и длинных штрихов.
 LtpMediumDashShortDashShortDash
 Значение: 11. Линия с чередованием среднего и двух коротких штрихов.
 LtpLongDashShortDash
 Значение: 12. Линия с чередованием длинного и короткого штрихов.
 LtpLongDashDotDot
 Значение: 13. Линия с чередованием длинного штриха и двух последовательных точек.
 LtpLongDashDot
 Значение: 14. Линия с чередованием длинного штриха и точки.
 LtpMediumDashDotShortDashDot
 Значение: 15. Линия с повторяющимся паттерном (средний штрих, точка, короткий штрих, точка).
 LtpSparseDot
 Значение: 16. Линия с повторяющимся паттерном из разреженных точек.
 LtpISODash
 Значение: 17. Стандарт ISO: штриховая линия.
 LtpISODashSpace
 Значение: 18. Стандарт ISO: штриховая линия с увеличенными пробелами.
 LtpISOLongDashDot
 Значение: 19. Стандарт ISO: повторяющийся паттерн из длинного штриха и точки.
 LtpISOLongDashDoubleDot
 Значение: 20. Стандарт ISO: повторяющийся паттерн из длинного штриха и двух точек.
 LtpISOLongDashTripleDot
 Значение: 21. Стандарт ISO: повторяющийся паттерн из длинного штриха и трех точек.
 LtpISODot
 Значение: 22. Стандарт ISO: пунктирная линия (повторяющийся паттерн из точек).
 LtpISOLongDashShortDash
 Значение: 23. Стандарт ISO: линия с повторяющимся паттерном из длинного и короткого штрихов.
 LtpISOLongDashDoubleShortDash
 Значение: 24. Стандарт ISO: повторяющийся паттерн из длинного и двух коротких штрихов.
 LtpISODashDot
 Значение: 25. Стандарт ISO: штрихпунктирная линия (чередующиеся штрихи и точки).
 LtpISODoubleDashDot
 Значение: 26. Стандарт ISO: повторяющийся паттерн из двух штрихов и точки.
 LtpISODashDoubleDot
 Значение: 27. Стандарт ISO: повторяющийся паттерн из штриха и двух последовательных точек.
 LtpISODoubleDashDoubleDot
 Значение: 28. Стандарт ISO: повторяющийся паттерн из двух штрихов и двух последовательных точек.
 LtpISODashTripleDot
 Значение: 29. Стандарт ISO: повторяющийся паттерн из штриха и трех последовательных точек.
 LtpISODoubleDashTripleDot
 Значение: 30. Стандарт ISO: повторяющийся паттерн из двух штрихов и трех последовательных точек.
 LtpUseObject
 Значение: 31. Тип линии определяется предоставленным объектом.
 LtpLast
 Значение: 31. Применить последний использованный тип линии.
 Описание
 Перечисление LineType определяет поддерживаемые типы линий.
 Ваши комментарии по поводу этого топика: Послать отзыв!