Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SymbolUtilityServices.IsBlockLayoutName
 Послать отзыв
 Метод позволяет проверить, соответствует ли переданное имя имени записи в таблице блоков листа или имени основного блока пространства листа.
 Синтаксис
C#
Visual Basic
Копировать Код
public static bool IsBlockLayoutName( ref String name );
Копировать Код
Public Shared Function IsBlockLayoutName( ByRef name As String ) As Boolean
 Параметры
 Параметры
 Описание
 name
 Проверяемое имя. Тип String.
 Возвращает
 Возвращает true, если имя name соответствует имени записи в таблице блоков листа или имени основного блока пространства листа. В противном случае возвращает false.
 Описание
 Метод позволяет проверить, соответствует ли переданное имя имени записи в таблице блоков листа или имени основного блока пространства листа. Строка нормализуется перед сравнением с предопределенным именем.
 Ссылки
 Teigha.DatabaseServices.SymbolUtilityServices, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!