Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.LinearEntity3d.IntersectWith
 Послать отзыв
 Метод определяет точку пересечения данного объекта с другим линейным объектом с некоторой заданной точностью.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d[] IntersectWith( ref LinearEntity3d line, Tolerance tolerance );
Копировать Код
Public Function IntersectWith( ByRef line As LinearEntity3d, tolerance As Tolerance ) As Point3d()
 Параметры
 Параметры
 Описание
 line
 Проверяемый линейный объект. Тип LinearEntity3d.
 tolerance
 Входное значение геометрической точности. Тип Tolerance.
 Возвращает
 Возвращает массив из одного элемента с точкой пересечения. Тип Point3d[].
 Описание
 Метод определяет, пересекается ли данный объект с указанным линейным объектом, и если да, возвращает точку их пересечения с заданной точностью.
 Ссылки
 Teigha.Geometry.LinearEntity3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!