Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CurveBoundaryData.Orientation3d
 Послать отзыв
 Свойство Orientation3d позволяет проверить логическую ориентацию 3D-кривых в данном объекте.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool Orientation3d;
Копировать Код
Public ReadOnly Property Orientation3d As Boolean
 Возвращает
 Возвращает true, если ориентация 3D-кривых является нормальной. В случае обратной ориентации возвращает false.
 Описание
 Свойство Orientation3d позволяет проверить логическую ориентацию 3D-кривых в данном объекте.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.CurveBoundaryData, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!