Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbCurve2dFitData.TangentsExist
 Послать отзыв
 Свойство TangentsExist позволяет проверить, заданы ли касательные векторы на концах кривой.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool TangentsExist;
Копировать Код
Public ReadOnly Property TangentsExist As Boolean
 Возвращает
 Возвращает true, если касательные векторы на концах кривой заданы. В противном случае возвращает false.
 Описание
 Свойство TangentsExist позволяет проверить, заданы ли касательные векторы на концах кривой.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.NurbCurve2dFitData, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!