Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Database.ReadDwgFile (IntPtr, bool, String^, AuditInfo^, bool)
 Послать отзыв
 This is ReadDwgFile, a member of class Database.
 Синтаксис
C#
Visual Basic
[Category("For Teigha only")] public void ReadDwgFile(IntPtr drawingFile, bool allowCPConversion, ref String password, ref AuditInfo auditInfo, bool bPartialLoad);
<Category("For Teigha only")> Public Sub ReadDwgFile(drawingFile As IntPtr, allowCPConversion As bool, ByRef password As String, ByRef auditInfo As AuditInfo, bPartialLoad As bool)
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!