Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Класс Teigha.DatabaseServices.ObjectIterator
 Послать отзыв
 This is class Teigha::DatabaseServices::ObjectIterator.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::DatabaseServices::ObjectIterator
 Синтаксис
C#
Visual Basic
[Wrapper("OdDbObjectIterator")] public class ObjectIterator : RXObject, System.Collections.IEnumerator;
<Wrapper("OdDbObjectIterator")> Public Class ObjectIterator Inherits RXObject Inherits System.Collections.IEnumerator
 Методы
 Конструкторы
 Класс Teigha.DatabaseServices.ObjectIterator
 ПоказатьInternal
 Нет совпадений по текущему фильтру
 Имя
 Описание
 ObjectIterator
 This is ObjectIterator, a member of class ObjectIterator.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Класс Teigha.DatabaseServices.ObjectIterator
 Имя
 Описание
 ObjectIterator Методы
 Ниже перечислены методы класса ObjectIterator.
 ObjectIterator Свойства
 Ниже перечислены свойства класса ObjectIterator.
 Ссылки
 ObjectIterator Методы, ObjectIterator Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!