Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AttributeReference.IsMTextAttribute
 Послать отзыв
 Свойство предоставляет доступ к флагу, который определяет, является ли данный объект AttributeReference многострочным атрибутом.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsMTextAttribute;
Копировать Код
Public Property IsMTextAttribute() As Boolean
 Возвращает
 Возвращает true, если объект AttributeReference является многострочным. В противном случае возвращает false.
 Описание
 Свойство предоставляет доступ к флагу, который определяет, является ли данный объект AttributeReference многострочным атрибутом.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.AttributeReference, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!