Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Делегат Teigha.DatabaseServices.XrefSubCommandStartEventHandler
 Послать отзыв
 This is type Teigha::DatabaseServices::XrefSubCommandStartEventHandler.
 Синтаксис
C#
Visual Basic
public delegate XrefSubCommandStartEventHandler();
Public Delegate Sub XrefSubCommandStartEventHandler()
 Ваши комментарии по поводу этого топика: Послать отзыв!