Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SectionSettings.DestinationBlock
 Послать отзыв
 Метод предоставляет идентификатор целевого блока, который подлежит замене в процессе создания сечения, если для генерации сечения установлен флаг SectionGeneration.DestinationReplaceBlock.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.ObjectId DestinationBlock( SectionType nSecType );
Копировать Код
Public Function DestinationBlock( nSecType As SectionType ) As DatabaseServices.ObjectId
 Параметры
 Параметры
 Описание
 nSecType
 Входной тип создаваемого сечения, для которого возвращается целевой блок. Перечисление SectionType.
 Возвращает
 Возвращает идентификатор объекта целевого блока. Тип DatabaseServices.ObjectId. Если целевой блок не задан, возвращает null.
 Описание
 Метод предоставляет идентификатор целевого блока, который подлежит замене в процессе создания сечения, если для генерации сечения установлен флаг SectionGeneration.DestinationReplaceBlock.
 Ссылки
 Teigha.DatabaseServices.SectionSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!