Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.BoundBlock2d.Extend
 Послать отзыв
 Метод изменяет размеры граничной рамки так, чтобы она включала указанную точку.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Extend( Point2d point );
Копировать Код
Public Sub Extend( point As Point2d )
 Параметры
 Параметры
 Описание
 point
 Входная точка, которая должна находиться в пределах граничной рамки. Тип Point2d.
 Описание
 Метод изменяет размеры граничной рамки так, чтобы она включала указанную точку.
 Ссылки
 Teigha.Geometry.BoundBlock2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!