Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Layout.Thumbnail
 Послать отзыв
 Предоставляет доступ к текущему буферу, в котором хранится растровая миниатюра данного листа.
 Синтаксис
C#
Visual Basic
Копировать Код
public System.Drawing.Bitmap Thumbnail;
Копировать Код
Public Property Thumbnail() As System.Drawing.Bitmap
 Возвращает
 Возвращает/получает тип Bitmap.
 Описание
 Предоставляет доступ к текущему буферу, в котором хранится растровая миниатюра данного листа.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Layout, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!