Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Dimclrd
 Послать отзыв
 Синтаксис
C#
Visual Basic
public Colors::Color Dimclrd;
Public Property Dimclrd() As Colors.Color
 Описание
 Возвращает или устанавливает текущее значение DIMCLRD для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!