Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод RasterImage.GetClipBoundary
 Послать отзыв
 Синтаксис
C#
Visual Basic
public Point2dCollection GetClipBoundary();
Public Function GetClipBoundary() As Point2dCollection
 Описание
 Возвращает коллекцию вершин границ контура изображения в 2D координатах. Инвертируйте PixelToModelTransform матрицу для их преобразования в координаты пространства модели.
 Ссылки
 Teigha.DatabaseServices.RasterImage, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!