Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MaintenanceReleaseVersion
 Послать отзыв
 Данное перечисление определяет версии технических релизов.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum MaintenanceReleaseVersion { Release0 = 0, Release1 = 1, Release10 = 10, Release11 = 11, Release12 = 12, Release13 = 13, Release14 = 14, Release15 = 15, Release16 = 16, Release17 = 17, Release18 = 18, Release19 = 19, Release2 = 2, Release20 = 20, Release21 = 21, Release22 = 22, Release23 = 23, Release24 = 24, Release25 = 25, Release26 = 26, Release27 = 27, Release28 = 28, Release29 = 29, Release3 = 3, Release30 = 30, Release31 = 31, Release32 = 32, Release33 = 33, Release34 = 34, Release35 = 35, Release36 = 36, Release37 = 37, Release38 = 38, Release39 = 39, Release4 = 4, Release40 = 40, Release41 = 41, Release42 = 42, Release43 = 43, Release44 = 44, Release45 = 45, Release46 = 46, Release47 = 47, Release48 = 48, Release49 = 49, Release5 = 5, Release6 = 6, Release7 = 7, Release8 = 8, Release9 = 9, ReleaseCurrent = 50, ReleaseKnown = 126, ReleaseMax = 127 }
Копировать Код
Public Enum MaintenanceReleaseVersion Release0 = 0 Release1 = 1 Release10 = 10 Release11 = 11 Release12 = 12 Release13 = 13 Release14 = 14 Release15 = 15 Release16 = 16 Release17 = 17 Release18 = 18 Release19 = 19 Release2 = 2 Release20 = 20 Release21 = 21 Release22 = 22 Release23 = 23 Release24 = 24 Release25 = 25 Release26 = 26 Release27 = 27 Release28 = 28 Release29 = 29 Release3 = 3 Release30 = 30 Release31 = 31 Release32 = 32 Release33 = 33 Release34 = 34 Release35 = 35 Release36 = 36 Release37 = 37 Release38 = 38 Release39 = 39 Release4 = 4 Release40 = 40 Release41 = 41 Release42 = 42 Release43 = 43 Release44 = 44 Release45 = 45 Release46 = 46 Release47 = 47 Release48 = 48 Release49 = 49 Release5 = 5 Release6 = 6 Release7 = 7 Release8 = 8 Release9 = 9 ReleaseCurrent = 50 ReleaseKnown = 126 ReleaseMax = 127 End Enum
 Члены
 Члены
 Описание
 Release0
 Значение: 0.
 Release1
 Значение: 1.
 Release2
 Значение: 2.
 Release3
 Значение: 3.
 Release4
 Значение: 4.
 Release5
 Значение: 5.
 Release6
 Значение: 6.
 Release7
 Значение: 7.
 Release8
 Значение: 8.
 Release9
 Значение: 9.
 Release10
 Значение: 10.
 Release11
 Значение: 11.
 Release12
 Значение: 12.
 Release13
 Значение: 13.
 Release14
 Значение: 14.
 Release15
 Значение: 15.
 Release16
 Значение: 16.
 Release17
 Значение: 17.
 Release18
 Значение: 18.
 Release19
 Значение: 19.
 Release20
 Значение: 20.
 Release21
 Значение: 21.
 Release22
 Значение: 22.
 Release23
 Значение: 23.
 Release24
 Значение: 24.
 Release25
 Значение: 25.
 Release26
 Значение: 26.
 Release27
 Значение: 27.
 Release28
 Значение: 28.
 Release29
 Значение: 29.
 Release30
 Значение: 30.
 Release31
 Значение: 31.
 Release32
 Значение: 32.
 Release33
 Значение: 33.
 Release34
 Значение: 34.
 Release35
 Значение: 35.
 Release36
 Значение: 36.
 Release37
 Значение: 37.
 Release38
 Значение: 38.
 Release39
 Значение: 39.
 Release40
 Значение: 40.
 Release41
 Значение: 41.
 Release42
 Значение: 42.
 Release43
 Значение: 43.
 Release44
 Значение: 44.
 Release45
 Значение: 45.
 Release46
 Значение: 46.
 Release47
 Значение: 47.
 Release48
 Значение: 48.
 Release49
 Значение: 49.
 ReleaseCurrent
 Значение: 50.
 ReleaseKnown
 Значение: 126.
 ReleaseMax
 Значение: 127.
 Описание
 Данное перечисление определяет версии технических релизов, основной задачей которых является доработка существующего функционала и устранение выявленных ошибок.
 Ваши комментарии по поводу этого топика: Послать отзыв!