Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Matrix2dBuilder.Matrix2dBuilder
 Послать отзыв
 Конструктор по умолчанию класса Matrix2dBuilder.
 Синтаксис
C#
Visual Basic
Копировать Код
public Matrix2dBuilder();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса Matrix2dBuilder.
 Ссылки
 Teigha.Geometry.Matrix2dBuilder, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!