Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SweepOptionsBuilder.Bank
 Послать отзыв
 Свойство Bank позволяет определить, расположена ли вытягиваемая грань или кривая вдоль траектории вытягивания.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool Bank;
Копировать Код
Public Property Bank As Boolean
 Возвращает
 Возвращает true, если вытягиваемая грань или кривая располагается вдоль траектории. В противном случае возвращает false.
 Описание
 Свойство Bank позволяет определить, расположена ли вытягиваемая грань или кривая вдоль траектории вытягивания.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.SweepOptionsBuilder, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!