Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Hatch.BackgroundColor
 Послать отзыв
 This is BackgroundColor, a member of class Hatch.
 Синтаксис
C#
Visual Basic
public Colors::Color BackgroundColor;
Public Property BackgroundColor() As Colors.Color
 Ссылки
 Teigha.DatabaseServices.Hatch, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!