Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Hatch.AppendLoop (HatchLoopTypes, Point2dCollection^, DoubleCollection^)
 Послать отзыв
 This is AppendLoop, a member of class Hatch.
 Синтаксис
C#
Visual Basic
public void AppendLoop(HatchLoopTypes loopType, ref Point2dCollection vertexCollection, ref DoubleCollection bulgeCollection);
Public Sub AppendLoop(loopType As HatchLoopTypes, ByRef vertexCollection As Point2dCollection, ByRef bulgeCollection As DoubleCollection)
 Ссылки
 Teigha.DatabaseServices.Hatch, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!