Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Point3d.DivideBy
 Послать отзыв
 Метод создает новую точку, координаты которой получены делением координат данной точки на указанное значение.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d DivideBy( double value );
Копировать Код
Public Function DivideBy( value As Double ) As Point3d
 Параметры
 Параметры
 Описание
 value
 Значение, используемое в качестве делителя. Тип double.
 Возвращает
 Возвращает точку, полученную в результате операции деления. Тип Point3d.
 Описание
 Метод создает новую точку, координаты которой получены делением координат данной точки на значение value.
 Ссылки
 Teigha.Geometry.Point3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!