Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ObjectId.NonForwardedHandle
 Послать отзыв
 Если данный ObjectId находится в базе данных внешних ссылок, а связанный с ним объект, был перенаправлен в главную базу данных, то значением этого свойства является дескриптор (handle) в базе данных внешних ссылок. Если объект, связанный с этим ObjectId, не из базы данных внешних ссылок или не перенаправлен, то это свойство аналогично свойству ObjectId.Handle.
 Синтаксис
C#
Visual Basic
Копировать Код
public Handle NonForwardedHandle;
Копировать Код
Public Property NonForwardedHandle() As Handle
 Возвращает
 Возвращает дескриптор Teigha.DatabaseServices.Handle.
 Описание
 Если данный ObjectId находится в базе данных внешних ссылок, а связанный с ним объект, был перенаправлен в главную базу данных, то значением этого свойства является дескриптор (handle) в базе данных внешних ссылок. Если объект, связанный с этим ObjectId, не из базы данных внешних ссылок или не перенаправлен, то это свойство аналогично свойству ObjectId.Handle.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.ObjectId, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!