Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Section.SetVertex
 Послать отзыв
 Метод позволяет задать координаты вершины с указанным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetVertex( int nIndex, Point3d pt );
Копировать Код
Public Sub SetVertex( nIndex As Integer, pt As Point3d )
 Параметры
 Параметры
 Описание
 nIndex
 Индекс вершины. Тип int. Отсчет индексов ведется от нуля. Передаваемое в метод значение индекса должно быть меньше текущего количества вершин.
 pt
 Новые координаты вершины. Тип Point3d.
 Описание
 Метод позволяет задать координаты вершины с указанным индексом.
 Ссылки
 Teigha.DatabaseServices.Section, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!