Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FormattedTableData.GetBackgroundColor
 Послать отзыв
 Метод возвращает цвет фона ячейки, строки или столбца.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual Colors.Color GetBackgroundColor( int row, int column );
Копировать Код
Public Overridable Function GetBackgroundColor( row As Integer, column As Integer ) As Colors.Color
 Параметры
 Параметры
 Описание
 row
 Индекс строки. Тип int. Может принимать значение -1.
 column
 Индекс столбца. Тип int. Может принимать значение -1.
 Возвращает
 Возвращает цвет фона ячейки, строки или столбца. Тип Teigha.Colors.Color.
 Описание
 Метод возвращает цвет фона ячейки, строки или столбца.
 Чтобы указать ячейку, следует передать действительные индексы строки и столбца. Чтобы указать строку, следует передать действительный индекс строки и -1 в качестве индекса столбца. Чтобы указать столбец, следует передать действительный индекс столбца и -1 в качестве индекса строки.
 Ссылки
 Teigha.DatabaseServices.FormattedTableData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!