Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Ole2Frame.ItemType
 Послать отзыв
 Данное перечисление определяет тип элемента в окне OLE-объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum ItemType { Link = 1, Embedded = 2, Static = 3 }
Копировать Код
Public Enum ItemType Link = 1 Embedded = 2 [Static] = 3 End Enum
 Члены
 Члены
 Описание
 Embedded
 Значение: 2. Внедрённый объект.
 Link
 Значение: 1. Связанный объект.
 Static
 Значение: 3. Статический объект.
 Описание
 Данное перечисление определяет тип элемента в окне OLE-объекта.
 Ваши комментарии по поводу этого топика: Послать отзыв!