Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 DimStyleTableRecord.Dimtxt
 Послать отзыв
 Свойство отвечает за настройку величины размерного текста.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual double Dimtxt { get; set; }
Копировать Код
Public Overridable Property Dimtxt As Double
 Возвращает
 Возвращает тип данных double.
 Описание
 В свойстве хранится величина размерного текста.
 Свойство также доступно через системную переменную DIMTXT и пользовательское меню в окне изменения/создания размерного стиля:
  При изменении системной переменной DIMTXT будет создан новый размерный стиль под названием <переопределение> на основе текущего с новым значением DIMTXT.
 Условия
 Чтение и запись.
 Пример
 Пример изменения величины размерного текста (значения свойства Dimtxt) в размерном стиле Standard:
C#
 Копировать Код
public partial class Commands { [Teigha.Runtime.CommandMethod("DimtxtChange")] public void DimtxtStandardDimStyle() { // Получение ссылки на активный документ HostMgd.ApplicationServices.Document doc = HostMgd.ApplicationServices.Application.DocumentManager.MdiActiveDocument; // Получение ссылки на редактор документа HostMgd.EditorInput.Editor ed = doc.Editor; // Получение ссылки на базу данных документа Teigha.DatabaseServices.Database db = doc.Database; // Начало транзакции с базой данных документа using (Teigha.DatabaseServices.Transaction trans = db.TransactionManager.StartTransaction()) { // Открываем таблицу размерных стилей для чтения Teigha.DatabaseServices.DimStyleTable dimStyleTable = trans.GetObject(db.DimStyleTableId, Teigha.DatabaseServices.OpenMode.ForRead) as Teigha.DatabaseServices.DimStyleTable; // Находим в таблице размерных стилей ObjectId нужного стиля по его названию Teigha.DatabaseServices.ObjectId styleId = dimStyleTable["Standard"]; // Открываем таблицу размерного стиля для изменений Teigha.DatabaseServices.DimStyleTableRecord obj = trans.GetObject(styleId, Teigha.DatabaseServices.OpenMode.ForWrite) as Teigha.DatabaseServices.DimStyleTableRecord; ed.WriteMessage($"nDimtxt before: {obj.Dimtxt}"); // Изменяем высоту размерного текста obj.Dimtxt = 5; ed.WriteMessage($"nDimtxt after: {obj.Dimtxt}"); trans.Commit(); } } }
 Результат работы команды DimtxtChange:
 Было:
 Стало:
 Ссылки
 Teigha.DatabaseServices.DimStyleTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!