Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Curve.StartPoint
 Послать отзыв
 Обеспечивает доступ к начальной точке кривой (в мировой системе координат WCS).
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d StartPoint;
Копировать Код
Public Property StartPoint() As Point3d
 Возвращает
 Возвращает или задает начальную точку кривой в виде экземпляра класса Point3d.
 Описание
 Обеспечивает доступ к начальной точке кривой (в мировой системе координат WCS).
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Curve, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!