Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FitData.Degree
 Послать отзыв
 Свойство возвращает степень сплайна.
 Синтаксис
C#
Visual Basic
Копировать Код
public int Degree;
Копировать Код
Public ReadOnly Property Degree As Integer
 Возвращает
 Возвращает степень сплайна. Тип int.
 Описание
 Свойство возвращает степень сплайна.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.FitData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!