Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Entity.RecordGraphicsModified(bool)
 Послать отзыв
 Метод устанавливает, должно ли графическое представление геометрического объекта обновляться при его закрытии.
 Синтаксис
C#
Visual Basic
Копировать Код
public void RecordGraphicsModified(bool setModified);
Копировать Код
Public Sub RecordGraphicsModified(setModified As bool)
 Параметры
 Параметры
 Описание
 setModified
 Булево значение, определяющее, будет ли графика геометрического объекта обновляться на экране при закрытии объекта. Тип bool
 Описание
 Этот метод устанавливает состояние геометрического объекта, определяющее, должен или нет геометрический объект обновляться на экране, когда он закрывается. Если установлен признак, что геометрический объект не обновляется, то любые сделанные изменения появятся в следующий раз, когда геометрический объект регенерирует.
 Если setModified имеет значение false, и у геометрического объекта в данный момент установлен признак обновления его графики при закрытии (это значение используется по умолчанию), то этот метод установит состояние отсутствие обновления на экране при закрытии объекта и уведомление objectModified будет послано всем типам реакторов, связанным с геометрическим объектом.
 Если setModified имеет значение true, то у геометрического объекта будет установлен признак обновления на экране при закрытии.
 Ссылки
 Teigha.DatabaseServices.Entity, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!