Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Dimtad
 Послать отзыв
 Синтаксис
C#
Visual Basic
public int Dimtad;
Public Property Dimtad() As Integer
 Описание
 Возвращает или устанавливает текущее значение DIMTAD для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!