Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Polyline3d.AppendVertex
 Послать отзыв
 Метод добавляет в список вершин полилинии объект PolylineVertex3d, заданный аргументом vertexToAppend.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.ObjectId AppendVertex( ref PolylineVertex3d vertexToAppend );
Копировать Код
Public Function AppendVertex( ByRef vertexToAppend As PolylineVertex3d ) As DatabaseServices.ObjectId
 Параметры
 Параметры
 Описание
 vertexToAppend
 Указатель на добавляемую в полилинию вершину.
 Возвращает
 Возвращает ObjectId новой вершины полилинии.
 Описание
 Метод добавляет в список вершин полилинии объект PolylineVertex3d, заданный аргументом vertexToAppend, и делает полилинию владельцем этой вершины.
 Кроме того, если полилиния является резидентной в базе данных, то вершина добавляется в ту же базу данных. В случае нерезидентной полилинии новая вершина будет добавлена в базу данных как только сама полилиния будет добавлена в эту базу данных.
 В случае резидентной полилинии добавляемая вершина обязательно должна быть явным образом закрыта вызывающим приложением после возврата из метода AppendVertex(). В случае нерезидентной полилинии явно закрывать вершину не требуется, поскольку она еще не введена в базу данных.
 Ссылки
 Teigha.DatabaseServices.Polyline3d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!