Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Helix.BaseRadius
 Послать отзыв
 Свойство обеспечивает доступ к радиусу в основании этой спирали.
 Синтаксис
C#
Visual Basic
Копировать Код
public double BaseRadius;
Копировать Код
Public Property BaseRadius As Double
 Возвращает
 Возвращает радиус в основании спирали. Тип double.
 Описание
 Свойство обеспечивает доступ к радиусу в основании этой спирали
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Helix, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!