Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Matrix3d.GetDeterminant
 Послать отзыв
 Метод позволяет получить определитель данной матрицы.
 Синтаксис
C#
Visual Basic
Копировать Код
public double GetDeterminant();
Копировать Код
Public Function GetDeterminant() As Double
 Возвращает
 Возвращает значение детерминанта матрицы. Тип double.
 Описание
 Метод позволяет получить определитель данной матрицы.
 Ссылки
 Teigha.Geometry.Matrix3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!