Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 BlockTableRecord.HasAttributeDefinitions
 Послать отзыв
 Свойство показывает, есть ли в блоке атрибуты.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool HasAttributeDefinitions { get; }
Копировать Код
Public ReadOnly Property HasAttributeDefinitions As Boolean
 Возвращает
 Возвращает тип данных bool:
true - в блоке определены атрибуты;
false - в блоке нет атрибутов.
 Описание
 Свойство показывает, есть ли в блоке определения атрибутов.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.BlockTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!