Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DatabaseSummaryInfoBuilder.DatabaseSummaryInfoBuilder
 Послать отзыв
 Конструктор класса, предназначенный для создания копии объекта DatabaseSummaryInfoBuilder.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseSummaryInfoBuilder( DatabaseSummaryInfo value );
Копировать Код
Public Sub New( value As DatabaseSummaryInfo )
 Параметры
 Параметры
 Описание
 value
 Исходный объект для копирования. Тип DatabaseSummaryInfo.
 Описание
 Конструктор класса, предназначенный для создания копии объекта DatabaseSummaryInfoBuilder.
 Ссылки
 Teigha.DatabaseServices.DatabaseSummaryInfoBuilder, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!