Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 BlockTableRecord.BlockInsertionPoints
 Послать отзыв
 Событие возникает, когда в чертеж добавляется вставка данного определения блока.
 Синтаксис
C#
Visual Basic
Копировать Код
public static event BlockInsertionPointsEventHandler BlockInsertionPoints;
Копировать Код
Public Shared Event BlockInsertionPoints As BlockInsertionPointsEventHandler
 Описание
 Событие возникает, когда в чертеж добавляется вставка данного определения блока.
 Ссылки
 Teigha.DatabaseServices.BlockTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!