Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ObjectContextCollection.HasContext
 Послать отзыв
 Метод позволяет проверить, существует ли в коллекции контекст с указанным именем.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual bool HasContext( ref String contextName );
Копировать Код
Public Overridable Function HasContext( ByRef contextName As String ) As Boolean
 Параметры
 Параметры
 Описание
 contextName
 Имя контекста. Тип String.
 Возвращает
 Возвращает true, если контекст с именем contextName присутствует в коллекции. В противном случае возвращает false.
 Описание
 Метод позволяет проверить, существует ли в коллекции контекст с указанным именем.
 Ссылки
 Teigha.DatabaseServices.ObjectContextCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!