Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Curve.GetSplitCurves
 Послать отзыв
 Метод создает один или несколько объектов, которые являются подкривыми исходной кривой. Коллекция должна содержать точки на кривой, которые используются в качестве начальных или конечных точек вновь созданных подкривых.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual DBObjectCollection GetSplitCurves( ref Point3dCollection points );
Копировать Код
Public virtual Function GetSplitCurves( ByRef points As Point3dCollection ) As DBObjectCollection
 Параметры
 Параметры
 Описание
 value
 Коллекция типа Point3dCollection с точками Point3d на кривой.
 Возвращает
 Метод возвращает экземпляр класса Point3dCollection.
 Описание
 Этот метод создает один или несколько объектов, которые являются подкривыми исходной кривой. Коллекция должна содержать точки на кривой, которые используются в качестве начальных или конечных точек вновь созданных подкривых.
 Ссылки
 Teigha.DatabaseServices.Curve, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!