Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Solid3d.CheckInterference
 Послать отзыв
 Метод позволяет проверить, пересекается ли данный объект с другим твердым телом.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual bool CheckInterference( ref Solid3d otherSolid );
Копировать Код
Public Overridable Function CheckInterference( ByRef otherSolid As Solid3d ) As Boolean
 Параметры
 Параметры
 Описание
 otherSolid
 Другое твердое тело, участвующее в проверке на возможные коллизии. Тип Solid3d.
 Возвращает
 Возвращает true, если твердое тело otherSolid пересекается с данным объектом. В противном случае возвращает false.
 Описание
 Метод позволяет проверить, пересекается ли данный объект с другим твердым телом.
 Ссылки
 Teigha.DatabaseServices.Solid3d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!