Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.CellType
 Послать отзыв
 Метод предназначен для определения типа ячейки из перечисления TableCellType.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual TableCellType CellType( int row, int col );
Копировать Код
Public virtual Function CellType( row As Integer, col As Integer ) As TableCellType
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int.
 col
 Индекс столбца, тип int.
 Возвращает
 Возвращает тип ячейки из перечисления TableCellType.
 Описание
 Метод предназначен для определения типа ячейки из перечисления TableCellType. Ячейка задается индексами строки и столбца.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!