Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector3d.Vector3d
 Послать отзыв
 Конструктор создает трехмерный вектор с заданными компонентами x, y и z.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d( double x, double y, double z );
Копировать Код
Public Sub New( x As Double, y As Double, z As Double )
 Параметры
 Параметры
 Описание
 x
 X-компонента вектора. Тип double.
 y
 Y-компонента вектора. Тип double.
 z
 Z-компонента вектора. Тип double.
 Описание
 Конструктор создает трехмерный вектор с заданными компонентами x, y и z.
 Ссылки
 Teigha.Geometry.Vector3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!