Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBDictionary.Contains
 Послать отзыв
 Метод определяет, присутствует ли в словаре запись с указанным ObjectId.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool Contains( DatabaseServices.ObjectId objId );
Копировать Код
Public Function Contains( objId As DatabaseServices.ObjectId ) As Boolean
 Параметры
 Параметры
 Описание
 objId
 Искомый объект с указанным ObjectId .
 Возвращает
 Возвращает true, если объект с указанным ObjectId присутствует в словаре, и false в противном случае.
 Описание
 Метод Contains определяет, присутствует ли в словаре запись с указанным ObjectId.
 Ссылки
 Teigha.DatabaseServices.DBDictionary, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!