Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LayerStateManager.ImportLayerStateFromDb
 Послать отзыв
 Метод импортирует состояние слоя с указанным именем, используя указатель открытого файла чертежа, переданный через базу данных.
 Синтаксис
C#
Visual Basic
Копировать Код
public void ImportLayerStateFromDb( ref String name, ref Database database );
Копировать Код
Public Function ImportLayerStateFromDb( ByRef name As String, ByRef database As Database )
 Параметры
 Параметры
 Описание
 name
 Имя импортируемого состояния слоя, String.
 database
 Указатель на действительную и доступную на чтение базу данных, из которой следует импортировать состояние слоя.
 Описание
 Метод импортирует состояние слоя с указанным именем, используя указатель открытого файла чертежа, переданный через базу данных.
 Этот метод импортирует также типы линий, материалы и стили печати, которые сохранены в состоянии импортированного слоя, но отсутствуют в текущем чертеже. Этот метод позволяет импортировать состояния слоев непосредственно из файлов чертежей, а не экспортировать их в файл формата .LAS с последующим импортом состояния слоя.
 Ссылки
 Teigha.DatabaseServices.LayerStateManager, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!