Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CoordinateSystem3d.!=
 Послать отзыв
 Оператор неравенства структуры CoordinateSystem3d.
 Синтаксис
C#
Visual Basic
Копировать Код
public static bool operator !=( CoordinateSystem3d a, CoordinateSystem3d b );
Копировать Код
Public Shared Operator <>( a As CoordinateSystem3d, b As CoordinateSystem3d ) As Boolean
 Параметры
 Параметры
 Описание
 a
 Левый операнд. Тип CoordinateSystem3d.
 b
 Правый операнд. Тип CoordinateSystem3d.
 Возвращает
 Возвращает true, если не выполняется хотя бы одно из следующих условий:
совпадают начальные точки;
совпадают направляющие векторы осей X;
совпадают направляющие векторы осей Y;
совпадают направляющие векторы осей Z.
 В противном случае возвращает false.
 Описание
 Оператор неравенства структуры CoordinateSystem3d.
 Ссылки
 Teigha.Geometry.CoordinateSystem3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!