Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Layout.CurrentViewportId
 Послать отзыв
 Свойство предоставляет доступ к ObjectId активного видового экрана документа.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.ObjectId CurrentViewportId;
Копировать Код
Public Property CurrentViewportId() As DatabaseServices.ObjectId
 Возвращает
 Возвращает ObjectId активного видового экрана документа.
 Описание
 Свойство предоставляет доступ к ObjectId активного видового экрана документа.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Layout, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!