Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CircularArc3d.ProjectedIntersectWith
 Послать отзыв
 Метод позволяет с заданной точностью найти точки пересечения проекций данной дуги и указанной линии на заданную плоскость.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d[] ProjectedIntersectWith( ref LinearEntity3d line, Vector3d projectionDirection, Tolerance tolerance );
Копировать Код
Public Function ProjectedIntersectWith( ByRef line As LinearEntity3d, projectionDirection As Vector3d, tolerance As Tolerance ) As Point3d()
 Параметры
 Параметры
 Описание
 line
 Входная 3D-линия. Тип LinearEntity3d.
 projectionDirection
 Направление проецирования (нормаль плоскости проецирования). Тип Vector3d.
 tolerance
 Заданная точность вычислений. Тип Tolerance.
 Возвращает
 Возвращает массив точек пересечения проекций дуги и линии на заданную плоскость. Тип Point3d[].
 Описание
 Метод позволяет с заданной точностью найти точки пересечения проекций данной дуги и указанной линии на заданную плоскость.
 Замечания
 Метод используется преимущественно в задачах, где projectionDirection представляет собой направление взгляда. В этом случае метод возвращает точки, которые представляются наблюдателю точками пересечения линии с дугой (но фактически точками пересечения могут и не быть).
 Ссылки
 Teigha.Geometry.CircularArc3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!