Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DataTypeParameter
 Послать отзыв
 Структура DataTypeParameter представляет параметр типа данных.
 Иерархия классов
Teigha::DatabaseServices::DataTypeParameter
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdDb.DataType")] public struct DataTypeParameter
Копировать Код
<Wrapper("OdDb.DataType")> Public Structure DataTypeParameter
 Описание
 Структура DataTypeParameter представляет параметр типа данных.
 Методы
 Конструкторы
 Имя
 Описание
 DataTypeParameter
 Конструктор структуры DataTypeParameter. Создает экземпляр структуры с указанными типом данных и типом единиц измерения.
 Топики
 Имя
 Описание
 DataTypeParameter Методы
 Ниже перечислены методы класса DataTypeParameter.
 DataTypeParameter Операторы
 Ниже перечислены операторы класса DataTypeParameter.
 DataTypeParameter Свойства
 Ниже перечислены свойства класса DataTypeParameter.
 Ссылки
 DataTypeParameter Методы, DataTypeParameter Операторы, DataTypeParameter Свойства, Методы, Топики, DataTypeParameter Методы, DataTypeParameter Операторы, DataTypeParameter Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!