Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SweepOptions.AlignAngle
 Послать отзыв
 Свойство AlignAngle представляет величину угла выравнивания в радианах.
 Синтаксис
C#
Visual Basic
Копировать Код
public double AlignAngle;
Копировать Код
Public ReadOnly Property AlignAngle As Double
 Возвращает
 Возвращает угол выравнивания в радианах. Тип double.
 Описание
 Свойство AlignAngle представляет величину угла выравнивания в радианах.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.SweepOptions, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!