Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Interval.IsOverlapAtUpper
 Послать отзыв
 Метод позволяет проверить, перекрывается ли данный интервал по верхней границе с указанным интервалом.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsOverlapAtUpper( ref Interval otherInterval, ref Interval overlap );
Копировать Код
Public Function IsOverlapAtUpper( ByRef otherInterval As Interval, ByRef overlap As Interval ) As Boolean
 Параметры
 Параметры
 Описание
 otherInterval
 Проверяемый интервал. Тип Interval.
 overlap
 Интервал перекрытия. Тип Interval. Значение действительно, только если метод возвращает true.
 Возвращает
 Возвращает true, если данный интервал по своей верхней границе перекрывается с указанным интервалом. В противном случае возвращает false. Если метод возвращает true, то действительный интервал перекрытия передается через параметр overlap.
 Описание
 Метод позволяет проверить, перекрывается ли данный интервал по верхней границе с указанным интервалом.
 Перекрытие имеет место только в том случае, если одновременно выполняются следующие условия:
Данный интервал ограничен сверху;
Интервал otherInterval ограничен снизу;
Ни один из интервалов не является синглтоном (когда нижняя граница совпадает с верхней);
Интервалы пересекаются;
Пересечение интервалов не совпадает с данным интервалом, т.е. данный интервал не включен целиком в интервал otherInterval;
Верхняя граница данного интервала принадлежит интервалу otherInterval;
Нижняя граница интервала otherInterval принадлежит данному интервалу.
 Если перекрытие интервалов имеет место, то собственно интервал перекрытия возвращается параметром overlap.
 Ссылки
 Teigha.Geometry.Interval, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!