Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 ViewTableRecord.Thumbnail
 Послать отзыв
 Свойство предназначено для просмотра или изменения иконки именованного вида.
 Синтаксис
C#
Visual Basic
public Drawing.Bitmap Thumbnail;
Public Property Thumbnail() As Drawing.Bitmap
 Возвращает
 Возвращает тип данных System.Drawing.Bitmap.
 Описание
 Свойство предназначено для просмотра или изменения иконки именованного вида и хранит в себе упакованную структуру BITMAPINFO миниатюры с данными миниатюры, следующими за ней непосредственно в памяти. Для свойтсва можно установить значение null, если для этого вида не требуется иконка. Свойство возвращает ошибку, если данные миниатюры не удалось сохранить.
 Условия
 Чтение и запись.
 Ссылки
 ViewTableRecord Класс, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!