Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DimAssoc.PointRef
 Послать отзыв
 Метод предоставляет указатель на опорную точку заданного типа.
 Синтаксис
C#
Visual Basic
Копировать Код
public OsnapPointRef PointRef( DimAssocPointType pointIndex );
Копировать Код
Public Function PointRef( pointIndex As DimAssocPointType ) As OsnapPointRef
 Параметры
 Параметры
 Описание
 pointIndex
 Входной индекс типа опорной точки. Значение из перечисления DimAssocPointType.
 Возвращает
 Возвращает объект OsnapPointRef для опорной точки указанного типа.
 Описание
 Метод предоставляет указатель на опорную точку с заданным индексом типа.
 Ссылки
 Teigha.DatabaseServices.DimAssoc, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!