Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FullSubentityPath.SubentId
 Послать отзыв
 Свойство возвращает копию идентификатора встроенного подобъекта SubentityId.
 Синтаксис
C#
Visual Basic
Копировать Код
public SubentityId SubentId;
Копировать Код
Public ReadOnly Property SubentId As SubentityId
 Возвращает
 Возвращает идентификатор подобъекта. Тип SubentityId.
 Описание
 Свойство возвращает копию идентификатора встроенного подобъекта SubentityId.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.FullSubentityPath, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!