Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotSettings.PlotWireframe
 Послать отзыв
 Свойство PlotWireframe позволяет определить, будет ли каркасной печать видового экрана, исходя из текущих настроек печати тонированного видового экрана.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool PlotWireframe;
Копировать Код
Public ReadOnly Property PlotWireframe As Boolean
 Возвращает
 Возвращает true, если печать будет каркасной. В противном случае возвращает false.
 Описание
 Свойство PlotWireframe позволяет определить, будет ли каркасной печать видового экрана, исходя из текущих настроек печати тонированного видового экрана.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.PlotSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!