Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.BlockTableRecordEnumerator.Reset
 Послать отзыв
 Метод перемещает перечислитель на первый блок.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Reset();
Копировать Код
Public Sub Reset()
 Описание
 Метод перемещает перечислитель на первый блок.
 Ссылки
 Teigha.DatabaseServices.BlockTableRecordEnumerator, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!