Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Viewport.SnapBasePoint
 Послать отзыв
 Свойство SnapBasePoint представляет базовую точку шаговой привязки в данном видовом экране относительно текущей ПСК (UCS).
 Синтаксис
C#
Visual Basic
Копировать Код
public Point2d SnapBasePoint;
Копировать Код
Public Property SnapBasePoint As Point2d
 Возвращает
 Возвращает базовую точку шаговой привязки. Тип Point2d.
 Описание
 Свойство SnapBasePoint представляет базовую (начальную) точку шаговой привязки в данном видовом экране относительно текущей пользовательской системы координат (ПСК, UCS).
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Viewport, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!