Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод DBText.AdjustAlignment
 Послать отзыв
 Синтаксис
C#
Visual Basic
public void AdjustAlignment(ref DatabaseServices::Database alternateDatabaseToUse);
Public Sub AdjustAlignment(ByRef alternateDatabaseToUse As DatabaseServices.Database)
 Параметры
 Параметры
 Описание
 alternateDatabaseToUse
 Используемая база данных, если текстовый объект не находится в базе данных (этот параметр игнорируется, если текстовый объект находится в текущей базе данных)
 Описание
 Обычно, когда геометрический объект "текст" закрывается, положение текста и точки выравнивания устанавливаются в соответствии с настройками выравнивания и стилем текста. Но, если текстовый геометрический объект встроен в другой геометрический объект, он никогда не будет закрыт, и в этом случае он не может быть автоматически выравнен. Также, если текст добавлен до первого вызова метода close() объекта, и графика будет удалена с экрана до завершения самых последних транзакций, текст будет отображен до того, как произойдет автоматическое выравнивание.
 Этот метод предоставляет возможность принудительно выровнять текст для нерезидентных текстовых объектов или текстовых объектов с транзакциями.
 Когда метод вызывается, используемая база данных должна быть текущей базой данных (возвращаемой при вызове HostApplicationServices()->workingDatabase()), текстовый объект должен иметь ненулевую строку данных и корректный ID стиля текста, который находится в используемой базе данных.
 Ссылки
 Teigha.DatabaseServices.DBText, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!