Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocArrayRectangularParameters.SetAxesAngle
 Послать отзыв
 Метод позволяет задать угол между первым рядом и первым столбцом массива.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetAxesAngle( double val, ref String expression, ref String evaluatorId );
Копировать Код
Public Sub SetAxesAngle( val As Double, ByRef expression As String, ByRef evaluatorId As String )
 Параметры
 Параметры
 Описание
 val
 Значение угла в радианах. Тип double.
 expression
 Выражение для параметра. Тип String. Строка может быть пустой.
 evaluatorId
 Строковое представление идентификатора вычислителя. Тип String. Строка может быть пустой.
 Описание
 Метод позволяет задать угол между первым рядом и первым столбцом массива. Значение указывается в радианах и должно быть положительной величиной, которая соответствует углу в диапазоне (0-360] градусов.
 Если для параметра выражение отсутствует, строки expression и evaluatorId должны быть пустыми.
 Ссылки
 Teigha.DatabaseServices.AssocArrayRectangularParameters, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!