Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.BoundBlock2d.BasePoint
 Послать отзыв
 Свойство BasePoint представляет базовую вершину данной граничной рамки.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point2d BasePoint;
Копировать Код
Public ReadOnly Property BasePoint As Point2d
 Возвращает
 Возвращает базовую точку данной граничной рамки. Тип Point2d.
 Описание
 Свойство BasePoint представляет базовую вершину данной граничной рамки.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.BoundBlock2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!