Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.TableTemplate
 Послать отзыв
 Класс TableTemplate предназначен для хранения и управления шаблонами таблиц.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::GraphicsInterface::Drawable Teigha::DatabaseServices::DBObject Teigha::DatabaseServices::LinkedData Teigha::DatabaseServices::LinkedTableData Teigha::DatabaseServices::FormattedTableData Teigha::DatabaseServices::TableContent Teigha::DatabaseServices::TableTemplate
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("AcDbTableTemplate")] public class TableTemplate : TableContent
Копировать Код
<Wrapper("AcDbTableTemplate")> Public Class TableTemplate Inherits TableContent
 Описание
 Класс TableTemplate предназначен для хранения и управления шаблонами таблиц.
 Методы
 Конструкторы
 Teigha.GraphicsInterface.Drawable
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 Drawable
 Конструктор класса Teigha.GraphicsInterface.Drawable. (Унаследован от Drawable)
 Teigha.DatabaseServices.DBObject
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 DBObject
 Конструктор. (Унаследован от DBObject)
 Teigha.DatabaseServices.LinkedTableData
 Имя
 Описание
 LinkedTableData
 Это обзор перегрузок LinkedTableData.
 Teigha.DatabaseServices.FormattedTableData
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 FormattedTableData
 Конструктор по умолчанию класса FormattedTableData. (Унаследован от FormattedTableData)
 Teigha.DatabaseServices.TableContent
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 TableContent
 Конструктор по умолчанию класса TableContent. (Унаследован от TableContent)
 Teigha.DatabaseServices.TableTemplate
 Имя
 Описание
 TableTemplate
 Конструктор класса TableTemplate. Создает экземпляр класса с указанными параметрами.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.GraphicsInterface.Drawable
 Имя
 Описание
 Drawable Методы
 Ниже перечислены методы класса Drawable.
 Drawable Свойства
 Ниже перечислены свойства класса Drawable.
 Teigha.DatabaseServices.DBObject
 Имя
 Описание
 DBObject Методы
 Ниже перечислены методы класса DBObject.
 DBObject Свойства
 Ниже перечислены свойства класса DBObject.
 DBObject События
 Ниже перечислены события класса DBObject.
 Teigha.DatabaseServices.LinkedData
 Имя
 Описание
 LinkedData Методы
 Ниже перечислены методы класса LinkedData.
 LinkedData Свойства
 Ниже перечислены свойства класса LinkedData.
 Teigha.DatabaseServices.LinkedTableData
 Имя
 Описание
 LinkedTableData Методы
 Ниже перечислены методы класса LinkedTableData.
 LinkedTableData Свойства
 Ниже перечислены свойства класса LinkedTableData.
 Teigha.DatabaseServices.FormattedTableData
 Имя
 Описание
 FormattedTableData Методы
 Ниже перечислены методы класса FormattedTableData.
 Teigha.DatabaseServices.TableContent
 Имя
 Описание
 TableContent Методы
 Ниже перечислены методы класса TableContent.
 TableContent Свойства
 Ниже перечислены свойства класса TableContent.
 Teigha.DatabaseServices.TableTemplate
 Имя
 Описание
 TableTemplate Методы
 Ниже перечислены методы класса TableTemplate.
 Ссылки
 TableTemplate Методы, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства, DBObject События
 Ваши комментарии по поводу этого топика: Послать отзыв!