Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.SplineEntity2d.StartPoint
 Послать отзыв
 Свойство StartPoint представляет точку сплайна с минимальным значением параметра. Не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point2d StartPoint;
Копировать Код
Public ReadOnly Property StartPoint As Point2d
 Возвращает
 Возвращает точку сплайна с минимальным значением параметра. Тип Point2d.
 Описание
 Свойство StartPoint представляет точку сплайна с минимальным значением параметра. Не реализовано.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.SplineEntity2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!