Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LayoutManager.AbortLayoutRename
 Послать отзыв
 Cобытие создается, когда прерывается переименование листа.
 Синтаксис
C#
Visual Basic
Копировать Код
public event LayoutRenamedEventHandler AbortLayoutRename;
Копировать Код
Public Event AbortLayoutRename As LayoutRenamedEventHandler
 Описание
 Cобытие создается, когда прерывается переименование листа.
 Ссылки
 Teigha.DatabaseServices.LayoutManager, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!