Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PolygonMesh.MakeNClosed
 Послать отзыв
 Метод реализует замыкание сети PolygonMesh в направлении N.
 Синтаксис
C#
Visual Basic
Копировать Код
public void MakeNClosed();
Копировать Код
Public Sub MakeNClosed()
 Описание
 Метод реализует замыкание сети PolygonMesh в направлении N. Это означает, что сеть будет рассматриваться как непрерывная при переходе от последнего столбца к первому.
 Ссылки
 Teigha.DatabaseServices.PolygonMesh, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!