Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AbstractViewPE.ZoomExtents
 Послать отзыв
 Метод зуммирует связанный видовой экран так, чтобы привести его к указанным границам в системе координат глаза с учетом заданного множителя.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool ZoomExtents( ref BoundBlock3d pExtents, double extentsCoef );
Копировать Код
Public Function ZoomExtents( ByRef pExtents As BoundBlock3d, extentsCoef As Double ) As Boolean
 Параметры
 Параметры
 Описание
 pExtents
 Входные границы для видового экрана. Тип BoundBlock3d.
 extentsCoef
 Опциональный множитель для границ. Тип double.
 Возвращает
 Возвращает true в случае успешного завершения метода. В противном случае возвращает false.
 Описание
 Метод зуммирует связанный видовой экран так, чтобы привести его к указанным границам в системе координат глаза с учетом заданного множителя.
 Ссылки
 Teigha.DatabaseServices.AbstractViewPE, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!