Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DxfFiler.WriteResultBuffer
 Послать отзыв
 Метод записывает в данный объект Filer указанный буфер результатов.
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract void WriteResultBuffer( ResultBuffer buffer );
Копировать Код
Public MustOverride Sub WriteResultBuffer( buffer As ResultBuffer )
 Параметры
 Параметры
 Описание
 buffer
 Буфер результатов, который должен быть записан в файлер. Тип ResultBuffer.
 Описание
 Метод записывает в данный объект Filer указанный буфер результатов.
 Ссылки
 Teigha.DatabaseServices.DxfFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!