Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Database.RestoreForwardingXrefSymbols
 Послать отзыв
 Синтаксис
C#
Visual Basic
public void RestoreForwardingXrefSymbols();
Public Sub RestoreForwardingXrefSymbols()
 Описание
 Этот метод должен использоваться вместе с RestoreOriginalXrefSymbols(), и должен окружать код, в котором планируется редактировать и/или сохранить внешние ссылки базы данных.
 RestoreForwardingXrefSymbols() строго последовательно возвращает все изменения (назад во времени) до достижения надлежащего разрешенного состояния внешней ссылки.
 Для того чтобы правильно разрешить внешнюю ссылку, методу RestoreForwardingXrefSymbols() требуется доступ на запись к таблице символов и записям таблицы символов в основном чертеже. Следовательно, приложение должно закрыть все открытые таблицы символов или записи таблиц символов перед вызовом RestoreForwardingXrefSymbols().
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!