Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.TileMode
 Послать отзыв
 Синтаксис
C#
Visual Basic
public bool TileMode;
Public Property TileMode() As bool
 Описание
 Обеспечивает доступ к текущему значению TILEMODE для базы данных. Значение false соответствует 0. Значение true — 1.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!