Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Tolerance.Global
 Послать отзыв
 Свойство Global представляет точность (допуск) по умолчанию.
 Синтаксис
C#
Visual Basic
Копировать Код
public static Tolerance Global;
Копировать Код
Public Shared Property [Global] As Tolerance
 Возвращает
 Возвращает точность (допуск) по умолчанию. Тип Tolerance.
 Описание
 Свойство Global представляет точность (допуск) по умолчанию.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.Geometry.Tolerance, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!