Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Light.AttenuationType
 Послать отзыв
 Свойство представляет тип затухания данного источника света.
 Синтаксис
C#
Visual Basic
Копировать Код
public AttenuationType AttenuationType;
Копировать Код
Public Property AttenuationType As AttenuationType
 Возвращает
 Возвращает тип затухания. Перечисление AttenuationType.
 Описание
 Свойство представляет тип затухания данного источника света (линейная / квадратичная инверсия, либо отсутствие затухания).
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Light, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!