Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ProxyObject.ApplicationDescription
 Послать отзыв
 Свойство ApplicationDescription обеспечивает доступ к описанию приложения объекта, представленного данным прокси-объектом.
 Синтаксис
C#
Visual Basic
Копировать Код
public String ApplicationDescription;
Копировать Код
Public ReadOnly Property ApplicationDescription As String
 Возвращает
 Возвращает описание приложения. Тип String.
 Описание
 Свойство ApplicationDescription обеспечивает доступ к описанию приложения объекта, представленного данным прокси-объектом.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.ProxyObject, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!