Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeader.MLeader
 Послать отзыв
 Конструктор по умолчанию класса MLeader.
 Синтаксис
C#
Visual Basic
Копировать Код
public MLeader();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса MLeader.
 Ссылки
 Teigha.DatabaseServices.MLeader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!