Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.IsFormatEditable
 Послать отзыв
 Метод позволяет определить, разрешено ли изменение формата ячейки.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual bool IsFormatEditable( int row, int column );
Копировать Код
Public virtual Function IsFormatEditable( row As Integer, column As Integer ) As Boolean
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 col
 Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
 Возвращает
 Возвращает true, если формат можно изменить, и false, если нет.
 Описание
 Метод позволяет определить, разрешено ли изменение формата ячейки.
 Учитывая, что семантика редактируемой ячейки может измениться по мере добавления новых состояний, для проверки редактируемости ячеек рекомендуется использовать данный метод вместо прямого обращения к cellState.
 Замечания
 Для получения того же результата предпочтительнее использовать Table.Cells[row,column].IsFormatEditable.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!