Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.ColorDictionaryId
 Послать отзыв
 Синтаксис
C#
Visual Basic
public DatabaseServices::ObjectId ColorDictionaryId;
Public Property ColorDictionaryId() As DatabaseServices.ObjectId
 Описание
 Возвращает Id словаря цветов базы данных.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!