Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Spline.Spline
 Послать отзыв
 Конструктор класса Spline. Создает экземпляр класса с указанными параметрами.
 Синтаксис
C#
Visual Basic
Копировать Код
public Spline( int degree, bool rational, bool closed, bool periodic, ref Point3dCollection controlPoints, ref DoubleCollection knots, ref DoubleCollection weights, double controlPointTolerance, double knotTolerance );
Копировать Код
Public Sub New( degree As Integer, rational As Boolean, closed As Boolean, periodic As Boolean, ByRef controlPoints As Point3dCollection, ByRef knots As DoubleCollection, ByRef weights As DoubleCollection, controlPointTolerance As Double, knotTolerance As Double )
 Параметры
 Параметры
 Описание
 degree
 Степень сплайна (его порядок). Тип int.
 rational
 Флаг, определяющий, является ли сплайн рациональным. Тип bool.
 closed
 Флаг, определяющий, является ли сплайн замкнутым. Тип bool.
 periodic
 Флаг, определяющий, является ли сплайн периодическим. Тип bool.
 controlPoints
 Коллекция управляющих вершин сплайна. Тип Point3dCollection.
 knots
 Узловой вектор сплайна. Тип DoubleCollection.
 weights
 Коллекция весов в управляющих вершинах. Тип DoubleCollection.
 controlPointTolerance
 Допуск для управляющих вершин сплайна. Тип double.
 knotTolerance
 Допуск для значений узлов сплайна. Тип double.
 Описание
 Конструктор класса Spline. Создает экземпляр класса с указанными параметрами.
 Если сплайн должен быть рациональным, то аргумент rational должен иметь значение true.
 Если сплайн должен быть замкнутым, то аргумент closed должен иметь значение true.
 Если сплайн должен быть периодическим, то аргумент periodic должен иметь значение true (допускается только для замкнутого сплайна). Сплайн является периодическим с периодом T, если точки сплайна, соответствующие параметрам t и t+T, совпадают для любого значения t.
 Массив весов используется только для рационального сплайна. В этом случае он должен иметь то же количество элементов, что и коллекция управляющих вершин controlPoints. Все значения весов должны быть положительными.
 В случае непериодического сплайна длина узлового вектора должна быль на degree+1 больше длины массива управляющих вершин controlPoints.
 В случае периодического сплайна длина узлового вектора должна на единицу превышать длину массива управляющих вершин. Первая и последняя управляющие вершины НЕ ДОЛЖНЫ быть идентичными.
 Значение nodeTolerance используется для выявления совпадающих узлов. Если два узла отличаются менее, чем на nodeTolerance, то эти два значения будут считаться одинаковыми (и первое из них будет использоваться для обоих узлов).
 Для выявления совпадающих управляющих вершин используется значение controlPointTolerance. Управляющие вершины, расстояние между которыми (в единицах чертежа) оказывается меньше, чем controlPointTolerance, считаются совпадающими. Если первая и последняя управляющие вершины неразличимы в пределах допуска controlPointTolerance, сплайн будет замкнутым независимо от значения входного аргумента closed.
 Замечания
 Если какой-либо из входных параметров оказывается неприемлемым, данный конструктор ведет себя как конструктор по умолчанию. Переданные в конструктор аргументы не используются, а методы запроса данных сплайна возвращают недопустимые значения.
 Чтобы определить, удалось ли инициализировать сплайн входными параметрами, рекомендуется использовать свойство Spline.IsNull, которое в случае успешной инициализации возвращает false.
 Ссылки
 Teigha.DatabaseServices.Spline, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!