Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocArrayPathParameters.EndOffset
 Послать отзыв
 Свойство обеспечивает доступ к смещению для последнего элемента массива по траектории.
 Синтаксис
C#
Visual Basic
Копировать Код
public double EndOffset;
Копировать Код
Public Property EndOffset() As Double
 Возвращает
 Возвращает смещение элемента. Тип double.
 Описание
 Свойство обеспечивает доступ к смещению для последнего элемента массива по траектории.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.AssocArrayPathParameters, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!