Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Group.Prepend
 Послать отзыв
 Метод позволяет вставить указанные в коллекции объекты в начало списка членов данной группы.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Prepend( ref ObjectIdCollection ids );
Копировать Код
Public Sub Prepend( ByRef ids As ObjectIdCollection )
 Параметры
 Параметры
 Описание
 ids
 Идентификаторы вставляемых объектов. Тип ObjectIdCollection.
 Описание
 Метод позволяет вставить указанные в коллекции ids объекты в начало списка членов данной группы.
 Ссылки
 Teigha.DatabaseServices.Group, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!