Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.SetBackgroundColorNone
 Послать отзыв
 Метод позволяет включить или отключить цвет фона в указанной ячейке.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetBackgroundColorNone( int row, int col, bool value );
Копировать Код
Public virtual Sub SetBackgroundColorNone( row As Integer, col As Integer, value As Boolean )
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 col
 Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
 value
 Флаг включения цвета фона для ячейки, тип bool.
 Описание
 Метод позволяет включить или отключить цвет фона в указанной ячейке.
 Замечания
 Для получения того же результата предпочтительнее использовать Table.Cells[row,column].IsBackgroundColorNone.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!