Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GeoLocationData.GeoRSSTag
 Послать отзыв
 Свойство обеспечивает доступ к строке GeoRSS.
 Синтаксис
C#
Visual Basic
Копировать Код
public String GeoRSSTag;
Копировать Код
Public Property GeoRSSTag As String
 Возвращает
 Возвращает строку GeoRSS. Тип String.
 Описание
 Свойство обеспечивает доступ к строке GeoRSS.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.GeoLocationData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!