Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.ExternalEntityKind
 Послать отзыв
 Перечисление ExternalEntityKind определяет типы внешних графических объектов, доступ к которым поддерживается интерфейсом графической системы платформы.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum ExternalEntityKind { AcisEntity = 0, Ge3dCurveEntity = 1, Ge3dSurfaceEntity = 2, ExternalEntityUndefined = 3 }
Копировать Код
Public Enum ExternalEntityKind AcisEntity = 0 Ge3dCurveEntity = 1 Ge3dSurfaceEntity = 2 ExternalEntityUndefined = 3 End Enum
 Члены
 Члены
 Описание
 AcisEntity
 Значение: 0. Внешний объект является объектом ACIS.
 ExternalEntityUndefined
 Значение: 3. Тип внешнего объекта не определен.
 Ge3dCurveEntity
 Значение: 1. Внешний объект является объектом OdGeCurve3d*.
 Ge3dSurfaceEntity
 Значение: 2. Внешний объект является объектом OdGeSurface3d*.
 Описание
 Перечисление ExternalEntityKind определяет типы внешних графических объектов, доступ к которым поддерживается интерфейсом графической системы платформы.
 Ваши комментарии по поводу этого топика: Послать отзыв!