Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Surface.GetEnvelope
 Послать отзыв
 Метод позволяет найти минимальный прямоугольник в пространстве параметров, в который вписана вся область параметров данной поверхности.
 Синтаксис
C#
Visual Basic
Копировать Код
public Interval[] GetEnvelope();
Копировать Код
Public Function GetEnvelope() As Interval()
 Возвращает
 Возвращает двухэлементный массив параметрических интервалов по U и V, соответственно. Тип Interval[].
 Описание
 Метод позволяет найти минимальный прямоугольник в пространстве параметров, в который вписана вся область параметров данной поверхности. Предполагает реализацию в производных классах.
 Индексы возвращаемого массива:
0 - интервал параметра U.
1 - интервал параметра V.
 Ссылки
 Teigha.Geometry.Surface, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!