Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.TableStyle.PostTableStyleToDatabase
 Послать отзыв
 Метод добавляет табличный стиль в указанную базу данных.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual DatabaseServices.ObjectId PostTableStyleToDatabase( ref DatabaseServices.Database databasePointer, ref String styleName );
Копировать Код
Public Overridable Function PostTableStyleToDatabase( ByRef databasePointer As DatabaseServices.Database, ByRef styleName As String ) As DatabaseServices.ObjectId
 Параметры
 Параметры
 Описание
 databasePointer
 База данных, в которую добавляется табличный стиль. Тип DatabaseServices.Database.
 styleName
 Имя добавляемого табличного стиля. Тип String.
 Возвращает
 Возвращает идентификатор добавленного табличного стиля. Тип DatabaseServices.ObjectId.
 Описание
 Метод добавляет табличный стиль в указанную базу данных.
 Ссылки
 Teigha.DatabaseServices.TableStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!