Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство RasterImageDef.ImageModified
 Послать отзыв
 Синтаксис
C#
Visual Basic
public bool ImageModified;
Public Property ImageModified() As bool
 Описание
 Обеспечивает доступ к внутреннему признаку изменения данных изображения, который устанавливается в true, если данные были изменены.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.RasterImageDef, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!