Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Leader.Dimsah
 Послать отзыв
 Синтаксис
C#
Visual Basic
public bool Dimsah;
Public Property Dimsah() As bool
 Описание
 Возвращает или устанавливает текущее значение DIMSAH для выноски. Если значение переопределено для выноски, то это переопределенное значение возвращается. В противном случае возвращается значение из размерности размерного стиля. Для получения дополнительной информации о DIMSAH смотрите секцию "Системные переменные" Руководства по командам nanoCAD.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Leader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!