Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LayoutManager.CopyLayout
 Послать отзыв
 Метод копирует существующий объект Layout с именем copyName в новый лист с именем newName.
 Синтаксис
C#
Visual Basic
Копировать Код
public void CopyLayout( ref String copyName, ref String newName );
Копировать Код
Public Sub CopyLayout( ByRef copyName As String, ByRef newName As String )
 Параметры
 Параметры
 Описание
 copyName
 Имя существующего объекта Layout, копию которого следует создать, тип String.
 newName
 Имя нового объекта Layout, который должен быть копией листа copyName, тип String.
 Описание
 Метод копирует существующий объект Layout с именем copyName в новый лист с именем newName.
 Ссылки
 Teigha.DatabaseServices.LayoutManager, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!