Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DynamicBlockReferenceProperty.Show
 Послать отзыв
 Свойство Show позволяет определить, отображается ли данное свойство динамического блока на палитре свойств.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool Show;
Копировать Код
Public ReadOnly Property Show As Boolean
 Возвращает
 Возвращает true, если данное свойство отображается на палитре свойств. В противном случае возвращает false.
 Описание
 Свойство Show позволяет определить, отображается ли данное свойство динамического блока на палитре свойств.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.DynamicBlockReferenceProperty, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!