Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FeatureControlFrame.GetBoundingPoints
 Послать отзыв
 Метод предназначен для получения граничных точек в WCS этого символа допусков.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual Point3dCollection GetBoundingPoints();
Копировать Код
Public Overridable Function GetBoundingPoints() As Point3dCollection
 Возвращает
 Возвращает коллекцию граничных точек прямоугольной рамки символа допусков. Тип Point3dCollection.
 Описание
 Метод предназначен для получения коллекции Point3dCollection граничных точек Point3d данного символа допусков FeatureControlFrame. Граничные точки определены с мировой системе координат WCS.
 Индексы граничных точек в возвращаемой коллекции имеют следующий смысл:
0 - Верхний левый угол рамки.
1 - Верхний правый угол рамки.
2 - Правый нижний угол рамки.
3 - Левый нижний угол рамки.
 Ссылки
 Teigha.DatabaseServices.FeatureControlFrame, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!