Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.ClipBoundary2dData.IsEqualTo
 Послать отзыв
 Метод предназначен для проверки данного объекта на равенство другому объекту ClipBoundary2dData.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsEqualTo( ClipBoundary2dData a );
Копировать Код
Public Function IsEqualTo( a As ClipBoundary2dData ) As Boolean
 Параметры
 Параметры
 Описание
 a
 Входной объект, с которым проверяется равенство. Тип ClipBoundary2dData.
 Возвращает
 Возвращает true, если оба объекта не являются нулевыми и одновременно выполняются следующие условия:
Совпадают обрезанные вершины;
Совпадают исходные метки обрезанных сегментов;
Совпадают условия обрезки.
 В противном случае возвращает false.
 Описание
 Метод предназначен для проверки данного объекта на равенство другому объекту ClipBoundary2dData.
 Ссылки
 Teigha.Geometry.ClipBoundary2dData, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!