Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.Dimalttz
 Послать отзыв
 Свойство управляет подавлением нулей в значениях допусков при использовании альтернативных единиц изменения.
 Синтаксис
C#
Visual Basic
Копировать Код
public int Dimalttz;
Копировать Код
Public Property Dimalttz As Integer
 Возвращает
 Возвращает код состояния отображения/подавления нулей. Тип int.
 Описание
 Свойство управляет подавлением нулей в значениях допусков при использовании альтернативных единиц изменения.
 Значение
 Описание
 0
 Подавляются нулевые значения целых футов и дюймов.
 1
 Отображаются нулевые значения целых футов и дюймов.
 2
 Отображаются нули в футах и подавляются нули в дюймах.
 3
 Подавляются нули в футах и отображаются нули в дюймах.
 4
 Подавляются ведущие нули.
 8
 Подавляются замыкающие нули.
 12
 Подавляются как ведущие, так и замыкающие нули.
 Это свойство действует при условии, что для свойств Dimalt и Dimtol установлено значение true.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!