Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Body.AcisOut
 Послать отзыв
 Метод записывает указанную коллекцию тел ACIS в заданный файл.
 Синтаксис
C#
Visual Basic
Копировать Код
public void AcisOut( ref String fileName, ref DBObjectCollection entitiesOutToFile );
Копировать Код
Public Sub AcisOut( ByRef fileName As String, ByRef entitiesOutToFile As DBObjectCollection )
 Параметры
 Параметры
 Описание
 fileName
 Имя файла для сохранения тел ACIS. Тип String.
 entitiesOutToFile
 Коллекция тел ACIS, которые предполагается сохранить в файле. Тип DBObjectCollection.
 Описание
 Метод записывает указанную коллекцию объектов в файл с именем fileName. Коллекция может содержать объекты любого типа, но в файл записываются только объекты классов Region, Solid3d, Body или классов, производных от них. Создаваемый файл имеет формат ASCII ACIS SAT.
 Ссылки
 Teigha.DatabaseServices.Body, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!