Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод LinetypeTableRecord.SetShapeIsUcsOrientedAt
 Послать отзыв
 Синтаксис
C#
Visual Basic
public void SetShapeIsUcsOrientedAt(int index, bool isOriented);
Public Sub SetShapeIsUcsOrientedAt(index As Integer, isOriented As bool)
 Параметры
 Параметры
 Описание
 index
 Индекс (начинающийся с 0) строки, содержащей форму (текстовую строку), для которой производится установка значения
 isOriented
 Признак, определяющий, будет или нет форма ориентирована в соответствии с текущим UCS
 Описание
 Этот метод устанавливает бит UcsOriented (бит 1) для формы (или текстовой строки) в строке, определенной параметром index в LinetypeTableRecord. Если IsUcsOriented равен true, то этот бит устанавливается, и форма будет ориентирована относительно текущего UCS при отображении. Если параметр IsUcsOriented равен false, то форма будет ориентирована относительно встроенной в форму линии.
 Значение index должно быть больше или равно 0, но меньше чем значение, возвращаемое LinetypeTableRecord.NumDashes. index представляет собой индекс, начинающийся с нуля (формы и текстовые строки имеют тот же самый индекс, как и штриховка, предшествующая им в определении типа линии) с первым элементом типа линии, соответствующим индексу, равному 0.
 Для получения дополнительной информации об определении типа линии и длины штриховки, смотри раздел "Типы линий" в Инструкции пользователя по nanoCAD.
 Ссылки
 Teigha.DatabaseServices.LinetypeTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!