Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObject.ReleaseExtensionDictionary()
 Послать отзыв
 Метод предназначен для удаления расширенного словаря объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public void ReleaseExtensionDictionary();
Копировать Код
Public Sub ReleaseExtensionDictionary()
 Описание
 Удаляет расширенный словарь объекта (это означает, что метод удаляет объект, как собственник словаря), если он существует и пустой. Этот метод вызывает метод словаря erase(). Любые реакторы, присоединенные к расширенному словарю, получают обычное уведомление при открытии на запись, очистке, закрытии.
 Ссылки
 Teigha.DatabaseServices.DBObject, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!