Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.BoundBlock2d.Set
 Послать отзыв
 Метод позволяет задать базовую точку и стороны граничной рамки с геометрией в виде параллелограмма.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Set( Point2d basePoint, Vector2d direction1, Vector2d direction2 );
Копировать Код
Public Sub Set( basePoint As Point2d, direction1 As Vector2d, direction2 As Vector2d )
 Параметры
 Параметры
 Описание
 basePoint
 Входная базовая точка граничной рамки. Тип Point2d.
 direction1
 Первая сторона параллелограмма. Тип Vector2d.
 direction2
 Вторая сторона параллелограмма. Тип Vector2d.
 Описание
 Метод позволяет задать базовую точку и стороны граничной рамки с геометрией в виде параллелограмма.
 Ссылки
 Teigha.Geometry.BoundBlock2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!