Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Entity2d
 Послать отзыв
 Класс Entity2d служит базовым классом для всех двумерных геометрических объектов.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Geometry::Entity2d
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdGeEntity2d")] public abstract class Entity2d : DisposableWrapper, ICloneable
Копировать Код
<Wrapper("OdGeEntity2d")> Public MustInherit Class Entity2d Inherits DisposableWrapper Implements ICloneable
 Описание
 Класс Entity2d служит базовым классом для всех двумерных геометрических объектов.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Geometry.Entity2d
 Имя
 Описание
 Entity2d Методы
 Ниже перечислены методы класса Entity2d.
 Ссылки
 Entity2d Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!