Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.NurbsData.GetWeights
 Послать отзыв
 Метод предоставляет коллекцию значений весов NURBS.
 Синтаксис
C#
Visual Basic
Копировать Код
public DoubleCollection GetWeights();
Копировать Код
Public Function GetWeights() As DoubleCollection
 Возвращает
 Возвращает коллекцию весов NURBS. Тип DoubleCollection.
 Описание
 Метод предоставляет коллекцию значений весов NURBS.
 Чем ближе значение веса к нулю, тем ближе кривая к прямой линии вблизи соответствующей управляющей вершины. Если вес увеличивается, кривая приближается к соответствующей управляющей вершине. Если вес уменьшается, кривая отдаляется от соответствующей управляющей вершины.
 Ссылки
 Teigha.DatabaseServices.NurbsData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!