Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.BoundaryRepresentation.Brep.Surf
 Послать отзыв
 Свойство Surf представляет поверхность, связанную с данным объектом.
 Синтаксис
C#
Visual Basic
Копировать Код
public Teigha.DatabaseServices.Surface Surf;
Копировать Код
Public Property Surf() As Teigha.DatabaseServices.Surface
 Возвращает
 Возвращает связанную с данным объектом поверхность. Тип Teigha.DatabaseServices.Surface.
 Описание
 Свойство Surf представляет поверхность, связанную с данным объектом.
 Условия
 Только чтение.
 Ссылки
 Teigha.BoundaryRepresentation.Brep, Teigha.BoundaryRepresentation
 Ваши комментарии по поводу этого топика: Послать отзыв!