Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Делегат Teigha.DatabaseServices.XrefRedirectedEventHandler
 Послать отзыв
 This is type Teigha::DatabaseServices::XrefRedirectedEventHandler.
 Синтаксис
C#
Visual Basic
public delegate XrefRedirectedEventHandler();
Public Delegate Sub XrefRedirectedEventHandler()
 Ваши комментарии по поводу этого топика: Послать отзыв!