Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GeoLocationData.GetMeshPointMap
 Послать отзыв
 Метод позволяет получить в виде объекта MeshPointMap связанные между собой исходную точку и точку назначения, хранящиеся в сети по указанному индексу.
 Синтаксис
C#
Visual Basic
Копировать Код
public MeshPointMap GetMeshPointMap( int index );
Копировать Код
Public Function GetMeshPointMap( index As Integer ) As MeshPointMap
 Параметры
 Параметры
 Описание
 index
 Индекс пары связанных точек. Тип int.
 Возвращает
 Возвращает объект MeshPointMap, хранящийся в сети по указанному индексу.
 Описание
 Метод позволяет получить в виде объекта MeshPointMap связанные между собой исходную точку и точку назначения, хранящиеся в сети по указанному индексу.
 Ссылки
 Teigha.DatabaseServices.GeoLocationData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!