Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Section.GenerateSectionGeometry
 Послать отзыв
 Метод предназначен для формирования геометрии сечения.
 Синтаксис
C#
Visual Basic
Копировать Код
public void GenerateSectionGeometry( ref Entity pEnt, out Array pIntFillEnts, out Array pBackgroundEnts, out Array pForegroundEnts, out Array pFurveTangencyEnts, out Array pCurveTangencyEnts );
Копировать Код
Public Sub GenerateSectionGeometry( ByRef pEnt As Entity, pIntFillEnts As out Array, pBackgroundEnts As out Array, pForegroundEnts As out Array, pFurveTangencyEnts As out Array, pCurveTangencyEnts As out Array )
 Параметры
 Параметры
 Описание
 pEnt
 Входной объект чертежа, тип которого допустим для построения сечения. Тип Entity.
 pIntFillEnts
 Выходной массив, содержащий геометрию границ разрезов. Тип Array.
 pBackgroundEnts
 Выходной массив, содержащий объекты штриховки разрезов. Тип Array.
 pForegroundEnts
 Выходной массив, содержащий геометрию объектов фона. Тип Array.
 pFurveTangencyEnts
 Выходной массив, содержащий геометрию объектов переднего плана. Тип Array.
 pCurveTangencyEnts
 Выходной массив, содержащий объекты касательных к кривой. Тип Array.
 Описание
 Метод предназначен для формирования 2D- или 3D-геометрии сечения. Операция применима к следующим объектам чертежа: 3dSolid, Surface, Body и Region.
 Ссылки
 Teigha.DatabaseServices.Section, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!