Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeader.SetDoglegLength
 Послать отзыв
 Метод позволяет задать длину полки в указанном кластере линии выноски.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetDoglegLength( int leaderIndex, double doglegLength );
Копировать Код
Public Sub SetDoglegLength( leaderIndex As Integer, doglegLength As Double )
 Параметры
 Параметры
 Описание
 leaderIndex
 Индекс линии выноски. Тип int.
 doglegLength
 Длина полки. Тип double.
 Описание
 Метод позволяет задать длину полки в указанном кластере линии выноски.
 Ссылки
 Teigha.DatabaseServices.MLeader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!