Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Handle.Equals
 Послать отзыв
 Возвращает true, если данный объект идентичен укзазанному в аргументе.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool Equals( ref Object obj );
Копировать Код
Public Function Equals( ByRef obj As Object ) As Boolean
 Параметры
 Параметры
 Описание
 obj
 Объект для сравнения, тип Object.
 Возвращает
 Возвращает true, если данный объект идентичен укзазанному в аргументе, и false в противном случае.
 Описание
 Возвращает true, если данный объект идентичен укзазанному в аргументе.
 Ссылки
 Teigha.DatabaseServices.Handle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!