Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeader.LandingGap
 Послать отзыв
 Свойство представляет величину зазора между концом линии полки и связанным многострочным текстом данной мультивыноски.
 Синтаксис
C#
Visual Basic
Копировать Код
public double LandingGap;
Копировать Код
Public Property LandingGap As Double
 Возвращает
 Возвращает величину зазора между концом линии полки и содержимым мультивыноски. Тип double.
 Описание
 Свойство представляет величину зазора между концом линии полки и многострочным текстом (либо блоком) данной мультивыноски.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MLeader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!