Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Helix.Helix
 Послать отзыв
 Конструктор по умолчанию класса Helix.
 Синтаксис
C#
Visual Basic
Копировать Код
public Helix();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса Helix.
 Ссылки
 Teigha.DatabaseServices.Helix, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!