Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство BlockReference.Name
 Послать отзыв
 Синтаксис
C#
Visual Basic
public String Name;
Public Property Name() As String
 Описание
 Возвращает имя связанного BlockTableRecord.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.BlockReference, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!