Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.RevolveOptionsBuilder.ToRevolveOptions
 Послать отзыв
 Метод формирует объект RevolveOptions, используя сформированные в данном объекте параметры операции вращения.
 Синтаксис
C#
Visual Basic
Копировать Код
public RevolveOptions ToRevolveOptions();
Копировать Код
Public Function ToRevolveOptions() As RevolveOptions
 Возвращает
 Возвращает настройки операции вращения. Тип RevolveOptions.
 Описание
 Метод формирует объект RevolveOptions на базе сформированных в данном объекте параметров операции вращения. RevolveOptions используются для управления формой поверхностей или тел вращения.
 Ссылки
 Teigha.DatabaseServices.RevolveOptionsBuilder, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!