Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeader.ArrowSymbolId
 Послать отзыв
 Свойство представляет идентификатор объекта символа стрелки для данного объекта MLeader.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectId ArrowSymbolId;
Копировать Код
Public Property ArrowSymbolId As ObjectId
 Возвращает
 Возвращает идентификатор объекта символа стрелки. Тип ObjectId.
 Описание
 Свойство представляет идентификатор объекта символа стрелки для данного объекта MLeader.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MLeader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!