Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DwgFiler.ReadVector3d
 Послать отзыв
 Метод предназначен для получения трехмерного вектора из текущего элемента данного объекта Filer.
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract Vector3d ReadVector3d();
Копировать Код
Public MustOverride Function ReadVector3d() As Vector3d
 Возвращает
 Возвращает трехмерный вектор. Тип Vector3d.
 Описание
 Метод предназначен для получения трехмерного вектора из текущего элемента данного объекта Filer.
 Ссылки
 Teigha.DatabaseServices.DwgFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!