Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ProxyEntity.OriginalDxfName
 Послать отзыв
 Свойство OriginalDxfName возвращает имя DXF пользовательского объекта, представленного данным прокси-объектом.
 Синтаксис
C#
Visual Basic
Копировать Код
public String OriginalDxfName;
Копировать Код
Public ReadOnly Property OriginalDxfName As String
 Возвращает
 Возвращает имя DXF пользовательского объекта. Тип String.
 Описание
 Свойство OriginalDxfName возвращает имя DXF пользовательского объекта, представленного данным прокси-объектом.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.ProxyEntity, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!