Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.PolylineCurve3d.PolylineCurve3d
 Послать отзыв
 Конструктор класса PolylineCurve3d. Создает полилинию, которая аппроксимирует указанную трехмерную кривую с заданной точностью.
 Синтаксис
C#
Visual Basic
Копировать Код
public PolylineCurve3d( ref Curve3d curve, double epsilon );
Копировать Код
Public Sub New( ByRef curve As Curve3d, epsilon As Double )
 Параметры
 Параметры
 Описание
 curve
 Кривая, которую требуется аппроксимировать полилинией. Тип Curve3d.
 epsilon
 Точность аппроксимации. Тип double.
 Описание
 Конструктор класса PolylineCurve3d. Создает полилинию, аппроксимирующую трехмерную кривую curve в пределах заданной точности epsilon.
 Ссылки
 Teigha.Geometry.PolylineCurve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!