Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Material.IndirectBumpScale
 Послать отзыв
 Свойство представляет коэффициент непрямой рельефности данного материала.
 Синтаксис
C#
Visual Basic
Копировать Код
public double IndirectBumpScale;
Копировать Код
Public Property IndirectBumpScale As Double
 Возвращает
 Возвращает коэффициент непрямой рельефности материала. Тип double.
 Описание
 Свойство представляет коэффициент непрямой рельефности данного материала (indirect bump scale). Используется для масштабирования карты рельефности материала в условиях непрямого освещения.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Material, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!