Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.AltSuppressLeadingZeros
 Послать отзыв
 Свойство управляет подавлением ведущих нулей в альтернативных значениях размеров.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool AltSuppressLeadingZeros;
Копировать Код
Public Property AltSuppressLeadingZeros As Boolean
 Возвращает
 Возвращает true, если подавление включено. В противном случае возвращает false.
 Описание
 Свойство позволяет включить или отменить подавление ведущих нулей в альтернативных значениях размеров. Этот функционал работает только в случае, если для свойства Dimalt установлено значение true.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!