Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Scale3d.ToArray
 Послать отзыв
 Метод формирует на основе данного объекта трехэлементный массив масштабных коэффициентов по осям X, Y и Z.
 Синтаксис
C#
Visual Basic
Копировать Код
public double[] ToArray();
Копировать Код
Public Function ToArray() As Double()
 Возвращает
 Возвращает трехэлементный массив масштабных коэффициентов по осям X, Y и Z. Тип double[]. Индекс 0 соответствует направлению X, индекс 1 - направлению Y, индекс 2 - направлению Z.
 Описание
 Метод формирует на основе данного объекта трехэлементный массив масштабных коэффициентов по осям X, Y и Z.
 Ссылки
 Teigha.Geometry.Scale3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!