Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Sphere.SouthPole
 Послать отзыв
 Свойство SouthPole представляет положение южного полюса данной сферы.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d SouthPole;
Копировать Код
Public ReadOnly Property SouthPole As Point3d
 Возвращает
 Возвращает точку южного полюса данной сферы. Тип Point3d.
 Описание
 Свойство SouthPole представляет положение южного полюса данной сферы.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.Sphere, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!