Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SectionSettings.SetLinetypeScale
 Послать отзыв
 Метод позволяет задать масштаб типа линий для геометрии указанного типа.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetLinetypeScale( SectionType nSecType, SectionGeometry nGeometry, double fScale );
Копировать Код
Public Sub SetLinetypeScale( nSecType As SectionType, nGeometry As SectionGeometry, fScale As Double )
 Параметры
 Параметры
 Описание
 nSecType
 Тип сечения. Перечисление SectionType.
 nGeometry
 Типы элементов геометрии сечения. Перечисление SectionGeometry.
 fScale
 Масштаб типа линий. Тип double.
 Описание
 Метод позволяет задать масштаб типа линий для геометрии указанного типа.
 Ссылки
 Teigha.DatabaseServices.SectionSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!