Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector2d.DotProduct
 Послать отзыв
 Метод реализует скалярное произведение данного вектора с указанным 2D-вектором.
 Синтаксис
C#
Visual Basic
Копировать Код
public double DotProduct( Vector2d v );
Копировать Код
Public Function DotProduct( v As Vector2d ) As Double
 Параметры
 Параметры
 Описание
 v
 Входной 2D-вектор, являющийся сомножителем в скалярном произведении. Тип Vector2d.
 Возвращает
 Возвращает результат скалярного произведения векторов. Тип double.
 Описание
 Метод реализует скалярное произведение данного вектора с указанным 2D-вектором.
 Ссылки
 Teigha.Geometry.Vector2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!