Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Viewport.SunId
 Послать отзыв
 Свойство SunId представляет идентификатор связанного с этим видовым экраном объекта солнца (бесконечно удаленного источника освещения).
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.ObjectId SunId;
Копировать Код
Public ReadOnly Property SunId As DatabaseServices.ObjectId
 Возвращает
 Возвращает идентификатор объекта солнца (бесконечно удаленного источника освещения). Тип DatabaseServices.ObjectId.
 Описание
 Свойство SunId представляет идентификатор связанного с этим видовым экраном объекта солнца (бесконечно удаленного источника освещения).
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Viewport, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!