Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DatabaseSummaryInfo.ToString
 Послать отзыв
 Метод предназначен для формирования эквивалентного строкового представления данного объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public String ToString();
Копировать Код
Public Function ToString() As String
 Возвращает
 Возвращает эквивалентное представление данного объекта в виде строки. Тип String.
 Описание
 Метод предназначен для формирования эквивалентного строкового представления данного объекта.
 Ссылки
 Teigha.DatabaseServices.DatabaseSummaryInfo, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!