Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Database.TimeZoneDescription
 Послать отзыв
 Синтаксис
C#
Visual Basic
public String TimeZoneDescription(DatabaseServices::TimeZone tz);
Public Function TimeZoneDescription(tz As DatabaseServices.TimeZone) As String
 Параметры
 Параметры
 Описание
 tz
 Значение из перечисления TimeZone
 Описание
 Возвращает описание часовой зоны. Этот метод не влияет на текущие настройки часовой зоны базы данных.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!