Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocAction.RemoveDependency
 Послать отзыв
 Метод удаляет указанную зависимость AssocDependency из данного действия и опционально стирает ее.
 Синтаксис
C#
Visual Basic
Копировать Код
public void RemoveDependency( Teigha.DatabaseServices.ObjectId dependencyId, bool alsoEraseIt );
Копировать Код
Public Sub RemoveDependency( dependencyId As Teigha.DatabaseServices.ObjectId, alsoEraseIt As Boolean )
 Параметры
 Параметры
 Описание
 dependencyId
 Входной идентификатор удаляемой зависимости. Тип Teigha.DatabaseServices.ObjectId.
 alsoEraseIt
 Флаг стирания зависимости после ее удаления из данного действия. Тип bool.
 Описание
 Метод удаляет входную зависимость dependencyId из данного действия и опционально стирает ее.
 Ссылки
 Teigha.DatabaseServices.AssocAction, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!