Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CompoundObjectId.IsExternal
 Послать отзыв
 Свойство позволяет проверить, является ли объект CompoundObjectId внешней ссылкой.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsExternal;
Копировать Код
Public Property IsExternal() As Boolean
 Возвращает
 Возвращает true, если CompoundObjectId является внешней ссылкой. В противном случае возвращает false.
 Описание
 Свойство позволяет проверить, является ли объект CompoundObjectId внешней ссылкой.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.CompoundObjectId, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!