Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Point2d.ToArray
 Послать отзыв
 Метод создает массив, содержащий значения координат данной точки.
 Синтаксис
C#
Visual Basic
Копировать Код
public double[] ToArray();
Копировать Код
Public Function ToArray() As double()
 Возвращает
 Возвращает массив из двух элементов, содержащий значения координат X и Y данной точки. Тип double[].
 Описание
 Метод позволяет получить массив из двух элементов, содержащий значения координат X и Y данной точки.
 Ссылки
 Teigha.Geometry.Point2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!