Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Matrix2d.IsScaledOrtho
 Послать отзыв
 Метод позволяет проверить, являются ли векторы в линейной части данной матрицы ортогональными друг другу в пределах указанной точности.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsScaledOrtho( Tolerance tolerance );
Копировать Код
Public Function IsScaledOrtho( tolerance As Tolerance ) As Boolean
 Параметры
 Параметры
 Описание
 tolerance
 Входная точность. Тип Tolerance.
 Возвращает
 Возвращает true, если с указанной точностью tolerance векторы в линейной части данной матрицы можно считать ортогональными друг другу. В противном случае возвращает false.
 Описание
 Метод позволяет проверить, являются ли векторы в линейной части данной матрицы ортогональными друг другу в пределах указанной точности.
 Ссылки
 Teigha.Geometry.Matrix2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!