Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DynamicBlockReferenceProperty.BlockId
 Послать отзыв
 Свойство BlockId представляет идентификатор объекта вхождения динамического блока.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.ObjectId BlockId;
Копировать Код
Public ReadOnly Property BlockId As DatabaseServices.ObjectId
 Возвращает
 Возвращает идентификатор объекта. Тип DatabaseServices.ObjectId.
 Описание
 Свойство BlockId представляет идентификатор объекта вхождения динамического блока.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.DynamicBlockReferenceProperty, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!