Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Section.GetVertex
 Послать отзыв
 Метод позволяет получить вершину по ее индексу.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d GetVertex( int nIndex );
Копировать Код
Public Function GetVertex( nIndex As Integer ) As Point3d
 Параметры
 Параметры
 Описание
 nIndex
 Входной индекс вершины. Тип int.
 Возвращает
 Возвращает вершину с указанным индексом. Тип Point3d.
 Описание
 Метод позволяет получить вершину по ее индексу.
 Ссылки
 Teigha.DatabaseServices.Section, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!