Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DrawOrderTable.SetRelativeDrawOrder
 Послать отзыв
 Метод позволяет задать иной относительный порядок отрисовки указанных объектов в этой таблице DrawOrderTable. Порядок отрисовки других объектов не изменяется.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetRelativeDrawOrder( ref ObjectIdCollection collection );
Копировать Код
Public Sub SetRelativeDrawOrder( ByRef collection As ObjectIdCollection )
 Параметры
 Параметры
 Описание
 collection
 Идентификаторы объектов, для которых изменяется порядок отрисовки. Тип ObjectIdCollection.
 Описание
 Метод позволяет задать иной относительный порядок отрисовки указанных объектов в этой таблице DrawOrderTable. Относительный порядок отрисовки других объектов не изменяется.
 Ссылки
 Teigha.DatabaseServices.DrawOrderTable, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!