Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.OpenCloseTransaction.TransactionManager
 Послать отзыв
 Свойство представляет менеджер транзакций, связанный с сданным объектом.
 Синтаксис
C#
Visual Basic
Копировать Код
public override DatabaseServices.TransactionManager TransactionManager;
Копировать Код
Public Overrides ReadOnly Property TransactionManager As DatabaseServices.TransactionManager
 Возвращает
 Возвращает менеджер транзакций. Тип TransactionManager.
 Описание
 Свойство представляет менеджер транзакций, связанный с сданным объектом.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.OpenCloseTransaction, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!