Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Entity.Unhighlight()
 Послать отзыв
 Метод отменяет подсветку геометрического объекта на экране, независимо от количества предыдущих вызовов метода Highlight. Его переопределение требуется только при необходимости выполнения дополнительных действий до или после снятия подсветки.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Unhighlight();
Копировать Код
Public Sub Unhighlight()
 Описание
 Использование метода
 Этот метод отменяет подсветку всего геометрического объекта на экране.
 Не является необходимым соответствие каждого вызова метода Highlight() с вызовом метода Unhighlight(). Вызов метода Unhighlight() снимает выделение геометрического объекта независимо от того, сколько раз до этого вызывался метод Highlight().
 Разработка метода в производных классах
 Разработанный метод Entity.Unhighlight() выполняет все действия, необходимые для отмены подсветки любых подобъектов. Поэтому, нет необходимости переопределять этот метод, за исключением случая, когда вы хотите выполнить некоторые до- или после- операционные действия, или вы хотите отменить возможность снять подсветку геометрических подобъектов.
 Если метод переопределен и он снимает подсветку геометрических подобъектов, то метод Entity.Unhighlight() должен быть вызван в некоторой точке переопределенного метода, чтобы выполнить реальное снятие подсветки.
 Ссылки
 Teigha.DatabaseServices.Entity, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!