Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Entity2d.TransformBy
 Послать отзыв
 Метод применяет к данному объекту указанное двумерное геометрическое преобразование.
 Синтаксис
C#
Visual Basic
Копировать Код
public void TransformBy( Matrix2d transform );
Копировать Код
Public Sub TransformBy( transform As Matrix2d )
 Параметры
 Параметры
 Описание
 transform
 Матрица двумерного геометрического преобразования. Тип Matrix2d.
 Описание
 Метод применяет к данному объекту указанное двумерное геометрическое преобразование.
 Ссылки
 Teigha.Geometry.Entity2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!