Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.LineSegment3d.MidPoint
 Послать отзыв
 Свойство MidPoint представляет среднюю точку данного линейного сегмента.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d MidPoint;
Копировать Код
Public ReadOnly Property MidPoint As Point3d
 Возвращает
 Возвращает среднюю точку линейного сегмента. Тип Point3d.
 Описание
 Свойство MidPoint представляет среднюю точку данного линейного сегмента.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.LineSegment3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!