Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ObjectIdCollection.CopyTo
 Послать отзыв
 Метод предназначен для копирования этой коллекции идентификаторов объектов в указанный массив по указанному индексу.
 Синтаксис
C#
Visual Basic
Копировать Код
public void CopyTo( ref ObjectId[] a, int index );
Копировать Код
Public Sub CopyTo( ByRef a() As ObjectId, index As Integer )
 Параметры
 Параметры
 Описание
 a
 Целевой массив. Тип ObjectId[].
 index
 Индекс в массиве a, начиная с которого в массиве сохраняются идентификаторы объектов из данной коллекции. Тип int.
 Описание
 Метод предназначен для копирования этой коллекции идентификаторов объектов в указанный массив a по указанному индексу index.
 Ссылки
 Teigha.DatabaseServices.ObjectIdCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!