Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Cylinder.Origin
 Послать отзыв
 Свойство Origin представляет точку начала координат данного цилиндра.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d Origin;
Копировать Код
Public ReadOnly Property Origin As Point3d
 Возвращает
 Возвращает точку начала координат цилиндра. Тип Point3d.
 Описание
 Свойство Origin представляет точку на оси цилиндра, которая служит началом координат данного цилиндра.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.Cylinder, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!