Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FormattedTableData.GetRotation
 Послать отзыв
 Метод позволяет определить угол поворота содержимого указанной ячейки.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual double GetRotation( int row, int column );
Копировать Код
Public Overridable Function GetRotation( row As Integer, column As Integer ) As Double
 Параметры
 Параметры
 Описание
 row
 Индекс строки. Тип int. Должен быть неотрицательным и меньше количества строк в таблице.
 column
 Индекс столбца. Тип int. Должен быть неотрицательным и меньше количества столбцов в таблице.
 Возвращает
 Возвращает угол поворота в радианах. Тип double.
 Описание
 Метод позволяет определить угол поворота содержимого указанной ячейки.
 Ссылки
 Teigha.DatabaseServices.FormattedTableData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!