Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Group.Append
 Послать отзыв
 Метод предназначен для добавления в данную группу указанного объекта чертежа.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Append( DatabaseServices.ObjectId id );
Копировать Код
Public Sub Append( id As DatabaseServices.ObjectId )
 Параметры
 Параметры
 Описание
 id
 Идентификатор добавляемого в группу объекта чертежа. Тип DatabaseServices.ObjectId.
 Описание
 Метод предназначен для добавления в данную группу указанного объекта чертежа.
 Один и тот же объект может принадлежать более чем одной группе. Однако в любой такой группе он может присутствовать только в одном экземпляре.
 Ссылки
 Teigha.DatabaseServices.Group, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!