Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Ray3d.Ray3d
 Послать отзыв
 Конструктор класса Ray3d. Создает луч с указанной точкой начала и заданным направляющим вектором.
 Синтаксис
C#
Visual Basic
Копировать Код
public Ray3d( Point3d point, Vector3d vec );
Копировать Код
Public Sub New( point As Point3d, vec As Vector3d )
 Параметры
 Параметры
 Описание
 point
 Начальная точка луча. Тип Point3d.
 vec
 Направляющий вектор луча. Тип Vector3d.
 Описание
 Конструктор класса Ray3d. Создает луч с началом в точке point и направляющим вектором vec.
 Ссылки
 Teigha.Geometry.Ray3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!