Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DatabaseSummaryInfo!=
 Послать отзыв
 Оператор неравенства для класса DatabaseSummaryInfo.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool operator !=( DatabaseSummaryInfo a, DatabaseSummaryInfo b );
Копировать Код
Public Operator !=( a As DatabaseSummaryInfo, b As DatabaseSummaryInfo )
 Параметры
 Параметры
 Описание
 a
 Левый операнд. Тип DatabaseSummaryInfo.
 b
 Правый операнд. Тип DatabaseSummaryInfo.
 Возвращает
 Возвращает true, если не выполняется хотя бы одно из указанных ниже условий:
Совпадают поля Title;
Совпадают поля Subject;
Совпадают поля Author;
Совпадают поля Keywords;
Совпадают поля Comments;
Совпадают поля LastSavedBy;
Совпадают поля RevisionNumber;
Совпадают поля HyperlinkBase;
Совпадают поля CustomProperties.
 В противном случае возвращает false.
 Описание
 Оператор неравенства для класса DatabaseSummaryInfo. Позволяет проверить, различаются ли указанные объекты.
 Ссылки
 Teigha.DatabaseServices.DatabaseSummaryInfo, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!