Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.OffsetSurface.IsCylinder
 Послать отзыв
 Свойство IsCylinder позволяет определить, является ли поверхность смещения цилиндром.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsCylinder;
Копировать Код
Public ReadOnly Property IsCylinder As Boolean
 Возвращает
 Возвращает true, если поверхность смещения представлена цилиндром. В противном случае возвращает false.
 Описание
 Свойство IsCylinder позволяет определить, является ли поверхность смещения цилиндром.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.OffsetSurface, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!