Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Entity.BoundingBoxIntersectWith(Entity
 Послать отзыв
 Метод предназначен для расчета ограничивающего параллелепипеда данного геометрического объекта в мировой системе координат (WCS) и поиска всех пересечений указанного геометрического объекта (entityPointer) с ребрами этого параллелепипеда. Найденные точки пересечений добавляются в выходной массив и задаются в координатах WCS.
 Синтаксис
C#
Visual Basic
Копировать Код
public void BoundingBoxIntersectWith(Entity entityPointer, Intersect intersectType, Point3dCollection points, IntPtr thisGraphicSystemMarker, IntPtr otherGraphicSystemMarker);
Копировать Код
Public Sub BoundingBoxIntersectWith(entityPointer As Entity, intersectType As Intersect, points As Point3dCollection, thisGraphicSystemMarker As IntPtr, otherGraphicSystemMarker As IntPtr)
 Параметры
 Параметры
 Описание
 entityPointer
 Геометрический объект, с которым "данный" геометрический объект пересекается. Тип Entity
 intersectType
 Тип пересечения. Тип Intersect
 points
 Выходной массив точек пересечения (в WCS координатах). Тип Point3dCollection
 thisGraphicSystemMarker
 GS маркер геометрических подобъектов "данного" объекта, который включен в операцию пересечения. Может быть равен 0, если не используется. Тип IntPtr
 otherGraphicSystemMarker
 GS маркер геометрических подобъектов объекта entityPointer, который включен в операцию пересечения. Может быть равен 0, если не используется. Тип IntPtr
 Описание
 Этот метод сначала рассчитывает ограничивающий параллелепипед для данного геометрического объекта (в WCS координатах — мировой системе координат). Затем он ищет все пересечения объекта, заданного entityPointer, со всеми ребрами ограничивающего параллелепипеда данного геометрического объекта.
 Параметр intersectType используется для определения того, как поступать с пересечением продолжения ребер ограничивающего параллелепипеда данного объекта и геометрического объекта, заданного entityPointer, при расчете пересечений. Возможные значения intersectType:
 Intersect.OnBothOperands
 Не продолжать ни ребра ограничивающего параллелепипеда геометрического объекта, ни геометрического объекта, заданного entityPointer. В этом случае результат вычисляется только по точкам реального пересечения ограничивающего параллелепипеда объекта с геометрическим объектом, заданным entityPointer
 Intersect.ExtendThis
 Продлевать ребра ограничивающего параллелепипеда (если необходимо) при расчете пересечений, но не продлевать геометрический объект, заданный entityPointer
 Intersect.ExtendArg
 Продлевать геометрический объект, заданный entityPointer (если необходимо) при расчете пересечений, но не продлевать ребра ограничивающего параллелепипеда данного геометрического объекта
 Intersect.ExtendBoth
 Продлевать и ребра ограничивающего параллелепипеда данного геометрического объекта, и геометрический объект, заданный entityPointer (если необходимо) при расчете пересечений
 Все найденные точки пересечений добавляются в массив точек. Все точки задаются в мировых координатах (WCS). Note В процессе определений пересечений геометрического объекта entityPointer с ребрами ограничивающего параллелепипеда данного объекта, может быть вызвана не созданная версия метода intersectWith() объекта entityPointer (если геометрический объект entityPointer является пользовательским объектом, то метод intersectWith() будет вызван явно). Если метод intersectWith() не разработан для объектов геометрического класса entityPointer, то при вызове этого метода возникнет ошибка функции.
 Агрументы thisGraphicSystemMarker и otherGraphicSystemMarker используются только, если вызывается метод intersectWith() класса entityPointer и эти параметры просто передаются в этот метод, хотя и там они могут не использоваться.
 Ссылки
 Teigha.DatabaseServices.Entity, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!