Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 DimStyleTableRecord.Dimltex1
 Послать отзыв
 Свойство отвечает за настройку типа линии первых выносных линий линейных размеров.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual ObjectId Dimltex1 { get; set; }
Копировать Код
Public Overridable Property Dimltex1 As ObjectId
 Возвращает
 Возвращает тип данных ObjectId.
 Описание
 В свойстве хранится ObjectId установленного типа линии для первых выносных линий линейных размеров. Значение по умолчанию - «По слою».
 Свойство также доступно через системную переменную DIMLTEX1 и пользовательское меню в окне изменения/создания размерного стиля:
  При изменении системной переменной DIMLTEX1 будет создан новый размерный стиль под названием <переопределение> на основе текущего с новым значением DIMLTEX1.
 Условия
 Чтение и запись.
 Пример
 Пример изменения типа линии первых выносных линий линейных размеров (значения свойства Dimltex1) в размерном стиле Standard:
C#
 Копировать Код
public partial class Commands { [Teigha.Runtime.CommandMethod("Dimltex1Change")] public void Dimltex1StandardDimStyle() { // Получение ссылки на активный документ HostMgd.ApplicationServices.Document doc = HostMgd.ApplicationServices.Application.DocumentManager.MdiActiveDocument; // Получение ссылки на редактор документа HostMgd.EditorInput.Editor ed = doc.Editor; // Получение ссылки на базу данных документа Teigha.DatabaseServices.Database db = doc.Database; // Начало транзакции с базой данных документа using (Teigha.DatabaseServices.Transaction trans = db.TransactionManager.StartTransaction()) { // Открываем таблицу размерных стилей для чтения Teigha.DatabaseServices.DimStyleTable dimStyleTable = trans.GetObject(db.DimStyleTableId, Teigha.DatabaseServices.OpenMode.ForRead) as Teigha.DatabaseServices.DimStyleTable; // Находим в таблице размерных стилей ObjectId нужного стиля по его названию Teigha.DatabaseServices.ObjectId styleId = dimStyleTable["Standard"]; // Открываем таблицу размерного стиля для изменений Teigha.DatabaseServices.DimStyleTableRecord obj = trans.GetObject(styleId, Teigha.DatabaseServices.OpenMode.ForWrite) as Teigha.DatabaseServices.DimStyleTableRecord; // Открываем таблицу типов линий для чтения Teigha.DatabaseServices.LinetypeTable linetypeTable= trans.GetObject(db.LinetypeTableId, Teigha.DatabaseServices.OpenMode.ForRead) as Teigha.DatabaseServices.LinetypeTable; ed.WriteMessage($"nDimltex1 before: {obj.Dimltex1}"); // Изменяем тип первых выносных линий obj.Dimltex1 = linetypeTable["ГОСТ 2.303 3"]; // Также увеличим размерный текст и размер стрелок на окончаниях размерных линий obj.Dimtxt = 7; obj.Dimasz = 7; ed.WriteMessage($"nDimltex1 after: {obj.Dimltex1}"); trans.Commit(); } } }
 Результат работы команды Dimltex1Change:
 Было:
 Стало:
 Ссылки
 Teigha.DatabaseServices.DimStyleTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!