Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AnnotationType
 Послать отзыв
 Данное перечисление описывает тип аннотации.
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdDbLeader.AnnoType")] public enum AnnotationType { MText = 0, FeatureControlFrame = 1, BlockRef = 2, NoAnnotation = 3 }
Копировать Код
<Wrapper("OdDbLeader.AnnoType")> Public Enum AnnotationType MText = 0 FeatureControlFrame = 1 BlockRef = 2 NoAnnotation = 3 End Enum
 Члены
 Члены
 Описание
 MText
 Аннотация представляет собой MText.
 FeatureControlFrame
 Аннотация представляет собой рамку управления элементом.
 BlockRef
 Аннотация представляет собой вхождение блока.
 NoAnnotation
 Аннотации отсутствуют.
 Описание
 Данное перечисление описывает тип аннотации.
 Ваши комментарии по поводу этого топика: Послать отзыв!