Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Curve.EndParam
 Послать отзыв
 Возвращает значение параметра для конечной точки кривой.
 Синтаксис
C#
Visual Basic
Копировать Код
public double EndParam;
Копировать Код
Public Property EndParam() As double
 Описание
 Возвращает значение параметра для конечной точки кривой.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Curve, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!