Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CellRange.BottomRow
 Послать отзыв
 Свойство возвращает индекс нижней строки диапазона ячеек.
 Синтаксис
C#
Visual Basic
Копировать Код
public int BottomRow;
Копировать Код
Public ReadOnly Property BottomRow As Integer
 Возвращает
 Возвращает индекс нижней строки диапазона. Тип int.
 Описание
 Свойство возвращает индекс нижней строки диапазона ячеек.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.CellRange, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!