Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Mline.Justification
 Послать отзыв
 Свойство возвращает выравнивание в данной мультилинии.
 Синтаксис
C#
Visual Basic
Копировать Код
public MlineJustification Justification;
Копировать Код
Public Property Justification As MlineJustification
 Возвращает
 Возвращает заданное выравнивание как значение из перечисления MlineJustification.
 Описание
 Свойство возвращает выравнивание в данной мультилинии.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Mline, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!