Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Group.IsNotAccessible
 Послать отзыв
 Свойство позволяет определить, является ли эта группа недоступной.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsNotAccessible;
Копировать Код
Public ReadOnly Property IsNotAccessible As Boolean
 Возвращает
 Возвращает true, если группа помечена как недоступная. В противном случае возвращает false.
 Описание
 Свойство позволяет определить, является ли эта группа недоступной. В текущей версии только группы во внешних ссылках помечаются как недоступные.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Group, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!