Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Polyline3d.Polyline3d
 Послать отзыв
 Конструктор по умолчанию. Создает незамкнутую полилинию с типом SimplePoly.
 Синтаксис
C#
Visual Basic
Копировать Код
public Polyline3d();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию. Создает незамкнутую полилинию с типом SimplePoly.
 Ссылки
 Teigha.DatabaseServices.Polyline3d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!