Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbCurve3d.SetFitData
 Послать отзыв
 Метод пересчитывает сплайн, используя заданные определяющие точки, векторы касательных в начальной и конечной точках и точность интерполяции.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetFitData( ref Point3dCollection fitPoints, Vector3d startTangent, Vector3d endTangent, Tolerance fitTolerance );
Копировать Код
Public Sub SetFitData( ByRef fitPoints As Point3dCollection, startTangent As Vector3d, endTangent As Vector3d, fitTolerance As Tolerance )
 Параметры
 Параметры
 Описание
 fitPoints
 Определяющие точки. Тип Point3dCollection.
 startTangent
 Вектор касательной в начальной точке. Тип Vector3d.
 endTangent
 Вектор касательной в конечной точке. Тип Vector3d.
 fitTolerance
 Геометрическая точность. Тип Tolerance.
 Описание
 Метод пересчитывает сплайн, используя заданные определяющие точки, векторы касательных в начальной и конечной точках и точность интерполяции.
 Если аргумент fitTolerance не равен 0, то построенный сплайн может не проходить точно через определяющие точки, но максимальное отклонение построенного сплайна от любой определяющей точки не будет превышать fitTolerance.
 Ссылки
 Teigha.Geometry.NurbCurve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!