Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FindFileHint
 Послать отзыв
 Данное перечисление определяет варианты назначения файлов.
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdDbHostAppServices.FindFileHint")] public enum FindFileHint { ArxApplication = 7, CompiledShapeFile = 2, Default = 0, EmbeddedImageFile = 4, FontFile = 1, FontMapFile = 8, PatternFile = 6, TextureMapFile = 10, TrueTypeFontFile = 3, UnderlayFile = 9, XRefDrawing = 5 }
Копировать Код
<Wrapper("OdDbHostAppServices.FindFileHint")> Public Enum FindFileHint ArxApplication = 7 CompiledShapeFile = 2 Default = 0 EmbeddedImageFile = 4 FontFile = 1 FontMapFile = 8 PatternFile = 6 TextureMapFile = 10 TrueTypeFontFile = 3 UnderlayFile = 9 XRefDrawing = 5 End Enum
 Члены
 Члены
 Описание
 Default
 Значение: 0. Файл по умолчанию.
 FontFile
 Значение: 1. Файл шрифта.
 CompiledShapeFile
 Значение: 2. Компилированный файл формы.
 TrueTypeFontFile
 Значение: 3. Файл шрифта TrueType (TTF).
 EmbeddedImageFile
 Значение: 4. Файл внедренного изображения.
 XRefDrawing
 Значение: 5. Чертеж из внешней ссылки.
 PatternFile
 Значение: 6. Файл штриховки (PAT).
 ArxApplication
 Значение: 7. Приложение ARX.
 FontMapFile
 Значение: 8. Файл сопоставления (соответствия) шрифтов.
 UnderlayFile
 Значение: 9. Файл подложки.
 TextureMapFile
 Значение: 10. Файл сопоставления (соответствия) текстур.
 Описание
 Данное перечисление определяет варианты назначения файлов.
 Ваши комментарии по поводу этого топика: Послать отзыв!