Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AbstractViewTableRecord.BackClipEnabled
 Послать отзыв
 Свойство BackClipEnabled позволяет определить, включен ли режим заднего отсечения для TableRecord.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool BackClipEnabled;
Копировать Код
Public Property BackClipEnabled As Boolean
 Возвращает
 Возвращает true, если режим заднего отсечения включен. В противном случае возвращает false.
 Описание
 Свойство BackClipEnabled позволяет определить, включен ли режим заднего отсечения для TableRecord вида или видового экрана.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.AbstractViewTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!