Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.Dimsah
 Послать отзыв
 Свойство играет роль переключателя между режимами индивидуальной настройки типа стрелок слева и справа на размерной линии и режимом, при котором стрелки одинаковы.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool Dimsah;
Копировать Код
Public Property Dimsah As Boolean
 Возвращает
 Возвращает true, если для стрелок слева и справа используются блоки, заданные свойствами Dimblk1 и Dimblk2, соответственно. Если блоки стрелок одинаковы, возвращает false.
 Описание
 Свойство управляет режимом отображения стрелок на размерных линиях. Оно позволяет переключаться между режимом индивидуальной настройки типа стрелок слева и справа и режимом, при котором стрелки одинаковы.
 Если свойство Dimsah принимает значение true, для отображения стрелок слева и справа используются блоки, заданные свойствами Dimblk1 и Dimblk2, соответственно. В противном случае тип стрелок одинаков и определяется свойством Dimblk.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!