Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.TableStyleFlags
 Послать отзыв
 Перечисление TableStyleFlags определяет флаги, которые используются для работы со стилями таблиц. Для внутреннего использования.
 Синтаксис
C#
Visual Basic
Копировать Код
[Flags] [Wrapper("AcDb.TableStyleFlags")] public enum TableStyleFlags { HorizontalInsideLineFirst = 1, HorizontalInsideLineSecond = 2, HorizontalInsideLineThird = 4, TableStyleModified = 8 }
Копировать Код
<Flags> <Wrapper("AcDb.TableStyleFlags")> Public Enum TableStyleFlags HorizontalInsideLineFirst = 1 HorizontalInsideLineSecond = 2 HorizontalInsideLineThird = 4 TableStyleModified = 8 End Enum
 Члены
 Члены
 Описание
 HorizontalInsideLineFirst
 Значение: 1. Горизонтальная нижняя линия сетки строки наименования таблицы располагается на верхнем уровне порядка отрисовки.
 HorizontalInsideLineSecond
 Значение: 2. Горизонтальная нижняя линия сетки строки заголовков столбцов располагается на верхнем уровне порядка отрисовки.
 HorizontalInsideLineThird
 Значение: 4. Горизонтальная нижняя линия сетки строки подзаголовков столбцов располагается на верхнем уровне порядка отрисовки.
 TableStyleModified
 Значение: 8. Тип данных стиля таблицы изменен.
 Описание
 Перечисление TableStyleFlags определяет флаги, которые используются для работы со стилями таблиц. Для внутреннего использования.
 Ваши комментарии по поводу этого топика: Послать отзыв!