Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ImageQuality
 Послать отзыв
 Данное перечисление определяет режимы качества отображения растровых изображений.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum ImageQuality { Draft = 0, High = 1, Invalid = -1 }
Копировать Код
Public Enum ImageQuality Draft = 0 High = 1 Invalid = -1 End Enum
 Члены
 Члены
 Описание
 Invalid
 Значение: -1. Недействительное значение.
 Draft
 Значение: 0. Низкое (черновое) качество вывода изображения.
 High
 Значение: 1. Высокое качество вывода изображения.
 Описание
 Данное перечисление определяет режимы качества отображения растровых изображений.
 Эти режимы позволяют выбирать между скоростью отображения и качеством отображаемого растрового изображения. В черновом режиме используются алгоритмы дискретизации и обработки, выигрывающие в скорости ценой снижения качества изображения. В режиме высокого качества используются более ресурсоемкие алгоритмы, которые как правило генерируют более точные и визуально приемлемые результаты.
 Ваши комментарии по поводу этого топика: Послать отзыв!