Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.RenderMode
 Послать отзыв
 Данное перечисление определяет режимы рендеринга.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum RenderMode { Optimized2D = 0, Wireframe = 1, HiddenLine = 2, FlatShaded = 3, GouraudShaded = 4, FlatShadedWithWireframe = 5, GouraudShadedWithWireframe = 6 }
Копировать Код
Public Enum RenderMode Optimized2D = 0 Wireframe = 1 HiddenLine = 2 FlatShaded = 3 GouraudShaded = 4 FlatShadedWithWireframe = 5 GouraudShadedWithWireframe = 6 End Enum
 Члены
 Члены
 Описание
 Optimized2D
 Значение: 0. Визуализация, оптимизированная для 2D-графики (классическое 2D).
 Wireframe
 Значение: 1. Каркасное представление.
 HiddenLine
 Значение: 2. Представление, в котором скрытые линии не отображаются.
 FlatShaded
 Значение: 3. Равномерное тонирование.
 GouraudShaded
 Значение: 4. Тонирование по Гуро.
 FlatShadedWithWireframe
 Значение: 5. Равномерное тонирование с отображением ребер каркаса.
 GouraudShadedWithWireframe
 Значение: 6. Тонирование по Гуро с отображением ребер каркаса.
 Описание
 Данное перечисление определяет режимы рендеринга.
 Ваши комментарии по поводу этого топика: Послать отзыв!