Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MText.ShowBorders
 Послать отзыв
 Свойство управляет режимом отображения границ многострочного текста.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool ShowBorders;
Копировать Код
Public Property ShowBorders As Boolean
 Возвращает
 Возвращает true, если отображение границ многострочного текста включено. В противном случае возвращает false.
 Описание
 Свойство управляет режимом отображения границ многострочного текста.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MText, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!