Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Ole2Frame.Type
 Послать отзыв
 Свойство представляет тип данного OLE-объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual ItemType Type;
Копировать Код
Public Overridable ReadOnly Property Type As ItemType
 Возвращает
 Возвращает тип OLE-объекта из перечисления ItemType.
 Описание
 Свойство представляет тип данного OLE-объекта.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Ole2Frame, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!