Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ObjectId.Handle
 Послать отзыв
 Свойство предоставляет доступ к дескриптору объекта с данным ObjectId.
 Синтаксис
C#
Visual Basic
Копировать Код
public Handle Handle;
Копировать Код
Public Property Handle() As Handle
 Возвращает
 Возвращает тип Teigha.DatabaseServices.Handle.
 Описание
 Свойство предоставляет доступ к дескриптору объекта с данным ObjectId.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.ObjectId, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!