Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.Dimblks
 Послать отзыв
 Свойство задает или возвращает имя блока, используемого для отображения концов стрелок на размерных линиях.
 Синтаксис
C#
Visual Basic
Копировать Код
public String Dimblks;
Копировать Код
Public Property Dimblks As String
 Возвращает
 Возвращает имя блока для концов стрелок. Тип String.
 Описание
 Свойство задает или возвращает имя блока, используемого для отображения концов стрелок на размерных линиях.
 Допустимы следующие имена:
 Значение
 Описание
 "None"
 Отсутствует.
 "Closed"
 Закрытая.
 "Dot"
 Точка.
 "ClosedBlank"
 Контурная замкнутая.
 "Oblique"
 Засечка.
 "ArchTick"
 Двойная засечка.
 "Open"
 Разомкнутая.
 "Origin"
 Указатель исходной точки.
 "Origin2"
 Указатель исходной точки 2.
 "Open90"
 Разомкнутая 90 градусов (прямой угол).
 "Open30"
 Разомкнутая 30 градусов.
 "DotBlank"
 Контурная точка.
 "DotSmall"
 Малая точка.
 "BoxFilled"
 Заполненный прямоугольник.
 "BoxBlank"
 Прямоугольник.
 "DatumFilled"
 Заполненный треугольник базы отсчета.
 "DatumBlank"
 Треугольник базы отсчета.
 "Integral"
 Интеграл.
 "Small"
 Контурная малая точка.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!