Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.EllipticalCylinder.IntersectWith
 Послать отзыв
 Метод вычисляет точки пересечения данного эллиптического цилиндра с указанным линейным объектом.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d[] IntersectWith( ref LinearEntity3d linearEntity );
Копировать Код
Public Function IntersectWith( ByRef linearEntity As LinearEntity3d ) As Point3d()
 Параметры
 Параметры
 Описание
 linearEntity
 Линейный объект, с которым вычисляются пересечения. Тип LinearEntity3d.
 Возвращает
 Возвращает двухэлементный массив. Первый элемент соответствует первой точке пересечения (если она существует), а второй элемент соответствует второй точке пересечения (если она существует). Тип Point3d[].
 Описание
 Метод вычисляет точки пересечения данного эллиптического цилиндра с указанным линейным объектом. Найденные точки пересечения возвращаются в виде массива из двух элементов. Если точки пересечения отсутствуют или их вычислить не удалось, метод возвращает null.
 Замечания
 Используется вызов метода EllipticalCylinder.IntersectWith(LinearEntity3d, Tolerance) с точностью, равной Tolerance.Global.
 Ссылки
 Teigha.Geometry.EllipticalCylinder, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!