Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Solid.SetPointAt
 Послать отзыв
 Метод позволяет задать новые координаты для точки с указанным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetPointAt( short index, Point3d pointValue );
Копировать Код
Public Sub SetPointAt( index As Short, pointValue As Point3d )
 Параметры
 Параметры
 Описание
 index
 Индекс точки, у которой изменяется положение в пространстве. Тип short. Допустимые значения 0, 1, 2 или 3.
 pointValue
 Новые координаты точки (в мировой системе координат, WCS). Тип Point3d.
 Описание
 Метод позволяет задать новые координаты для точки с указанным индексом.
 Индекс может принимать значения 0, 1, 2 или 3. Координаты точки pointValue задаются в мировой системе координат (WCS).
 Ссылки
 Teigha.DatabaseServices.Solid, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!