Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.HostApplicationServices.GetPassword
 Послать отзыв
 Хост-приложения вызывают этот метод внутри себя, чтобы отобразить диалоговое окно запроса пароля. Метод устарел. См. метод bool GetPassword().
 Синтаксис
C#
Visual Basic
Копировать Код
[Obsolete( "Use bool GetPassword instead" )] public virtual String GetPassword( ref String fileName, PasswordOptions options );
Копировать Код
<Obsolete( "Use bool GetPassword instead" )> Public Overridable Function GetPassword( ByRef fileName As String, options As PasswordOptions ) As String
 Параметры
 Параметры
 Описание
 fileName
 Имя файла чертежа, для доступа к которому требуется пароль. Тип String.
 options
 Опции пароля. Перечисление PasswordOptions.
 Возвращает
 Возвращает пустую строку. Тип String.
 Описание
 Хост-приложения вызывают этот метод внутри себя, чтобы отобразить диалоговое окно запроса пароля. Метод устарел. См. метод bool GetPassword().
 Ссылки
 Teigha.DatabaseServices.HostApplicationServices, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!