Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SweptSurface.PathEntity
 Послать отзыв
 Свойство PathEntity представляет траекторию вытягивания для данной поверхности.
 Синтаксис
C#
Visual Basic
Копировать Код
public Entity PathEntity;
Копировать Код
Public ReadOnly Property PathEntity As Entity
 Возвращает
 Возвращает траекторию операции. Тип Entity.
 Описание
 Свойство PathEntity представляет траекторию вытягивания для данной поверхности.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.SweptSurface, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!