Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.HyperLinkCollection
 Послать отзыв
 Класс HyperlinkCollection представляет собой коллекцию объектов Hyperlink.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::DatabaseServices::HyperLinkCollection
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdDbHyperlinkCollection"), DefaultMember("Item")] public class HyperLinkCollection : DisposableWrapper, System.Collections.IList;
Копировать Код
<Wrapper("OdDbHyperlinkCollection"), DefaultMember("Item")> Public Class HyperLinkCollection Inherits DisposableWrapper Inherits System.Collections.IList
 Описание
 Класс HyperlinkCollection представляет собой коллекцию объектов Hyperlink. Индексация гиперссылок в коллекции начинается с 0.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.DatabaseServices.HyperLinkCollection
 Имя
 Описание
 HyperLinkCollection Методы
 Ниже перечислены методы класса HyperLinkCollection.
 HyperLinkCollection Свойства
 Ниже перечислены свойства класса HyperLinkCollection.
 Ссылки
 HyperLinkCollection Методы, HyperLinkCollection Свойства, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!