Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DxfFiler.SetError
 Послать отзыв
 Метод печатает сообщение об ошибке, используя предоставленный формат строки и переданные параметры. Не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetError( ref String format, ref String[] values );
Копировать Код
Public Overridable Sub SetError( ByRef format As String, ByRef values() As String )
 Параметры
 Параметры
 Описание
 format
 Формат сообщения об ошибке. Тип String.
 values
 Массив аргументов для форматированной строки с описанием ошибки. Тип String[].
 Описание
 Метод печатает сообщение об ошибке, используя предоставленный формат строки и переданные параметры. Не реализован.
 Ссылки
 Teigha.DatabaseServices.DxfFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!