Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LayerStateManager.LayerStateManager
 Послать отзыв
 Конструктор класса LayerStateManager, использует базу данных, которую связывает с новым экземпляром менеджера состояния слоя.
 Синтаксис
C#
Visual Basic
Копировать Код
public LayerStateManager( ref Database database );
Копировать Код
Public Sub New( ByRef database As Database )
 Параметры
 Параметры
 Описание
 database
 База данных, связываемая с новым экземпляром LayerStateManager, тип Database.
 Описание
 Конструктор класса LayerStateManager, использует базу данных, которую связывает с новым экземпляром менеджера состояния слоя.
 Ссылки
 Teigha.DatabaseServices.LayerStateManager, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!