Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SweepOptions.CheckSweepCurve
 Послать отзыв
 Метод позволяет проверить допустимость указанного объекта для операции вытягивания по траектории.
 Синтаксис
C#
Visual Basic
Копировать Код
public SweepOptionsCheckSweepCurveOut CheckSweepCurve( ref Entity sweepEnt, bool displayErrorMessages );
Копировать Код
Public Function CheckSweepCurve( ByRef sweepEnt As Entity, displayErrorMessages As Boolean ) As SweepOptionsCheckSweepCurveOut
 Параметры
 Параметры
 Описание
 sweepEnt
 Кривая, область или плоская поверхность для вытягивания по траектории. Тип Entity.
 displayErrorMessages
 Флаг, определяющий, следует ли отображать сообщения о выявленных ошибках. Тип bool.
 Возвращает
 Возвращает экземпляр класса SweepOptionsCheckSweepCurveOut с результатами метода.
 Описание
 Метод позволяет проверить допустимость указанного объекта для операции вытягивания по траектории.
 Возвращаемый экземпляр SweepOptionsCheckSweepCurveOut представляет результаты анализа входного объекта, например, состояние флага планарности объекта, точка на контуре или точка на линии, замкнутость контура , приблизительная длина контура и т.д.
 Ссылки
 Teigha.DatabaseServices.SweepOptions, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!