Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CoordinateSystem3d.Xaxis
 Послать отзыв
 Свойство Xaxis представляет направляющий вектор оси X данной системы координат.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d Xaxis;
Копировать Код
Public ReadOnly Property Xaxis As Vector3d
 Возвращает
 Возвращает направляющий вектор оси X. Тип Vector3d.
 Описание
 Свойство Xaxis представляет направляющий вектор оси X данной системы координат.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.CoordinateSystem3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!