Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор BeginWblockSelectedObjectsEventArgs.BeginWblockSelectedObjectsEventArgs
 Послать отзыв
 This is BeginWblockSelectedObjectsEventArgs, a member of class BeginWblockSelectedObjectsEventArgs.
 Синтаксис
C#
Visual Basic
internal BeginWblockSelectedObjectsEventArgs(ref Database from, Point3d insertionpoint);
Friend Sub New(ByRef from As Database, insertionpoint As Point3d)
 Ссылки
 Teigha.DatabaseServices.BeginWblockSelectedObjectsEventArgs, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!