Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.TableStyle.Description
 Послать отзыв
 Свойство Description представляет описание данного табличного стиля.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual String Description;
Копировать Код
Public Overridable Property Description As String
 Возвращает
 Возвращает описание стиля. Тип String.
 Описание
 Свойство Description представляет описание данного табличного стиля.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.TableStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!