Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.LayerZero
 Послать отзыв
 Синтаксис
C#
Visual Basic
public DatabaseServices::ObjectId LayerZero;
Public Property LayerZero() As DatabaseServices.ObjectId
 Описание
 Возвращает Id слоя 0 таблицы записей слоев базы данных.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!