Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LayerStateManager.LayerStateCompareFailed
 Послать отзыв
 Это событие создается, если не удалось сравнить состояния слоя.
 Синтаксис
C#
Visual Basic
Копировать Код
public event LayerStateEventHandler LayerStateCompareFailed;
Копировать Код
Public Event LayerStateCompareFailed As LayerStateEventHandler
 Описание
 Это событие создается, если не удалось сравнить состояния слоя.
 Ссылки
 Teigha.DatabaseServices.LayerStateManager, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!