Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotSettings.ModelType
 Послать отзыв
 Свойство ModelType определяет, к какому типу относится данный объект PlotSettings - к настройкам печати для пространства модели или для пространства листа.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool ModelType;
Копировать Код
Public ReadOnly Property ModelType As Boolean
 Возвращает
 Возвращает true, если данный объект представляет настройки для пространства модели. В случае настроек для пространства листа возвращает false.
 Описание
 Свойство ModelType определяет, к какому типу относится данный объект PlotSettings - к настройкам печати для пространства модели или для пространства листа.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.PlotSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!