Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Tracewid
 Послать отзыв
 Синтаксис
C#
Visual Basic
public double Tracewid;
Public Property Tracewid() As Double
 Описание
 Обеспечивает доступ к текущему значению TRACEWID для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!