Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbCurve2d.NumWeights
 Послать отзыв
 Свойство NumWeights представляет количество значений веса, определенных у этого сплайна.
 Синтаксис
C#
Visual Basic
Копировать Код
public int NumWeights;
Копировать Код
Public ReadOnly Property NumWeights As Integer
 Возвращает
 Если сплайн является рациональным, возвращаемое значение равно количеству управляющих вершин. В противном случае свойство возвращает 0. Тип int.
 Описание
 Свойство NumWeights представляет количество значений веса, определенных у этого сплайна.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.NurbCurve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!