Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.DimfxlenOn
 Послать отзыв
 Синтаксис
C#
Visual Basic
public bool DimfxlenOn;
Public Property DimfxlenOn() As bool
 Описание
 Возвращает признак того, включены ли фиксированные выносные линии.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!