Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SubDMesh.SetSubentColor
 Послать отзыв
 Метод задает цвет подобъекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetSubentColor( SubentityId subentId, ref Colors.Color color );
Копировать Код
Public Sub SetSubentColor( subentId As SubentityId, ByRef color As Colors.Color )
 Параметры
 Параметры
 Описание
 subentId
 Идентификатор подобъекта. Тип SubentityId.
 color
 Цвет подобъекта. Тип Colors.Color.
 Описание
 Метод задает цвет подобъекта.
 Ссылки
 Teigha.DatabaseServices.SubDMesh, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!