Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SolidBackground
 Послать отзыв
 Класс SolidBackground представляет сплошной фон.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::GraphicsInterface::Drawable Teigha::DatabaseServices::DBObject Teigha::DatabaseServices::Background Teigha::DatabaseServices::SolidBackground
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("AcDbSolidBackground")] public class SolidBackground : Background
Копировать Код
<Wrapper("AcDbSolidBackground")> Public Class SolidBackground Inherits Background
 Описание
 Класс SolidBackground представляет сплошной фон.
 Методы
 Конструкторы
 Teigha.GraphicsInterface.Drawable
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 Drawable
 Конструктор класса Teigha.GraphicsInterface.Drawable. (Унаследован от Drawable)
 Teigha.DatabaseServices.DBObject
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 DBObject
 Конструктор. (Унаследован от DBObject)
 Teigha.DatabaseServices.Background
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 Background
 Конструктор класса Background. (Унаследован от Background)
 Teigha.DatabaseServices.SolidBackground
 Имя
 Описание
 SolidBackground
 Конструктор по умолчанию класса SolidBackground.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.GraphicsInterface.Drawable
 Имя
 Описание
 Drawable Методы
 Ниже перечислены методы класса Drawable.
 Drawable Свойства
 Ниже перечислены свойства класса Drawable.
 Teigha.DatabaseServices.DBObject
 Имя
 Описание
 DBObject Методы
 Ниже перечислены методы класса DBObject.
 DBObject Свойства
 Ниже перечислены свойства класса DBObject.
 DBObject События
 Ниже перечислены события класса DBObject.
 Teigha.DatabaseServices.Background
 Имя
 Описание
 Background Методы
 Ниже перечислены методы класса Background.
 Teigha.DatabaseServices.SolidBackground
 Имя
 Описание
 SolidBackground Свойства
 Ниже перечислены свойства класса SolidBackground.
 Ссылки
 SolidBackground Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства, DBObject События
 Ваши комментарии по поводу этого топика: Послать отзыв!