Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MText.MText
 Послать отзыв
 Конструктор по умолчанию класса MText.
 Синтаксис
C#
Visual Basic
Копировать Код
public MText();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса MText.
 Ссылки
 Teigha.DatabaseServices.MText, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!