Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.BulgeVertexCollection.BulgeVertexCollection
 Послать отзыв
 Констрктор по умолчанию класса BulgeVertexCollection.
 Синтаксис
C#
Visual Basic
Копировать Код
public BulgeVertexCollection();
Копировать Код
Public Sub New()
 Описание
 Констрктор по умолчанию класса BulgeVertexCollection.
 Ссылки
 Teigha.DatabaseServices.BulgeVertexCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!