Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LayerStateManager.DeleteLayerState
 Послать отзыв
 Удаляет указанное состояние слоя.
 Синтаксис
C#
Visual Basic
Копировать Код
public void DeleteLayerState( ref String name );
Копировать Код
Public Function DeleteLayerState( ByRef name As String )
 Параметры
 Параметры
 Описание
 name
 Имя состояния слоя, которое подлежит удалению. Тип String.
 Описание
 Удаляет указанное состояние слоя.
 Ссылки
 Teigha.DatabaseServices.LayerStateManager, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!