Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SectionSettings.SetDestinationFile
 Послать отзыв
 Метод позволяет задать имя файла, в котором сохраняется созданное сечение, если в опциях генерации выставлен флаг SectionGeneration.DestinationFile.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetDestinationFile( SectionType nSecType, ref String pszFileName );
Копировать Код
Public Sub SetDestinationFile( nSecType As SectionType, ByRef pszFileName As String )
 Параметры
 Параметры
 Описание
 nSecType
 Тип сечения. Перечисление SectionType.
 pszFileName
 Имя файла, в котором сохраняется сечение. Тип String.
 Описание
 Метод позволяет задать имя файла, в котором сохраняется созданное сечение, если в опциях генерации выставлен флаг SectionGeneration.DestinationFile.
 Ссылки
 Teigha.DatabaseServices.SectionSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!