Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.EllipticalArc2d.IsInside
 Послать отзыв
 Метод позволяет убедиться, что указанная точка находится внутри полного эллипса в пределах заданной геометрической точности.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsInside( Point2d point, Tolerance tolerance );
Копировать Код
Public Function IsInside( point As Point2d, tolerance As Tolerance ) As Boolean
 Параметры
 Параметры
 Описание
 point
 Проверяемая точка. Тип Point2d.
 tolerance
 Заданная геометрическая точность. Тип Tolerance.
 Возвращает
 Возвращает true, если в пределах заданной геометрической точности можно считать, что точка point находится внутри полного эллипса. В противном случае возвращает false.
 Описание
 Метод позволяет убедиться, что указанная точка находится внутри полного эллипса в пределах заданной геометрической точности.
 Ссылки
 Teigha.Geometry.EllipticalArc2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!