Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DiametricDimension.DiametricDimension
 Послать отзыв
 Конструктор класса DiametricDimension. Создает объект DiametricDimension с указанными параметрами.
 Синтаксис
C#
Visual Basic
Копировать Код
public DiametricDimension( Point3d chordPoint, Point3d farChordPoint, double leaderLength, ref String dimensionText, DatabaseServices.ObjectId dimensionStyle );
Копировать Код
Public Sub New( chordPoint As Point3d, farChordPoint As Point3d, leaderLength As Double, ByRef dimensionText As String, dimensionStyle As DatabaseServices.ObjectId )
 Параметры
 Параметры
 Описание
 chordPoint
 Первая точка диаметра. Тип Point3d.
 farChordPoint
 Дальняя точка диаметра. Тип Point3d.
 leaderLength
 Длина выноски. Тип double.
 dimensionText
 Размерный текст. Тип String.
 dimensionStyle
 Размерный стиль. Тип DatabaseServices.ObjectId.
 Возвращает
 Возвращает новый объект DiametricDimension с указанными параметрами.
 Описание
 Конструктор класса DiametricDimension. Создает объект DiametricDimension с указанными параметрами.
 Ссылки
 Teigha.DatabaseServices.DiametricDimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!