Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CurveCurveIntersector3d.OverlapCount
 Послать отзыв
 Метод OverlapCount представляет количество интервалов перекрытия для двух кривых в данном объекте.
 Синтаксис
C#
Visual Basic
Копировать Код
public int OverlapCount();
Копировать Код
Public Function OverlapCount() As Integer
 Возвращает
 Возвращает количество интервалов перекрытия двух кривых. Тип int.
 Описание
 Метод OverlapCount представляет количество интервалов перекрытия для двух кривых в данном объекте.
 Ссылки
 Teigha.Geometry.CurveCurveIntersector3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!