Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AbstractViewPE.SetView
 Послать отзыв
 Метод переопределяет параметры связанного видового экрана, используя параметры указанного вида.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetView( ref RXObject pSourceView );
Копировать Код
Public Sub SetView( ByRef pSourceView As RXObject )
 Параметры
 Параметры
 Описание
 pSourceView
 Входной вид, который служит источником значений параметров. Тип RXObject.
 Описание
 Метод переопределяет параметры связанного видового экрана, используя параметры указанного вида.
 Ссылки
 Teigha.DatabaseServices.AbstractViewPE, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!