Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Database.Wblock (ObjectId)
 Послать отзыв
 Синтаксис
C#
Visual Basic
public Database Wblock(ObjectId blockId);
Public Function Wblock(blockId As ObjectId) As Database
 Описание
 Создает новый объект типа база данных, и затем использует механизм wblockClone для записи содержимого геометрических объектов базы данных, из которой вызывается метод, в новую базу данных.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!