Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FaceRecord.GetVertexAt
 Послать отзыв
 Метод позволяет определить индекс вершины PolyFaceMesh, используемой в качестве угловой точки грани.
 Синтаксис
C#
Visual Basic
Копировать Код
public short GetVertexAt( short faceIndex );
Копировать Код
Public Function GetVertexAt( faceIndex As Short ) As Short
 Параметры
 Параметры
 Описание
 faceIndex
 Индекс угла грани (0, 1, 2 или 3). Тип short.
 Возвращает
 Возвращает индекс вершины PolyFaceMesh. Тип short.
 Описание
 Метод позволяет определить индекс вершины PolyFaceMesh, используемой в качестве угловой точки faceIndex грани. Индексы углов граней начинаются с 0, поэтому faceIndex должен иметь значение 0, 1, 2 или 3. Индексы вершин PolyFaceMesh начинаются с 1 и являются отрицательными, если ребро невидимо, или положительными, если ребро видимо.
 Ссылки
 Teigha.DatabaseServices.FaceRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!