Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObjectReference.DBObjectReference
 Послать отзыв
 Конструктор класса DBObjectReference. Создает экземпляр класса с указанными параметрами.
 Синтаксис
C#
Visual Basic
Копировать Код
public DBObjectReference( ObjectId id, int kind );
Копировать Код
Public Sub New( id As ObjectId, kind As Integer )
 Параметры
 Параметры
 Описание
 id
 Идентификатор ссылки на объект. Тип ObjectId.
 kind
 Вид объектной ссылки (код DXF). Тип int.
 Описание
 Конструктор класса DBObjectReference. Создает экземпляр класса с указанным идентификатором объекта ObjectId и заданным типом объекта kind.
 Ссылки
 Teigha.DatabaseServices.DBObjectReference, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!