Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.Dimdle
 Послать отзыв
 Свойство задает или возвращает расстояние, на которое размерные линии выступают за пределы выносных линий.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Dimdle;
Копировать Код
Public Property Dimdle As Double
 Возвращает
 Возвращает длину выступа размерных линий за пределы выносных. Тип double.
 Описание
 Свойство задает или возвращает расстояние, на которое размерные линии выступают за пределы выносных линий. Это свойство применяется, когда для типа стрелки установлено одно из следующих значений: "None", "Oblique", "ArchTick", "DotSmall", "Integral" или "Small".
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!