Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Polyline2d.InsertVertexAt
 Послать отзыв
 Этот метод вставляет объект Vertex2d, заданный аргументом newVertex, в список вершин полилинии непосредственно после вершины Vertex2d, у которой objectId равен vertexId.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.ObjectId InsertVertexAt( DatabaseServices.ObjectId vertexId, ref Vertex2d newVertex );
Копировать Код
Public Function InsertVertexAt( vertexId As DatabaseServices.ObjectId, ByRef newVertex As Vertex2d ) As DatabaseServices.ObjectId
 Параметры
 Параметры
 Описание
 vertexId
 Идентификатор ObjectId вершины полилинии, после которой должна быть вставлена новая вершина. Чтобы вставить вершину в начало полилинии, в аргументе vertexId следует передать Null.
 newVertex
 указатель на добавляемую вершину, тип Vertex2d.
 Возвращает
 Возвращает ObjectId новой вершины полилинии.
 Описание
 Этот метод вставляет объект Vertex2d, заданный аргументом newVertex, в список вершин полилинии непосредственно после вершины Vertex2d, у которой objectId равен vertexId. Метод делает полилинию владельцем новой вершины и добавляет вершину в базу данных, в которой содержится сама полилиния. Для успешного завершения этой операции полилиния должна быть резидентной в базе данных.
 Чтобы вставить вершину в начало полилинии, в качестве аргумента vertexId следует передать Null.
 Вставленная вершина должна быть явно закрыта вызывающим приложением после возврата из метода InsertVertexAt().
 Возвращает идентификатор ObjectId объекта newVertex.
 Ссылки
 Teigha.DatabaseServices.Polyline2d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!