Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GridPropertyParameter.LineWeight
 Послать отзыв
 Свойство представляет толщину линий сетки.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.LineWeight LineWeight;
Копировать Код
Public LineWeight As DatabaseServices.LineWeight
 Возвращает
 Возвращает тип линий сетки. Тип DatabaseServices.LineWeight.
 Описание
 Свойство представляет толщину линий сетки.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.GridPropertyParameter, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!