Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.CanInsertRow
 Послать отзыв
 Данный метод проверяет, возможно ли вставить новую строку по указанному индексу.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual bool CanInsertRow( int index );
Копировать Код
Public virtual Function CanInsertRow( index As Integer ) As Boolean
 Параметры
 Параметры
 Описание
 index
 Значение индекса, для которого проверяется возможность вставки строки. Тип int.
 Возвращает
 Возвращает true, если вставка возможна, и false в противном случае.
 Описание
 Данный метод проверяет, возможно ли вставить новую строку по указанному индексу.
 Замечания
 Для получения того же результата предпочтительнее использовать Table.Rows[row].CanInsertRow.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!