Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.SplineEntity2d.Order
 Послать отзыв
 Свойство Order представляет порядок данного сплайна. Не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public int Order;
Копировать Код
Public ReadOnly Property Order As Integer
 Возвращает
 Возвращает порядок данного сплайна. Тип int.
 Описание
 Свойство Order представляет порядок данного сплайна. Не реализовано.
 Замечания
 Кривая определена на интервале между значениями узлов с индексами (order - 1) и (numberOfKnots - order). В случае B-сплайна порядок на единицу превышает степень сплайна. В случае полилинии порядок равен 1.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.SplineEntity2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!