Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Entity.GeometricExtents
 Послать отзыв
 Свойство предназначено для получения ограничивающего параллелепипеда, содержащего трехмерное представление геометрического объекта, с угловыми точками, выраженными в мировой системе координат (WCS).
 Синтаксис
C#
Visual Basic
Копировать Код
public Extents3d GeometricExtents;
Копировать Код
Public Property GeometricExtents() As Extents3d
 Возвращает
 Возвращает экземпляр класса Extents3d, представляющий собой минимальный и максимальный трехмерные углы (Point3d) ограничивающего объема, который полностью содержит геометрию объекта.
 Описание
 Свойство предоставляет инофрмацию о угловых точках (в WCS координатах) параллелепипеда (с ребрами, параллельными WCS осям X, Y и Z), который заключает внутри себя 3D расширение геометрического объекта.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.Entity, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!