Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Перечисление Teigha.DatabaseServices.AssocTransformationType
 Послать отзыв
 This is record Teigha::DatabaseServices::AssocTransformationType.
 Синтаксис
C#
Visual Basic
[Wrapper("AcDbAssocTransformationType")] public enum AssocTransformationType { NotSpecified = kNotSpecified, Stretch = kStretch, Rotate = kRotate, Move = kMove }
<Wrapper("AcDbAssocTransformationType")> Public Enum AssocTransformationType NotSpecified = kNotSpecified Stretch = kStretch Rotate = kRotate Move = kMove End Enum
 Ваши комментарии по поводу этого топика: Послать отзыв!