Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.SetDataLink
 Послать отзыв
 Метод позволяет установить в ячейке ссылку на данные.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetDataLink( int row, int column, DatabaseServices.ObjectId dataLinkId, bool bUpdate );
Копировать Код
Public virtual Sub SetDataLink( row As Integer, column As Integer, dataLinkId As DatabaseServices.ObjectId, bUpdate As Boolean )
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 column
 Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
 dataLinkId
 Объект ссылки на внешние данные. Тип DatabaseServices.ObjectId.
 bUpdate
 Флаг обновления внешней ссылки после установки (значение true) или значение false, если такое обновление не требуется.
 Описание
 Метод позволяет установить в ячейке ссылку на данные.
 Если указанная ячейка является верхней левой ячейкой существующего диапазона, связанного с данными, метод заменит старую ссылку на новую. Если это любая другая ячейка в существующем диапазоне, который связан с данными, работа метода завершится ошибкой.
 Этот метод не обновляет данные автоматически. Для обновления данных следует вызвать метод UpdateDataLink().
 Замечания
 Для получения того же результата предпочтительнее использовать Table.Cells[row,column].DataLink.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!