Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector2d.ToArray
 Послать отзыв
 Метод создает двухэлементный массив типа double, содержащий значения координат X и Y данного вектора.
 Синтаксис
C#
Visual Basic
Копировать Код
public double[] ToArray();
Копировать Код
Public Function ToArray() As Double()
 Возвращает
 Возвращает двухэлементный массив с координатами данного вектора. Тип double[].
 Описание
 Метод создает двухэлементный массив типа double, содержащий значения координат X и Y данного вектора.
 Ссылки
 Teigha.Geometry.Vector2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!