Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DataLink.Name
 Послать отзыв
 Свойство предоставляет доступ к наименованию связи с внешними данными.
 Синтаксис
C#
Visual Basic
Копировать Код
public String Name;
Копировать Код
Public Property Name() As String
 Возвращает
 Возвращает наименование связи с данными. Тип String.
 Описание
 Свойство предоставляет доступ к наименованию связи с внешними данными.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.DataLink, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!