Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.UnderlayHost.GetFile
 Послать отзыв
 Метод позволяет получить файл подложки. В случае необходимости запрашивает пароль.
 Синтаксис
C#
Visual Basic
Копировать Код
public UnderlayFile GetFile( ref String path, ref String password );
Копировать Код
Public Function GetFile( ByRef path As String, ByRef password As String ) As UnderlayFile
 Параметры
 Параметры
 Описание
 path
 Полный путь к файлу, который требуется открыть. Тип String.
 password
 Опциональная строка пароля. Тип String.
 Возвращает
 Возвращает файл подложки. Тип UnderlayFile.
 Описание
 Метод позволяет получить файл подложки. В случае необходимости запрашивает пароль.
 Ссылки
 Teigha.DatabaseServices.UnderlayHost, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!