Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.EllipticalArc3d.EllipticalArc3d
 Послать отзыв
 Конструктор по умолчанию класса EllipticalArc3d.
 Синтаксис
C#
Visual Basic
Копировать Код
public EllipticalArc3d();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса EllipticalArc3d создает полный эллипс с центром в начале координат (0,0,0), большая и малая оси которого совпадают с осями X и Y, а большой и малый радиусы равны 1. Значения начального и конечного углов равны 0 и 2 х PI, соответственно. Таким образом, построенный эллипс геометрически представляет собой единичную окружность в плоскости XY с центром в начале координат.
 Ссылки
 Teigha.Geometry.EllipticalArc3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!