Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CurveCurveIntersector2d.GetPointOnCurve1
 Послать отзыв
 Метод позволяет получить точку пересечения с заданным индексом как точку PointOnCurve2d на первой кривой.
 Синтаксис
C#
Visual Basic
Копировать Код
public PointOnCurve2d GetPointOnCurve1( int intersection );
Копировать Код
Public Function GetPointOnCurve1( intersection As Integer ) As PointOnCurve2d
 Параметры
 Параметры
 Описание
 intersection
 Входной индекс точки пересечения кривых. Тип int.
 Возвращает
 Возвращает объект PointOnCurve2d для точки пересечения на первой кривой.
 Описание
 Метод позволяет получить точку пересечения с заданным индексом как точку PointOnCurve2d на первой кривой. Класс PointOnCurve2d предоставляет доступ к 2D-координатам и значению параметра возвращаемой точки.
 Ссылки
 Teigha.Geometry.CurveCurveIntersector2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!