Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve3d.GetProjectedClosestPointTo
 Послать отзыв
 Метод находит точку на этой кривой, которая при проецировании кривой на заданную плоскость оказывается ближайшей точкой к проекции указанной точки.
 Синтаксис
C#
Visual Basic
Копировать Код
public PointOnCurve3d GetProjectedClosestPointTo( Point3d point, Vector3d projectDirection );
Копировать Код
Public Function GetProjectedClosestPointTo( point As Point3d, projectDirection As Vector3d ) As PointOnCurve3d
 Параметры
 Параметры
 Описание
 point
 Заданная внешняя точка. Тип Point3d.
 projectDirection
 Нормаль плоскости проецирования. Тип Vector3d.
 Возвращает
 Возвращает точку на кривой. Тип PointOnCurve3d.
 Описание
 Метод находит точку на этой кривой, которая при проецировании кривой на плоскость с нормалью projectDirection оказывается ближайшей точкой к проекции заданной точки point.
 Реализация использует вызов метода Curve3d.GetProjectedClosestPointTo(Point3d curve, Vector3d projectDirection, Tolerance tolerance) с точностью, равной Tolerance.Global.
 Замечания
 Данный метод используется в основном в задачах графической визуализации, где projectDirection служит направлением взгляда. В этом случае метод возвращает точку на кривой, которая кажется ближайшей к переданной в метод внешней точке (хотя в действительности ближайшей точкой она может и не быть).
 Ссылки
 Teigha.Geometry.Curve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!