Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocAction.RemoveActionsControllingObject
 Послать отзыв
 Метод отключает зависимости, контролирующие указанный объект.
 Синтаксис
C#
Visual Basic
Копировать Код
public void RemoveActionsControllingObject( Teigha.DatabaseServices.ObjectId objID );
Копировать Код
Public Sub RemoveActionsControllingObject( objID As Teigha.DatabaseServices.ObjectId )
 Параметры
 Параметры
 Описание
 objID
 Объект базы данных, у которого необходимо удалить контролирующие его зависимости (write-dependencies). Тип Teigha.DatabaseServices.ObjectId.
 Описание
 Метод отключает зависимости, контролирующие указанный объект. Зависимости отключаются в обратном порядке, начиная с последней зависимости и заканчивая первой. Метод на данный момент не реализован.
 Ссылки
 Teigha.DatabaseServices.AssocAction, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!