Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DataTable.GetCellAt
 Послать отзыв
 Метод позволяет получить ячейку данных, расположенную в указанных строке и столбце.
 Синтаксис
C#
Visual Basic
Копировать Код
public DataCell GetCellAt( int row, int col );
Копировать Код
Public Function GetCellAt( row As Integer, col As Integer ) As DataCell
 Параметры
 Параметры
 Описание
 row
 Номер строки таблицы. Тип int.
 col
 Номер столбца таблицы. Тип int.
 Возвращает
 Возвращает ячейку данных. Тип DataCell. В случае недействительного индекса строки или столбца выбрасывается исключение Teigha.Runtime.ErrorStatus.eInvalidInput.
 Описание
 Метод позволяет получить ячейку данных, расположенную в указанных строке и столбце.
 Ссылки
 Teigha.DatabaseServices.DataTable, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!