Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LayerViewportProperties.LinetypeObjectId
 Послать отзыв
 Свойство представляет идентификатор объекта слоя в связанном видовом экране.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.ObjectId LinetypeObjectId;
Копировать Код
Public Property LinetypeObjectId() As DatabaseServices.ObjectId
 Возвращает
 Возвращает идентификатор связанного видового экрана. Тип DatabaseServices.ObjectId.
 Описание
 Свойство представляет идентификатор объекта слоя в связанном видовом экране.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.LayerViewportProperties, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!