Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DynamicBlockReferenceProperty.ReadOnly
 Послать отзыв
 Свойство ReadOnly определяет, доступно ли данное свойство динамического блока только для чтения.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool ReadOnly;
Копировать Код
Public ReadOnly Property [ReadOnly] As Boolean
 Возвращает
 Возвращает true, если данное свойство динамического блока доступно только для чтения. В противном случае возвращает false.
 Описание
 Свойство ReadOnly определяет, доступно ли данное свойство динамического блока только для чтения.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.DynamicBlockReferenceProperty, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!