Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GripOverrule.MoveGripPointsAt
 Послать отзыв
 Данный метод осуществляет перемещение указанных ручек, определяемое заданным вектором.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void MoveGripPointsAt( ref Entity entity, ref GripDataCollection grips, Vector3d offset, MoveGripPointsFlags bitFlags );
Копировать Код
Public virtual Sub MoveGripPointsAt( ByRef entity As Entity, ByRef grips As GripDataCollection, offset As Vector3d, bitFlags As MoveGripPointsFlags )
 Параметры
 Параметры
 Описание
 entity
 Объект, тип Entity.
 grips
 Коллекция GripDataCollection перемещаемых ручек. Элементы коллекции должны содержать данные соответствующих ручек.
 offset
 Вектор Vector3d в мировой системе координат, определяющий направление и величину перемещения ручек.
 bitFlags
 Битовые флаги из перечисления MoveGripPointsFlags.
 Описание
 Данный метод осуществляет перемещение указанных ручек, определяемое заданным вектором.
 Ссылки
 Teigha.DatabaseServices.GripOverrule, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!