Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Scale2d.*
 Послать отзыв
 Оператор умножения структуры Scale2d. Реализует умножение вектора масштабирования на скалярный множитель.
 Синтаксис
C#
Visual Basic
Копировать Код
public static Scale2d Scale2d *( Scale2d a, double factor );
Копировать Код
Public Shared Operator *( a As Scale2d, factor As Double ) As Scale2d
 Параметры
 Параметры
 Описание
 a
 Левый операнд. Представляет вектор масштабирования. Тип Scale2d.
 factor
 Правый операнд. Представляет скалярный множитель. Тип double.
 Возвращает
 Возвращает результат умножения вектора масштабирования a на скалярный множитель factor. Тип Scale2d.
 Описание
 Оператор умножения структуры Scale2d. Реализует умножение вектора масштабирования a на скалярный множитель factor.
 Ссылки
 Teigha.Geometry.Scale2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!