Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObject.UpgradeOpen()
 Послать отзыв
 Метод обновляет этот объект из режима "для чтения" в режим "для записи".
 Синтаксис
C#
Visual Basic
Копировать Код
public void UpgradeOpen();
Копировать Код
Public Sub UpgradeOpen()
 Описание
 Если объект в текущее время открыт в режиме OpenMode.ForRead для единственного контекста, читающего объект, то эта функция обновляет режим открытия до уровня доступа OpenMode.ForWrite. В процессе изменения режима открытия как открытия на запись, объект закрывается, что вызывает соответствующие уведомления. Note Вызов этого метода не должен быть согласован с вызовом DowngradeOpen(), поскольку вызова Close() или Cancel() достаточно для очистки статуса открытия геометрического объекта.
 Ссылки
 Teigha.DatabaseServices.DBObject, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!