Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.UnderlayItemCollection.Item
 Послать отзыв
 Свойство Item представляет элемент коллекции с указанным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public UnderlayItem this[int index];
Копировать Код
Default Public ReadOnly Property Item( index As Integer ) As UnderlayItem
 Параметры
 Параметры
 Описание
 index
 Входной индекс искомого элемента коллекции. Тип int.
 Возвращает
 Возвращает элемент коллекции под указанным индексом. Тип UnderlayItem.
 Описание
 Свойство Item представляет элемент коллекции с указанным индексом index.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.UnderlayItemCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!