Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Point2d.GetAsVector
 Послать отзыв
 Метод преобразует данную точку в 2D-вектор с тем же набором координат и возвращает экземпляр Vector2d.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector2d GetAsVector();
Копировать Код
Public Function GetAsVector() As Vector2d
 Возвращает
 Возвращает вектор с теми же координатами, что и у данной 2D-точки. Тип Vector2d.
 Описание
 Метод преобразует данную точку в 2D-вектор с тем же набором координат и возвращает экземпляр Vector2d.
 Ссылки
 Teigha.Geometry.Point2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!