Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.RowsCollection.Count
 Послать отзыв
 Свойство Count представляет текущее количество элементов в этой коллекции.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual int Count;
Копировать Код
Public Overridable ReadOnly Property Count As Integer
 Возвращает
 Возвращает количество элементов в коллекции. Тип int.
 Описание
 Свойство Count представляет текущее количество элементов в этой коллекции.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.RowsCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!