Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Torus.IsDegenerate
 Послать отзыв
 Свойство IsDegenerate позволяет проверить, не является ли данный объект вырожденным.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsDegenerate;
Копировать Код
Public ReadOnly Property IsDegenerate As Boolean
 Возвращает
 Возвращает true, если данный объект является вырожденным. В противном случае возвращает false.
 Описание
 Свойство IsDegenerate позволяет проверить, не является ли данный объект вырожденным.
 Замечания
 Тор становится вырожденным, если малый радиус меньше или равен нулю, или если большой радиус меньше или равен отрицательному значению малого радиуса.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.Torus, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!