Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.PlanarEquationCoefficients.D
 Послать отзыв
 Свойство D представляет коэффициент d в общем уравнении плоскости.
 Синтаксис
C#
Visual Basic
Копировать Код
public double D;
Копировать Код
Public ReadOnly Property D As Double
 Возвращает
 Возвращает коэффициент d в общем уравнении плоскости. Тип double.
 Описание
 Свойство D представляет коэффициент d в общем уравнении плоскости.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.PlanarEquationCoefficients, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!