Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор Database.Database
 Послать отзыв
 Синтаксис
C#
Visual Basic
public Database(bool buildDefaultDrawing, bool noDocument);
Public Sub New(buildDefaultDrawing As bool, noDocument As bool)
 Параметры
 Параметры
 Описание
 buildDefaultDrawing
 Параметр указывает, должен или нет быть построен пустой объект
 noDocument
 Параметр указывает, должна или нет данная база данных быть ассоциирована с текущим документом
 Описание
 Конструктор с дополнительными параметрами.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!