Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Arc.Arc(Point3d,double,double,double)
 Послать отзыв
 Конструктор с параметрами.
 Синтаксис
C#
Visual Basic
public Arc(Point3d center, double radius, double startAngle, double endAngle);
Public Sub New(center As Point3d, radius As Double, startAngle As Double, endAngle As Double)
 Параметры
 Параметры
 Описание
 center
 Центральная точка дуги
 radius
 Радиус дуги
 startAngle
 Начальный угол дуги
 endAngle
 Конечный угол дуги
 Описание
 Этот конструктор создает дугу, используя передаваемые в него значения. Значение параметра center должно быть в WCS координатах. Дуга инициализируется с вектором нормали, равным (0,0,1) и толщиной, равной 0.0.
 Ссылки
 Teigha.DatabaseServices.Arc, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!