Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.EllipticalCylinder.EllipticalCylinder
 Послать отзыв
 Конструктор по умолчанию класса EllipticalCylinder.
 Синтаксис
C#
Visual Basic
Копировать Код
public EllipticalCylinder.EllipticalCylinder();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса EllipticalCylinder.
 Замечания
 Создает экземпляр эллиптического цилиндра по умолчанию, с началом координат в точке (0,0,0) мировой системы координат (МСК), осью симметрии, ориентированной в направлении (0,1,0) МСК, направлением большой оси (1,0,0), большим и малым радиусами величиной 2.0.
 Ссылки
 Teigha.Geometry.EllipticalCylinder, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!