Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Position3d.Position3d
 Послать отзыв
 Конструктор класса Position3d. Создает экземпляр класса с указанными параметрами. Создает объект позиции в точке c указанными координатами (x,y,z).
 Синтаксис
C#
Visual Basic
Копировать Код
public Position3d( double x, double y, double z );
Копировать Код
Public Sub New( x As Double, y As Double, z As Double )
 Параметры
 Параметры
 Описание
 x
 Координата позиции по оси X. Тип double.
 y
 Координата позиции по оси Y. Тип double
 z
 Координата позиции по оси Z. Тип double.
 Описание
 Конструктор класса Position3d. Создает экземпляр класса с указанными параметрами. Создает объект позиции в точке c указанными координатами (x,y,z).
 Ссылки
 Teigha.Geometry.Position3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!