Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Vertex2d.Bulge
 Послать отзыв
 Свойство Bulge представляет безразмерную величину прогиба сегмента полилинии, берущего начало в данной вершине.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Bulge;
Копировать Код
Public Property Bulge As Double
 Возвращает
 Возвращает безразмерный прогиб сегмента полилинии. Тип double.
 Описание
 Свойство Bulge представляет безразмерную величину прогиба сегмента полилинии, берущего начало в данной вершине.
 Численно значение прогиба определяется отношением высоты сегмента круглой дуги к половине длины хорды, стягивающей эту дугу, и равно тангенсу 1/4 угла этой дуги. Так, если дуга представляет собой половину окружности, то прогиб равен 1, соответственно, значение 0 соответствует прямолинейному сегменту.
 Знак прогиба определяется положением дуги относительно хорды. Если дуга располагается правее хорды (движение к следующей вершине по дуге против часовой стрелки), значение прогиба положительно, если левее хорды (движение по дуге по часовой стрелке) - отрицательно.
 Замечания
 Для значений прогиба используется групповой код DXF 42.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Vertex2d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!