Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DataTable.AppendColumn
 Послать отзыв
 Метод добавляет в таблицу данных DataTable новый столбец.
 Синтаксис
C#
Visual Basic
Копировать Код
public void AppendColumn( CellType type, ref String columnName );
Копировать Код
Public Sub AppendColumn( type As CellType, ByRef columnName As String )
 Параметры
 Параметры
 Описание
 type
 Тип добавляемого столбца. Тип CellType.
 columnName
 Имя добавляемого столбца. Тип String.
 Описание
 Метод добавляет в данную таблицу данных DataTable новый столбец с указанными именем и типом.
 Если в таблице уже имеются строки, то в создаваемом столбце для каждой такой строки формируются ячейки данных со значениями по умолчанию.
 Ссылки
 Teigha.DatabaseServices.DataTable, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!