Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Polyline3d.PolyType
 Послать отзыв
 Свойство предоставляет доступ к типу аппроксимации для данной 3D полилинии в виде элемента перечисления Poly3dType.
 Синтаксис
C#
Visual Basic
Копировать Код
public Poly3dType PolyType;
Копировать Код
Public Property PolyType() As Poly3dType
 Возвращает
 Возвращает значение из перечисления Poly3dType.
 Описание
 Свойство предоставляет доступ к типу аппроксимации для данной 3D полилинии в виде элемента перечисления Poly3dType.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Polyline3d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!