Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Cell.RemoveDataLink
 Послать отзыв
 Метод предназначен для удаления ссылки на данные из этой ячейки.
 Синтаксис
C#
Visual Basic
Копировать Код
public void RemoveDataLink();
Копировать Код
Public Sub RemoveDataLink()
 Описание
 Метод позволяет удалить ссылку на данные из этой ячейки.
 Ссылки
 Teigha.DatabaseServices.Cell, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!