Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SubentityId.Null
 Послать отзыв
 Свойство Null представляет нулевой ID подобъекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public static SubentityId Null;
Копировать Код
Public Shared ReadOnly Property Null As SubentityId
 Возвращает
 Возвращает нулевой идентификатор подобъекта. Тип SubentityId.
 Описание
 Свойство Null представляет нулевой идентификатор подобъекта.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.SubentityId, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!