Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DimAssoc.RemoveAssociativity
 Послать отзыв
 Метод позволяет удалить все связи между размером, объектом DimAssoc и всеми опорными точками, включая опцию сделать это принудительно.
 Синтаксис
C#
Visual Basic
Копировать Код
public void RemoveAssociativity( bool force );
Копировать Код
Public Sub RemoveAssociativity( force As Boolean )
 Параметры
 Параметры
 Описание
 force
 Входной флаг, определяющий, следует ли принудительно удалять ассоциативность. Тип bool.
 Описание
 Метод позволяет удалить все связи между размером, объектом DimAssoc и всеми опорными точками, включая опцию сделать это принудительно.
 Ссылки
 Teigha.DatabaseServices.DimAssoc, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!