Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Material.Ambient
 Послать отзыв
 Свойство представляет теневой компонент рассеянного цвета данного материала.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual MaterialColor Ambient;
Копировать Код
Public Overridable Property Ambient As MaterialColor
 Возвращает
 Возвращает компонент рассеянного цвета. Тип MaterialColor.
 Описание
 Свойство представляет теневой компонент рассеянного цвета данного материала.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Material, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!