Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод LinetypeTableRecord.SetShapeScaleAt
 Послать отзыв
 Синтаксис
C#
Visual Basic
public void SetShapeScaleAt(int index, double scale);
Public Sub SetShapeScaleAt(index As Integer, scale As Double)
 Параметры
 Параметры
 Описание
 index
 Индекс (начинающийся с 0) строки, содержащей форму (текстовую строку), для которой производится установка масштаба
 scale
 Коэффициент масштаба, который должен быть приложен к форме
 Описание
 Этот метод устанавливает для строки LinetypeTableRecord со значением индекса index используемый масштаб в соответствии со значением параметра scale. Если в строке нет формы, то масштаб должен быть 1.0.
 Значение index должно быть больше или равно 0, но меньше чем значение, возвращаемое LinetypeTableRecord.NumDashes. index представляет собой индекс, начинающийся с нуля (формы и текстовые строки имеют тот же самый индекс, как и штриховка, предшествующая им в определении типа линии) с первым элементом типа линии, соответствующим индексу, равному 0.
 Для получения дополнительной информации об определении типа линии и длины штриховки, смотри раздел "Типы линий" в Инструкции пользователя по nanoCAD.
 Ссылки
 Teigha.DatabaseServices.LinetypeTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!