Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeader.SetArrowSize
 Послать отзыв
 Метод позволяет задать размер стрелки для линии выноски с указанным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetArrowSize( int leaderLineIndex, double arrowSize );
Копировать Код
Public Sub SetArrowSize( leaderLineIndex As Integer, arrowSize As Double )
 Параметры
 Параметры
 Описание
 leaderLineIndex
 Индекс линии выноски. Тип int.
 arrowSize
 Размер стрелки. Тип double.
 Описание
 Метод позволяет задать размер стрелки для линии выноски с указанным индексом.
 Ссылки
 Teigha.DatabaseServices.MLeader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!