Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObject.IsModifiedXData
 Послать отзыв
 Свойство предоставляет информаицю, были ли изменены XData объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsModifiedXData;
Копировать Код
Public Property IsModifiedXData() As bool
 Возвращает
 Возвращает тип данных bool. Возвращает true, если данные были изменены.
 Описание
 Свойство предоставляет информацию, были ли изменены XData объекта.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.DBObject, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!