Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Thickness
 Послать отзыв
 Синтаксис
C#
Visual Basic
public double Thickness;
Public Property Thickness() As Double
 Описание
 Обеспечивает доступ к текущему значению THICKNESS для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!