Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DataTable.GetRowAt
 Послать отзыв
 Метод позволяет получить строку с заданным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public DataCellCollection GetRowAt( int index );
Копировать Код
Public Function GetRowAt( index As Integer ) As DataCellCollection
 Параметры
 Параметры
 Описание
 index
 Индекс искомой строки. Тип int
 Возвращает
 Возвращает строку. Тип DataCellCollection. Если индекс оказался недействительным, метод выбрасывает исключение Teigha.Runtime.ErrorStatus.eInvalidInput.
 Описание
 Метод позволяет получить строку с заданным индексом.
 Ссылки
 Teigha.DatabaseServices.DataTable, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!