Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Ellipse.Normal
 Послать отзыв
 Свойство Normal возвращает вектор нормали плоскости, которой принадлежит данный эллипс или эллиптическая дуга.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d Normal;
Копировать Код
Public ReadOnly Property Normal As Vector3d
 Возвращает
 Возвращает вектор нормали плоскости. Тип Vector3d.
 Описание
 Свойство Normal возвращает вектор нормали плоскости, которой принадлежит данный эллипс или эллиптическая дуга.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Ellipse, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!