Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Userr4
 Послать отзыв
 Синтаксис
C#
Visual Basic
public double Userr4;
Public Property Userr4() As Double
 Описание
 Обеспечивает доступ к текущему значению USERR4 для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!