Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SubDMesh.NumberOfSubDividedFaces
 Послать отзыв
 Свойство предоставляет доступ к количеству граней с текущей степенью сглаженности.
 Синтаксис
C#
Visual Basic
Копировать Код
public int NumberOfSubDividedFaces;
Копировать Код
Public Property NumberOfSubDividedFaces() As Integer
 Возвращает
 Возвращает количество граней, int.
 Описание
 Свойство предоставляет доступ к количеству граней с текущей степенью сглаженности.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.SubDMesh, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!