Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObjectReference.ObjectId
 Послать отзыв
 Свойство ObjectId представляет идентификатор объектной ссылки.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.ObjectId ObjectId;
Копировать Код
Public ReadOnly Property ObjectId As DatabaseServices.ObjectId
 Возвращает
 Возвращает идентификатор объектной ссылки. Тип DatabaseServices.ObjectId.
 Описание
 Свойство ObjectId представляет идентификатор ObjectId объектной ссылки.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.DBObjectReference, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!