Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DxfFiler.Elevation
 Послать отзыв
 Свойство обеспечивает доступ к высоте расположения (возвышению) объекта. Не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual double Elevation;
Копировать Код
Public Overridable ReadOnly Property Elevation As Double
 Возвращает
 Возвращает высоту (возвышение) расположения объекта. Тип double.
 Описание
 Свойство обеспечивает доступ к высоте расположения (возвышению) объекта. Не реализовано.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.DxfFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!