Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.BlockInsertionPointsEventArgs
 Послать отзыв
 Класс представляет данные для события BlockInsertionPoints в записи таблицы блоков.
 Иерархия классов
Teigha::DatabaseServices::BlockInsertionPointsEventArgs
 Синтаксис
C#
Visual Basic
Копировать Код
public class BlockInsertionPointsEventArgs;
Копировать Код
Public Class BlockInsertionPointsEventArgs
 Описание
 Класс представляет данные для события BlockInsertionPoints в записи таблицы блоков.
 Методы
 Конструкторы
 Имя
 Описание
 BlockInsertionPointsEventArgs
 Конструктор класса BlockInsertionPointsEventArgs.
 Топики
 Имя
 Описание
 BlockInsertionPointsEventArgs Свойства
 Ниже перечислены свойства класса BlockInsertionPointsEventArgs.
 Ссылки
 BlockInsertionPointsEventArgs Свойства, Методы, Топики, BlockInsertionPointsEventArgs Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!