Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.XrefVetoableSubCommandEventArgs
 Послать отзыв
 Класс XrefVetoableSubCommandEventArgs представляет данные для команды XrefVetoableSubCommand базы данных.
 Иерархия классов
Teigha::DatabaseServices::XrefSubCommandEventArgs Teigha::DatabaseServices::XrefVetoableSubCommandEventArgs
 Синтаксис
C#
Visual Basic
Копировать Код
public sealed class XrefVetoableSubCommandEventArgs : XrefSubCommandEventArgs
Копировать Код
Public NotInheritable Class XrefVetoableSubCommandEventArgs Inherits XrefSubCommandEventArgs
 Описание
 Класс XrefVetoableSubCommandEventArgs представляет данные для команды XrefVetoableSubCommand базы данных.
 Топики
 Имя
 Описание
 XrefSubCommandEventArgs Свойства
 Ниже перечислены свойства класса XrefSubCommandEventArgs.
 Teigha.DatabaseServices.XrefVetoableSubCommandEventArgs
 Имя
 Описание
 XrefVetoableSubCommandEventArgs Свойства
 Ниже перечислены свойства класса XrefVetoableSubCommandEventArgs.
 Ссылки
 XrefVetoableSubCommandEventArgs Свойства, Топики, XrefSubCommandEventArgs Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!