Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.LineSegment3d.Set
 Послать отзыв
 Метод переопределяет данный объект таким образом, чтобы линейный сегмент оказался касательным к указанной кривой и проходил через заданную точку.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Set( ref Curve3d curve, Point3d point, double parameter );
Копировать Код
Public Sub Set( ByRef curve As Curve3d, point As Point3d, parameter As Double )
 Параметры
 Параметры
 Описание
 curve
 Входная кривая, касательность к которой требуется обеспечить. Тип Curve3d.
 point
 Входная точка, через которую должен проходить линейный сегмент. Тип Point3d.
 parameter
 Входное значение параметра точки на кривой curve, в которой кривая касается линейного сегмента. Тип double.
 Описание
 Метод позволяет переопределить данный объект таким образом, чтобы линейный сегмент оказался касательным к кривой curve и проходил через точку point. Входное значение параметра parameter для кривой curve используется в качестве первоначального приближения при вычислении точки касания.
 Ссылки
 Teigha.Geometry.LineSegment3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!