Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeader.BlockColor
 Послать отзыв
 Свойство представляет цвет, используемый для отрисовки содержимого блока.
 Синтаксис
C#
Visual Basic
Копировать Код
public Teigha.Colors.Color BlockColor;
Копировать Код
Public Property BlockColor As Teigha.Colors.Color
 Возвращает
 Возвращает цвет содержимого блока. Тип Teigha.Colors.Color.
 Описание
 Свойство представляет цвет, используемый для отрисовки содержимого блока.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MLeader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!