Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.PlineEllipse
 Послать отзыв
 Синтаксис
C#
Visual Basic
public bool PlineEllipse;
Public Property PlineEllipse() As bool
 Описание
 Возвращает или устанавливает текущее значение PELLIPSE для базы данных. Значение false соответствует 0. Значение true — 1.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!