Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotStyle.Name
 Послать отзыв
 Свойство Description представляет имя стиля печати.
 Синтаксис
C#
Visual Basic
Копировать Код
public String Name;
Копировать Код
Public Property Name As String
 Возвращает
 Возвращает имя стиля печати. Тип String.
 Описание
 Свойство Description предоставляет доступ к имени данного стиля печати.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.PlotStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!