Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SubDMesh.NumberOfFaces
 Послать отзыв
 Свойство представляеn доступ к количеству граней на базовом уровне сети.
 Синтаксис
C#
Visual Basic
Копировать Код
public int NumberOfFaces;
Копировать Код
Public Property NumberOfFaces() As Integer
 Возвращает
 Возвращает количество граней на базовом уровне сети, int.
 Описание
 Свойство представляеn доступ к количеству граней на базовом уровне сети.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.SubDMesh, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!