Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Torus.SetAnglesInU
 Послать отзыв
 Метод позволяет переопределить начальный и конечный углы вращения относительно оси симметрии.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetAnglesInU( double startAngle, double endAngle );
Копировать Код
Public Sub SetAnglesInU( startAngle As Double, endAngle As Double )
 Параметры
 Параметры
 Описание
 startAngle
 Начальная долгота U. Тип double.
 endAngle
 Конечная долгота U. Тип double.
 Описание
 Метод позволяет переопределить начальный и конечный углы вращения относительно оси симметрии.
 Замечания
 Для вариантов формы тора "Vortex", "Apple" и "Lemon" углы задаются как результат пересечения естественного интервала с переданным в метод.
 Ссылки
 Teigha.Geometry.Torus, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!