Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CubicSplineCurve2d.CubicSplineCurve2d
 Послать отзыв
 Конструктор класса CubicSplineCurve2d. Создает интерполяционный кубический сплайн, проходящий через заданные определяющие точки, с указанными векторами первых производных в начале и в конце сплайна.
 Синтаксис
C#
Visual Basic
Копировать Код
public CubicSplineCurve2d( ref Point2dCollection fitPoints, Vector2d startDerivative, Vector2d endDerivative );
Копировать Код
Public Sub New( ByRef fitPoints As Point2dCollection, startDerivative As Vector2d, endDerivative As Vector2d )
 Параметры
 Параметры
 Описание
 fitPoints
 Входной массив определяющих точек сплайна. Тип Point2dCollection.
 startDerivative
 Первая производная в начальной точке. Тип Vector2d.
 endDerivative
 Первая производная в конечной точке. Тип Vector2d.
 Описание
 Конструктор класса CubicSplineCurve2d. Создает интерполяционный кубический сплайн, проходящий через заданные определяющие точки, с указанными векторами первых производных в начале и в конце сплайна. Используется вызов метода CubicSplineCurve2d(ref Point2dCollection fitPoints, Vector2d startDerivative, Vector2d endDerivative, Tolerance tolerance) с точностью интерполяции Tolerance.Global.
 Ссылки
 Teigha.Geometry.CubicSplineCurve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!