Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.OriginalFileMaintenanceVersion
 Послать отзыв
 Синтаксис
C#
Visual Basic
public DatabaseServices::MaintenanceReleaseVersion OriginalFileMaintenanceVersion;
Public Property OriginalFileMaintenanceVersion() As DatabaseServices.MaintenanceReleaseVersion
 Описание
 Возвращает минорную (maintenance) версию, которая была при открытии файла чертежа.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!