Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Scale2d.Scale2d
 Послать отзыв
 Конструктор структуры Scale2d. Создает экземпляр структуры, который представляет равномерное преобразование масштаба вдоль осей X и Y с указанным коэффициентом.
 Синтаксис
C#
Visual Basic
Копировать Код
public Scale2d( double factor );
Копировать Код
Public Sub New( factor As Double )
 Параметры
 Параметры
 Описание
 factor
 Масштабный множитель, одинаковый для осей X и Y. Тип double.
 Описание
 Конструктор структуры Scale2d. Создает экземпляр структуры, который представляет равномерное преобразование масштаба вдоль осей X и Y с масштабным коэффициентом factor.
 Ссылки
 Teigha.Geometry.Scale2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!