Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LinkedTableData.SetValue
 Послать отзыв
 Метод позволяет задать значение первому элементу содержимого заданной ячейки таблицы.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetValue( int row, int column, ref Object value );
Копировать Код
Public Overridable Sub SetValue( row As Integer, column As Integer, ByRef value As Object )
 Параметры
 Параметры
 Описание
 row
 Индекс строки. Тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 column
 Индекс столбца. Тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице.
 value
 Задаваемое значение. Тип Object.
 Описание
 Метод позволяет задать значение первому элементу содержимого заданной ячейки таблицы.
 Замечания
 Метод выбрасывает исключение eInvalidInput, если индексы строки и/или столбца выходят за допустимые пределы. Если содержимое ячейки недоступно для редактирования, метод выбрасывает исключение eIsWriteProtected.
 Ссылки
 Teigha.DatabaseServices.LinkedTableData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!