Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Sun.Altitude
 Послать отзыв
 Свойство Altitude представляет высоту солнца над горизонтом.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Altitude;
Копировать Код
Public Property Altitude As Double
 Возвращает
 Возвращает высоту солнца в радианах. Тип double.
 Описание
 Свойство Altitude представляет высоту солнца. Это угол между горизонтом и направлением на солнце, измеряемый от горизонта. Высота солнца находится в диапазоне от 0 (горизонт) до Pi/2 радиан (зенит).
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Sun, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!