Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Hatch.GradientShift
 Послать отзыв
 Синтаксис
C#
Visual Basic
public float GradientShift;
Public Property GradientShift() As float
 Описание
 Возвращает текущее интерполированное значение между значением определения градиента по умолчанию и измененным значением.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Hatch, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!