Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.GetMargin
 Послать отзыв
 Метод предназначен для получения полей (расстояний между границами и содержимым) для ячеек, строк или столбцов.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual double GetMargin( int row, int column, CellMargins margin );
Копировать Код
Public virtual Function GetMargin( row As Integer, column As Integer, margin As CellMargins ) As double
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс может равняться -1.
 margin
 Тип поля (Top, Left, Bottom, Right) из перечисления Teigha.DatabaseServices.CellMargins.
 col
 Индекс столбца, тип int. Индекс может равняться -1.
 Возвращает
 Возвращает величину поля, тип double.
 Описание
 Метод предназначен для получения полей (расстояний между границами и содержимым) для ячеек, строк или столбцов.
 Чтобы указать ячейку, следует задать допустимые индексы строки и столбца. Чтобы указать строку, следует задать допустимый индекс строки и -1 в качестве индекса столбца. Чтобы указать столбец, следует задать допустимый индекс столбца и -1 в качестве индекса строки.
 Замечания
 Для получения того же результата предпочтительнее использовать свойство Table.Cells[row,column].{Top,Bottom,Left,Right}Edge.Margin
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!