Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 ViewTableRecord.CategoryName
 Послать отзыв
 В свойстве хранится название категории именованного вида.
 Синтаксис
C#
Visual Basic
public String CategoryName;
Public Property CategoryName() As String
 Возвращает
 Возвращает тип данных string.
 Описание
 Свойство предназначено для просмотра/изменения категории именованного вида. По умолчанию, в свойстве хранится пустая строка. Название категории именованного вида – дополнительный инструмент для фильтрации именованных видов.
 Условия
 Чтение и запись.
 Ссылки
 ViewTableRecord Класс, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!