Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DwgFiler.Position
 Послать отзыв
 Свойство предоставляет доступ к текущей позиции указателя ввода-вывода этого объекта Filer.
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract long Position;
Копировать Код
Public MustOverride ReadOnly Property Position As Long
 Возвращает
 Возвращает текущую позицию указателя ввода-вывода данного файлера. Тип long.
 Описание
 Свойство предоставляет доступ к текущей позиции указателя ввода-вывода этого объекта Filer.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.DwgFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!