Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Элемент данных FieldEvaluationStatusResult.errorCode
 Послать отзыв
 This is errorCode, a member of class FieldEvaluationStatusResult.
 Синтаксис
C#
Visual Basic
private int errorCode;
Private errorCode As Integer
 Ссылки
 Teigha.DatabaseServices.FieldEvaluationStatusResult, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!