Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Entity.MoveStretchPointsAt(IntegerCollection
 Послать отзыв
 Метод применяет заданное смещение к выбранным точкам растяжения геометрического объекта, определяемым индексами из массива indices. Он вызывается при выполнении команды растяжения в nanoCAD или может быть использован в приложениях для программного изменения формы объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public void MoveStretchPointsAt(IntegerCollection indices, Vector3d offset);
Копировать Код
Public Sub MoveStretchPointsAt(indices As IntegerCollection, offset As Vector3d)
 Параметры
 Параметры
 Описание
 indices
 Коллекция целочисленных индексов, указывающих, какие именно точки растяжения должны быть изменены. Индексы соответствуют порядку, в котором точки были добавлены методом GetStretchPoints(). Тип IntegerCollection
 offset
 Вектор смещения в мировых координатах (WCS), определяющий направление и расстояние перемещения выбранных точек. Тип Vector3d
 Описание
 Метод предназначен для изменения геометрии объекта путём перемещения его точек растяжения (stretch points) на заданный вектор offset. Обычно он вызывается платформой nanoCAD при выполнении пользователем операции растяжения объекта. Однако, он также доступен для использования в сторонних приложениях через API nanoCAD.
 Перед вызовом этого метода необходимо вызвать метод GetStretchPoints(), чтобы получить список всех доступных точек растяжения и их порядок. Индексы из массива indices соответствуют позициям этих точек в массиве, возвращённом методом GetStretchPoints(). Например, индекс 0 указывает на первую добавленную точку, 1 — на вторую и т. д.
 Вектор offset задаёт направление и величину перемещения выбранных точек в мировой системе координат (WCS). Как изменяются остальные части объекта — зависит от его типа. Метод должен обеспечить корректное обновление всей геометрии объекта, учитывая перемещение указанных точек.
 При переопределении метода в производных классах важно согласовать его работу с реализацией метода GetStretchPoints(), так как поведение зависит от того, какие именно точки и в каком порядке они возвращаются этим методом.
 Реализация по умолчанию: По умолчанию метод вызывает Entity.TransformBy() с матрицей преобразования, которая перемещает весь объект целиком на заданный вектор offset. Результат работы метода совпадает с результатом вызова TransformBy().
 Ссылки
 Teigha.DatabaseServices.Entity, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!