Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbCurve2d.SetFitData
 Послать отзыв
 Метод задает новые определяющие данные в этом объекте и перевычисляет сплайн.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetFitData( ref Point2dCollection fitPoints, Vector2d startTangent, Vector2d endTangent, KnotParameterizationEnum knotParam, Tolerance fitTolerance );
Копировать Код
Public Sub SetFitData( ByRef fitPoints As Point2dCollection, startTangent As Vector2d, endTangent As Vector2d, knotParam As KnotParameterizationEnum, fitTolerance As Tolerance )
 Параметры
 Параметры
 Описание
 fitPoints
 Массив определяющих точек. Тип Point2dCollection. Точек должно быть не менее двух.
 startTangent
 Вектор касательной в начальной точке. Тип Vector2d.
 endTangent
 Вектор касательной в конечной точке. Тип Vector2d.
 knotParam
 Метод узловой параметризации сплайна. Тип KnotParameterizationEnum.
 fitTolerance
 Требуемая точность интерполяции. Тип Tolerance.
 Описание
 Метод заменяет все существующие данные сплайна (определяющие данные или данные NURBS) новыми определяющими точками, векторами касательных на концах, включая метод узловой параметризации и точность интерполяции.
 Если аргумент fitTolerance не равен 0, то построенный сплайн может не проходить точно через определяющие точки, но максимальное отклонение построенного сплайна от любой определяющей точки не будет превышать fitTolerance.
 Ссылки
 Teigha.Geometry.NurbCurve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!