Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeader.TextLocation
 Послать отзыв
 Свойство представляет точку привязки многострочного текста данного объекта MLeader.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d TextLocation;
Копировать Код
Public Property TextLocation As Point3d
 Возвращает
 Возвращает точку привязки многострочного текста. Тип Point3d.
 Описание
 Свойство представляет точку привязки многострочного текста данного объекта MLeader.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MLeader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!