Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.PointOnSurface
 Послать отзыв
 Класс PointOnSurface представляет точку на трехмерной поверхности.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Geometry::Entity3d Teigha::Geometry::PointEntity3d Teigha::Geometry::PointOnSurface
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdGePointOnSurface")] public sealed class PointOnSurface : PointEntity3d
Копировать Код
<Wrapper("OdGePointOnSurface")> Public NotInheritable Class PointOnSurface Inherits PointEntity3d
 Описание
 Класс PointOnSurface представляет точку на трехмерной поверхности. Этот класс инкапсулирует всю геометрическую информацию о точке на поверхности, включая параметрические координаты точки и ее координаты в 3D-пространстве моделирования, производные и вектор нормали поверхности в этой точке.
 Методы
 Конструкторы
 Teigha.Geometry.PointOnSurface
 Имя
 Описание
 PointOnSurface
 Это обзор перегрузок PointOnSurface.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Geometry.Entity3d
 Имя
 Описание
 Entity3d Методы
 Ниже перечислены методы класса Entity3d.
 Teigha.Geometry.PointEntity3d
 Имя
 Описание
 PointEntity3d Методы
 Ниже перечислены методы класса PointEntity3d.
 Teigha.Geometry.PointOnSurface
 Имя
 Описание
 PointOnSurface Методы
 Ниже перечислены методы класса PointOnSurface.
 PointOnSurface Свойства
 Ниже перечислены свойства класса PointOnSurface.
 Ссылки
 PointOnSurface Конструктор, PointOnSurface Методы, PointOnSurface Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!