Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FieldResult
 Послать отзыв
 Класс FieldResult представляет статус и результата вычисления поля.
 Иерархия классов
Teigha::DatabaseServices::FieldResult
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdFdFieldResult")] public abstract class FieldResult : RXObject
Копировать Код
<Wrapper("OdFdFieldResult")> Public MustInherit Class FieldResult Inherits RXObject
 Описание
 Класс FieldResult используется вычислителями для задания статуса и результата вычисления поля.
 Топики
 Имя
 Описание
 FieldResult Методы
 Ниже перечислены методы класса FieldResult.
 Ссылки
 FieldResult Методы, Топики, FieldResult Методы
 Ваши комментарии по поводу этого топика: Послать отзыв!