Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.ExternalSurface.ExternalSurfaceDefiniton
 Послать отзыв
 Свойство ExternalSurfaceDefiniton представляет определение внешней поверхности, связанной с данным объектом.
 Синтаксис
C#
Visual Basic
Копировать Код
public IntPtr ExternalSurfaceDefiniton;
Копировать Код
Public ReadOnly Property ExternalSurfaceDefiniton As IntPtr
 Возвращает
 Возвращает определение внешней поверхности, связанной с данным объектом. Тип IntPtr.
 Описание
 Свойство ExternalSurfaceDefiniton представляет определение внешней поверхности, связанной с данным объектом.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.ExternalSurface, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!