Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ImageDisplayOptions
 Послать отзыв
 Перечисление ImageDisplayOptions определяет опции отображения растровых изображений.
 Синтаксис
C#
Visual Basic
Копировать Код
[Flags] [Wrapper("OdDbRasterImage.ImageDisplayOpt")] public enum ImageDisplayOptions { Show = 1, ShowUnaligned = 2, Clip = 4, Transparent = 8 }
Копировать Код
<Flags> <Wrapper("OdDbRasterImage.ImageDisplayOpt")> Public Enum ImageDisplayOptions Show = 1 ShowUnaligned = 2 Clip = 4 Transparent = 8 End Enum
 Члены
 Члены
 Описание
 Show
 Значение: 1. Показывать изображение.
 ShowUnaligned
 Значение: 2. Показывать повёрнутые изображения.
 Clip
 Значение: 4. Показывать обрезанные изображения.
 Transparent
 Значение: 8. Использовать прозрачный фон для двухтоновых изображений.
 Описание
 Перечисление ImageDisplayOptions определяет опции отображения растровых изображений.
 Ваши комментарии по поводу этого топика: Послать отзыв!