Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.RotatedDimension.DimLinePoint
 Послать отзыв
 Свойство предоставляет доступ к точке определения (в мировой системе координат WCS), которая указывает, где будет находиться размерная линия (т.е. эта точка будет располагаться где-то на размерной линии).
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d DimLinePoint;
Копировать Код
Public Property DimLinePoint() As Point3d
 Возвращает
 Возвращает точку Point3d, которая располагается где-то на размерной линии. Система координат - мировая (WCS).
 Описание
 Свойство предоставляет доступ к точке определения (в мировой системе координат WCS), которая указывает, где будет находиться размерная линия (т.е. эта точка будет располагаться где-то на размерной линии).
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.RotatedDimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!