Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.Elevation
 Послать отзыв
 Свойство задает или возвращает высоту данного размера.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Elevation;
Копировать Код
Public Property Elevation As Double
 Возвращает
 Возвращает высоту данного размера. Тип double.
 Описание
 Свойство задает или возвращает высоту данного размера. Высота определяется как расстояние от начала координат WCS до плоскости, на которой располагается размер.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!