Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DynamicDimensionData.ApplicationData
 Послать отзыв
 Свойство ApplicationData обеспечивает доступ к данным приложения, связанным с этим объектом.
 Синтаксис
C#
Visual Basic
Копировать Код
public object ApplicationData;
Копировать Код
Public Property ApplicationData As Object
 Возвращает
 Возвращает данные приложения, связанные с динамическим размером. Тип Object.
 Описание
 Свойство ApplicationData обеспечивает доступ к данным приложения, связанным с этим объектом.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.DynamicDimensionData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!