Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Filters.IndexUpdateData.SetIdData
 Послать отзыв
 Метод задаёт в этом объекте IndexUpdateData указатель IntPtr на данные, связанные с переданным идентификатором объекта ObjectId.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetIdData( ObjectId id, IntPtr data );
Копировать Код
Public Sub SetIdData( id As ObjectId, data As IntPtr )
 Параметры
 Параметры
 Описание
 id
 Входной идентификатор объекта. Тип ObjectId.
 data
 Указатель на данные, связанные с id. Тип IntPtr.
 Описание
 Метод задаёт в этом объекте IndexUpdateData указатель IntPtr на данные, связанные с переданным идентификатором объекта ObjectId.
 Ссылки
 Teigha.DatabaseServices.Filters.IndexUpdateData, Teigha.DatabaseServices.Filters
 Ваши комментарии по поводу этого топика: Послать отзыв!