Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.SetTextHeight
 Послать отзыв
 Метод задает высоту текста в строках указанного типа.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetTextHeight( double height, int rowTypes );
Копировать Код
Public virtual Sub SetTextHeight( height As double, rowTypes As Integer )
 Параметры
 Параметры
 Описание
 height
 Высота текста, тип double.
 rowTypes
 Тип строки объекта Table, int. См. перечисление RowType. Метод принимает следующие типы строк: DataRow, TitleRow и HeaderRow.
 Описание
 Метод задает высоту текста в строках указанного типа.
 Различные типы строк можно комбинировать с помощью оператора OR. Если тип строки не указан, действие метода распространяется на все возможные типы строк.
 Замечания
 Для получения того же результата предпочтительнее использовать функционал объекта Cell.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!