Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Делегат Teigha.DatabaseServices.XrefSubCommandEndEventHandler
 Послать отзыв
 This is type Teigha::DatabaseServices::XrefSubCommandEndEventHandler.
 Синтаксис
C#
Visual Basic
public delegate XrefSubCommandEndEventHandler();
Public Delegate Sub XrefSubCommandEndEventHandler()
 Ваши комментарии по поводу этого топика: Послать отзыв!