Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Body.AcisIn
 Послать отзыв
 Метод позволяет считать из указанного файла данные ACIS для данного объекта и возвращает коллекцию полученных тел ACIS.
 Синтаксис
C#
Visual Basic
Копировать Код
public DBObjectCollection AcisIn( ref String fileName );
Копировать Код
Public Function AcisIn( ByRef fileName As String ) As DBObjectCollection
 Параметры
 Параметры
 Описание
 fileName
 Имя файла с геометрией. Тип String.
 Возвращает
 Возвращает коллекцию полученных из файла твердых тел ACIS. Тип DBObjectCollection.
 Описание
 Метод позволяет прочитать все объекты ACIS из файла fileName формата ASCII ACIS SAT. Затем он создает объекты Line, Circle, Arc, Ellipse, Spline, Region, Solid3d или Body для каждого из них в зависимости от ситуации и добавляет их в возвращаемую коллекцию.
 Замечания
 Вновь созданные объекты не добавляются в базу данных, поэтому вызывающее приложение обязано либо добавить их в базу данных, либо удалить из памяти, когда потребность в них отпадёт.
 Ссылки
 Teigha.DatabaseServices.Body, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!