Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ObjectId.Null
 Послать отзыв
 Свойство обеспечивает доступ к нулевому ObjectId. Данное свойство позволяет использовать более компактные выражения и помогает компилятору генерировать более эффективный код (если он знает, что ObjectId нулевой, то нет необходимости искать объект Null).
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectId Null;
Копировать Код
Public Property Null() As ObjectId
 Возвращает
 Возвращает тип ObjectId.
 Описание
 Свойство обеспечивает доступ к нулевому ObjectId. Данное свойство позволяет использовать более компактные выражения и помогает компилятору генерировать более эффективный код (если он знает, что ObjectId нулевой, то нет необходимости искать объект Null).
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.ObjectId, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!