Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Cmlscale
 Послать отзыв
 Синтаксис
C#
Visual Basic
public double Cmlscale;
Public Property Cmlscale() As Double
 Описание
 Возвращает или устанавливает текущее значение CMLSCALE для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!