Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocArrayPolarParameters
 Послать отзыв
 Класс предоставляет интерфейс для управления параметрами кругового массива.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::DatabaseServices::AssocArrayParameters Teigha::DatabaseServices::AssocArrayCommonParameters Teigha::DatabaseServices::AssocArrayPolarParameters
 Синтаксис
C#
Visual Basic
Копировать Код
[TypeDescriptionProvider("Teigha.ComponentModel.TypeDescriptionProvider`1[[Teigha.DatabaseServices.AssocArrayPolarParameters, TD_MgdDbConstraints]], TD_MgdDbConstraints")] [Teigha.Runtime.Wrapper("AcDbAssocArrayPolarParameters")] public class AssocArrayPolarParameters : AssocArrayCommonParameters;
Копировать Код
<TypeDescriptionProvider("Teigha.ComponentModel.TypeDescriptionProvider`1[[Teigha.DatabaseServices.AssocArrayPolarParameters, TD_MgdDbConstraints]], TD_MgdDbConstraints")> <Teigha.Runtime.Wrapper("AcDbAssocArrayPolarParameters")> Public Class AssocArrayPolarParameters Inherits AssocArrayCommonParameters
 Описание
 Класс предоставляет интерфейс для управления параметрами кругового массива.
 Методы
 Конструкторы
 Teigha.DatabaseServices.AssocArrayParameters
 ПоказатьInternalУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 AssocArrayParameters
 This is AssocArrayParameters, a member of class AssocArrayParameters. (Унаследован от AssocArrayParameters)
 Teigha.DatabaseServices.AssocArrayCommonParameters
 ПоказатьInternalУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 AssocArrayCommonParameters
 This is AssocArrayCommonParameters, a member of class AssocArrayCommonParameters. (Унаследован от AssocArrayCommonParameters)
 Teigha.DatabaseServices.AssocArrayPolarParameters
 Имя
 Описание
 AssocArrayPolarParameters
 Это обзор перегрузок AssocArrayPolarParameters.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.DatabaseServices.AssocArrayParameters
 Имя
 Описание
 AssocArrayParameters Методы
 Ниже перечислены методы класса AssocArrayParameters.
 AssocArrayParameters Свойства
 Ниже перечислены свойства класса AssocArrayParameters.
 Teigha.DatabaseServices.AssocArrayCommonParameters
 Имя
 Описание
 AssocArrayCommonParameters Методы
 Ниже перечислены методы класса AssocArrayCommonParameters.
 AssocArrayCommonParameters Свойства
 Ниже перечислены свойства класса AssocArrayCommonParameters.
 Teigha.DatabaseServices.AssocArrayPolarParameters
 Имя
 Описание
 AssocArrayPolarParameters Перечисления
 Ниже перечислены перечисления класса AssocArrayPolarParameters.
 AssocArrayPolarParameters Методы
 Ниже перечислены методы класса AssocArrayPolarParameters.
 AssocArrayPolarParameters Свойства
 Ниже перечислены свойства класса AssocArrayPolarParameters.
 Ссылки
 AssocArrayPolarParameters Конструктор, AssocArrayPolarParameters Перечисления, AssocArrayPolarParameters Методы, AssocArrayPolarParameters Свойства, Методы, Топики, AssocArrayPolarParameters Перечисления, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!