Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CellContent.GetValue
 Послать отзыв
 Метод предоставляет значение ячейки таблицы.
 Синтаксис
C#
Visual Basic
Копировать Код
public Object GetValue( FormatOption formatOption );
Копировать Код
Public Function GetValue( formatOption As FormatOption ) As Object
 Параметры
 Параметры
 Описание
 formatOption
 Опции форматирования значения ячейки. Перечисление FormatOption.
 Возвращает
 Возвращает объект, представляющий значение ячейки. Тип Object.
 Описание
 Метод предоставляет значение ячейки таблицы.
 Ссылки
 Teigha.DatabaseServices.CellContent, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!