Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 ViewportTableRecord.SnapAngle
 Послать отзыв
 Свойство предназначено для управления углом поворота сетки и шаговой привязки для текущего видового экрана относительно текущей ПСК.
 Синтаксис
C#
Visual Basic
public double SnapAngle;
Public Property SnapAngle() As Double
 Возвращает
 Возвращает тип данных double.
 Описание
 Свойство предназначено для управления углом поворота сетки и шаговой привязки для текущего видового экрана относительно текущей ПСК. Угол привязки изменяется в пределах плоскости XY с осью вращения по оси Z против часовой стрелки, если смотреть вниз по оси Z в начало координат. Угол измеряется в радианах.
 Условия
 Чтение и запись.
 Ссылки
 ViewportTableRecord Класс, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!