Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LoftOptions.CheckCrossSectionCurves
 Послать отзыв
 Метод позволяет проверить, допустимы ли кривые поперечных сечений для выполнения операции лофта.
 Синтаксис
C#
Visual Basic
Копировать Код
public LoftOptionsCheckCurvesOut CheckCrossSectionCurves( ref Entity[] crossSectionCurves, bool displayErrorMessages );
Копировать Код
Public Function CheckCrossSectionCurves( ByRef crossSectionCurves() As Entity, displayErrorMessages As Boolean ) As LoftOptionsCheckCurvesOut
 Параметры
 Параметры
 Описание
 crossSectionCurves
 Массив кривых поперечных сечений. Тип Entity[].
 displayErrorMessages
 Флаг, определяющий, требуется ли отображать сообщения об ошибках. Тип bool. Значение по умолчанию - false.
 Возвращает
 Возвращает объект типа LoftOptionsCheckCurvesOut, свойства которого предоставляют следующие данные:
Если свойство AllOpen равно true, то все поперечные сечения являются разомкнутыми.
Если свойство AllClosed равно true, то все поперечные сечения являются замкнутыми.
Если свойство AllPlanar равно true, то все поперечные сечения являются плоскими.
 Описание
 Метод позволяет проверить, допустимы ли кривые поперечных сечений для выполнения операции лофта. Метод выбрасывает исключение eInvalidInput, если кривые недопустимы.
 Ссылки
 Teigha.DatabaseServices.LoftOptions, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!