Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlaneSurface.CreateFromRegion
 Послать отзыв
 Метод предназначен для создания плоской поверхности на основе указанной области.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void CreateFromRegion( ref Region region );
Копировать Код
Public Overridable Sub CreateFromRegion( ByRef region As Region )
 Параметры
 Параметры
 Описание
 region
 Область, на основе которой должна быть создана плоская поверхность. Тип Region.
 Описание
 Метод предназначен для создания плоской поверхности на основе указанной области.
 Ссылки
 Teigha.DatabaseServices.PlaneSurface, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!