Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.VertexRef.VertexRef
 Послать отзыв
 Конструктор класса VertexRef. Создает ссылку на вершину объекта, для которого задан полный путь к подобъекту.
 Синтаксис
C#
Visual Basic
Копировать Код
public VertexRef( FullSubentityPath path );
Копировать Код
Public Sub New( path As FullSubentityPath )
 Параметры
 Параметры
 Описание
 path
 Полный путь к подобъекту. Тип FullSubentityPath.
 Описание
 Конструктор класса VertexRef. Создает ссылку на вершину объекта, для которого задан полный путь к подобъекту.
 Ссылки
 Teigha.DatabaseServices.VertexRef, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!