Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Section.VerticalDirection
 Послать отзыв
 Свойство VerticalDirection представляет вектор вертикального направления этой секущей плоскости.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d VerticalDirection;
Копировать Код
Public Property VerticalDirection As Vector3d
 Возвращает
 Возвращает направление вертикали. Тип Vector3d.
 Описание
 Свойство VerticalDirection представляет вектор вертикального направления этой секущей плоскости. Этот вектор лежит в плоскости первого сегмента секущей плоскости и перпендикулярен линии сечения.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Section, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!