Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Viewport.PlotStyleSheet
 Послать отзыв
 Свойство PlotStyleSheet представляет имя таблицы стилей печати, применяемых к объектам в данном видовом экране.
 Синтаксис
C#
Visual Basic
Копировать Код
public String PlotStyleSheet;
Копировать Код
Public Property PlotStyleSheet As String
 Возвращает
 Возвращает имя таблицы стилей печати. Тип String.
 Описание
 Свойство PlotStyleSheet представляет имя таблицы стилей печати, применяемых к объектам в данном видовом экране.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Viewport, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!