Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FeatureControlFrame.Dimtxt
 Послать отзыв
 Свойство Dimtxt представляет текущее значение системной переменной DIMTXT, которая определяет высоту размерного текста.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Dimtxt;
Копировать Код
Public Property Dimtxt As Double
 Возвращает
 Возвращает высоту размерного текста как значение системной переменной DIMTXT. Тип double.
 Описание
 Свойство Dimtxt представляет текущее значение системной переменной DIMTXT, которая определяет высоту размерного текста.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.FeatureControlFrame, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!