Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DatabaseSummaryInfo.Title
 Послать отзыв
 Свойство предоставляет доступ к заголовку данного объекта DatabaseSummaryInfo.
 Синтаксис
C#
Visual Basic
Копировать Код
public String Title;
Копировать Код
Public Property Title() As String
 Возвращает
 Возвращает заголовок. Тип String.
 Описание
 Свойство предоставляет доступ к заголовку данного объекта DatabaseSummaryInfo.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.DatabaseSummaryInfo, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!