Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Entity.SetLayerId(ObjectId
 Послать отзыв
 Метод устанавливает идентификатор слоя, к которому должен принадлежать объект по имени слоя. Также мтеод поддерживает установку на скрытый слой, если параметр allowHidden имеет значение true. Данный метод применим только к определённым встроенным типам объектов, таким как 2dPolyline, 3dPolyline, PolyFaceMesh и PolygonMesh.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetLayerId(ObjectId newValue, bool allowHidden);
Копировать Код
Public Sub SetLayerId(newValue As ObjectId, allowHidden As bool)
 Параметры
 Параметры
 Описание
 newValue
 Идентификатор записи LayerTableRecord, на который ссылается геометрический объект. Тип ObjectId
 allowHidden
 Признак, указывающий, может ли newValue определять скрытый слой. Тип bool
 Описание
 Этот метод задает в геометрическом объекте ссылку на LayerTableRecord, определенную именем, указанным в newValue. Для геометрического объекта BlockReference, этот метод также обновит любой связанный подобъект SequenceEnd. Note Только встроенные объекты, для которых kTrue имеет результат, могут использоваться:
 2dPolyline, 3dPolyline, PolyFaceMesh, и PolygonMesh.
 В базе данных, содержащей геометрический объект, ищется объект LayerTableRecord с именем, указанным в newValue. Если геометрический объект в данный момент не в базе данных, поиск производится в базе данных, с которой в данный момент работает редактор nanoCAD.
 Значение true для allowHidden позволяет параметру newValue указывать на скрытый слой. Если этот параметр равен false (по умолчанию) и newValue указывает на скрытый слой, требуемые изменения будут игнорированы (без выдачи каких-либо сообщений и уведомлений).
 Ссылки
 Teigha.DatabaseServices.Entity, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!