Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.Dimaunit
 Послать отзыв
 Свойство задает вариант единиц измерения для угловых размеров.
 Синтаксис
C#
Visual Basic
Копировать Код
public int Dimaunit;
Копировать Код
Public Property Dimaunit As Integer
 Возвращает
 Возвращает вариант единиц измерения для угловых размеров. Тип int.
 Описание
 Свойство позволяет задать вариант единиц измерения для угловых размеров.
 Значение
 Описание
 0
 Десятичные градусы.
 1
 Градусы/минуты/секунды.
 2
 Грады.
 3
 Радианы.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!