Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Matrix2d.ToArray
 Послать отзыв
 Метод позволяет получить данную матрицу в виде массива из девяти элементов. Запись элементов матрицы в массив выполняется построчно.
 Синтаксис
C#
Visual Basic
Копировать Код
public double[] ToArray();
Копировать Код
Public Function ToArray() As Double()
 Возвращает
 Возвращает массив из девяти элементов, в котором построчно сохранены элементы матрицы. Тип double[].
 Описание
 Метод позволяет получить данную матрицу в виде массива из девяти элементов. Запись элементов матрицы в массив выполняется построчно (data11, data12 ... data33).
 Ссылки
 Teigha.Geometry.Matrix2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!