Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocArrayPolarParameters.SetItemCount
 Послать отзыв
 Метод позволяет установить количество элементов в круговом массиве.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetItemCount( int count, ref String expression, ref String evaluatorId );
Копировать Код
Public Sub SetItemCount( count As Integer, ByRef expression As String, ByRef evaluatorId As String )
 Параметры
 Параметры
 Описание
 count
 Количество элементов в круговом массиве. Тип int.
 expression
 Выражение для параметра. Тип String. Строка может быть пустой.
 evaluatorId
 Строковое представление идентификатора вычислителя. Тип String. Строка может быть пустой
 Описание
 Метод позволяет установить количество элементов в круговом массиве.
 Если для параметра выражение отсутствует, строки expression и evaluatorId должны быть пустыми.
 Ссылки
 Teigha.DatabaseServices.AssocArrayPolarParameters, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!