Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Filters.Index.ObjectBeingIndexedId
 Послать отзыв
 Свойство возвращает идентификатор родительской записи таблицы блоков, с которой связан (и которой неявно принадлежит) данный индекс.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual DatabaseServices.ObjectId ObjectBeingIndexedId;
Копировать Код
Public Overridable ReadOnly Property ObjectBeingIndexedId As DatabaseServices.ObjectId
 Возвращает
 Возвращает идентификатор объекта записи таблицы блоков. Тип DatabaseServices.ObjectId.
 Описание
 Свойство возвращает идентификатор родительской записи таблицы блоков, с которой связан (и которой неявно принадлежит) данный индекс.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Filters.Index, Teigha.DatabaseServices.Filters
 Ваши комментарии по поводу этого топика: Послать отзыв!