Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MText.ExplodeFragments
 Послать отзыв
 Метод предназначен для разбиения данного многострочного текста на простые текстовые фрагменты, каждый из которых передается на обработку указанной функции. Дополнительно метод принимает пользовательские данные, которые позволяют учесть специфику приложения при обработке фрагментов.
 Синтаксис
C#
Visual Basic
Копировать Код
public void ExplodeFragments( ref MTextFragmentCallback enumerator, ref Object userData );
Копировать Код
Public Sub ExplodeFragments( ByRef enumerator As MTextFragmentCallback, ByRef userData As Object )
 Параметры
 Параметры
 Описание
 enumerator
 Функция обработки текстовых фрагментов. Тип MTextFragmentCallback.
 userData
 Произвольные пользовательские данные. Тип Object.
 Описание
 Метод предназначен для разбиения данного многострочного текста на простые текстовые фрагменты, каждый из которых передается на обработку указанной функции.
 В контексте данного метода под фрагментом понимается часть текста в пределах одной строки до переноса по словам, имеющего определенный набор характеристик (т.е. шрифт, цвет, высота, ширина и т.п.). Таким образом, каждый перенос слов и всякое изменение характеристик текста начинают новый фрагмент.
 Функция обработки получает текстовый фрагмент в виде объекта MTextFragment, который представляет всю информацию о фрагменте. Каждый фрагмент обрабатывается один раз. Используется текущий объект WorldDraw. Функция обработки должна возвращать 1 для продолжения операции или 0 для завершения работы.
 Аргумент userData предоставляет возможность передать в функцию обработки некоторые специфичные для приложения данные. Пользовательские данные могут быть любыми, они передаются только перечислителю функции обработки.
 Ссылки
 Teigha.DatabaseServices.MText, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!