Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Helix.SetAxisPoint
 Послать отзыв
 Метод предоставляет возможность задать точку начала оси спирали.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetAxisPoint( Point3d axisPoint, bool moveStartPoint );
Копировать Код
Public Sub SetAxisPoint( axisPoint As Point3d, moveStartPoint As Boolean )
 Параметры
 Параметры
 Описание
 axisPoint
 Новая точка начала оси спирали. Тип Point3d.
 moveStartPoint
 Флаг, определяющий, следует ли применить к начальной точке спирали такое же смещение, что и у точки начала оси спирали. Тип bool. В случае значения true начальная точка спирали должна сместиться. В противном случае она остается на прежнем месте.
 Описание
 Метод предоставляет возможность задать точку начала оси спирали (центр основания).
 Ссылки
 Teigha.DatabaseServices.Helix, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!