Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FieldEvaluatorLoader.GetEvaluator
 Послать отзыв
 Движок вычисления полей вызывает этот метод, чтобы получить вычислитель по его идентификатору, после чего использует вычислитель для вычисления поля.
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract FieldEvaluator GetEvaluator( ref String pszEvalId );
Копировать Код
Public MustOverride Function GetEvaluator( ByRef pszEvalId As String ) As FieldEvaluator
 Параметры
 Параметры
 Описание
 pszEvalId
 Входной идентификатор требуемого вычислителя. Тип String.
 Возвращает
 Возвращает вычислитель с идентификатором pszEvalId. Тип FieldEvaluator.
 Описание
 Движок вычисления полей вызывает этот метод, чтобы получить вычислитель по его идентификатору, после чего использует вычислитель для вычисления поля.
 Ссылки
 Teigha.DatabaseServices.FieldEvaluatorLoader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!