Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Solid3d.FilletEdges
 Послать отзыв
 Метод предназначен для создания скруглений на ребрах данного твердого тела.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void FilletEdges( ref SubentityId[] subentityIds, ref DoubleCollection radius, ref DoubleCollection startSetback, ref DoubleCollection endSetback );
Копировать Код
Public Overridable Sub FilletEdges( ByRef subentityIds() As SubentityId, ByRef radius As DoubleCollection, ByRef startSetback As DoubleCollection, ByRef endSetback As DoubleCollection )
 Параметры
 Параметры
 Описание
 subentityIds
 Массив идентификаторов объектов ребер. К указанным ребрам применяется операция скругления. Тип SubentityId[].
 radius
 Массив значений радиусов скругления для соответствующих ребер. Тип DoubleCollection.
 startSetback
 Массив начальных отступов на соответствующих ребрах. Тип DoubleCollection.
 endSetback
 Массив конечных отступов на соответствующих ребрах. Тип DoubleCollection.
 Описание
 Метод предназначен для создания скруглений на ребрах данного твердого тела.
 Реализован только в среде пространственного моделирования.
 Ссылки
 Teigha.DatabaseServices.Solid3d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!