Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Elevation
 Послать отзыв
 Синтаксис
C#
Visual Basic
public double Elevation;
Public Property Elevation() As Double
 Описание
 Возвращает или устанавливает значение переменной ELEVATION пространства модели базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!