Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CellRange.ParentTable
 Послать отзыв
 Свойство возвращает родительскую таблицу данного диапазона ячеек.
 Синтаксис
C#
Visual Basic
Копировать Код
public Table ParentTable;
Копировать Код
Public ReadOnly Property ParentTable As Table
 Возвращает
 Возвращает родительскую таблицу данного диапазона. Тип Table.
 Описание
 Свойство возвращает родительскую таблицу данного диапазона ячеек.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.CellRange, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!