Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CustomScale.Numerator
 Послать отзыв
 Свойство представляет числитель этого пользовательского масштаба.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Numerator;
Копировать Код
Public Property Numerator() As Double
 Возвращает
 Возвращает числитель пользовательского масштаба. Тип double.
 Описание
 Свойство представляет числитель этого пользовательского масштаба.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.CustomScale, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!