Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.GetTextHeight
 Послать отзыв
 Метод предназначен для получения высоты текста элемента содержимого, заданного его индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual double GetTextHeight( int row, int column, int contentIndex )
Копировать Код
Public virtual Function GetTextHeight( row As Integer, column As Integer, contentIndex As Integer ) As double
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 contentIndex
 Индекс элемента содержимого ячейки, тип int. Индекс должен быть больше или равен нулю и меньше количества элементов содержимого в ячейке.
 col
 Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
 Возвращает
 Возвращает высоту текста, тип double.
 Описание
 Метод предназначен для получения высоты текста элемента содержимого, заданного его индексом.
 Замечания
 Для получения того же результата предпочтительнее использовать свойство Table.Cells[row,column].Contents[i].TextHeight.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!