Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CellContent.ContentColor
 Послать отзыв
 Свойство ContentColor представляет цвет содержимого ячейки.
 Синтаксис
C#
Visual Basic
Копировать Код
public Colors.Color ContentColor;
Копировать Код
Public Property ContentColor As Colors.Color
 Возвращает
 Возвращает цвет содержимого ячейки. Тип Colors.Color.
 Описание
 Свойство ContentColor представляет цвет содержимого ячейки.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.CellContent, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!