Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.SetBlockAttributeValue
 Послать отзыв
 Метод позволяет присвоить значение атрибуту блока, если элементом содержимого ячейки является вхождение блока с атрибутами.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetBlockAttributeValue( int row, int col, DatabaseServices.ObjectId attributeDefinitionId, ref String value );
Копировать Код
Public virtual Sub SetBlockAttributeValue( row As Integer, col As Integer, attributeDefinitionId As DatabaseServices.ObjectId, ByRef value As String )
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 col
 Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
 attributeDefinitionId
 Идентификатор определения атрибута AttributeDefinition. Тип DatabaseServices.ObjectId.
 value
 Новое значение атрибута блока, тип String.
 Описание
 Метод позволяет присвоить значение атрибуту блока, если элементом содержимого ячейки является вхождение блока с атрибутами.
 Замечания
 Для получения того же результата предпочтительнее метод Table.Cells[row,column].Contents[i].GetBlockAttributeValue.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!