Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.SplineEntity2d.NumKnots
 Послать отзыв
 Свойство NumKnots представляет количество узлов в узловом векторе данного сплайна. Не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public int NumKnots;
Копировать Код
Public ReadOnly Property NumKnots As Integer
 Возвращает
 Возвращает количество узлов в узловом вектора данного сплайна. Тип int.
 Описание
 Свойство NumKnots представляет количество узлов в узловом векторе данного сплайна. Не реализовано.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.SplineEntity2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!