Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Matrix3d.IsSingular
 Послать отзыв
 Метод позволяет проверить, является ли данная матрица сингулярной.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsSingular();
Копировать Код
Public Function IsSingular() As Boolean
 Возвращает
 Возвращает true, если данная матрица является сингулярной, иначе - false.
 Описание
 Метод позволяет проверить, является ли данная матрица сингулярной. Реализация метода использует вызов Matrix3d.IsSingular(Tolerance tolerance) с точностью, равной Tolerance.Global.
 Замечания
Матрица сингулярна тогда и только тогда, когда ее определитель равен нулю. Такое возможно, например, если какие-либо векторы-столбцы линейной части данной матрицы имеют нулевую длину или оказываются параллельными.
Сингулярная матрица не может быть инвертирована.
 Ссылки
 Teigha.Geometry.Matrix3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!