Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Point3dCollection.Contains
 Послать отзыв
 Метод проверяет, содержится ли в коллекции точка, совпадающая с заданной.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool Contains( Point3d p );
Копировать Код
Public Function Contains( p As Point3d ) As Boolean
 Параметры
 Параметры
 Описание
 p
 Точка Point3d для поиска.
 Возвращает
 Возвращает true, если в коллекции присутствует точка, совпадающая с заданной, в противном случае возвращает false.
 Описание
 Метод проверяет, содержится ли в коллекции точка, совпадающая с заданной. В случае найденного совпадения возвращает true.
 Ссылки
 Teigha.Geometry.Point3dCollection, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!