Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DataColumn.GetIndexAtCell
 Послать отзыв
 Метод возвращает индекс первой найденной ячейки в столбце, которая по своим данным соответствует указанному объекту DataCell.
 Синтаксис
C#
Visual Basic
Копировать Код
public int GetIndexAtCell( ref DataCell cell );
Копировать Код
Public Function GetIndexAtCell( ByRef cell As DataCell ) As Integer
 Параметры
 Параметры
 Описание
 cell
 Входной объект для поиска ячейки данных в столбце. Тип DataCell.
 Возвращает
 Возвращает индекс найденной ячейки. Тип int. Если ячейка данных отсутствует, происходит завершение работы приложения и появляется сообщение 'Operation is not valid due to the current state of the object.' (Операция не может быть выполнена вследствие текущего состояния объекта.)
 Описание
 Метод возвращает индекс ячейки в столбце, которая по своим данным соответствует указанному объекту DataCell. Если совпадений несколько, метод возвращает индекс первой найденной ячейки.
 Ссылки
 Teigha.DatabaseServices.DataColumn, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!