Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DynamicDimensionDataCollection.Clear
 Послать отзыв
 Метод Clear() позволяет очистить коллекцию.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Clear();
Копировать Код
Public Sub Clear()
 Описание
 Метод Clear() позволяет очистить коллекцию.
 Ссылки
 Teigha.DatabaseServices.DynamicDimensionDataCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!