Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocDependency.Order
 Послать отзыв
 Свойство позволяет получить или задать порядок зависимости, определяющий ее место в списке всех зависимостей связанного объекта DBObject.
 Синтаксис
C#
Visual Basic
Копировать Код
public int Order;
Копировать Код
Public Property Order() As Integer
 Возвращает
 Возвращает порядок зависимости в списке зависимостей связанного объекта. Тип int.
 Описание
 Свойство позволяет получить или задать порядок зависимости, который определяет ее место в списке всех зависимостей связанного объекта DBObject. Зависимости с более низким значением свойства Order располагаются в списке перед зависимостями с более высоким значением Order. Последовательность зависимостей с одинаковым значением Order определяется по мере их добавления к объекту зависимости - добавленные позже, располагаются после зависимостей, добавленных ранее.
 Заметим, если зависимость уже прикреплена к объекту методом AttachToObject(), изменение свойства Order не меняет положение зависимости в списке, и задавать его не следует.
 Значение по умолчанию этого элемента данных — 0.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.AssocDependency, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!