Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Scale2d.IsProportional
 Послать отзыв
 Метод позволяет проверить, действительно ли данный объект представляет равномерное масштабирование по осям X и Y. При проверке используется указанная в аргументе точность.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsProportional( Tolerance tolerance );
Копировать Код
Public Function IsProportional( tolerance As Tolerance ) As Boolean
 Параметры
 Параметры
 Описание
 tolerance
 Заданная точность для сравнения. Тип Tolerance.
 Возвращает
 Возвращает true, если в пределах точности tolerance компоненты данного вектора масштабирования можно считать равными по модулю. В противном случае возвращает false.
 Описание
 Метод позволяет проверить, действительно ли данный объект представляет равномерное масштабирование по осям X и Y. При проверке используется указанная в аргументе точность.
 Ссылки
 Teigha.Geometry.Scale2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!