Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.UnderlayReference.SetClipBoundary
 Послать отзыв
 Метод позволяет задать массив точек, определяющих границу обрезки данной подложки.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetClipBoundary( ref Point2d[] points );
Копировать Код
Public Sub SetClipBoundary( ByRef points() As Point2d )
 Параметры
 Параметры
 Описание
 points
 Массив точек границы обрезки. Тип Point2d[].
 Описание
 Метод позволяет задать массив точек, определяющих границу обрезки данной подложки.
 Ссылки
 Teigha.DatabaseServices.UnderlayReference, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!