Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FieldEvaluationStatusResult.ErrorMessage
 Послать отзыв
 Свойство ErrorMessage возвращает сообщение об ошибке этого объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public String ErrorMessage;
Копировать Код
Public ReadOnly Property ErrorMessage As String
 Возвращает
 Возвращает сообщение об ошибке. Тип String.
 Описание
 Свойство ErrorMessage возвращает сообщение об ошибке этого объекта.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.FieldEvaluationStatusResult, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!