Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.PolylineCurve2d.PolylineCurve2d
 Послать отзыв
 Конструктор класса PolylineCurve2d. Создает полилинию с указанными управляющими вершинами и узловым вектором.
 Синтаксис
C#
Visual Basic
Копировать Код
public PolylineCurve2d( ref KnotCollection knots, ref Point2dCollection controlPoints );
Копировать Код
Public Sub New( ByRef knots As KnotCollection, ByRef controlPoints As Point2dCollection )
 Параметры
 Параметры
 Описание
 knots
 Входной узловой вектор. Тип KnotCollection.
 controlPoints
 Входные управляющие вершины. Тип Point2dCollection.
 Описание
 Конструктор класса PolylineCurve2d. Создает полилинию с указанными управляющими вершинами controlPoints и узловым вектором knots.
 Ссылки
 Teigha.Geometry.PolylineCurve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!