Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LayerViewportProperties.IsPlotStyleOverridden
 Послать отзыв
 Свойство позволяет проверить, переопределен ли стиль печати для связанного слоя и видового экрана.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsPlotStyleOverridden;
Копировать Код
Public Property IsPlotStyleOverridden As Boolean
 Возвращает
 Возвращает true, если стиль печати переопределен. В противном случае возвращает false.
 Описание
 Свойство позволяет проверить, переопределен ли стиль печати для связанного слоя и видового экрана.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.LayerViewportProperties, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!