Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve3d.IsPlanar
 Послать отзыв
 Метод проверяет, является ли данная кривая плоской.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsPlanar( out Plane plane );
Копировать Код
Public Function IsPlanar( plane As out Plane ) As Boolean
 Параметры
 Параметры
 Описание
 plane
 Плоскость, которой принадлежит кривая (если она плоская). Тип Plane.
 Возвращает
 Возвращает true в случае, если кривая является плоской, иначе - false.
 Описание
 Метод проверяет, является ли данная кривая плоской.
 Если кривая геометрически является линией, этот метод возвращает произвольную плоскость, которая содержит эту линию. Параметр plane возвращает значимые данные только в том случае, когда результирующим значением метода является true.
 Реализация метода использует вызов Curve3d.IsPlanar(out Plane plane, Tolerance tolerance) c допуском, равным Tolerance.Global.
 Ссылки
 Teigha.Geometry.Curve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!