Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.DeleteContent
 Послать отзыв
 Метод предназначен для удаления всего содержимого из всех ячеек в указанном диапазоне.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void DeleteContent( ref CellRange range );
Копировать Код
Public virtual Sub DeleteContent( ByRef range As CellRange )
 Параметры
 Параметры
 Описание
 range
 Диапазон ячеек, в которых удаляется все содержимое. Тип CellRange.
 Описание
 Метод предназначен для удаления всего содержимого из всех ячеек в указанном диапазоне.
 Замечания
 Для получения того же результата предпочтительнее использовать метод CellRange.DeleteContent.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!