Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.Dimaltf
 Послать отзыв
 Свойство позволяет контролировать значение масштабного коэффициента для альтернативных линейных единиц измерения.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Dimaltf;
Копировать Код
Public Property Dimaltf As Double
 Возвращает
 Возвращает масштабный коэффициент. Тип double.
 Описание
 Свойство позволяет контролировать значение масштабного коэффициента для альтернативных линейных единиц измерения. Работает при условии, что свойство Dimalt возвращает значение true.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!