Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector2d.GetNormal
 Послать отзыв
 Метод предоставляет единичный вектор, сонаправленный данному вектору в пределах заданной точности.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector2d GetNormal( Tolerance tolerance );
Копировать Код
Public Function GetNormal( tolerance As Tolerance ) As Vector2d
 Параметры
 Параметры
 Описание
 tolerance
 Заданная точность. Тип Tolerance.
 Возвращает
 Возвращает единичный вектор, сонаправленный данному вектору. Тип Vector2d.
 Описание
 Метод позволяет получить единичный вектор, сонаправленный данному вектору в пределах заданной точности tolerance.
 Замечания
 Результирующий вектор не нормируется, если длина исходного вектора меньше, чем Tolerance.EqualVector. В таком случае возвращаемый вектор совпадает с исходным.
 Ссылки
 Teigha.Geometry.Vector2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!