Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Spline.SetWeightAt
 Послать отзыв
 Метод позволяет изменить вес управляющей вершины с указанным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetWeightAt( int index, double weight );
Копировать Код
Public Sub SetWeightAt( index As Integer, weight As Double )
 Параметры
 Параметры
 Описание
 index
 Индекс управляющей вершины. Тип int.
 weight
 Новое значение веса управляющей вершины. Тип double.
 Описание
 Метод позволяет изменить вес управляющей вершины с указанным индексом. Если сплайн не является рациональным, то он преобразуется в рациональный сплайн.
 Ссылки
 Teigha.DatabaseServices.Spline, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!