Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GraphNodeCollection.Contains
 Послать отзыв
 Метод позволяет проверить, содержит ли коллекция элемент, соответствующий указанному объекту.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool Contains( ref GraphNode value );
Копировать Код
Public Function Contains( ByRef value As GraphNode ) As Boolean
 Параметры
 Параметры
 Описание
 value
 Искомый объект. Тип GraphNode.
 Возвращает
 Возвращает true, если объект value содержится в коллекции. В противном случае возвращает false.
 Описание
 Метод позволяет проверить, содержит ли коллекция элемент, соответствующий указанному объекту GraphNode.
 Ссылки
 Teigha.DatabaseServices.GraphNodeCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!