Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Point2d.DivideBy
 Послать отзыв
 Метод создает новую точку, координаты которой получены делением координат данной точки на указанное значение.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point2d DivideBy( double value );
Копировать Код
Public Function DivideBy( value As Double ) As Point2d
 Параметры
 Параметры
 Описание
 value
 Значение, используемое для вычисления новых координат. Тип double.
 Возвращает
 Возвращает точку Point2d в новых координатах.
 Описание
 Метод создает новую точку, координаты которой получены делением координат данной точки на заданное значение value.
 Ссылки
 Teigha.Geometry.Point2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!