Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CubicSplineCurve2d.GetFitPointAt
 Послать отзыв
 Метод позволяет получить определяющую точку этого сплайна с заданным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point2d GetFitPointAt( int index );
Копировать Код
Public Function GetFitPointAt( index As Integer ) As Point2d
 Параметры
 Параметры
 Описание
 index
 Индекс искомой определяющей точки данного сплайна. Тип int.
 Возвращает
 Возвращает определяющую точку сплайна с индексом index. Тип Point2d.
 Описание
 Метод позволяет получить определяющую точку этого сплайна с заданным индексом.
 Ссылки
 Teigha.Geometry.CubicSplineCurve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!