Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve2d.OrthoBoundBlock
 Послать отзыв
 Свойство OrthoBoundBlock представляет двумерную граничную рамку для данной кривой. Граничная рамка ориентирована по осям системы координат.
 Синтаксис
C#
Visual Basic
Копировать Код
public BoundBlock2d OrthoBoundBlock;
Копировать Код
Public ReadOnly Property OrthoBoundBlock As BoundBlock2d
 Возвращает
 Возвращает двумерную граничную рамку для данной кривой. Тип BoundBlock2d.
 Описание
 Свойство OrthoBoundBlock представляет двумерную граничную рамку для данной кривой. Граничная рамка ориентирована по осям системы координат.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.Curve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!