Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GeometryOverrule.GetGeomExtents
 Послать отзыв
 Метод GetGeomExtents возвращает минимальный прямоугольный параллелепипед, в который вписан заданный экземпляр класса Entity.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual Extents3d GetGeomExtents( ref Entity entity );
Копировать Код
Public virtual Function GetGeomExtents( ByRef entity As Entity ) As Extents3d
 Параметры
 Параметры
 Описание
 entity
 Входной объект типа Entity, для которого определяются границы.
 Возвращает
 Возвращает экземпляр класса Extents3d для аргумента entity.
 Описание
 Метод GetGeomExtents возвращает минимальный прямоугольный параллелепипед, в который вписан заданный экземпляр класса Entity.
 Прямоугольный параллелепипед ориентирован по осям системы координат.
 Ссылки
 Teigha.DatabaseServices.GeometryOverrule, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!