Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 DimStyleTableRecord.Dimdec
 Послать отзыв
 Свойство отвечает за количество знаков после запятой в цифрах линейных размеров.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual int Dimdec { get; set; }
Копировать Код
Public Overridable Property Dimdec As Integer
 Возвращает
 Возвращает тип данных int. Возможный диапазон значений от 0 до 8.
 Описание
 В свойстве хранится количество знаков после запятой или точность цифр линейных размеров в виде целого числа int. Значение по умолчанию 4.
 Свойство также доступно через системную переменную DIMDEC и пользовательское меню в окне изменения/создания размерного стиля:
  При изменении системной переменной DIMDEC будет создан новый размерный стиль под названием <переопределение> на основе текущего с новым значением DIMDEC.
 Условия
 Чтение и запись.
 Пример
 Пример изменения точности цифр линейных размеров (значения свойства Dimdec) в размерном стиле Standard:
C#
 Копировать Код
public partial class Commands { [Teigha.Runtime.CommandMethod("DimdecChange")] public void DimdecStandardDimStyle() { // Получение ссылки на активный документ HostMgd.ApplicationServices.Document doc = HostMgd.ApplicationServices.Application.DocumentManager.MdiActiveDocument; // Получение ссылки на редактор документа HostMgd.EditorInput.Editor ed = doc.Editor; // Получение ссылки на базу данных документа Teigha.DatabaseServices.Database db = doc.Database; // Начало транзакции с базой данных документа using (Teigha.DatabaseServices.Transaction trans = db.TransactionManager.StartTransaction()) { // Открываем таблицу размерных стилей для чтения Teigha.DatabaseServices.DimStyleTable dimStyleTable = trans.GetObject(db.DimStyleTableId, Teigha.DatabaseServices.OpenMode.ForRead) as Teigha.DatabaseServices.DimStyleTable; // Находим в таблице размерных стилей ObjectId нужного стиля по его названию Teigha.DatabaseServices.ObjectId styleId = dimStyleTable["Standard"]; // Открываем таблицу размерного стиля для изменений Teigha.DatabaseServices.DimStyleTableRecord obj = trans.GetObject(styleId, Teigha.DatabaseServices.OpenMode.ForWrite) as Teigha.DatabaseServices.DimStyleTableRecord; ed.WriteMessage($"nDimdec before: {obj.Dimdec}"); // Изменяем количество знаков после запятой obj.Dimdec = 1; ed.WriteMessage($"nDimdec after: {obj.Dimdec}"); trans.Commit(); } } }
 Результат работы команды DimdecChange:
 Было:
 Стало:
 Ссылки
 Teigha.DatabaseServices.DimStyleTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!