Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Wipeout.Wipeout
 Послать отзыв
 Конструктор по умолчанию класса Wipeout.
 Синтаксис
C#
Visual Basic
Копировать Код
public Wipeout();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса Wipeout.
 Ссылки
 Teigha.DatabaseServices.Wipeout, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!