Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AnnotationScale.IsTemporaryScale
 Послать отзыв
 Данное свойство позволяет установить, является ли масштаб аннотаций временно сохраненным в чертеже.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsTemporaryScale;
Копировать Код
Public Property IsTemporaryScale() As Boolean
 Возвращает
 Возвращает true, если масштаб в чертеже является временным, и false в противном случае.
 Описание
 Данное свойство позволяет установить, является ли масштаб аннотаций временно сохраненным в чертеже.
 Замечания
 Коллекция масштабов аннотаций чертежа может содержать временные элементы. Обычная причина их появления состоит в том, что прикрепленные объекты внешних ссылок XREF в чертеже зависят от масштабов, на которые другие объекты чертежа напрямую не ссылаются.
 Приложения не должны сохранять ссылки на временные масштабы, поскольку другие операции (например, отсоединение внешней ссылки XREF) могут удалять временные масштабы из коллекции. Временные масштабы не сохраняются в файле чертежа при его сохранении.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.AnnotationScale, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!