Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector2d.IsZeroLength
 Послать отзыв
 Метод проверяет, является ли данный вектор нулевым.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsZeroLength();
Копировать Код
Public Function IsZeroLength() As Boolean
 Возвращает
 Возвращает true, если в пределах точности по умолчанию длина данного вектора равна нулю. В противном случае возвращает false.
 Описание
 Метод проверяет, является ли данный вектор нулевым. Реализация использует вызов метода Vector2d.IsZeroLength(Tolerance tolerance) с точностью по умолчанию Tolerance.Global.
 Ссылки
 Teigha.Geometry.Vector2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!