Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CurveCurveIntersector2d.OverlapCount
 Послать отзыв
 Свойство OverlapCount представляет количество интервалов перекрытия для двух кривых в данном объекте.
 Синтаксис
C#
Visual Basic
Копировать Код
public int OverlapCount;
Копировать Код
Public ReadOnly Property OverlapCount As Integer
 Возвращает
 Возвращает количество интервалов перекрытия двух кривых. Тип int.
 Описание
 Свойство OverlapCount представляет количество интервалов перекрытия для двух кривых в данном объекте.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.CurveCurveIntersector2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!