Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MeshPointMap.SourcePoint
 Послать отзыв
 Свойство SourcePoint представляет исходную точку.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point2d SourcePoint;
Копировать Код
Public Property SourcePoint As Point2d
 Возвращает
 Возвращает исходную точку. Тип Point2d.
 Описание
 Свойство SourcePoint представляет исходную точку.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MeshPointMap, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!