Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Point3d.ScaleBy
 Послать отзыв
 Метод позволяет получить трехмерную точку, которая является результатом масштабирования этой точки с заданным коэффициентом относительно заданного центра.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d ScaleBy( double scaleFactor, Point3d centerPoint );
Копировать Код
Public Function ScaleBy( scaleFactor As Double, centerPoint As Point3d ) As Point3d
 Параметры
 Параметры
 Описание
 scaleFactor
 Входной масштабный множитель. Тип double.
 centerPoint
 Центр масштабирования. Тип Point3d.
 Возвращает
 Возвращает 3D-точку, являющуюся результатом операции масштабирования. Тип Point3d.
 Описание
 Метод позволяет получить трехмерную точку, которая является результатом масштабирования этой точки с коэффициентом scaleFactor относительно центра centerPoint.
 Ссылки
 Teigha.Geometry.Point3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!