Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MTextFragment.WidthFactor
 Послать отзыв
 Свойство представляет коэффициент растяжения символов текста.
 Синтаксис
C#
Visual Basic
Копировать Код
public double WidthFactor;
Копировать Код
Public ReadOnly Property WidthFactor As Double
 Возвращает
 Возвращает коэффициент растяжения символов текста. Тип double.
 Описание
 Свойство представляет коэффициент растяжения символов текста.
 Нормальной ширине символов шрифта соответствует значение 1,0. Значение 2,0 означает, что символы растянуты по ширине вдвое.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.MTextFragment, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!