Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Plane.Plane
 Послать отзыв
 Конструктор по умолчанию класса Plane. Создает новую плоскость, совпадающую с плоскостью XY.
 Синтаксис
C#
Visual Basic
Копировать Код
public Plane();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса Plane. Создает плоскость с началом в точке (0, 0, 0) и ортами uAxis = (1, 0, 0), vAxis = (0, 1, 0).
 Ссылки
 Teigha.Geometry.Plane, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!