Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Plane.Set
 Послать отзыв
 Метод переопределяет плоскость, задавая новые начало координат и нормальный вектор плоскости.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Set( Point3d pointValue, Vector3d normal );
Копировать Код
Public Sub Set( pointValue As Point3d, normal As Vector3d )
 Параметры
 Параметры
 Описание
 pointValue
 Новое начало координат плоскости. Тип Point3d.
 normal
 Новая нормаль плоскости. Тип Vector3d. Не может иметь ненулевую длину.
 Описание
 Метод переопределяет плоскость, задавая новые начало координат pointValue и нормальный вектор плоскости normal.
 Ссылки
 Teigha.Geometry.Plane, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!