Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Entity2d.RotateBy
 Послать отзыв
 Метод предназначен для вращения данного объекта вокруг указанной точки на заданный угол.
 Синтаксис
C#
Visual Basic
Копировать Код
public void RotateBy( double angle, Point2d point );
Копировать Код
Public Sub RotateBy( angle As Double, point As Point2d )
 Параметры
 Параметры
 Описание
 angle
 Угол поворота. Тип double.
 point
 Центр вращения. Тип Point2d.
 Описание
 Метод предназначен для вращения данного объекта вокруг указанной точки на заданный угол.
 Ссылки
 Teigha.Geometry.Entity2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!