Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.LoftParam
 Послать отзыв
 Синтаксис
C#
Visual Basic
public int LoftParam;
Public Property LoftParam() As Integer
 Описание
 Возвращает или устанавливает текущее значение LOFTPARAM для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!