Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeader.VerticesCount
 Послать отзыв
 Метод позволяет получить количество вершин у линии выноски с указанным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public int VerticesCount( int leaderLineIndex );
Копировать Код
Public Function VerticesCount( leaderLineIndex As Integer ) As Integer
 Параметры
 Параметры
 Описание
 leaderLineIndex
 Индекс линии выноски. Тип int.
 Возвращает
 Возвращает количество вершин. Тип int.
 Описание
 Метод позволяет получить количество вершин у линии выноски с указанным индексом.
 Ссылки
 Teigha.DatabaseServices.MLeader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!