Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbCurve3d.GetParametersOfG1Discontinuity
 Послать отзыв
 Метод предоставляет значения параметра всех точек сплайна с нарушенной в пределах заданной точности G1 непрерывностью (неколлинеарность касательных векторов слева и справа от точки).
 Синтаксис
C#
Visual Basic
Копировать Код
public DoubleCollection GetParametersOfG1Discontinuity( Tolerance tolerance );
Копировать Код
Public Function GetParametersOfG1Discontinuity( tolerance As Tolerance ) As DoubleCollection
 Параметры
 Параметры
 Описание
 tolerance
 Входная точность. Тип Tolerance.
 Возвращает
 Возвращает массив значений параметра в точках с нарушенной G1 непрерывностью. Тип DoubleCollection.
 Описание
 Метод предоставляет значения параметра всех точек сплайна, в которых в пределах заданной точности нарушается G1 непрерывность. В таких точках касательные векторы слева и справа от точки не коллинеарны.
 Ссылки
 Teigha.Geometry.NurbCurve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!