Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.OsnapPointRef.GetEntities
 Послать отзыв
 Метод предоставляет полные пути подобъектов, с которыми ассоциативно связан данный объект OsnapPointRef.
 Синтаксис
C#
Visual Basic
Копировать Код
public override FullSubentityPath[] GetEntities( bool getLastPtRef );
Копировать Код
Public Overrides Function GetEntities( getLastPtRef As Boolean ) As FullSubentityPath()
 Параметры
 Параметры
 Описание
 getLastPtRef
 Входной флаг, который определяет, следует ли учитывать последнюю точку привязки, которая использовалась для перпендикулярного или касательного типа объектной привязки. Тип bool.
 Возвращает
 Возвращает массив полных путей подобъектов связанной геометрии. Тип FullSubentityPath[].
 Описание
 Метод предоставляет полные пути подобъектов, с которыми ассоциативно связан данный объект OsnapPointRef.
 Ссылки
 Teigha.DatabaseServices.OsnapPointRef, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!