Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.PlanarEntity.GetCoordinateSystem
 Послать отзыв
 Метод предоставляет каноническую ортонормированную систему координат плоскости данного объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public CoordinateSystem3d GetCoordinateSystem();
Копировать Код
Public Function GetCoordinateSystem() As CoordinateSystem3d
 Возвращает
 Возвращает систему координат плоскости данного объекта. Тип CoordinateSystem3d.
 Описание
 Метод предоставляет каноническую ортонормированную систему координат плоскости данного объекта. Такая система координат определена следующим образом:
 Параметр
 Описание
 Вычисляется как
 origin
 Точка начала на плоскости.
 origin
 axis1
 Единичный вектор в плоскости.
 uAxis.normal()
 axis2
 Единичный вектор в плоскости, перпендикулярный вектору axis1.
 Normal.crossProduct(axis1)
 Ссылки
 Teigha.Geometry.PlanarEntity, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!