Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Событие Database.DxfInComplete
 Послать отзыв
 Синтаксис
C#
Visual Basic
public event EventHandler DxfInComplete;
Public Event DxfInComplete As EventHandler
 Описание
 Событие показывает, что база данных чертежа успешно изменилась при считывании DXF файла.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!