Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.RenderEnvironment.FogDensity
 Послать отзыв
 Свойство FogDensity представляет плотность ближнего и дальнего тумана.
 Синтаксис
C#
Visual Basic
Копировать Код
public DoubleRangeParameter FogDensity;
Копировать Код
Public Property FogDensity As DoubleRangeParameter
 Возвращает
 Возвращает плотность тумана. Тип DoubleRangeParameter.
 Описание
 Свойство FogDensity представляет плотность ближнего и дальнего тумана.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.RenderEnvironment, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!