Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Mline.Style
 Послать отзыв
 Свойство представляет идентификатор объекта MLineStyle, который определяет стиль данного объекта MLine.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.ObjectId Style;
Копировать Код
Public Property Style As DatabaseServices.ObjectId
 Возвращает
 Возвращает идентификатор стиля. Тип DatabaseServices.ObjectId.
 Описание
 Свойство представляет идентификатор объекта MLineStyle, который определяет стиль данного объекта MLine.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Mline, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!