Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Ray2d.Set
 Послать отзыв
 Метод переопределяет точку начала данного луча и точку, задающую его направление.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Set( Point2d point1, Point2d point2 );
Копировать Код
Public Sub Set( point1 As Point2d, point2 As Point2d )
 Параметры
 Параметры
 Описание
 point1
 Новая точка начала луча. Тип Point2d.
 point2
 Новая точка, определяющая направление луча. Тип Point2d. Должна отличаться от точки point1.
 Описание
 Метод переопределяет данный луч, используя новую точку начала point1 и новую точку point2, задающую направление луча.
 Ссылки
 Teigha.Geometry.Ray2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!