Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.DeleteContent
 Послать отзыв
 Метод предназначен для удаления из заданной ячейки элемента содержимого с указанным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void DeleteContent( int row, int column, int contentIndex );
Копировать Код
Public virtual Sub DeleteContent( row As Integer, column As Integer, contentIndex As Integer )
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 contentIndex
 Индекс элемента содержимого ячейки. Индекс должен быть больше или равен нулю и меньше количества элементов содержимого ячейки.
 col
 Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
 Описание
 Метод предназначен для удаления из заданной ячейки элемента содержимого с указанным индексом.
 Замечания
 Для получения того же результата предпочтительнее использовать метод Table.Cells[row,column].Contents.RemoveAt.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!