Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Solid3d.CreateSweptSolid
 Послать отзыв
 Метод создает трехмерное твердое тело вытягиванием конкретной грани указанного объекта чертежа по заданной траектории.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void CreateSweptSolid( ref Entity sweepEntity, SubentityId faceSubEntityId, ref Entity pathEntity, ref SweepOptions sweepOptions );
Копировать Код
Public Overridable Sub CreateSweptSolid( ByRef sweepEntity As Entity, faceSubEntityId As SubentityId, ByRef pathEntity As Entity, ByRef sweepOptions As SweepOptions )
 Параметры
 Параметры
 Описание
 sweepEntity
 Объект чертежа, которому принадлежит вытягиваемая грань. Тип Entity.
 faceSubEntityId
 Идентификатор подобъекта грани. Тип SubentityId.
 pathEntity
 Объект кривой, которая представляет траекторию вытягивания грани. Тип Entity.
 sweepOptions
 Настройки операции вытягивания по траектории. Тип SweepOptions.
 Описание
 Метод создает трехмерное твердое тело вытягиванием конкретной грани указанного объекта чертежа по заданной траектории. Реализован только в среде пространственного моделирования.
 Замечания
 По умолчанию объект SweepOptions использует для выравнивания опцию SweepOptionsAlignOption.NoAlignment. Значение выравнивания SweepOptionsAlignOption.kAlignSweepEntityToPath следует задавать до вызова этого метода.
 Ссылки
 Teigha.DatabaseServices.Solid3d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!