Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SweepOptions.TwistAngle
 Послать отзыв
 Свойство TwistAngle представляет угол кручения профиля по мере его вытягивания по траектории.
 Синтаксис
C#
Visual Basic
Копировать Код
public double TwistAngle;
Копировать Код
Public ReadOnly Property TwistAngle As Double
 Возвращает
 Возвращает угол кручения профиля. Тип double.
 Описание
 Свойство TwistAngle представляет угол кручения профиля по мере его вытягивания по траектории.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.SweepOptions, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!