Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocAction.DependentObjectCloned
 Послать отзыв
 Метод вызывается в момент обратного вызова постоянного реактора AssocDependency.Copied() принадлежащей действию зависимости.
 Синтаксис
C#
Visual Basic
Копировать Код
public void DependentObjectCloned( ref AssocDependency dependency, ref DBObject dbObj, ref DBObject newObj );
Копировать Код
Public Sub DependentObjectCloned( ByRef dependency As AssocDependency, ByRef dbObj As DBObject, ByRef newObj As DBObject )
 Параметры
 Параметры
 Описание
 dependency
 Зависимость на клонированном объекте DBObject. Тип AssocDependency.
 dbObj
 Исходный объект. Тип DBObject.
 newObj
 Только что созданный клон. Тип DBObject.
 Описание
 Метод вызывается в момент обратного вызова постоянного реактора AssocDependency.Copied() принадлежащей действию зависимости. Он уведомляет действие-владельца о том, что клонирование объекта, от которого зависит действие, завершено. Клонирование может быть лишь поверхностным (shallow), т.е. не обязательно глубоким (deep) или блочным.
 Если действие владеет объектом AssocActionBody, который переопределяет обратный вызов dependentObjectClonedOverride(), вызывается именно этот обратный вызов.
 Ссылки
 Teigha.DatabaseServices.AssocAction, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!