Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство LinetypeTableRecord.NumDashes
 Послать отзыв
 Синтаксис
C#
Visual Basic
public int NumDashes;
Public Property NumDashes() As Integer
 Описание
 Обеспечивает доступ к количеству штрихов в LinetypeTableRecord.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.LinetypeTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!