Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CellContentsCollection.Move
 Послать отзыв
 Метод перемещает указанный по индексу элемент коллекции в позицию с другим индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Move( int fromIndex, int toIndex );
Копировать Код
Public Sub Move( fromIndex As Integer, toIndex As Integer )
 Параметры
 Параметры
 Описание
 fromIndex
 Исходный индекс элемента коллекции. Тип int.
 toIndex
 Новый индекс элемента коллекции. Тип int.
 Описание
 Метод позволяет переместить элемент коллекции с индексом fromIndex в позицию с индексом toIndex.
 Ссылки
 Teigha.DatabaseServices.CellContentsCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!