Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector2d.IsParallelTo
 Послать отзыв
 Метод позволяет проверить, параллелен ли входной вектор данному вектору.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsParallelTo( Vector2d vector );
Копировать Код
Public Function IsParallelTo( vector As Vector2d ) As Boolean
 Параметры
 Параметры
 Описание
 vector
 Проверяемый вектор. Тип Vector2d.
 Возвращает
 Возвращает true, если в пределах используемой точности входной вектор можно считать параллельным данному вектору. В противном случае возвращает false.
 Описание
 Метод позволяет проверить, параллелен ли входной вектор vector данному вектору. Реализация использует вызов метода Vector2d.IsParallelTo(Vector2d vector, Tolerance tolerance) с точностью по умолчанию Tolerance.EqualVector.
 Ссылки
 Teigha.Geometry.Vector2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!