Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.XrefGraphNode.XrefStatus
 Послать отзыв
 Свойство XrefStatus представляет состояние данного узла.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.XrefStatus XrefStatus;
Копировать Код
Public ReadOnly Property XrefStatus As DatabaseServices.XrefStatus
 Возвращает
 Возвращает состояние данного узла. Перечисление DatabaseServices.XrefStatus.
 Описание
 Свойство XrefStatus представляет состояние данного узла.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.XrefGraphNode, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!