Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CircularArc2d.Create
 Послать отзыв
 Метод предназначен для создания объекта CircularArc2d на основе переданного указателя.
 Синтаксис
C#
Visual Basic
Копировать Код
public static CircularArc2d Create( IntPtr unmanagedPointer, bool autoDelete );
Копировать Код
Public Shared Function Create( unmanagedPointer As IntPtr, autoDelete As Boolean ) As CircularArc2d
 Параметры
 Параметры
 Описание
 unmanagedPointer
 Входной неуправляемый указатель на объект, на основе которого создается данный объект. Тип IntPtr.
 autoDelete
 Входной флаг, который указывает, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.
 Возвращает
 Возвращает созданный объект. Тип CircularArc2d.
 Описание
 Метод предназначен для создания объекта CircularArc2d на основе переданного указателя.
 Ссылки
 Teigha.Geometry.CircularArc2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!