Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CurveCurveIntersector2d.Curve1
 Послать отзыв
 Свойство Curve1 представляет указатель на первую кривую в данном объекте.
 Синтаксис
C#
Visual Basic
Копировать Код
public Geometry.Curve2d Curve1;
Копировать Код
Public ReadOnly Property Curve1 As Geometry.Curve2d
 Возвращает
 Возвращает первую кривую. Тип Geometry.Curve2d.
 Описание
 Свойство Curve1 представляет указатель на первую кривую в данном объекте.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.CurveCurveIntersector2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!