Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DxfFiler.WriteUInt32
 Послать отзыв
 Метод записывает в данный объект Filer указанное 32-разрядное целое число без знака (unsigned int).
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract void WriteUInt32( DxfCode opCode, unsigned int value );
Копировать Код
Public MustOverride Sub WriteUInt32( opCode As DxfCode, value As unsigned int )
 Параметры
 Параметры
 Описание
 opCode
 Групповой код DXF. Тип DxfCode.
 value
 Значение, которое следует записать. Тип unsigned int.
 Описание
 Метод записывает в данный объект Filer указанные групповой код DXF и 32-разрядное целое число без знака (unsigned int).
 Ссылки
 Teigha.DatabaseServices.DxfFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!