Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 BlockTableRecord.IsLayout
 Послать отзыв
 Признак того, что данное определение блока описывает лист.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsLayout { get; }
Копировать Код
Public ReadOnly Property IsLayout As Boolean
 Возвращает
 Возвращает тип данных bool:
true - блок представляет собой лист или пространство модели;
false - остальные блоки.
 Описание
 Признак того, что данное определение блока описывает лист.
 Листом является как пространство модели, так и остальные листы.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.BlockTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!