Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Sphere
 Послать отзыв
 Класс Sphere представляет сферическую поверхность.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Geometry::Entity3d Teigha::Geometry::Surface Teigha::Geometry::Sphere
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdGeSphere")] public sealed class Sphere : Surface
Копировать Код
<Wrapper("OdGeSphere")> Public NotInheritable Class Sphere Inherits Surface
 Описание
 Класс Sphere представляет сферическую поверхность.
 Объект сферы описывается ее центром center и радиусом radius, а также двумя векторами northAxis и refAxis. Вектор northAxis определяет направление от центра сферы к ее северному полюсу. Вектор refAxis, ортогональный вектору northAxis, определяет положение нулевого меридиана.
 Широта определяется параметром U, который для замкнутой сферы по умолчанию определен на интервале [-PI/2, +PI/2]. Нижняя граница соответствует южному полюсу, ноль соответствует экватору, а верхняя граница соответствует северному полюсу.
 Долгота определяется параметром V, который для замкнутой сферы по умолчанию определен на интервале [-PI, +PI). Нулевое значение V соответствует меридиану, положение которого определяется вектором refAxis этой сферы. Положительное направление изменения параметра V определяется правилом правой руки при вращении вдоль вектора northAxis.
 Поверхность полной сферы является периодической по V с периодом 2*PI.
 Всякая комбинация двух параметрических интервалов [umin, umax] и [vmin, vmax] определяет четырехсторонний участок сферы, ограниченный двумя меридиональными и двумя широтными дугами. Здесь применяются следующие ограничения:
umin < umax и |umin - umax| <= PI.
vmin < vmax и |vmin - vmax| <= 2*PI.
 Методы
 Конструкторы
 Teigha.Geometry.Sphere
 Имя
 Описание
 Sphere
 Это обзор перегрузок Sphere.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Geometry.Entity3d
 Имя
 Описание
 Entity3d Методы
 Ниже перечислены методы класса Entity3d.
 Teigha.Geometry.Surface
 Имя
 Описание
 Surface Методы
 Ниже перечислены методы класса Surface.
 Surface Свойства
 Ниже перечислены свойства класса Surface.
 Teigha.Geometry.Sphere
 Имя
 Описание
 Sphere Методы
 Ниже перечислены методы класса Sphere.
 Sphere Свойства
 Ниже перечислены свойства класса Sphere.
 Ссылки
 Sphere Конструктор, Sphere Методы, Sphere Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!