Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.KnotCollection.NumberOfIntervals
 Послать отзыв
 Свойство NumberOfIntervals представляет количество узловых интервалов, связанных с данной коллекцией.
 Синтаксис
C#
Visual Basic
Копировать Код
public int NumberOfIntervals;
Копировать Код
Public ReadOnly Property NumberOfIntervals As Integer
 Возвращает
 Возвращает количество узловых интервалов. Тип int.
 Описание
 Свойство NumberOfIntervals представляет количество узловых интервалов, связанных с данной коллекцией.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.KnotCollection, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!