Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DwgFiler.WriteString
 Послать отзыв
 Метод предназначен для записи в этот Filer указанной строки.
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract void WriteString( ref String value );
Копировать Код
Public MustOverride Sub WriteString( ByRef value As String )
 Параметры
 Параметры
 Описание
 value
 Записываемое в Filer значение. Тип String.
 Описание
 Метод предназначен для записи в этот Filer указанной строки.
 Ссылки
 Teigha.DatabaseServices.DwgFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!