Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Graph.DelNode
 Послать отзыв
 Метод предназначен для полного удаления конкретного узла из данного графа.
 Синтаксис
C#
Visual Basic
Копировать Код
public void DelNode( ref GraphNode nodeToDelete );
Копировать Код
Public Sub DelNode( ByRef nodeToDelete As GraphNode )
 Параметры
 Параметры
 Описание
 nodeToDelete
 Удаляемый узел. Тип GraphNode.
 Описание
 Метод удаляет указанный узел nodeToDelete из данного графа. При этом удаляются также все существующие в других узлах ссылки на узел nodeToDelete.
 Ссылки
 Teigha.DatabaseServices.Graph, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!