Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 BlockTableRecord.Copy
 Послать отзыв
 Метод предназначен для быстрого создания копии определения блока.
 Синтаксис
C#
Visual Basic
Копировать Код
protected internal virtual BlockTableRecord Copy();
Копировать Код
Protected Friend Overridable Function Copy() As BlockTableRecord
 Возвращает
 Тип данных BlockTableRecord.
 Описание
 Метод предназначен для быстрого создания копии определения блока.
 Ссылки
 Teigha.DatabaseServices.BlockTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!