Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeader.SetLeaderLineWeight
 Послать отзыв
 Метод позволяет задать новое значение толщины (вес) линии выноски с указанным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetLeaderLineWeight( int leaderLineIndex, DatabaseServices.LineWeight leaderLineWeight );
Копировать Код
Public Sub SetLeaderLineWeight( leaderLineIndex As Integer, leaderLineWeight As DatabaseServices.LineWeight )
 Параметры
 Параметры
 Описание
 leaderLineIndex
 Индекс линии выноски. Тип int.
 leaderLineWeight
 Новое значение толщины (вес) линии выноски из перечисления DatabaseServices.LineWeight.
 Описание
 Метод позволяет задать новое значение толщины (вес) линии выноски с указанным индексом.
 Ссылки
 Teigha.DatabaseServices.MLeader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!