Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.HostApplicationServices.WorkingDatabase
 Послать отзыв
 Свойство предоставляет доступ к текущей активной базе данных.
 Синтаксис
C#
Visual Basic
Копировать Код
public static Database WorkingDatabase;
Копировать Код
Public Shared Property WorkingDatabase As Database
 Возвращает
 Возвращает активную базу данных. Тип Database.
 Описание
 Свойство предоставляет доступ к текущей активной базе данных.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.HostApplicationServices, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!