Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SubDMesh.SubDividedNormalArray
 Послать отзыв
 Свойство представляет нормали во всех вершинах данного объекта SubDMash с учетом степени сглаженности.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3dCollection SubDividedNormalArray;
Копировать Код
Public Property SubDividedNormalArray() As Vector3dCollection
 Возвращает
 Возвращает массив нормалей, тип Vector3dCollection.
 Описание
 Свойство представляет нормали во всех вершинах данного объекта SubDMash с учетом степени сглаженности.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.SubDMesh, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!