Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Polyline.GetLineSegmentAt
 Послать отзыв
 Синтаксис
C#
Visual Basic
public LineSegment3d GetLineSegmentAt(int index);
Public Function GetLineSegmentAt(index As Integer) As LineSegment3d
 Параметры
 Параметры
 Описание
 index
 Индекс (отсчитываемый от 0) вершины для начала сегмента
 Описание
 Если сегмент с вершиной с номером, заданным index, является линией, то метод создает 3D копию сегмента с информацией выбранного сегмента полилинии в мировых координатах.
 Ссылки
 Teigha.DatabaseServices.Polyline, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!