Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AbstractViewportData
 Послать отзыв
 Класс AbstractViewportData является базовым классом классов расширения протокола для объектов Viewport и ViewportTableRecord.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::DatabaseServices::AbstractViewPE Teigha::DatabaseServices::AbstractViewportData
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdDbAbstractViewportData")] public class AbstractViewportData : AbstractViewPE
Копировать Код
<Wrapper("OdDbAbstractViewportData")> Public Class AbstractViewportData Inherits AbstractViewPE
 Описание
 Класс AbstractViewportData является базовым классом классов расширения протокола для объектов Viewport и ViewportTableRecord.
 Методы
 Конструкторы
 Teigha.DatabaseServices.AbstractViewPE
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 AbstractViewPE
 Конструктор класса AbstractViewPE. Создает экземпляр класса на основе указанного видового экрана. (Унаследован от AbstractViewPE)
 Teigha.DatabaseServices.AbstractViewportData
 Имя
 Описание
 AbstractViewportData
 Конструктор класса AbstractViewportData. Создает экземпляр класса на основе указанного видового экрана.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.DatabaseServices.AbstractViewPE
 Имя
 Описание
 AbstractViewPE Методы
 Ниже перечислены методы класса AbstractViewPE.
 AbstractViewPE Свойства
 Ниже перечислены свойства класса AbstractViewPE.
 Teigha.DatabaseServices.AbstractViewportData
 Имя
 Описание
 AbstractViewportData Методы
 Ниже перечислены методы класса AbstractViewportData.
 AbstractViewportData Свойства
 Ниже перечислены свойства класса AbstractViewportData.
 Ссылки
 AbstractViewportData Методы, AbstractViewportData Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!