Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SubDMesh.VertexTextureArray
 Послать отзыв
 Свойство представляет доступ к массиву координат текстур.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3dCollection VertexTextureArray;
Копировать Код
Public Property VertexTextureArray() As Point3dCollection
 Возвращает
 Возвращает коллекцию Point3dCollection.
 Описание
 Свойство представляет доступ к массиву координат текстур.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.SubDMesh, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!