Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.SurfaceSurfaceIntersector.GetType
 Послать отзыв
 Метод предоставляет тип пересечения c указанным индексом. В текущей версии не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public SurfaceSurfaceIntersectorType GetType( int number );
Копировать Код
Public Function GetType( number As Integer ) As SurfaceSurfaceIntersectorType
 Параметры
 Параметры
 Описание
 number
 Индекс пересечения. Индексация начинается с нуля. Тип int.
 Возвращает
 Возвращает значение из перечисления SurfaceSurfaceIntersectorType, которое характеризует тип пересечения:
Transverse — некасательное пересечение;
Tangent — касательное пересечение с сонаправленными нормалями двух поверхностей в любой точке в пределах компонента;
AntiTangent — касательное пересечение с противонаправленными нормалями двух поверхностей в любой точке в пределах компонента.
 Описание
 Метод предоставляет тип пересечения c указанным индексом. В текущей версии не реализован.
 Замечания
 Метод выбрасывает исключения kXXUnknown, если данный объект пересечения не инициализирован, и kXXIndexOutOfRange, если указанный методу индекс является недействительным.
 Ссылки
 Teigha.Geometry.SurfaceSurfaceIntersector, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!