Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MlineStyle.Reset
 Послать отзыв
 Метод предназначен для реинициализации данного объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Reset();
Копировать Код
Public Sub Reset()
 Описание
 Метод предназначен для реинициализации данного объекта.
 На выходе из метода свойства объекта MlineStyle имеют следующие значения:
 Свойство
 Значение
 Name
 Пустая строка
 Description
 Пустая строка
 FillColor
 0
 StartAngle
 90°
 EndAngle
 90°
 Elements
 Пустой список
 Ссылки
 Teigha.DatabaseServices.MlineStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!