Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 DimStyleTableRecord.DimfxlenOn
 Послать отзыв
 Свойство отвечает за переключение между выносными линиями фиксированной и нефиксированной длины.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual bool DimfxlenOn { get; set; }
Копировать Код
Public Overridable Property DimfxlenOn As Boolean
 Возвращает
 Возвращает тип данных bool:
true – выносные линии фиксированной длины;
false – выносные линии нефиксированной длины.
 Описание
 В свойстве хранится признак использования фиксированной длины выносных линий в виде типа данных bool. Возможны следующие значения:
true – выносные линии фиксированной длины;
false – выносные линии нефиксированной длины.
 Свойство также доступно через системную переменную DIMFXLON и пользовательское меню в окне изменения/создания размерного стиля:
  При изменении системной переменной DIMFXLON будет создан новый размерный стиль под названием <переопределение> на основе текущего с новым значением DIMFXLON.
 Условия
 Чтение и запись.
 Пример
 Пример изменения признака использования фиксированной длины выносных линий (значения свойства DimfxlenOn) через .NET API приведен в примере к описанию свойства Dimfxlen.
 Ссылки
 Teigha.DatabaseServices.DimStyleTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!