Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve3d.BoundBlock
 Послать отзыв
 Свойство позволяет получить ориентированный граничный бокс для данной кривой.
 Синтаксис
C#
Visual Basic
Копировать Код
public BoundBlock3d BoundBlock;
Копировать Код
Public Property BoundBlock() As BoundBlock3d
 Возвращает
 Возвращает ориентированный граничный бокс для данной кривой. Тип BoundBlock3d.
 Описание
 Свойство позволяет получить ориентированный граничный бокс для данной кривой. Ребра такого бокса не обязаны быть параллельными координатным осям.
 Замечания
 Ориентированный граничный бокс представляет собой прямоугольный параллелепипед минимального объема, в котором целиком помещается целевой геометрический объект. Ориентация направленного ограничивающего бокса определяется пространственной ориентацией геометрического объекта, таким образом, ребра этого бокса не обязаны быть параллельными координатным осям.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.Curve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!