Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Ole2Frame.OleObject
 Послать отзыв
 Свойство предоставляет доступ к объекту MFC, который в данный момент используется объектом Ole2Frame.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual Object OleObject;
Копировать Код
Public Overridable ReadOnly Property OleObject As Object
 Возвращает
 Возвращает используемый объект MFC. Тип Object.
 Описание
 Свойство предоставляет доступ к объекту MFC, который в данный момент используется объектом Ole2Frame.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Ole2Frame, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!