Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Surface.ParameterOf
 Послать отзыв
 Метод вычисляет параметрическую точку (U, V), которая в параметрическом пространстве поверхности представляет указанную 3D-точку на поверхности в пространстве моделирования. Используется точность по умолчанию.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point2d ParameterOf( Point3d point );
Копировать Код
Public Function ParameterOf( point As Point3d ) As Point2d
 Параметры
 Параметры
 Описание
 point
 Входная точка на поверхности, для которой требуется вычислить соответствующую параметрическую 2D-точку. Тип Point3d.
 Возвращает
 Возвращает 2D-точку в параметрическом пространстве, которая соответствует входной 3D-точке point в пространстве моделирования. Тип Point2d.
 Описание
 Метод вычисляет параметрическую точку (U, V), которая в параметрическом пространстве поверхности представляет указанную 3D-точку на поверхности в пространстве моделирования. Работу выполняет вызов метода Surface.ParameterOf(Point3d point, Tolerance tolerance) с точностью по умолчанию Tolerance.Global.
 Замечания
 Входная точка point обязана находиться на данной поверхности. Чтобы в этом убедиться, используйте метод IsOn().
 Ссылки
 Teigha.Geometry.Surface, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!