Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.ExternalBoundedSurface.IsPlane
 Послать отзыв
 Свойство IsPlane позволяет проверить, является ли неограниченная базовая поверхность данного объекта плоскостью.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsPlane;
Копировать Код
Public ReadOnly Property IsPlane As Boolean
 Возвращает
 Возвращает true, если базовая поверхность данного объекта является плоскостью. В противном случае возвращает false.
 Описание
 Свойство IsPlane определяет тип неограниченной базовой поверхности данного объекта и возвращает true, если она является плоскостью.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.ExternalBoundedSurface, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!