Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MeshFaceterData.FaceterMinUGrid
 Послать отзыв
 Свойство представляет минимальное значение параметра U для линий сети.
 Синтаксис
C#
Visual Basic
Копировать Код
public unsigned short FaceterMinUGrid;
Копировать Код
Public Property FaceterMinUGrid As unsigned short
 Возвращает
 Возвращает минимальное значение параметра U. Тип short.
 Описание
 Свойство представляет минимальное значение параметра U для линий сети.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MeshFaceterData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!