Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.GenerateLayout
 Послать отзыв
 Метод предназначен для обновления размера в соответствии с текущим размерным стилем. На данный момент не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public void GenerateLayout();
Копировать Код
Public Sub GenerateLayout()
 Описание
 Метод предназначен для обновления размера в соответствии с текущим размерным стилем, аналогично командам Dim, Update. Не реализован.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!