Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve2d.IsOn
 Послать отзыв
 Метод позволяет проверить, лежит ли указанная точка на данной кривой в пределах заданной точности.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsOn( Point2d point, Tolerance tolerance );
Копировать Код
Public Function IsOn( point As Point2d, tolerance As Tolerance ) As Boolean
 Параметры
 Параметры
 Описание
 point
 Проверяемая точка. Тип Point2d.
 tolerance
 Заданная точность проверки. Тип Tolerance.
 Возвращает
 Возвращает true, если точка point лежит на данной кривой в пределах точности tolerance. В противном случае возвращает false.
 Описание
 Метод позволяет проверить, лежит ли указанная точка на данной кривой в пределах заданной точности.
 Ссылки
 Teigha.Geometry.Curve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!