Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Attmode
 Послать отзыв
 Синтаксис
C#
Visual Basic
public int Attmode;
Public Property Attmode() As Integer
 Описание
 Возвращает или устанавливает текущее значение ATTMODE для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!