Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Делегат Teigha.DatabaseServices.BeginWblockSelectedObjectsEventHandler
 Послать отзыв
 This is type Teigha::DatabaseServices::BeginWblockSelectedObjectsEventHandler.
 Синтаксис
C#
Visual Basic
public delegate BeginWblockSelectedObjectsEventHandler();
Public Delegate Sub BeginWblockSelectedObjectsEventHandler()
 Ваши комментарии по поводу этого топика: Послать отзыв!