Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.UnderlayItem.Thumbnail
 Послать отзыв
 Свойство Thumbnail представляет изображение предварительного просмотра данного элемента.
 Синтаксис
C#
Visual Basic
Копировать Код
public Bitmap Thumbnail;
Копировать Код
Public ReadOnly Property Thumbnail As System.Drawing.Bitmap
 Возвращает
 Возвращает изображение предварительного просмотра элемента. Тип Bitmap.
 Описание
 Свойство Thumbnail представляет изображение предварительного просмотра данного элемента.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.UnderlayItem, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!