Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector3d.-
 Послать отзыв
 Оператор реализует операцию векторного вычитания.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d operator -( Vector3d a, Vector3d b );
Копировать Код
Public Operator -( a As Vector3d, b As Vector3d )
 Параметры
 Параметры
 Описание
 a
 Левый операнд. Тип Vector3d.
 b
 Правый операнд. Тип Vector3d.
 Возвращает
 Возвращает 3D-вектор, который получен вычитанием вектора b из вектора a. Тип Vector3d.
 Описание
 Оператор реализует операцию векторного вычитания вектора b из вектора a.
 Ссылки
 Teigha.Geometry.Vector3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!