Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Chamferc
 Послать отзыв
 Синтаксис
C#
Visual Basic
public double Chamferc;
Public Property Chamferc() As Double
 Описание
 Возвращает или устанавливает текущее значение CHAMFERC для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!