Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Point2d.-
 Послать отзыв
 Оператор вычитания класса Point2d. Реализует вычитание координат точки b из координат точки a.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector2d operator - ( Point2d a, Point2d b );
Копировать Код
Public Operator - ( a As Point2d, b As Point2d )
 Параметры
 Параметры
 Описание
 a
 Левый операнд. Тип Point2d.
 b
 Правый операнд. Тип Point2d.
 Возвращает
 Возвращает 2D-вектор, компоненты которого определяются разностями соответствующих координат точек a и b. Тип Vector2d.
 Описание
 Оператор вычитания класса Point2d. Реализует вычитание координат точки b из координат точки a. Результатом является 2D-вектор, компоненты которого определяются разностями соответствующих координат точек a и b.
 Ссылки
 Teigha.Geometry.Point2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!