Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SectionSettings.DestinationFile
 Послать отзыв
 Метод предоставляет имя файла, в котором сохраняется созданное сечение, если в опциях генерации выставлен флаг SectionGeneration.DestinationFile.
 Синтаксис
C#
Visual Basic
Копировать Код
public String DestinationFile( SectionType nSecType );
Копировать Код
Public Function DestinationFile( nSecType As SectionType ) As String
 Параметры
 Параметры
 Описание
 nSecType
 Входной тип создаваемого сечения из перечисления SectionType.
 Возвращает
 Возвращает имя файла, в котором сохраняется сечение. Тип String.
 Описание
 Метод предоставляет имя файла, в котором сохраняется созданное сечение, если в опциях генерации выставлен флаг SectionGeneration.DestinationFile.
 Ссылки
 Teigha.DatabaseServices.SectionSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!