Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GeoLocationData.BlockTableRecordId
 Послать отзыв
 Свойство обеспечивает доступ к идентификатору записи пространства модели в таблице блоков.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.ObjectId BlockTableRecordId;
Копировать Код
Public Property BlockTableRecordId As DatabaseServices.ObjectId
 Возвращает
 Возвращает запись пространства модели в таблице блоков. Тип DatabaseServices.ObjectId.
 Описание
 Свойство обеспечивает доступ к идентификатору ObjectId записи пространства модели в таблице блоков.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.GeoLocationData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!