Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.BoundaryRepresentation.Mesh2dFilter
 Послать отзыв
 Класс Mesh2dFilter представляет интерфейсный класс для фильтров 2D-сети.
 Иерархия классов
Teigha::BoundaryRepresentation::Mesh2dFilter
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("AcBrMesh2dFilter")] public class Mesh2dFilter : DisposableWrapper;
Копировать Код
<Wrapper("AcBrMesh2dFilter")> Public Class Mesh2dFilter Inherits DisposableWrapper
 Описание
 Класс Mesh2dFilter представляет интерфейсный класс для фильтров 2D-сети. Он определяет соответствие между объектами топологии и элементами управления 2D-сети, используемыми в качестве фильтров при генерации 2D-сети.
 Замечания
 Класс Mesh2dFilter реализован только в среде пространственного моделирования.
 Методы
 Конструкторы
 Имя
 Описание
 Mesh2dFilter
 Конструктор по умолчанию класса Mesh2dFilter.
 Топики
 Имя
 Описание
 Mesh2dFilter Методы
 Ниже перечислены методы класса Mesh2dFilter.
 Ссылки
 Mesh2dFilter Методы, Методы, Топики, Mesh2dFilter Методы
 Ваши комментарии по поводу этого топика: Послать отзыв!