Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Solid3d.ConvertToBrepAtSubentPaths
 Послать отзыв
 Метод позволяет преобразовать отдельные элементы истории построения параметризованного типа в простое граничное представление без параметрической информации или данных о типе. В текущей версии метод не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public void ConvertToBrepAtSubentPaths( ref FullSubentityPath[] paths );
Копировать Код
Public Sub ConvertToBrepAtSubentPaths( ByRef paths() As FullSubentityPath )
 Параметры
 Параметры
 Описание
 paths
 Массив элементов истории. Тип FullSubentityPath[].
 Описание
 Метод позволяет преобразовать отдельные элементы истории построения параметризованного типа в простое граничное представление без параметрической информации или данных о типе. В текущей версии метод не реализован.
 Ссылки
 Teigha.DatabaseServices.Solid3d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!