Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DrawOrderTable.GetFullDrawOrder
 Послать отзыв
 Метод предназначен для получения коллекции идентификаторов объектов в связанной записи таблицы блоков в DrawOrder, порядок в которой определяется данным объектом DrawOrderTable.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectIdCollection GetFullDrawOrder( unsigned char honorSortEntitiesMask );
Копировать Код
Public Function GetFullDrawOrder( honorSortEntitiesMask As unsigned char ) As ObjectIdCollection
 Параметры
 Параметры
 Описание
 honorSortEntitiesMask
 Маска порядка сортировки. Тип unsigned char. В текущей версии не используется.
 Возвращает
 Возвращает упорядоченную коллекцию идентификаторов объектов. Тип ObjectIdCollection.
 Описание
 Метод предназначен для получения коллекции идентификаторов объектов в связанной записи таблицы блоков в DrawOrder, порядок в которой определяется данным объектом DrawOrderTable.
 Ссылки
 Teigha.DatabaseServices.DrawOrderTable, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!