Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotStyleDescriptor.Equals
 Послать отзыв
 Данный метод предназначен для проверки объекта на равенство другому объекту.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool Equals( ref Object unmanagedObjPtr );
Копировать Код
Public Function Equals( ByRef unmanagedObjPtr As Object ) As Boolean
 Параметры
 Параметры
 Описание
 unmanagedObjPtr
 объект, с которым выполняется проверка на идентичность.
 Возвращает
 Возвращает true, если данный объект идентичен объекту в аргументе, и false в противном случае.
 Описание
 Данный метод предназначен для проверки объекта на равенство другому объекту.
 Ссылки
 Teigha.DatabaseServices.PlotStyleDescriptor, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!