Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DwgFiler.WriteUInt16
 Послать отзыв
 Метод записывает в этот Filer указанное 16-разрядное целое число без знака (тип unsigned short).
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract void WriteUInt16( unsigned short value );
Копировать Код
Public MustOverride Sub WriteUInt16( value As unsigned short )
 Параметры
 Параметры
 Описание
 value
 Записываемое в Filer значение. Тип unsigned short.
 Описание
 Метод записывает в этот Filer указанное 16-разрядное целое число без знака (тип unsigned short).
 Ссылки
 Teigha.DatabaseServices.DwgFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!