Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve3dCollection.Insert
 Послать отзыв
 Метод вставляет в коллекцию указанный элемент в позицию с заданным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Insert( int index, ref Curve3d value );
Копировать Код
Public Sub Insert( index As Integer, ByRef value As Curve3d )
 Параметры
 Параметры
 Описание
 index
 Позиция вставляемого элемента в коллекции. Тип int.
 value
 Вставляемый в коллекцию элемент. Тип Curve3d.
 Описание
 Метод вставляет в коллекцию указанный элемент value в позицию с заданным индексом index.
 Ссылки
 Teigha.Geometry.Curve3dCollection, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!