Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SweepOptions.CheckPathCurve
 Послать отзыв
 Метод предоставляет возможность проверить, является ли указанный геометрический объект допустимым в качестве траектории вытягивания.
 Синтаксис
C#
Visual Basic
Копировать Код
public void CheckPathCurve( ref Entity pathEnt, bool displayErrorMessages );
Копировать Код
Public Sub CheckPathCurve( ByRef pathEnt As Entity, displayErrorMessages As Boolean )
 Параметры
 Параметры
 Описание
 pathEnt
 Кривая траектории. Тип Entity.
 displayErrorMessages
 Флаг, определяющий, следует ли отображать сообщения о выявленных ошибках. Тип bool.
 Описание
 Метод предоставляет возможность проверить, является ли указанный геометрический объект допустимым в качестве траектории вытягивания.
 Ссылки
 Teigha.DatabaseServices.SweepOptions, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!