Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AbstractViewTableRecord.CenterPoint
 Послать отзыв
 Свойство CenterPoint предоставляет доступ к центральной точке вида в координатах дисплея (DCS).
 Синтаксис
C#
Visual Basic
Копировать Код
public Point2d CenterPoint;
Копировать Код
Public Property CenterPoint As Point2d
 Возвращает
 Возвращает положение точки центра вида в координатах дисплея (DCS). Тип Point2d.
 Описание
 Свойство CenterPoint предоставляет доступ к центральной точке вида в системе координат дисплея (DCS).
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.AbstractViewTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!