Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FormattedTableData.Unmerge
 Послать отзыв
 Метод предназначен для отмены слияния ячеек в указанном диапазоне.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void Unmerge( ref CellRange range );
Копировать Код
Public Overridable Sub Unmerge( ByRef range As CellRange )
 Параметры
 Параметры
 Описание
 range
 Разбиваемый диапазон ячеек. Тип CellRange.
 Описание
 Метод предназначен для отмены слияния ячеек в указанном диапазоне.
 Ссылки
 Teigha.DatabaseServices.FormattedTableData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!