Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Database.GetDimensionStyleChildId
 Послать отзыв
 Синтаксис
C#
Visual Basic
public ObjectId GetDimensionStyleChildId(ref RXClass classDescriptor, ObjectId parentStyle);
Public Function GetDimensionStyleChildId(ByRef classDescriptor As RXClass, parentStyle As ObjectId) As ObjectId
 Параметры
 Параметры
 Описание
 classDescriptor
 Дескриптор класса размеров
 parentStyle
 Id родительского размерного стиля
 Описание
 Получив Id родительского размерного стиля и дескриптор размера класса, эта функция возвращает Id размерного стиля потомка, если он доступен, для данного типа размера.
 Возвращает полученный Id родительского размерного стиля, если Id размерного стиля потомка, относящийся к данному классу размера, не доступен.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!