Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор DatabaseIOEventArgs.DatabaseIOEventArgs
 Послать отзыв
 This is DatabaseIOEventArgs, a member of class DatabaseIOEventArgs.
 Синтаксис
C#
Visual Basic
internal DatabaseIOEventArgs(ref String filename);
Friend Sub New(ByRef filename As String)
 Ссылки
 Teigha.DatabaseServices.DatabaseIOEventArgs, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!