Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.BlockEnd.BlockEnd
 Послать отзыв
 Конструктор по умолчанию класса BlockEnd.
 Синтаксис
C#
Visual Basic
Копировать Код
public BlockEnd();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса BlockEnd.
 Ссылки
 Teigha.DatabaseServices.BlockEnd, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!