Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Polyline2d.Elevation
 Послать отзыв
 Свойство предоставляет доступ к знгачению уровня полилинии.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Elevation;
Копировать Код
Public Property Elevation() As double
 Возвращает
 Возвращает уровень полилинии, тип double.
 Описание
 Свойство предоставляет доступ к знгачению уровня полилинии.
 Уровень — это значение Z объектной системы координат (OCS) полилинии (то есть кратчайшее расстояние от начала мировой системы координат WCS до плоскости, в которой располагается полилиния).
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Polyline2d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!