Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Group.RemoveAt
 Послать отзыв
 Метод предназначен для удаления из группы объекта с указанным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public void RemoveAt( int index );
Копировать Код
Public Sub RemoveAt( index As Integer )
 Параметры
 Параметры
 Описание
 index
 Индекс удаляемого объекта группы. Тип int.
 Описание
 Метод предназначен для удаления из группы объекта с указанным индексом.
 Ссылки
 Teigha.DatabaseServices.Group, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!