Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Extents3d.AddBlockExtents
 Послать отзыв
 Метод предназначен для вычисления нового ограничивающего бокса, который включает в себя как текущий объект Extents3d, так и все объекты в указанном блоке.
 Синтаксис
C#
Visual Basic
Копировать Код
public void AddBlockExtents( ref BlockTableRecord pointerToBlockTableRecord );
Копировать Код
Public Sub AddBlockExtents( ByRef pointerToBlockTableRecord As BlockTableRecord )
 Параметры
 Параметры
 Описание
 pointerToBlockTableRecord
 Указатель на запись таблицы блоков. Тип BlockTableRecord.
 Описание
 Метод предназначен для вычисления нового ограничивающего бокса, который включает в себя как текущий объект Extents3d, так и все объекты в указанном блоке.
 Ссылки
 Teigha.DatabaseServices.Extents3d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!