Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FilerType
 Послать отзыв
 Данное перечисление определяет доступные типы файлеров.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum FilerType { BagFiler = 3, CopyFiler = 1, DeepCloneFiler = 6, FileFiler = 0, IdFiler = 7, IdXlateFiler = 4, PageFiler = 5, PurgeFiler = 8, UndoFiler = 2, WblockCloneFiler = 9 }
Копировать Код
Public Enum FilerType BagFiler = 3 CopyFiler = 1 DeepCloneFiler = 6 FileFiler = 0 IdFiler = 7 IdXlateFiler = 4 PageFiler = 5 PurgeFiler = 8 UndoFiler = 2 WblockCloneFiler = 9 End Enum
 Члены
 Члены
 Описание
 FileFiler
 Значение: 0. Файловый файлер.
 CopyFiler
 Значение: 1. Файлер копирования.
 UndoFiler
 Значение: 2. Файлер отмены изменений.
 BagFiler
 Значение: 3. BagFiler
 IdXlateFiler
 Значение: 4. Файлер трансляции идентификаторов.
 PageFiler
 Значение: 5. Страничный файлер.
 DeepCloneFiler
 Значение: 6. Файлер глубокого клонирования.
 IdFiler
 Значение: 7. Файлер идентификаторов.
 PurgeFiler
 Значение: 8. Файлер очистки.
 WblockCloneFiler
 Значение: 9. Файлер клонирования блоков.
 Описание
 Данное перечисление определяет доступные типы файлеров.
 Ваши комментарии по поводу этого топика: Послать отзыв!