Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.IdMapping.Add
 Послать отзыв
 Метод позволяет добавить указанный объект IdPair к данному объекту IdMapping.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Add( IdPair pairToAdd );
Копировать Код
Public Sub Add( pairToAdd As IdPair )
 Параметры
 Параметры
 Описание
 pairToAdd
 Добавляемая пара сопоставленных идентификаторов. Тип IdPair.
 Описание
 Метод позволяет добавить указанный объект IdPair к данному объекту IdMapping.
 Ссылки
 Teigha.DatabaseServices.IdMapping, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!