Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.UnderlayLayer.UnderlayLayer
 Послать отзыв
 Конструктор по умолчанию класса UnderlayLayer.
 Синтаксис
C#
Visual Basic
Копировать Код
public UnderlayLayer();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса UnderlayLayer.
 Ссылки
 Teigha.DatabaseServices.UnderlayLayer, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!