Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CellBorder.Color
 Послать отзыв
 Свойство Color представляет цвет границы ячейки.
 Синтаксис
C#
Visual Basic
Копировать Код
public Colors.Color Color;
Копировать Код
Public Property Color As Colors.Color
 Возвращает
 Возвращает цвет границы ячейки. Тип Colors.Color.
 Описание
 Свойство Color представляет цвет границы ячейки.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.CellBorder, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!