Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Событие Database.Disposed
 Послать отзыв
 Синтаксис
C#
Visual Basic
public event EventHandler Disposed;
Public Event Disposed As EventHandler
 Описание
 Событие показывает, что база данных будет удалена.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!