Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.EllipticalArc3d.EllipticalArc3d
 Послать отзыв
 Конструктор класса EllipticalArc3d. Создает эллипс или эллиптическую дугу с указанными центром, осями, радиусами, начальным и конечным углами.
 Синтаксис
C#
Visual Basic
Копировать Код
public EllipticalArc3d( Point3d center, Vector3d majorAxis, Vector3d minorAxis, double majorRadius, double minorRadius, double startAngle, double endAngle );
Копировать Код
Public Sub New( center As Point3d, majorAxis As Vector3d, minorAxis As Vector3d, majorRadius As Double, minorRadius As Double, startAngle As Double, endAngle As Double )
 Параметры
 Параметры
 Описание
 center
 Центр эллипса. Тип Point3d.
 majorAxis
 Большая ось эллипса. Тип Vector3d.
 minorAxis
 Малая ось эллипса. Тип Vector3d.
 majorRadius
 Большой радиус эллипса. Тип double.
 minorRadius
 Малый радиус эллипса. Тип double.
 startAngle
 Начальный угол эллиптической дуги (угловое смещение начальной точки дуги). Тип double.
 endAngle
 Конечный угол эллиптической дуги (угловое смещение конечной точки дуги). Тип double.
 Описание
 Конструктор класса EllipticalArc3d. Создает эллипс или эллиптическую дугу с указанными центром, большой и малой осями, большим и малым радиусами, начальным и конечным углами.
 Ссылки
 Teigha.Geometry.EllipticalArc3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!