Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MText.FlowDirection
 Послать отзыв
 Свойство представляет направление потока данного многострочного текста.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.FlowDirection FlowDirection;
Копировать Код
Public Property FlowDirection As DatabaseServices.FlowDirection
 Возвращает
 Возвращает направление потока текста. Перечисление DatabaseServices.FlowDirection.
 Описание
 Свойство представляет направление потока данного многострочного текста. Это направление, в котором текстовая строка следует от начала к своему концу.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MText, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!