Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Viewport.Transparent
 Послать отзыв
 Свойство Transparent позволяет определить, выставлен ли флаг прозрачности для данного видового экрана.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool Transparent;
Копировать Код
Public Property Transparent As Boolean
 Возвращает
 Возвращает true, если видовой экран прозрачный. В противном случае возвращает false.
 Описание
 Свойство Transparent позволяет определить, выставлен ли флаг прозрачности для данного видового экрана.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Viewport, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!