Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Entity.GetGripPointsAtSubentityPath(FullSubentityPath
 Послать отзыв
 Метод предназначен для создания или получения точек захвата (ручек) дочернего объекта текущего геометрического объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool GetGripPointsAtSubentityPath(FullSubentityPath subPath, GripDataCollection grips, double curViewUnitSize, int gripSize, Vector3d curViewDir, GetGripPointsFlags bitFlags);
Копировать Код
Public Function GetGripPointsAtSubentityPath(subPath As FullSubentityPath, grips As GripDataCollection, curViewUnitSize As Double, gripSize As Integer, curViewDir As Vector3d, bitFlags As GetGripPointsFlags) As bool
 Параметры
 Параметры
 Описание
 subPath
 Полный путь к дочернему объекту, для которого необходимо получить точки захвата. Тип FullSubentityPath
 grips
 Входной/выходной параметр. Коллекция, в которую добавляются точки захвата (ручки) указанного дочернего объекта. Коллекция может быть не пустой, поэтому новые ручки необходимо добавлять в конец коллекции. Тип GripDataCollection
 curViewUnitSize
 Размер одного единичного элемента чертежа в мировых координатах для текущего окна просмотра. Используется для корректного масштабирования ручек. Тип double
 gripSize
 Размер точки захвата в пикселях, используемый для определения области клика пользователя. Тип int
 curViewDir
 Направление обзора (вектор камеры), необходимое для правильной ориентации ручек относительно текущего вида. Тип Vector3d
 bitFlags
 Битовые флаги, задающие дополнительные параметры извлечения точек захвата. Тип GetGripPointsFlags
 Возвращает
 Возвращает тип данных bool: true, если метод успешно выполнен, и false, если реализация отсутствует или произошла ошибка.
 Описание
 Метод предоставляет информацию о точках управления (захваты/ручки) конкретного дочернего элемента (субобъекта) геометрического объекта, учитывая параметры отображения и настройки взаимодействия с пользователем.
 Ссылки
 Teigha.DatabaseServices.Entity, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!