Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Polyline.GetEndWidthAt
 Послать отзыв
 Синтаксис
C#
Visual Basic
public double GetEndWidthAt(int index);
Public Function GetEndWidthAt(index As Integer) As Double
 Параметры
 Параметры
 Описание
 index
 Индекс (отсчитываемый от 0) вершины
 Описание
 Возвращает величину ширины конца сегмента полилинии. Эта величина используется как величина ширины конца сегмента для всех вершин полилинии.
 Ссылки
 Teigha.DatabaseServices.Polyline, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!