Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Cell.ToolTip
 Послать отзыв
 Свойство обеспечивает доступ к подсказке, сохраненной в данной ячейке.
 Синтаксис
C#
Visual Basic
Копировать Код
public String ToolTip;
Копировать Код
Public Property ToolTip As String
 Возвращает
 Возвращает текст подсказки в ячейке. Тип String.
 Описание
 Свойство обеспечивает доступ к подсказке, сохраненной в данной ячейке.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Cell, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!