Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство TextStyleTableRecord.FileName
 Послать отзыв
 Синтаксис
C#
Visual Basic
public String FileName;
Public Property FileName() As String
 Описание
 Обеспечивает доступ к строке копии имени файла, указывающей на имя файла шрифта для данного текстового стиля.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.TextStyleTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!