Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.SplineEntity3d.StartPoint
 Послать отзыв
 Свойство StartPoint представляет точку сплайна с минимальным значением параметра. Не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d StartPoint;
Копировать Код
Public ReadOnly Property StartPoint As Point3d
 Возвращает
 Возвращает точку сплайна с минимальным значением параметра. Тип Point3d.
 Описание
 Свойство StartPoint представляет точку сплайна с минимальным значением параметра. Не реализовано.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.SplineEntity3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!