Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Sphere.Radius
 Послать отзыв
 Свойство Radius представляет текущее значение радиуса данной сферы.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Radius;
Копировать Код
Public Property Radius As Double
 Возвращает
 Возвращает текущее значение радиуса данной сферы. Тип double.
 Описание
 Свойство Radius представляет текущее значение радиуса данной сферы.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.Geometry.Sphere, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!