Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector3dCollection.Remove
 Послать отзыв
 Метод удаляет из коллекции первое вхождение указанного объекта Vector3d.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Remove( Vector3d value );
Копировать Код
Public Sub Remove( value As Vector3d )
 Параметры
 Параметры
 Описание
 value
 Удаляемый из коллекции объект. Тип Vector3d.
 Описание
 Метод удаляет из коллекции первое вхождение указанного объекта Vector3d.
 Ссылки
 Teigha.Geometry.Vector3dCollection, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!