Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.RotationAngle
 Послать отзыв
 Перечисление RotationAngle определяет допустимые углы поворота текста в ячейках таблицы.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum RotationAngle { Degrees000 = 0, Degrees090 = 1, Degrees180 = 2, Degrees270 = 3, DegreesUnknown = -1 }
Копировать Код
Public Enum RotationAngle Degrees000 = 0 Degrees090 = 1 Degrees180 = 2 Degrees270 = 3 DegreesUnknown = -1 End Enum
 Члены
 Члены
 Описание
 DegreesUnknown
 Значение: -1. Угол поворота текста неизвестен.
 Degrees000
 Значение: 0. Угол поворота 0 градусов.
 Degrees090
 Значение: 1. Угол поворота 90 градусов.
 Degrees180
 Значение: 2. Угол поворота 180 градусов.
 Degrees270
 Значение: 3. Угол поворота 270 градусов.
 Описание
 Перечисление RotationAngle определяет допустимые углы поворота текста в ячейках таблицы.
 Ваши комментарии по поводу этого топика: Послать отзыв!