Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Surface.VIsoLineDensity
 Послать отзыв
 Свойство VIsoLineDensity представляет плотность изолиний в направлении V, отображаемых при визуализации поверхности в каркасном режиме.
 Синтаксис
C#
Visual Basic
Копировать Код
public short VIsoLineDensity;
Копировать Код
Public Property VIsoLineDensity As Short
 Возвращает
 Возвращает плотность изолиний в направлении V. Тип short.
 Описание
 Свойство VIsoLineDensity представляет плотность изолиний в направлении V, отображаемых при визуализации поверхности в каркасном режиме.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Surface, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!