Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotStyleData
 Послать отзыв
 Структура PlotStyleData представляет данные для стиля печати.
 Иерархия классов
Teigha::DatabaseServices::PlotStyleData
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdPsPlotStyleData")] public struct PlotStyleData
Копировать Код
<Wrapper("OdPsPlotStyleData")> Public Structure PlotStyleData
 Описание
 Структура PlotStyleData представляет данные для объекта PlotStyle для одного цвета (или цвета объекта).
 Топики
 Имя
 Описание
 PlotStyleData Операторы
 Ниже перечислены операторы класса PlotStyleData.
 PlotStyleData Свойства
 Ниже перечислены свойства класса PlotStyleData.
 Ссылки
 PlotStyleData Операторы, PlotStyleData Свойства, Топики, PlotStyleData Операторы, PlotStyleData Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!