Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DxfFiler.ReadObjectId
 Послать отзыв
 Метод возвращает идентификатор объекта из текущего элемента этого объекта Filer.
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract ObjectId ReadObjectId();
Копировать Код
Public MustOverride Function ReadObjectId() As ObjectId
 Возвращает
 Возвращает идентификатор объекта. Тип ObjectId.
 Описание
 Метод возвращает идентификатор объекта из текущего элемента этого объекта Filer.
 Ссылки
 Teigha.DatabaseServices.DxfFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!