Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LinkedTableData.GetContentTypes
 Послать отзыв
 Метод позволяет получить тип первого элемента содержимого указанной ячейки.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual CellContentTypes GetContentTypes( int row, int column );
Копировать Код
Public Overridable Function GetContentTypes( row As Integer, column As Integer ) As CellContentTypes
 Параметры
 Параметры
 Описание
 row
 Индекс строки. Тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 column
 Индекс столбца. Тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице.
 Возвращает
 Возвращает тип первого элемента содержимого ячейки. Перечисление CellContentTypes.
 Описание
 Метод позволяет получить тип первого элемента содержимого указанной ячейки.
 Ссылки
 Teigha.DatabaseServices.LinkedTableData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!