Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 DimStyleTableRecord.Dimtp
 Послать отзыв
 Свойство отвечает за настройку верхнего предела допуска для размеров.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual double Dimtp { get; set; }
Копировать Код
Public Overridable Property Dimtp As Double
 Возвращает
 Возвращает тип данных double.
 Описание
 В свойстве хранится текущее значение верхнего предела допуска. В качестве значения свойства доступны вещественные числа.
 Свойство также доступно через системную переменную DIMTP и пользовательское меню в окне изменения/создания размерного стиля:
  При изменении системной переменной DIMTP будет создан новый размерный стиль под названием <переопределение> на основе текущего с новым значением DIMTP.
 Условия
 Чтение и запись.
 Пример
 Пример изменения верхнего предела допуска (значения свойства Dimtp) в размерном стиле Standard:
C#
 Копировать Код
public partial class Commands { [Teigha.Runtime.CommandMethod("DimtpChange")] public void DimtpStandardDimStyle() { // Получение ссылки на активный документ HostMgd.ApplicationServices.Document doc = HostMgd.ApplicationServices.Application.DocumentManager.MdiActiveDocument; // Получение ссылки на редактор документа HostMgd.EditorInput.Editor ed = doc.Editor; // Получение ссылки на базу данных документа Teigha.DatabaseServices.Database db = doc.Database; // Начало транзакции с базой данных документа using (Teigha.DatabaseServices.Transaction trans = db.TransactionManager.StartTransaction()) { // Открываем таблицу размерных стилей для чтения Teigha.DatabaseServices.DimStyleTable dimStyleTable = trans.GetObject(db.DimStyleTableId, Teigha.DatabaseServices.OpenMode.ForRead) as Teigha.DatabaseServices.DimStyleTable; // Находим в таблице размерных стилей ObjectId нужного стиля по его названию Teigha.DatabaseServices.ObjectId styleId = dimStyleTable["Standard"]; // Открываем таблицу размерного стиля для изменений Teigha.DatabaseServices.DimStyleTableRecord obj = trans.GetObject(styleId, Teigha.DatabaseServices.OpenMode.ForWrite) as Teigha.DatabaseServices.DimStyleTableRecord; if (obj.Dimtol == false) obj.Dimtol = true; ed.WriteMessage($"nDimtp before: {obj.Dimtp}"); // Изменяем верхнюю границу допуска obj.Dimtp = 0.5; ed.WriteMessage($"nDimtp after: {obj.Dimtp}"); trans.Commit(); } } }
 Результат работы команды DimtpChange:
 Было:
 Стало:
 Ссылки
 Teigha.DatabaseServices.DimStyleTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!