Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GeometryOverrule
 Послать отзыв
 Абстрактный класс Teigha.DatabaseServices.GeometryOverrule определяет связанные с геометрией методы объектных переопределений.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::Runtime::Overrule Teigha::DatabaseServices::GeometryOverrule
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdDbGeometryOverrule")] public class GeometryOverrule : Overrule;
Копировать Код
<Wrapper("OdDbGeometryOverrule")> Public Class GeometryOverrule Inherits Overrule
 Описание
 Абстрактный класс Teigha.DatabaseServices.GeometryOverrule определяет связанные с геометрией методы объектных переопределений.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.Runtime.Overrule
 Имя
 Описание
 Overrule Методы
 Ниже перечислены методы класса Overrule.
 Overrule Свойства
 Ниже перечислены свойства класса Overrule.
 Teigha.DatabaseServices.GeometryOverrule
 Имя
 Описание
 GeometryOverrule Методы
 Ниже перечислены методы класса GeometryOverrule.
 Ссылки
 GeometryOverrule Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!