Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.EllipticalCone.AxisOfSymmetry
 Послать отзыв
 Свойство AxisOfSymmetry представляет направление оси симметрии данного конуса.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d AxisOfSymmetry;
Копировать Код
Public ReadOnly Property AxisOfSymmetry As Vector3d
 Возвращает
 Возвращает направляющий вектор оси симметрии конуса. Тип Vector3d.
 Описание
 Свойство AxisOfSymmetry представляет направление оси симметрии данного эллиптического конуса.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.EllipticalCone, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!