Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeaderStyle.EnableDogleg
 Послать отзыв
 Свойство позволяет контролировать отображение полки на выносной линии мультивыноски.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool EnableDogleg;
Копировать Код
Public Property EnableDogleg As Boolean
 Возвращает
 Возвращает true, если полка отображается. В противном случае возвращает false.
 Описание
 Свойство позволяет контролировать отображение полки на выносной линии мультивыноски.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MLeaderStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!