Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AbstractViewPE.ViewOffset
 Послать отзыв
 Свойство ViewOffset представляет вектор смещения для вида.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector2d ViewOffset;
Копировать Код
Public ReadOnly Property ViewOffset As Vector2d
 Возвращает
 Возвращает вектор смещения для вида. Тип Vector2d.
 Описание
 Свойство ViewOffset представляет вектор смещения для вида.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.AbstractViewPE, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!