Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Point2dCollection.Add
 Послать отзыв
 Метод добавляет в коллекцию указанный объект Point2d.
 Синтаксис
C#
Visual Basic
Копировать Код
public int Add( Point2d p );
Копировать Код
Public Function Add( p As Point2d ) As Integer
 Параметры
 Параметры
 Описание
 p
 Входной объект для добавления в коллекцию. Тип Point2d.
 Возвращает
 Возвращает количество элементов в коллекции после добавления объекта p. Тип int.
 Описание
 Метод добавляет в коллекцию новый элемент, используя указанный объект Point2d.
 Ссылки
 Teigha.Geometry.Point2dCollection, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!