Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.LineSegment3d.BaryComb
 Послать отзыв
 Метод вычисляет позицию точки на коллинеарной сегменту прямой, которая определяется средневзвешенным значением координат начальной и конечной точек данного сегмента в зависимости от указанного значения весового коэффициента.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d BaryComb( double blendCoefficient );
Копировать Код
Public Function BaryComb( blendCoefficient As Double ) As Point3d
 Параметры
 Параметры
 Описание
 blendCoefficient
 Коэффициент, определяющий положение средневзвешенной точки. Тип double.
 Возвращает
 Возвращает средневзвешенную точку. Тип Point3d. Возможны следующие варианты положения этой точки.
 blendCoefficient
 Возвращаемая позиция
 0
 Начальная точка.
 1
 Конечная точка.
 0.5
 Середина линейного сегмента.
 0 - 1
 Промежуточная точка на этом сегменте.
 < 0 или > 1
 Точка лежит вне сегмента, но на коллинеарной ему бесконечной прямой.
 Описание
 Метод вычисляет позицию точки на коллинеарной сегменту прямой, которая определяется средневзвешенным значением координат начальной и конечной точек данного сегмента в зависимости от значения коэффициента blendCoefficient.
 Ссылки
 Teigha.Geometry.LineSegment3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!