Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Filters.Index.LastUpdatedAtU
 Послать отзыв
 Свойство LastUpdatedAtU предоставляет доступ к временной метке последнего обновления данного индекса по шкале всемирного времени (UT).
 Синтаксис
C#
Visual Basic
Копировать Код
public DateTime LastUpdatedAtU;
Копировать Код
Public Property LastUpdatedAtU As Date
 Возвращает
 Возвращает временную метку последнего обновления индекса по шкале всемирного времени (UT). Тип DateTime.
 Описание
 Свойство LastUpdatedAtU предоставляет доступ к временной метке последнего обновления данного индекса по шкале всемирного времени (UT).
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Filters.Index, Teigha.DatabaseServices.Filters
 Ваши комментарии по поводу этого топика: Послать отзыв!