Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.IsAutoScale
 Послать отзыв
 Метод позволяет определить, установлен ли флаг автоматического вычисления масштаба и точки вставки содержимого блока при помещении его в указанную ячейку.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual bool IsAutoScale( int row, int col );
Копировать Код
Public virtual Function IsAutoScale( row As Integer, col As Integer ) As Boolean
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 col
 Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
 Возвращает
 Возвращает true в случае, если в указанной ячейке выставлен флаг автоматического вычисления масштаба и точки вставки.
 Описание
 Метод позволяет определить, установлен ли флаг автоматического вычисления масштаба и точки вставки содержимого блока при помещении его в указанную ячейку.
 Замечания
 Для получения того же результата предпочтительнее использовать Table.Cells[row,column].Contents[i].IsAutoScale.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!