Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.Dimjogang
 Послать отзыв
 Свойство задает или возвращает угол излома размерных линий в радиусных размерах с изломом.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Dimjogang;
Копировать Код
Public Property Dimjogang As Double
 Возвращает
 Возвращает угол излома радиусной размерной линии. Тип double.
 Описание
 Свойство задает или возвращает угол излома размерных линий в радиусных размерах с изломом.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!