Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Solid3d.CreateSphere
 Послать отзыв
 Метод создает сферу заданного радиуса с центром в начале мировой системы координат.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void CreateSphere( double radius );
Копировать Код
Public Overridable Sub CreateSphere( radius As Double )
 Параметры
 Параметры
 Описание
 radius
 Радиус создаваемой сферы. Тип double. Значение не может быть меньше 1e-6.
 Описание
 Метод создает сферу заданного радиуса с центром в начале мировой системы координат (WCS).
 Ссылки
 Teigha.DatabaseServices.Solid3d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!