Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Point3dCollection.Insert
 Послать отзыв
 Метод позволяет вставить точку в коллекцию по указанному индексу.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Insert( int index, Point3d p );
Копировать Код
Public Sub Insert( index As Integer, p As Point3d )
 Параметры
 Параметры
 Описание
 index
 Индекс для вставки нового элемента коллекции. Тип int.
 value
 Вставляемая в коллекцию точка. Тип Point3d.
 Описание
 Метод вставляет в коллекцию точку p по указанному индексу index. Индексы в коллекции начинаются с нуля.
 Ссылки
 Teigha.Geometry.Point3dCollection, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!