Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.BoundedPlane.BoundedPlane
 Послать отзыв
 Конструктор по умолчанию класса BoundedPlane. Создает действительную бесконечную плоскую поверхность в плоскости XY.
 Синтаксис
C#
Visual Basic
Копировать Код
public BoundedPlane();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса BoundedPlane. Создает действительную бесконечную плоскую поверхность в плоскости XY.
 Ссылки
 Teigha.Geometry.BoundedPlane, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!