Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Entity.ColorIndex
 Послать отзыв
 Свойство предназначено для получения или установки номера цвета, назначенного геометрическому объекту в соответствии с текущей палитрой цветов чертежа.
 Синтаксис
C#
Visual Basic
Копировать Код
public int ColorIndex;
Копировать Код
Public Property ColorIndex() As Integer
 Возвращает
 Возвращает целочисленное значение (int), представляющее номер цвета объекта. Значение 0 обычно соответствует цвету по умолчанию (BYBLOCK), а значения от 1 до 255 соответствуют стандартным цветам nanoCAD.
 Описание
 Свойство обеспечивает доступ к номеру цвета геометрического объекта.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Entity, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!