Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LoftedSurface.GuideCurves
 Послать отзыв
 Свойство возвращает массив объектов (кривых), используемых в качестве направляющих для вытягивания поверхности по сечениям.
 Синтаксис
C#
Visual Basic
Копировать Код
public Entity[] GuideCurves;
Копировать Код
Public ReadOnly Property GuideCurves As Entity()
 Возвращает
 Возвращает массив направляющих. Тип Entity[].
 Описание
 Свойство возвращает массив объектов (кривых), используемых в качестве направляющих для вытягивания поверхности по сечениям.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.LoftedSurface, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!