Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.RemoveDataLink
 Послать отзыв
 Метод предназначен для удаления из указанной ячейки ссылки на данные.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void RemoveDataLink( int row, int column );
Копировать Код
Public virtual Sub RemoveDataLink( row As Integer, column As Integer )
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс может равняться -1, если требуется удалить ссылки во всем столбце.
 col
 Индекс столбца, тип int. Индекс может равняться -1, если требуется удалить ссылки во всей строке.
 Описание
 Метод удаляет ссылку на данные из ячейки, заданной индексами строки и столбца.
 Замечания
 Для получения того же результата предпочтительнее использовать Table.Cells[row,column].RemoveDataLink .
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!