Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LayerStateManager.ExportLayerState
 Послать отзыв
 Метод ExportLayerState() получает имя состояния слоя и экспортирует соответствующее состояние слоя в указанный файл.
 Синтаксис
C#
Visual Basic
Копировать Код
public void ExportLayerState( ref String nameToExport, ref String fileName );
Копировать Код
Public Function ExportLayerState( ByRef nameToExport As String, ByRef fileName As String )
 Параметры
 Параметры
 Описание
 nameToExport
 Имя состояния слоя, тип String. Концом строки считается первый встретившийся нуль-символ.
 fileName
 Имя файла, в который экспортируется состояние слоя. Тип String.
 Описание
 Метод ExportLayerState() получает имя состояния слоя и экспортирует соответствующее состояние слоя в указанный файл. Имя состояния слоя должно быть передано нуль-терминированной строкой.
 Ссылки
 Teigha.DatabaseServices.LayerStateManager, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!