Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DataLink.Description
 Послать отзыв
 Свойство предоставляет доступ к описанию связи с данными.
 Синтаксис
C#
Visual Basic
Копировать Код
public String Description;
Копировать Код
Public Property Description() As String
 Возвращает
 Возвращает описание связи с данными. Тип String.
 Описание
 Свойство предоставляет доступ к описанию связи с данными.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.DataLink, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!