Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.LinearEntity3d.IsColinearTo
 Послать отзыв
 Метод позволяет проверить, является ли данный объект коллинеарным указанному линейному объекту.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsColinearTo( ref LinearEntity3d line );
Копировать Код
Public Function IsColinearTo( ByRef line As LinearEntity3d ) As Boolean
 Параметры
 Параметры
 Описание
 line
 Проверяемый линейный объект. Тип LinearEntity3d.
 Возвращает
 Возвращает true, если данный объект коллинеарен указанному линейному объекту. В противном случае возвращает false.
 Описание
 Метод позволяет проверить, является ли данный объект коллинеарным указанному линейному объекту. Используется вызов метода LinearEntity3d.IsColinearTo(LinearEntity3d line, Tolerance tolerance) с точностью, равной Tolerance.Global.
 Ссылки
 Teigha.Geometry.LinearEntity3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!