Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocEvaluationCallback.BeginActionEvaluationUsingObject
 Послать отзыв
 Метод предназначен для уведомления о том, что действие собирается использовать или изменять объект базы данных. Не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public void BeginActionEvaluationUsingObject( ref AssocAction pAction, ObjectId objectId, bool objectIsGoingToBeUsed, bool objectIsGoingToBeModified, ref DBObject substituteObject );
Копировать Код
Public Sub BeginActionEvaluationUsingObject( ByRef pAction As AssocAction, objectId As ObjectId, objectIsGoingToBeUsed As Boolean, objectIsGoingToBeModified As Boolean, ByRef substituteObject As DBObject )
 Параметры
 Параметры
 Описание
 pAction
 Вычисляемое действие. Тип AssocAction.
 objectId
 Объект DBObject, который будет использоваться или изменяться действием. Тип ObjectId.
 objectIsGoingToBeUsed
 Флаг, указывающий, что данные объекта будут использоваться. Тип bool.
 objectIsGoingToBeModified
 Флаг, указывающий, что данные объекта будут изменяться. Тип bool.
 substituteObject
 Объект, который опционально предоставляется клиентским кодом обратного вызова. Клиентский код не обязан присваивать значение этому выходному аргументу. Его значение должно отличаться от NULL только в том случае, если клиентский код намеревается предоставить заменяющий объект. Тип DBObject.
 Описание
 Метод инициирует вычисление ассоциативного действия и генерирует уведомление о том, что действие будет выполнять операции чтения и записи над объектом, представленным аргументом objectId. Действие использует этот обратный вызов непосредственно перед открытием объекта для чтения или записи.
 В настоящее время метод не реализован.
 Ссылки
 Teigha.DatabaseServices.AssocEvaluationCallback, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!