Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Pucsname
 Послать отзыв
 Синтаксис
C#
Visual Basic
public DatabaseServices::ObjectId Pucsname;
Public Property Pucsname() As DatabaseServices.ObjectId
 Описание
 Предоставляет доступ к Id записи таблицы UCS, которая в данный момент используется в пространстве листа базы данных (значение UCSNAME пространства листа).
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!