Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.RasterVariables.RasterVariables
 Послать отзыв
 Конструктор по умолчанию класса RasterVariables.
 Синтаксис
C#
Visual Basic
Копировать Код
public RasterVariables();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса RasterVariables.
 Ссылки
 Teigha.DatabaseServices.RasterVariables, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!