Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Solid3d.GetSubentityMaterialMapper
 Послать отзыв
 Метод позволяет для указанного подобъекта получить объект Mapper, который обеспечивает сопоставление материалов.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual Mapper GetSubentityMaterialMapper( SubentityId subEntityId );
Копировать Код
Public Overridable Function GetSubentityMaterialMapper( subEntityId As SubentityId ) As Mapper
 Параметры
 Параметры
 Описание
 subEntityId
 Входной идентификатор подобъекта. Тип SubentityId.
 Возвращает
 Возвращает объект для сопоставления материалов подобъекта. Тип Mapper.
 Описание
 Метод позволяет получить для указанного подобъекта объект Mapper, который обеспечивает сопоставление материалов.
 Ссылки
 Teigha.DatabaseServices.Solid3d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!