Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Light.StartLimitOffset
 Послать отзыв
 Свойство представляет начальный предел затухания для данного источника света.
 Синтаксис
C#
Visual Basic
Копировать Код
public double StartLimitOffset;
Копировать Код
Public Property StartLimitOffset As Double
 Возвращает
 Возвращает начальный предел затухания освещения. Тип double.
 Описание
 Свойство представляет начальный предел затухания для данного источника света. В областях до этого предела уровни освещенности считаются близкими к максимальным и не вычисляются.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Light, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!