Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LinkedTableData.SetToolTip
 Послать отзыв
 Метод позволяет задать подсказку для указанной ячейки таблицы.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetToolTip( int row, int column, ref String value );
Копировать Код
Public Overridable Sub SetToolTip( row As Integer, column As Integer, ByRef value As String )
 Параметры
 Параметры
 Описание
 row
 Индекс строки. Тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 column
 Индекс столбца. Тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице.
 value
 Строка подсказки. Тип String.
 Описание
 Метод позволяет задать подсказку для указанной ячейки таблицы.
 Замечания
 Метод выбрасывает исключение eInvalidInput, если индексы строки и/или столбца выходят за допустимые пределы.
 Ссылки
 Teigha.DatabaseServices.LinkedTableData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!