Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.SetColumnName
 Послать отзыв
 Метод задаёт имя столбца.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetColumnName( int index, ref String name );
Копировать Код
Public virtual Sub SetColumnName( index As Integer, ByRef name As String )
 Параметры
 Параметры
 Описание
 name
 Имя, которое должно быть присвоено столбцу, тип String. Может быть пустой строкой.
 col
 Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
 Описание
 Метод позволяет задать имя столбца; может быть оставлено пустым.
 Замечания
 Для получения того же результата предпочтительнее использовать Table.Columns[i].Name.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!