Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MentalRayRenderSettings.GIPhotonsPerLight
 Послать отзыв
 Свойство GIPhotonsPerLight представляет среднее количество фотонов, испускаемых каждым источником света в режиме Global Illumination.
 Синтаксис
C#
Visual Basic
Копировать Код
public int GIPhotonsPerLight;
Копировать Код
Public Property GIPhotonsPerLight As Integer
 Возвращает
 Возвращает среднее количество фотонов, испускаемых каждым источником света в режиме GI. Тип int.
 Описание
 Свойство GIPhotonsPerLight представляет среднее количество фотонов, испускаемых каждым источником света в режиме глобального освещения (Global Illumination).
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MentalRayRenderSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!