Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocAction.IsRelevantDependencyChange
 Послать отзыв
 Метод позволяет проверить входную зависимость на актуальность изменения в объекте, от которого она зависит.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsRelevantDependencyChange( ref AssocDependency dependency );
Копировать Код
Public Function IsRelevantDependencyChange( ByRef dependency As AssocDependency ) As Boolean
 Параметры
 Параметры
 Описание
 dependency
 Входная зависимость, проверяемая на актуальность изменения в объекте, от которого она зависит. Тип AssocDependency. Должна быть доступна как минимум на чтение.
 Возвращает
 Возвращает true, если изменение зависимости актуально, и false в противном случае. Реализация по умолчанию возвращает true.
 Описание
 Метод позволяет проверить входную зависимость на актуальность изменения в объекте, от которого она зависит.
 Метод делегирован из принадлежащего зависимости предиката AssocDependency.IsRelevantChange(). Он позволяет действию-владельцу, а не самой зависимости, решать, относится ли изменение объекта к этой конкретной зависимости. Реализация по умолчанию просто возвращает true.
 Таким образом, данные (обычно кэшированное значение), необходимые для принятия решения о том, относится ли изменение объекта к зависимости определенного типа, могут храниться либо в самой зависимости, либо в действии, которому она принадлежит, в зависимости от того, что удобнее для каждого конкретного действия или типа зависимости.
 Если действию принадлежит объект AssocActionBody с переопределенным предикатом IsRelevantDependencyChangeOverride(), то вместо реализации по умолчанию вызывается именно этот переопределенный предикат.
 Ссылки
 Teigha.DatabaseServices.AssocAction, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!