Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CustomScale.ToString
 Послать отзыв
 Метод формирует строковое представление данного объекта с учетом языковых и региональных настроек.
 Синтаксис
C#
Visual Basic
Копировать Код
public String ToString( ref IFormatProvider provider );
Копировать Код
Public Function ToString( ByRef provider As IFormatProvider ) As String
 Параметры
 Параметры
 Описание
 provider
 Провайдер формата региональных и языковых настроек. Тип IFormatProvider.
 Возвращает
 Возвращает представление данного объекта в виде строки. Тип String. Строка содержит значения числителя и знаменателя пользовательского масштаба.
 Описание
 Метод формирует строковое представление данного объекта с учетом языковых и региональных настроек, определяемых указанным провайдером.
 Ссылки
 Teigha.DatabaseServices.CustomScale, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!