Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Viewport.Number
 Послать отзыв
 Свойство Number представляет идентификационный номер данного видового экрана.
 Синтаксис
C#
Visual Basic
Копировать Код
public int Number;
Копировать Код
Public ReadOnly Property Number As Integer
 Возвращает
 Возвращает идентификационный номер данного видового экрана. Тип int.
 Описание
 Свойство Number представляет идентификационный номер данного видового экрана.
 Замечания
 Этот номер сообщает системная переменная CVPORT, когда данный видовой экран является текущим. В случае неактивного видового экрана возвращается -1. Это значение не сохраняется вместе с чертежом и меняется при каждом открытии чертежа.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Viewport, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!