Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Curve.GetGeCurve
 Послать отзыв
 Метод предназначен для преобразования объекта Curve в объект типа Curve3d.
 Синтаксис
C#
Visual Basic
Копировать Код
public Curve3d GetGeCurve();
Копировать Код
Public Function GetGeCurve() As Curve3d
 Возвращает
 Метод возвращает экземпляр класса Curve3d для данной кривой.
 Описание
 Метод предназначен для преобразования объекта Curve в объект типа Curve3d.
 Ссылки
 Teigha.DatabaseServices.Curve, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!