Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Делегат Teigha.DatabaseServices.ObjectClosedEventHandler
 Послать отзыв
 This is type Teigha::DatabaseServices::ObjectClosedEventHandler.
 Синтаксис
C#
Visual Basic
public delegate ObjectClosedEventHandler();
Public Delegate Sub ObjectClosedEventHandler()
 Ваши комментарии по поводу этого топика: Послать отзыв!