Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CircularArc2d.ReferenceVector
 Послать отзыв
 Свойство ReferenceVector предоставляет доступ к опорному вектору данной дуги.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector2d ReferenceVector;
Копировать Код
Public Property ReferenceVector As Vector2d
 Возвращает
 Возвращает опорный вектор дуги. Тип Vector2d.
 Описание
 Свойство ReferenceVector позволяет управлять опорным вектором данной дуги. Поскольку начальный и конечный углы дуги задаются относительно этого вектора, изменение опорного вектора производит эффект вращения дуги вокруг ее центральной точки.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.Geometry.CircularArc2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!