Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GroundPlaneBackground
 Послать отзыв
 Этот класс реализует объект фона в нулевой плоскости в видовом экране.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::GraphicsInterface::Drawable Teigha::DatabaseServices::DBObject Teigha::DatabaseServices::Background Teigha::DatabaseServices::GroundPlaneBackground
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("AcDbGroundPlaneBackground")] public class GroundPlaneBackground : Background;
Копировать Код
<Wrapper("AcDbGroundPlaneBackground")> Public Class GroundPlaneBackground Inherits Background
 Описание
 Этот класс реализует объект фона в нулевой плоскости в видовом экране.
 Методы
 Конструкторы
 Teigha.GraphicsInterface.Drawable
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 Drawable
 Конструктор класса Teigha.GraphicsInterface.Drawable. (Унаследован от Drawable)
 Teigha.DatabaseServices.DBObject
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 DBObject
 Конструктор. (Унаследован от DBObject)
 Teigha.DatabaseServices.Background
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 Background
 Конструктор класса Background. (Унаследован от Background)
 Teigha.DatabaseServices.GroundPlaneBackground
 Имя
 Описание
 GroundPlaneBackground
 Это обзор перегрузок GroundPlaneBackground.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.GraphicsInterface.Drawable
 Имя
 Описание
 Drawable Методы
 Ниже перечислены методы класса Drawable.
 Drawable Свойства
 Ниже перечислены свойства класса Drawable.
 Teigha.DatabaseServices.DBObject
 Имя
 Описание
 DBObject Методы
 Ниже перечислены методы класса DBObject.
 DBObject Свойства
 Ниже перечислены свойства класса DBObject.
 DBObject События
 Ниже перечислены события класса DBObject.
 Teigha.DatabaseServices.Background
 Имя
 Описание
 Background Методы
 Ниже перечислены методы класса Background.
 Teigha.DatabaseServices.GroundPlaneBackground
 Имя
 Описание
 GroundPlaneBackground Свойства
 Ниже перечислены свойства класса GroundPlaneBackground.
 Ссылки
 GroundPlaneBackground Конструктор, GroundPlaneBackground Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства, DBObject События
 Ваши комментарии по поводу этого топика: Послать отзыв!