Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GeoLocationData.HorizontalUnitsScale
 Послать отзыв
 Свойство обеспечивает доступ к масштабу для горизонтальных единиц измерения.
 Синтаксис
C#
Visual Basic
Копировать Код
public double HorizontalUnitsScale;
Копировать Код
Public Property HorizontalUnitsScale As Double
 Возвращает
 Возвращает масштабный коэффициент. Тип double.
 Описание
 Свойство обеспечивает доступ к масштабу для горизонтальных единиц измерения.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.GeoLocationData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!