Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbSurface.PeriodicInV
 Послать отзыв
 Свойство PeriodicInV представляет период в направлении V, если данная NURBS поверхность является периодической в направлении V.
 Синтаксис
C#
Visual Basic
Копировать Код
public double PeriodicInV;
Копировать Код
Public ReadOnly Property PeriodicInV As Double
 Возвращает
 Возвращает период в направлении V. Тип double.
 Описание
 Свойство PeriodicInV представляет период в направлении V, если данная NURBS поверхность является периодической в направлении V.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.NurbSurface, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!