Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Dimaltd
 Послать отзыв
 Синтаксис
C#
Visual Basic
public int Dimaltd;
Public Property Dimaltd() As Integer
 Описание
 Возвращает или устанавливает текущее значение DIMALTD для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!