Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Pextmax
 Послать отзыв
 Синтаксис
C#
Visual Basic
public Point3d Pextmax;
Public Property Pextmax() As Point3d
 Описание
 Возвращает или устанавливает текущее значение EXTMAX для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!