Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод LinetypeTableRecord.ShapeNumberAt
 Послать отзыв
 Синтаксис
C#
Visual Basic
public int ShapeNumberAt(int index);
Public Function ShapeNumberAt(index As Integer) As Integer
 Параметры
 Параметры
 Описание
 index
 Индекс (начинающийся с 0) строки, для которой производится определение номера формы
 Описание
 Этот метод возвращает номер формы в строке LinetypeTableRecord с индексом index. Если в этой строке нет формы, то метод возвращает 0.
 Ссылки
 Teigha.DatabaseServices.LinetypeTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!