Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Dimdsep
 Послать отзыв
 Синтаксис
C#
Visual Basic
public System.Char Dimdsep;
Public Property Dimdsep() As System.Char
 Описание
 Возвращает или устанавливает текущее значение DIMDSEP для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!