Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Point2d.==
 Послать отзыв
 Оператор равенства класса Point2d.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool operator == ( Point2d a, Point2d b );
Копировать Код
Public Operator == ( a As Point2d, b As Point2d )
 Параметры
 Параметры
 Описание
 a
 Левый операнд. Тип Point2d.
 b
 Правый операнд. Тип Point2d.
 Возвращает
 Возвращает true в случае совпадения координат сравниваемых точек, иначе - false.
 Описание
 Оператор равенства класса Point2d. Возвращает true в случае совпадения координат сравниваемых точек.
 Ссылки
 Teigha.Geometry.Point2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!