Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotStyleTableChangedEventArgs
 Послать отзыв
 Класс PlotStyleTableChangedEventArgs представляет данные для события PlotStyleTableChanged в диспетчере листов.
 Иерархия классов
Teigha::DatabaseServices::PlotStyleTableChangedEventArgs
 Синтаксис
C#
Visual Basic
Копировать Код
public sealed class PlotStyleTableChangedEventArgs : EventArgs
Копировать Код
Public NotInheritable Class PlotStyleTableChangedEventArgs Inherits EventArgs
 Описание
 Класс PlotStyleTableChangedEventArgs представляет данные для события PlotStyleTableChanged в диспетчере листов.
 Топики
 Имя
 Описание
 PlotStyleTableChangedEventArgs Свойства
 Ниже перечислены свойства класса PlotStyleTableChangedEventArgs.
 Ссылки
 PlotStyleTableChangedEventArgs Свойства, Топики, PlotStyleTableChangedEventArgs Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!