Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AttributeReference.AttributeReference
 Послать отзыв
 Конструктор класса. Создает новый экземпляр класса с заданными параметрами.
 Синтаксис
C#
Visual Basic
Копировать Код
public AttributeReference( Point3d position, ref String value, ref String tag, DatabaseServices.ObjectId style );
Копировать Код
Public Sub New( position As Point3d, ByRef value As String, ByRef tag As String, style As DatabaseServices.ObjectId )
 Параметры
 Параметры
 Описание
 position
 Относительное положение атрибута в экземпляре блока. Тип Point3d.
 value
 Значение атрибута в экземпляре блока. Тип String.
 tag
 Тег атрибута в экземпляре блока. Тип String.
 style
 Стиль атрибута в экземпляре блока. Тип DatabaseServices.ObjectId.
 Описание
 Конструктор класса. Создает новый экземпляр класса с заданными параметрами (положение, значение, тег и стиль).
 Ссылки
 Teigha.DatabaseServices.AttributeReference, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!