Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AbstractViewTableRecord.SetUcs
 Послать отзыв
 Метод задает UCS (ПСК) с указанной ориентацией для записи таблицы видов или видовых экранов. Ориентация определяется аргументом из перечисления OrthographicView.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetUcs( OrthographicView view );
Копировать Код
Public Sub SetUcs( view As OrthographicView )
 Параметры
 Параметры
 Описание
 view
 Вариант ортогонального вида, в соответствии с которым задается ориентация UCS (ПСК). Значение из перечисления OrthographicView.
 Описание
 Метод задает новую пользовательскую систему координат (UCS, ПСК) для записи таблицы видов или видовых экранов. Новая UCS является неименованной, ее ориентация определяется указанным вариантом ортогонального вида из перечисления OrthographicView.
 Ссылки
 Teigha.DatabaseServices.AbstractViewTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!