Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Point2d.TransformBy
 Послать отзыв
 Метод применяет к данной точке указанное геометрическое преобразование и возвращает точку в новых координатах.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point2d TransformBy( Matrix2d leftSide );
Копировать Код
Public Function TransformBy( leftSide As Matrix2d ) As Point2d
 Параметры
 Параметры
 Описание
 leftSide
 Матрица геометрического преобразования. Тип Matrix2d.
 Возвращает
 Возвращает 2D-точку как результат геометрического преобразования leftSide текущих координат данной точки. Тип Point2d.
 Описание
 Метод применяет к данной точке геометрическое преобразование, представленное матрицей leftSide, и возвращает точку в новых координатах.
 Ссылки
 Teigha.Geometry.Point2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!