Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FormattedTableData.IsFormatEditable
 Послать отзыв
 Метод позволяет определить, допускается ли изменение формата ячейки.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual bool IsFormatEditable( int row, int column );
Копировать Код
Public Overridable Function IsFormatEditable( row As Integer, column As Integer ) As Boolean
 Параметры
 Параметры
 Описание
 row
 Индекс строки. Тип int. Должен быть неотрицательным и меньше количества строк в таблице.
 column
 Индекс столбца. Тип int. Должен быть неотрицательным и меньше количества столбцов в таблице.
 Возвращает
 Возвращает true, если изменение формата ячейки возможно. В противном случае возвращает false.
 Описание
 Метод позволяет определить, допускается ли изменение формата ячейки.
 Учитывая, что семантика редактируемой ячейки может изменяться по мере добавления новых состояний, для проверки редактируемости ячеек рекомендуется использовать данный метод вместо прямого обращения к cellState.
 Ссылки
 Teigha.DatabaseServices.FormattedTableData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!