Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocDependency.IsWriteDependency
 Послать отзыв
 Свойство позволяет проверить или указать, что данная зависимость изменяет состояние связанного объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsWriteDependency;
Копировать Код
Public Property IsWriteDependency() As Boolean
 Возвращает
 Возвращает true, если зависимость изменяет состояние связанного объекта. В противном случае возвращает false.
 Описание
 Свойство позволяет проверить или указать, что данная зависимость изменяет состояние связанного объекта. Значение true указывает, что действие AssocAction как владелец зависимости изменяет зависимый объект DBObject.
 Значение этого флага по умолчанию — false.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.AssocDependency, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!