Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Filters.SpatialFilter.HasPerspectiveCamera
 Послать отзыв
 Свойство HasPerspectiveCamera позволяет определить, задана ли перспективная камера для данного фильтра SpatialFilter.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool HasPerspectiveCamera;
Копировать Код
Public ReadOnly Property HasPerspectiveCamera As Boolean
 Возвращает
 Возвращает true, если перспективная камера задана. В противном случае возвращает false.
 Описание
 Свойство HasPerspectiveCamera позволяет определить, задана ли перспективная камера для данного фильтра SpatialFilter.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Filters.SpatialFilter, Teigha.DatabaseServices.Filters
 Ваши комментарии по поводу этого топика: Послать отзыв!