Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CubicSplineCurve2d.CubicSplineCurve2d
 Послать отзыв
 Конструктор класса CubicSplineCurve2d. Создает интерполяционный кубический сплайн, проходящий с заданной точностью через указанные определяющие точки.
 Синтаксис
C#
Visual Basic
Копировать Код
public CubicSplineCurve2d( ref Point2dCollection fitPoints, Tolerance tolerance );
Копировать Код
Public Sub New( ByRef fitPoints As Point2dCollection, tolerance As Tolerance )
 Параметры
 Параметры
 Описание
 fitPoints
 Входной массив определяющих точек сплайна. Тип Point2dCollection.
 tolerance
 Заданная точность интерполяции. Тип Tolerance.
 Описание
 Конструктор класса CubicSplineCurve2d. Создает интерполяционный кубический сплайн, проходящий с заданной точностью через указанные определяющие точки.
 Ссылки
 Teigha.Geometry.CubicSplineCurve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!