Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.FieldFromMText
 Послать отзыв
 Метод копирует текстовое поле из указанного объекта MText, если он содержит такое поле, и добавляет его копию к данному размеру.
 Синтаксис
C#
Visual Basic
Копировать Код
public void FieldFromMText( ref MText dimMText );
Копировать Код
Public Sub FieldFromMText( ByRef dimMText As MText )
 Параметры
 Параметры
 Описание
 dimMText
 Исходный объект, из которого копируется поле. Тип MText.
 Описание
 Метод копирует текстовое поле из указанного объекта MText, если он содержит такое поле, и добавляет его копию к данному размеру.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!