Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LayoutManager.GetLayoutId
 Послать отзыв
 Метод возвращает ObjectId объекта Layout, заданного по имени.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectId GetLayoutId( ref String name );
Public Function GetLayoutId(ByRef name As String) As ObjectId
 Параметры
 Параметры
 Описание
 name
 Имя искомого объекта Layout, тип String.
 Возвращает
 Возвращает ObjectId объекта Layout с именем name.
 Описание
 Метод возвращает ObjectId объекта Layout с указанным именем name.
 По умолчанию возвращаемый объект не открыт ни для чтения из базы данных, ни для записи в нее.Public Function GetLayoutId( ByRef name As String ) As ObjectId
 Ссылки
 Teigha.DatabaseServices.LayoutManager, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!