Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotSettings.PlotType
 Послать отзыв
 Свойство PlotType представляет тип печати чертежа, определенный для данного объекта PlotSettings.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.PlotType PlotType;
Копировать Код
Public ReadOnly Property PlotType As DatabaseServices.PlotType
 Возвращает
 Возвращает тип печати чертежа. Значение из перечисления DatabaseServices.PlotType.
 Описание
 Свойство PlotType представляет тип печати чертежа, определенный для данного объекта PlotSettings.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.PlotSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!