Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeader.GetLeaderIndexes
 Послать отзыв
 Метод предоставляет массив индексов линий выносок данного объекта MLeader.
 Синтаксис
C#
Visual Basic
Копировать Код
public System.Collections.ArrayList GetLeaderIndexes();
Копировать Код
Public Function GetLeaderIndexes() As System.Collections.ArrayList
 Возвращает
 Возвращает массив индексов линий выносок. Тип System.Collections.ArrayList.
 Описание
 Метод предоставляет массив индексов линий выносок данного объекта MLeader.
 Ссылки
 Teigha.DatabaseServices.MLeader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!