Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Spline.Spline
 Послать отзыв
 Конструктор класса Spline. Создает сплайн, геометрически представляющий эллиптическую дугу с заданными параметрами.
 Синтаксис
C#
Visual Basic
Копировать Код
public Spline( Point3d center, Vector3d unitNormal, Vector3d majorAxis, double radiusRatio, double startAngle, double endAngle );
Копировать Код
Public Sub New( center As Point3d, unitNormal As Vector3d, majorAxis As Vector3d, radiusRatio As Double, startAngle As Double, endAngle As Double )
 Параметры
 Параметры
 Описание
 center
 Центр эллиптической дуги. Тип Point3d.
 unitNormal
 Нормаль плоскости эллиптической дуги. Тип Vector3d.
 majorAxis
 Направление главной оси эллипса. Тип Vector3d.
 radiusRatio
 Отношение малого и большого радиусов эллипса. Тип double.
 startAngle
 Угол для начальной точки дуги (в радианах). Тип double.
 endAngle
 Угол для конечной точки дуги (в радианах). Тип double.
 Описание
 Конструктор класса Spline. Создает экземпляр класса, геометрически представляющий эллиптическую дугу с указанными параметрами (центр, направления осей, радиусы и т.д.).
 Ссылки
 Teigha.DatabaseServices.Spline, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!