Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DataLink.IsValid
 Послать отзыв
 Свойство позволяет проверить, действительна ли связь с внешними данными и может ли она использоваться для обновления данных.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsValid;
Копировать Код
Public Property IsValid() As Boolean
 Возвращает
 Возвращает true, если связь с внешними данными действительна. В противном случае возвращает false.
 Описание
 Свойство позволяет проверить, действительна ли связь с внешними данными и может ли она использоваться для обновления данных.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.DataLink, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!