Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Point3d.Project
 Послать отзыв
 Метод создает проекцию данной точки на указанную плоскость вдоль заданного направления.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d Project( ref Plane plane, Vector3d vector );
Копировать Код
Public Function Project( ByRef plane As Plane, vector As Vector3d ) As Point3d
 Параметры
 Параметры
 Описание
 plane
 Плоскость проецирования. Тип Plane.
 vector
 Вектор, определяющий направление проецирования. Тип Vector3d.
 Возвращает
 Возвращает точку Point3d, которая является проекцией данной точки на плоскость plane вдоль заданного направления.
 Описание
 Метод создает точку, являющуюся проекцией данной точки на плоскость plane в направлении vector.
 Ссылки
 Teigha.Geometry.Point3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!