Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AttributeCollection.GetEnumerator
 Послать отзыв
 Возвращает объект перечислителя для этой коллекции.
 Синтаксис
C#
Visual Basic
Копировать Код
public System.Collections.IEnumerator GetEnumerator();
Копировать Код
Public Function GetEnumerator() As System.Collections.IEnumerator
 Описание
 Метод возвращает объект перечислителя для этой коллекции.
 Ссылки
 Teigha.DatabaseServices.AttributeCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!