Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.ExternalBoundedSurface.NumContours
 Послать отзыв
 Свойство NumContours представляет количество криволинейных границ на этой поверхности.
 Синтаксис
C#
Visual Basic
Копировать Код
public int NumContours;
Копировать Код
Public ReadOnly Property NumContours As Integer
 Возвращает
 Возвращает количество криволинейных границ на этой внешней ограниченной поверхности. Тип int.
 Описание
 Свойство NumContours представляет количество криволинейных границ на этой поверхности.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.ExternalBoundedSurface, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!