Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 ViewTableRecord.DisassociateUcsFromView()
 Послать отзыв
 Метод предназначен для отвязки именованного вида от ПСК.
 Синтаксис
C#
Visual Basic
public void DisassociateUcsFromView();
Public Sub DisassociateUcsFromView()
 Описание
 Метод отделяет ПСК от именованного вида. Если эта функция вызвана, то никакие ПСК не будут связаны с именованным видом и ПСК не изменится при восстановлении вида.
 Ссылки
 ViewTableRecord Класс, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!