Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DwgFiler.ReadAddress
 Послать отзыв
 Метод предназначен для получения значения адреса памяти текущего элемента данного объекта Filer.
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract IntPtr ReadAddress();
Копировать Код
Public MustOverride Function ReadAddress() As IntPtr
 Возвращает
 Возвращает адреса памяти текущего элемента объекта Filer. Тип IntPtr.
 Описание
 Метод предназначен для получения значения адреса памяти текущего элемента данного объекта Filer.
 Реализация должна обеспечить следующие функции:
проверка текущего статуса файла;
чтение по адресу памяти;
возвращать прочитанный адрес.
 Ссылки
 Teigha.DatabaseServices.DwgFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!