Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DynamicBlockReferenceProperty.PropertyTypeCode
 Послать отзыв
 Свойство PropertyTypeCode представляет тип значения свойства динамического блока.
 Синтаксис
C#
Visual Basic
Копировать Код
public short PropertyTypeCode;
Копировать Код
Public ReadOnly Property PropertyTypeCode As Short
 Возвращает
 Возвращает тип значения свойства динамического блока. Тип short.
 Описание
 Свойство PropertyTypeCode представляет тип значения свойства динамического блока.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.DynamicBlockReferenceProperty, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!