Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Shape.Shape
 Послать отзыв
 Конструктор по умолчанию класса Shape.
 Синтаксис
C#
Visual Basic
Копировать Код
public Shape();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса Shape.
 Ссылки
 Teigha.DatabaseServices.Shape, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!