Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DataTypeParameter.DataTypeParameter
 Послать отзыв
 Конструктор структуры DataTypeParameter. Создает экземпляр структуры с указанными типом данных и типом единиц измерения.
 Синтаксис
C#
Visual Basic
Копировать Код
public DataTypeParameter( DataType dataType, UnitType unitType );
Копировать Код
Public Sub New( dataType As DataType, unitType As UnitType )
 Параметры
 Параметры
 Описание
 dataType
 Тип данных. Тип DataType.
 unitType
 Тип единиц измерения. Тип UnitType.
 Описание
 Конструктор структуры DataTypeParameter. Создает экземпляр структуры с указанными типом данных и типом единиц измерения.
 Ссылки
 Teigha.DatabaseServices.DataTypeParameter, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!