Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Field.EvaluatorId
 Послать отзыв
 Свойство EvaluatorId представляет идентификатор вычислителя, который используется для данного поля.
 Синтаксис
C#
Visual Basic
Копировать Код
public String EvaluatorId;
Копировать Код
Public Property EvaluatorId As String
 Возвращает
 Возвращает идентификатор вычислителя. Тип String.
 Описание
 Свойство EvaluatorId представляет идентификатор вычислителя, который используется для данного поля.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Field, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!