Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector2d.IsCodirectionalTo
 Послать отзыв
 Метод позволяет проверить, является ли данный вектор сонаправленным входному вектору в пределах некоторой заданной точности.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsCodirectionalTo( Vector2d vector, Tolerance tolerance );
Копировать Код
Public Function IsCodirectionalTo( vector As Vector2d, tolerance As Tolerance ) As Boolean
 Параметры
 Параметры
 Описание
 vector
 Входной вектор, сравниваемый на сонаправленность с данным вектором. Тип Vector2d.
 tolerance
 Заданная геометрическая точность. Тип Tolerance.
 Возвращает
 Возвращает true, если в пределах предписанной точности оба вектора можно считать сонаправленными. В противном случае возвращает false.
 Описание
 Метод позволяет проверить, является ли данный вектор сонаправленным входному вектору vector в пределах некоторой заданной точности.
 Замечания
 Реализация приводит оба вектора к единичной длине, а затем проверяет их совпадение в пределах предписанной точности tolerance.
 Ссылки
 Teigha.Geometry.Vector2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!