Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Sketchinc
 Послать отзыв
 Синтаксис
C#
Visual Basic
public double Sketchinc;
Public Property Sketchinc() As Double
 Описание
 Обеспечивает доступ к текущему значению SKETCHINC для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!