Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Trace.GetPointAt
 Послать отзыв
 Метод предоставляет вершину данной полосы с указанным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d GetPointAt( short index );
Копировать Код
Public Function GetPointAt( index As Short ) As Point3d
 Параметры
 Параметры
 Описание
 index
 Индекс вершины. Тип short.
 Возвращает
 Возвращает точку для вершины с индексом index. Тип Point3d.
 Описание
 Метод предоставляет вершину данной полосы с указанным индексом.
 Ссылки
 Teigha.DatabaseServices.Trace, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!