Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector2d.GetNormal
 Послать отзыв
 Метод предоставляет единичный вектор, сонаправленный данному вектору.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector2d GetNormal();
Копировать Код
Public Function GetNormal() As Vector2d
 Возвращает
 Возвращает единичный вектор, сонаправленный данному вектору. Тип Vector2d.
 Описание
 Метод позволяет получить единичный вектор, сонаправленный данному вектору. Реализация использует вызов метода Vector2d.GetNormal(Tolerance tolerance) с точностью по умолчанию Tolerance.EqualVector.
 Ссылки
 Teigha.Geometry.Vector2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!