Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MTextFragment.GetOverLinePoints
 Послать отзыв
 Метод возвращает массив из двух точек, определяющих линию надчёркивания текста, если таковая используется.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d[] GetOverLinePoints();
Копировать Код
Public Function GetOverLinePoints() As Point3d()
 Возвращает
 Возвращает массив из двух точек, которые определяют линию надчёркивания. Тип Point3d[].
 Описание
 Метод возвращает массив из двух точек, определяющих линию надчёркивания текста, если таковая используется.
 Ссылки
 Teigha.DatabaseServices.MTextFragment, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!