Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AbstractViewportData.IsUcsSavedWithViewport
 Послать отзыв
 Свойство IsUcsSavedWithViewport позволяет определить, сохраняется ли связь UCS (ПСК) с видовым экраном.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsUcsSavedWithViewport;
Копировать Код
Public Property IsUcsSavedWithViewport As Boolean
 Возвращает
 Возвращает true, если связь UCS (ПСК) с видовым экраном сохраняется. В противном случае возвращает false.
 Описание
 Свойство IsUcsSavedWithViewport позволяет определить, сохраняется ли связь UCS (ПСК) с видовым экраном.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.AbstractViewportData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!