Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DrawMLeaderOrderType
 Послать отзыв
 Данное перечисление определяет последовательность отрисовки объекта MLeader.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum DrawMLeaderOrderType { DrawContentFirst = 0, DrawLeaderFirst = 1 }
Копировать Код
Public Enum DrawMLeaderOrderType DrawContentFirst = 0 DrawLeaderFirst = 1 End Enum
 Члены
 Члены
 Описание
 DrawContentFirst
 Значение: 0. Сначала отображается содержимое мультивыноски.
 DrawLeaderFirst
 Значение: 1. Сначала отображаются выносные линии.
 Описание
 Данное перечисление определяет последовательность отрисовки объекта MLeader.
 Ваши комментарии по поводу этого топика: Послать отзыв!