Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.UsingDefaultTextPosition
 Послать отзыв
 Свойство позволяет определить, должно ли для размерного текста использоваться положение по умолчанию или нет.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool UsingDefaultTextPosition;
Копировать Код
Public Property UsingDefaultTextPosition As Boolean
 Возвращает
 Возвращает true, если используется позиция по умолчанию. В противном случае возвращает false.
 Описание
 Свойство позволяет определить, должно ли для размерного текста использоваться положение по умолчанию или нет.
 В случае значения true используется позиция текста по умолчанию. В случае необходимости изменить позицию текста, этому свойству следует задать значение false.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!