Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Элемент данных BlockReference.mpAttColl
 Послать отзыв
 This is mpAttColl, a member of class BlockReference.
 Синтаксис
C#
Visual Basic
private AttributeCollection mpAttColl;
Private mpAttColl As AttributeCollection
 Ссылки
 Teigha.DatabaseServices.BlockReference, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!