Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotSettings.PlotOrigin
 Послать отзыв
 Свойство PlotOrigin представляет смещение начала координат области печати на печатаемом листе.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point2d PlotOrigin;
Копировать Код
Public ReadOnly Property PlotOrigin As Point2d
 Возвращает
 Возвращает смещение начала координат. Тип Point2d.
 Описание
 Свойство PlotOrigin представляет смещение начала координат области печати для этого объекта PlotSettings. Это смещение измеряется относительно границ печатаемого листа и всегда в миллиметрах независимо от единиц чертежа.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.PlotSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!