Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.Dimdsep
 Послать отзыв
 Свойство задает или возвращает символ, который используется в качестве десятичного разделителя в значениях размеров.
 Синтаксис
C#
Visual Basic
Копировать Код
public System.Char Dimdsep;
Копировать Код
Public Property Dimdsep As System.Char
 Возвращает
 Возвращает символ десятичного разделителя. Тип System.Char.
 Описание
 Свойство задает или возвращает символ, который используется в качестве десятичного разделителя в значениях размеров.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!