Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SymbolUtilityServices.RepairPreExtendedSymbolName
 Послать отзыв
 Метод предоставляет строку, являющуюся результатом "восстановления" входной строки для приведения её к виду, когда строка содержит только допустимые символы в соответствии с устаревшими требованиями к именам символов.
 Синтаксис
C#
Visual Basic
Копировать Код
public static String RepairPreExtendedSymbolName( ref String oldName, bool allowVerticalBar );
Копировать Код
Public Shared Function RepairPreExtendedSymbolName( ByRef oldName As String, allowVerticalBar As Boolean ) As String
 Параметры
 Параметры
 Описание
 oldName
 Исходное имя символа, подлежащее восстановлению. Тип String.
 allowVerticalBar
 Флаг, определяющий, допускается ли в имени символа знак вертикальной черты ("|"). Тип bool.
 Возвращает
 Возвращает восстановленное имя символа. Тип String.
 Описание
 Метод предоставляет строку, являющуюся результатом "восстановления" входной строки для приведения её к виду, когда строка содержит только допустимые символы в соответствии с устаревшими требованиями к именам символов. В случае обнаружения недопустимых знаков они заменяются допустимыми. Обработка входной строки выполняется аналогично методу ValidatePreExtendedSymbolName().
 Ссылки
 Teigha.DatabaseServices.SymbolUtilityServices, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!