Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.BulgeVertex.Vertex
 Послать отзыв
 Свойство обеспечивает доступ к вершине, с которой связан объект BulgeVertex.
 Синтаксис
C#
Visual Basic
Копировать Код
public Geometry.Point2d Vertex;
Копировать Код
Public Property Vertex() As Geometry.Point2d
 Возвращает
 Возвращает координаты 2D-вершины. Тип Geometry.Point2d.
 Описание
 Свойство обеспечивает доступ к вершине, с которой связан объект BulgeVertex.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.BulgeVertex, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!