Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Arc.Length
 Послать отзыв
 Свойство предназначено для хранения значения длины дуги.
 Синтаксис
C#
Visual Basic
public double Length;
Public Property Length() As Double
 Возвращает
 Тип данных double.
 Описание
 Возвращает длину дуги.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Arc, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!