Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbSurfaceDefinition.Equals
 Послать отзыв
 Метод предназначен для проверки равенства указанного объекта данному объекту.
 Синтаксис
C#
Visual Basic
Копировать Код
public sealed override bool Equals( ref Object obj );
Копировать Код
Public NotOverridable Overrides Function Equals( ByRef obj As Object ) As Boolean
 Параметры
 Параметры
 Описание
 obj
 Входной объект, который проверяется на равенство данному объекту. Тип Object.
 Возвращает
 Возвращает true, если объект obj равен данному объекту. В противном случае возвращает false.
 Описание
 Метод предназначен для проверки равенства указанного объекта данному объекту.
 Замечания
 Переопределение методов Equals и GetHashCode должно выполняться согласованно с соблюдением общей логики. Если Equals возвращает true, хеш-коды сравниваемых объектов обязаны совпадать. Обратное не гарантируется - совпадение хеш-кодов не всегда означает совпадение объектов вследствие возможных коллизий. Хеш-коды должны формироваться с использованием полей, на которых основано равенство объектов.
 Иногда используется метод Equals() из объекта C++, но поскольку сравниваются указатели, вы по-прежнему можете использовать GetHashCode() отсюда, в то время как метод Equals() может быть переопределен в производном классе.
 Ссылки
 Teigha.Geometry.NurbSurfaceDefinition, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!