Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Position3d.Position3d
 Послать отзыв
 Конструктор по умолчанию класса Position3d. Создает объект позиции с координатами (0,0,0).
 Синтаксис
C#
Visual Basic
Копировать Код
public Position3d();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса Position3d. Создает объект позиции с координатами (0,0,0).
 Ссылки
 Teigha.Geometry.Position3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!