Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LayoutManager.CreateLayout
 Послать отзыв
 Метод создает новый объект Layout с уникальным именем листа.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.ObjectId CreateLayout( ref String newName );
Копировать Код
Public Function CreateLayout( ByRef newName As String ) As DatabaseServices.ObjectId
 Параметры
 Параметры
 Описание
 newName
 Имя нового объекта Layout, тип String.
 Возвращает
 Возвращает ObjectId созданного объекта Layout.
 Описание
 Метод создает новый объект Layout с уникальным именем листа. Видовые экраны по умолчанию для нового листа не создаются до тех пор, пока этот лист не будет впервые активирован.
 Ссылки
 Teigha.DatabaseServices.LayoutManager, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!