Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.TableTemplate.CreateTable
 Послать отзыв
 Метод предназначен для создания нового шаблона таблицы.
 Синтаксис
C#
Visual Basic
Копировать Код
public Table CreateTable( TableCopyOptions copyOption );
Копировать Код
Public Function CreateTable( copyOption As TableCopyOptions ) As Table
 Параметры
 Параметры
 Описание
 copyOption
 Опции копирования, определяющие, что именно требуется захватывать из шаблона. Перечисление TableCopyOptions.
 Возвращает
 Возвращает созданный шаблон таблицы. Тип Table.
 Описание
 Метод предназначен для создания нового шаблона таблицы.
 Ссылки
 Teigha.DatabaseServices.TableTemplate, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!