Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CellRange.IsEmpty
 Послать отзыв
 Свойство позволяет проверить, является ли пустым данный диапазон.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool? IsEmpty;
Копировать Код
Public ReadOnly Property IsEmpty As Boolean?
 Возвращает
 Возвращает true, если диапазон является пустым. В противном случае возвращает false.
 Описание
 Свойство позволяет проверить, является ли пустым данный диапазон.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.CellRange, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!