Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.BoundaryRepresentation.Mesh2d
 Послать отзыв
 Класс Mesh2d представляет интерфейсный класс для 2D-сетей.
 Иерархия классов
Teigha::BoundaryRepresentation::MeshEntity Teigha::BoundaryRepresentation::Mesh Teigha::BoundaryRepresentation::Mesh2d
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("AcBrMesh2d")] public class Mesh2d : Mesh;
Копировать Код
<Wrapper("AcBrMesh2d")> Public Class Mesh2d Inherits Mesh
 Описание
 Класс Mesh2d представляет интерфейсный класс для 2D-сетей.
 Этот класс определяет функционал, который относится к двумерной (или фасетированной) сети либо всего твердого тела целиком, либо отдельной поверхности. 2D-сеть — это сеть, которая соответствует некоторому множеству 3D-граней и, таким образом, имеет связанную геометрию. Собственно геометрия и ссылки на исходные топологические объекты BREP хранятся в отдельных элементах и узлах сети.
 2D-сеть также можно рассматривать как каркас, множество элементов которого определяет каркасную модель поверхности. Многосвязные ребра и вершины множества 3D-граней игнорируются и в сети не отображаются. Вырожденные элементы отбрасываются вместе с их уникальными узлами.
 Замечания
 Класс Mesh2d реализован только в среде пространственного моделирования.
 Методы
 Конструкторы
 Teigha.BoundaryRepresentation.Mesh2d
 Имя
 Описание
 Mesh2d
 Конструктор класса Mesh2d. Создает экземпляр класса с указанными параметрами.
 Топики
 Имя
 Описание
 MeshEntity Методы
 Ниже перечислены методы класса MeshEntity.
 MeshEntity Свойства
 Ниже перечислены свойства класса MeshEntity.
 Teigha.BoundaryRepresentation.Mesh2d
 Имя
 Описание
 Mesh2d Методы
 Ниже перечислены методы класса Mesh2d.
 Mesh2d Свойства
 Ниже перечислены свойства класса Mesh2d.
 Ссылки
 Mesh2d Методы, Mesh2d Свойства, Методы, Топики, MeshEntity Методы, MeshEntity Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!