Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.CanDeleteColumns
 Послать отзыв
 Данный метод проверяет, можно ли удалить столбец, заданный индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual bool CanDeleteColumns( int index, int nCount );
Копировать Код
Public virtual Function CanDeleteColumns( index As Integer, nCount As Integer ) As Boolean
 Параметры
 Параметры
 Описание
 index
 Индекс предполагаемого к удалению столбца. Тип int.
 nCount
 Количество предполагаемых к удалению столбцов. Тип int.
 Возвращает
 Возвращает true, если удаление возможно, и false в противном случае.
 Описание
 Данный метод проверяет, можно ли удалить столбец, заданный индексом.
 Замечания
 Для получения того же результата предпочтительнее использовать CellRange.CanDeleteColumns.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!