Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.KnotCollection.IsReadOnly
 Послать отзыв
 Свойство IsReadOnly позволяет определить, доступна ли эта коллекция только для чтения.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual bool IsReadOnly;
Копировать Код
Public Overridable ReadOnly Property IsReadOnly As Boolean
 Возвращает
 Возвращает true, если коллекция доступна только для чтения. В противном случае возвращает false.
 Описание
 Свойство IsReadOnly позволяет определить, доступна ли эта коллекция только для чтения.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.KnotCollection, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!