Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SubentityOverrule
 Послать отзыв
 Этот класс переопределяет подмножество связанных с подобъектом операций, которые определяет объект. Используется в качестве базового класса для настройки поведения классов, производных от Entity.
 Иерархия классов
Teigha::DatabaseServices::SubentityOverrule
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdDbSubentityOverrule")] public class SubentityOverrule : Overrule;
Копировать Код
<Wrapper("OdDbSubentityOverrule")> Public Class SubentityOverrule Inherits Overrule
 Описание
 Этот класс переопределяет подмножество связанных с подобъектом операций, которые определяет объект. Используется в качестве базового класса для настройки поведения классов, производных от Entity. Каждая реализация по умолчанию вызывает соответствующий метод целевого класса.
 Топики
 Имя
 Описание
 SubentityOverrule Методы
 Ниже перечислены методы класса SubentityOverrule.
 Ссылки
 SubentityOverrule Методы, Топики, SubentityOverrule Методы
 Ваши комментарии по поводу этого топика: Послать отзыв!