Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GripData.Status
 Послать отзыв
 Данное перечисление определяет типы статуса ручки.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum Status { GripStart = 0, GripEnd = 1, GripAbort = 2, Stretch = 3, Move = 4, Rotate = 5, Scale = 6, Mirror = 7, DimFocusChanged = 8, PopUpMenu = 9 }
Копировать Код
Public Enum Status GripStart = 0 GripEnd = 1 GripAbort = 2 Stretch = 3 Move = 4 Rotate = 5 Scale = 6 Mirror = 7 DimFocusChanged = 8 PopUpMenu = 9 End Enum
 Члены
 Члены
 Описание
 GripStart
 Значение: 0. Начало действия с ручкой.
 GripEnd
 Значение: 1. Завершение действия с ручкой.
 GripAbort
 Значение: 2. Отмена действия с ручкой.
 Stretch
 Значение: 3. Растягивание.
 Move
 Значение: 4. Перемещение.
 Rotate
 Значение: 5. Вращение.
 Scale
 Значение: 6. Масштабирование.
 Mirror
 Значение: 7. Зеркалирование.
 DimFocusChanged
 Значение: 8. Изменился фокус размера.
 PopUpMenu
 Значение: 9. Выпадающее меню.
 Описание
 Данное перечисление определяет типы статуса ручки.
 Ваши комментарии по поводу этого топика: Послать отзыв!