Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Surface.IsNormalReversed
 Послать отзыв
 Свойство IsNormalReversed позволяет проверить, была ли нормаль этой поверхности инвертирована нечетное количество раз.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsNormalReversed;
Копировать Код
Public ReadOnly Property IsNormalReversed As Boolean
 Возвращает
 Возвращает true, если ориентация нормали поверхности соответствует направлению  - partialU.crossProduct(partialV).normalize(). Возвращает false, если направление нормали совпадает с  + partialU.crossProduct(partialV).normalize().
 Описание
 Свойство IsNormalReversed позволяет проверить, была ли нормаль этой поверхности инвертирована нечетное количество раз.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.Surface, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!