Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Entity3d.IsOn
 Послать отзыв
 Метод позволяет проверить, лежит ли указанная точка на данном объекте. Используется заданная геометрическая точность.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsOn( Point3d point, Tolerance tolerance );
Копировать Код
Public Function IsOn( point As Point3d, tolerance As Tolerance ) As Boolean
 Параметры
 Параметры
 Описание
 point
 Проверяемая точка. Тип Point3d.
 tolerance
 Заданная геометрическая точность. Тип Tolerance.
 Возвращает
 Возвращает true, если в рамках используемой точности точка point лежит на данном объекте. В противном случае возвращает false.
 Описание
 Метод позволяет проверить, лежит ли указанная точка на данном объекте. Используется заданная геометрическая точность.
 Ссылки
 Teigha.Geometry.Entity3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!