Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CubicSplineCurve3d.CubicSplineCurve3d
 Послать отзыв
 Конструктор класса CubicSplineCurve3d. Создает интерполяционный кубический сплайн, проходящий через заданные определяющие точки, и с указанными векторами первых производных в начале и в конце сплайна.
 Синтаксис
C#
Visual Basic
Копировать Код
public CubicSplineCurve3d( ref Point3dCollection points, Vector3d startDerivative, Vector3d endDerivative );
Копировать Код
Public Sub New( ByRef points As Point3dCollection, startDerivative As Vector3d, endDerivative As Vector3d )
 Параметры
 Параметры
 Описание
 points
 Входной массив определяющих точек сплайна. Тип Point3dCollection.
 startDerivative
 Первая производная в начальной точке. Тип Vector3d.
 endDerivative
 Первая производная в конечной точке. Тип Vector3d.
 Описание
 Конструктор класса CubicSplineCurve3d. Создает интерполяционный кубический сплайн, проходящий через заданные определяющие точки, и с указанными векторами первых производных в начале и в конце сплайна. Используется вызов метода CubicSplineCurve3d(ref Point3dCollection points, Vector3d startDerivative, Vector3d endDerivative, Tolerance tolerance); с точностью интерполяции Tolerance.Global.
 Ссылки
 Teigha.Geometry.CubicSplineCurve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!