Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Section.Section
 Послать отзыв
 Конструктор класса Section. Создает экземпляр класса с указанными параметрами.
 Синтаксис
C#
Visual Basic
Копировать Код
public Section( ref Point3dCollection pts, Vector3d verticalDir, Vector3d vecViewingDir );
Копировать Код
Public Sub New( ByRef pts As Point3dCollection, verticalDir As Vector3d, vecViewingDir As Vector3d )
 Параметры
 Параметры
 Описание
 pts
 Коллекция точек, определяющих секущую плоскость. Тип Point3dCollection. Совпадающие точки в этой коллекции не допускаются. Должна содержать как минимум две точки.
 verticalDir
 Вектор вертикального направления, перпендикулярный линии сечения. Тип Vector3d.
 vecViewingDir
 Вектор направления просмотра. Тип Vector3d.
 Описание
 Конструктор класса Section. Создает экземпляр класса с указанными параметрами.
 Ссылки
 Teigha.DatabaseServices.Section, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!