Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DatabaseSummaryInfo.CustomProperties
 Послать отзыв
 Свойство предоставляет доступ к перечислителю для пользовательских свойств данного объекта DatabaseSummaryInfo.
 Синтаксис
C#
Visual Basic
Копировать Код
public System.Collections.IDictionaryEnumerator CustomProperties;
Копировать Код
Public Property CustomProperties() As System.Collections.IDictionaryEnumerator
 Возвращает
 Возвращает перечислитель коллекции пользовательских свойств. Тип System.Collections.IDictionaryEnumerator.
 Описание
 Свойство предоставляет доступ к перечислителю для пользовательских свойств данного объекта DatabaseSummaryInfo.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.DatabaseSummaryInfo, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!