Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DatabaseIOEventArgs.FileName
 Послать отзыв
 Свойство представляет доступ к имени файла чертежа.
 Синтаксис
C#
Visual Basic
Копировать Код
public String FileName;
Копировать Код
Public Property FileName() As String
 Возвращает
 Возвращает имя файла. Тип String.
 Описание
 Свойство представляет доступ к имени файла чертежа.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.DatabaseIOEventArgs, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!