Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Curve.EndPoint
 Послать отзыв
 Возвращает или задает конечную точку кривой (в мировой системе координат WCS).
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d EndPoint;
Копировать Код
Public Property EndPoint() As Point3d
 Возвращает
 Возвращает или задает конечную точку кривой в виде экземпляра класса Point3d.
 Описание
 Возвращает или задает конечную точку кривой (в мировой системе координат WCS).
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Curve, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!