Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Rectangle3d
 Послать отзыв
 Структура Rectangle3d представляет четыре точки, которые определяют вершины 3D-прямоугольника.
 Иерархия классов
Teigha::DatabaseServices::Rectangle3d
 Синтаксис
C#
Visual Basic
Копировать Код
public struct Rectangle3d
Копировать Код
Public Structure Rectangle3d
 Описание
 Структура Rectangle3d представляет четыре точки, которые определяют вершины 3D-прямоугольника.
 Методы
 Конструкторы
 Имя
 Описание
 Rectangle3d
 Конструктор структуры Rectangle3d. Создает 3D-прямоугольник, используя заданные вершины.
 Топики
 Имя
 Описание
 Rectangle3d Методы
 Ниже перечислены методы класса Rectangle3d.
 Rectangle3d Свойства
 Ниже перечислены свойства класса Rectangle3d.
 Ссылки
 Rectangle3d Методы, Rectangle3d Свойства, Методы, Топики, Rectangle3d Методы, Rectangle3d Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!