Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotStyleData.Lineweight
 Послать отзыв
 Свойство Lineweight представляет вес (толщину) линии в данном объекте.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Lineweight;
Копировать Код
Public Property Lineweight As Double
 Возвращает
 Возвращает вес (толщину) линии. Тип double.
 Описание
 Свойство Lineweight представляет вес (толщину) линии в данном объекте.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.PlotStyleData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!