Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Scale2d.IsEqualTo
 Послать отзыв
 Метод проверяет равенство данного объекта вектору масштабирования, переданному в аргументе, с использованием заданной точности.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsEqualTo( Scale2d a, Tolerance tolerance );
Копировать Код
Public Function IsEqualTo( a As Scale2d, tolerance As Tolerance ) As Boolean
 Параметры
 Параметры
 Описание
 a
 Входной вектор масштабирования, который сравнивается с данным объектом. Тип Scale2d.
 tolerance
 Заданная геометрическая точность. Тип Tolerance.
 Возвращает
 Возвращает true, если в пределах используемой точности данный объект можно считать равным вектору масштабирования a. В противном случае возвращает false.
 Описание
 Метод проверяет равенство данного объекта вектору масштабирования, переданному в аргументе, с использованием заданной точности.
 Два экземпляра структуры Scale2d считаются равными, если в пределах предписанной точности одновременно выполняются следующие условия:
Равны масштабные коэффициенты по оси X;
Равны масштабные коэффициенты по оси Y.
 Ссылки
 Teigha.Geometry.Scale2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!