Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.XrefGraph.GetXrefNode
 Послать отзыв
 Метод позволяет получить объект XrefGraphNode по указанному индексу узла.
 Синтаксис
C#
Visual Basic
Копировать Код
public XrefGraphNode GetXrefNode( int idx );
Копировать Код
Public Function GetXrefNode( idx As Integer ) As XrefGraphNode
 Параметры
 Параметры
 Описание
 idx
 Индекс искомого узла. Тип int.
 Возвращает
 Возвращает объект XrefGraphNode, если узел найден, или null в противном случае.
 Описание
 Метод позволяет получить объект XrefGraphNode по указанному индексу узла.
 Ссылки
 Teigha.DatabaseServices.XrefGraph, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!