Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.TransformOverrule
 Послать отзыв
 Этот класс переопределяет подмножество операций, связанных с 3D-преобразованиями объекта. Используется в качестве базового для настройки поведения наследников класса Entity.
 Иерархия классов
Teigha::DatabaseServices::TransformOverrule
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdDbTransformOverrule")] public class TransformOverrule : Overrule;
Копировать Код
[Wrapper("OdDbTransformOverrule")] public class TransformOverrule : Overrule;
 Описание
 Этот класс переопределяет подмножество операций, связанных с 3D-преобразованиями объекта.
 Класс используется в качестве базового для настройки поведения наследников класса Entity. Каждая реализация по умолчанию вызывает соответствующий метод целевого класса.
 Топики
 Имя
 Описание
 TransformOverrule Методы
 Ниже перечислены методы класса TransformOverrule.
 Ссылки
 TransformOverrule Методы, Топики, TransformOverrule Методы
 Ваши комментарии по поводу этого топика: Послать отзыв!