Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBVisualStyle
 Послать отзыв
 Данный класс описывает визуальный стиль как объект базы данных.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::GraphicsInterface::Drawable Teigha::DatabaseServices::DBObject Teigha::DatabaseServices::DBVisualStyle
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("AcDbVisualStyle")] public class DBVisualStyle : DBObject;
Копировать Код
<Wrapper("AcDbVisualStyle")> Public Class DBVisualStyle Inherits DBObject
 Описание
 Данный класс описывает визуальный стиль как объект базы данных. Визуальный стиль содержит набор свойств, которые в совокупности определяют характер визуального отображения модели.
 Методы
 Конструкторы
 Teigha.GraphicsInterface.Drawable
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 Drawable
 Конструктор класса Teigha.GraphicsInterface.Drawable. (Унаследован от Drawable)
 Teigha.DatabaseServices.DBObject
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 DBObject
 Конструктор. (Унаследован от DBObject)
 Teigha.DatabaseServices.DBVisualStyle
 Имя
 Описание
 DBVisualStyle
 Это обзор перегрузок DBVisualStyle.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.GraphicsInterface.Drawable
 Имя
 Описание
 Drawable Методы
 Ниже перечислены методы класса Drawable.
 Drawable Свойства
 Ниже перечислены свойства класса Drawable.
 Teigha.DatabaseServices.DBObject
 Имя
 Описание
 DBObject Методы
 Ниже перечислены методы класса DBObject.
 DBObject Свойства
 Ниже перечислены свойства класса DBObject.
 DBObject События
 Ниже перечислены события класса DBObject.
 Teigha.DatabaseServices.DBVisualStyle
 Имя
 Описание
 DBVisualStyle Методы
 Ниже перечислены методы класса DBVisualStyle.
 DBVisualStyle Свойства
 Ниже перечислены свойства класса DBVisualStyle.
 Ссылки
 DBVisualStyle Конструктор, DBVisualStyle Методы, DBVisualStyle Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства, DBObject События
 Ваши комментарии по поводу этого топика: Послать отзыв!