Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Ole2Frame.Location
 Послать отзыв
 Свойство представляет координатную точку левого верхнего угла объекта OLE.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d Location;
Копировать Код
Public ReadOnly Property Location As Point3d
 Возвращает
 Возвращает точку привязки данного объекта. Тип Point3d.
 Описание
 Свойство представляет координатную точку левого верхнего угла объекта OLE.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Ole2Frame, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!