Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Entity.EntityColor
 Послать отзыв
 Свойство предназначено для установки или получения цветовых настроек геометрического объекта в виде экземпляра класса EntityColor, который может содержать информацию о цвете по индексу, true-цвете или цвете слоя.
 Синтаксис
C#
Visual Basic
Копировать Код
public Teigha.Colors.EntityColor EntityColor;
Копировать Код
Public Property EntityColor() As Teigha.Colors.EntityColor
 Возвращает
 Возвращает экземпляр класса Teigha.Colors.EntityColor, представляющий текущее значение цвета объекта. Это значение может быть использовано для определения или изменения способа отображения цвета объекта в чертеже.
 Описание
 Устанавливает или возвращает установки цвета геометрического объекта в виде EntityColor.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Entity, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!