Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.SetFieldId
 Послать отзыв
 Метод позволяет задать идентификатор ObjectId поля в элементе содержимого ячейки с указанным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetFieldId( int row, int column, int contentIndex, DatabaseServices.ObjectId fieldId, CellOption option );
Копировать Код
Public virtual Sub SetFieldId( row As Integer, column As Integer, contentIndex As Integer, fieldId As DatabaseServices.ObjectId, option As DatabaseServices.CellOption )
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 contentIndex
 Индекс элемента содержимого ячейки, тип int. Индекс должен быть больше или равен нулю и меньше количества элементов содержимого в ячейке.
 fieldId
 Идентификатор объекта поля. Тип DatabaseServices.ObjectId.
 option
 Значение из перечисления Teigha.DatabaseServices.CellOption. Если оно равно InheritCellFormat, то поле унаследует формат у ячейки.
 col
 Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
 Описание
 Метод позволяет задать идентификатор ObjectId поля в элементе содержимого ячейки с указанным индексом.
 Замечания
 Для получения того же результата предпочтительнее использовать Table.Cells[row,column].Contents[i].FieldId.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!