Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.SetAutoScale
 Послать отзыв
 Метод задает значение флага автомасштабирования, который определяет, следует ли автоматически подгонять вхождение блока под размер указанной ячейки.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetAutoScale( int row, int col, bool autoFit );
Копировать Код
Public Sub SetAutoScale( row As Integer, col As Integer, autoFit As Boolean )
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 col
 Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
 autoFit
 Флаг автомасштабирования вставляемого контента, тип bool. Если аргумент autoFit принимает значение true, объект Table автоматически вычисляет масштаб и точку вставки для содержимого блока, чтобы вписать его в указанную ячейку.
 Описание
 Метод задает значение флага автомасштабирования, который определяет, следует ли автоматически подгонять вхождение блока под размер указанной ячейки. Если аргумент autoFit принимает значение true, объект Table автоматически вычисляет масштаб и точку вставки для содержимого блока, чтобы вписать его в указанную ячейку.
 Замечания
 Для получения того же результата предпочтительнее использовать Table.Cells[row,column].Contents[i].IsAutoScale.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!