Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.ClipBoundary2d.Set
 Послать отзыв
 Метод позволяет переопределить данный объект так, чтобы его граница обрезки приняла вид полилинии с указанными вершинами.
 Синтаксис
C#
Visual Basic
Копировать Код
public ClipError Set( ref Point2dCollection clipBoundary );
Копировать Код
Public Function [Set]( ByRef clipBoundary As Point2dCollection ) As ClipError
 Параметры
 Параметры
 Описание
 clipBoundary
 Входная коллекция вершин новой границы обрезки. Тип Point2dCollection.
 Возвращает
 Возвращает результат выполнения метода из перечисления ClipError.
 Описание
 Метод позволяет переопределить данный объект так, чтобы его граница обрезки приняла вид полилинии с указанными вершинами.
 Ссылки
 Teigha.Geometry.ClipBoundary2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!