Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.NurbSurface.Rebuild
 Послать отзыв
 Метод позволяет перестроить NURBS поверхность с заданными новыми степенями сплайна и количеством управляющих вершин в направлениях u и v. Поддерживается режим восстановления поверхности. В текущей версии не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Rebuild( int iUDegree, int iVDegree, int iNumUCtrlPts, int iNumVCtrlPts, bool bRestore );
Копировать Код
Public Sub Rebuild( iUDegree As Integer, iVDegree As Integer, iNumUCtrlPts As Integer, iNumVCtrlPts As Integer, bRestore As Boolean )
 Параметры
 Параметры
 Описание
 iUDegree
 Новая степень сплайна в направлении u. Тип int.
 iVDegree
 Новая степень сплайна в направлении v. Тип int.
 iNumUCtrlPts
 Новое количество управляющих вершин в направлении u. Тип int.
 iNumVCtrlPts
 Новое количество управляющих вершин в направлении v. Тип int.
 bRestore
 Флаг восстановления формы поверхности. Тип bool.
 Описание
 Метод позволяет перестроить NURBS поверхность с заданными новыми степенями сплайна и количеством управляющих вершин в направлениях u и v. Эта операция изменяет форму поверхности. Дополнительный логический аргумент позволяет включить режим восстановления формы поверхности.
 В текущей версии не реализован.
 Ссылки
 Teigha.DatabaseServices.NurbSurface, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!