Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Light.Light
 Послать отзыв
 Конструктор по умолчанию класса Light.
 Синтаксис
C#
Visual Basic
Копировать Код
public Light();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса Light.
 Ссылки
 Teigha.DatabaseServices.Light, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!