Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.RemoveDataLink
 Послать отзыв
 Метод удаляет из таблицы все внешние ссылки.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void RemoveDataLink();
Копировать Код
Public virtual Sub RemoveDataLink()
 Описание
 Метод удаляет из таблицы все внешние ссылки.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!