Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Cell.Column
 Послать отзыв
 Свойство возвращает индекс столбца данной ячейки.
 Синтаксис
C#
Visual Basic
Копировать Код
public int Column;
Копировать Код
Public ReadOnly Property Column As Integer
 Возвращает
 Возвращает индекс столбца данной ячейки. Тип int.
 Описание
 Свойство возвращает индекс столбца данной ячейки.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Cell, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!