Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LayoutRenamedEventArgs
 Послать отзыв
 Этот класс представляет данные для событий переименования листа в диспетчере листов.
 Иерархия классов
Teigha::DatabaseServices::LayoutRenamedEventArgs
 Синтаксис
C#
Visual Basic
Копировать Код
public class LayoutRenamedEventArgs : EventArgs;
Копировать Код
Public Class LayoutRenamedEventArgs Inherits EventArgs
 Описание
 Этот класс представляет данные для событий переименования листа в диспетчере листов (AbortLayoutRename, LayoutRenamed, LayoutCreated и LayoutToBeRenamed).
 Топики
 Имя
 Описание
 LayoutRenamedEventArgs Свойства
 Ниже перечислены свойства класса LayoutRenamedEventArgs.
 Ссылки
 LayoutRenamedEventArgs Свойства, Топики, LayoutRenamedEventArgs Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!