Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Point2d.Equals
 Послать отзыв
 Метод выполняет проверку на равенство данной точки и указанного объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool Equals( ref Object obj );
Копировать Код
Public Function Equals( ByRef obj As Object ) As Boolean
 Параметры
 Параметры
 Описание
 obj
 Входной объект для сравнения. Тип Object.
 Возвращает
 Возвращает true, если obj не равен нулю и имеет те же координаты, что и данная точка.
 Описание
 Метод выполняет проверку на равенство данной точки и указанного объекта. В случае равенства возвращает true.
 Ссылки
 Teigha.Geometry.Point2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!