Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.VersionGuid
 Послать отзыв
 Синтаксис
C#
Visual Basic
public String VersionGuid;
Public Property VersionGuid() As String
 Описание
 Возвращает строку GUID версии базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!