Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector2d.GetPerpendicularVector
 Послать отзыв
 Метод предоставляет 2D-вектор, ортогональный данному вектору.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector2d GetPerpendicularVector();
Копировать Код
Public Function GetPerpendicularVector() As Vector2d
 Возвращает
 Возвращает вектор с координатами (-y, x), ортогональный данному вектору. Тип Vector2d.
 Описание
 Метод предоставляет 2D-вектор с координатами (-y, x), ортогональный данному вектору.
 Ссылки
 Teigha.Geometry.Vector2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!