Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotStyleData.PhysicalPenNumber
 Послать отзыв
 Свойство PhysicalPenNumber представляет номер физического пера для данного объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public int PhysicalPenNumber;
Копировать Код
Public Property PhysicalPenNumber As Integer
 Возвращает
 Возвращает номер физического пера. Тип int.
 Описание
 Свойство PhysicalPenNumber представляет номер физического пера, использование которого предусмотрено данным объектом.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.PlotStyleData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!