Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.SplineEntity3d.Order
 Послать отзыв
 Свойство Order представляет порядок данного сплайна. Не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public int Order;
Копировать Код
Public ReadOnly Property Order As Integer
 Возвращает
 Возвращает порядок данного сплайна. Тип int.
 Описание
 Свойство Order представляет порядок данного сплайна. Не реализовано.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.SplineEntity3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!