Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.BreakOptions
 Послать отзыв
 Данное свойство представляет опции разбиения таблицы.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual TableBreakOptions BreakOptions;
Копировать Код
Public virtual Property BreakOptions() As TableBreakOptions
 Возвращает
 Позволяет задать или возвращает значение из перечисления Teigha.DatabaseServices.TableBreakOptions.
 Описание
 Данное свойство представляет опции разбиения таблицы.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!