Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector2d.Vector2d
 Послать отзыв
 Конструктор структуры Vector2d. Создает новый 2D-вектор с указанными координатами.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector2d( double x, double y );
Копировать Код
Public Sub New( x As Double, y As Double )
 Параметры
 Параметры
 Описание
 x
 Координата X нового вектора. Тип double.
 y
 Координата Y нового вектора. Тип double.
 Описание
 Конструктор структуры Vector2d. Создает новый 2D-вектор с указанными координатами x и y.
 Ссылки
 Teigha.Geometry.Vector2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!