Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.RenderSettings.ShadowsEnabled
 Послать отзыв
 Свойство ShadowsEnabled позволяет определить, включено ли отбрасывание теней.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool ShadowsEnabled;
Копировать Код
Public Property ShadowsEnabled As Boolean
 Возвращает
 Возвращает true, если рендеринг теней включен. В противном случае возвращает false.
 Описание
 Свойство ShadowsEnabled позволяет определить, включено ли отбрасывание теней.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.RenderSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!