Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SkyBackground.SkyBackground
 Послать отзыв
 Конструктор по умолчанию класса SkyBackground.
 Синтаксис
C#
Visual Basic
Копировать Код
public SkyBackground();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса SkyBackground.
 Ссылки
 Teigha.DatabaseServices.SkyBackground, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!