Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.NurbSurface.ModifyPosition
 Послать отзыв
 Метод позволяет изменить положение точки на поверхности с указанным параметром ([u, v]). В текущей версии не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public void ModifyPosition( double dU, double dV, Point3d point );
Копировать Код
Public Sub ModifyPosition( dU As Double, dV As Double, point As Point3d )
 Параметры
 Параметры
 Описание
 dU
 Входной параметр U. Тип double.
 dV
 Входной параметр V. Тип double.
 point
 Новые координаты точки на поверхности. Тип Point3d.
 Описание
 Метод позволяет изменить положение точки на поверхности с указанным параметром ([u, v]). Соответствующим образом корректируются также и локальные управляющее вершины.
 В текущей версии не реализован.
 Ссылки
 Teigha.DatabaseServices.NurbSurface, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!