Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Rectangle3d.ToString
 Послать отзыв
 Метод позволяет получить эквивалентное представление данного объекта в виде текстовой строки.
 Синтаксис
C#
Visual Basic
Копировать Код
public sealed override String ToString();
Копировать Код
Public NotOverridable Overrides Function ToString() As String
 Возвращает
 Возвращает эквивалентное строковое представление данного объекта. Тип String.
 Описание
 Метод позволяет получить эквивалентное представление данного объекта в виде текстовой строки.
 Возвращаемая строка содержит точки вершин данного прямоугольника в следующем порядке:
Верхняя левая вершина.
Верхняя правая вершина.
Нижняя левая вершина.
Нижняя правая вершина.
 Ссылки
 Teigha.DatabaseServices.Rectangle3d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!