Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.EllipticalCylinder.MajorAxis
 Послать отзыв
 Свойство MajorAxis представляет направление большой оси эллиптического цилиндра.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d MajorAxis;
Копировать Код
Public ReadOnly Property MajorAxis As Vector3d
 Возвращает
 Возвращает направляющий вектор большой оси эллиптического цилиндра. Тип Vector3d.
 Описание
 Свойство MajorAxis представляет направление большой оси эллиптического цилиндра.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.EllipticalCylinder, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!