Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.RenderGlobal.DimensionsParameter.DimensionsParameter
 Послать отзыв
 Конструктор структуры DimensionsParameter. Создает экземпляр структуры с указанными значениями высоты и ширины.
 Синтаксис
C#
Visual Basic
Копировать Код
public DimensionsParameter( int w, int h );
Копировать Код
Public Sub New( w As Integer, h As Integer )
 Параметры
 Параметры
 Описание
 w
 Ширина. Тип int.
 h
 Высота. Тип int.
 Описание
 Конструктор структуры DimensionsParameter. Создает экземпляр структуры с указанными значениями высоты и ширины.
 Ссылки
 Teigha.DatabaseServices.RenderGlobal.DimensionsParameter, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!