Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Делегат Teigha.DatabaseServices.LayoutRenamedEventHandler
 Послать отзыв
 This is type Teigha::DatabaseServices::LayoutRenamedEventHandler.
 Синтаксис
C#
Visual Basic
public delegate LayoutRenamedEventHandler();
Public Delegate Sub LayoutRenamedEventHandler()
 Ваши комментарии по поводу этого топика: Послать отзыв!