Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Viewport.FrontClipDistance
 Послать отзыв
 Свойство FrontClipDistance представляет расстояние до передней плоскости отсечения в данном видовом экране.
 Синтаксис
C#
Visual Basic
Копировать Код
public double FrontClipDistance;
Копировать Код
Public Property FrontClipDistance As Double
 Возвращает
 Возвращает расстояние до передней плоскости отсечения. Тип double.
 Описание
 Свойство FrontClipDistance представляет расстояние до передней плоскости отсечения в данном видовом экране.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Viewport, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!