Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MeshPointMap.MeshPointMap
 Послать отзыв
 Конструктор структуры MeshPointMap.
 Синтаксис
C#
Visual Basic
Копировать Код
public MeshPointMap( Point2d sourcePt, Point2d destPt );
Копировать Код
Public Sub New( sourcePt As Point2d, destPt As Point2d )
 Параметры
 Параметры
 Описание
 sourcePt
 Исходная точка. Тип Point2d.
 destPt
 Точка назначения. Тип Point2d.
 Описание
 Конструктор структуры MeshPointMap.
 Ссылки
 Teigha.DatabaseServices.MeshPointMap, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!