Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 BlockTableRecord.BlockScaling
 Послать отзыв
 В свойстве хранятся характеристики масштабирования вставок данного определения блока.
 Синтаксис
C#
Visual Basic
Копировать Код
public Teigha.DatabaseServices.BlockScaling BlockScaling { get; set; }
Копировать Код
Public Property BlockScaling As Teigha.DatabaseServices.BlockScaling
 Возвращает
 Возвращает/принимает одно из значений перечисления BlockScaling.
 Описание
 Свойство предназначено для хранения характеристик масштабирования вставок блока. Возможно два варианта: масштабирование одинаково для всех вставок или возможен свой масштаб для каждой вставки.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.BlockTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!