Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Torus.GetAnglesInV
 Послать отзыв
 Метод предоставляет начальный и конечный углы V поворота в пределах образующей окружности тора.
 Синтаксис
C#
Visual Basic
Копировать Код
public double[] GetAnglesInV();
Копировать Код
Public Function GetAnglesInV() As Double()
 Возвращает
 Возвращает двухэлементный массив, в котором нулевой и первый элементы представляют начальное и конечное значения V, соответственно. Тип double[].
 Описание
 Метод предоставляет начальный и конечный углы V поворота в пределах образующей окружности тора (начальную и конечную широту).
 Замечания
 Результатом является массив с начальными и конечными углами для параметра V. Индексы возвращаемого массива:
0 — Начальный угол V.
1 — Конечный угол V.
 Ссылки
 Teigha.Geometry.Torus, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!