Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство RasterImage.DisplayOptions
 Послать отзыв
 Синтаксис
C#
Visual Basic
public ImageDisplayOptions DisplayOptions;
Public Property DisplayOptions() As ImageDisplayOptions
 Описание
 Обеспечивает доступ к текущему значению свойств отображения.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.RasterImage, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!