Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbSurfaceDefinition.NumberOfControlPointsInV
 Послать отзыв
 Свойство NumberOfControlPointsInV представляет количество управляющих вершин в направлении V.
 Синтаксис
C#
Visual Basic
Копировать Код
public int NumberOfControlPointsInV;
Копировать Код
Public ReadOnly Property NumberOfControlPointsInV As Integer
 Возвращает
 Возвращает количество управляющих вершин в направлении V. Тип int.
 Описание
 Свойство NumberOfControlPointsInV представляет количество управляющих вершин в направлении V.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.NurbSurfaceDefinition, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!