Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DragStatus
 Послать отзыв
 Перечисление DragStatus определяет статусы процесса перетаскивания.
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdDb.DragStatus")] public enum DragStatus { DragStart = 0, DragEnd = 1, DragAbort = 2 }
Копировать Код
<Wrapper("OdDb.DragStatus")> Public Enum DragStatus DragStart = 0 DragEnd = 1 DragAbort = 2 End Enum
 Члены
 Члены
 Описание
 DragAbort
 Значение: 2. Прерывание операции перетаскивания.
 DragEnd
 Значение: 1. Завершение операции перетаскивания.
 DragStart
 Значение: 0. Начало операции перетаскивания.
 Описание
 Перечисление DragStatus определяет статусы процесса перетаскивания.
 Ваши комментарии по поводу этого топика: Послать отзыв!