Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.OffsetCurve2d.Curve
 Послать отзыв
 Свойство Curve представляет базовую кривую данной кривой смещения.
 Синтаксис
C#
Visual Basic
Копировать Код
public Curve2d Curve;
Копировать Код
Public Property Curve As Curve2d
 Возвращает
 Возвращает базовую кривую для данного объекта. Тип Curve2d.
 Описание
 Свойство Curve представляет базовую кривую данной кривой смещения.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.Geometry.OffsetCurve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!