Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ObjectOverrule.SetCustomFilter
 Послать отзыв
 Метод включает использование метода IsApplicable, чтобы установить, должно ли к данному объекту применяться переопределение.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetCustomFilter();
Копировать Код
Public Sub SetCustomFilter()
 Описание
 Метод включает использование метода IsApplicable, чтобы установить, должно ли к данному объекту применяться переопределение.
 Ссылки
 Teigha.DatabaseServices.ObjectOverrule, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!