Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector2d.IsEqualTo
 Послать отзыв
 Метод позволяет проверить, совпадает ли входной вектор с данным вектором в пределах некоторой заданной точности.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsEqualTo( Vector2d vector, Tolerance tolerance );
Копировать Код
Public Function IsEqualTo( vector As Vector2d, tolerance As Tolerance ) As Boolean
 Параметры
 Параметры
 Описание
 vector
 Проверяемый вектор. Тип Vector2d.
 tolerance
 Заданная геометрическая точность. Тип Tolerance.
 Возвращает
 Возвращает true, если в пределах используемой точности совпадают все соответствующие координаты обоих векторов. В противном случае возвращает false.
 Описание
 Метод позволяет проверить, совпадает ли входной вектор с данным вектором в пределах некоторой заданной точности.
 Замечания
 Векторы считаются равными, если в пределах предписанной точности совпадают все соответствующие координаты обоих векторов.
 Ссылки
 Teigha.Geometry.Vector2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!