Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DwgFiler.WriteVector3d
 Послать отзыв
 Метод записывает в этот Filer указанный объект Vector3d.
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract void WriteVector3d( Vector3d value );
Копировать Код
Public MustOverride Sub WriteVector3d( value As Vector3d )
 Параметры
 Параметры
 Описание
 value
 Записываемое в Filer значение. Тип Vector3d.
 Описание
 Метод записывает в этот Filer указанный объект Vector3d.
 Ссылки
 Teigha.DatabaseServices.DwgFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!