Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Material.Opacity
 Послать отзыв
 Свойство представляет компонент непрозрачности этого материала.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual MaterialOpacityComponent Opacity;
Копировать Код
Public Overridable Property Opacity As MaterialOpacityComponent
 Возвращает
 Возвращает компонент непрозрачности материала. Тип MaterialOpacityComponent.
 Описание
 Свойство представляет компонент непрозрачности этого материала.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Material, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!