Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Surface.CreateOffsetSurface
 Послать отзыв
 Метод позволяет создать поверхность смещением указанного объекта на заданное расстояние.
 Синтаксис
C#
Visual Basic
Копировать Код
public static Entity CreateOffsetSurface( ref Entity entity, double offsetDistance );
Копировать Код
Public Shared Function CreateOffsetSurface( ByRef entity As Entity, offsetDistance As Double ) As Entity
 Параметры
 Параметры
 Описание
 entity
 Входная поверхность для смещения. Тип Entity.
 offsetDistance
 Величина смещения (в единицах чертежа). Тип double.
 Возвращает
 Возвращает поверхность, полученную смещением. Тип Entity.
 Описание
 Метод позволяет создать поверхность смещением указанного объекта на заданное расстояние.
 Замечания
 Этот метод реализован только в среде пространственного моделирования Spatial Modeler.
 Ссылки
 Teigha.DatabaseServices.Surface, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!