Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DrawOrderTable
 Послать отзыв
 Класс DrawOrderTable предназначен для управления порядком отрисовки объектов, принадлежащих записи таблицы блоков.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::GraphicsInterface::Drawable Teigha::DatabaseServices::DBObject Teigha::DatabaseServices::DrawOrderTable
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("AcDbSortentsTable")] public class DrawOrderTable : DBObject;
Копировать Код
<Wrapper("AcDbSortentsTable")> Public Class DrawOrderTable Inherits DBObject
 Описание
 Класс DrawOrderTable предназначен для управления порядком отрисовки объектов, принадлежащих записи таблицы блоков.
 Каждое определение блока содержит информацию о порядке отрисовки своих объектов. В процессе отрисовки объектов конкретной записи таблицы блоков, итератор обходит эту запись в порядке возрастания дескрипторов (handle) объектов. Порядок отрисовки этих объектов определяется объектом DrawOrderTable, который хранится в словаре расширения записи таблицы блоков. Если очередному дескриптору объекта в DrawOrderTable поставлен в соответствие объект HandlePair, то отрисовывается объект, на который указывает HandlePair. В отсутствие объекта HandlePair, отрисовывается сам объект, на который ссылается итератор.
 Для настройки последовательности отрисовки объектов предусмотрены методы MoveAbove, MoveBelow, MoveToBottom, MoveToTop, SwapOrder и т.д.
 Замечания
 Данный класс является .NET оберткой для NRX класса OdDbSortentsTable.
 Методы
 Конструкторы
 Teigha.GraphicsInterface.Drawable
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 Drawable
 Конструктор класса Teigha.GraphicsInterface.Drawable. (Унаследован от Drawable)
 Teigha.DatabaseServices.DBObject
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 DBObject
 Конструктор. (Унаследован от DBObject)
 Teigha.DatabaseServices.DrawOrderTable
 Имя
 Описание
 DrawOrderTable
 Конструктор класса DrawOrderTable.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.GraphicsInterface.Drawable
 Имя
 Описание
 Drawable Методы
 Ниже перечислены методы класса Drawable.
 Drawable Свойства
 Ниже перечислены свойства класса Drawable.
 Teigha.DatabaseServices.DBObject
 Имя
 Описание
 DBObject Методы
 Ниже перечислены методы класса DBObject.
 DBObject Свойства
 Ниже перечислены свойства класса DBObject.
 DBObject События
 Ниже перечислены события класса DBObject.
 Teigha.DatabaseServices.DrawOrderTable
 Имя
 Описание
 DrawOrderTable Методы
 Ниже перечислены методы класса DrawOrderTable.
 DrawOrderTable Свойства
 Ниже перечислены свойства класса DrawOrderTable.
 Ссылки
 DrawOrderTable Методы, DrawOrderTable Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства, DBObject События
 Ваши комментарии по поводу этого топика: Послать отзыв!