Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CircularArc2d.Set
 Послать отзыв
 Метод позволяет переопределить данную дугу так, чтобы она была касательной к трем указанным 2D-кривым.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Set( ref Curve2d curve1, ref Curve2d curve2, ref Curve2d curve3, double parameter1, double parameter2, double parameter3 );
Копировать Код
Public Sub Set( ByRef curve1 As Curve2d, ByRef curve2 As Curve2d, ByRef curve3 As Curve2d, parameter1 As Double, parameter2 As Double, parameter3 As Double )
 Параметры
 Параметры
 Описание
 curve1
 Первая 2D-кривая, задающая условие касательности дуги. Тип Curve2d.
 curve2
 Вторая 2D-кривая, задающая условие касательности дуги. Тип Curve2d.
 curve3
 Третья 2D-кривая, задающая условие касательности дуги. Тип Curve2d.
 parameter1
 Возвращает параметр, соответствующий точке касания на кривой curve1. Тип double.
 parameter2
 Возвращает параметр, соответствующий точке касания на кривой curve2. Тип double.
 parameter3
 Возвращает параметр, соответствующий точке касания на кривой curve3. Тип double.
 Описание
 Метод позволяет переопределить данную дугу так, чтобы она была касательной к трем указанным 2D-кривым.
 Замечания
 Если круглую дугу с указанными параметрами построить не удаётся, то данная дуга будет оставлена без изменений.
 Ссылки
 Teigha.Geometry.CircularArc2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!