Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PatternDefinition.OffsetY
 Послать отзыв
 Свойство представляет y-компоненту смещения.
 Синтаксис
C#
Visual Basic
Копировать Код
public double OffsetY;
Копировать Код
Public ReadOnly Property OffsetY As Double
 Возвращает
 Возвращает y-компоненту смещения. Тип double.
 Описание
 Свойство представляет y-компоненту смещения.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.PatternDefinition, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!