Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Matrix3d.IsInverse
 Послать отзыв
 Метод позволяет проверить, является ли указанная матрица обратной по отношению к данной матрице в пределах заданного допуска.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsInverse( Matrix3d inv, Tolerance tolerance );
Копировать Код
Public Function IsInverse( inv As Matrix3d, tolerance As Tolerance ) As Boolean
 Параметры
 Параметры
 Описание
 inv
 Матрица, с которой выполняется сравнение. Тип Matrix3d.
 tolerance
 Допуск, используемый для сравнеия. Тип Tolerance.
 Возвращает
 Возвращает true, если матрица inv является обратной по отношению к данной, иначе - false.
 Описание
 Метод позволяет проверить, является ли матрица inv обратной по отношению к данной матрице в пределах заданного допуска tolerance.
 Ссылки
 Teigha.Geometry.Matrix3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!