Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve3d.StartPoint
 Послать отзыв
 Свойство возвращает начальную точку кривой.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d StartPoint;
Копировать Код
Public Property StartPoint() As Point3d
 Возвращает
 Возвращает начальную точку кривой. Тип Point3d.
 Описание
 Свойство возвращает начальную точку кривой.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.Curve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!