Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.NurbSurface.UKnots
 Послать отзыв
 Свойство представляет узловой вектор данной поверхности в направлении u.
 Синтаксис
C#
Visual Basic
Копировать Код
public KnotCollection UKnots;
Копировать Код
Public ReadOnly Property UKnots As KnotCollection
 Возвращает
 Возвращает узловой вектор поверхности. Тип KnotCollection.
 Описание
 Свойство представляет узловой вектор данной поверхности в направлении u.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.NurbSurface, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!