Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DxfFiler.ReadInt32
 Послать отзыв
 Метод возвращает 32-разрядное целое число со знаком из текущего элемента этого объекта Filer.
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract int ReadInt32();
Копировать Код
Public MustOverride Function ReadInt32() As Integer
 Возвращает
 Возвращает 32-разрядное целое число со знаком. Тип int.
 Описание
 Метод возвращает 32-разрядное целое число со знаком из текущего элемента этого объекта Filer.
 Ссылки
 Teigha.DatabaseServices.DxfFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!