Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.PointOnSurface.GetTangentVector
 Послать отзыв
 Метод позволяет вычислить 3D-вектор в плоскости, касательной к поверхности в данной точке, которому соответствует указанный 2D-вектор в пространстве параметров. В текущей версии не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d GetTangentVector( Vector2d vector );
Копировать Код
Public Function GetTangentVector( vector As Vector2d ) As Vector3d
 Параметры
 Параметры
 Описание
 vector
 Входной 2D-вектор в пространстве параметров. Тип Vector2d.
 Возвращает
 Возвращает 3D-вектор в касательной плоскости, который соответствует параметрически заданному 2D-вектору vector. Тип Vector3d.
 Описание
 Метод позволяет вычислить 3D-вектор в плоскости, касательной к поверхности в данной точке, которому соответствует указанный 2D-вектор vector в пространстве параметров. Возвращаемый вектор имеет вид:
 Копировать Код
tangentVector = GetUDerivative(1) * vector.x + GetVDerivative(1) * vector.y
 В текущей версии этот метод не реализован.
 Ссылки
 Teigha.Geometry.PointOnSurface, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!