Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 DimStyleTableRecord.Dimdle
 Послать отзыв
 Свойство отвечает за удлинение размерных линий за выносные, когда стрелки архитектурные, цельные, косой, галочка или нет.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual double Dimdle { get; set; }
Копировать Код
Public Overridable Property Dimdle As Double
 Возвращает
 Возвращает тип данных double.
 Описание
 В свойстве хранится длина выноса размерных линий за выносные в виде числа double. Значение по умолчанию 0.
 Свойство также доступно через системную переменную DIMDLE и пользовательское меню в окне изменения/создания размерного стиля:
  При изменении системной переменной DIMDLE будет создан новый размерный стиль под названием <переопределение> на основе текущего с новым значением DIMDLE.
 Условия
 Чтение и запись.
 Пример
 Пример изменения удлинения размерных линий за выносные (значения свойства Dimdle) в размерном стиле "Standard":
C#
 Копировать Код
public partial class Commands { [Teigha.Runtime.CommandMethod("DimdleChange")] public void DimdleStandardDimStyle() { // Получение ссылки на активный документ HostMgd.ApplicationServices.Document doc = HostMgd.ApplicationServices.Application.DocumentManager.MdiActiveDocument; // Получение ссылки на редактор документа HostMgd.EditorInput.Editor ed = doc.Editor; // Получение ссылки на базу данных документа Teigha.DatabaseServices.Database db = doc.Database; // Начало транзакции с базой данных документа using (Teigha.DatabaseServices.Transaction trans = db.TransactionManager.StartTransaction()) { // Открываем таблицу размерных стилей для чтения Teigha.DatabaseServices.DimStyleTable dimStyleTable = trans.GetObject(db.DimStyleTableId, Teigha.DatabaseServices.OpenMode.ForRead) as Teigha.DatabaseServices.DimStyleTable; // Находим в таблице размерных стилей ObjectId нужного стиля по его названию Teigha.DatabaseServices.ObjectId styleId = dimStyleTable["Standard"]; // Открываем таблицу размерного стиля для изменений Teigha.DatabaseServices.DimStyleTableRecord obj = trans.GetObject(styleId, Teigha.DatabaseServices.OpenMode.ForWrite) as Teigha.DatabaseServices.DimStyleTableRecord; ed.WriteMessage($"nDimdle before: {obj.Dimdle}"); // Изменяем размер выступа размерных линий за пределы выносных obj.Dimdle = 3; ed.WriteMessage($"nDimdle after: {obj.Dimdle}"); trans.Commit(); } } }
 Результат работы команды DimdleChange:
 Было:
 Стало:
 Ссылки
 Teigha.DatabaseServices.DimStyleTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!