Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.AugmentedPolylineCurve3d.GetPointAt
 Послать отзыв
 Метод позволяет получить точку с указанным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d GetPointAt( int index );
Копировать Код
Public Function GetPointAt( index As Integer ) As Point3d
 Параметры
 Параметры
 Описание
 index
 Входной индекс искомой точки. Тип int.
 Возвращает
 Возвращает точку с указанным индексом. Тип Point3d.
 Описание
 Метод позволяет получить точку с указанным индексом.
 Ссылки
 Teigha.Geometry.AugmentedPolylineCurve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!