Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.IsHeaderSuppressed
 Послать отзыв
 Устарело. Используйте функционал объекта Cell. Свойство позволяет подавлять или отменять подавление строки заголовков столбцов объекта Table.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual bool IsHeaderSuppressed;
Копировать Код
Public virtual Property IsHeaderSuppressed() As Boolean
 Возвращает
 Возвращает true в случае подавления строки заголовков столбцов таблицы, в противном случае - false.
 Описание
 Данное свойство предоставляет доступ на изменение к флагу подавления строки заголовков столбцов объекта Table.
 Замечания
 Это свойство устарело. Используйте функционал объекта Cell.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!