Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.PointOnCurve3d.GetPointOnCurve
 Послать отзыв
 Метод восстанавливает параметрическое представление заданной кривой и возвращает 3D-точку на кривой, координаты которой соответствуют заданному значению параметра.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d GetPointOnCurve( ref Curve3d curve, double parameter );
Копировать Код
Public Function GetPointOnCurve( ByRef curve As Curve3d, parameter As Double ) As Point3d
 Параметры
 Параметры
 Описание
 curve
 Входная произвольная 3D-кривая. Тип Curve3d.
 parameter
 Входное значение параметра. Тип double.
 Возвращает
 Возвращает 3D-точку, положение которой определяется точкой на кривой с указанным значением параметра. Тип Point3d.
 Описание
 Метод восстанавливает параметрическое представление заданной кривой и возвращает 3D-точку на кривой, координаты которой соответствуют заданному значению параметра.
 Ссылки
 Teigha.Geometry.PointOnCurve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!