Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CellRange.CanDeleteColumns
 Послать отзыв
 Свойство позволяет определить, возможно ли удаление столбцов из диапазона.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool CanDeleteColumns;
Копировать Код
Public ReadOnly Property CanDeleteColumns As Boolean
 Возвращает
 Возвращает true, если удаление столбцов возможно. В противном случае возвращает false.
 Описание
 Свойство позволяет определить, возможно ли удаление столбцов из диапазона.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.CellRange, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!