Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LineWeightConverter.CanConvertFrom
 Послать отзыв
 Метод позволяет проверить, возможно ли преобразовать предоставленный тип в данный тип.
 Синтаксис
C#
Visual Basic
Копировать Код
public override bool CanConvertFrom( ref ITypeDescriptorContext context, ref Type sourceType );
Копировать Код
Public Overrides Function CanConvertFrom( ByRef context As ITypeDescriptorContext, ByRef sourceType As Type ) As Boolean
 Параметры
 Параметры
 Описание
 context
 Контекст для преобразования sourceType. Тип ITypeDescriptorContext.
 sourceType
 Входной тип для преобразования. Тип Type.
 Возвращает
 Возвращает true, если sourceType возможно преобразовать в данный тип. В противном случае возвращает false.
 Описание
 Метод позволяет проверить, возможно ли преобразовать предоставленный тип sourceType в данный тип.
 Ссылки
 Teigha.DatabaseServices.LineWeightConverter, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!