Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.SetGridDoubleLineSpacing
 Послать отзыв
 Метод позволяет установить величину просвета между двойными линиями сетки для ячеек, строк и столбцов.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetGridDoubleLineSpacing( int row, int column, GridLineType gridLineType, double spacing );
Копировать Код
Public virtual Sub SetGridDoubleLineSpacing( row As Integer, column As Integer, gridLineType As GridLineType, spacing As double )
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс может равняться -1.
 spacing
 Значение просвета у двойной линии сетки. Тип double.
 col
 Индекс столбца, тип int. Индекс может равняться -1.
 gridlineType
 Тип линии сетки из перечисления GridLineType.
 Описание
 Метод позволяет установить величину просвета между двойными линиями сетки для ячеек, строк и столбцов.
 Чтобы задать одинаковое значение сразу для нескольких типов линий сетки, можно объединить несколько типов линий сетки с помощью оператора OR.
 Чтобы задать ячейку, следует указать допустимые индексы строки и столбца. Чтобы задать строку, следует указать допустимый индекс строки и -1 в качестве индекса столбца. Чтобы задать столбец, следует указать допустимый индекс столбца и -1 в качестве индекса строки.
 Замечания
 Для получения того же результата предпочтительнее использовать Table.Cells[row,column].{Top,Bottom,Left,Right}Edge.DoubleLineSpacing.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!