Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Matrix2d.IsEqualTo
 Послать отзыв
 Метод реализует проверку равенства двух матриц с использованием точности по умолчанию.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsEqualTo( Matrix2d a );
Копировать Код
Public Function IsEqualTo( a As Matrix2d ) As Boolean
 Параметры
 Параметры
 Описание
 a
 Входная матрица, которая сравнивается с данной. Тип Matrix2d.
 Возвращает
 Возвращает true, если в пределах используемой точности каждый элемент данной матрицы равен соответствующему элементу матрицы a. В противном случае возвращает false.
 Описание
 Метод позволяет проверить, равна ли данная матрица указанной матрице. Используется вызов метода Matrix2d.IsEqualTo(Matrix2d a, Tolerance tolerance) с точностью по умолчанию, которая равна Tolerance.Global.
 Ссылки
 Teigha.Geometry.Matrix2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!