Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Database.CountHardReferences
 Послать отзыв
 Синтаксис
C#
Visual Basic
public void CountHardReferences(ref ObjectIdCollection ids, ref array<int> count);
Public Sub CountHardReferences(ByRef ids As ObjectIdCollection, ByRef count As array<int>)
 Параметры
 Параметры
 Описание
 ids
 Коллекция Id объектов для поиска количества жестких ссылок на эти объекты
 count
 Массив того же размера, что и ids, в котором ведется подсчет количества ссылок для каждого из элементов ids
 Описание
 Эта функция просматривает базу данных в поиске объектов с жесткими ссылками на любые из объектов, Id которых есть в массиве ids. Каждый раз, когда такая ссылка найдена, элемент count, соответствующий порядковому номеру Id в массиве ids, увеличивается на 1. Например, если найдена ссылка на объект ids[2], то значение count[2] массива будет увеличено на 1.
 На том, кто вызывает метод, лежит ответственность за то, чтобы элементы массива count были обнулены до вызова (или имели требуемые начальные значения). Функция просто увеличивает любые значения, которые были. Также на том, кто вызывает метод, лежит ответственность за то, чтобы ids и count имели одинаковые размеры.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!