Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.GetContentTypes
 Послать отзыв
 Метод предназначен для получения типа указанного по индексу элемента содержимого заданной ячейки.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual CellContentTypes GetContentTypes( int row, int column, int contentIndex );
Копировать Код
Public virtual Function GetContentTypes( row As Integer, column As Integer, contentIndex As Integer ) As CellContentTypes
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 contentIndex
 Индекс элемента содержимого ячейки, тип int. Индекс должен быть больше или равен нулю и меньше количества элементов содержимого в ячейке.
 col
 Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
 Возвращает
 Возвращает тип элемента содержимого ячейки из перечисления Teigha.DatabaseServices.CellContentTypes.
 Описание
 Метод предназначен для получения типа указанного по индексу элемента содержимого ячейки, заданной индексами строки и столбца.
 Замечания
 Для получения того же результата предпочтительнее использовать Table.Cells[row,column].Content[i].ContentTypes.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!