Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Polyline.Reset
 Послать отзыв
 Синтаксис
C#
Visual Basic
public void Reset(bool reuse, int vertices);
Public Sub Reset(reuse As bool, vertices As Integer)
 Параметры
 Параметры
 Описание
 reuse
 Признак, указывающий, сохраняется или нет, информация о некоторых вершинах
 vertices
 Количество остающихся вершин
 Описание
 Этот метод перезадает данные вершин полилинии.
 Если reuse установлен в true, то NumberOfVertices количество вершин полилинии остается нетронутыми, а все вершины после этого числа удаляются.
 Если reuse установлен в false, то значение NumberOfVertices игнорируется, и информация обо всех существующих вершинах удаляется.
 Ссылки
 Teigha.DatabaseServices.Polyline, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!