Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.DeleteColumns
 Послать отзыв
 Метод предназначен для удаления из таблицы указанного количества столбцов, начиная со столбца с указанным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void DeleteColumns( int col, int columns );
Копировать Код
Public virtual Sub DeleteColumns( col As Integer, columns As Integer )
 Параметры
 Параметры
 Описание
 col
 Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
 columns
 Количество удаляемых столбцов, тип int.
 Описание
 Метод предназначен для удаления из таблицы указанного количества столбцов, начиная со столбца с указанным индексом.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!