Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.Dimalttd
 Послать отзыв
 Свойство определяет количество десятичных знаков после запятой, используемых при отображении отклонений размеров в альтернативных единицах измерения.
 Синтаксис
C#
Visual Basic
Копировать Код
public int Dimalttd;
Копировать Код
Public Property Dimalttd As Integer
 Возвращает
 Возвращает количество десятичных знаков после запятой для отображения значений размеров. Тип int.
 Описание
 Свойство определяет количество десятичных знаков после запятой, используемых при отображении отклонений размеров в альтернативных единицах измерения. Это свойство действует при условии, что для свойств Dimalt и Dimtol установлено значение true.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!