Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Surface.Thicken
 Послать отзыв
 Метод предназначен для создания трехмерного твердого тела утолщением данной поверхности на указанную величину.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual Solid3d Thicken( double thickness, bool bothSides );
Копировать Код
Public Overridable Function Thicken( thickness As Double, bothSides As Boolean ) As Solid3d
 Параметры
 Параметры
 Описание
 thickness
 Величина утолщения. Тип double.
 bothSides
 Флаг, определяющий, должно ли утолщение выполняться в обе стороны от исходной поверхности. Тип bool.
 Возвращает
 Возвращает твердое тело, созданное в результате утолщения. Тип Solid3d. В случае ошибки метода возвращает NULL.
 Описание
 Метод предназначен для создания трехмерного твердого тела утолщением данной поверхности на указанную величину.
 Знак параметра thickness определяет направление утолщения. Положительные значения приводят к утолщению в положительном направлении нормали к поверхности. Если толщина меньше нуля, поверхность будет утолщена в противоположном направлении. Логический аргумент bothSides позволяет включить режим симметричного утолщения.
 Замечания
 Этот метод реализован только в среде пространственного моделирования.
 Ссылки
 Teigha.DatabaseServices.Surface, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!