Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObjectCollection.CopyTo
 Послать отзыв
 Копирует в коллекцию объекты из массива указанного массива.
 Синтаксис
C#
Visual Basic
Копировать Код
public void CopyTo( ref DBObject[], int index );
Копировать Код
Public Function CopyTo( ByRef arr As DBObject[], index As Integer )
 Параметры
 Параметры
 Описание
 index
 Индекс, с которого начинается копирование элементов массива. Индексация в массиве начинается с нуля.
 array
 Массив объектов типа DBObject, которые следует скопировать в коллекцию.
 Описание
 Копирует в коллекцию объекты из массива указанного массива.
 Ссылки
 Teigha.DatabaseServices.DBObjectCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!