Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SecurityParameters.==
 Послать отзыв
 Оператор равенства для класса SecurityParameters.
 Синтаксис
C#
Visual Basic
Копировать Код
public static bool operator ==( ref SecurityParameters a, ref SecurityParameters b );
Копировать Код
Public Shared Operator =( ByRef a As SecurityParameters, ByRef b As SecurityParameters ) As Boolean
 Параметры
 Параметры
 Описание
 a
 Левый операнд. Тип SecurityParameters.
 b
 Правый операнд. Тип SecurityParameters.
 Возвращает
 Возвращает true, если левый операнд равен правому (при этом оба не могут быть одновременно представлены нулевыми указателями. В противном случае возвращает false.
 Критерием равенства ненулевых операндов является одновременное выполнение следующих условий:
Совпадают пароли.
Совпадают имена провайдеров криптографии.
Совпадают имена субъектов сертификата (цифрового ID).
Совпадают имена эмитентов сертификата (цифрового ID).
Совпадают серийные номера сертификата.
Совпадают дополнительные комментарии, предоставляемые с подписью.
Совпадают имена серверов времени, используемых для установления временных меток.
Совпадают заявленные действия.
Совпадают используемые алгоритмы шифрования.
Совпадают используемые длины ключей.
Совпадают типы провайдеров шифрования.
 Описание
 Оператор равенства для класса SecurityParameters.
 Ссылки
 Teigha.DatabaseServices.SecurityParameters, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!