Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.TypedValue
 Послать отзыв
 Класс TypedValue реализует тип значения для хранения объектов различных типов. Конкретный тип хранимого значения определяется свойством TypeCode.
 Иерархия классов
Teigha::DatabaseServices::TypedValue
 Синтаксис
C#
Visual Basic
Копировать Код
[StructLayout(LayoutKind.Sequential)] public class TypedValue;
Копировать Код
<StructLayout(LayoutKind.Sequential)> Public Class TypedValue
 Описание
 Класс TypedValue реализует тип значения для хранения объектов различных типов. Конкретный тип хранимого значения определяется свойством TypeCode. Экземпляры этого класса используются в результирующих буферах для представления данных в виде пар "код – значение".
 Методы
 Конструкторы
 Имя
 Описание
 TypedValue
 Это обзор перегрузок TypedValue.
 Топики
 Имя
 Описание
 TypedValue Методы
 Ниже перечислены методы класса TypedValue.
 TypedValue Операторы
 Ниже перечислены операторы класса TypedValue.
 TypedValue Свойства
 Ниже перечислены свойства класса TypedValue.
 Ссылки
 TypedValue Конструктор, TypedValue Методы, TypedValue Операторы, TypedValue Свойства, Методы, Топики, TypedValue Методы, TypedValue Операторы, TypedValue Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!