Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Cell.GetExtents
 Послать отзыв
 Метод предназначен для получения ограничивающего бокса данной ячейки в виде коллекции трехмерных точек.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3dCollection GetExtents();
Копировать Код
Public Function GetExtents() As Point3dCollection
 Возвращает
 Возвращает коллекцию трехмерных точек, которые определяют ограничивающий бокс данной ячейки. Тип Point3dCollection.
 Описание
 Метод предназначен для получения ограничивающего бокса данной ячейки в виде коллекции трехмерных точек Point3dCollection.
 Ссылки
 Teigha.DatabaseServices.Cell, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!