Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CurveBoundary.IsOwnerOfCurves
 Послать отзыв
 Свойство IsOwnerOfCurves позволяет проверить, является ли данный объект CurveBoundary владельцем данных представления границы.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsOwnerOfCurves;
Копировать Код
Public ReadOnly Property IsOwnerOfCurves As Boolean
 Возвращает
 Возвращает true, если данные представления границы принадлежат данному объекту. В противном случае возвращает false.
 Описание
 Свойство IsOwnerOfCurves позволяет проверить, является ли данный объект CurveBoundary владельцем данных представления границы.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.CurveBoundary, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!