Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Region.Perimeter
 Послать отзыв
 Свойство Perimeter представляет текущий периметр данной области.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual double Perimeter;
Копировать Код
Public Overridable ReadOnly Property Perimeter As Double
 Возвращает
 Возвращает периметр области. Тип double.
 Описание
 Свойство Perimeter представляет текущий периметр данной области. Значение периметра возвращается в единицах чертежа.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Region, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!