Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 ViewTableRecord.IsPaperspaceView
 Послать отзыв
 Свойство предназначено для просмотра/изменения принадлежности именованного вида к различным пространствам чертежа: пространству модели или пространству листа.
 Синтаксис
C#
Visual Basic
public bool IsPaperspaceView;
Public Property IsPaperspaceView() As bool
 Возвращает
 Возвращает тип данных bool:
true - именованный вид привязан к пространству листа;
false - именованный вид привязан к пространству модели.
 Описание
 Свойство предназначено для просмотра/изменения принадлежности именованного вида к различным пространствам чертежа: пространству модели или пространству листа. При указании пространства листа, нужно в свойстве Layout указать ObjectId листа, к которому относится именованный вид. При создании именованного вида через API, по умолчанию значение свойства равно false.
 Условия
 Чтение и запись.
 Ссылки
 ViewTableRecord Класс, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!