Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SectionSettings.SetGenerationOptions
 Послать отзыв
 Метод позволяет задать опции генерации для указанного типа сечения как комбинацию флагов из перечисления SectionGeneration.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetGenerationOptions( SectionType nSecType, SectionGeneration nOptions );
Копировать Код
Public Sub SetGenerationOptions( nSecType As SectionType, nOptions As SectionGeneration )
 Параметры
 Параметры
 Описание
 nSecType
 Тип сечения. Перечисление SectionType.
 nOptions
 Флаги настройки процесса генерации сечения. Перечисление SectionGeneration.
 Описание
 Метод позволяет задать опции генерации для указанного типа сечения как комбинацию флагов из перечисления SectionGeneration.
 Ссылки
 Teigha.DatabaseServices.SectionSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!