Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LinkedTableData.SetDataLink
 Послать отзыв
 Метод позволяет задать идентификатор внешней ссылки для указанного диапазона ячеек данной таблицы.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetDataLink( ref CellRange range, DatabaseServices.ObjectId dataLinkId, bool bUpdate );
Копировать Код
Public Overridable Sub SetDataLink( ByRef range As CellRange, dataLinkId As DatabaseServices.ObjectId, bUpdate As Boolean )
 Параметры
 Параметры
 Описание
 range
 Диапазон ячеек таблицы. Тип CellRange.
 dataLinkId
 Идентификатор внешней ссылки. Тип DatabaseServices.ObjectId.
 bUpdate
 Флаг, указывающий, следует ли обновить данные по указанной внешней ссылке. Тип bool.
 Описание
 Метод позволяет задать идентификатор внешней ссылки для указанного диапазона ячеек данной таблицы.
 Замечания
 Метод выбрасывает исключение eNotThatKindOfClass, если переданный параметр dataLinkId не является идентификатором объекта DataLink.
 Ссылки
 Teigha.DatabaseServices.LinkedTableData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!