Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.BlockBegin.BlockBegin
 Послать отзыв
 Конструктор по умолчанию класса BlockBegin.
 Синтаксис
C#
Visual Basic
Копировать Код
public BlockBegin();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса BlockBegin.
 Ссылки
 Teigha.DatabaseServices.BlockBegin, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!