Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SymbolUtilityServices.GetLinetypeByLayerId
 Послать отзыв
 Метод позволяет извлечь из указанной базы данных идентификатор объекта типа линий "ByLayer".
 Синтаксис
C#
Visual Basic
Копировать Код
public static ObjectId GetLinetypeByLayerId( ref Database databasePointer );
Копировать Код
Public Shared Function GetLinetypeByLayerId( ByRef databasePointer As Database ) As ObjectId
 Параметры
 Параметры
 Описание
 databasePointer
 База данных, из которой извлекается идентификатор объекта. Тип Database.
 Возвращает
 Возвращает ненулевой идентификатор объекта типа линий "ByLayer". Тип ObjectId.
 Описание
 Метод позволяет извлечь из указанной базы данных идентификатор объекта типа линий "ByLayer".
 Ссылки
 Teigha.DatabaseServices.SymbolUtilityServices, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!