Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 BlockTableRecord.BlockTableRecord()
 Послать отзыв
 Конструктор класса
 Синтаксис
C#
Visual Basic
public BlockTableRecord(IntPtr unmanagedPointer, bool autoDelete); public BlockTableRecord();
Public Sub New(unmanagedPointer As IntPtr, autoDelete As bool) Public Sub New()
 Описание
 Конструктор по умолчанию. Инициализирует объект в точке
 (0,0,0) со значениями признаков IsAnonymous,
 HasAttributeDefinitions, IsFromExternalReference и
 IsFromOverlayReference, установленными в false и PathName,
 установленным в NULL. Дополнительно, вызывается конструктор
 по умолчанию класса SymbolTableRecord.
 Ссылки
 Teigha.DatabaseServices.BlockTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!