Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Hatch.InsertLoopAt (int, HatchLoop^)
 Послать отзыв
 Синтаксис
C#
Visual Basic
public void InsertLoopAt(int loopIndex, ref HatchLoop hatchLoop);
Public Sub InsertLoopAt(loopIndex As Integer, ByRef hatchLoop As HatchLoop)
 Параметры
 Параметры
 Описание
 loopIndex
 Индекс вставляемой петли
 hatchLoop
 Тип петли
 Описание
 Метод вставляет новую петлю контура (путь или полилинию) в объект заливки. Параметр loopIndex задает индекс, под которым петля будет вставлена в список петель контура заливки. hatchLoop задает тип петли.
 Ссылки
 Teigha.DatabaseServices.Hatch, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!