Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.KnotCollection.KnotCollection
 Послать отзыв
 Конструктор по умолчанию класса KnotCollection.
 Синтаксис
C#
Visual Basic
Копировать Код
public KnotCollection();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса KnotCollection.
 Ссылки
 Teigha.Geometry.KnotCollection, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!