Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PatternDefinition.PatternDefinition
 Послать отзыв
 Конструктор класса PatternDefinition.
 Синтаксис
C#
Visual Basic
Копировать Код
public PatternDefinition( double patternAngle, Point2d basePoint, Point2d offsetVector, ref DoubleCollection dashOffsets );
Копировать Код
Public Sub New( patternAngle As Double, basePoint As Point2d, offsetVector As Point2d, ByRef dashOffsets As DoubleCollection )
 Параметры
 Параметры
 Описание
 patternAngle
 Угол штриховки. Тип double.
 basePoint
 Координаты точки привязки. Тип Point2d.
 offsetVector
 Вектор смещения. Тип Point2d.
 dashOffsets
 Смещения штрихов. Тип DoubleCollection.
 Описание
 Конструктор класса PatternDefinition.
 Ссылки
 Teigha.DatabaseServices.PatternDefinition, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!