Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.HyperLink.Equals
 Послать отзыв
 Метод предназначен для проверки равенства данного объекта указанному объекту.
 Синтаксис
C#
Visual Basic
Копировать Код
public sealed override bool Equals( ref Object other );
Копировать Код
Public NotOverridable Overrides Function Equals( ByRef other As Object ) As Boolean
 Параметры
 Параметры
 Описание
 other
 Объект, проверяемый на равенство. Тип Object.
 Возвращает
 Возвращает true, если объекты равны. В противном случае возвращает false.
 Описание
 Метод предназначен для проверки равенства данного объекта указанному объекту other.
 Замечания
 Переопределение методов Equals и GetHashCode должно выполняться совместно, чтобы не нарушать логику - если Equals возвращает true, хеш-коды сравниваемых объектов должны совпадать. Обратное не гарантируется - совпадение хеш-кодов не всегда означает совпадение объектов вследствие возможных коллизий. Хеш-коды следует формировать для полей, на которых основано равенство. Иногда используется метод Equals() из объекта C++, но поскольку сравниваются указатели, вы по-прежнему можете использовать этот GetHashCode(), в то время как метод Equals() может быть переопределен в производном классе.
 Ссылки
 Teigha.DatabaseServices.HyperLink, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!