Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DataTable.InsertColumnAt
 Послать отзыв
 Метод вставляет столбец в таблицу по указанному индексу столбца.
 Синтаксис
C#
Visual Basic
Копировать Код
public void InsertColumnAt( int index, CellType type, ref String columnName );
Копировать Код
Public Sub InsertColumnAt( index As Integer, type As CellType, ByRef columnName As String )
 Параметры
 Параметры
 Описание
 index
 Индекс столбца. Тип int. Если индекс оказался недействительным, метод выбрасывает исключение Teigha.Runtime.ErrorStatus.eInvalidInput.
 type
 Тип столбца. Тип CellType.
 columnName
 Имя столбца. Тип String.
 Описание
 Метод вставляет в таблицу новый столбец. Место вставки задается указанным индексом столбца. Если в таблице уже имеются строки, то ячейки нового столбца получают значения по умолчанию для каждой строки.
 Ссылки
 Teigha.DatabaseServices.DataTable, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!