Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.OsnapPointRef.OsnapPointRef
 Послать отзыв
 Конструктор по умолчанию класса OsnapPointRef.
 Синтаксис
C#
Visual Basic
Копировать Код
public OsnapPointRef();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса OsnapPointRef.
 Ссылки
 Teigha.DatabaseServices.OsnapPointRef, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!