Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Entity.PlotStyleNameId
 Послать отзыв
 Свойство предназначено для получения или установки идентификатора стиля печати (PlotStyleDescriptor), связанного с геометрическим объектом, что определяет его параметры вывода на печать.
 Синтаксис
C#
Visual Basic
Копировать Код
public PlotStyleDescriptor PlotStyleNameId;
Копировать Код
Public Property PlotStyleNameId() As PlotStyleDescriptor
 Возвращает
 Возвращает экземпляр класса PlotStyleDescriptor, представляющий дескриптор стиля печати, используемого для данного объекта.
 Описание
 Свойство предназначено для получения или установки идентификатора стиля печати (PlotStyleDescriptor), связанного с геометрическим объектом, что определяет его параметры вывода на печать.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Entity, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!