Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DimAssoc.RotatedType
 Послать отзыв
 Свойство RotatedType определяет тип выравнивания для данного ассоциативного размера.
 Синтаксис
C#
Visual Basic
Копировать Код
public RotatedDimType RotatedType;
Копировать Код
Public Property RotatedType As RotatedDimType
 Возвращает
 Возвращает тип выравнивания связанного ассоциативного размера. Значение из перечисления RotatedDimType.
 Описание
 Свойство RotatedType определяет тип выравнивания для данного ассоциативного размера (параллельный, перпендикулярный).
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.DimAssoc, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!