Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector2d.Add
 Послать отзыв
 Метод реализует векторное сложение данного вектора с другим 2D-вектором.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector2d Add( Vector2d v );
Копировать Код
Public Function Add( v As Vector2d ) As Vector2d
 Параметры
 Параметры
 Описание
 v
 Входной вектор, используемый в качестве второго слагаемого в векторной сумме. Тип Vector2d.
 Возвращает
 Возвращает векторную сумму данного вектора и вектора v. Тип Vector2d.
 Описание
 Метод реализует векторное сложение данного вектора с другим 2D-вектором v.
 Ссылки
 Teigha.Geometry.Vector2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!