Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Entity.PlotStyleName
 Послать отзыв
 Свойство предназначено для получения или установки имени стиля печати, применяемого к геометрическому объекту при выводе чертежа на печать.
 Синтаксис
C#
Visual Basic
Копировать Код
public String PlotStyleName;
Копировать Код
Public Property PlotStyleName() As String
 Возвращает
 Возвращает строковое значение (String), представляющее имя текущего стиля печати объекта. Это значение может быть изменено для назначения другого стиля печати.
 Описание
 Устанавливает или возвращает строку имени стиля печати геометрического объекта.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Entity, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!