Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ProxyEntity.OriginalClassName
 Послать отзыв
 Свойство OriginalClassName возвращает имя класса пользовательского объекта, представленного данным прокси-объектом.
 Синтаксис
C#
Visual Basic
Копировать Код
public String OriginalClassName;
Копировать Код
Public ReadOnly Property OriginalClassName As String
 Возвращает
 Возвращает имя класса пользовательского объекта. Тип String.
 Описание
 Свойство OriginalClassName возвращает имя класса пользовательского объекта, представленного данным прокси-объектом.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.ProxyEntity, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!