Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Surface.IsClosedInV
 Послать отзыв
 Метод позволяет проверить, является ли данная поверхность замкнутой в направлении V в пределах некоторой заданной точности.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsClosedInV( Tolerance tolerance );
Копировать Код
Public Function IsClosedInV( tolerance As Tolerance ) As Boolean
 Параметры
 Параметры
 Описание
 tolerance
 Заданная геометрическая точность. Тип Tolerance.
 Возвращает
 Возвращает true, если в пределах точности tolerance данную поверхность можно считать замкнутой в направлении V. В противном случае возвращает false.
 Описание
 Метод позволяет проверить, является ли данная поверхность замкнутой в направлении V в пределах заданной точности tolerance. Предполагает реализацию в производных классах.
 Ссылки
 Teigha.Geometry.Surface, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!