Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.RadialDimensionLarge.RadialDimensionLarge
 Послать отзыв
 Конструктор по умолчанию класса RadialDimensionLarge.
 Синтаксис
C#
Visual Basic
Копировать Код
public RadialDimensionLarge();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса RadialDimensionLarge. Создает радиальный размер с центром, переопределенным центром, точками излома и хорды в точке (0, 0, 0) и углом излома 0.785398 (PI/4) рад.
 Ссылки
 Teigha.DatabaseServices.RadialDimensionLarge, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!