Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.TableCopyOptions
 Послать отзыв
 Данное перечисление определяет доступные опции копирования таблиц.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum TableCopyOptions { None = 0, ExpandOrContractTable = 1, SkipContent = 2, SkipValue = 4, SkipField = 8, SkipFormula = 16, SkipBlock = 32, SkipDataLink = 64, SkipLabelCell = 128, SkipDataCell = 256, SkipFormat = 512, SkipCellStyle = 1024, ConvertFormatToOverrides = 2048, SkipCellState = 4096, SkipContentFormat = 8192, SkipDissimilarContentFormat = 16384, SkipGeometry = 32768, SkipMerges = 65536, FillTarget = 131072, OverwriteReadOnlyContent = 262144, OverwriteReadOnlyFormat = 524288, OverwriteContentModifiedAfterUpdate = 1048576, OverwriteFormatModifiedAfterUpdate = 2097152, OnlyContentModifiedAfterUpdate = 4194304, OnlyFormatModifiedAfterUpdate = 8388608, TableCopyRowHeight = 16777216, TableCopyColumnWidth = 33554432 }
Копировать Код
Public Enum TableCopyOptions None = 0 ExpandOrContractTable = 1 SkipContent = 2 SkipValue = 4 SkipField = 8 SkipFormula = 16 SkipBlock = 32 SkipDataLink = 64 SkipLabelCell = 128 SkipDataCell = 256 SkipFormat = 512 SkipCellStyle = 1024 ConvertFormatToOverrides = 2048 SkipCellState = 4096 SkipContentFormat = 8192 SkipDissimilarContentFormat = 16384 SkipGeometry = 32768 SkipMerges = 65536 FillTarget = 131072 OverwriteReadOnlyContent = 262144 OverwriteReadOnlyFormat = 524288 OverwriteContentModifiedAfterUpdate = 1048576 OverwriteFormatModifiedAfterUpdate = 2097152 OnlyContentModifiedAfterUpdate = 4194304 OnlyFormatModifiedAfterUpdate = 8388608 TableCopyRowHeight = 16777216 TableCopyColumnWidth = 33554432 End Enum
 Члены
 Члены
 Описание
 None
 Значение: 0. Опции не заданы.
 ExpandOrContractTable
 Значение: 1. Создавать новые строки и столбцы, если исходный диапазон не соответствует целевому диапазону. Удалять пустые строки и столбцы, если целевой диапазон превышает исходный.
 SkipContent
 Значение: 2. Не копировать содержимое.
 SkipValue
 Значение: 4. Не копировать содержимое, если это значение.
 SkipField
 Значение: 8. Не копировать содержимое, если это поле.
 SkipFormula
 Значение: 16 = 0x10. Не копировать содержимое, если это формула.
 SkipBlock
 Значение: 32 = 0x20. Не копировать содержимое, если это блок.
 SkipDataLink
 Значение: 64 = 0x40. Не копировать ссылки на внешние данные.
 SkipLabelCell
 Значение: 128 = 0x80. Не копировать содержимое, если это ячейка с меткой.
 SkipDataCell
 Значение: 256 = 0x100. Не копировать содержимое, если это ячейка данных.
 SkipFormat
 Значение: 512 = 0x200. Не копировать формат.
 SkipCellStyle
 Значение: 1024 = 0x400. Не копировать стиль ячейки.
 ConvertFormatToOverrides
 Значение: 2048 = 0x800. После копирования преобразовать форматы в переопределения.
 SkipCellState
 Значение: 4096 = 0x1000. Не копировать состояние ячейки.
 SkipContentFormat
 Значение: 8192 = 0x2000. Не копировать формат содержимого. Игнорируется, если установлен флаг TableCopySkipFormat.
 SkipDissimilarContentFormat
 Значение: 16384 = 0x4000. Не копировать формат содержимого, если типы содержимого различаются. Игнорируется, если установлены флаги TableCopySkipFormat или TableCopySkipContentFormat.
 SkipGeometry
 Значение: 32768 = 0x8000. Не копировать геометрическую информацию, такую как высота строки, ширина столбца и т.п.
 SkipMerges
 Значение: 65536 = 0x10000. Не копировать слияния ячеек.
 FillTarget
 Значение: 131072 = 0x20000. Заполнить целевой диапазон путем многократного копирования исходного диапазона.
 OverwriteReadOnlyContent
 Значение: 262144 = 0x40000. Если в целевой ячейке имеется содержимое, доступное только для чтения, перезаписать.
 OverwriteReadOnlyFormat
 Значение: 524288 = 0x80000. Если формат целевой ячейки доступен только для чтения, перезаписать.
 OverwriteContentModifiedAfterUpdate
 Значение: 1048576 = 0x100000. Если содержимое целевой ячейки претерпело изменения с момента последнего обновления, перезаписать. Этот параметр применим только для ячеек с внешними ссылками.
 OverwriteFormatModifiedAfterUpdate
 Значение: 2097152 = 0x200000. Если формат целевой ячейки претерпел изменения с момента последнего обновления, перезаписать. Этот параметр применим только для ячеек с внешними ссылками.
 OnlyContentModifiedAfterUpdate
 Значение: 4194304 = 0x400000. Если содержимое целевой ячейки претерпело изменения с момента последнего обновления, восстановить только содержимое.
 OnlyFormatModifiedAfterUpdate
 Значение: 8388608. Если формат целевой ячейки изменился с момента последнего обновления, восстановить только формат.
 TableCopyRowHeight
 Значение: 16777216 = 0x1000000. При копировании ячеек копировать высоту строки. Применимо только при копировании ячеек. Игнорируется, если установлен флаг TableCopySkipGeometry или когда копируется вся таблица целиком.
 TableCopyColumnWidth
 Значение: 33554432 = 0x2000000. При копировании ячеек копировать ширину столбца. Применимо только при копировании ячеек. Игнорируется, если установлен флаг TableCopySkipGeometry или когда копируется вся таблица целиком.
 Описание
 Данное перечисление определяет опции, доступные при копировании таблиц.
 Ваши комментарии по поводу этого топика: Послать отзыв!