Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.SplineEntity2d.EndPoint
 Послать отзыв
 Свойство EndPoint представляет точку сплайна с максимальным значением параметра. Не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point2d EndPoint;
Копировать Код
Public ReadOnly Property EndPoint As Point2d
 Возвращает
 Возвращает положение точки сплайна с максимальным значением параметра. Тип Point2d.
 Описание
 Свойство EndPoint представляет точку сплайна с максимальным значением параметра. Не реализовано.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.SplineEntity2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!