Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.EllipticalArc3d.ProjectedIntersectWith
 Послать отзыв
 Метод позволяет найти на данной дуге и указанной линии такие точки, которые совпадают при проецировании на указанную плоскость. Используется заданная геометрическая точность.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d[] ProjectedIntersectWith( ref LinearEntity3d line, Vector3d projectionDirection, Tolerance tolerance );
Копировать Код
Public Function ProjectedIntersectWith( ByRef line As LinearEntity3d, projectionDirection As Vector3d, tolerance As Tolerance ) As Point3d()
 Параметры
 Параметры
 Описание
 line
 Трехмерный линейный объект, с которым вычисляется пересечение. Тип LinearEntity3d.
 projectionDirection
 Направление проецирования. Тип Vector3d.
 tolerance
 Заданная геометрическая точность. Тип Tolerance.
 Возвращает
 Возвращает массив из четырех элементов. Тип Point3d[]. Элементы массива представляют следующие точки:
0 — первая точка пересечения на эллиптической дуге.
1 — вторая точка пересечения на эллиптической дуге (если она существует).
2 — первая точка пересечения на линии.
3 — вторая точка пересечения на линии (если она существует).
 В случае отсутствия точек пересечения метод возвращает null.
 Описание
 Метод позволяет найти на данной дуге и указанной линии такие точки, которые совпадают при проецировании на плоскость с заданным направлением нормали. Вычисление пересечений выполняется с переданной в метод геометрической точностью. Результатом является массив 3D-точек.
 Ссылки
 Teigha.Geometry.EllipticalArc3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!