Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор TextStyleTableRecord.TextStyleTableRecord ()
 Послать отзыв
 Синтаксис
C#
Visual Basic
public TextStyleTableRecord(); public TextStyleTableRecord(IntPtr obj, bool autoDelete);
Public Sub New() Public Sub New(obj As IntPtr, autoDelete As bool)
 Описание
 Конструктор.
 Ссылки
 Teigha.DatabaseServices.TextStyleTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!