Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LinkedTableData
 Послать отзыв
 Класс LinkedTableData реализует связывание с данными из внешних таблиц Excel.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::GraphicsInterface::Drawable Teigha::DatabaseServices::DBObject Teigha::DatabaseServices::LinkedData Teigha::DatabaseServices::LinkedTableData
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("AcDbLinkedTableData")] public class LinkedTableData : LinkedData;
Копировать Код
<Wrapper("AcDbLinkedTableData")> Public Class LinkedTableData Inherits LinkedData
 Описание
 Класс LinkedTableData реализует связывание с данными из внешних таблиц Excel.
 LinkedTableData похож на класс Table - он так же используется для хранения и управления данными в табличной структуре, однако есть существенное отличие. Здесь все ячейки в столбце не обязаны представлять один и тот же тип данных и могут иметь значение любого поддерживаемого типа данных, поля или блока. По этой причине класс LinkedTableData организует управление своими данными, не имея информации о формате дынных в ячейках.
 Методы
 Конструкторы
 Teigha.GraphicsInterface.Drawable
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 Drawable
 Конструктор класса Teigha.GraphicsInterface.Drawable. (Унаследован от Drawable)
 Teigha.DatabaseServices.DBObject
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 DBObject
 Конструктор. (Унаследован от DBObject)
 Teigha.DatabaseServices.LinkedTableData
 Имя
 Описание
 LinkedTableData
 Это обзор перегрузок LinkedTableData.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.GraphicsInterface.Drawable
 Имя
 Описание
 Drawable Методы
 Ниже перечислены методы класса Drawable.
 Drawable Свойства
 Ниже перечислены свойства класса Drawable.
 Teigha.DatabaseServices.DBObject
 Имя
 Описание
 DBObject Методы
 Ниже перечислены методы класса DBObject.
 DBObject Свойства
 Ниже перечислены свойства класса DBObject.
 DBObject События
 Ниже перечислены события класса DBObject.
 Teigha.DatabaseServices.LinkedData
 Имя
 Описание
 LinkedData Методы
 Ниже перечислены методы класса LinkedData.
 LinkedData Свойства
 Ниже перечислены свойства класса LinkedData.
 Teigha.DatabaseServices.LinkedTableData
 Имя
 Описание
 LinkedTableData Методы
 Ниже перечислены методы класса LinkedTableData.
 LinkedTableData Свойства
 Ниже перечислены свойства класса LinkedTableData.
 Ссылки
 LinkedTableData Конструктор, LinkedTableData Методы, LinkedTableData Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства, DBObject События
 Ваши комментарии по поводу этого топика: Послать отзыв!