Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Filters.SpatialFilter.ClipSpaceToWorldCoordinateSystemTransform
 Послать отзыв
 Свойство ClipSpaceToWorldCoordinateSystemTransform возвращает геометрическое преобразование точек граничной области данного фильтра из их системы координат (какой бы она ни была) в мировую систему координат WCS.
 Синтаксис
C#
Visual Basic
Копировать Код
public Matrix3d ClipSpaceToWorldCoordinateSystemTransform;
Копировать Код
Public ReadOnly Property ClipSpaceToWorldCoordinateSystemTransform As Matrix3d
 Возвращает
 Возвращает геометрическое преобразование координат точек граничной области в мировую систему координат WCS. Тип Matrix3d.
 Описание
 Свойство ClipSpaceToWorldCoordinateSystemTransform возвращает геометрическое преобразование точек граничной области данного фильтра из их системы координат (какой бы она ни была) в мировую систему координат WCS.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Filters.SpatialFilter, Teigha.DatabaseServices.Filters
 Ваши комментарии по поводу этого топика: Послать отзыв!