Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve3d.IsPlanar
 Послать отзыв
 Метод проверяет, является ли данная кривая плоской в пределах указанного допуска.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsPlanar( out Plane plane, Tolerance tolerance );
Копировать Код
Public Function IsPlanar( plane As out Plane, tolerance As Tolerance ) As Boolean
 Параметры
 Параметры
 Описание
 plane
 Плоскость, которой принадлежит кривая (если она плоская). Тип Plane.
 tolerance
 Заданный допуск. Тип Tolerance.
 Возвращает
 Возвращает true в случае, если кривая является плоской, иначе - false.
 Описание
 Метод проверяет, является ли данная кривая плоской в пределах указанного допуска.
 Если кривая геометрически является линией, этот метод возвращает произвольную плоскость, которая содержит эту линию. Параметр plane возвращает значимые данные только в том случае, когда результирующим значением метода является true.
 Ссылки
 Teigha.Geometry.Curve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!