Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Userr1
 Послать отзыв
 Синтаксис
C#
Visual Basic
public double Userr1;
Public Property Userr1() As Double
 Описание
 Обеспечивает доступ к текущему значению USERR1 для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!