Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 DimStyleTableRecord.Dimlunit
 Послать отзыв
 Свойство отвечает за настройку формата единиц измерения в неугловых размерах.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual int Dimlunit { get; set; }
Копировать Код
Public Overridable Property Dimlunit As Integer
 Возвращает
 Возвращает тип данных int.
 Возвращаемые значения
 Возвращаемые значения
 Описание
 1 – формат единиц измерения в неугловых размерах
 научный
 2 – формат единиц измерения в неугловых размерах
 десятичный (по умолчанию)
 3 – формат единиц измерения в неугловых размерах
 дюймовый десятичный
 4 – формат единиц измерения в неугловых размерах
 дюймовый дробный
 5 – формат единиц измерения в неугловых размерах
 дробный;
 6 – формат единиц измерения в неугловых размерах
 установленный в Microsoft Windows.
 Описание
 В свойстве хранится текущая настройка формата единиц измерения в неугловых размерах в формате числа int. Возможны следующие значения:
1 – Научные;
2 – Десятичные (по умолчанию);
3 – Дюймовые десятичные;
4 – Дюймовые дробные;
5 – Дробные;
6 – Microsoft Windows.
 Свойство также доступно через системную переменную DIMLUNIT и пользовательское меню в окне изменения/создания размерного стиля:
  При изменении системной переменной DIMLUNIT будет создан новый размерный стиль под названием <переопределение> на основе текущего с новым значением DIMLUNIT.
 Условия
 Чтение и запись.
 Пример
 Пример изменения формата единиц измерения в неугловых размерах (значения свойства Dimlunit) в размерном стиле Standard:
C#
 Копировать Код
public partial class Commands { [Teigha.Runtime.CommandMethod("DimlunitChange")] public void DimlunitStandardDimStyle() { // Получение ссылки на активный документ HostMgd.ApplicationServices.Document doc = HostMgd.ApplicationServices.Application.DocumentManager.MdiActiveDocument; // Получение ссылки на редактор документа HostMgd.EditorInput.Editor ed = doc.Editor; // Получение ссылки на базу данных документа Teigha.DatabaseServices.Database db = doc.Database; // Начало транзакции с базой данных документа using (Teigha.DatabaseServices.Transaction trans = db.TransactionManager.StartTransaction()) { // Открываем таблицу размерных стилей для чтения Teigha.DatabaseServices.DimStyleTable dimStyleTable = trans.GetObject(db.DimStyleTableId, Teigha.DatabaseServices.OpenMode.ForRead) as Teigha.DatabaseServices.DimStyleTable; // Находим в таблице размерных стилей ObjectId нужного стиля по его названию Teigha.DatabaseServices.ObjectId styleId = dimStyleTable["Standard"]; // Открываем таблицу размерного стиля для изменений Teigha.DatabaseServices.DimStyleTableRecord obj = trans.GetObject(styleId, Teigha.DatabaseServices.OpenMode.ForWrite) as Teigha.DatabaseServices.DimStyleTableRecord; ed.WriteMessage($"nDimlunit before: {obj.Dimlunit}"); // Изменяем формат основных единиц измерения на дробные obj.Dimlunit = 5; ed.WriteMessage($"nDimlunit after: {obj.Dimlunit}"); trans.Commit(); } } }
 Результат работы команды DimlunitChange:
 Было:
 Стало:
 Ссылки
 Teigha.DatabaseServices.DimStyleTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!