Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.SetTextStyle
 Послать отзыв
 Метод обеспечивает использование объектом Table заданной записи TextStyleTableRecord для указанных типов строк.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetTextStyle( DatabaseServices.ObjectId id, int rowTypes );
Копировать Код
Public virtual Sub SetTextStyle( id As DatabaseServices.ObjectId, rowTypes As Integer )
 Параметры
 Параметры
 Описание
 id
 Идентификатор записи TextStyleTableRecord, представляющей текстовый стиль. Тип DatabaseServices.ObjectId.
 rowTypes
 Тип строки объекта Table, int. Возможными значениями типа строки являются DataRow, TitleRow и HeaderRow (см. перечисление RowType).
 Описание
 Метод обеспечивает использование объектом Table заданной записи TextStyleTableRecord для указанных типов строк.
 Возможные значения типа строки: DataRow, TitleRow и HeaderRow. См. перечисление RowType. Различные типы строк можно комбинировать с использованием оператора OR. Если тип строки не указан, этот метод распространяет свое действие на все возможные типы строк.
 Замечания
 Для получения того же результата предпочтительнее использовать функционал объекта Cell.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!