Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.UnderlayReference.Contrast
 Послать отзыв
 Свойство Contrast представляет значение контраста подложки в диапазоне [0 – 100].
 Синтаксис
C#
Visual Basic
Копировать Код
public int Contrast;
Копировать Код
Public Property Contrast As Integer
 Возвращает
 Возвращает в диапазоне [0 – 100]. Тип int.
 Описание
 Свойство Contrast представляет значение контраста подложки в диапазоне [0 – 100].
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.UnderlayReference, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!