Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.SplineEntity2d.HasFitData
 Послать отзыв
 Свойство HasFitData позволяет проверить, имеются ли у данного объекта данные аппроксимации. Не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool HasFitData;
Копировать Код
Public ReadOnly Property HasFitData As Boolean
 Возвращает
 Возвращает true, если данный сплайн построен по определяющим точкам. В противном случае возвращает false.
 Описание
 Свойство HasFitData позволяет проверить, имеются ли у данного объекта данные аппроксимации. Не реализовано.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.SplineEntity2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!