Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LineWeightConverter.ConvertFrom
 Послать отзыв
 Метод преобразует предоставленный объект и возвращает результат преобразования.
 Синтаксис
C#
Visual Basic
Копировать Код
public override Object ConvertFrom( ref ITypeDescriptorContext context, ref CultureInfo culture, ref Object value );
Копировать Код
Public Overrides Function ConvertFrom( ByRef context As ITypeDescriptorContext, ByRef culture As CultureInfo, ByRef value As Object ) As Object
 Параметры
 Параметры
 Описание
 context
 Контекст для преобразования объекта value. Тип ITypeDescriptorContext.
 culture
 Провайдер языковых и региональных настроек. Тип CultureInfo.
 value
 Исходный объект для преобразования. Тип Object.
 Возвращает
 Возвращает результат преобразования. Тип Object.
 Описание
 Метод преобразует предоставленный объект и возвращает результат преобразования. Преобразование учитывает переданный контекст, а также языковые и региональные настройки.
 Ссылки
 Teigha.DatabaseServices.LineWeightConverter, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!