Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotSettings.ShadePlot
 Послать отзыв
 Свойство ShadePlot представляет тип тонированной печати, предусмотренный данным объектом PlotSettings.
 Синтаксис
C#
Visual Basic
Копировать Код
public PlotSettingsShadePlotType ShadePlot;
Копировать Код
Public Property ShadePlot As PlotSettingsShadePlotType
 Возвращает
 Возвращает тип печати тонированных объектов. Перечисление PlotSettingsShadePlotType.
 Описание
 Свойство ShadePlot представляет тип тонированной печати, предусмотренный данным объектом PlotSettings.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.PlotSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!