Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbCurve2dFitData.FitPoints
 Послать отзыв
 Свойство FitPoints представляет массив определяющих точек кривой.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point2dCollection FitPoints;
Копировать Код
Public ReadOnly Property FitPoints As Point2dCollection
 Возвращает
 Возвращает массив определяющих точек кривой. Тип Point2dCollection.
 Описание
 Свойство FitPoints представляет массив определяющих точек кривой.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.NurbCurve2dFitData, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!