Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Polyline2d.Length
 Послать отзыв
 Свойство предоставляет доступ к текущему значению длины полилинии.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Length;
Копировать Код
Public Property Length() As double
 Возвращает
 Возвращает длину полилинии как значение типа double.
 Описание
 Свойство предоставляет доступ к текущему значению длины полилинии.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Polyline2d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!