Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve3d.IsOn
 Послать отзыв
 Метод позволяет установить, находится ли указанная точка на данной кривой в пределах заданного допуска.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsOn( Point3d point, Tolerance tolerance );
Копировать Код
Public Function IsOn( point As Point3d, tolerance As Tolerance ) As Boolean
 Параметры
 Параметры
 Описание
 point
 Произвольная точка Point3d.
 tolerance
 Требуемая точность проверки. Тип Tolerance.
 Возвращает
 Возвращает true в случае, если указанная точка находится на данной кривой в пределах допуска tolerance, иначе - false.
 Описание
 Метод позволяет установить, находится ли указанная точка на данной кривой в пределах заданного допуска tolerance. Параметр point содержит значимые данные только тогда, когда метод возвращает значение true.
 Ссылки
 Teigha.Geometry.Curve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!