Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GripData.CallHoverGrip
 Послать отзыв
 Метод реализует действия при подсветке этой ручки курсором мыши.
 Синтаксис
C#
Visual Basic
Копировать Код
public GripData.ReturnValue CallHoverGrip( ObjectId entityId, GripData.Context contextFlags );
Копировать Код
Public Function CallHoverGrip( entityId As ObjectId, contextFlags As GripData.Context ) As GripData.ReturnValue
 Параметры
 Параметры
 Описание
 entityId
 Идентификатор объекта чертежа. Тип ObjectId.
 contextFlags
 Флаги контекста ручки. Перечисление GripData.Context.
 Возвращает
 Возвращает результат выполнения операции. Перечисление GripData.ReturnValue.
 Описание
 Метод реализует действия при подсветке этой ручки курсором мыши.
 Ссылки
 Teigha.DatabaseServices.GripData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!