Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Matrix2d.GetDeterminant
 Послать отзыв
 Метод предоставляет детерминант данной матрицы.
 Синтаксис
C#
Visual Basic
Копировать Код
public double GetDeterminant();
Копировать Код
Public Function GetDeterminant() As Double
 Возвращает
 Возвращает детерминант данной матрицы. Тип double.
 Описание
 Метод предоставляет детерминант данной матрицы.
 Ссылки
 Teigha.Geometry.Matrix2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!