Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocArrayRectangularParameters.AssocArrayRectangularParameters
 Послать отзыв
 Конструктор класса. Создает новый объект класса с указанными параметрами.
 Синтаксис
C#
Visual Basic
Копировать Код
public AssocArrayRectangularParameters( double columnSpacing, double rowSpacing, double levelSpacing, int columnCount, int rowCount, int levelCount, double rowElevation, double axesAngle );
Копировать Код
Public Sub New( columnSpacing As Double, rowSpacing As Double, levelSpacing As Double, columnCount As Integer, rowCount As Integer, levelCount As Integer, rowElevation As Double, axesAngle As Double )
 Параметры
 Параметры
 Описание
 columnSpacing
 Расстояние между столбцами массива. Тип double.
 rowSpacing
 Расстояние между рядами массива. Тип double.
 levelSpacing
 Расстояние между уровнями в массиве. Тип double.
 columnCount
 Количество столбцов в массиве. Тип int.
 rowCount
 Количество рядов в массиве. Тип int.
 levelCount
 Количество уровней в массиве. Тип int.
 rowElevation
 Приращение отметок между соседними рядами массива. Тип double.
 axesAngle
 Угол между первым рядом и первым столбцом массива. Тип double.
 Описание
 Конструктор класса. Создает новый объект класса с указанными параметрами.
 Ссылки
 Teigha.DatabaseServices.AssocArrayRectangularParameters, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!