Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.GeoDataLonLatAltInfo.Altitude
 Послать отзыв
 Свойство Altitude представляет долготу в градусах.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Altitude;
Копировать Код
Public Property Altitude As Double
 Возвращает
 Возвращает долготу в градусах. Тип double.
 Описание
 Свойство Altitude представляет долготу в градусах.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.Geometry.GeoDataLonLatAltInfo, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!