Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.RenderGlobal.PredefinedPresetsFirst
 Послать отзыв
 Свойство PredefinedPresetsFirst позволяет определить, расположены ли предопределенные наборы настроек перед пользовательскими наборами настроек в пользовательском интерфейсе.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool PredefinedPresetsFirst;
Копировать Код
Public Property PredefinedPresetsFirst As Boolean
 Возвращает
 Возвращает true, если предопределенные наборы настроек располагаются перед пользовательскими наборами. В противном случае возвращает false.
 Описание
 Свойство PredefinedPresetsFirst позволяет определить, расположены ли предопределенные наборы настроек перед пользовательскими наборами настроек в пользовательском интерфейсе.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.RenderGlobal, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!