Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.SplineEntity3d.NumberOfControlPoints
 Послать отзыв
 Свойство NumberOfControlPoints представляет количество вершин в массиве управляющих вершин данного сплайна. Не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public int NumberOfControlPoints;
Копировать Код
Public ReadOnly Property NumberOfControlPoints As Integer
 Возвращает
 Возвращает количество вершин в массиве управляющих вершин данного сплайна. Тип int.
 Описание
 Свойство NumberOfControlPoints представляет количество вершин в массиве управляющих вершин данного сплайна. Не реализовано.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.SplineEntity3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!