Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBDictionary.Item
 Послать отзыв
 Это свойство находит запись в словаре по её ключу key и в случае успеха возвращает соответствующий ObjectId.
 Синтаксис
C#
Visual Basic
Копировать Код
public Object Item;
Копировать Код
Public Property Item() As Object
 Возвращает
 Возвращает ObjectId объекта чертежа.
 Описание
 Это свойство находит запись в словаре по её ключу key и возвращает свойство Value записи словаря (ObjectId объекта чертежа), свойство Key которой совпадает с указанным параметром key.
 Условия
 Чтение и запись.
 Пример
 Пример работы с этим свойством:
C#
 Копировать Код
public partial class Commands { [Teigha.Runtime.CommandMethod("GetDBDictionaryEntity")] public void GetDBDictionaryEntity() { // Получение ссылки на активный документ HostMgd.ApplicationServices.Document doc = HostMgd.ApplicationServices.Application.DocumentManager.MdiActiveDocument; // Получение ссылки на редактор докумена HostMgd.EditorInput.Editor ed = doc.Editor; // Получение ссылки на базу данных документа Teigha.DatabaseServices.Database db = doc.Database; // Начало транзакции с базой данных документа using (Teigha.DatabaseServices.Transaction trans = db.TransactionManager.StartTransaction()) { // Открываем словарь листов документа Teigha.DatabaseServices.DBDictionary dict = trans.GetObject(db.LayoutDictionaryId, Teigha.DatabaseServices.OpenMode.ForRead) as Teigha.DatabaseServices.DBDictionary; // Ищем ObjectId нужного листа по его имени Teigha.DatabaseServices.ObjectId A4Id = (Teigha.DatabaseServices.ObjectId)dict["A4"]; // Открываем лист из базы данных Teigha.DatabaseServices.Layout layoutA4 = trans.GetObject(A4Id, Teigha.DatabaseServices.OpenMode.ForRead) as Teigha.DatabaseServices.Layout; // Выводим его название в командную строку ed.WriteMessage(layoutA4.LayoutName); // Завершаем транзакцию trans.Abort(); } } }
 Ссылки
 Teigha.DatabaseServices.DBDictionary, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!