Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotStyleTable.GetLineweightAt
 Послать отзыв
 Метод предоставляет вес линии, который используется стилем печати с указанным индексом в данной таблице.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual double GetLineweightAt( Int32 index );
Копировать Код
Public Overridable Function GetLineweightAt( index As Int32 ) As Double
 Параметры
 Параметры
 Описание
 index
 Индекс стиля печати (индекс записи) в данной таблице. Тип Int32.
 Возвращает
 Возвращает вес (толщину) линии. Тип double.
 Описание
 Метод предоставляет вес (толщину) линии, который используется стилем печати с указанным индексом в данной таблице стилей печати.
 Ссылки
 Teigha.DatabaseServices.PlotStyleTable, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!