Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство OrdinateDimension.leaderEndPoint
 Послать отзыв
 This is leaderEndPoint, a member of class OrdinateDimension.
 Синтаксис
C#
Visual Basic
public set leaderEndPoint;
Public Property leaderEndPoint() As set
 Ссылки
 OrdinateDimension Класс, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!