Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MlineStyleElementCollection.Item
 Послать отзыв
 Свойство возвращает элемент данной коллекции с указанным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public MlineStyleElement this[int index];
Копировать Код
Default Public Property Item( index As Integer ) As MlineStyleElement
 Параметры
 Параметры
 Описание
 index
 Индекс элемента коллекции. Тип int.
 Возвращает
 Возвращает элемент коллекции с индексом index. Тип MlineStyleElement.
 Описание
 Свойство возвращает элемент данной коллекции с указанным индексом. Нумерация элементов коллекции начинается с 0.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MlineStyleElementCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!