Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GripDataCollection.CopyTo
 Послать отзыв
 Метод копирует все элементы коллекции в указанный массив, начиная с позиции в массиве с указанным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public void CopyTo( ref GripData[] A_0, int A_1 );
Копировать Код
Public Sub CopyTo( ByRef A_0() As GripData, A_1 As Integer )
 Параметры
 Параметры
 Описание
 A_0
 Массив, в который копируется эта коллекция. Тип GripData[].
 A_1
 Индекс позиции в массиве, начиная с которой в массиве последовательно сохраняются все элементы коллекции. Тип int.
 Описание
 Метод копирует все элементы коллекции в указанный массив, начиная с позиции в массиве с указанным индексом.
 Ссылки
 Teigha.DatabaseServices.GripDataCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!