Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.UnderlayReference.DefinitionId
 Послать отзыв
 Свойство DefinitionId представляет идентификатор объекта определения подложки, на который ссылается данная подложка.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.ObjectId DefinitionId;
Копировать Код
Public Property DefinitionId As DatabaseServices.ObjectId
 Возвращает
 Возвращает идентификатор объекта UnderlayDefinition. Тип DatabaseServices.ObjectId.
 Описание
 Свойство DefinitionId представляет идентификатор объекта определения подложки UnderlayDefinition, на который ссылается данная подложка.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.UnderlayReference, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!