Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.GraphicsInterface.Drawable.SubViewportDraw
 Послать отзыв
 Метод вычисляет объект и обеспечивает корректное отображение его геометрии в заданном видовом экране.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SubViewportDraw( ref GraphicsInterface.ViewportDraw vd );
Копировать Код
Public Sub SubViewportDraw( ByRef vd As GraphicsInterface.ViewportDraw )
 Параметры
 Параметры
 Описание
 vd
 Входной интерфейс ViewportDraw. Тип GraphicsInterface.ViewportDraw.
 Описание
 Метод используется для построения зависимой от видового представления части графики объекта. Метод вызывается из ViewportDraw() и вычисляет объект для обеспечения корректного отображения геометрии в заданном видовом экране. Отрисовывает объект в видовых экранах листа. Ничего не делает в текущей реализации.
 Ссылки
 Teigha.DatabaseServices.DBObject, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!