Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CoordinateSystem3d.CoordinateSystem3d
 Послать отзыв
 Конструктор класса CoordinateSystem3d. Создает экземпляр класса с указанными параметрами.
 Синтаксис
C#
Visual Basic
Копировать Код
public CoordinateSystem3d( Point3d o, Vector3d x, Vector3d y );
Копировать Код
Public Sub New( o As Point3d, x As Vector3d, y As Vector3d )
 Параметры
 Параметры
 Описание
 o
 Точка начала системы координат. Тип Point3d.
 x
 Направляющий вектор оси X. Тип Vector3d.
 y
 Направляющий вектор оси Y. Тип Vector3d.
 Описание
 Конструктор класса CoordinateSystem3d. Создает экземпляр класса с указанными параметрами.
 Замечания
 Направляющий вектор оси Z определяется векторным произведением x.CrossProduct(y).
 Ссылки
 Teigha.Geometry.CoordinateSystem3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!