Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Graph.SetNodeGrowthRate
 Послать отзыв
 Метод позволяет задать количество узлов, под которые графу одномоментно выделяется память.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetNodeGrowthRate( int rate );
Копировать Код
Public Sub SetNodeGrowthRate( rate As Integer )
 Параметры
 Параметры
 Описание
 rate
 Количество узлов, под которые графу выделяется память. Тип int.
 Описание
 Метод позволяет задать количество узлов, под которые графу одномоментно выделяется память. Приращение по умолчанию составляет 8 узлов. В случае большого графа это значение имеет смысл увеличить. Использование более высоких значений повышает производительность ценой выделения дополнительной памяти.
 Ссылки
 Teigha.DatabaseServices.Graph, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!