Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 BlockTableRecord.DrawOrderTableId
 Послать отзыв
 В свойстве хранится ObjectId записи таблицы DrawOrderTable, связанной с этим блоком.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectId DrawOrderTableId { get; }
Копировать Код
Public ReadOnly Property DrawOrderTableId As ObjectId
 Возвращает
 Возвращает ObjectId объекта DrawOrderTable.
 Описание
 В свойстве хранится ObjectId записи таблицы DrawOrderTable, которая относится к данному определению блока.
 Открыв запись таблицы DrawOrderTable по этому ObjectId можно получить информацию о позиции данного блока в порядке отрисовки объектов на чертеже.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.BlockTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!