Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Interfereobjvs
 Послать отзыв
 Синтаксис
C#
Visual Basic
public DatabaseServices::ObjectId Interfereobjvs;
Public Property Interfereobjvs() As DatabaseServices.ObjectId
 Описание
 Возвращает или устанавливает визуальный стиль объектов взаимодействия, определенный в системной переменной INTERFEREOBJVS для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!