Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve3d.GetSamplePoints
 Послать отзыв
 Метод позволяет получить массив точек на кривой в указанном параметрическом интервале.
 Синтаксис
C#
Visual Basic
Копировать Код
public PointOnCurve3d[] GetSamplePoints( double fromParameter, double toParameter, double chordHeight );
Копировать Код
Public Function GetSamplePoints( fromParameter As Double, toParameter As Double, chordHeight As Double ) As PointOnCurve3d()
 Параметры
 Параметры
 Описание
 fromParameter
 Значение параметра, представляющее начало параметрического интервала. Тип double.
 toParameter
 Значение параметра, представляющее конец параметрического интервала. Тип double.
 chordHeight
 Высота хорды, определяющая шаг между соседними точками. Тип double.
 Возвращает
 Возвращает массив точек на кривой. Тип PointOnCurve3d[].
 Описание
 Метод позволяет получить массив точек на кривой в параметрическом интервале между fromParameter и toParameter. Шаг между точками регулируется заданной высотой хорды chordHeight.
 Ссылки
 Teigha.Geometry.Curve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!