Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotPaperUnit
 Послать отзыв
 Данное перечисление определяет единицы измерения при печати на бумажном носителе.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum PlotPaperUnit { Inches = 0, Millimeters = 1, Pixels = 2 }
Копировать Код
Public Enum PlotPaperUnit Inches = 0 Millimeters = 1 Pixels = 2 End Enum
 Члены
 Члены
 Описание
 Inches
 Значение: 0. Единицы измерения - дюймы.
 Millimeters
 Значение: 1. Единицы измерения - миллиметры.
 Pixels
 Значение: 2. Единицы измерения - пиксели.
 Описание
 Данное перечисление определяет единицы измерения при печати на бумажном носителе.
 Ваши комментарии по поводу этого топика: Послать отзыв!