Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Cylinder.SetAngles
 Послать отзыв
 Метод позволяет переопределить начальный и конечный углы для данного цилиндра.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetAngles( double startAngle, double endAngle );
Копировать Код
Public Sub SetAngles( startAngle As Double, endAngle As Double )
 Параметры
 Параметры
 Описание
 startAngle
 Начальный угол. Тип double.
 endAngle
 Конечный угол. Тип double.
 Описание
 Метод позволяет переопределить начальный и конечный углы для данного цилиндра.
 Замечания
 Метод анализирует переданные значения и может корректировать начальный и конечный углы, используя их значения (начальный угол не меньше, чем конечный).
 Ссылки
 Teigha.Geometry.Cylinder, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!