Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObject.GetReactors()
 Послать отзыв
 Метод предоставляет коллекцию указателей на реакторы этого объекта. Этот метод устаревший. Для получения реакторов можно воспользоваться GetTransientReactors() и GetPersistentReactors().
 Синтаксис
C#
Visual Basic
Копировать Код
[Obsolete( "Use GetTransientReactors() instead." )] public Generic.List<RXObject> GetReactors();
Копировать Код
<Obsolete( "Use GetTransientReactors() instead." )> Public Function GetReactors() As Generic.List<RXObject>
 Возвращает
 Возвращает коллекцию указателей на реакторы объекта. Тип Generic.List<RXObject>
 Описание
 Метод предоставляет коллекцию указателей на реакторы этого объекта. Этот метод устаревший. Для получения реакторов можно воспользоваться GetTransientReactors() и GetPersistentReactors().
 Ссылки
 Teigha.DatabaseServices.DBObject, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!