Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.SurfaceSurfaceIntersector.Set
 Послать отзыв
 Метод позволяет переопределить обе поверхности, связанные с данным объектом, а также геометрическую точность вычисления пересечений.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Set( ref Surface surface1, ref Surface surface2, Geometry.Tolerance tolerance );
Копировать Код
Public Sub Set( ByRef surface1 As Surface, ByRef surface2 As Surface, tolerance As Geometry.Tolerance )
 Параметры
 Параметры
 Описание
 surface1
 Первая поверхность, участвующая в пересечении со второй поверхностью. Тип Surface.
 surface2
 Вторая поверхность, участвующая в пересечении с первой поверхностью. Тип Surface.
 tolerance
 Заданная геометрическая точность. Тип Geometry.Tolerance.
 Описание
 Метод позволяет переопределить обе поверхности, связанные с данным объектом, а также геометрическую точность вычисления пересечений.
 Ссылки
 Teigha.Geometry.SurfaceSurfaceIntersector, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!