Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MText.TextStyle
 Послать отзыв
 Свойство представляет идентификатор стиля текста, используемого данным объектом MText. Устарело. Рекомендуется использовать свойство TextStyleId.
 Синтаксис
C#
Visual Basic
Копировать Код
[Obsolete("Use TextStyleId functionality instead.")] public DatabaseServices.ObjectId TextStyle;
Копировать Код
<Obsolete("Use TextStyleId functionality instead.")> Public Property TextStyle As DatabaseServices.ObjectId
 Возвращает
 Возвращает идентификатор стиля текста. Тип ObjectId.
 Описание
 Свойство представляет идентификатор стиля текста, используемого данным объектом MText. Это свойство устарело. Рекомендуется использовать свойство TextStyleId.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MText, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!