Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.LastSavedAsMaintenanceVersion
 Послать отзыв
 Синтаксис
C#
Visual Basic
public DatabaseServices::MaintenanceReleaseVersion LastSavedAsMaintenanceVersion;
Public Property LastSavedAsMaintenanceVersion() As DatabaseServices.MaintenanceReleaseVersion
 Описание
 Возвращает минорную (maintenance) версию, в которой в текущей сессии чертеж был сохранен как. Если в текущей сессии еще не было сохранения чертежа, метод возвращает 0.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!