Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Point3dCollection.Point3dCollection
 Послать отзыв
 Конструктор для класса Point3dCollection. Создает коллекцию 3D-точек на основе переданного массива точек.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3dCollection( ref Point3d[] values );
Копировать Код
Public Sub New( ByRef values As Point3d() )
 Параметры
 Параметры
 Описание
 values
 Входной массив точек. Тип Point3d[].
 Описание
 Конструктор для класса Point3dCollection. Создает коллекцию 3D-точек на основе переданного массива точек values.
 Ссылки
 Teigha.Geometry.Point3dCollection, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!