Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.Dimtsz
 Послать отзыв
 Свойство управляет размером засечек, отображаемых вместо стрелок на линейных, радиальных и диаметральных размерах.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Dimtsz;
Копировать Код
Public Property Dimtsz As Double
 Возвращает
 Возвращает размер засечек. Тип double. Если Dimtsz = 0, отображаются стрелки.
 Описание
 Свойство задает или возвращает размер засечек, отображаемых вместо стрелок на линейных, радиальных и диаметральных размерах.
 Значение свойства Dimtsz определяет расстояние параллельно размерной линии, на которое засечка выходит за пределы выносных линий. Если Dimtsz = 0, отображаются стрелки. Положительные значения определяют размер косых штрихов.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!