Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.UnderlayDefinition.ActiveFileName
 Послать отзыв
 Свойство ActiveFileName представляет полный путь к файлу, на который ссылается данная подложка.
 Синтаксис
C#
Visual Basic
Копировать Код
public String ActiveFileName;
Копировать Код
Public ReadOnly Property ActiveFileName As String
 Возвращает
 Полный путь к файлу. Тип String.
 Описание
 Свойство ActiveFileName представляет полный путь к файлу, на который ссылается данная подложка.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.UnderlayDefinition, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!