Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Shape.Rotation
 Послать отзыв
 Свойство Rotation представляет угол поворота данного объекта в своей плоскости.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Rotation;
Копировать Код
Public Property Rotation As Double
 Возвращает
 Возвращает угол поворота объекта в радианах. Тип double.
 Описание
 Свойство Rotation представляет угол поворота данного объекта в своей плоскости (в радианах).
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Shape, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!