Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ObjectTypeAttribute.ObjectType
 Послать отзыв
 Свойство представляет тип объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public Type ObjectType;
Копировать Код
Public ReadOnly Property ObjectType As Type
 Возвращает
 Возвращает тип объекта. Тип Type.
 Описание
 Свойство представляет тип объекта.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.ObjectTypeAttribute, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!