Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CellBorder.IsVisible
 Послать отзыв
 Свойство IsVisible позволяет определить видимость границы ячейки.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool? IsVisible;
Копировать Код
Public Property IsVisible As Boolean?
 Возвращает
 Возвращает true, если граница является видимой. Тип bool?.
 Описание
 Свойство IsVisible позволяет определить видимость границы ячейки.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.CellBorder, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!