Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PhysicalIntensityMethod
 Послать отзыв
 Данное перечисление определяет доступные методы расчета физической интенсивности испускаемого света.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum PhysicalIntensityMethod { Flux = 1, Illuminance = 2, PeakIntensity = 0 }
Копировать Код
Public Enum PhysicalIntensityMethod Flux = 1 Illuminance = 2 PeakIntensity = 0 End Enum
 Члены
 Члены
 Описание
 PeakIntensity
 Значение: 0. Пиковая интенсивность. Единица измерения - кандела.
 Flux
 Значение: 1. Световой поток. Единица измерения - люмен.
 Illuminance
 Значение: 2. Освещенность. Единица измерения - люкс.
 Описание
 Данное перечисление определяет доступные методы расчета физической интенсивности испускаемого света.
 Используемые единицы измерения интенсивности света зависят от выбора метода расчета физической интенсивности (т.е. кандела для PeakIntensity, люмен для Flux и люкс для Illuminance).
 Ваши комментарии по поводу этого топика: Послать отзыв!