Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CoordinateSystem3d.Origin
 Послать отзыв
 Свойство Origin представляет точку начала данной системы координат.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d Origin;
Копировать Код
Public ReadOnly Property Origin As Point3d
 Возвращает
 Возвращает точку начала данной системы координат. Тип Point3d.
 Описание
 Свойство Origin представляет точку начала данной системы координат.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.CoordinateSystem3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!