Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Ray2d.Set
 Послать отзыв
 Метод переопределяет точку начала и направляющий вектор данного луча.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Set( Point2d point, Vector2d vector );
Копировать Код
Public Sub [Set]( point As Point2d, vector As Vector2d )
 Параметры
 Параметры
 Описание
 point
 Новая начальная точка луча. Тип Point2d.
 vector
 Направляющий вектор луча. Тип Vector2d. Должен иметь ненулевую длину.
 Описание
 Метод переопределяет точку начала и направляющий вектор данного луча.
 Ссылки
 Teigha.Geometry.Ray2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!