Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Spline.Degree
 Послать отзыв
 Свойство Degree представляет степень данного сплайна.
 Синтаксис
C#
Visual Basic
Копировать Код
public int Degree;
Копировать Код
Public ReadOnly Property Degree As Integer
 Возвращает
 Возвращает степень сплайна. Тип int.
 Описание
 Свойство Degree представляет степень данного сплайна.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Spline, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!