Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LinkedTableData.UpdateDataLink
 Послать отзыв
 Метод позволяет обновить внешнюю ссылку в указанной ячейке с учетом заданного направления и опций обновления.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void UpdateDataLink( int row, int column, UpdateDirection dir, UpdateOption option );
Копировать Код
Public Overridable Sub UpdateDataLink( row As Integer, column As Integer, dir As UpdateDirection, [option] As UpdateOption )
 Параметры
 Параметры
 Описание
 row
 Индекс строки. Тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 column
 Индекс столбца. Тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице.
 dir
 Направление обновления данных. Перечисление UpdateDirection.
 option
 Опции обновления данных. Перечисление UpdateOption.
 Описание
 Метод позволяет обновить внешнюю ссылку в указанной ячейке с учетом заданного направления и опций обновления.
 Замечания
 Метод выбрасывает исключение eInvalidInput, если индексы строки и/или столбца выходят за допустимые пределы.
 Ссылки
 Teigha.DatabaseServices.LinkedTableData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!