Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.MaterialDictionaryId
 Послать отзыв
 Синтаксис
C#
Visual Basic
public DatabaseServices::ObjectId MaterialDictionaryId;
Public Property MaterialDictionaryId() As DatabaseServices.ObjectId
 Описание
 Возвращает Id словаря ACAD_MATERIAL, который содержит объекты типа "Материалы".
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!