Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Entity.ReceiveShadows
 Послать отзыв
 Свойство предназначено для получения или установки флага, определяющего, может ли данный геометрический объект принимать тени от других объектов при трёхмерной визуализации.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool ReceiveShadows;
Копировать Код
Public Property ReceiveShadows() As bool
 Возвращает
 Возвращает значение типа bool, где true указывает, что на объект могут падать тени, а false — что он игнорирует тени.
 Описание
 Свойство обеспечивает доступ к признаку, может ли на объект падать тень.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Entity, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!