Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.DimensionStyleName
 Послать отзыв
 Свойство задает или возвращает имя размерного стиля в данном объекте Dimension.
 Синтаксис
C#
Visual Basic
Копировать Код
public String DimensionStyleName;
Копировать Код
Public Property DimensionStyleName As String
 Возвращает
 Возвращает имя размерного стиля. Тип String.
 Описание
 Свойство задает или возвращает имя размерного стиля в данном объекте Dimension. Установка DimensionStyleName присваивает размерному стилю этого имени стиля размеру, если стиль существует, или будет выдано исключение, если стиля с таким именем нет.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!