Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.Prefix
 Послать отзыв
 Свойство задает или возвращает префикс размерного текста.
 Синтаксис
C#
Visual Basic
Копировать Код
public String Prefix;
Копировать Код
Public Property Prefix As String
 Возвращает
 Возвращает префикс размерного текста. Тип String.
 Описание
 Свойство задает или возвращает префикс размерного текста при использовании основных единиц измерения.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!