Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.UpdateDataLink
 Послать отзыв
 Метод предназначен для обновления в таблице всех внешних ссылок.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void UpdateDataLink( UpdateDirection dir, UpdateOption option );
Копировать Код
Public virtual Sub UpdateDataLink( dir As UpdateDirection, option As UpdateOption )
 Параметры
 Параметры
 Описание
 dir
 Направление обновления. Значение из перечисления Teigha.DatabaseServices.UpdateDirection.
 option
 Опции обновления. Значение из перечисления Teigha.DatabaseServices.UpdateOption.
 Описание
 Метод позволяет обновить в таблице все ссылки на внешние данные.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!