Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MeshDataCollection.FaceArray
 Послать отзыв
 Свойство представляет коллекцию граней сети.
 Синтаксис
C#
Visual Basic
Копировать Код
public Int32Collection FaceArray;
Копировать Код
Public Property FaceArray As Int32Collection
 Возвращает
 Возвращает массив граней сети. Тип Int32Collection.
 Описание
 Свойство представляет коллекцию граней сети.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MeshDataCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!