Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LeaderDirectionType
 Послать отзыв
 Данное перечисление определяет варианты относительного расположения полки мультивыноски.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum LeaderDirectionType { BottomLeader = 4, LeftLeader = 1, RightLeader = 2, TopLeader = 3, UnknownLeader = 0 }
Копировать Код
Public Enum LeaderDirectionType BottomLeader = 4 LeftLeader = 1 RightLeader = 2 TopLeader = 3 UnknownLeader = 0 End Enum
 Члены
 Члены
 Описание
 UnknownLeader
 Значение: 0. Расположение полки неизвестно.
 LeftLeader
 Значение: 1. Полка слева.
 RightLeader
 Значение: 2. Полка справа.
 TopLeader
 Значение: 3. Полка сверху.
 BottomLeader
 Значение: 4. Полка снизу.
 Описание
 Данное перечисление определяет варианты относительного расположения полки мультивыноски.
 Ваши комментарии по поводу этого топика: Послать отзыв!