Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Solid3d.TransformFaces
 Послать отзыв
 Метод предназначен для геометрического преобразования указанных граней данного твердого тела, заданного матрицей преобразования.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void TransformFaces( ref SubentityId[] subentityIds, Matrix3d matrix );
Копировать Код
Public Overridable Sub TransformFaces( ByRef subentityIds() As SubentityId, matrix As Matrix3d )
 Параметры
 Параметры
 Описание
 subentityIds
 Идентификаторы подобъектов граней данного твердого тела. Тип SubentityId[].
 matrix
 Матрица геометрического преобразования. Тип Matrix3d.
 Описание
 Метод предназначен для геометрического преобразования указанных граней данного твердого тела, заданного матрицей преобразования.
 В некоторых случаях преобразование граней может привести к тому, что тело станет недопустимым. Этот метод доступен только в среде пространственного моделирования.
 Ссылки
 Teigha.DatabaseServices.Solid3d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!