Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Line3d.Set
 Послать отзыв
 Метод изменяет определение линии так, чтобы она проходила через указанную точку в заданном направлении.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Set( Point3d point, Vector3d vector );
Копировать Код
Public Sub Set( point As Point3d, vector As Vector3d )
 Параметры
 Параметры
 Описание
 point
 Новая опорная точка. Тип Point3d.
 vector
 Новый вектор, задающий направление прямой. Тип Vector3d.
 Описание
 Метод изменяет определение линии так, чтобы она проходила через точку point в направлении вектора vector ненулевой длины.
 Ссылки
 Teigha.Geometry.Line3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!