Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DataCellCollection.CopyTo
 Послать отзыв
 Копирует объекты из коллекции в указанный массив, начиная с заданного индекса.
 Синтаксис
C#
Visual Basic
Копировать Код
public void CopyTo( ref DataCell[] arr, int index );
Копировать Код
Public Sub CopyTo( ByRef arr As DataCell(), index As Integer )
 Параметры
 Параметры
 Описание
 arr
 Массив, в который копируется коллекция. Тип DataCell[].
 index
 Индекс в массиве, начиная с которого выполняется копирование элементов коллекции. Тип int.
 Описание
 Копирует объекты из коллекции в указанный массив, начиная с заданного индекса.
 Ссылки
 Teigha.DatabaseServices.DataCellCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!