Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Face.MakeEdgeInvisibleAt
 Послать отзыв
 Метод позволяет сделать невидимым ребро с указанным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public void MakeEdgeInvisibleAt( short vertexIndex );
Копировать Код
Public Sub MakeEdgeInvisibleAt( vertexIndex As Short )
 Параметры
 Параметры
 Описание
 vertexIndex
 Индекс вершины грани (0, 1, 2 или 3). Тип short.
 Описание
 Метод позволяет сделать невидимым ребро с указанным индексом.
 Ссылки
 Teigha.DatabaseServices.Face, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!