Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.KnotCollection.SetRange
 Послать отзыв
 Метод позволяет переопределить общий интервал значений данного узлового вектора.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetRange( double lower, double upper );
Копировать Код
Public Sub SetRange( lower As Double, upper As Double )
 Параметры
 Параметры
 Описание
 lower
 Новый нижний узел. Должен быть меньше нового верхнего узла. Тип double.
 upper
 Новый верхний узел. Должен быть больше нового нижнего узла. Тип double.
 Описание
 Метод позволяет переопределить общий интервал значений данного узлового вектора, используя новые значения для первого и последнего узлов в коллекции.
 Ссылки
 Teigha.Geometry.KnotCollection, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!