Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ObjectOverrule.Erase
 Послать отзыв
 Метод вызывает соответствующий метод OdDbObjectOverrule.Erase().
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void Erase( ref DBObject dbObject, bool erasing );
Копировать Код
Public virtual void Sub Erase( ByRef dbObject As DBObject, erasing As Boolean )
 Параметры
 Параметры
 Описание
 dbObject
 Объект DBObject базы данных, к которому применяется переопределение.
 erasing
 Логический флаг, определяющий состояние удаления. Тип bool.
 Описание
 Метод вызывает соответствующий метод OdDbObjectOverrule.Erase().
 Ссылки
 Teigha.DatabaseServices.ObjectOverrule, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!