Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.ClipBoundary2d.ClipBoundary2d
 Послать отзыв
 Конструктор по умолчанию класса ClipBoundary2d.
 Синтаксис
C#
Visual Basic
Копировать Код
public ClipBoundary2d();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса ClipBoundary2d. Создает пустой объект ClipBoundary2d без заданной границы обрезки.
 Ссылки
 Teigha.Geometry.ClipBoundary2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!