Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Splinetype
 Послать отзыв
 Синтаксис
C#
Visual Basic
public int Splinetype;
Public Property Splinetype() As Integer
 Описание
 Обеспечивает доступ к текущему значению SPLINETYPE для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!