Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FieldEvaluator
 Послать отзыв
 Класс FieldEvaluator является абстрактным базовым классом, определяющим интерфейс вычислителя поля.
 Иерархия классов
Teigha::DatabaseServices::FieldEvaluator
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdFdFieldEvaluator")] public abstract class FieldEvaluator : RXObject
Копировать Код
<Wrapper("OdFdFieldEvaluator")> Public MustInherit Class FieldEvaluator Inherits RXObject
 Описание
 Класс FieldEvaluator является абстрактным базовым классом, определяющим интерфейс вычислителя поля.
 Замечания
 Приложения реализуют вычислители для своих полей, производные от этого класса. Объект вычислителя предоставляется загрузчиком вычислителя поля. Идентификатор требуемого для загрузки вычислителя хранится в поле. Класс вычислителя может быть реализован как для каждого типа поля, так и для нескольких типов полей.
 Методы
 Конструкторы
 Имя
 Описание
 FieldEvaluator
 Конструктор по умолчанию класса FieldEvaluator.
 Топики
 Имя
 Описание
 FieldEvaluator Методы
 Ниже перечислены методы класса FieldEvaluator.
 Ссылки
 FieldEvaluator Методы, Методы, Топики, FieldEvaluator Методы
 Ваши комментарии по поводу этого топика: Послать отзыв!