Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LineSpacingStyle
 Послать отзыв
 Данное перечисление определяет метод определения межстрочного интервала, который используется в многострочном тексте MText.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum LineSpacingStyle { AtLeast = 1, Exactly = 2 }
Копировать Код
Public Enum LineSpacingStyle AtLeast = 1 Exactly = 2 End Enum
 Члены
 Члены
 Описание
 AtLeast
 Значение: 1. Не менее. Величина межстрочного интервала является минимальной, адаптивно изменяемой в зависимости от высоты текста.
 Exactly
 Значение: 2. Точное значение. Межстрочный интервал фиксирован и от высоты текста не зависит (равномерное расположение строк).
 Описание
 Данное перечисление определяет метод определения межстрочного интервала, который используется в многострочном тексте MText.
 Ваши комментарии по поводу этого топика: Послать отзыв!