Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GripData.ReturnValue
 Послать отзыв
 Данное перечисление представляет результаты выполнения операции.
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdResult")] public enum ReturnValue { Ok = 0, Failure = 144, NoRedrawGrip = 145, GripHotToWarm = 146, GetNewGripPoints = 147 }
Копировать Код
<Wrapper("OdResult")> Public Enum ReturnValue Ok = 0 Failure = 144 NoRedrawGrip = 145 GripHotToWarm = 146 GetNewGripPoints = 147 End Enum
 Члены
 Члены
 Описание
 Ok
 Значение: 0. Ok, ошибок нет.
 Failure
 Значение: 144. Ошибка моделирования общего вида.
 NoRedrawGrip
 Значение: 145. Ошибка перерисовки ручки.
 GripHotToWarm
 Значение: 146. Подсвеченная ручка стала активной.
 GetNewGripPoints
 Значение: 147. Получены новые точки привязки ручек.
 Описание
 Данное перечисление представляет результаты выполнения операции.
 Ваши комментарии по поводу этого топика: Послать отзыв!