Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Group.Replace
 Послать отзыв
 Метод предназначен для замены в составе данной группы одного объекта другим.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Replace( DatabaseServices.ObjectId oldId, DatabaseServices.ObjectId newId );
Копировать Код
Public Sub Replace( oldId As DatabaseServices.ObjectId, newId As DatabaseServices.ObjectId )
 Параметры
 Параметры
 Описание
 oldId
 Удаляемый из группы объект. Тип DatabaseServices.ObjectId.
 newId
 Объект, добавляемый в группу взамен объекта oldId. Тип DatabaseServices.ObjectId.
 Описание
 Метод предназначен для замены одного объекта в составе данной группы другим объектом, который в этой группе не состоит.
 Ссылки
 Teigha.DatabaseServices.Group, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!