Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Vertex2d.Vertex2d
 Послать отзыв
 Конструктор по умолчанию класса Vertex2d.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vertex2d();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса Vertex2d.
 Ссылки
 Teigha.DatabaseServices.Vertex2d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!