Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CellMargins
 Послать отзыв
 Данное перечисление определяет типы полей у ячеек в таблицах.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum CellMargins { Bottom = 4, Left = 2, Right = 8, Top = 1 }
Копировать Код
Public Enum CellMargins Bottom = 4 Left = 2 Right = 8 Top = 1 End Enum
 Члены
 Члены
 Описание
 Top
 Значение: 1. Поле сверху.
 Left
 Значение: 2. Поле слева.
 Bottom
 Значение: 4. Поле снизу.
 Right
 Значение: 8. Поле справа.
 Описание
 Данное перечисление определяет типы полей у ячеек в таблицах. Поля задают расстояния между границами и содержимым ячейки слева, справа, сверху и снизу.
 Ваши комментарии по поводу этого топика: Послать отзыв!