Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.UnderlayReference.IsOn
 Послать отзыв
 Свойство IsOn позволяет определить, отображается ли данная ссылка на подложку.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsOn;
Копировать Код
Public Property IsOn As Boolean
 Возвращает
 Возвращает true, если данный объект является видимым. В противном случае возвращает false.
 Описание
 Свойство IsOn позволяет определить, отображается ли данная ссылка на подложку (является ли она видимой).
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.UnderlayReference, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!