Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.Dimblk1
 Послать отзыв
 Свойство задает или возвращает идентификатор блока, который используется для отображения стрелки на первом конце размерной линии.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.ObjectId Dimblk1;
Копировать Код
Public Property Dimblk1 As DatabaseServices.ObjectId
 Возвращает
 Возвращает идентификатор блока. Тип DatabaseServices.ObjectId.
 Описание
 Свойство задает или возвращает идентификатор блока, который используется для отображения стрелки на первом конце размерной линии.
 Свойство работает, если в свойстве Dimsah установлено значение true. В противном случае тип стрелок определяется свойством Dimblk.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!