Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Database.Undo
 Послать отзыв
 This is Undo, a member of class Database.
 Синтаксис
C#
Visual Basic
public void Undo();
Public Sub Undo()
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!