Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Sun.Azimuth
 Послать отзыв
 Свойство Azimuth представляет азимут солнца.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Azimuth;
Копировать Код
Public Property Azimuth As Double
 Возвращает
 Возвращает азимут солнца (в радианах). Тип double.
 Описание
 Свойство Azimuth представляет азимут солнца. Это угол от истинного севера до направления на солнце по часовой стрелке. Угол азимута находится в диапазоне от 0 (север) до 2*Pi (север); промежуточные значения — Pi/2 (восток), Pi (юг) и 3*Pi/2 (запад).
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Sun, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!