Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LoftOptions.AlignDirection
 Послать отзыв
 Свойство позволяет проверить состояние флага-индикатора "правильной" взаимной ориентации нормалей заданных поперечных сечений.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool AlignDirection;
Копировать Код
Public ReadOnly Property AlignDirection As Boolean
 Возвращает
 Возвращает true, если взаимная ориентация поперечных сечений является корректной. В противном случае возвращает false.
 Описание
 Свойство позволяет проверить состояние флага-индикатора "правильной" взаимной ориентации заданных поперечных сечений. Они должны быть ориентированы так, чтобы вектор нормали каждого сечения указывал на следующее сечение. Нарушение этого правила может приводить к нежелательным искривлениям или самопересечениям получаемой поверхности.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.LoftOptions, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!