Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.HyperlinkBase
 Послать отзыв
 Синтаксис
C#
Visual Basic
public String HyperlinkBase;
Public Property HyperlinkBase() As String
 Описание
 Возвращает или устанавливает копию пути как новое значение заголовка переменной HYPERLINKBASE.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!