Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод RasterImageDef.SetImage
 Послать отзыв
 Синтаксис
C#
Visual Basic
public void SetImage(IntPtr image, IntPtr fileDescription, bool modifyDatabase);
Public Sub SetImage(image As IntPtr, fileDescription As IntPtr, modifyDatabase As bool)
 Параметры
 Параметры
 Описание
 image
 указатель на корректный объект OdGiRasterImage
 fileDescription
 null
 modifyDatabase
 Признак того, должна ли производиться запись в буфер Undo
 Описание
 Прямо устанавливает, что будет использоваться объект в памяти OdGiRasterImage
 Этот метод предназначен для разработчиков приложений редактирования растрового изображения.
 Статус loaded должен быть установлен в false при вызове метода. Он может быть создан для создания объекта RasterImageDef вместо вызова ActiveFileName.
 Если image не null и является корректным, статус loaded будет установлен в true. В противном случае, статус loaded будет установлен в false.
 Если modifyDatabase равен true, запись в буфер Undo будет производиться для изменений, сделанных в объекте RasterImageDef.
 Используйте механизм ImageModified и RasterImageDefReactor для уведомления о попытках удаления изображения.
 Ссылки
 Teigha.DatabaseServices.RasterImageDef, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!