Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AttributeDefinition.AttributeDefinition
 Послать отзыв
 Конструктор по умолчанию.
 Синтаксис
C#
Visual Basic
Копировать Код
public AttributeDefinition();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию.
 Ссылки
 Teigha.DatabaseServices.AttributeDefinition, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!