Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.PointOnSurface.GetMixedPartial
 Послать отзыв
 Метод вычисляет смешанную частную производную в текущей точке поверхности. В текущей версии не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d GetMixedPartial();
Копировать Код
Public Function GetMixedPartial() As Vector3d
 Возвращает
 Возвращает вектор смешанной частной производной в данной точке поверхности. Тип Vector3d.
 Описание
 Метод вычисляет смешанную частную производную в текущей точке поверхности. В текущей версии не реализован.
 Ссылки
 Teigha.Geometry.PointOnSurface, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!