Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Column.Name
 Послать отзыв
 Свойство Name представляет имя столбца ячеек.
 Синтаксис
C#
Visual Basic
Копировать Код
public String Name;
Копировать Код
Public Property Name As String
 Возвращает
 Возвращает имя столбца ячеек. Тип String.
 Описание
 Свойство Name представляет имя столбца ячеек.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Column, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!