Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ObjectIdCollection.GetEnumerator
 Послать отзыв
 Метод предоставляет перечислитель для данной коллекции.
 Синтаксис
C#
Visual Basic
Копировать Код
public System.Collections.IEnumerator GetEnumerator();
Копировать Код
Public Function GetEnumerator() As System.Collections.IEnumerator
 Возвращает
 Возвращает объект перечислителя. Тип System.Collections.IEnumerator.
 Описание
 Метод предоставляет перечислитель для данной коллекции.
 Ссылки
 Teigha.DatabaseServices.ObjectIdCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!