Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MTextFragmentCallbackStatus
 Послать отзыв
 Перечисление MTextFragmentCallbackStatus определяет статусы возвращаемого результата обратного вызова MTextFragmentCallback.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum MTextFragmentCallbackStatus { Terminate = 0, Continue = 1 }
Копировать Код
Public Enum MTextFragmentCallbackStatus Terminate = 0 Continue = 1 End Enum
 Члены
 Члены
 Описание
 Continue
 Значение: 1. Продолжить разбиение фрагментов текста.
 Terminate
 Значение: 0. Завершить разбиение фрагментов текста.
 Описание
 Перечисление MTextFragmentCallbackStatus определяет статусы возвращаемого результата обратного вызова MTextFragmentCallback.
 Ваши комментарии по поводу этого топика: Послать отзыв!