Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObject.ObjectId
 Послать отзыв
 Свойство предназначено для получения идентификатора этого объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectId ObjectId;
Копировать Код
Public Property ObjectId() As ObjectId
 Возвращает
 Возвращает идентификатор объекта. Тип ObjectId
 Описание
 Свойство предоставляет значение идентификатора этого объекта в базе данных чертежа.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.DBObject, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!