Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.PlanarEntity.ClosestPointToPlanarEntity
 Послать отзыв
 Метод вычисляет точку на данном объекте, которая располагается ближе всего к указанной плоской поверхности, и точку на этой плоской поверхности, которая ближе всего располагается к данному объекту. Вычисление координат точек выполняется в пределах явно заданной точности.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d[] ClosestPointToPlanarEntity( ref PlanarEntity otherPlane, Tolerance tolerance );
Копировать Код
Public Function ClosestPointToPlanarEntity( ByRef otherPlane As PlanarEntity, tolerance As Tolerance ) As Point3d()
 Параметры
 Параметры
 Описание
 otherPlane
 Входная плоская поверхность, для которой требуется найти ближайшие точки. Тип PlanarEntity.
 tolerance
 Заданная геометрическая точность. Тип Tolerance.
 Возвращает
 Возвращает массив из двух точек. Тип Point3d[]. Первый элемент массива соответствует ближайшей точке на плоскости otherPlane, а второй — ближайшей точке на данной плоской поверхности.
 Описание
 Метод вычисляет точку на данном объекте, которая располагается ближе всего к указанной плоской поверхности, и точку на этой плоской поверхности, которая ближе всего располагается к данному объекту. Вычисление координат точек выполняется в пределах явно заданной точности.
 Ссылки
 Teigha.Geometry.PlanarEntity, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!