Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.TypedValue.TypedValue
 Послать отзыв
 Данный конструктор создает объект с заданным кодом типа и конкретным значением.
 Синтаксис
C#
Visual Basic
Копировать Код
public TypedValue( int typeCode, ref Object value );
Копировать Код
Public Sub New( typeCode As Integer, ByRef value As Object )
 Параметры
 Параметры
 Описание
 typeCode
 Код типа, int.
 value
 Значение. Тип Object.
 Описание
 Данный конструктор создает объект с заданным кодом типа и конкретным значением.
 Ссылки
 Teigha.DatabaseServices.TypedValue, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!