Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Arc.Thickness
 Послать отзыв
 Свойство предназначено для хранения значения толщины линии, которой отрисовывается дуга.
 Синтаксис
C#
Visual Basic
public double Thickness;
Public Property Thickness() As Double
 Возвращает
 Тип данных double.
 Описание
 Свойство хранит или устанавливает толщину линии дуги.
 Замечания
 Толщина дуги — это размер дуги в направлении вдоль вектора нормали (иногда называемое направление выталкивания).
 Величина радиуса используется для группового кода 39 DXF.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Arc, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!