Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DwgFiler.ResetFilerStatus
 Послать отзыв
 Метод предназначен для сброса текущего статуса данного объекта Filer.
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract void ResetFilerStatus();
Копировать Код
Public MustOverride Sub ResetFilerStatus()
 Описание
 Метод предназначен для сброса текущего статуса данного объекта Filer.
 Ссылки
 Teigha.DatabaseServices.DwgFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!