Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GripData.GetTooltip
 Послать отзыв
 Метод задает функцию, используемую для получения строки подсказки для этой ручки.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual String GetTooltip();
Копировать Код
Public Overridable Function GetTooltip() As String
 Возвращает
 Возвращает строку подсказки для ручки. Тип String.
 Описание
 Метод задает функцию, используемую для получения строки подсказки для этой ручки.
 Ссылки
 Teigha.DatabaseServices.GripData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!