Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Surface.GetClosestPointTo
 Послать отзыв
 Метод находит на поверхности точку, которая в пределах указанной точности является ближайшей к некоторой заданной 3D-точке.
 Синтаксис
C#
Visual Basic
Копировать Код
public PointOnSurface GetClosestPointTo( Point3d point, Tolerance tolerance );
Копировать Код
Public Function GetClosestPointTo( point As Point3d, tolerance As Tolerance ) As PointOnSurface
 Параметры
 Параметры
 Описание
 point
 Входная произвольная точка в пространстве. Тип Point3d.
 tolerance
 Заданная геометрическая точность. Тип Tolerance.
 Возвращает
 Возвращает точку на поверхности, которую с предписанной точностью можно считать ближайшей к заданной точке point. Тип PointOnSurface.
 Описание
 Метод находит на поверхности точку, которая в пределах указанной точности является ближайшей к некоторой заданной 3D-точке.
 Ссылки
 Teigha.Geometry.Surface, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!