Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Matrix3d.PlaneToWorld
 Послать отзыв
 Метод формирует матрицу преобразования из системы координат на заданной плоскости в мировую систему координат (WCS). Плоскость задается вектором нормали.
 Синтаксис
C#
Visual Basic
Копировать Код
public Matrix3d PlaneToWorld( Vector3d normal );
Копировать Код
Public Function PlaneToWorld( normal As Vector3d ) As Matrix3d
 Параметры
 Параметры
 Описание
 normal
 Вектор нормали к плоскости. Тип Vector3d.
 Возвращает
 Возвращает матрицу преобразования. Тип Matrix3d.
 Описание
 Метод формирует матрицу преобразования из системы координат на заданной плоскости в мировую систему координат (WCS). Плоскость задается вектором нормали normal.
 Ссылки
 Teigha.Geometry.Matrix3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!