Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Dimfrac
 Послать отзыв
 Синтаксис
C#
Visual Basic
public int Dimfrac;
Public Property Dimfrac() As Integer
 Описание
 Возвращает или устанавливает текущее значение DIMFRAC для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!