Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Polyline.SetPointAt
 Послать отзыв
 Синтаксис
C#
Visual Basic
public void SetPointAt(int index, Point2d pt);
Public Sub SetPointAt(index As Integer, pt As Point2d)
 Параметры
 Параметры
 Описание
 index
 Индекс (отсчитываемый от 0) вершины
 pt
 задаваемые координаты вершины
 Описание
 Устанавливает значение pt (в координатах OCS полилинии) в качестве расположения вершины index.
 Ссылки
 Teigha.DatabaseServices.Polyline, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!