Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CustomScale.GetHashCode
 Послать отзыв
 Метод предназначен для получения хеш-кода данного объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public int GetHashCode();
Копировать Код
Public Function GetHashCode() As Integer
 Возвращает
 Возвращает хеш-код объекта. Тип int.
 Описание
 Метод позволяет получить хеш-код данного объекта. Хеш-код представляет собой целочисленное значение, уникальное для любого экземпляра данного класса.
 Замечания
 Переопределение методов Equals и GetHashCode должно выполняться согласованно с сохранением общей логики. Если Equals возвращает true, хеш-коды сравниваемых объектов обязаны совпадать. Обратное не гарантируется - совпадение хэш-кодов не всегда означает совпадение объектов вследствие возможных коллизий. Хэш-коды должны формироваться с использованием полей, на которых основано равенство объектов.
 Ссылки
 Teigha.DatabaseServices.CustomScale, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!