Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.SetBreakSpacing
 Послать отзыв
 Метод позволяет задать интервал между фрагментами разбитой таблицы.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetBreakSpacing( double spacing );
Копировать Код
Public virtual Sub SetBreakSpacing( spacing As double )
 Параметры
 Параметры
 Описание
 spacing
 Интервал между фрагментами разбитой таблицы. Тип double.
 Описание
 Метод позволяет задать интервал между фрагментами разбитой таблицы.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!