Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CircularArc2d.IntersectWith
 Послать отзыв
 Метод позволяет получить точки пересечения данного объекта с указанной дугой окружности, вычисленные с заданной точностью.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point2d[] IntersectWith( ref CircularArc2d arc, Tolerance tolerance );
Копировать Код
Public Function IntersectWith( ByRef arc As CircularArc2d, tolerance As Tolerance ) As Point2d()
 Параметры
 Параметры
 Описание
 arc
 Входная круглая дуга, пересечение с которой требуется вычислить. Тип CircularArc2d.
 tolerance
 Заданная точность вычислений. Тип Tolerance.
 Возвращает
 Возвращает массив точек пересечения двух дуг. Тип Point2d[].
 Описание
 Метод позволяет получить точки пересечения данного объекта с указанной дугой окружности, вычисленные с заданной точностью.
 Ссылки
 Teigha.Geometry.CircularArc2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!