Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 ViewportTableRecord.GridBoundToLimits
 Послать отзыв
 Свойство предназначено для управления отображением сетки за пределами установленных границ чертежа в пространстве модели.
 Синтаксис
C#
Visual Basic
public bool GridBoundToLimits;
Public Property GridBoundToLimits() As bool
 Возвращает
 Возвращает тип данных bool:
true – отображение сетки только внутри границ чертежа включено;
false – отображение сетки только внутри границ чертежа выключено.
 Описание
 Свойство позволяет включать/отключать отображение сетки за пределами установленных границ чертежа в пространстве модели.
 В интерфейсе свойство настраивается через диалоговое окно «Режимы черчения» для каждого видового экрана отдельно. Окно «Режимы черчения» можно открыть либо командой DDRMODES, DDSETTINGS, либо через меню Сервис -> Режимы черчения…
 Условия
 Чтение и запись.
 Ссылки
 ViewportTableRecord Класс, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!