Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MeshFaceterData.FaceterDevNormal
 Послать отзыв
 Свойство DevNormal представляет максимальное угловое отклонение нормалей соседних граней (угол между соседними гранями сети).
 Синтаксис
C#
Visual Basic
Копировать Код
public double FaceterDevNormal;
Копировать Код
Public Property FaceterDevNormal As Double
 Возвращает
 Возвращает максимальный угол между соседними гранями сети. Тип double.
 Описание
 Свойство DevNormal представляет максимальное угловое отклонение нормалей соседних граней (угол между соседними гранями сети). Это значение используется в процедурах разбиения ребер и размещения линий сети на гранях.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MeshFaceterData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!