Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Polyline.SetEndWidthAt
 Послать отзыв
 Синтаксис
C#
Visual Basic
public void SetEndWidthAt(int index, double endWidth);
Public Sub SetEndWidthAt(index As Integer, endWidth As Double)
 Параметры
 Параметры
 Описание
 index
 Индекс (отсчитываемый от 0) вершины
 endWidth
 Значение конечной ширины вершины index
 Описание
 Этот метод устанавливает конечную ширину вершины index.
 Ссылки
 Teigha.DatabaseServices.Polyline, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!