Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LayoutManager.LayoutsReordered
 Послать отзыв
 Cобытие создается, когда изменяется порядок листов.
 Синтаксис
C#
Visual Basic
Копировать Код
public event System.EventHandler LayoutsReordered
Копировать Код
Public Event LayoutsReordered As System.EventHandler
 Описание
 Cобытие создается, когда изменяется порядок листов.
 Ссылки
 Teigha.DatabaseServices.LayoutManager, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!