Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Database.DxfOut (String^, int, DwgVersion)
 Послать отзыв
 Синтаксис
C#
Visual Basic
public void DxfOut(ref String fileName, int precision, DwgVersion version);
Public Sub DxfOut(ByRef fileName As String, precision As Integer, version As DwgVersion)
 Параметры
 Параметры
 Описание
 fileName
 Имя или URL нового создаваемого DXF файла (расширение .dxf не добавляется автоматически)
 precision
 Количество разрядов точности от 0 до 16
 Описание
 Функция создает DXF файл. Note Точность также может быть установлена равной -1 для изменения выходного формата с формата ASCII DXF файла по умолчанию на двоичный DXF формат.
 Версия
 Минорное и мажорное значения версий формата .dwg.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!