Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CompoundObjectId
 Послать отзыв
 Этот класс позволяет идентифицировать объект в базе данных, когда на объект ссылается вхождение блока BlockReference.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::DatabaseServices::CompoundObjectId
 Синтаксис
C#
Visual Basic
Копировать Код
[TypeDescriptionProvider("Teigha.ComponentModel.TypeDescriptionProvider`1[[Teigha.DatabaseServices.CompoundObjectId, TD_Mgd]], TD_Mgd")] [Wrapper("AcDbCompoundObjectId")] public class CompoundObjectId : Teigha.Runtime.RXObject;
Копировать Код
<TypeDescriptionProvider("Teigha.ComponentModel.TypeDescriptionProvider`1[[Teigha.DatabaseServices.CompoundObjectId, TD_Mgd]], TD_Mgd")> <Wrapper("AcDbCompoundObjectId")> Public Class CompoundObjectId Inherits Teigha.Runtime.RXObject
 Описание
 Этот класс позволяет идентифицировать объект в базе данных, когда на объект ссылается вхождение блока BlockReference. Объект может находиться в основной базе данных (которой принадлежит CompoundObjectId), во внешней базе данных или даже в другой несвязанной базе данных.
 Методы
 Конструкторы
 Teigha.DatabaseServices.CompoundObjectId
 Имя
 Описание
 CompoundObjectId
 Это обзор перегрузок CompoundObjectId.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.DatabaseServices.CompoundObjectId
 Имя
 Описание
 CompoundObjectId Методы
 Ниже перечислены методы класса CompoundObjectId.
 CompoundObjectId Операторы
 Ниже перечислены операторы класса CompoundObjectId.
 CompoundObjectId Свойства
 Ниже перечислены свойства класса CompoundObjectId.
 Ссылки
 CompoundObjectId Конструктор, CompoundObjectId Методы, CompoundObjectId Операторы, CompoundObjectId Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!