Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 DimStyleTableRecord.Dimexo
 Послать отзыв
 Свойство отвечает величину отступа выносных линий от объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual double Dimexo { get; set; }
Копировать Код
Public Overridable Property Dimexo As Double
 Возвращает
 Возвращает тип данных double.
 Описание
 В свойстве хранится величина отступа выносных линий от объекта в виде числа double. Свойство может принимать только положительные числа. Значение по умолчанию 0.5.
 Свойство также доступно через системную переменную DIMEXO и пользовательское меню в окне изменения/создания размерного стиля:
  При изменении системной переменной DIMEXO будет создан новый размерный стиль под названием <переопределение> на основе текущего с новым значением DIMEXO.
 Условия
 Чтение и запись.
 Пример
 Пример изменения отступа выносных линий от объекта (значения свойства Dimexo) в размерном стиле Standard:
C#
 Копировать Код
public partial class Commands { [Teigha.Runtime.CommandMethod("DimexoChange")] public void DimexoStandardDimStyle() { // Получение ссылки на активный документ HostMgd.ApplicationServices.Document doc = HostMgd.ApplicationServices.Application.DocumentManager.MdiActiveDocument; // Получение ссылки на редактор документа HostMgd.EditorInput.Editor ed = doc.Editor; // Получение ссылки на базу данных документа Teigha.DatabaseServices.Database db = doc.Database; // Начало транзакции с базой данных документа using (Teigha.DatabaseServices.Transaction trans = db.TransactionManager.StartTransaction()) { // Открываем таблицу размерных стилей для чтения Teigha.DatabaseServices.DimStyleTable dimStyleTable = trans.GetObject(db.DimStyleTableId, Teigha.DatabaseServices.OpenMode.ForRead) as Teigha.DatabaseServices.DimStyleTable; // Находим в таблице размерных стилей ObjectId нужного стиля по его названию Teigha.DatabaseServices.ObjectId styleId = dimStyleTable["Standard"]; // Открываем таблицу размерного стиля для изменений Teigha.DatabaseServices.DimStyleTableRecord obj = trans.GetObject(styleId, Teigha.DatabaseServices.OpenMode.ForWrite) as Teigha.DatabaseServices.DimStyleTableRecord; ed.WriteMessage($"nDimexo before: {obj.Dimexo}"); // Изменяем величину отступа выносных линий от объекта obj.Dimexo = 3; ed.WriteMessage($"nDimexo after: {obj.Dimexo}"); trans.Commit(); } } } }
 Результат работы команды DimexoChange:
 Было:
 Стало:
 Ссылки
 Teigha.DatabaseServices.DimStyleTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!