Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство DBText.TextString
 Послать отзыв
 Синтаксис
C#
Visual Basic
public String TextString;
Public Property TextString() As String
 Описание
 Предоставляет доступ к нуль-терминированной строке, используемой объектом Text. Текстовая строка может быть увеличена до 256 символов (не включая нуль-символа). Приложение, вызывающее это свойство, ответственно за освобождение памяти, используемое возвращаемой строкой.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.DBText, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!