Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.NurbSurface.GetIsolineAtV
 Послать отзыв
 Метод предназначен для вычисления изопараметрической линии с заданным значением v. Изолинии создаются в направлении u.
 Синтаксис
C#
Visual Basic
Копировать Код
public Curve[] GetIsolineAtV( double dV );
Копировать Код
Public Function GetIsolineAtV( dV As Double ) As Curve()
 Параметры
 Параметры
 Описание
 dV
 Входное значение параметра V. Тип double.
 Возвращает
 Возвращает изопараметрическую линию как массив кривых. Тип Curve[].
 Описание
 Метод предназначен для вычисления изопараметрической линии с заданным значением v. Изолинии создаются в направлении u.
 Если у поверхности есть отверстия, то изопараметрическая линия может состоять из нескольких сегментов. Если поверхность не содержит никакой информации NURBS, метод генерирует исключение eFail.
 Ссылки
 Teigha.DatabaseServices.NurbSurface, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!