Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Graph.AddEdge
 Послать отзыв
 Метод предназначен для добавления к данному объекту Graph нового ориентированного ребра с указанными начальным и конечным узлами.
 Синтаксис
C#
Visual Basic
Копировать Код
public void AddEdge( ref GraphNode from, ref GraphNode toPointer );
Копировать Код
Public Sub AddEdge( ByRef from As GraphNode, ByRef toPointer As GraphNode )
 Параметры
 Параметры
 Описание
 from
 Начальный узел ребра. Тип GraphNode.
 toPointer
 Конечный узел ребра. Тип GraphNode.
 Описание
 Метод предназначен для добавления к данному объекту Graph нового ориентированного ребра с указанными начальным и конечным узлами. В узле from создается исходящая ссылка на узел toPointer, а в узле toPointer - входящая ссылка на узел from.
 Оба узла на концах создаваемого ребра обязаны принадлежать одному и тому же объекту Graph. В противном случае метод завершается ошибкой eInvalidOwnerObject.
 Ссылки
 Teigha.DatabaseServices.Graph, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!