Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Field.HyperLink
 Послать отзыв
 Свойство HyperLink представляет гиперссылку, связанную с данным полем.
 Синтаксис
C#
Visual Basic
Копировать Код
public HyperLink HyperLink;
Копировать Код
Public Property HyperLink As HyperLink
 Возвращает
 Возвращает гиперссылку, связанную с данным полем. Тип HyperLink.
 Описание
 Свойство HyperLink представляет гиперссылку, связанную с данным полем.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Field, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!