Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Torus.AxisOfSymmetry
 Послать отзыв
 Свойство AxisOfSymmetry представляет направление оси симметрии (оси вращения) тора.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d AxisOfSymmetry;
Копировать Код
Public ReadOnly Property AxisOfSymmetry As Vector3d
 Возвращает
 Возвращает направление оси симметрии тора. Тип Vector3d.
 Описание
 Свойство AxisOfSymmetry представляет направление оси симметрии (оси вращения) тора.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.Torus, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!