Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve2d.IsLinear
 Послать отзыв
 Метод проверяет линейность данной кривой.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsLinear( out Line2d line );
Копировать Код
Public Function IsLinear( ByRef line As Line2d ) As Boolean
 Параметры
 Параметры
 Описание
 line
 Выходная линия, совпадающая с данной кривой. Тип Line2d. Содержит значимый объект, только если метод возвращает true.
 Возвращает
 Возвращает true, если данную кривую можно считать линейной. В противном случае возвращает false.
 Описание
 Метод проверяет, можно ли считать данную кривую линейной. В случае линейности кривой метод возвращает совпадающую с кривой линию.
 Используется вызов метода Curve2d.IsLinear(out Line2d line, Tolerance tolerance) со значением точности, равным Tolerance.Global.
 Ссылки
 Teigha.Geometry.Curve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!