Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.ClipBoundary2dData.ClipCondition
 Послать отзыв
 Свойство ClipCondition представляет условие обрезки.
 Синтаксис
C#
Visual Basic
Копировать Код
public ClipCondition ClipCondition;
Копировать Код
Public ReadOnly Property ClipCondition As ClipCondition
 Возвращает
 Возвращает условие обрезки. Тип ClipCondition.
 Описание
 Свойство ClipCondition представляет условие обрезки.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.ClipBoundary2dData, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!