Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ResultBuffer
 Послать отзыв
 Этот класс реализует объект буфера результатов, который представляет собой структуру для хранения и передачи размеченных данных всех основных типов между разнообразными объектами с использованием различных технологий.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::DatabaseServices::ResultBuffer
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdResBuf")] public class ResultBuffer : DisposableWrapper, IEnumerable, IFormattable;
Копировать Код
<Wrapper("OdResBuf")> Public Class ResultBuffer Inherits DisposableWrapper Inherits IEnumerable Inherits IFormattable
 Описание
 Этот класс реализует объект буфера результатов, который представляет собой структуру для хранения и передачи размеченных данных всех основных типов между разнообразными объектами с использованием различных технологий.
 Методы
 Конструкторы
 Teigha.DatabaseServices.ResultBuffer
 Имя
 Описание
 ResultBuffer
 Это обзор перегрузок ResultBuffer.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.DatabaseServices.ResultBuffer
 Имя
 Описание
 ResultBuffer Методы
 Ниже перечислены методы класса ResultBuffer.
 ResultBuffer Операторы
 Ниже перечислены операторы класса ResultBuffer.
 Ссылки
 ResultBuffer Конструктор, ResultBuffer Методы, ResultBuffer Операторы, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!