Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SectionSettings.SetLayer
 Послать отзыв
 Метод позволяет задать имя слоя для геометрии указанного типа.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetLayer( SectionType nSecType, SectionGeometry nGeometry, ref String pszLayer );
Копировать Код
Public Sub SetLayer( nSecType As SectionType, nGeometry As SectionGeometry, ByRef pszLayer As String )
 Параметры
 Параметры
 Описание
 nSecType
 Тип сечения. Перечисление SectionType.
 nGeometry
 Типы элементов геометрии сечения. Перечисление SectionGeometry.
 pszLayer
 Строка с именем слоя. Тип String.
 Описание
 Метод позволяет задать имя слоя, на котором располагается геометрия указанного типа.
 Ссылки
 Teigha.DatabaseServices.SectionSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!