Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Cell.GetTextString
 Послать отзыв
 Метод позволяет получить текстовую строку из данной ячейки, отформатированную согласно указанным опциям.
 Синтаксис
C#
Visual Basic
Копировать Код
public String GetTextString( FormatOption formatOption );
Копировать Код
Public Function GetTextString( formatOption As FormatOption ) As String
 Параметры
 Параметры
 Описание
 formatOption
 Опции форматирования строки. Значение из перечисления FormatOption.
 Возвращает
 Возвращает отформатированную текстовую строку из данной ячейки. Тип String.
 Описание
 Метод позволяет получить текстовую строку из данной ячейки, отформатированную согласно указанным опциям.
 Допустимы следующие варианты:
 Имя
 Значение
 FormatOptionNone
 0
 ForEditing
 1
 ForExpression
 2
 UseMaximumPrecision
 4
 IgnoreMtextFormat
 8
 Ссылки
 Teigha.DatabaseServices.Cell, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!