Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Sun.IsDaylightSavingsOn
 Послать отзыв
 Свойство IsDaylightSavingsOn представляет статус флага учета перехода на летнее время, который используется калькулятором солнечных углов.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsDaylightSavingsOn;
Копировать Код
Public Property IsDaylightSavingsOn As Boolean
 Возвращает
 Возвращает true, если учет перехода на летнее время включен. В противном случае возвращает false.
 Описание
 Свойство IsDaylightSavingsOn представляет статус флага учета перехода на летнее время, который используется калькулятором солнечных углов.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Sun, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!