Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve3d.GetSplitCurves
 Послать отзыв
 Метод делит кривую на два сегмента в точке с указанным значением параметра.
 Синтаксис
C#
Visual Basic
Копировать Код
public Curve3d[] GetSplitCurves( double value );
Копировать Код
Public Function GetSplitCurves( value As double ) As Curve3d()
 Параметры
 Параметры
 Описание
 value
 Значение параметра для точки, в которой выполняется разделение кривой на два сегмента. Тип double.
 Возвращает
 Возвращает массив из двух кривых, являющихся результатом разделения кривой. Тип Curve3d[].
 Описание
 Метод делит кривую на два сегмента в точке с указанным значением параметра.
 Замечания
 Если указанное значение параметра value оказывается за пределами параметрического интервала кривой или, если оно соответствует начальной или конечной точке кривой, массив может содержать нулевые объекты.
 Ссылки
 Teigha.Geometry.Curve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!