Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Cell.TextString
 Послать отзыв
 Свойство обеспечивает доступ к текстовой строке, которая хранится в данной ячейке.
 Синтаксис
C#
Visual Basic
Копировать Код
public String TextString;
Копировать Код
Public Property TextString As String
 Возвращает
 Возвращает строку. Тип String.
 Описание
 Свойство обеспечивает доступ к текстовой строке, которая хранится в данной ячейке.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Cell, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!