Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Interval.GetMerge
 Послать отзыв
 Метод реализует слияние данного интервала с указанным интервалом. Результатом является наименьший интервал, который включает в себя оба интервала.
 Синтаксис
C#
Visual Basic
Копировать Код
public Interval GetMerge( ref Interval otherInterval );
Копировать Код
Public Function GetMerge( ByRef otherInterval As Interval ) As Interval
 Параметры
 Параметры
 Описание
 otherInterval
 Входной интервал. Тип Interval.
 Возвращает
 Возвращает наименьший интервал, который включает в себя как данный интервал, так и интервал otherInterval. Тип Interval.
 Описание
 Метод реализует слияние данного интервала с интервалом otherInterval. Результатом является наименьший интервал, который включает в себя оба интервала.
 Ссылки
 Teigha.Geometry.Interval, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!