Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SweepOptionsBuilder.SweepEntityTransform
 Послать отзыв
 Свойство SweepEntityTransform представляет матрицу преобразования системы координат вытягиваемого объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public Matrix3d SweepEntityTransform;
Копировать Код
Public Property SweepEntityTransform As Matrix3d
 Возвращает
 Возвращает матрицу преобразования. Тип Matrix3d.
 Описание
 Свойство SweepEntityTransform представляет матрицу преобразования системы координат вытягиваемого объекта.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.SweepOptionsBuilder, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!