Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GeoLocationData.UpDirection
 Послать отзыв
 Свойство обеспечивает доступ к направлению вверх в мировой системе координат DWG.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d UpDirection;
Копировать Код
Public Property UpDirection As Vector3d
 Возвращает
 Возвращает направление вверх в мировой системе координат DWG. Тип Vector3d.
 Описание
 Свойство обеспечивает доступ к направлению вверх в мировой системе координат DWG.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.GeoLocationData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!