Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 LayerTableRecord.Description
 Послать отзыв
 В свойстве хранятся текстовые пояснения к слою.
 Синтаксис
C#
Visual Basic
public String Description;
Public Property Description() As String
 Возвращает
 Возвращает тип данных string.
 Описание
 В свойстве хранятся комментарии к слою в виде строки string. С помощью свойства можно прочитать существующие комментарии, либо изменить/добавить их.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.LayerTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!