Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GraphNodeCollection
 Послать отзыв
 Этот класс представляет коллекцию узлов графа.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::DatabaseServices::GraphNodeCollection
 Синтаксис
C#
Visual Basic
Копировать Код
[DefaultMember("Item")] public class GraphNodeCollection : DisposableWrapper, Collections.IList;
Копировать Код
<DefaultMember("Item")> Public Class GraphNodeCollection Inherits DisposableWrapper Inherits Collections.IList
 Описание
 Этот класс представляет коллекцию узлов графа.
 Методы
 Конструкторы
 Teigha.DatabaseServices.GraphNodeCollection
 Имя
 Описание
 GraphNodeCollection
 Конструктор по умолчанию класса GraphNodeCollection.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.DatabaseServices.GraphNodeCollection
 Имя
 Описание
 GraphNodeCollection Методы
 Ниже перечислены методы класса GraphNodeCollection.
 GraphNodeCollection Свойства
 Ниже перечислены свойства класса GraphNodeCollection.
 Ссылки
 GraphNodeCollection Методы, GraphNodeCollection Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!