Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AttributeDefinition.Verifiable
 Послать отзыв
 Свойство позволяет получить или задать статус "Контролируемый" данного объекта AttributeDefinition.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool Verifiable;
Копировать Код
Public Property Verifiable() As Boolean
 Возвращает
 Возвращает true, если объекту AttributeDefinition задан статус "Контролируемый". В противном случае возвращает false.
 Описание
 Свойство позволяет получить или задать статус "Контролируемый" данного объекта AttributeDefinition.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.AttributeDefinition, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!