Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Clayer
 Послать отзыв
 Синтаксис
C#
Visual Basic
public DatabaseServices::ObjectId Clayer;
Public Property Clayer() As DatabaseServices.ObjectId
 Описание
 Возвращает или устанавливает текущее значение ID слоя, являющегося текущим значением переменной CLAYER для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!