Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство RasterImage.Brightness
 Послать отзыв
 Синтаксис
C#
Visual Basic
public unsigned char Brightness;
Public Property Brightness() As unsigned char
 Описание
 Обеспечивает доступ к текущему значению яркости.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.RasterImage, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!