Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DwgFiler.ReadUInt32
 Послать отзыв
 Метод предназначен для получения 32-разрядного целого числа без знака (UInt32) из текущего элемента данного объекта Filer.
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract uint ReadUInt32();
Копировать Код
Public MustOverride Function ReadUInt32() As UInteger
 Возвращает
 Возвращает значение 32-разрядного целого числа без знака. Тип uint.
 Описание
 Метод предназначен для получения 32-разрядного целого числа без знака (UInt32) из текущего элемента данного объекта Filer.
 Ссылки
 Teigha.DatabaseServices.DwgFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!