Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.SetValue
 Послать отзыв
 Метод позволяет задать значение у первого элемента содержимого ячейки с учетом указанных опций.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetValue( int row, int column, int contentIndex, ref Object value, ParseOption parseOption );
Копировать Код
Public virtual Sub SetValue( row As Integer, column As Integer, contentIndex As Integer, ByRef value As Object, parseOption As ParseOption )
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 column
 Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
 contentIndex
 Индекс элемента содержимого ячейки, тип int. Индекс должен быть больше или равен нулю и меньше количества элементов содержимого в ячейке.
 value
 Задаваемое значение, тип Object.
 parseOption
 Опции форматирования из перечисления ParseOption. Метод принимает лишь два значения: ParseOptionNone и PreserveMtextFormat.
 Описание
 Метод позволяет задать значение у первого элемента содержимого ячейки с учетом указанных опций.
 Данный метод принимает только следующие значения перечисления ParseOption (все иные игнорируются):
ParseOptionNone: нет опций.
PreserveMtextFormat: сохранять текущее форматирование MText, если текущее и новое значения оба являются текстом.
 Замечания
 Для получения того же результата предпочтительнее использовать метод Table.Cells[row,column].Content[i].SetValue.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!