Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MlineStyleElement.ToString
 Послать отзыв
 Метод формирует эквивалентное представление данного объекта в виде текстовой строки, которое учитывает предписанные языковые и региональные настройки.
 Синтаксис
C#
Visual Basic
Копировать Код
public String ToString( ref IFormatProvider provider );
Копировать Код
Public Function ToString( ByRef provider As IFormatProvider ) As String
 Параметры
 Параметры
 Описание
 provider
 Провайдер языковых и региональных настроек. Тип IFormatProvider.
 Возвращает
 Возвращает текстовою строку, представляющую данный объект. Тип String.
 Описание
 Метод формирует эквивалентное представление данного объекта в виде текстовой строки, которое учитывает предписанные языковые и региональные настройки.
 Ссылки
 Teigha.DatabaseServices.MlineStyleElement, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!