Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.RenderGlobal.RenderGlobal
 Послать отзыв
 Конструктор по умолчанию класса RenderGlobal.
 Синтаксис
C#
Visual Basic
Копировать Код
public RenderGlobal();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса RenderGlobal.
 Ссылки
 Teigha.DatabaseServices.RenderGlobal, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!