Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство DBText.Oblique
 Послать отзыв
 Синтаксис
C#
Visual Basic
public double Oblique;
Public Property Oblique() As Double
 Описание
 Обеспечивает доступ к углу наклона (в радианах) текста. Этот угол задает отклонение текста от вертикали так, что верх символов текста отклоняется относительно их основания. Это то же самое, как для курсива. Положительный угол отклоняет вершины символов вперед относительно их основания. К негативному значению добавляется значение 2*pi, чтобы привести значения к положительным.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.DBText, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!