Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Filters.Index.GetIterator
 Послать отзыв
 Метод предназначен для создания нового объекта FilteredBlockIterator, который обеспечивает доступ к объектам чертежа в этом объекте Index.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual FilteredBlockIterator GetIterator( ref Filter filter );
Копировать Код
Public Overridable Function GetIterator( ByRef filter As Filter ) As FilteredBlockIterator
 Параметры
 Параметры
 Описание
 filter
 Входной фильтр (запрос), который будет применен к индексу для обхода с использованием итератора. Тип Filter.
 Возвращает
 Возвращает объект итератора. Тип FilteredBlockIterator. В случае ошибки возвращает null.
 Описание
 Метод предназначен для создания нового объекта FilteredBlockIterator, который обеспечивает доступ к объектам чертежа в этом объекте Index.
 Классы индекса и фильтра должны быть совместимыми. Возвращаемый итератор индекса по существу будет методом для обхода результатов запроса, отправленного в объект индекса. Обязанность проверять актуальность и действительность индекса возлагается на реализацию конкретного класса.
 Ссылки
 Teigha.DatabaseServices.Filters.Index, Teigha.DatabaseServices.Filters
 Ваши комментарии по поводу этого топика: Послать отзыв!