Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство DBText.Height
 Послать отзыв
 Синтаксис
C#
Visual Basic
public double Height;
Public Property Height() As Double
 Описание
 Обеспечивает доступ к высоте текста.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.DBText, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!