Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Field.Evaluate
 Послать отзыв
 Метод предназначен для вычисления выражения в данном объекте с учетом указанных опций.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Evaluate( int evaluationOptions, ref DatabaseServices.Database database );
Копировать Код
Public Sub Evaluate( evaluationOptions As Integer, ByRef database As DatabaseServices.Database )
 Параметры
 Параметры
 Описание
 evaluationOptions
 Контекст вычисления выражения. Тип int. Флаг контекста может принимать значения из перечисления FieldEvaluationContext или значения, определяемые пользователем.
 database
 База данных, используемая для вычисления выражения. Тип DatabaseServices.Database. Может равняться null.
 Описание
 Метод предназначен для вычисления выражения в этом поле с учетом указанных опций, определяющих контекст вычислений. Если аргумент database имеет значение null, используется та база данных, в которой объект поля является резидентным.
 Ссылки
 Teigha.DatabaseServices.Field, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!