Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ObjectOverrule.Open
 Послать отзыв
 Метод вызывает соответствующий метод OdDbObjectOverrule.Open().
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void Open( ref DBObject dbObject, OpenMode mode );
Копировать Код
Public virtual Sub Open( ByRef dbObject As DBObject, mode As OpenMode )
 Параметры
 Параметры
 Описание
 dbObject
 Объект DBObject базы данных, к которому применяется переопределение.
 mode
 Режим открытия объекта из перечисления OpenMode.
 Описание
 Метод вызывает соответствующий метод OdDbObjectOverrule.Open().
 Ссылки
 Teigha.DatabaseServices.ObjectOverrule, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!