Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Database.SaveAs (String^, bool, DwgVersion, DatabaseServices::SecurityParameters^)
 Послать отзыв
 Синтаксис
C#
Visual Basic
public void SaveAs(ref String fileName, bool bBakAndRename, DwgVersion version, ref DatabaseServices::SecurityParameters security);
Public Sub SaveAs(ByRef fileName As String, bBakAndRename As bool, version As DwgVersion, ByRef security As DatabaseServices.SecurityParameters)
 Параметры
 Параметры
 Описание
 fileName
 Имя файла или URL, куда записывается информация базы данных
 bBakAndRename
 Признак, указывающий, надо ли создавать .bak файл и изменять имя документа в nanoCAD
 version
 Версия формата .dwg, в которой сохраняется файл
 security
 Структура типа SecurityParameters
 Описание
 Запускает процесс сохранения в базе данных и записывает информацию чертежа в файл, указанный в fileName. Аргумент fileName берется так, как он есть. Если расширения файла нет, .dwg не подставляется.
 Если база данных, в которой исполняется метод, не является текущей, растровое изображение чертежа (для дальнейшего предварительного просмотра) не создается.
 Для определения параметров безопасности, установите параметр security.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!