Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Элемент данных FieldEvaluationStatusResult.status
 Послать отзыв
 This is status, a member of class FieldEvaluationStatusResult.
 Синтаксис
C#
Visual Basic
private FieldEvaluationStatus status;
Private status As FieldEvaluationStatus
 Ссылки
 Teigha.DatabaseServices.FieldEvaluationStatusResult, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!