Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Matrix3d.Mirroring
 Послать отзыв
 Возвращает матрицу преобразования, которое описывает отражение относительно заданной точки в пространстве.
 Синтаксис
C#
Visual Basic
Копировать Код
public Matrix3d Mirroring( Point3d pointValue );
Копировать Код
Public Function Mirroring( pointValue As Point3d ) As Matrix3d
 Параметры
 Параметры
 Описание
 pointValue
 Точка, относительно которой строится отражение. Тип Point3d.
 Возвращает
 Возвращает матрицу преобразования. Тип Matrix3d.
 Описание
 Возвращает матрицу преобразования, которое описывает отражение относительно заданной точки в пространстве.
 Ссылки
 Teigha.Geometry.Matrix3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!