Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Graph.NumNodes
 Послать отзыв
 Свойство возвращает текущее количество узлов в графе.
 Синтаксис
C#
Visual Basic
Копировать Код
public int NumNodes;
Копировать Код
Public ReadOnly Property NumNodes As Integer
 Возвращает
 Возвращает количество узлов в графе. Тип int.
 Описание
 Свойство возвращает текущее количество узлов в графе.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Graph, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!