Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.HatchLoop
 Послать отзыв
 Этот класс представляет данные для определения контура границы штриховки.
 Иерархия классов
Teigha::DatabaseServices::HatchLoop
 Синтаксис
C#
Visual Basic
Копировать Код
public class HatchLoop;
Копировать Код
Public Class HatchLoop
 Описание
 Этот класс представляет данные для определения контура границы штриховки.
 Методы
 Конструкторы
 Имя
 Описание
 HatchLoop
 Конструктор класса HatchLoop.
 Топики
 Имя
 Описание
 HatchLoop Свойства
 Ниже перечислены свойства класса HatchLoop.
 Ссылки
 HatchLoop Свойства, Методы, Топики, HatchLoop Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!