Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Matrix3d.WorldToPlane
 Послать отзыв
 Метод формирует матрицу преобразования кординат из мировой системы координат (WCS) в координаты на плоскости, заданной вектором нормали.
 Синтаксис
C#
Visual Basic
Копировать Код
public Matrix3d WorldToPlane( Vector3d normal );
Копировать Код
Public Function WorldToPlane( normal As Vector3d ) As Matrix3d
 Параметры
 Параметры
 Описание
 normal
 Входной вектор нормали целевой плоскости. Тип Vector3d.
 Возвращает
 Возвращает матрицу Matrix3d, которая обеспечивает заданное преобразование координат.
 Описание
 Метод формирует матрицу преобразования кординат из мировой системы координат (WCS) в систему координат плоскости, заданной вектором нормали.
 Ссылки
 Teigha.Geometry.Matrix3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!