Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FieldEvaluatorLoader
 Послать отзыв
 Класс FieldEvaluatorLoader предназначен для загрузки вычислителей, которые необходимы для вычисления полей.
 Иерархия классов
Teigha::DatabaseServices::FieldEvaluatorLoader
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdFdFieldEvaluatorLoader")] public abstract class FieldEvaluatorLoader : RXObject
Копировать Код
<Wrapper("OdFdFieldEvaluatorLoader")> Public MustInherit Class FieldEvaluatorLoader Inherits RXObject
 Описание
 Класс FieldEvaluatorLoader используется для загрузки вычислителей, которые необходимы для вычисления полей.
 Замечания
 Этот класс играет роль интерфейса между фреймворком полей и приложениями, которые реализуют свои вычислители полей. Приложение, которое реализует вычислитель, должно наследовать этот класс и регистрировать объект этого класса в движке вычисления полей при загрузке приложения. Зарегистрированный загрузчик используется фреймворком для получения объекта вычислителя.
 Приложению требуется только один объект загрузчика, и он может поддерживать несколько вычислителей. Объекты загрузчика поддерживаются глобально и используются всеми открытыми документами.
 Методы
 Конструкторы
 Имя
 Описание
 FieldEvaluatorLoader
 Это обзор перегрузок FieldEvaluatorLoader.
 Топики
 Имя
 Описание
 FieldEvaluatorLoader Методы
 Ниже перечислены методы класса FieldEvaluatorLoader.
 Ссылки
 FieldEvaluatorLoader Конструктор, FieldEvaluatorLoader Методы, Методы, Топики, FieldEvaluatorLoader Методы
 Ваши комментарии по поводу этого топика: Послать отзыв!