Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 DimStyleTableRecord.Dimazin
 Послать отзыв
 Свойство отвечает за подавление десятичных нулей в угловых размерах.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual int Dimazin { get; set; }
Копировать Код
Public Overridable Property Dimazin As Integer
 Возвращает
 Возвращает тип данных int.
 Возвращаемые значения
 Возвращаемые значения
 Описание
 0
 включены все нули (по умолчанию) – включены все ведущие и конечные нули
 1
 подавление ведущих нулей – подавление ведущих десятичных нулей
 2
 подавление конечных нулей – подавление конечных десятичных нулей
 3
 подавление всех нулей – подавление начальных и конечных десятичных нулей
 Описание
 В свойстве хранится настройка подавления десятичных нулей в угловых размерах. В качестве значения свойства доступны следующие целые числа:
0 – включены все нули (по умолчанию) – включены все ведущие и конечные нули;
1 – подавление ведущих нулей – подавление ведущих десятичных нулей (например, 0.005 с подавлением становится .005);
2 – подавление конечных нулей – подавление конечных десятичных нулей (например, 0.5000 с подавлением становится 0.5);
3 – подавление всех нулей – подавление начальных и конечных десятичных нулей (например, 0.5000 становится .5).
 Свойство также доступно через системную переменную DIMAZIN и пользовательское меню в окне изменения/создания размерного стиля:
  При изменении системной переменной DIMAZIN будет создан новый размерный стиль под названием <переопределение> на основе текущего с новым значением DIMAZIN.
 Условия
 Чтение и запись.
 Пример
 Пример изменения настройки подавления десятичных нулей в угловых размерах (значения свойства Dimazin) в размерном стиле Standard:
C#
 Копировать Код
public partial class Commands { [Teigha.Runtime.CommandMethod("DimazinChange")] public void DimazinStandardDimStyle() { // Получение ссылки на активный документ HostMgd.ApplicationServices.Document doc = HostMgd.ApplicationServices.Application.DocumentManager.MdiActiveDocument; // Получение ссылки на редактор документа HostMgd.EditorInput.Editor ed = doc.Editor; // Получение ссылки на базу данных документа Teigha.DatabaseServices.Database db = doc.Database; // Начало транзакции с базой данных документа using (Teigha.DatabaseServices.Transaction trans = db.TransactionManager.StartTransaction()) { // Открываем таблицу размерных стилей для чтения Teigha.DatabaseServices.DimStyleTable dimStyleTable = trans.GetObject(db.DimStyleTableId, Teigha.DatabaseServices.OpenMode.ForRead) as Teigha.DatabaseServices.DimStyleTable; // Находим в таблице размерных стилей ObjectId нужного стиля по его названию Teigha.DatabaseServices.ObjectId styleId = dimStyleTable["Standard"]; // Открываем таблицу размерного стиля для изменений Teigha.DatabaseServices.DimStyleTableRecord obj = trans.GetObject(styleId, Teigha.DatabaseServices.OpenMode.ForWrite) as Teigha.DatabaseServices.DimStyleTableRecord; ed.WriteMessage($"nDimazin before: {obj.Dimazin}"); // Изменяем единицу измерения угловых размеров на радианы если нужно // obj.Dimaunit = 3; // Изменяем точность измерения угловых размеров до 0,001 если нужно // obj.Dimadec = 3; // Изменяем настройку подавления нулей в угловых размерах  // на 1 «подавление ведущих нулей» obj.Dimazin = 1; ed.WriteMessage($"nDimazin after: {obj.Dimazin}"); trans.Commit(); } } }
 Результат работы команды DimazinChange:
 Было:
 Стало:
 Ссылки
 Teigha.DatabaseServices.DimStyleTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!