Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve3dCollection.Count
 Послать отзыв
 Свойство Count представляет количество объектов в данной коллекции.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual int Count;
Копировать Код
Public Overridable ReadOnly Property Count As Integer
 Возвращает
 Возвращает текущее количество объектов в коллекции. Тип int.
 Описание
 Свойство Count представляет количество объектов в данной коллекции.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.Curve3dCollection, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!