Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.ExternalSurface.IsPlane
 Послать отзыв
 Свойство IsPlane позволяет проверить, является ли данная внешняя поверхность плоскостью.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsPlane;
Копировать Код
Public ReadOnly Property IsPlane As Boolean
 Возвращает
 Возвращает true, если данная внешняя поверхность является плоскостью. В противном случае возвращает false.
 Описание
 Свойство IsPlane определяет тип данной внешней поверхности и возвращает true, если она является плоскостью.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.ExternalSurface, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!