Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocArrayPolarParameters.GetAngleBetweenItems
 Послать отзыв
 Метод предоставляет угол между соседними элементами кругового массива. Может варьироваться в интервалеот (0, 2PI].
 Синтаксис
C#
Visual Basic
Копировать Код
public double GetAngleBetweenItems( out String expression, out String evaluatorId );
Копировать Код
Public Function GetAngleBetweenItems( ByRef expression As String, ByRef evaluatorId As String ) As Double
 Параметры
 Параметры
 Описание
 expression
 Выражение для параметра. Тип String. Строка может быть пустой.
 evaluatorId
 Строковое представление идентификатора вычислителя. Тип String. Строка может быть пустой
 Возвращает
 Возвращает угол в радианах между соседними элементами кругового массива. Тип double.
 Описание
 Метод предоставляет угол в радианах между базовыми точками соседних элементов кругового массива. Может варьироваться в интервале от (0, 2PI].
 Если для параметра выражение отсутствует, то после выполнения метода строки expression и evaluatorId остаются пустыми.
 Ссылки
 Teigha.DatabaseServices.AssocArrayPolarParameters, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!