Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SweepOptionsBuilder.ToSweepOptions
 Послать отзыв
 Метод позволяет извлечь параметры операции вытягивания по траектории, связанные с данным объектом.
 Синтаксис
C#
Visual Basic
Копировать Код
public SweepOptions ToSweepOptions();
Копировать Код
Public Function ToSweepOptions() As SweepOptions
 Возвращает
 Возвращает объект настроек операции. Тип SweepOptions.
 Описание
 Метод позволяет извлечь параметры операции вытягивания по траектории, связанные с данным объектом.
 Ссылки
 Teigha.DatabaseServices.SweepOptionsBuilder, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!