Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Point2dCollection.TrimToSize
 Послать отзыв
 Метод приводит ёмкость данной коллекции в соответствие фактическому количеству ее элементов.
 Синтаксис
C#
Visual Basic
Копировать Код
public void TrimToSize();
Копировать Код
Public Sub TrimToSize()
 Описание
 Метод приводит ёмкость данной коллекции в соответствие фактическому количеству ее элементов.
 Ссылки
 Teigha.Geometry.Point2dCollection, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!