Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Database.Insert (Matrix3d, Database^, bool)
 Послать отзыв
 Синтаксис
C#
Visual Basic
public void Insert(Matrix3d transform, ref Database dataBase, bool preserveSourceDatabase);
Public Sub Insert(transform As Matrix3d, ByRef dataBase As Database, preserveSourceDatabase As bool)
 Параметры
 Параметры
 Описание
 transform
 Матрица преобразования, применимая ко всем объектам, которые вставляются
 dataBase
 База данных источника
 preserveSourceDatabase
 Признак, определяющий, будет ли база данных источника сохранена независимой
 Описание
 Вставка пространства модели базы данных, указанной параметром dataBase, в пространство модели данной базы данных, при помощи вызова функцию insert(). В процессе вставки, всем вставляемым объектам в методы transformBy() передаётся матрица преобразования xform.
 Аргумент preserveSourceDatabase определяет, должна ли исходная база данных быть сохранена независимой от базы данных получателя или нет. Значение этого параметра по умолчанию — true. В этом случае объекты из базы данных источника копируются в базу данных получателя и база данных источника не меняется. Если параметр preserveSourceDatabase равен false, то объекты из базы данных источника не переписываются в базу данных-получатель. В этом случае метод исполняется быстрее, но это делает базу данных источника зависимой от базы данных назначения. При таком вызове необходимо быть уверенным, что исходная база данных будет удалена сразу же после или, как минимум, перед удалением базы данных назначения.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!