Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Filters.Filter
 Послать отзыв
 Данный класс является базовым для всех классов фильтров. Этот класс определяет "запрос" и предоставляет "ключ" к объекту FilteredBlockIterator. Индекс, соответствующий этому ключу возвращает свойство IndexClass.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::GraphicsInterface::Drawable Teigha::DatabaseServices::DBObject Teigha::DatabaseServices::Filters::Filter
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("AcDbFilter")] public class Filter : DBObject;
Копировать Код
<Wrapper("AcDbFilter")> Public Class Filter Inherits DBObject
 Описание
 Данный класс является базовым для всех классов фильтров. Этот класс определяет "запрос" и предоставляет "ключ" к объекту FilteredBlockIterator. Индекс, соответствующий этому ключу возвращает свойство IndexClass.
 Applications that need to provide their own indexing scheme need to provide versions of these three classes:
 Приложения, которым требуется специфическая схема индексации, должны реализовать собственные версии следующих трех классов:
Index,
Filter,
FilteredBlockIterator.
 Методы
 Конструкторы
 Teigha.GraphicsInterface.Drawable
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 Drawable
 Конструктор класса Teigha.GraphicsInterface.Drawable. (Унаследован от Drawable)
 Teigha.DatabaseServices.DBObject
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 DBObject
 Конструктор. (Унаследован от DBObject)
 Teigha.DatabaseServices.Filters.Filter
 Имя
 Описание
 Filter
 Конструктор класса Filter.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.GraphicsInterface.Drawable
 Имя
 Описание
 Drawable Методы
 Ниже перечислены методы класса Drawable.
 Drawable Свойства
 Ниже перечислены свойства класса Drawable.
 Teigha.DatabaseServices.DBObject
 Имя
 Описание
 DBObject Методы
 Ниже перечислены методы класса DBObject.
 DBObject Свойства
 Ниже перечислены свойства класса DBObject.
 DBObject События
 Ниже перечислены события класса DBObject.
 Teigha.DatabaseServices.Filters.Filter
 Имя
 Описание
 Filter Свойства
 Ниже перечислены свойства класса Filter.
 Ссылки
 Filter Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства, DBObject События
 Ваши комментарии по поводу этого топика: Послать отзыв!