Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Ellipse.Center
 Послать отзыв
 Свойство Center позволяет задать или получить точку центра эллипса или эллиптической дуги (в системе координат WCS).
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d Center;
Копировать Код
Public Property Center As Point3d
 Возвращает
 Возвращает центр эллипса или эллиптической дуги. Тип Point3d.
 Описание
 Свойство Center предоставляет доступ к точке центра эллипса или эллиптической дуги (в системе координат WCS).
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Ellipse, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!