Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotStyleTable.PlotStyleArr
 Послать отзыв
 Свойство PlotStyleArr представляет массив стилей печати в данном объекте PlotStyleTable.
 Синтаксис
C#
Visual Basic
Копировать Код
public PlotStyle[] PlotStyleArr;
Копировать Код
Public Property PlotStyleArr As PlotStyle()
 Возвращает
 Возвращает массив стилей печати. Тип PlotStyle[].
 Описание
 Свойство PlotStyleArr представляет массив стилей печати в данной таблице стилей печати PlotStyleTable.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.PlotStyleTable, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!