Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Matrix3d.IsUniscaledOrtho
 Послать отзыв
 Метод позволяет проверить, являются ли векторы-столбцы линейной части данной матрицы одинаковыми по длине и перпендикулярными друг другу (в пределах заданной точности).
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsUniscaledOrtho( Tolerance tolerance );
Копировать Код
Public Function IsUniscaledOrtho( tolerance As Tolerance ) As Boolean
 Параметры
 Параметры
 Описание
 tolerance
 Входная точность. Тип Tolerance.
 Возвращает
 Возвращает true, если векторы-столбцы линейной части данной матрицы перпендикулярны друг другу и одинаковы по длине. В противном случае возвращает false.
 Описание
 Метод позволяет проверить, являются ли векторы-столбцы линейной части данной матрицы одинаковыми по длине и перпендикулярными друг другу. Проверка выполняется с учетом заданной точности tolerance.
 Ссылки
 Teigha.Geometry.Matrix3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!