Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LayerViewportProperties
 Послать отзыв
 Этот класс определяет свойства видовых экранов слоев, которые используются в LayerTableRecord.
 Иерархия классов
Teigha::DatabaseServices::LayerViewportProperties
 Синтаксис
C#
Visual Basic
Копировать Код
public class LayerViewportProperties;
Копировать Код
Public Class LayerViewportProperties
 Описание
 Этот класс определяет свойства видовых экранов слоев, которые используются в LayerTableRecord.
 Топики
 Имя
 Описание
 LayerViewportProperties Методы
 Ниже перечислены методы класса LayerViewportProperties.
 LayerViewportProperties Свойства
 Ниже перечислены свойства класса LayerViewportProperties.
 Ссылки
 LayerViewportProperties Методы, LayerViewportProperties Свойства, Топики, LayerViewportProperties Методы, LayerViewportProperties Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!