Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FormattedTableData.SetContentColor
 Послать отзыв
 Метод позволяет задать цвет содержимого ячейки.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetContentColor( int row, int column, ref Colors.Color value );
Копировать Код
Public Overridable Sub SetContentColor( row As Integer, column As Integer, ByRef value As Colors.Color )
 Параметры
 Параметры
 Описание
 row
 Индекс строки. Тип int. Должен быть неотрицательным и меньше количества строк в таблице.
 column
 Индекс столбца. Тип int. Должен быть неотрицательным и меньше количества столбцов в таблице.
 value
 Новый цвет содержимого ячейки. Тип Teigha.Colors.Color.
 Описание
 Метод позволяет задать цвет содержимого ячейки.
 Ссылки
 Teigha.DatabaseServices.FormattedTableData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!