Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Line2dCollection.Remove
 Послать отзыв
 Метод удаляет из коллекции указанную 2D-линию.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Remove( ref Line2d value );
Копировать Код
Public Sub Remove( ByRef value As Line2d )
 Параметры
 Параметры
 Описание
 value
 Удаляемая линия. Тип Line2d.
 Описание
 Метод удаляет из коллекции указанную 2D-линию.
 Ссылки
 Teigha.Geometry.Line2dCollection, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!