Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 DimStyleTableRecord.Dimtmove
 Послать отзыв
 Свойство отвечает за настройку перемещения текста с позиции по умолчанию.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual int Dimtmove { get; set; }
Копировать Код
Public Overridable Property Dimtmove As Integer
 Возвращает
 Возвращает тип данных int.
 Описание
 В свойстве хранится текущая настройка перемещения размерного текста с позиции по умолчанию. В качестве значения свойства доступны следующие целые числа:
0 – перемещать размерную линию с помощью размерного текста (по умолчанию);
1 – добавлять выноску к перемещенному размерному тексту;
2 – свободное перемещение текста без создания выноски.
 Свойство также доступно через системную переменную DIMTMOVE и пользовательское меню в окне изменения/создания размерного стиля:
  При изменении системной переменной DIMTMOVE будет создан новый размерный стиль под названием <переопределение> на основе текущего с новым значением DIMTMOVE.
 Условия
 Чтение и запись.
 Пример
 Пример изменения настройки перемещения текста с позиции по умолчанию (значения свойства Dimtmove) в размерном стиле Standard:
C#
 Копировать Код
public partial class Commands { [Teigha.Runtime.CommandMethod("DimtmoveChange")] public void DimtmoveStandardDimStyle() { // Получение ссылки на активный документ HostMgd.ApplicationServices.Document doc = HostMgd.ApplicationServices.Application.DocumentManager.MdiActiveDocument; // Получение ссылки на редактор документа HostMgd.EditorInput.Editor ed = doc.Editor; // Получение ссылки на базу данных документа Teigha.DatabaseServices.Database db = doc.Database; // Начало транзакции с базой данных документа using (Teigha.DatabaseServices.Transaction trans = db.TransactionManager.StartTransaction()) { // Открываем таблицу размерных стилей для чтения Teigha.DatabaseServices.DimStyleTable dimStyleTable = trans.GetObject(db.DimStyleTableId, Teigha.DatabaseServices.OpenMode.ForRead) as Teigha.DatabaseServices.DimStyleTable; // Находим в таблице размерных стилей ObjectId нужного стиля по его названию Teigha.DatabaseServices.ObjectId styleId = dimStyleTable["Standard"]; // Открываем таблицу размерного стиля для изменений Teigha.DatabaseServices.DimStyleTableRecord obj = trans.GetObject(styleId, Teigha.DatabaseServices.OpenMode.ForWrite) as Teigha.DatabaseServices.DimStyleTableRecord; ed.WriteMessage($"nDimtmove before: {obj.Dimtmove}"); // Изменяем настройку перемещения текста с позиции по умолчанию obj.Dimtmove = 1; ed.WriteMessage($"nDimtmove after: {obj.Dimtmove}"); trans.Commit(); } } }
 Результат работы команды DimtmoveChange:
 Было:
 Когда Dimtmove=0, размерный текст перемещается за ручку вместе с размерными линиями:
  >
 Стало:
 Когда Dimtmove=1, размерный текст перемещается за ручку без перемещения размерных линий, для перемещенного текста автоматически создается выноска.
  >
 Ссылки
 Teigha.DatabaseServices.DimStyleTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!