Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Point3dCollection.Remove
 Послать отзыв
 Метод удаляет из коллекции точку, совпадающую с указанной.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Remove( Point3d value );
Копировать Код
Public Sub Remove( value As Point3d )
 Параметры
 Параметры
 Описание
 value
 Входная точка для поиска удаляемой точки в коллекции. Тип Point3d.
 Описание
 Метод удаляет из коллекции точку, совпадающую с указанной точкой value.
 Ссылки
 Teigha.Geometry.Point3dCollection, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!