Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LayerViewportProperties.LineWeight
 Послать отзыв
 Свойство представляет значение толщины линий на слое в связанном видовом экране.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.LineWeight LineWeight;
Копировать Код
Public Property LineWeight() As DatabaseServices.LineWeight
 Возвращает
 Возвращает толщину линий. Перечисление DatabaseServices.LineWeight.
 Описание
 Свойство представляет значение толщины линий на слое в связанном видовом экране.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.LayerViewportProperties, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!