Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FileDependencyInfo.Index
 Послать отзыв
 Свойство Index представляет уникальный индекс данного объекта в списке зависимостей файлов.
 Синтаксис
C#
Visual Basic
Копировать Код
public int Index;
Копировать Код
Public ReadOnly Property Index As Integer
 Возвращает
 Возвращает уникальный индекс в списке зависимостей файлов. Тип int.
 Описание
 Свойство Index представляет уникальный индекс данного объекта в списке зависимостей файлов.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.FileDependencyInfo, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!