Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.RadialDimension.ChordPoint
 Послать отзыв
 Свойство ChordPoint представляет точку пересечения размерной линии и дуги или окружности, для которых проставляется размер.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d ChordPoint;
Копировать Код
Public Property ChordPoint As Point3d
 Возвращает
 Возвращает координаты точки в мировой системе координат (WCS). Тип Point3d.
 Описание
 Свойство ChordPoint представляет точку пересечения размерной линии и дуги или окружности, для которых проставляется размер.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.RadialDimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!