Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Scale3d.Scale3d
 Послать отзыв
 Конструктор структуры Scale3d. Создает экземпляр структуры, который представляет преобразование масштаба с указанным массивом масштабных коэффициентов.
 Синтаксис
C#
Visual Basic
Копировать Код
public Scale3d( ref double[] xyz );
Копировать Код
Public Sub New( ByRef xyz() As Double )
 Параметры
 Параметры
 Описание
 xyz
 Входной массив масштабных коэффициентов. Тип double[].
 Описание
 Конструктор структуры Scale3d. Создает экземпляр структуры, который представляет преобразование масштаба с указанным массивом масштабных коэффициентов.
 Замечания
 Используются только первые три элемента массива xyz. Эти элементы массива не должны быть нулевыми.
 Каждый из элементов массива xyz представляет свой масштабный коэффициент:
0 — масштабный коэффициент для оси X,
1 — масштабный коэффициент для оси Y,
2 — масштабный коэффициент для оси Z.
 Ссылки
 Teigha.Geometry.Scale3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!