Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Matrix3d.Projection
 Послать отзыв
 Метод формирует матрицу, которая представляет параллельное проецирование на плоскость в указанном направлении.
 Синтаксис
C#
Visual Basic
Копировать Код
public Matrix3d Projection( ref Plane projectionPlane, Vector3d projectDir );
Копировать Код
Public Function Projection( ByRef projectionPlane As Plane, projectDir As Vector3d ) As Matrix3d
 Параметры
 Параметры
 Описание
 projectionPlane
 Плоскость, на которую выполняется проецирование. Тип Plane.
 projectDir
 Направление проецирования. Тип Vector3d.
 Возвращает
 Возвращает матрицу Matrix3d, которая обеспечивает заданное проецирование.
 Описание
 Метод формирует матрицу, которая представляет параллельное проецирование на плоскость projectPlane. Направление проецирования задается вектором projectDir.
 Ссылки
 Teigha.Geometry.Matrix3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!