Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.RenderSettings.Description
 Послать отзыв
 Свойство Description представляет текстовое описание данного объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public String Description;
Копировать Код
Public Property Description As String
 Возвращает
 Возвращает текстовое описание объекта. Тип String.
 Описание
 Свойство Description представляет текстовое описание данного объекта.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.RenderSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!