Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 DimStyleTableRecord.Dimblk2s
 Послать отзыв
 Свойство отвечает за вид второго окончания размерной линии, когда свойство Dimsah = True (окончания размерных линий по Dimblk1s и Dimblk2s).
 Синтаксис
C#
Visual Basic
Копировать Код
public string Dimblk2s { get; set; }
Копировать Код
Public Property Dimblk2s As String
 Возвращает
 Возвращает тип данных string.
 Описание
 В свойстве хранится настройка внешнего вида второго окончания линейного размера в формате строки (string). В строке записано название того окончания, которое установлено в настоящий момент.
 Каждый вид окончания является блоком и в чертеже хранится, как тип данных BlockTableRecord в таблице блоков BlockTable. Коллекция блоков - окончаний размерных линий хранится в шаблоне чертежа и через API недоступна. Отдельные блоки из этой коллекции появляются в таблице блоков чертежа после того, как к ним обратились через свойство Dimblks/Dimblk1s/Dimblk2s или через пользовательский интерфейс:
  При изменении системной переменной DIMBLK2 будет создан новый размерный стиль под названием <переопределение> на основе текущего с новым значением DIMBLK2.
 Также изменение вида окончания размерной линии возможно через системную переменную DIMBLK2.
 Таблица соответствия названий вида окончания и названий в настройках размерных стилей:
 Значение string
 Значение в пользовательском интерфейсе
 .
 Значение по умолчанию, или  - "Закрашенная замкнутая"
 ClosedBlank
  - "Пустая замкнутая"
 Closed
  - "Замкнутая"
 DOT
  - "Точка"
 ARCHTICK
  - "Двойная засечка"
 Oblique
  - "Наклон"
 Open
  - "Разомкнутая"
 Origin
  - "Указатель начала"
 Origin2
  - "Указатель начала 2"
 Open90
  - "Прямой угол"
 OPEN30
  - "Разомкнутая 30"
 DotSmall
  - "Малая точка"
 DotBlank
  - "Контурная точка"
 Small
  - "Контурная малая точка"
 BoxBlank
  - "Прямоугольник"
 BoxFilled
  - "Закрашенный прямоугольник"
 DatumBlank
  - "Треугольник"
 DatumFilled
  - "Закрашенный треугольник"
 Integral
  - "Интеграл"
 NONE
  - "Нет"
 Условия
 Чтение и запись.
 Пример
 В качестве примера можно рассмотреть пример из описания свойства Dimblks. Принцип изменения Dimblk2s аналогичен. Перед тем, как работать со свойством Dimblk2s необходимо установить свойство Dimsah в значение true.
 Ссылки
 Teigha.DatabaseServices.DimStyleTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!