Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Userr3
 Послать отзыв
 Синтаксис
C#
Visual Basic
public double Userr3;
Public Property Userr3() As Double
 Описание
 Обеспечивает доступ к текущему значению USERR3 для базы данных.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!