Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.ClipBoundary2d.ClipBoundary2d
 Послать отзыв
 Конструктор класса ClipBoundary2d. Создает прямоугольную границу обрезки по двум противолежащим угловым точкам прямоугольника.
 Синтаксис
C#
Visual Basic
Копировать Код
public ClipBoundary2d( Point2d firstCorner, Point2d secondCorner );
Копировать Код
Public Sub New( firstCorner As Point2d, secondCorner As Point2d )
 Параметры
 Параметры
 Описание
 firstCorner
 Первая угловая точка прямоугольника. Тип Point2d.
 secondCorner
 Вторая угловая точка прямоугольника. Тип Point2d.
 Описание
 Конструктор класса ClipBoundary2d. Создает прямоугольную границу обрезки по двум угловым точкам на диагонали прямоугольника.
 Ссылки
 Teigha.Geometry.ClipBoundary2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!