Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Spline.HasFitData
 Послать отзыв
 Свойство HasFitData позволяет выяснить, был ли данный сплайн создан методом определяющих точек.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool HasFitData;
Копировать Код
Public ReadOnly Property HasFitData As Boolean
 Возвращает
 Возвращает true, если сплайн был создан методом определяющих точек. В противном случае возвращает false.
 Описание
 Свойство HasFitData позволяет выяснить, был ли данный сплайн создан методом определяющих точек.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Spline, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!