Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CircularArc3d.EndPoint
 Послать отзыв
 Свойство EndPoint представляет конечную точку дуги.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d EndPoint;
Копировать Код
Public ReadOnly Property EndPoint As Point3d
 Возвращает
 Возвращает конечную точку дуги. Тип Point3d.
 Описание
 Свойство EndPoint представляет конечную точку дуги.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.CircularArc3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!