Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Filters.SpatialFilterDefinition.Elevation
 Послать отзыв
 Свойство Elevation возвращает значение возвышения. Совместно с вектором normal эта величина определяет плоскость системы координат ECS, в которой определены точки многоугольника основания.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Elevation;
Копировать Код
Public ReadOnly Property Elevation As Double
 Возвращает
 Возвращает значение возвышения. Тип double.
 Описание
 Свойство Elevation возвращает значение возвышения. Совместно с вектором normal эта величина определяет плоскость системы координат ECS, в которой определены точки многоугольника основания.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Filters.SpatialFilterDefinition, Teigha.DatabaseServices.Filters
 Ваши комментарии по поводу этого топика: Послать отзыв!