Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Graph.IsEmpty
 Послать отзыв
 Свойство позволяет проверить, является ли граф пустым.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsEmpty;
Копировать Код
Public ReadOnly Property IsEmpty As Boolean
 Возвращает
 Возвращает true тогда и только тогда, когда граф является пустым. В противном случае возвращает false.
 Описание
 Свойство позволяет проверить, граф является ли граф пустым.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Graph, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!