Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CellRange.LeftColumn
 Послать отзыв
 Свойство возвращает индекс левого столбца данного диапазона ячеек.
 Синтаксис
C#
Visual Basic
Копировать Код
public int LeftColumn;
Копировать Код
Public ReadOnly Property LeftColumn As Integer
 Возвращает
 Возвращает индекс левого столбца диапазона. Тип int.
 Описание
 Свойство возвращает индекс левого столбца данного диапазона ячеек.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.CellRange, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!