Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FullDwgVersion.GetHashCode
 Послать отзыв
 Метод предназначен для получения хеш-кода данного объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public sealed override int GetHashCode();
Копировать Код
Public NotOverridable Overrides Function GetHashCode() As Integer
 Возвращает
 Возвращает хеш-код объекта. Тип int.
 Описание
 Метод позволяет получить хеш-код данного объекта. Хеш-код представляет собой целочисленное значение, уникальное для любого экземпляра данного класса.
 Ссылки
 Teigha.DatabaseServices.FullDwgVersion, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!