Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.XrefVetoableSubCommandEventArgs.abortOp
 Послать отзыв
 Свойство abortOp позволяет определить, была ли прервана операция.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool abortOp;
Копировать Код
Public Property abortOp As Boolean
 Возвращает
 Возвращает true, если операция прервана. В противном случае возвращает false.
 Описание
 Свойство abortOp позволяет определить, была ли прервана операция.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.XrefVetoableSubCommandEventArgs, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!