Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.SetValue
 Послать отзыв
 Метод позволяет задать значение у первого элемента содержимого ячейки.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetValue( int row, int column, int contentIndex, ref Object value );
Копировать Код
Public virtual Sub SetValue( row As Integer, column As Integer, contentIndex As Integer, ByRef value As Object )
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 contentIndex
 Индекс элемента содержимого ячейки, тип int. Индекс должен быть больше или равен нулю и меньше количества элементов содержимого в ячейке.
 value
 Задаваемое значение, тип Object.
 col
 Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
 Описание
 Метод позволяет задать значение у первого элемента содержимого ячейки.
 Замечания
 Для получения того же результата предпочтительнее использовать метод Table.Cells[row,column].Content[i].Value.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!