Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Point2d.GetDistanceTo
 Послать отзыв
 Метод вычисляет расстояние между этой и указанной точками.
 Синтаксис
C#
Visual Basic
Копировать Код
public double GetDistanceTo( Point2d point );
Копировать Код
Public Function GetDistanceTo( point As Point2d ) As Double
 Параметры
 Параметры
 Описание
 point
 Входная 2D-точка, до которой измеряется расстояние. Тип Point2d.
 Возвращает
 Возвращает расстояние между точками. Тип double.
 Описание
 Метод вычисляет расстояние от этой точки до точки point.
 Ссылки
 Teigha.Geometry.Point2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!