Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Group.SetLayer
 Послать отзыв
 Метод позволяет для всех объектов данной группы задать слой с указанным именем.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetLayer( ref String value );
Копировать Код
Public Sub SetLayer( ByRef value As String )
 Параметры
 Параметры
 Описание
 value
 Имя слоя, назначаемого объектам группы. Тип String.
 Описание
 Метод позволяет для всех объектов данной группы задать слой с указанным именем.
 Ссылки
 Teigha.DatabaseServices.Group, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!