Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocDependency.NextDependencyOnObject
 Послать отзыв
 Свойство возвращает следующую зависимость после данной в списке зависимостей объекта DBObject или ObjectId.Null, если данная зависимость является последней в списке.
 Синтаксис
C#
Visual Basic
Копировать Код
public Teigha.DatabaseServices.ObjectId NextDependencyOnObject;
Копировать Код
Public Property NextDependencyOnObject() As Teigha.DatabaseServices.ObjectId
 Возвращает
 Возвращает идентификатор зависимости. Тип Teigha.DatabaseServices.ObjectId. В случае последней в списке зависимости возвращает ObjectId.Null.
 Описание
 Свойство возвращает следующую зависимость после данной в списке зависимостей объекта DBObject или ObjectId.Null, если данная зависимость является последней в списке.
 Все зависимости, связанные с одним и тем же объектом DBObject, хранятся в двусвязном списке. Порядок следования зависимостей в списке определяется свойством Order этих зависимостей.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.AssocDependency, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!