Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Surface.EvaluatePoint
 Послать отзыв
 Метод вычисляет 3D-точку на данной поверхности, которая соответствует указанной параметрической точке.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d EvaluatePoint( Point2d parameter );
Копировать Код
Public Function EvaluatePoint( parameter As Point2d ) As Point3d
 Параметры
 Параметры
 Описание
 parameter
 Входная точка (U,V) в пространстве параметров поверхности. Тип Point2d.
 Возвращает
 Возвращает 3D-точку, которая соответствует входным значениям параметров (U,V). Тип Point3d.
 Описание
 Метод вычисляет 3D-точку на данной поверхности, которая соответствует указанной параметрической точке.
 Ссылки
 Teigha.Geometry.Surface, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!