Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CurveBoundaryData.!=
 Послать отзыв
 Оператор неравенства структуры CurveBoundaryData.
 Синтаксис
C#
Visual Basic
Копировать Код
public static bool operator !=( CurveBoundaryData a, CurveBoundaryData b );
Копировать Код
Public Shared Operator <>( a As CurveBoundaryData, b As CurveBoundaryData ) As Boolean
 Параметры
 Параметры
 Описание
 a
 Левый операнд. Тип CurveBoundaryData.
 b
 Правый операнд. Тип CurveBoundaryData.
 Возвращает
 Возвращает true, если данные определений границ a и b отличаются. В противном случае возвращает false.
 Описание
 Оператор неравенства структуры CurveBoundaryData.
 Ссылки
 Teigha.Geometry.CurveBoundaryData, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!