Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GeomRef.IsEmpty
 Послать отзыв
 Свойство позволяет проверить, не является ли данный объект пустым, когда он не ссылается ни на какую геометрию.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsEmpty;
Копировать Код
Public Property IsEmpty() As Boolean
 Возвращает
 Возвращает true, если данный объект является пустым. В противном случае возвращает false.
 Описание
 Свойство позволяет проверить, не является ли данный объект пустым, когда он не ссылается ни на какую геометрию.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.GeomRef, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!