Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotSettingsValidator.GetLocaleMediaName
 Послать отзыв
 Метод предоставляет локализованную версию наименования бумажного носителя по его индексу в коллекции канонических имен носителей, возвращаемой методом GetCanonicalMediaNameList().
 Синтаксис
C#
Visual Basic
Копировать Код
public String GetLocaleMediaName( ref PlotSettings plotSet, int index );
Копировать Код
Public Function GetLocaleMediaName( ByRef plotSet As PlotSettings, index As Integer ) As String
 Параметры
 Параметры
 Описание
 plotSet
 Входной объект PlotSettings.
 index
 Входной индекс носителя в коллекции, возвращаемой методом GetCanonicalMediaNameList(). Тип int.
 Возвращает
 Возвращает локализованную версию наименования бумажного носителя. Тип String.
 Описание
 Метод предоставляет локализованную версию наименования бумажного носителя по его индексу в коллекции канонических имен носителей, возвращаемой методом GetCanonicalMediaNameList().
 Ссылки
 Teigha.DatabaseServices.PlotSettingsValidator, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!