Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Trace.Thickness
 Послать отзыв
 Свойство Thickness представляет толщину полосы в единицах чертежа.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Thickness;
Копировать Код
Public Property Thickness As Double
 Возвращает
 Возвращает толщину полосы. Тип double.
 Описание
 Свойство Thickness представляет текущую толщину данной полосы (в единицах чертежа).
 Замечания
 Толщина — это величина выдавливания вдоль направления нормали. Положительная толщина означает выдавливание в направлении нормали, отрицательная толщина определяет выдавливание в противоположном направлении. Нулевое значение определяет полосу без толщины.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Trace, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!