Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeader.ToleranceLocation
 Послать отзыв
 Свойство представляет точку привязки содержимого допуска данной мультивыноски.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d ToleranceLocation;
Копировать Код
Public Property ToleranceLocation As Point3d
 Возвращает
 Возвращает точку привязки допуска. Тип Point3d.
 Описание
 Свойство представляет точку привязки содержимого допуска данной мультивыноски.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MLeader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!