Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocDependency.SetStatus
 Послать отзыв
 Метод устанавливает статус AssocStatus данной зависимости.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetStatus( AssocStatus newStatus, bool notifyOwningNetwork );
Копировать Код
Public Sub SetStatus( newStatus As AssocStatus, notifyOwningNetwork As Boolean )
 Параметры
 Параметры
 Описание
 newStatus
 Новый статус ассоциативной зависимости. Значение из перечисления AssocStatus.
 notifyOwningNetwork
 Флаг необходимости уведомить ассоциативную сеть-владельца. Тип bool. Если аргумент принимает значение true, и переданный статус указывает, что зависимость нуждается в обновлении, объекту AssocAction, как действия-владельца данной зависимости, присваивается тот же статус (если только статус обновления действия уже не является более сильным, чем новый статус). Затем действие AssocAction уведомляет свою ассоциативную сеть-владельца.
 Описание
 Метод устанавливает статус AssocStatus данной зависимости.
 Если статус зависимости указывает, что действию-владельцу зависимости потребуется обновление (т.е. предикат IsEvaluationRequest() для такого статуса возвращает true), метод также может уведомить действие-владельца зависимости о необходимости изменить свой статус в связи с необходимостью перевычисления. Действие может изменить свой статус и далее уведомить свою сеть-владельца. Сеть может изменить свой статус и уведомить свою сеть-владельца и т.д. до тех пор, пока все сети в иерархии не будут уведомлены о том, что содержат действие, которое нуждается в перевычислении.
 Если новый статус удовлетворяет предикату IsEvaluationRequest(), и EvaluationRequestSeverityLevel() нового статуса ниже текущего статуса запроса на обновление зависимости, текущий более высокий статус зависимости сохраняется без изменений и более низким новым статусом не перезаписывается. Кроме того, если текущий статус зависимости удовлетворяет предикату IsToBeSkipped(), он не перезаписывается никаким новым статусом, который удовлетворяет предикату IsEvaluationRequest(). Чтобы в таком случае изменить статус зависимости, его необходимо сначала изменить на IsUpToDateAssocStatus, и уже после этого изменить на статус IsEvaluationRequest().
 Ссылки
 Teigha.DatabaseServices.AssocDependency, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!