Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CellRange.State
 Послать отзыв
 Свойство управляет текущим состоянием ячеек данного диапазона.
 Синтаксис
C#
Visual Basic
Копировать Код
public CellStates? State;
Копировать Код
Public Property State As CellStates?
 Возвращает
 Возвращает состояние ячеек данного диапазона из перечисления CellStates.
 Описание
 Свойство управляет текущим состоянием ячеек данного диапазона.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.CellRange, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!