Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Field.GetFieldCode
 Послать отзыв
 Метод предназначен для получения кода поля в виде строки, сформированной с учетом указанных флагов кодов поля.
 Синтаксис
C#
Visual Basic
Копировать Код
public String GetFieldCode( FieldCodeFlags flags );
Копировать Код
Public Function GetFieldCode( flags As FieldCodeFlags ) As String
 Параметры
 Параметры
 Описание
 flags
 Флаг или набор флагов из перечисления FieldCodeFlags.
 Возвращает
 Возвращает строку с кодом поля. Тип String.
 Описание
 Метод предназначен для получения кода поля в виде строки, сформированной с учетом указанных флагов кодов поля из перечисления FieldCodeFlags.
 Ссылки
 Teigha.DatabaseServices.Field, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!