Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GripDataCollection.GripDataCollection
 Послать отзыв
 Конструктор по умолчанию класса GripDataCollection.
 Синтаксис
C#
Visual Basic
Копировать Код
public GripDataCollection();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса GripDataCollection.
 Ссылки
 Teigha.DatabaseServices.GripDataCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!