Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.Format
 Послать отзыв
 Метод предназначен для получения формата ячеек в строке указанного типа.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual String Format( RowType type );
Копировать Код
Public virtual Function Format( type As RowType ) As String
 Параметры
 Параметры
 Описание
 type
 Тип строки из перечисления RowType.
 Возвращает
 Возвращает строку, тип String.
 Описание
 Метод предназначен для получения формата ячеек в строке указанного типа.
 Замечания
 Метод не реализован. Используйте метод Table.Cells[row,column].DataFormat.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!