Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Cylinder.IntersectWith
 Послать отзыв
 Метод вычисляет точки пересечения данного цилиндра с указанным линейным объектом, используя указанную геометрическую точность.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d[] IntersectWith( ref LinearEntity3d linearEntity, Tolerance tolerance );
Копировать Код
Public Function IntersectWith( ByRef linearEntity As LinearEntity3d, tolerance As Tolerance ) As Point3d()
 Параметры
 Параметры
 Описание
 linearEntity
 Входной линейный объект, точки пересечения с которым требуется вычислить. Тип LinearEntity3d.
 tolerance
 Заданная геометрическая точность вычисления пересечений. Тип Tolerance.
 Возвращает
 Возвращает массив, состоящий ровно из двух элементов, которые соответствуют, соответственно, первой и второй точкам пересечения (если они существуют). Тип Point3d[].
 Описание
 Метод вычисляет точки пересечения данного цилиндра с указанным линейным объектом, используя указанную геометрическую точность. Найденные точки возвращаются в виде массива.
 Замечания
 В случае отсутствия точек пересечения или при возникновении ошибки метод возвращает null.
 Ссылки
 Teigha.Geometry.Cylinder, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!