Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.IdMapping.Change
 Послать отзыв
 Метод заменяет существующий в данном IdMapping объект IdPair новым объектом IdPair с тем же ключом.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Change( IdPair pairToChange );
Копировать Код
Public Sub Change( pairToChange As IdPair )
 Параметры
 Параметры
 Описание
 pairToChange
 Аргумент предоставляет ключ для поиска и принимает значение. Тип IdPair.
 Описание
 Метод реализует замену существующего в данном IdMapping объекта IdPair новым объектом IdPair с тем же ключом. Ключ для поиска предоставляет аргумент pairToChange. В случае успеха найденный объект заменяется на объект pairToChange.
 Ссылки
 Teigha.DatabaseServices.IdMapping, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!