Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 DimStyleTableRecord.Dimblk2
 Послать отзыв
 Свойство связано со значением свойства Dimblk2s и хранит настройку внешнего вида второго окончания размерной линии в виде ObjectId блока окончания.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectId Dimblk2 { get; set; }
Копировать Код
Public Property Dimblk2 As ObjectId
 Возвращает
 Возвращает тип данных ObjectId.
 Описание
 В свойстве хранится настройка внешнего вида второго окончания линейного размера в формате ObjectId. Свойство связано со значением свойства Dimblk2s. Оба свойства хранят настройку вида второго окончания размерной линии: Dimblk2s хранит название, Dimblk2 хранит ObjectId этого окончания.
 Каждый вид окончания является блоком и в чертеже хранится, как тип данных BlockTableRecord в таблице блоков BlockTable.
 Коллекция блоков - окончаний размерных линий хранится в шаблоне чертежа и через API недоступна. Отдельные блоки из этой коллекции появляются в таблице блоков чертежа после того, как к ним обратились через свойство Dimblks/Dimblk1s/Dimblk2s или через пользовательский интерфейс:
  При изменении системной переменной DIMBLK2 будет создан новый размерный стиль под названием <переопределение> на основе текущего с новым значением DIMBLK2.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.DimStyleTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!