Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Field.GetChildren
 Послать отзыв
 Метод позволяет получить дочерние поля данного объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public Field[] GetChildren();
Копировать Код
Public Function GetChildren() As Field()
 Возвращает
 Возвращает массив дочерних полей данного объекта. Тип Field[].
 Описание
 Метод позволяет получить дочерние поля данного объекта. Если данный объект является текстовым полем, дочерними являются поля, внедренные в текст. Если данный объект не является текстовым полем, дочерние поля представляют собой вложенные поля.
 Замечания
 Возвращаемый объект поля открывается в предписанном режиме, если это поле является резидентным в базе данных. За закрытие объекта поля после его использования отвечает вызывающее приложение.
 Ссылки
 Teigha.DatabaseServices.Field, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!