Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SubDMesh.SetCrease
 Послать отзыв
 Метод предназначен для заострения ребер сети.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetCrease( double creaseVal );
Копировать Код
Public Sub SetCrease( creaseVal As double )
 Параметры
 Параметры
 Описание
 creaseVal
 Условие применения заострения, double.
Допустимые значения аргумента creaseVal:
 Описание
 Метод предназначен для заострения ребер сети.
 Ссылки
 Teigha.DatabaseServices.SubDMesh, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!