Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Point3d.IsEqualTo
 Послать отзыв
 Метод проверяет совпадение точек в пределах указанного допуска.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsEqualTo( Point3d point, Tolerance tolerance );
Копировать Код
Public Function IsEqualTo( point As Point3d, tolerance As Tolerance ) As Boolean
 Параметры
 Параметры
 Описание
 point
 Точка, с которой проверяется совпадение. Тип Point3d.
 tolerance
 Допуск. Тип Tolerance.
 Возвращает
 Возвращает true, если расстояние между точками не превышает значение Tolerance.EqualPoint(). В противном случае возвращает false.
 Описание
 Метод позволяет установить, что расстояние между данной точкой и точкой point не превышает значение Tolerance.EqualPoint(). Возвращает true, если условие выполнено. В противном случае возвращает false.
 Ссылки
 Teigha.Geometry.Point3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!