Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MlineStyle.Name
 Послать отзыв
 Свойство представляет наименование данного стиля.
 Синтаксис
C#
Visual Basic
Копировать Код
public String Name;
Копировать Код
Public Property Name As String
 Возвращает
 Возвращает наименование данного стиля. Тип String.
 Описание
 Свойство представляет наименование данного стиля.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MlineStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!