Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Solid3d.Slice
 Послать отзыв
 Метод позволяет разрезать плоскостью данное твердое тело и преобразовать его в ту часть, которая осталась с "положительной" стороны от режущей плоскости.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void Slice( ref Plane plane );
Копировать Код
Public Overridable Sub Slice( ByRef plane As Plane )
 Параметры
 Параметры
 Описание
 plane
 Режущая плоскость. Тип Plane.
 Описание
 Метод позволяет разрезать плоскостью данное твердое тело и преобразовать его в ту часть, которая осталась с "положительной" стороны от режущей плоскости.
 Этот метод реализован только в среде пространственного моделирования.
 Ссылки
 Teigha.DatabaseServices.Solid3d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!