Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DynamicDimensionData.Dimension
 Послать отзыв
 Свойство Dimension обеспечивает доступ объекту Dimension этого динамического размера.
 Синтаксис
C#
Visual Basic
Копировать Код
public Dimension Dimension;
Копировать Код
Public Property Dimension As Dimension
 Возвращает
 Возвращает объект размера. Тип Dimension.
 Описание
 Свойство Dimension обеспечивает доступ на изменение к объекту Dimension этого динамического размера.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.DynamicDimensionData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!