Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotSettingsValidator.GetPlotStyleSheetList
 Послать отзыв
 Метод предоставляет коллекцию всех доступных таблиц стилей печати.
 Синтаксис
C#
Visual Basic
Копировать Код
public StringCollection GetPlotStyleSheetList();
Копировать Код
Public Function GetPlotStyleSheetList() As StringCollection
 Возвращает
 Возвращает коллекцию всех доступных таблиц стилей печати. Тип StringCollection.
 Описание
 Метод предоставляет коллекцию всех доступных таблиц стилей печати. Эта коллекция в пределах сеанса nanoCAD создается лишь один раз, поэтому в случае каких-либо изменений в таблицах стилей печати вам следует предусмотреть принудительное обновление коллекции.
 Замечания
 Если какие-либо устройства печати, файлы PC3 или таблицы стилей печати изменяются после запуска приложения, то перед использованием других методов этого класса следует вызвать метод RefreshLists(), чтобы обновить списки стилей и устройств вывода.
 Ссылки
 Teigha.DatabaseServices.PlotSettingsValidator, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!