Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.OffsetSurface.Set
 Послать отзыв
 Метод позволяет переопределить у данной кривой базовую поверхность и значение смещения.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Set( ref Surface surface, double offsetDistance );
Копировать Код
Public Sub Set( ByRef surface As Surface, offsetDistance As Double )
 Параметры
 Параметры
 Описание
 surface
 Входная базовая поверхность. Тип Surface.
 offsetDistance
 Величина смещения (со знаком). Тип double.
 Описание
 Метод позволяет переопределить у данной кривой базовую поверхность и значение смещения.
 Ссылки
 Teigha.Geometry.OffsetSurface, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!