Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Extents3d.IsEqualTo
 Послать отзыв
 Метод позволяет сравнить данный объект с указанным объектом Extents3d.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsEqualTo( Extents3d a );
Копировать Код
Public Function IsEqualTo( a As Extents3d ) As Boolean
 Параметры
 Параметры
 Описание
 a
 Проверяемый объект. Тип Extents3d.
 Возвращает
 Возвращает true, если минимальные и максимальные точки сравниваемых объектов совпадают. В противном случае возвращает false.
 Описание
 Метод позволяет сравнить данный объект с указанным объектом Extents3d.
 Ссылки
 Teigha.DatabaseServices.Extents3d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!