Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObject.IsErased
 Послать отзыв
 Свойство предоставляет информацию, был очищен ли объект.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsErased;
Копировать Код
Public Property IsErased() As bool
 Возвращает
 Возвращает тип данных bool. Возвращает true, если объект, ассоциированный с данным, очищен.
 Описание
 Свойство предоставляет информацию, был очищен ли объект.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.DBObject, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!