Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve2d.GetParameterAtLength
 Послать отзыв
 Метод находит значение параметра для точки на кривой, длина вдоль кривой до которой от заданной точки с указанной точностью равна заданному значению.
 Синтаксис
C#
Visual Basic
Копировать Код
public double GetParameterAtLength( double datumParameter, double length, bool parameterDirection, Tolerance tolerance );
Копировать Код
Public Function GetParameterAtLength( datumParameter As Double, length As Double, parameterDirection As Boolean, tolerance As Tolerance ) As Double
 Параметры
 Параметры
 Описание
 datumParameter
 Входное значение параметра для точки отсчета длины. Тип double.
 length
 Входная длина вдоль кривой. Тип double.
 parameterDirection
 Направление изменения параметра. Тип bool.
 tolerance
 Заданная точность вычисления длины. Тип Tolerance.
 Возвращает
 Возвращает значение параметра для искомой точки на кривой. Тип double.
 Описание
 Метод находит значение параметра для точки на кривой, длина вдоль кривой до которой от заданной точки с указанной точностью равна заданному значению. Положение на кривой точки отсчета длины задается входным параметром datumParameter. Направление вдоль кривой указывается входным флагом parameterDirection.
 Ссылки
 Teigha.Geometry.Curve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!