Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Scale3d.IsProportional
 Послать отзыв
 Метод позволяет проверить, действительно ли данный объект представляет равномерное масштабирование по осям X, Y и Z. При проверке используется точность по умолчанию.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsProportional();
Копировать Код
Public Function IsProportional() As Boolean
 Возвращает
 Возвращает true, если компоненты данного вектора масштабирования по модулю равны. В противном случае возвращает false.
 Описание
 Метод позволяет проверить, действительно ли данный объект представляет равномерное масштабирование по осям X, Y и Z. Используется вызов метода Scale3d.IsProportional(Tolerance tolerance) с точностью по умолчанию, равной Tolerance.Global.
 Ссылки
 Teigha.Geometry.Scale3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!