Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Tdindwg
 Послать отзыв
 Синтаксис
C#
Visual Basic
public TimeSpan Tdindwg;
Public Property Tdindwg() As TimeSpan
 Описание
 Обеспечивает доступ к текущему значению TDINDWG для базы данных.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!