Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.SetBlockTableRecordId
 Послать отзыв
 Метод позволяет задать ObjectId записи табличного блока в указанной ячейке таблицы.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetBlockTableRecordId( int row, int col, DatabaseServices.ObjectId blockId, bool autoFit );
Копировать Код
Public virtual Sub SetBlockTableRecordId( row As Integer, col As Integer, blockId As DatabaseServices.ObjectId, autoFit As Boolean )
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 col
 Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
 blockId
 ObjectId записи табличного блока. Тип DatabaseServices.ObjectId.
 autoFit
 Флаг, указывающий, следует ли автоматически масштабировать вхождение блока в ячейке. Тип bool.
 Описание
 Метод позволяет задать ObjectId записи табличного блока в указанной ячейке таблицы.
 Замечания
 Для получения того же результата предпочтительнее использовать Table.Cells[row,column].Contents[i].BlockTableRecordId.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!