Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ShadePlotType
 Послать отзыв
 Данное перечисление определяет типы отображения теней в текущем видовом экране при выводе на печать.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum ShadePlotType { AsDisplayed = 0, Wireframe = 1, Hidden = 2, Rendered = 3, VisualStyle = 4, RenderPreset = 5 }
Копировать Код
Public Enum ShadePlotType AsDisplayed = 0 Wireframe = 1 Hidden = 2 Rendered = 3 VisualStyle = 4 RenderPreset = 5 End Enum
 Члены
 Члены
 Описание
 AsDisplayed
 Значение: 0. Отображение при выводе на печать как на экране.
 Wireframe
 Значение: 1. Выводить на печать каркас независимо от режима отображения на экране.
 Hidden
 Значение: 2. Выводить на печать скрытые элементы независимо от режима отображения на экране.
 Rendered
 Значение: 3. Выводить на печать результат рендеринга вне зависимости от режима отображения на экране.
 VisualStyle
 Значение: 4. Вывод на печать с использованием визуального стиля, на который указывает идентификатор режима тонирования ShadePlotId.
 RenderPreset
 Значение: 5. Вывод на печать с использованием готовых настроек рендеринга, на которые ссылается идентификатор режима тонирования ShadePlotId.
 Описание
 Данное перечисление определяет типы отображения теней в текущем видовом экране при выводе на печать.
 Ваши комментарии по поводу этого топика: Послать отзыв!