Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.BlockConnectionType
 Послать отзыв
 Данное перечисление определяет варианты точек присоединения выносной линии к блоку.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum BlockConnectionType { ConnectBase = 1, ConnectExtents = 0 }
Копировать Код
Public Enum BlockConnectionType ConnectBase = 1 ConnectExtents = 0 End Enum
 Члены
 Члены
 Описание
 ConnectExtents
 Значение: 0. Точка присоединения к блоку располагается на габаритной границе блока (extents).
 ConnectBase
 Значение: 1. В качестве точки присоединения используется базовая точка блока.
 Описание
 Данное перечисление определяет варианты точек присоединения выносной линии к блоку.
 Ваши комментарии по поводу этого топика: Послать отзыв!