Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBVisualStyle.SetTrait
 Послать отзыв
 Метод позволяет задать значения RGB в свойствах визуального стиля.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetTrait( VisualStyleProperty vsProp, double red, double green, double blue, VisualStyleOperation vsOp );
Копировать Код
Public Sub SetTrait( vsProp As VisualStyleProperty, red As Double, green As Double, blue As Double, vsOp As VisualStyleOperation )
 Параметры
 Параметры
 Описание
 vsProp
 Свойство визуального стиля, которое необходимо установить. Значение из перечисления VisualStyleProperty.
 red
 Красная компонента цвета.Тип double.
 green
 Зеленая компонента цвета.Тип double.
 blue
 Синяя компонента цвета. Тип double.
 vsOp
 Операция, используемая для установки свойства. Значение из перечисления VisualStyleOperation.
 Описание
 Метод позволяет задать значения RGB в свойствах визуального стиля.
 Ссылки
 Teigha.DatabaseServices.DBVisualStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!