Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DbDictionaryEnumerator.Entry
 Послать отзыв
 Свойство обеспечивает доступ к записи коллекции, на которую указывает свойство Entry перечислителя.
 Синтаксис
C#
Visual Basic
Копировать Код
public DBDictionaryEntry Entry;
Копировать Код
Public Property Entry() As DBDictionaryEntry
 Возвращает
 Возвращает запись коллекции, указанную в свойстве Entry. Тип DBDictionaryEntry.
 Описание
 Свойство обеспечивает доступ к записи коллекции, на которую указывает свойство Entry перечислителя.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.DbDictionaryEnumerator, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!