Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Surface.BooleanUnion
 Послать отзыв
 Метод предназначен для выполнения операции логического объединения данной поверхности с другой поверхностью.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual Surface BooleanUnion( ref Surface surface2 );
Копировать Код
Public Overridable Function BooleanUnion( ByRef surface2 As Surface ) As Surface
 Параметры
 Параметры
 Описание
 surface2
 Поверхность, которая объединяется с данной поверхностью. Тип Surface.
 Возвращает
 Возвращает поверхность, являющуюся результатом логического объединения двух поверхностей. Тип Surface.
 Описание
 Метод реализует операцию логического объединения данной поверхности с другой поверхностью.
 Если данная поверхность не является производной от класса Surface или обе поверхности являются компланарными объектами PlaneSurface, результат сохраняется в данной поверхности. В противном случае данная поверхность не изменяется, а метод возвращает результирующую поверхность.
 Если результирующая поверхность пуста (т.е. пусты обе поверхности), метод выбрасывает исключение eNoIntersections, возвращает NULL и данная поверхность оставляется без изменений. Если операция объединения не удалась, метод возвращает NULL и данная поверхность оставляется без изменений.
 Замечания
 Данный метод реализован только в ModelerGeometry и в среде пространственного моделирования Spatial Modeler.
 Ссылки
 Teigha.DatabaseServices.Surface, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!