Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 DimStyleTableRecord.Dimaltd
 Послать отзыв
 Свойство предназначено для настройки количества десятичных знаков в альтернативных измерениях в размерах.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual int Dimaltd { get; set; }
Копировать Код
Public Overridable Property Dimaltd As Integer
 Возвращает
 Возвращает тип данных int.
 Описание
 В свойстве хранится настройка количества десятичных знаков в альтернативных измерениях в размерах. Доступно от 0 до 8 десятичных знаков. Значение по умолчанию 2.
 Свойство также доступно через системную переменную DIMALTD и пользовательское меню в окне изменения/создания размерного стиля:
  При изменении системной переменной DIMALTD будет создан новый размерный стиль под названием <переопределение> на основе текущего с новым значением DIMALTD.
 Условия
 Чтение и запись.
 Пример
 Пример изменения количества десятичных знаков в альтернативных измерениях в размерах (значения свойства Dimaltd) в размерном стиле Standard:
C#
 Копировать Код
public partial class Commands { [Teigha.Runtime.CommandMethod("DimaltdChange")] public void DimaltdStandardDimStyle() { // Получение ссылки на активный документ HostMgd.ApplicationServices.Document doc = HostMgd.ApplicationServices.Application.DocumentManager.MdiActiveDocument; // Получение ссылки на редактор документа HostMgd.EditorInput.Editor ed = doc.Editor; // Получение ссылки на базу данных документа Teigha.DatabaseServices.Database db = doc.Database; // Начало транзакции с базой данных документа using (Teigha.DatabaseServices.Transaction trans = db.TransactionManager.StartTransaction()) { // Открываем таблицу размерных стилей для чтения Teigha.DatabaseServices.DimStyleTable dimStyleTable = trans.GetObject(db.DimStyleTableId, Teigha.DatabaseServices.OpenMode.ForRead) as Teigha.DatabaseServices.DimStyleTable; // Находим в таблице размерных стилей ObjectId нужного стиля по его названию Teigha.DatabaseServices.ObjectId styleId = dimStyleTable["Standard"]; // Открываем таблицу размерного стиля для изменений Teigha.DatabaseServices.DimStyleTableRecord obj = trans.GetObject(styleId, Teigha.DatabaseServices.OpenMode.ForWrite) as Teigha.DatabaseServices.DimStyleTableRecord; ed.WriteMessage($"nDimaltd before: {obj.Dimaltd}"); // Проверка, включено ли отображение альтернативных измерений if (obj.Dimalt == false) obj.Dimalt = true; // Проверка формата отображения альтернативных измерений // Нам нужен десятичный формат, т.е. Dimaltu = 2 if(obj.Dimaltu!=2) obj.Dimaltu = 2; // Изменяем количество знаков после запятой obj.Dimaltd = 1; ed.WriteMessage($"nDimaltd after: {obj.Dimaltd}"); trans.Commit(); } } }
 Результат работы команды DimaltdChange:
 Было:
 Стало:
 Ссылки
 Teigha.DatabaseServices.DimStyleTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!