Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocArrayPolarParameters.SetStartAngle
 Послать отзыв
 Метод позволяет установить новый начальный угол кругового массива.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetStartAngle( double val, ref String expression, ref String evaluatorId );
Копировать Код
Public Sub SetStartAngle( val As Double, ByRef expression As String, ByRef evaluatorId As String )
 Параметры
 Параметры
 Описание
 val
 Новое значение начального угла кругового массива. Указывается в радианах. Тип double.
 expression
 Выражение для параметра. Тип String. Строка может быть пустой.
 evaluatorId
 Строковое представление идентификатора вычислителя. Тип String. Строка может быть пустой.
 Описание
 Метод позволяет установить новый начальный угол кругового массива. Значение указывается в радианах.
 Если для параметра выражение отсутствует, строки expression и evaluatorId должны быть пустыми.
 Ссылки
 Teigha.DatabaseServices.AssocArrayPolarParameters, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!