Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.ExternalBoundedSurface.ExternalSurfaceKind
 Послать отзыв
 Свойство ExternalSurfaceKind представляет информацию о системе, в которой было создано определение внешней ограниченной поверхности.
 Синтаксис
C#
Visual Basic
Копировать Код
public Geometry.ExternalEntityKind ExternalSurfaceKind;
Копировать Код
Public ReadOnly Property ExternalSurfaceKind As Geometry.ExternalEntityKind
 Возвращает
 Возвращает информацию о системе, в которой было создано определение данного объекта. Тип Geometry.ExternalEntityKind.
 Описание
 Свойство ExternalSurfaceKind представляет информацию о системе, в которой было создано определение внешней ограниченной поверхности.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.ExternalBoundedSurface, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!