Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DataTypeParameter.==
 Послать отзыв
 Оператор равенства для структуры DataTypeParameter.
 Синтаксис
C#
Visual Basic
Копировать Код
public static bool operator ==( DataTypeParameter t1, DataTypeParameter t2 );
Копировать Код
Public Shared Operator =( t1 As DataTypeParameter, t2 As DataTypeParameter ) As Boolean
 Параметры
 Параметры
 Описание
 t1
 Левый операнд. Тип DataTypeParameter.
 t2
 Правый операнд. Тип DataTypeParameter.
 Возвращает
 Возвращает true, если оба операнда не равны null и совместно выполняется следующие условия:
Типы данных равны.
Типы единиц измерения равны.
 В противном случае возвращает false. Тип bool.
 Описание
 Оператор равенства для структуры DataTypeParameter. Проверяет факт равенства двух экземпляров структуры.
 Ссылки
 Teigha.DatabaseServices.DataTypeParameter, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!