Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.RenderEnvironment
 Послать отзыв
 Класс RenderEnvironment представляет собой класс-контейнер для свойств, связанных с окружающей средой, таких как туман или общее изображение окружающей среды.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::GraphicsInterface::Drawable Teigha::DatabaseServices::DBObject Teigha::DatabaseServices::RenderEnvironment
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("AcDbRenderEnvironment")] public class RenderEnvironment : DBObject
Копировать Код
<Wrapper("AcDbRenderEnvironment")> Public Class RenderEnvironment Inherits DBObject
 Описание
 Класс RenderEnvironment представляет собой класс-контейнер для свойств, связанных с окружающей средой, таких как туман или общее изображение окружающей среды.
 Методы
 Конструкторы
 Teigha.GraphicsInterface.Drawable
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 Drawable
 Конструктор класса Teigha.GraphicsInterface.Drawable. (Унаследован от Drawable)
 Teigha.DatabaseServices.DBObject
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 DBObject
 Конструктор. (Унаследован от DBObject)
 Teigha.DatabaseServices.RenderEnvironment
 Имя
 Описание
 RenderEnvironment
 Конструктор по умолчанию класса RenderEnvironment.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.GraphicsInterface.Drawable
 Имя
 Описание
 Drawable Методы
 Ниже перечислены методы класса Drawable.
 Drawable Свойства
 Ниже перечислены свойства класса Drawable.
 Teigha.DatabaseServices.DBObject
 Имя
 Описание
 DBObject Методы
 Ниже перечислены методы класса DBObject.
 DBObject Свойства
 Ниже перечислены свойства класса DBObject.
 DBObject События
 Ниже перечислены события класса DBObject.
 Teigha.DatabaseServices.RenderEnvironment
 Имя
 Описание
 RenderEnvironment Классы
 Ниже перечислены классы класса RenderEnvironment.
 RenderEnvironment Свойства
 Ниже перечислены свойства класса RenderEnvironment.
 Ссылки
 RenderEnvironment Классы, RenderEnvironment Свойства, Методы, Топики, RenderEnvironment Классы, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства, DBObject События
 Ваши комментарии по поводу этого топика: Послать отзыв!