Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbCurve3d.MakeClosed
 Послать отзыв
 Метод позволяет сделать данную кривую замкнутой, если она еще не замкнута.
 Синтаксис
C#
Visual Basic
Копировать Код
public void MakeClosed();
Копировать Код
Public Sub MakeClosed()
 Описание
 Метод позволяет сделать данную кривую замкнутой, если она еще незамкнутая. Если кривая уже является замкнутой, метод не делает ничего. Замкнутый сплайн получается путем создания плавного сплайна между последней и первой точками с последующим присоединением полученной кривой к исходному сплайну.
 Ссылки
 Teigha.Geometry.NurbCurve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!