Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve2dCollection
 Послать отзыв
 Класс Curve2dCollection представляет коллекцию объектов Curve2d.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Geometry::Curve2dCollection
 Синтаксис
C#
Visual Basic
Копировать Код
[DefaultMember("Item")] public sealed class Curve2dCollection : DisposableWrapper, IList
Копировать Код
<DefaultMember("Item")> Public NotInheritable Class Curve2dCollection Inherits DisposableWrapper Implements IList
 Описание
 Класс Curve2dCollection представляет коллекцию объектов Curve2d.
 Методы
 Конструкторы
 Teigha.Geometry.Curve2dCollection
 Имя
 Описание
 Curve2dCollection
 Конструктор по умолчанию класса Curve2dCollection.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Geometry.Curve2dCollection
 Имя
 Описание
 Curve2dCollection Методы
 Ниже перечислены методы класса Curve2dCollection.
 Curve2dCollection Свойства
 Ниже перечислены свойства класса Curve2dCollection.
 Ссылки
 Curve2dCollection Методы, Curve2dCollection Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!