Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Torus.Torus
 Послать отзыв
 Конструктор по умолчанию класса Torus. Создает действительный тор по умолчанию.
 Синтаксис
C#
Visual Basic
Копировать Код
public Torus();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса Torus.
 Создает тор по умолчанию со следующими свойствами:
minorRadius = 0.5.
Начальный угол для параметра U = -PI.
Конечный угол для параметра U = PI.
Начальный угол для параметра V = -PI.
Конечный угол для параметра V = PI.
 Ссылки
 Teigha.Geometry.Torus, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!