Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotSettings.StdScaleType
 Послать отзыв
 Свойство StdScaleType представляет стандартный тип масштаба для этого объекта PlotSettings.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.StdScaleType StdScaleType;
Копировать Код
Public ReadOnly Property StdScaleType As DatabaseServices.StdScaleType
 Возвращает
 Возвращает стандартный тип масштаба. Значение из перечисления DatabaseServices.StdScaleType.
 Описание
 Свойство StdScaleType представляет стандартный тип масштаба для этого объекта PlotSettings как значение перечислимого типа StdScaleType.
 Это перечисление отражает желаемый масштаб при печати, который платформа использует вместе с другой информацией, такой как размеры области печати, для вычисления значения CustomPrintScale, когда свойство UseStandardScale имеет значение true.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.PlotSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!