Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GripOverrule
 Послать отзыв
 Данный класс предоставляет методы переопределения ручек объекта.
 Иерархия классов
Teigha::DatabaseServices::GripOverrule
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdDbGripOverrule")] public class GripOverrule : Overrule;
Копировать Код
<Wrapper("OdDbGripOverrule")> Public Class GripOverrule Inherits Overrule
 Описание
 Данный класс переопределяет подмножество специфических для данного объекта операций, связанных с ручками. Используется как базовый класс для настройки поведения классов-наследников класса Entity.
 Топики
 Имя
 Описание
 GripOverrule Методы
 Ниже перечислены методы класса GripOverrule.
 Ссылки
 GripOverrule Методы, Топики, GripOverrule Методы
 Ваши комментарии по поводу этого топика: Послать отзыв!