Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DynamicDimensionData.DynamicDimensionData
 Послать отзыв
 Конструктор класса DynamicDimensionData. Создает динамический размер на основе данных указанного объекта Dimension.
 Синтаксис
C#
Visual Basic
Копировать Код
public DynamicDimensionData( ref Dimension dimension );
Копировать Код
Public Sub New( ByRef dimension As Dimension )
 Параметры
 Параметры
 Описание
 dimension
 Входной размер, на основе которого создается динамический размер. Тип Dimension.
 Описание
 Конструктор класса DynamicDimensionData. Создает динамический размер на основе данных указанного объекта Dimension.
 Ссылки
 Teigha.DatabaseServices.DynamicDimensionData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!