Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Polyline3d.Polyline3d
 Послать отзыв
 Конструктор. Создает новую полилинию с типом из перечисления Poly3dType, проходящую по заданным вершинам и, если необходимо, то замкнутую.
 Синтаксис
C#
Visual Basic
Копировать Код
public Polyline3d( Poly3dType type, ref Point3dCollection vertices, bool closed );
Копировать Код
Public Sub New( type As Poly3dType, ByRef vertices As Point3dCollection, closed As Boolean )
 Параметры
 Параметры
 Описание
 type
 Тип создаваемой полилинии из перечисления Poly3dType.
 vertices
 Коллекция точек Point3d для вершин полилинии. Тип Point3dCollection
 closed
 логический флаг замкнутости полилинии. True, если замкнута, и false в противном случае.
 Возвращает
 Возвращает новый экземпляр класса Polyline3d.
 Описание
 Конструктор. Создает новую полилинию с типом из перечисления Poly3dType, проходящую по заданным вершинам и, если необходимо, то замкнутую.
 Ссылки
 Teigha.DatabaseServices.Polyline3d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!