Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SweepOptions.EndDraftDist
 Послать отзыв
 Свойство EndDraftDist представляет расстояние, на котором сужение/расширение вытягиваемого объекта прекращается.
 Синтаксис
C#
Visual Basic
Копировать Код
public double EndDraftDist;
Копировать Код
Public ReadOnly Property EndDraftDist As Double
 Возвращает
 Возвращает расстояние, на котором сужение/расширение прекращается. Тип double.
 Описание
 Свойство EndDraftDist представляет расстояние, на котором сужение/расширение вытягиваемого объекта прекращается.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.SweepOptions, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!