Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.Dimtp
 Послать отзыв
 Свойство позволяет включить режим отображения верхнего предельного отклонения размера.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Dimtp;
Копировать Код
Public Property Dimtp As Double
 Возвращает
 Возвращает верхнее предельное отклонение. Тип double.
 Описание
 Свойство позволяет установить верхнее предельное отклонение размера. Это свойство действует только в том случае, если отображение допусков включено (т.е. свойство Dimtol имеет значение true).
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!