Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.PointOnCurve3d.GetDerivative
 Послать отзыв
 Метод вычисляет первую или вторую производную кривой в данной точке на кривой.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d GetDerivative( int order );
Копировать Код
Public Function GetDerivative( order As Integer ) As Vector3d
 Параметры
 Параметры
 Описание
 order
 Порядок вычисляемой производной. Тип int. Допустимые значения 1 или 2.
 Возвращает
 Возвращает вектор производной. Тип Vector3d.
 Описание
 Метод вычисляет первую или вторую производную кривой в данной точке на кривой.
 Ссылки
 Teigha.Geometry.PointOnCurve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!