Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Curve.GetParameterAtPoint
 Послать отзыв
 Метод вычисляет параметр кривой для заданной точки.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual double GetParameterAtPoint( Point3d point );
Копировать Код
Public virtual Function GetParameterAtPoint( point As Point3d ) As double
 Параметры
 Параметры
 Описание
 point
 Точка Point3d на кривой (в мировой системе координат WCS), для которой требуется определить значение параметра.
 Возвращает
 Возвращает параметр кривой для заданной точки point в виде значения типа double.
 Описание
 Метод GetParameterAtPoint вычисляет параметр кривой для заданной точки Point3d.
 Ссылки
 Teigha.DatabaseServices.Curve, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!