Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство RasterImage.ImageDefId
 Послать отзыв
 Синтаксис
C#
Visual Basic
public DatabaseServices::ObjectId ImageDefId;
Public Property ImageDefId() As DatabaseServices.ObjectId
 Описание
 Обеспечивает доступ к Id изображения для определения изображения геометрического объекта.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.RasterImage, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!