Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Surface.ConvertToRegion
 Послать отзыв
 Метод позволяет для каждой грани данной поверхности создать объект области Region.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual Entity[] ConvertToRegion();
Копировать Код
Public Overridable Function ConvertToRegion() As Entity()
 Возвращает
 Возвращает массив объектов Region, созданных на основе граней данной поверхности. Тип Entity[].
 Описание
 Метод позволяет для каждой грани данной поверхности создать объект области Region. Исходная поверхность должна быть плоской.
 Замечания
 Этот метод реализован только в среде пространственного моделирования.
 Ссылки
 Teigha.DatabaseServices.Surface, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!