Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.ClipBoundary2dData
 Послать отзыв
 Структура ClipBoundary2dData представляет данные, используемые классом ClipBoundary2d.
 Иерархия классов
Teigha::Geometry::ClipBoundary2dData
 Синтаксис
C#
Visual Basic
Копировать Код
public struct ClipBoundary2dData
Копировать Код
Public Structure ClipBoundary2dData
 Описание
 Структура ClipBoundary2dData представляет данные, используемые классом ClipBoundary2d.
 Топики
 Имя
 Описание
 ClipBoundary2dData Методы
 Ниже перечислены методы класса ClipBoundary2dData.
 ClipBoundary2dData Операторы
 Ниже перечислены операторы класса ClipBoundary2dData.
 ClipBoundary2dData Свойства
 Ниже перечислены свойства класса ClipBoundary2dData.
 Ссылки
 ClipBoundary2dData Методы, ClipBoundary2dData Операторы, ClipBoundary2dData Свойства, Топики, ClipBoundary2dData Методы, ClipBoundary2dData Операторы, ClipBoundary2dData Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!