Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Field.Evaluate
 Послать отзыв
 Метод предназначен для вычисления выражения в поле.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Evaluate();
Копировать Код
Public Sub Evaluate()
 Описание
 Метод предназначен для вычисления выражения в поле.
 Ссылки
 Teigha.DatabaseServices.Field, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!