Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Solid3d.CreateFrom
 Послать отзыв
 Метод предназначен для создания трехмерного твердого тела из указанного геометрического объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void CreateFrom( ref Entity fromEntity );
Копировать Код
Public Overridable Sub CreateFrom( ByRef fromEntity As Entity )
 Параметры
 Параметры
 Описание
 fromEntity
 Входной объект, из которого создается твердое тело. Тип Entity.
 Описание
 Метод предназначен для создания трехмерного твердого тела из указанного геометрического объекта.
 В качестве исходных могут использоваться следующие объекты:
Поверхность Surface,
Сеть SubDMesh,
Замкнутая кривая с ненулевой толщиной,
Твердое тело ненулевой толщины,
След (trace) ненулевой толщины,
Полилиния с постоянной шириной и толщиной.
 Этот метод реализован только в среде пространственного моделирования.
 Ссылки
 Teigha.DatabaseServices.Solid3d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!