Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ObjectOverrule.WblockClone
 Послать отзыв
 Данный метод вызывает соответствующий метод OdDbObjectOverrule.WblockClone().
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual DBObject WblockClone( ref DBObject dbObject, ref RXObject ownerObject, ref IdMapping idMap, bool isPrimary );
Копировать Код
Public virtual Function WblockClone( ByRef dbObject As DBObject, ByRef ownerObject As RXObject, ByRef idMap As IdMapping, isPrimary As Boolean ) As DBObject
 Параметры
 Параметры
 Описание
 dbObject
 Объект DBObject базы данных, к которому применяется переопределение.
 ownerObject
 Объект RXObject базы данных, для которого клоны станут дочерними объектами.
 idMap
 Текущий идентификатор мэппинга IdMapping.
 isPrimary
 Флаг, определяющий, является ли данный объект первичным или дочерним. Тип bool.
 Описание
 Данный метод вызывает соответствующий метод OdDbObjectOverrule.WblockClone().
 Ссылки
 Teigha.DatabaseServices.ObjectOverrule, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!