Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DataLinkManager.DataLinkCount
 Послать отзыв
 Свойство обеспечивает доступ к количеству внешних ссылок в данном эекземпляре DataLinkManager.
 Синтаксис
C#
Visual Basic
Копировать Код
public int DataLinkCount;
Копировать Код
Public Property DataLinkCount() As Integer
 Возвращает
 Возвращает количество внешних ссылок. Тип int.
 Описание
 Свойство обеспечивает доступ к количеству внешних ссылок в данном эекземпляре DataLinkManager.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.DataLinkManager, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!