Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DataTable.GetColumnNameAt
 Послать отзыв
 Метод позволяет получить имя столбца с указанным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public String GetColumnNameAt( int index );
Копировать Код
Public Function GetColumnNameAt( index As Integer ) As String
 Параметры
 Параметры
 Описание
 index
 Индекс искомого столбца. Тип int.
 Возвращает
 Возвращает имя столбца. Тип String. Если индекс оказался недействительным, метод выбрасывает исключение Teigha.Runtime.ErrorStatus.eInvalidInput.
 Описание
 Метод позволяет получить имя столбца с указанным индексом.
 Ссылки
 Teigha.DatabaseServices.DataTable, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!