Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.PointOnSurface.GetNormal
 Послать отзыв
 Метод вычисляет нормаль к поверхности в текущей точке. В текущей версии не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d GetNormal();
Копировать Код
Public Function GetNormal() As Vector3d
 Возвращает
 Возвращает вектор нормали в точке, определяемой данным объектом. Тип Vector3d.
 Описание
 Метод вычисляет нормаль к поверхности в текущей точке. В текущей версии не реализован.
 Ссылки
 Teigha.Geometry.PointOnSurface, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!