Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Helix.Height
 Послать отзыв
 Свойство позволяет управлять высотой спирали.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Height;
Копировать Код
Public Property Height As Double
 Возвращает
 Возвращает высоту спирали. Тип double.
 Описание
 Свойство позволяет управлять высотой спирали.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Helix, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!