Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocAction.OwningNetwork
 Послать отзыв
 Свойство позволяет получить ObjectId сети AssocNetwork, логически владеющей данным действием, или ObjectId.Null, если эта сеть AssocNetwork является вершиной иерархии сетей.
 Синтаксис
C#
Visual Basic
Копировать Код
public Teigha.DatabaseServices.ObjectId OwningNetwork;
Копировать Код
Public Property OwningNetwork() As Teigha.DatabaseServices.ObjectId
 Возвращает
 Возвращает ObjectId сети AssocNetwork, логически владеющей данным действием, или ObjectId.Null, если эта сеть AssocNetwork является вершиной иерархии сетей. Тип Teigha.DatabaseServices.ObjectId.
 Описание
 Свойство позволяет получить ObjectId сети AssocNetwork, логически владеющей данным действием, или ObjectId.Null, если эта сеть AssocNetwork является вершиной иерархии сетей.
 Каждое действие, за исключением самой верхней сети AssocNetwork, «логически» принадлежит единственной сети AssocNetwork.
 Эта сеть может быть «физическим» владельцем действия в базе данных (такая сеть имеет идентификатор жесткого владения действием), но «физическим» владельцем может быть и какой-либо иной объект. Например, для сетей, подключенных к BlockTableRecords, «логическим» владельцем является сеть верхнего уровня всей базы данных, но «физическим» владельцем в базе данных является подсловарь словаря расширения AcBdBlockTableRecord.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.AssocAction, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!