Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeader.getContextDataManager
 Послать отзыв
 Метод возвращает указатель на менеджер данных контекста этой мультивыноски.
 Синтаксис
C#
Visual Basic
Копировать Код
public IntPtr getContextDataManager();
Копировать Код
Public Function getContextDataManager() As IntPtr
 Возвращает
 Возвращает указатель на объект менеджера данных контекста мультивыноски. Тип IntPtr.
 Описание
 Метод возвращает указатель на менеджер данных контекста этой мультивыноски.
 Ссылки
 Teigha.DatabaseServices.MLeader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!