Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Cell.GetBlockAttributeValue
 Послать отзыв
 Метод позволяет получить значение указанного атрибута блока данной ячейки.
 Синтаксис
C#
Visual Basic
Копировать Код
public String GetBlockAttributeValue( ObjectId attDefId );
Копировать Код
Public Function GetBlockAttributeValue( attDefId As ObjectId ) As String
 Параметры
 Параметры
 Описание
 attDefId
 Идентификатор объекта определения атрибута. Тип ObjectId.
 Возвращает
 Возвращает значение указанного атрибута блока. Тип String.
 Описание
 Метод позволяет получить значение указанного атрибута блока данной ячейки.
 Ссылки
 Teigha.DatabaseServices.Cell, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!