Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.RadialDimensionLarge.JogPoint
 Послать отзыв
 Свойство JogPoint представляет точку излома линии размера.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d JogPoint;
Копировать Код
Public Property JogPoint As Point3d
 Возвращает
 Возвращает точку излома в мировой системе координат (WCS). Тип Point3d.
 Описание
 Свойство JogPoint представляет точку излома линии размера. В этой точке размерная линия претерпевает излом при переходе от переопределенного центра к точке хорды.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.RadialDimensionLarge, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!