Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DbDictionaryEnumerator.Reset
 Послать отзыв
 Реинициализирует перечислитель, сбрасывая его текущий индекс к значению -1.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Reset();
Копировать Код
Public Sub Reset()
 Описание
 Реинициализирует перечислитель, сбрасывая его текущий индекс к значению -1.
 Ссылки
 Teigha.DatabaseServices.DbDictionaryEnumerator, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!