Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FeatureControlFrame.Dimclrd
 Послать отзыв
 Свойство Dimclrd представляет текущее значение системной переменной DIMCLRD, которая задает цвет размерных и выносных линий, рамок и стрелок.
 Синтаксис
C#
Visual Basic
Копировать Код
public Colors.Color Dimclrd;
Копировать Код
Public Property Dimclrd As Colors.Color
 Возвращает
 Возвращает цвет, используемый для отображения данного объекта. Тип Colors.Color.
 Описание
 Свойство Dimclrd представляет текущее значение системной переменной DIMCLRD, которая задает цвет размерных и выносных линий, рамок и стрелок.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.FeatureControlFrame, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!