Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Point3d.ToArray
 Послать отзыв
 Метод создает массив, содержащий значения координат данной точки.
 Синтаксис
C#
Visual Basic
Копировать Код
public double[] ToArray();
Копировать Код
Public Function ToArray() As Double()
 Возвращает
 Возвращает массив из трех элементов, содержащий значения координат X, Y и Z данной точки. Тип double[].
 Описание
 Метод позволяет получить массив из трех элементов, содержащий значения координат X, Y и Z данной точки.
 Ссылки
 Teigha.Geometry.Point3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!