Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CurveCurveIntersector2d.GetPointOnCurve2
 Послать отзыв
 Метод позволяет получить точку пересечения с заданным индексом как точку PointOnCurve2d на второй кривой.
 Синтаксис
C#
Visual Basic
Копировать Код
public PointOnCurve2d GetPointOnCurve2( int intersection );
Копировать Код
Public Function GetPointOnCurve2( intersection As Integer ) As PointOnCurve2d
 Параметры
 Параметры
 Описание
 intersection
 Входной индекс точки пересечения кривых. Тип int.
 Возвращает
 Возвращает объект PointOnCurve2d для точки пересечения на второй кривой.
 Описание
 Метод позволяет получить точку пересечения с заданным индексом как точку PointOnCurve2d на второй кривой. Класс PointOnCurve2d предоставляет доступ к 2D-координатам и значению параметра возвращаемой точки.
 Ссылки
 Teigha.Geometry.CurveCurveIntersector2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!