Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.Dimtm
 Послать отзыв
 Свойство задает или возвращает нижнее предельное отклонение размера.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Dimtm;
Копировать Код
Public Property Dimtm As Double
 Возвращает
 Возвращает нижнее предельное отклонение размера. Тип double.
 Описание
 Свойство задает или возвращает нижнее предельное отклонение размера. Это свойство действует только в том случае, если отображение допусков включено (свойство Dimtol имеет значение true).
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!