Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Dimsd2
 Послать отзыв
 Синтаксис
C#
Visual Basic
public bool Dimsd2;
Public Property Dimsd2() As bool
 Описание
 Возвращает или устанавливает текущее значение DIMSD2 для базы данных. Значение false соответствует 0. Значение true — 1.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!