Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObject.IsModifiedGraphics
 Послать отзыв
 Свойство предоставляет информацию, был ли объект, отнаследованный от класса Entity, изменен.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsModifiedGraphics;
Копировать Код
Public Property IsModifiedGraphics() As bool
 Возвращает
 Возвращает тип данных bool. Возвращает true, если объект был изменен.
 Описание
 Свойство предоставляет информацию, был ли объект, отнаследованный от класса Entity, изменен.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.DBObject, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!