Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SymbolUtilityServices.IsCompatibilityMode
 Послать отзыв
 Метод позволяет проверить настройку EXTNAMES для указанной базы данных.
 Синтаксис
C#
Visual Basic
Копировать Код
public static bool IsCompatibilityMode( ref Database database );
Копировать Код
Public Shared Function IsCompatibilityMode( ByRef database As Database ) As Boolean
 Параметры
 Параметры
 Описание
 database
 Проверяемая база данных. Тип Database.
 Возвращает
 Возвращает true, если используется режим совместимости. В противном случае возвращает false.
 Описание
 Метод позволяет проверить настройку EXTNAMES для указанной базы данных.
 Ссылки
 Teigha.DatabaseServices.SymbolUtilityServices, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!