Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Matrix2d.Mirroring
 Послать отзыв
 Метод предоставляет матрицу, которая описывает зеркальное отражение относительно указанной оси.
 Синтаксис
C#
Visual Basic
Копировать Код
public static Matrix2d Mirroring( ref Line2d line );
Копировать Код
Public Shared Function Mirroring( ByRef line As Line2d ) As Matrix2d
 Параметры
 Параметры
 Описание
 line
 Ось зеркального отражения. Тип Line2d.
 Возвращает
 Возвращает матрицу зеркального отражения относительно оси line. Тип Matrix2d.
 Описание
 Метод предоставляет матрицу, которая описывает зеркальное отражение относительно оси line.
 Ссылки
 Teigha.Geometry.Matrix2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!