Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.CenterMarkSize
 Послать отзыв
 Свойство возвращает размер маркера центра для радиальных и диаметральных размеров.
 Синтаксис
C#
Visual Basic
Копировать Код
public double CenterMarkSize;
Копировать Код
Public ReadOnly Property CenterMarkSize As Double
 Возвращает
 Возвращает размер маркера центра. Тип double.
 Описание
 Свойство возвращает размер маркера центра для радиальных и диаметральных размеров.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!