Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GeoLocationData.CoordinateSystem
 Послать отзыв
 Свойство обеспечивает доступ к строке, представляющей текущую систему координат.
 Синтаксис
C#
Visual Basic
Копировать Код
public String CoordinateSystem;
Копировать Код
Public Property CoordinateSystem As String
 Возвращает
 Возвращает строку, представляющую систему координат. Тип String.
 Описание
 Свойство обеспечивает доступ к строке, представляющей текущую систему координат.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.GeoLocationData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!