Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FormattedTableData.SetTextStyle
 Послать отзыв
 Метод позволяет задать текстовый стиль в ячейке.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetTextStyle( int row, int column, DatabaseServices.ObjectId value );
Копировать Код
Public Overridable Sub SetTextStyle( row As Integer, column As Integer, value As DatabaseServices.ObjectId )
 Параметры
 Параметры
 Описание
 row
 Индекс строки. Тип int. Должен быть неотрицательным и меньше количества строк в таблице.
 column
 Индекс столбца. Тип int. Должен быть неотрицательным и меньше количества столбцов в таблице.
 value
 Идентификатор назначаемого текстового стиля. Тип DatabaseServices.ObjectId.
 Описание
 Метод позволяет задать текстовый стиль в ячейке.
 Ссылки
 Teigha.DatabaseServices.FormattedTableData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!