Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ExtrudedSurface.TaperAngle
 Послать отзыв
 Свойство предоставляет доступ к уклону операции выдавливания.
 Синтаксис
C#
Visual Basic
Копировать Код
public double TaperAngle;
Копировать Код
Public Property TaperAngle As Double
 Возвращает
 Возвращает угол уклона экструзии в радианах. Тип double.
 Описание
 Свойство предоставляет доступ к уклону операции выдавливания.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.ExtrudedSurface, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!