Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SectionSettings.SetHiddenLine
 Послать отзыв
 Метод позволяет управлять видимостью скрытых линий для геометрии указанного типа.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetHiddenLine( SectionType nSecType, SectionGeometry nGeometry, bool bHiddenLine );
Копировать Код
Public Sub SetHiddenLine( nSecType As SectionType, nGeometry As SectionGeometry, bHiddenLine As Boolean )
 Параметры
 Параметры
 Описание
 nSecType
 Тип сечения. Перечисление SectionType.
 nGeometry
 Типы элементов геометрии сечения. Перечисление SectionGeometry.
 bHiddenLine
 Входной флаг видимости скрытых линий. Тип bool. Передать значение true, если скрытые линии должны быть видимыми. В противном случае передать false.
 Описание
 Метод позволяет управлять видимостью скрытых линий для геометрии указанного типа.
 Ссылки
 Teigha.DatabaseServices.SectionSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!