Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DataTable.DataTable
 Послать отзыв
 Конструктор по умолчанию.
 Синтаксис
C#
Visual Basic
Копировать Код
public DataTable();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию.
 Ссылки
 Teigha.DatabaseServices.DataTable, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!