Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Событие Database.ProxyResurrectionCompleted
 Послать отзыв
 Синтаксис
C#
Visual Basic
public event ProxyResurrectionCompletedEventHandler ProxyResurrectionCompleted;
Public Event ProxyResurrectionCompleted As ProxyResurrectionCompletedEventHandler
 Описание
 Событие возникает, когда загрузка модуля nanoCAD API восстанавливает прокси объекты в базе данных.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!