Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SymbolTableEnumerator.MoveNext
 Послать отзыв
 Метод реализует переход указателя перечислителя к следующей записи в таблице символов.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual bool MoveNext();
Копировать Код
Public Overridable Function MoveNext() As Boolean
 Возвращает
 Возвращает true, если текущий элемент перечислителя находится в таблице (его индекс не превышает размер таблицы), и false, если индекс вышел за пределы таблицы.
 Описание
 Метод реализует переход указателя перечислителя к следующей записи в таблице символов.
 Ссылки
 Teigha.DatabaseServices.SymbolTableEnumerator, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!