Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeader.GetDoglegLength
 Послать отзыв
 Метод позволяет определить длину полки для указанного кластера выносной линии.
 Синтаксис
C#
Visual Basic
Копировать Код
public double GetDoglegLength( int leaderIndex );
Копировать Код
Public Function GetDoglegLength( leaderIndex As Integer ) As Double
 Параметры
 Параметры
 Описание
 leaderIndex
 Индекс кластера выносной линии. Тип int.
 Возвращает
 Возвращает длину указанной полки. Тип double.
 Описание
 Метод позволяет определить длину полки для кластера выносной линии с указанным индексом.
 Ссылки
 Teigha.DatabaseServices.MLeader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!