Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FieldEvaluator.Compile
 Послать отзыв
 Метод компилирует поле при изменении кода поля.
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract void Compile( ref Field pField, ref Database pDb, ref FieldResult result );
Копировать Код
Public MustOverride Sub Compile( ByRef pField As Field, ByRef pDb As Database, ByRef result As FieldResult )
 Параметры
 Параметры
 Описание
 pField
 Вычисляемое поле. Тип Field.
 pDb
 Указатель на базу данных. Тип Database.
 Возвращает
 Объект результата поля, в котором сохраняется статус компиляции поля. Тип FieldResult.
 Описание
 Метод предназначен для компиляции поля при изменении кода поля.
 Замечания
 Вычислитель может выполнять произвольный парсинг кода поля и сохранять в поле полученные результаты. Фреймворк полей вызывает этот метод для компиляции поля при всяком изменении кода поля. Но в отличие от метода Evaluate(), который вызывается при каждом вычислении поля, метод Compile вызывается только при изменении кода поля.
 Ссылки
 Teigha.DatabaseServices.FieldEvaluator, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!