Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.PolylineCurve2d.PolylineCurve2d
 Послать отзыв
 Конструктор класса PolylineCurve2d. Создает полилинию по заданному массиву определяющих точек.
 Синтаксис
C#
Visual Basic
Копировать Код
public PolylineCurve2d( ref Point2dCollection points );
Копировать Код
Public Sub New( ByRef points As Point2dCollection )
 Параметры
 Параметры
 Описание
 points
 Входная коллекция определяющих точек. Тип Point2dCollection.
 Описание
 Конструктор класса PolylineCurve2d. Создает полилинию по заданному массиву определяющих точек points.
 Ссылки
 Teigha.Geometry.PolylineCurve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!