Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DwfDefinition.isDWFx
 Послать отзыв
 Свойство предоставляет возможность проверить, является ли объект файлом формата DWFx.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool isDWFx;
Копировать Код
Public Property isDWFx As Boolean
 Возвращает
 Возвращает true, если объект является файлом формата DWFx. В противном случае возвращает false.
 Описание
 Свойство предоставляет возможность проверить, является ли объект файлом формата DWFx.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.DwfDefinition, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!