Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.SurfaceSurfaceIntersector.Set
 Послать отзыв
 Метод позволяет переопределить обе поверхности, связанные с данным объектом.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Set( ref Surface surface1, ref Surface surface2 );
Копировать Код
Public Sub Set( ByRef surface1 As Surface, ByRef surface2 As Surface )
 Параметры
 Параметры
 Описание
 surface1
 Первая поверхность, участвующая в пересечении со второй поверхностью. Тип Surface.
 surface2
 Вторая поверхность, участвующая в пересечении с первой поверхностью. Тип Surface.
 Описание
 Метод позволяет переопределить обе поверхности, связанные с данным объектом.
 Замечания
 Используется вызов метода Set(Surface surface1, Surface surface2, Tolerance tolerance) с точностью по умолчанию Tolerance.Global.
 Ссылки
 Teigha.Geometry.SurfaceSurfaceIntersector, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!