Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Spline.FitTolerance
 Послать отзыв
 Свойство FitTolerance представляет точность аппроксимации для данного сплайна.
 Синтаксис
C#
Visual Basic
Копировать Код
public double FitTolerance;
Копировать Код
Public Property FitTolerance As Double
 Возвращает
 Возвращает точность аппроксимации. Тип double.
 Описание
 Свойство FitTolerance представляет точность аппроксимации для данного сплайна.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Spline, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!