Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbCurve3d.SetWeightAt
 Послать отзыв
 Метод позволяет задать вес управляющей вершины сплайна с указанным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetWeightAt( int index, double value );
Копировать Код
Public Sub SetWeightAt( index As Integer, value As Double )
 Параметры
 Параметры
 Описание
 index
 Индекс управляющей вершины. Тип int. Индекс должен быть больше или равен 0 и меньше количества управляющих вершин.
 value
 Новое значение веса. Тип double.
 Описание
 Метод позволяет задать вес управляющей вершины сплайна с указанным индексом.
 Замечания
 Чем выше значение веса, тем ближе к управляющей вершине проходит кривая, и наоборот. Чем ближе вес к нулю, тем ближе к прямой линии становится кривая около соответствующей управляющей вершины.
 Ссылки
 Teigha.Geometry.NurbCurve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!