Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.IsContentEditable
 Послать отзыв
 Метод позволяет определить, возможно ли изменение содержимого ячейки.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual bool IsContentEditable( int row, int column );
Копировать Код
Public virtual Function IsContentEditable( row As Integer, column As Integer ) As Boolean
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 col
 Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
 Возвращает
 Возвращает true, если содержимое ячейки изменить можно, и false, если нет.
 Описание
 Метод позволяет определить, возможно ли изменение содержимого ячейки.
 Например, содержимое заблокированных и доступных только для чтения ячеек изменить нельзя. Учитывая, что семантика редактируемой ячейки может измениться по мере добавления новых состояний, для проверки состояния ячеек рекомендуется метод IsContentEditable вместо прямого обращения к cellState.
 Замечания
 Для получения того же результата предпочтительнее использовать Table.Cells[row,column].IsContentEditable.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!