Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ArcDimension.ArcStartParam
 Послать отзыв
 Свойство предоставляет доступ к параметру начальной точки дуги размера.
 Синтаксис
C#
Visual Basic
Копировать Код
public double ArcStartParam;
Копировать Код
Public Property ArcStartParam() As Double
 Возвращает
 Возвращает значение параметра. Тип double.
 Описание
 Свойство предоставляет доступ к параметру начальной точки дуги размера.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.ArcDimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!