Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeader.SetDogleg
 Послать отзыв
 Метод позволяет задать направление полки линии выноски с указанным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetDogleg( int leaderIndex, Vector3d vector );
Копировать Код
Public Sub SetDogleg( leaderIndex As Integer, vector As Vector3d )
 Параметры
 Параметры
 Описание
 leaderIndex
 Индекс линии выноски. Тип int.
 vector
 Направление полки. Тип Vector3d.
 Описание
 Метод позволяет задать направление полки линии выноски с указанным индексом.
 Ссылки
 Teigha.DatabaseServices.MLeader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!