Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LampColorType
 Послать отзыв
 Данное перечисление определяет способы задания цвета источника света.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum LampColorType { Kelvin = 0, Preset = 1 }
Копировать Код
Public Enum LampColorType Kelvin = 0 Preset = 1 End Enum
 Члены
 Члены
 Описание
 Kelvin
 Значение: 0. Цвет источника света определяется его цветовой температурой, указанной в кельвинах.
 Preset
 Значение: 1. Цвет источника света определяется предустановленным цветом лампы.
 Описание
 Данное перечисление определяет способы задания цвета источника света.
 Ваши комментарии по поводу этого топика: Послать отзыв!