Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SectionHitTestInfo.SubItem
 Послать отзыв
 Свойство SubItem обеспечивает доступ к флагам попадания указанной пользователем точки на индикатор секущей плоскости.
 Синтаксис
C#
Visual Basic
Копировать Код
public SectionSubItem SubItem;
Копировать Код
Public ReadOnly Property SubItem As SectionSubItem
 Возвращает
 Возвращает флагам попадания точки в индикатор секущей плоскости. Значение из перечисления SectionSubItem.
 Описание
 Свойство SubItem обеспечивает доступ к флагам попадания указанной пользователем точки на индикатор секущей плоскости.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.SectionHitTestInfo, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!