Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector3d.Length
 Послать отзыв
 Свойство возвращает длину данного вектора.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Length;
Копировать Код
Public Property Length() As Double
 Возвращает
 Возвращает длину вектора. Тип double.
 Описание
 Свойство возвращает евклидову длину данного вектора.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.Vector3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!