Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AbstractViewTableRecord.SetUcs
 Послать отзыв
 Метод задает для записи таблицы видов или видовых экранов новую неименованную пользовательскую систему координат.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetUcs( Point3d origin, Vector3d x, Vector3d y );
Копировать Код
Public Sub SetUcs( origin As Point3d, x As Vector3d, y As Vector3d )
 Параметры
 Параметры
 Описание
 origin
 Входная точка начала координат. Тип Point3d.
 x
 Направляющий вектор координатной оси X. Тип Vector3d.
 y
 Направляющий вектор координатной оси Y. Тип Vector3d.
 Описание
 Метод задает новую неименованную пользовательскую систему координат (UCS, ПСК) для записи таблицы видов или видовых экранов. Ориентация этой UCS определяется указанными началом координат и направляющими векторами координатных осей X и Y.
 Ссылки
 Teigha.DatabaseServices.AbstractViewTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!