Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.BoundBlock2d.GetMaximumPoint
 Послать отзыв
 Метод предоставляет максимальную точку данной граничной рамки.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point2d GetMaximumPoint();
Копировать Код
Public Function GetMaximumPoint() As Point2d
 Возвращает
 Возвращает экземпляр класса Point2d, который представляет максимальную точку граничной рамки.
 Описание
 Метод предоставляет максимальную точку данной граничной рамки.
 Ссылки
 Teigha.Geometry.BoundBlock2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!