Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotSettings.PlotViewName
 Послать отзыв
 Свойство PlotViewName представляет доступ к именованному виду, который, в свою очередь, определяет, какая часть листа должна быть выведена на печать.
 Синтаксис
C#
Visual Basic
Копировать Код
public String PlotViewName;
Копировать Код
Public ReadOnly Property PlotViewName As String
 Возвращает
 Возвращает имя вида. Тип String.
 Описание
 Свойство PlotViewName представляет доступ к именованному виду, который, в свою очередь, определяет, какая часть листа должна быть выведена на печать.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.PlotSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!