Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector3d.ZAxis
 Послать отзыв
 Свойство возвращает направление оси Z.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d ZAxis;
Копировать Код
Public Property ZAxis() As Vector3d
 Возвращает
 Возвращает направление оси Z. Тип Vector3d.
 Описание
 Свойство возвращает направление оси Z.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.Vector3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!