Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObject.IsCancelling
 Послать отзыв
 Свойство предоставляет информацию, происходит ли сейчас отмена всех изменений объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsCancelling;
Копировать Код
Public Property IsCancelling() As bool
 Возвращает
 Возвращает тип данных bool. Возвращает true, если объекта в данный момент выполняется вызов метода Cancel() (т.е. открытие объекта отменяется и для всех изменений производится откат).
 Описание
 Свойство предоставляет информацию, происходит ли сейчас отмена всех изменений объекта.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.DBObject, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!