Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve3d.HasEndPoint
 Послать отзыв
 Свойство позволяет установить, имеет ли данная кривая конечную точку.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool HasEndPoint;
Копировать Код
Public Property HasEndPoint() As Boolean
 Возвращает
 Возвращает true, если кривая имеет конечную точку. Возвращает false, если параметрический интервал кривой сверху не ограничен.
 Описание
 Свойство позволяет установить, имеет ли данная кривая конечную точку. Возвращаемое значение false означает, что параметрический интервал кривой верхней границы не имеет.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.Curve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!