Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Angdir
 Послать отзыв
 Синтаксис
C#
Visual Basic
public bool Angdir;
Public Property Angdir() As bool
 Описание
 Возвращает или устанавливает текущее значение ANGDIR для базы данных. Значение false равно 0. Значение true равно 1.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!