Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.EllipticalCone.RadiusRatio
 Послать отзыв
 Свойство RadiusRatio управляет соотношением длин полуосей эллипса в основании данного эллиптического конуса.
 Синтаксис
C#
Visual Basic
Копировать Код
public double RadiusRatio;
Копировать Код
Public ReadOnly Property RadiusRatio As Double
 Возвращает
 Возвращает отношение длин полуосей эллипса в основании данного эллиптического конуса. Тип double.
 Описание
 Свойство RadiusRatio управляет соотношением длин полуосей эллипса в основании данного эллиптического конуса. Чем это отношение ближе к единице, тем эллиптическое основание конуса ближе к окружности.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.EllipticalCone, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!