Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.PointOnCurve3d.IsSingular
 Послать отзыв
 Метод позволяет проверить равенство нулю длины вектора первой производной кривой в данной точке.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsSingular();
Копировать Код
Public Function IsSingular() As Boolean
 Возвращает
 Возвращает true, если длина вектора первой производной равна нулю; в противном случае возвращает false.
 Описание
 Метод позволяет проверить равенство нулю длины вектора первой производной кривой в данной точке.
 Ссылки
 Teigha.Geometry.PointOnCurve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!