Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ObjectId.Open
 Послать отзыв
 Метод открывает объект в указанном режиме доступа.
 Синтаксис
C#
Visual Basic
Копировать Код
public DBObject Open( OpenMode mode );
Копировать Код
Public Function Open( mode As OpenMode ) As DBObject
 Параметры
 Параметры
 Описание
 mode
 Режим обращения к объекту из перечисления Teigha.DatabaseServices.OpenMode.
 Возвращает
 Возвращает экземпляр класса DBObject
 Описание
 Метод открывает объект в указанном режиме доступа.
 Ссылки
 Teigha.DatabaseServices.ObjectId, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!