Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FullSubentityPath.FullSubentityPath
 Послать отзыв
 Конструктор класса FullSubentityPath. Инициализирует встроенную коллекцию идентификаторов ObjectIdCollection и индекс встроенного подобъекта SubentityId.
 Синтаксис
C#
Visual Basic
Копировать Код
public FullSubentityPath( ref ObjectId[] ids, SubentityId index );
Копировать Код
Public Sub New( ByRef ids() As ObjectId, index As SubentityId )
 Параметры
 Параметры
 Описание
 ids
 Входной массив идентификаторов объектов. Тип array.
 index
 Входной идентификатор подобъекта. Тип SubentityId.
 Описание
 Конструктор класса FullSubentityPath. Инициализирует встроенную коллекцию идентификаторов ObjectIdCollection и индекс встроенного подобъекта SubentityId.
 Ссылки
 Teigha.DatabaseServices.FullSubentityPath, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!