Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotSettingsValidator.SetStdScaleType
 Послать отзыв
 Метод позволяет задать для указанного объекта PlotSettings стандартный масштаб из перечисления StdScaleType.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetStdScaleType( ref PlotSettings plotSet, StdScaleType scaleType );
Копировать Код
Public Sub SetStdScaleType( ByRef plotSet As PlotSettings, scaleType As StdScaleType )
 Параметры
 Параметры
 Описание
 plotSet
 Входной объект PlotSettings с настройками печати.
 scaleType
 Стандартный тип масштаба. Значение из перечисления StdScaleType.
 Описание
 Метод позволяет задать для указанного объекта PlotSettings стандартный масштаб из перечисления StdScaleType. Это перечисление отражает желаемый масштаб при печати, который платформа использует вместе с другой информацией, такой как размеры области печати, для вычисления значения CustomPrintScale, когда свойство UseStandardScale имеет значение true.
 Ссылки
 Teigha.DatabaseServices.PlotSettingsValidator, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!