Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocDependency.UpdateDependentOnObject
 Послать отзыв
 Метод позволяет обновить объект, от которого зависит ассоциативная зависимость, на основе информации, полученной зависимостью от родительского действия.
 Синтаксис
C#
Visual Basic
Копировать Код
public void UpdateDependentOnObject();
Копировать Код
Public Sub UpdateDependentOnObject()
 Описание
 Метод позволяет обновить объект, от которого зависит ассоциативная зависимость, на основе информации, которую зависимость получает от действия-владельца.
 Если зависимость владеет объектом AssocDependencyBody, вызывается его метод UpdateDependentOnObject(), в противном случае реализация этого метода по умолчанию ничего не делает.
 Объект зависимости должен быть открыт по крайней мере для чтения.
 Ссылки
 Teigha.DatabaseServices.AssocDependency, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!