Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LayoutManager.LayoutRemoved
 Послать отзыв
 Cобытие создается, когда завершается удаление листа.
 Синтаксис
C#
Visual Basic
Копировать Код
public event LayoutEventHandler LayoutRemoved;
Копировать Код
Public Event LayoutRemoved As LayoutEventHandler
 Описание
 Cобытие создается, когда завершается удаление листа.
 Ссылки
 Teigha.DatabaseServices.LayoutManager, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!