Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.InsertRowsAndInherit
 Послать отзыв
 Метод позволяет вставить в таблицу заданное количество новых строк по указанному индексу строки.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void InsertRowsAndInherit( int index, int inheritFrom, int numRows );
Копировать Код
Public virtual Sub InsertRowsAndInherit( index As Integer, inheritFrom As Integer, numRows As Integer )
 Параметры
 Параметры
 Описание
 index
 Индекс, начиная с которого выполняется вставка новых строк, тип int.
 inheritFrom
 Индекс строки, у которой новые строки наследуют формат, тип int. Может принимать значение -1. В этом случае новые строки создаются с форматом по умолчанию.
 numRows
 Количество вставляемых строк, тип int.
 Описание
 Метод позволяет вставить в таблицу заданное количество новых строк по указанному индексу строки. Метод позволяет на выбор использовать для новых строк формат по умолчанию или наследовать формат у существующей строки.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!