Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.SurfaceCurve2dTo3d.GeometricExtents
 Послать отзыв
 Свойство GeometricExtents возвращает трехмерную граничную рамку для данной кривой.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.Extents3d GeometricExtents;
Копировать Код
Public ReadOnly Property GeometricExtents As DatabaseServices.Extents3d
 Возвращает
 Возвращает 3D граничную рамку для данного объекта. Тип DatabaseServices.Extents3d.
 Описание
 Свойство GeometricExtents возвращает трехмерную граничную рамку для данной кривой. Ориентация этой рамки определяется осями системы координат объекта.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.SurfaceCurve2dTo3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!