Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SectionSettings.GetSourceObjects
 Послать отзыв
 Метод позволяет получить коллекцию исходных объектов для случаев, когда выставлен флаг SectionGeneration.SourceSelectedObjects.
 Синтаксис
C#
Visual Basic
Копировать Код
public void GetSourceObjects( SectionType nSecType, ref ObjectIdCollection ids );
Копировать Код
Public Sub GetSourceObjects( nSecType As SectionType, ByRef ids As ObjectIdCollection )
 Параметры
 Параметры
 Описание
 nSecType
 Тип сечения. Перечисление SectionType.
 ids
 Полученная коллекция идентификаторов исходных объектов. Тип ObjectIdCollection.
 Описание
 Метод позволяет получить коллекцию исходных объектов для случаев, когда выставлен флаг SectionGeneration.SourceSelectedObjects.
 Ссылки
 Teigha.DatabaseServices.SectionSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!