Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GeometryOverrule.SetXDataFilter
 Послать отзыв
 Позволяет задать условие применения объектного переопределения на основе расширенных данных (xdata).
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetXDataFilter( ref String registeredApplicationName );
Копировать Код
Public Sub SetXDataFilter( ByRef registeredApplicationName As String )
 Параметры
 Параметры
 Описание
 registeredApplicationName
 Имя зарегистрированного приложения, тип String.
 Описание
 Позволяет задать условие применения объектного переопределения на основе расширенных данных (xdata).
 Используйте этот метод, если требуется, чтобы nanoCAD искал в объекте расширенные данные xdata с именем registeredApplicationName перед применением к нему любого из ваших переопределений.
 Ссылки
 Teigha.DatabaseServices.GeometryOverrule, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!