Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Database.Wblock (Database^, ObjectIdCollection^, Point3d, DuplicateRecordCloning)
 Послать отзыв
 Синтаксис
C#
Visual Basic
public void Wblock(ref Database outputDataBase, ref ObjectIdCollection outObjIds, Point3d basePoint, DuplicateRecordCloning cloning);
Public Sub Wblock(ByRef outputDataBase As Database, ByRef outObjIds As ObjectIdCollection, basePoint As Point3d, cloning As DuplicateRecordCloning)
 Описание
 Создает новый объект типа база данных, и затем использует механизм wblockClone для записи содержимого геометрических объектов базы данных, из которой вызывается метод, в новую базу данных.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!