Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство RasterImage.PixelToModelTransform
 Послать отзыв
 Синтаксис
C#
Visual Basic
public Matrix3d PixelToModelTransform;
Public Property PixelToModelTransform() As Matrix3d
 Описание
 Возвращает аффинное преобразование точек исходного изображения в координатные значения пространства модели.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.RasterImage, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!