Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Filters.LayerFilter.Add
 Послать отзыв
 Метод добавляет к данному фильтру слой с указанным именем.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Add( ref String layer );
Копировать Код
Public Sub Add( ByRef layer As String )
 Параметры
 Параметры
 Описание
 layer
 Имя добавляемого слоя. Тип String.
 Описание
 Метод добавляет к данному фильтру слой с указанным именем. Все объекты на добавленном слое будут приняты к обработке.
 Ссылки
 Teigha.DatabaseServices.Filters.LayerFilter, Teigha.DatabaseServices.Filters
 Ваши комментарии по поводу этого топика: Послать отзыв!