Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MlineStyle.StartRoundCap
 Послать отзыв
 Свойство управляет отображением круглого торцевого ограничителя на начальном торце мультилинии.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool StartRoundCap;
Копировать Код
Public Property StartRoundCap As Boolean
 Возвращает
 Возвращает true, если отображение круглого торцевого ограничителя включено. В противном случае возвращает false.
 Описание
 Свойство управляет отображением круглого торцевого ограничителя на начальном торце мультилинии. Это внешняя дуга между крайними элементами мультилинии.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MlineStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!