Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Database.GetVisualStyleList
 Послать отзыв
 Синтаксис
C#
Visual Basic
public StringCollection GetVisualStyleList();
Public Function GetVisualStyleList() As StringCollection
 Описание
 Функция возвращает список, содержащий локализованные имена визуальных стилей, определенных в словаре визуальных стилей. Анонимные визуальные стили и визуальные стили, помеченные как «только для внутреннего использования», исключаются из списка.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!