Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.UnderlayLayer.State
 Послать отзыв
 Свойство State представляет состояние блокировки данного слоя подложки.
 Синтаксис
C#
Visual Basic
Копировать Код
public UnderlayLayerState State;
Копировать Код
Public Property State As UnderlayLayerState
 Возвращает
 Возвращает состояние слоя подложки. Перечисление UnderlayLayerState.
 Описание
 Свойство State представляет состояние данного слоя подложки из перечисления UnderlayLayerState (разблокированный или заблокированный).
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.UnderlayLayer, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!