Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.MinimumTableHeight
 Послать отзыв
 Данное свойство представляет доступ к минимальной общей высоте таблицы.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual double MinimumTableHeight;
Копировать Код
Public virtual Property MinimumTableHeight() As double
 Возвращает
 Возвращает минимальную общую высоту таблицы, тип double.
 Описание
 Данное свойство представляет доступ к минимальной общей высоте таблицы.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!