Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Arc.TotalAngle
 Послать отзыв
 Свойство предназначено для хранения величины развертки дуги сегмента угла.
 Синтаксис
C#
Visual Basic
public double TotalAngle;
Public Property TotalAngle() As Double
 Возвращает
 Тип данных double.
 Описание
 Свойство хранит или устанавливает величину развертки дуги сегмента угла.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Arc, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!