Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.BlockTableRecordEnumerator.Current
 Послать отзыв
 Свойство возвращает текущий блок данного перечислителя.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectId Current;
Копировать Код
Public Property Current() As ObjectId
 Возвращает
 Возвращает идентификатор текущего блока. Тип ObjectId.
 Описание
 Свойство возвращает текущий блок данного перечислителя.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.BlockTableRecordEnumerator, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!