Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CurveCurveIntersector3d.GetOverlapRanges
 Послать отзыв
 Метод позволяет вычислить для обеих кривых параметрические интервалы, которые соответствуют указанному по индексу участку перекрытия (совпадения) кривых.
 Синтаксис
C#
Visual Basic
Копировать Код
public Interval[] GetOverlapRanges( int overlap );
Копировать Код
Public Function GetOverlapRanges( overlap As Integer ) As Interval()
 Параметры
 Параметры
 Описание
 overlap
 Индекс участка перекрытия (совпадения) кривых. Тип int. Значение индекса должно быть неотрицательным и быть меньше количества перекрытий, возвращаемого свойством OverlapCount.
 Возвращает
 Возвращает массив из двух элементов, которые представляют параметрические интервалы для первой и второй кривой, соответственно. Тип Interval[].
 Описание
 Метод позволяет вычислить для обеих кривых параметрические интервалы, которые соответствуют указанному по индексу участку перекрытия (совпадения) кривых.
 Ссылки
 Teigha.Geometry.CurveCurveIntersector3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!