Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Polyline3d.SplineFit
 Послать отзыв
 Метод выполняет аппроксимацию полилинии сплайном требуемого типа и с заданным количеством сегментов.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SplineFit( Poly3dType value, int segments );
Копировать Код
Public Sub SplineFit( value As Poly3dType, segments As Integer )
 Параметры
 Параметры
 Описание
 value
 Тип нового аппроксимирующего сплайна из перечисления Poly3dType.
 segments
 Количество сегментов в аппроксимирующем сплайне.
 Описание
 Метод выполняет аппроксимацию полилинии сплайном. Метод преобразует все простые вершины полилинии в контрольные вершины и создает новые вершины аппроксимирующего сплайна требуемого типа и с заданным количеством сегментов.
 Ссылки
 Teigha.DatabaseServices.Polyline3d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!