Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.RevolveOptionsBuilder.CloseToAxis
 Послать отзыв
 Свойство CloseToAxis задает опцию замыкания на ось вращения концов незамкнутого профиля перед выполнением операции вращения.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool CloseToAxis;
Копировать Код
Public Property CloseToAxis As Boolean
 Возвращает
 Возвращает true, если опция включена. В противном случае возвращает false.
 Описание
 Свойство CloseToAxis задает опцию замыкания на ось вращения концов незамкнутого профиля перед выполнением операции вращения. Работает со связанным объектом RevolveOptions.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.RevolveOptionsBuilder, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!