Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GradientBackground.ColorMiddle
 Послать отзыв
 Свойство обеспечивает доступ к среднему (промежуточному) цвету градиентного фона.
 Синтаксис
C#
Visual Basic
Копировать Код
public EntityColor ColorMiddle;
Копировать Код
Public Property ColorMiddle As EntityColor
 Возвращает
 Возвращает средний цвет градиента. Тип Teigha.Colors.EntityColor.
 Описание
 Свойство обеспечивает доступ к среднему (промежуточному) цвету градиентного фона.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.GradientBackground, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!