Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbCurve2d.SetFitData
 Послать отзыв
 Метод пересчитывает сплайн, используя указанные определяющие точки, векторы касательных в начальной и конечной точках и точность по умолчанию.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetFitData( ref KnotCollection fitKnots, ref Point2dCollection fitPoints, Vector2d startTangent, Vector2d endTangent, bool periodic );
Копировать Код
Public Sub SetFitData( ByRef fitKnots As KnotCollection, ByRef fitPoints As Point2dCollection, startTangent As Vector2d, endTangent As Vector2d, periodic As Boolean )
 Параметры
 Параметры
 Описание
 fitKnots
 Узловой вектор нового сплайна. Тип KnotCollection.
 fitPoints
 Массив определяющих точек. Тип Point2dCollection.
 startTangent
 Вектор касательной в начальной точке. Тип Vector2d.
 endTangent
 Вектор касательной в конечной точке. Тип Vector2d.
 periodic
 Флаг, определяющий, требуется ли построить периодический сплайн (замкнутую кривую). Тип bool.
 Описание
 Метод пересчитывает сплайн, используя указанные определяющие точки, векторы касательных в начальной и конечной точках и точность по умолчанию.
 Аргумент fitKnots передает узловой вектор для нового сплайна. Установленный флаг periodic делает новый сплайн периодическим, так что первая и последняя определяющие точки должны совпадать.
 Используется вызов метода NurbCurve2d.SetFitData(KnotCollection fitKnots, Point2dCollection fitPoints, Vector2d startTangent, Vector2d endTangent, Tolerance fitTolerance, Boolean periodic) с точностью по умолчанию, которая равна Tolerance.Global.
 Ссылки
 Teigha.Geometry.NurbCurve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!