Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.AugmentedPolylineCurve3d
 Послать отзыв
 Класс AugmentedPolylineCurve3d представляет математический объект, используемый для поддержки различных типов сплайновых кривых в трехмерном пространстве.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Geometry::Entity3d Teigha::Geometry::Curve3d Teigha::Geometry::SplineEntity3d Teigha::Geometry::PolylineCurve3d Teigha::Geometry::AugmentedPolylineCurve3d
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdGeAugPolyline3d")] public sealed class AugmentedPolylineCurve3d : PolylineCurve3d
Копировать Код
<Wrapper("OdGeAugPolyline3d")> Public NotInheritable Class AugmentedPolylineCurve3d Inherits PolylineCurve3d
 Описание
 Класс AugmentedPolylineCurve3d представляет математический объект, используемый для поддержки различных типов сплайновых кривых в трехмерном пространстве.
 Методы
 Конструкторы
 Teigha.Geometry.PolylineCurve3d
 Имя
 Описание
 PolylineCurve3d
 Это обзор перегрузок PolylineCurve3d.
 Teigha.Geometry.AugmentedPolylineCurve3d
 Имя
 Описание
 AugmentedPolylineCurve3d
 Это обзор перегрузок AugmentedPolylineCurve3d.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Geometry.Entity3d
 Имя
 Описание
 Entity3d Методы
 Ниже перечислены методы класса Entity3d.
 Teigha.Geometry.Curve3d
 Имя
 Описание
 Curve3d Методы
 Ниже перечислены методы класса Curve3d.
 Curve3d Свойства
 Ниже перечислены свойства класса Curve3d.
 Teigha.Geometry.SplineEntity3d
 Имя
 Описание
 SplineEntity3d Методы
 Ниже перечислены методы класса SplineEntity3d.
 SplineEntity3d Свойства
 Ниже перечислены свойства класса SplineEntity3d.
 Teigha.Geometry.PolylineCurve3d
 Имя
 Описание
 PolylineCurve3d Методы
 Ниже перечислены методы класса PolylineCurve3d.
 PolylineCurve3d Свойства
 Ниже перечислены свойства класса PolylineCurve3d.
 Teigha.Geometry.AugmentedPolylineCurve3d
 Имя
 Описание
 AugmentedPolylineCurve3d Методы
 Ниже перечислены методы класса AugmentedPolylineCurve3d.
 AugmentedPolylineCurve3d Свойства
 Ниже перечислены свойства класса AugmentedPolylineCurve3d.
 Ссылки
 AugmentedPolylineCurve3d Конструктор, AugmentedPolylineCurve3d Методы, AugmentedPolylineCurve3d Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!