Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.HostApplicationServices.AlternateFontName
 Послать отзыв
 Свойство возвращает имя "альтернативного" шрифта (шрифта по умолчанию), который используется, когда не удается найти никакой другой шрифт.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual String AlternateFontName;
Копировать Код
Public Overridable ReadOnly Property AlternateFontName As String
 Возвращает
 Возвращает имя "альтернативного" шрифта. Тип String.
 Описание
 Свойство возвращает имя "альтернативного" шрифта (шрифта по умолчанию), который используется, когда не удается найти никакой другой шрифт.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.HostApplicationServices, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!