Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DataCell.Init
 Послать отзыв
 Метод реинициализирует ячейку, устанавливая для нее тип данных CellType.Unknown.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Init();
Копировать Код
Public Sub Init()
 Описание
 Этот метод реинициализирует ячейку, устанавливая для нее тип данных CellType.Unknown.
 Ссылки
 Teigha.DatabaseServices.DataCell, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!