Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LayoutManager.LayoutCount
 Послать отзыв
 Свойство предоставляет доступ к текущему количеству листов.
 Синтаксис
C#
Visual Basic
Копировать Код
public int LayoutCount;
Копировать Код
Public Property LayoutCount() As Integer
 Возвращает
 Возвращает текущее количество листов, тип int.
 Описание
 Свойство предоставляет доступ к текущему количеству листов.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.LayoutManager, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!