Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.XrefFullSubentityPath.DxfOut
 Послать отзыв
 Метод записывает данные DXF этого объекта XrefFullSubentityPath в указанный DXF-файлер.
 Синтаксис
C#
Visual Basic
Копировать Код
public void DxfOut( ref DatabaseServices.DxfFiler outputFiler );
Копировать Код
Public Sub DxfOut( ByRef outputFiler As DatabaseServices.DxfFiler )
 Параметры
 Параметры
 Описание
 outputFiler
 Файлер, в который выполняется запись данных. Тип DatabaseServices.DxfFiler.
 Описание
 Метод записывает данные DXF этого объекта XrefFullSubentityPath в указанный DXF-файлер.
 Ссылки
 Teigha.DatabaseServices.XrefFullSubentityPath, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!