Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GripData.SkipWhenShared
 Послать отзыв
 Свойство определяет, следует ли пропускать отрисовку пользовательской графики этой ручки, если ее базовая точка является общей.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool SkipWhenShared;
Копировать Код
Public Property SkipWhenShared As Boolean
 Возвращает
 Возвращает true, если базовая точка ручки является общей, и отрисовка ручки пропускается. В противном случае возвращает false.
 Описание
 Свойство определяет, следует ли пропускать отрисовку пользовательской графики этой ручки, если ее базовая точка является общей.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.GripData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!