Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Polyline.Thickness
 Послать отзыв
 Синтаксис
C#
Visual Basic
public double Thickness;
Public Property Thickness() As Double
 Описание
 Обеспечивает доступ к значению ширины (иногда называемой глубиной "вытеснения" или высотой) полилинии.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Polyline, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!