Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbCurve3d.GetFitTangents
 Послать отзыв
 Метод предоставляет векторы касательных в начальной и конечной точках, если данный сплайн был построен методом определяющих точек.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d[] GetFitTangents();
Копировать Код
Public Function GetFitTangents() As Vector3d()
 Возвращает
 Возвращает векторы производных в начальной и конечной точках в виде массива из двух элементов. Тип Vector3d[].
 Описание
 Метод предоставляет векторы касательных в начальной и конечной точках, если данный сплайн был построен методом определяющих точек.
 Ссылки
 Teigha.Geometry.NurbCurve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!