Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotStyle.Data
 Послать отзыв
 Свойство Data представляет настройки стиля печати в виде объекта PlotStyleData.
 Синтаксис
C#
Visual Basic
Копировать Код
public PlotStyleData Data;
Копировать Код
Public Property Data As PlotStyleData
 Возвращает
 Возвращает настройки стиля печати. Тип PlotStyleData.
 Описание
 Свойство Data предоставляет доступ к настройкам данного стиля печати в виде объекта PlotStyleData.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.PlotStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!