Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LayerStateManager.LastRestoredLayerState
 Послать отзыв
 Метод обеспечивает доступ к последнему восстановленному состоянию слоя.
 Синтаксис
C#
Visual Basic
Копировать Код
public String LastRestoredLayerState;
Копировать Код
Public Property LastRestoredLayerState() As String
 Возвращает
 Возвращает имя последнего восстановленного состояния слоя, String.
 Описание
 Метод обеспечивает доступ к последнему восстановленному состоянию слоя.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.LayerStateManager, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!