Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Helix.GetAxisPoint
 Послать отзыв
 Метод предоставляет точку начала оси спирали.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d GetAxisPoint();
Копировать Код
Public Function GetAxisPoint() As Point3d
 Возвращает
 Возвращает точку начала оси. Тип Point3d.
 Описание
 Метод предоставляет точку начала оси спирали (центр основания).
 Ссылки
 Teigha.DatabaseServices.Helix, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!