Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Surface.GetSubentityColor
 Послать отзыв
 Метод позволяет получить цвет указанного подобъекта данной поверхности.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual Colors.Color GetSubentityColor( SubentityId subEntityId );
Копировать Код
Public Overridable Function GetSubentityColor( subEntityId As SubentityId ) As Colors.Color
 Параметры
 Параметры
 Описание
 subEntityId
 Идентификатор подобъекта, цвет которого требуется выяснить. Тип SubentityId.
 Возвращает
 Возвращает цвет указанного подобъекта. Тип Colors.Color.
 Описание
 Метод позволяет получить цвет указанного подобъекта данной поверхности.
 Ссылки
 Teigha.DatabaseServices.Surface, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!