Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocArray.ResetItems
 Послать отзыв
 Метод удаляет любые переопределения (положение, ориентация или замена объекта) для всех элементов данного ассоциативного массива.
 Синтаксис
C#
Visual Basic
Копировать Код
public void ResetItems();
Копировать Код
Public Sub ResetItems()
 Описание
 Метод удаляет любые переопределения (положение, ориентация или замена объекта) для всех элементов данного ассоциативного массива.
 Ссылки
 Teigha.DatabaseServices.AssocArray, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!