Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeaderStyle.FirstSegmentAngleConstraint
 Послать отзыв
 Свойство представляет угловое ограничение для первого сегмента линии выноски.
 Синтаксис
C#
Visual Basic
Копировать Код
public AngleConstraint FirstSegmentAngleConstraint;
Копировать Код
Public Property FirstSegmentAngleConstraint As AngleConstraint
 Возвращает
 Возвращает угловое ограничение из перечисления AngleConstraint.
 Описание
 Свойство представляет угловое ограничение для первого сегмента линии выноски (используется при создании объектов MLeader).
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MLeaderStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!