Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AbstractViewPE.Target
 Послать отзыв
 Свойство Target представляет положение точки цели вида.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d Target;
Копировать Код
Public ReadOnly Property Target As Point3d
 Возвращает
 Возвращает положение точки цели вида. Тип Point3d.
 Описание
 Свойство Target представляет положение точки цели вида.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.AbstractViewPE, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!