Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Position3d.Position3d
 Послать отзыв
 Конструктор класса Position3d. Создает объект позиции в указанной 3D-точке.
 Синтаксис
C#
Visual Basic
Копировать Код
public Position3d( Point3d point );
Копировать Код
Public Sub New( point As Point3d )
 Параметры
 Параметры
 Описание
 point
 Входная точка, в которой создается объект позиции. Тип Point3d.
 Описание
 Конструктор класса Position3d. Создает объект позиции в указанной 3D-точке.
 Ссылки
 Teigha.Geometry.Position3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!