Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CoordinateSystem3d.IsEqualTo
 Послать отзыв
 Метод позволяет проверить, совпадает ли с данным объектом переданная в метод координатная система CoordinateSystem3d.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsEqualTo( CoordinateSystem3d a );
Копировать Код
Public Function IsEqualTo( a As CoordinateSystem3d ) As Boolean
 Параметры
 Параметры
 Описание
 a
 Входная система координат, которая сравнивается с данной. Тип CoordinateSystem3d.
 Возвращает
 Возвращает true, если переданная система координат a не является нулевой и имеет те же начальную точку и направляющие векторы осей X, Y и Z. В противном случае возвращает false.
 Описание
 Метод позволяет проверить, совпадает ли с данным объектом переданная в метод координатная система CoordinateSystem3d. Используется вызов метода CoordinateSystem3d.IsEqualTo(CoordinateSystem3d a, Tolerance tolerance) с точностью, равной Tolerance.Global.
 Ссылки
 Teigha.Geometry.CoordinateSystem3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!