Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DimAssoc.AddToPointRefReactor
 Послать отзыв
 Метод добавляет реактор между геометрией и связанным с ней ассоциативным размером для каждого фрагмента геометрии в опорных точках.
 Синтаксис
C#
Visual Basic
Копировать Код
public void AddToPointRefReactor();
Копировать Код
Public Sub AddToPointRefReactor()
 Описание
 Метод добавляет реактор между геометрией и связанным с ней ассоциативным размером для каждого фрагмента геометрии в опорных точках.
 Ссылки
 Teigha.DatabaseServices.DimAssoc, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!