Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство SymbolTable.Item
 Послать отзыв
 This is Item, a member of class SymbolTable.
 Синтаксис
C#
Visual Basic
public DatabaseServices::ObjectId Item;
Public Property Item() As DatabaseServices.ObjectId
 Ссылки
 Teigha.DatabaseServices.SymbolTable, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!