Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Helix.TurnSlope
 Послать отзыв
 Свойство возвращает угол наклона витков спирали.
 Синтаксис
C#
Visual Basic
Копировать Код
public double TurnSlope;
Копировать Код
Public ReadOnly Property TurnSlope As Double
 Возвращает
 Возвращает угол наклона витков спирали. Тип double.
 Описание
 Свойство возвращает угол наклона витков спирали.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Helix, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!