Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство RasterImage.IsClipped
 Послать отзыв
 Синтаксис
C#
Visual Basic
public bool IsClipped;
Public Property IsClipped() As bool
 Описание
 Возвращает признак того, что изображение является клипом.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.RasterImage, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!