Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.EllipticalArc2d.Set
 Послать отзыв
 Метод позволяет переопределить у данного объекта точку центра, оси и радиусы.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Set( Point2d center, Vector2d majorAxis, Vector2d minorAxis, double majorRadius, double minorRadius );
Копировать Код
Public Sub Set( center As Point2d, majorAxis As Vector2d, minorAxis As Vector2d, majorRadius As Double, minorRadius As Double )
 Параметры
 Параметры
 Описание
 center
 Центр эллипса. Тип Point2d.
 majorAxis
 Большая ось эллипса. Тип Vector2d.
 minorAxis
 Малая ось эллипса. Тип Vector2d.
 majorRadius
 Большой радиус эллипса. Тип double.
 minorRadius
 Малый радиус эллипса. Тип double.
 Описание
 Метод позволяет переопределить у данного объекта точку центра, большую и малую оси, большой и малый радиусы.
 Ссылки
 Teigha.Geometry.EllipticalArc2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!