Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeader.DoglegLength
 Послать отзыв
 Свойство представляет длину полки в данном объекте MLeader.
 Синтаксис
C#
Visual Basic
Копировать Код
public double DoglegLength;
Копировать Код
Public Property DoglegLength As Double
 Возвращает
 Возвращает длину полки. Тип double.
 Описание
 Свойство представляет длину полки в данном объекте MLeader.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MLeader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!