Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.AnnoAllVisible
 Послать отзыв
 Синтаксис
C#
Visual Basic
public bool AnnoAllVisible;
Public Property AnnoAllVisible() As bool
 Описание
 Возвращает или устанавливает текущее значение переменной базы данных ANNOALLVISIBLE.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!