Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор Line.Line ()
 Послать отзыв
 Синтаксис
C#
Visual Basic
public Line(IntPtr unmanagedObjPtr, bool autoDelete); public Line();
Public Sub New(unmanagedObjPtr As IntPtr, autoDelete As bool) Public Sub New()
 Описание
 Конструктор по умолчанию. Инициализирует объект с вектором нормали (0,0,1), начальной и конечными точками, равными (0,0,0) и шириной, равной 0.0. Все координаты задаются в WCS.
 Ссылки
 Teigha.DatabaseServices.Line, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!