Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ProxyObject.OriginalDxfName
 Послать отзыв
 Свойство OriginalDxfName представляет DXF-имя объекта, представленного данным прокси-объектом.
 Синтаксис
C#
Visual Basic
Копировать Код
public String OriginalDxfName;
Копировать Код
Public ReadOnly Property OriginalDxfName As String
 Возвращает
 Возвращает DXF-имя объекта. Тип String.
 Описание
 Свойство OriginalDxfName представляет DXF-имя объекта, представленного данным прокси-объектом.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.ProxyObject, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!