Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CircularArc2d.IsInside
 Послать отзыв
 Метод позволяет проверить, находится ли указанная точка в пределах полной окружности данной дуги.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsInside( Point2d point );
Копировать Код
Public Function IsInside( point As Point2d ) As Boolean
 Параметры
 Параметры
 Описание
 point
 Проверяемая 2D-точка. Тип Point2d.
 Возвращает
 Возвращает true, только если точка point располагается в пределах полной окружности данной дуги. В противном случае возвращает false.
 Описание
 Метод позволяет проверить, находится ли указанная точка в пределах полной окружности данной дуги.
 Ссылки
 Teigha.Geometry.CircularArc2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!