Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CircularArc3d.Create
 Послать отзыв
 Метод предназначен для создания объекта CircularArc3d на основе переданного указателя.
 Синтаксис
C#
Visual Basic
Копировать Код
public static CircularArc3d Create( IntPtr unmanagedPointer, bool autoDelete );
Копировать Код
Public Shared Function Create( unmanagedPointer As IntPtr, autoDelete As Boolean ) As CircularArc3d
 Параметры
 Параметры
 Описание
 unmanagedPointer
 Входной неуправляемый указатель на объект, на основе которого создается дуга CircularArc3d. Тип IntPtr.
 autoDelete
 Входной флаг, указывающий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.
 Возвращает
 Возвращает созданную дугу. Тип CircularArc3d.
 Описание
 Метод предназначен для создания объекта CircularArc3d на основе переданного указателя.
 Ссылки
 Teigha.Geometry.CircularArc3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!