Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBVisualStyle.InternalUseOnly
 Послать отзыв
 Свойство позволяет определить или указать, что данный объект предназначен только для внутреннего использования.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool InternalUseOnly;
Копировать Код
Public Property InternalUseOnly() As Boolean
 Возвращает
 Возвращает true, если объект предназначен только для внутреннего использования. В противном случае возвращает false.
 Описание
 Свойство позволяет определить или указать, что данный объект предназначен только для внутреннего использования.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.DBVisualStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!