Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GroundPlaneBackground.ColorSkyHorizon
 Послать отзыв
 Свойство предоставляет доступ к цвету неба на дальнем плане (ближе к горизонту).
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual EntityColor ColorSkyHorizon;
Копировать Код
Public Overridable Property ColorSkyHorizon As EntityColor
 Возвращает
 Возвращает цвет объекта. Тип EntityColor.
 Описание
 Свойство предоставляет доступ к цвету неба на дальнем плане (ближе к горизонту).
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.GroundPlaneBackground, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!