Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.TableStyle.SetGridLineWeight
 Послать отзыв
 Метод позволяет задать вес (толщину) линий для указанных типов линий сетки и типов строк.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetGridLineWeight( LineWeight lineWeight, int gridLineTypes, int rowTypes );
Копировать Код
Public Overridable Sub SetGridLineWeight( lineWeight As LineWeight, gridLineTypes As Integer, rowTypes As Integer )
 Параметры
 Параметры
 Описание
 lineWeight
 Новый вес (толщина) линий. Перечисление LineWeight.
 gridLineTypes
 Тип линий сетки (или логическая комбинация нескольких типов). Тип int. См. перечисление GridLineType.
 rowTypes
 Тип строк таблицы (или логическая комбинация нескольких типов). Тип int. См. перечисление RowType.
 Описание
 Метод позволяет задать вес (толщину) линий для указанных типов линий сетки и типов строк. Различные типы линий и типы строк можно комбинировать с помощью логического оператора OR.
 Ссылки
 Teigha.DatabaseServices.TableStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!