Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FileDependencyManager.GetEntry
 Послать отзыв
 Метод предоставляет запись FileDependencyInfo по её индексу в разделе .dwg списка файловых зависимостей. Дополнительно метод позволяет влиять на использование кешированных данных.
 Синтаксис
C#
Visual Basic
Копировать Код
public FileDependencyInfo GetEntry( int fdlIndex, bool useCachedInfo );
Копировать Код
Public Function GetEntry( fdlIndex As Integer, useCachedInfo As Boolean ) As FileDependencyInfo
 Параметры
 Параметры
 Описание
 fdlIndex
 Индекс записи в разделе .dwg списка файловых зависимостей. Тип int.
 useCachedInfo
 Флаг, который определяет, следует ли использовать кешированную информацию. Тип bool. В случае значения false, используется обновленная информация.
 Возвращает
 Возвращает найденную запись. Тип FileDependencyInfo.
 Описание
 Метод предоставляет запись FileDependencyInfo с указанным индексом в разделе .dwg списка файловых зависимостей. Аргумент useCachedInfo позволяет предписывать использование кеша.
 Ссылки
 Teigha.DatabaseServices.FileDependencyManager, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!