Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Cone.GetHeightAt
 Послать отзыв
 Метод позволяет вычислить высоту данного конуса, соответствующую указанному параметру на оси U.
 Синтаксис
C#
Visual Basic
Копировать Код
public double GetHeightAt( double parameter );
Копировать Код
Public Function GetHeightAt( parameter As Double ) As Double
 Параметры
 Параметры
 Описание
 parameter
 Параметр, определяющий положение точки на оси U данного конуса. Тип double.
 Возвращает
 Возвращает высоту этого конуса, соответствующую входному значению аргумента parameter. Тип double.
 Описание
 Метод позволяет вычислить высоту данного конуса, соответствующую указанному параметру на оси U.
 Ссылки
 Teigha.Geometry.Cone, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!