Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeaderStyle.DefaultMText
 Послать отзыв
 Свойство представляет текст по умолчанию для связанного многострочного текста.
 Синтаксис
C#
Visual Basic
Копировать Код
public MText DefaultMText;
Копировать Код
Public Property DefaultMText As MText
 Возвращает
 Возвращает текст по умолчанию. Тип MText.
 Описание
 Свойство представляет текст по умолчанию для связанного многострочного текста.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MLeaderStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!