Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FitData.KnotParam
 Послать отзыв
 Свойство возвращает метод узловой параметризации сплайна, который строится по определяющим точкам.
 Синтаксис
C#
Visual Basic
Копировать Код
public KnotParameterizationEnum KnotParam;
Копировать Код
Public ReadOnly Property KnotParam As KnotParameterizationEnum
 Возвращает
 Возвращает метод узловой параметризации сплайна как значение из перечисления KnotParameterizationEnum.
 Описание
 Свойство возвращает метод внутренней узловой параметризации сплайна, который строится по определяющим точкам.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.FitData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!