Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Curve.GetFirstDerivative
 Послать отзыв
 Метод предназначен для получения вектора первой производной кривой в точке, заданной параметром value.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual Vector3d GetFirstDerivative( double value );
Копировать Код
Public virtual Function GetFirstDerivative( value As double ) As Vector3d
 Параметры
 Параметры
 Описание
 value
 Входной параметр типа double для вычисления производной.
 Возвращает
 Метод возвращает экземпляр класса Vector3d, который представляет вектор первой производной кривой в точке, заданной параметром value.
 Описание
 Метод предназначен для получения вектора первой производной кривой в точке, заданной параметром value.
 Ссылки
 Teigha.DatabaseServices.Curve, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!