Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Viewport.Brightness
 Послать отзыв
 Свойство Brightness представляет значение яркости, которое влияет на относительную интенсивность освещения в данном видовом экране.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Brightness;
Копировать Код
Public Property Brightness As Double
 Возвращает
 Возвращает значение яркости. Тип double.
 Описание
 Свойство Brightness представляет значение яркости, которое влияет на относительную интенсивность освещения в данном видовом экране.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Viewport, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!