Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.RenderGlobal.Destination
 Послать отзыв
 Данное перечисление определяет доступные направления вывода для рендеринга.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum Destination { Window = 0, Viewport = 1 }
Копировать Код
Public Enum Destination Window = 0 Viewport = 1 End Enum
 Члены
 Члены
 Описание
 Window
 Значение: 0. Сформированное изображение выводится в отдельное окно.
 Viewport
 Значение: 1. Сформированное изображение выводится непосредственно в текущем видовом экране.
 Описание
 Данное перечисление определяет доступные направления вывода для рендеринга.
 Ваши комментарии по поводу этого топика: Послать отзыв!