Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Extents2d.IsEqualTo
 Послать отзыв
 Метод проверяет совпадение данного объекта с указанным объектом Extents2d в пределах заданного допуска.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsEqualTo( Extents2d a, Tolerance tolerance );
Копировать Код
Public Function IsEqualTo( a As Extents2d, tolerance As Tolerance ) As Boolean
 Параметры
 Параметры
 Описание
 a
 Проверяемый объект. Тип Extents2d.
 tolerance
 Геометрический допуск. Тип Tolerance.
 Возвращает
 Возвращает true, если минимальные и максимальные точки сравниваемых объектов совпадают в пределах допуска tolerance. В противном случае возвращает false.
 Описание
 Метод проверяет совпадение данного объекта с указанным объектом Extents2d в пределах заданного допуска.
 Ссылки
 Teigha.DatabaseServices.Extents2d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!