Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GeometryOverrule.IntersectWith
 Послать отзыв
 Метод находит точки пересечения двух объектов чертежа.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void IntersectWith( ref Entity entity, ref Entity ent, Intersect intType, ref Plane projPlane, ref Point3dCollection points, IntPtr thisGsMarker, IntPtr otherGsMarker );
Копировать Код
Public virtual Sub IntersectWith( ByRef entity As Entity, ByRef ent As Entity, intType As Intersect, ByRef projPlane As Plane, ByRef points As Point3dCollection, thisGsMarker As IntPtr, otherGsMarker As IntPtr )
 Параметры
 Параметры
 Описание
 entity
 Первый объект, экземпляр класса Entity,
 ent
 Второй объект, экземпляр класса Entity,
 intType
 Значение перечисления Teigha.DatabaseServices.Intersect, Plane projPlane : Плоскость проекции, экземпляр класса Plane,
 points
 Коллекция Point3dCollection точек пересечения,
 thisGsMarker
 Первый указатель IntPtr,
 otherGsMarker
 Второй указатель IntPtr.
 Описание
 Метод находит точки пересечения двух объектов чертежа.
 Ссылки
 Teigha.DatabaseServices.GeometryOverrule, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!