Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.OpenModeAttribute
 Послать отзыв
 Класс представляет атрибут, который сообщает об режиме открытия объекта.
 Иерархия классов
Teigha::DatabaseServices::OpenModeAttribute
 Синтаксис
C#
Visual Basic
Копировать Код
[AttributeUsage(AttributeTargets.Method, AllowMultiple = false, Inherited = true)] public sealed class OpenModeAttribute : Attribute
Копировать Код
<AttributeUsage(AttributeTargets.Method, AllowMultiple:=False, Inherited:=True)> Public NotInheritable Class OpenModeAttribute Inherits Attribute
 Описание
 Класс представляет атрибут, который сообщает об режиме открытия объекта. См. также OpenMode.
 Методы
 Конструкторы
 Имя
 Описание
 OpenModeAttribute
 Конструктор класса OpenModeAttribute.
 Топики
 Имя
 Описание
 OpenModeAttribute Свойства
 Ниже перечислены свойства класса OpenModeAttribute.
 Ссылки
 OpenModeAttribute Свойства, Методы, Топики, OpenModeAttribute Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!