Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GroundPlaneBackground.ColorGroundPlaneNear
 Послать отзыв
 Свойство предоставляет доступ к цвету фона на ближнем плане (ближе к наблюдателю).
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual EntityColor ColorGroundPlaneNear;
Копировать Код
Public Overridable Property ColorGroundPlaneNear As EntityColor
 Возвращает
 Возвращает цвет объекта. Тип EntityColor.
 Описание
 Свойство предоставляет доступ к цвету фона на ближнем плане (ближе к наблюдателю).
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.GroundPlaneBackground, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!