Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AttributeReference.SetAttributeFromBlock
 Послать отзыв
 Метод применяет указанное геометрическое преобразование к геометрическим данным атрибута для получения требуемого положения, размера и наклона, как это было бы сделано с помощью команды INSERT.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetAttributeFromBlock( Matrix3d blockTransform );
Копировать Код
Public Sub SetAttributeFromBlock( blockTransform As Matrix3d )
 Параметры
 Параметры
 Описание
 blockTransform
 Входная матрица геометрического преобразования блока. Тип Matrix3d.
 Описание
 Метод применяет указанное геометрическое преобразование blockTransform к геометрическим данным этого атрибута для получения требуемого положения, размера и наклона, как это было бы сделано с помощью команды INSERT. Остальные свойства атрибута не затрагиваются.
 Ссылки
 Teigha.DatabaseServices.AttributeReference, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!