Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.SetBackgroundColor
 Послать отзыв
 Метод задает цвет фона в указанной ячейке таблицы.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetBackgroundColor( int row, int col, ref Color color );
Копировать Код
Public virtual Sub SetBackgroundColor( row As Integer, col As Integer, ByRef color As Color )
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 col
 Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
 color
 Цвет фона. Тип Color.
 Описание
 Метод задает цвет фона в указанной ячейке таблицы.
 Замечания
 Для получения того же результата предпочтительнее использовать Table.Cells[row,column].BackgroundColor.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!