Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbCurve3d.NurbCurve3d
 Послать отзыв
 Конструктор класса NurbCurve3d. Создает NURBS кривую заданной степени с указанными узловым вектором и массивом управляющих вершин.
 Синтаксис
C#
Visual Basic
Копировать Код
public NurbCurve3d( int degree, ref KnotCollection knots, ref Point3dCollection controlPoints, bool periodic );
Копировать Код
Public Sub New( degree As Integer, ByRef knots As KnotCollection, ByRef controlPoints As Point3dCollection, periodic As Boolean )
 Параметры
 Параметры
 Описание
 degree
 Степень NURBS кривой. Тип int.
 knots
 Узловой вектор. Тип KnotCollection.
 controlPoints
 Коллекция управляющих вершин. Тип Point3dCollection.
 periodic
 Флаг, который определяет, следует ли создавать периодическую (и замкнутую) кривую. Тип bool.
 Описание
 Конструктор класса NurbCurve3d. Создает опционально замкнутую NURBS кривую заданной степени с указанными узловым вектором и массивом управляющих вершин.
 Замечания
 Более высокие значения степени обеспечивают более гибкую кривую. Например, степень 1 используется для определения линейного сегмента, степень 2 используется для определения NURBS окружностей и дуг (кривых постоянной кривизны) и т.д.
 Узловой вектор задает последовательность значений параметров, которая определяет, где и как управляющие вершины влияют на кривую. Узловой вектор делит параметрическое пространство на интервалы, обычно называемые узловыми интервалами. Последовательность значений в узлах должна быть неубывающей. Например, последовательность (0, 0, 0, 1, 2, 3, 3, 3) является допустимой, в то время как (0, 0, 2, 0, 3, 1, 3, 3) недопустима.
 Управляющие вершины определяют положение кривой и её форму. Количество управляющих вершин должно быть больше, либо равно (degree + 1).
 Если periodic имеет значение false, длина узлового вектора knots должна быть равна (controlPoints.length() + degree + 1). Если periodic имеет значение true, то длина узлового вектора должна быть равна длине массива controlPoints, а первая и последняя управляющие вершины должны совпадать.
 Ссылки
 Teigha.Geometry.NurbCurve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!