Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Plane.Plane
 Послать отзыв
 Конструктор класса Plane. Создает плоскость по трем точкам, которые определяют оси и начало координат плоскости.
 Синтаксис
C#
Visual Basic
Копировать Код
public Plane( Point3d u, Point3d origin, Point3d v );
Копировать Код
Public Sub New( u As Point3d, origin As Point3d, v As Point3d )
 Параметры
 Параметры
 Описание
 u
 Точка, определяющая направление оси uAxis. Тип Point3d.
 origin
 Точка, определяющая начало координат плоскости. Тип Point3d.
 v
 Точка, определяющая направление оси vAxis. Тип Point3d.
 Описание
 Конструктор класса Plane. Создает плоскость по трем точкам, которые определяют оси и начало координат плоскости.
 Замечания
 Направляющие векторы осей, определяемых точками u и v, обязаны быть неколлинеарными.
 Ссылки
 Teigha.Geometry.Plane, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!