Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DgnDefinition.setShowRasterRef
 Послать отзыв
 Свойство позволяет установить логический флаг, определяющий, следует ли отображать растровые изображения в файлах DGN, на которые имеются ссылки.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool SetShowRasterRef;
Копировать Код
Public Property SetShowRasterRef() As Boolean
 Возвращает
 Возвращает true, если требуется отображать растровые изображения. В противном случае возвращает false.
 Описание
 Свойство позволяет установить логический флаг, определяющий, следует ли отображать растровые изображения в файлах DGN, на которые имеются ссылки.
 Условия
 Только запись.
 Ссылки
 Teigha.DatabaseServices.DgnDefinition, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!