Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Field.SetData
 Послать отзыв
 Метод предоставляет возможность установить в этом поле данные с указанным ключом. Дополнительно возможно задать рекурсивную установку этих данных во всех дочерних полях.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetData( ref String key, ref Object data, bool recursive );
Копировать Код
Public Sub SetData( ByRef key As String, ByRef data As Object, recursive As Boolean )
 Параметры
 Параметры
 Описание
 key
 Ключ, с которым ассоциированы сохраняемые в поле данные. Тип String. Не может иметь значение null или быть пустой строкой.
 data
 Данные для поля. Тип Object.
 recursive
 Флаг, определяющий, следует ли рекурсивно устанавливать данные во всех дочерних полях. Тип bool. Значение true предписывает рекурсивный проход по всем дочерним полям.
 Описание
 Метод предоставляет возможность установить в этом поле данные с указанным ключом. Дополнительно возможно задать рекурсивную установку этих данных во всех дочерних полях.
 Ссылки
 Teigha.DatabaseServices.Field, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!