Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Polyline.Length
 Послать отзыв
 This is Length, a member of class Polyline.
 Синтаксис
C#
Visual Basic
public double Length;
Public Property Length() As Double
 Ссылки
 Teigha.DatabaseServices.Polyline, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!