Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CurveCurveIntersector2d.OverlapDirection
 Послать отзыв
 Свойство OverlapDirection позволяет проверить взаимную ориентацию кривых на участке их перекрытия.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool OverlapDirection;
Копировать Код
Public ReadOnly Property OverlapDirection As Boolean
 Возвращает
 Возвращает true, если две кривые ориентированы в одном направлении на участке их перекрытия. В случае противоположной ориентации перекрывающихся кривых возвращает значение false. Тип bool.
 Описание
 Свойство OverlapDirection позволяет проверить взаимную ориентацию кривых на участке их перекрытия.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.CurveCurveIntersector2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!