Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.HatchObjectType
 Послать отзыв
 Перечисление HatchObjectType определяет тип объекта, используемого для штриховки.
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdDbHatch.HatchObjectType")] public enum HatchObjectType { HatchObject = 0, GradientObject = 1 }
Копировать Код
<Wrapper("OdDbHatch.HatchObjectType")> Public Enum HatchObjectType HatchObject = 0 GradientObject = 1 End Enum
 Члены
 Члены
 Описание
 HatchObject
 Значение: 0. Штриховка выполнена с использованием объекта классической штриховки.
 GradientObject
 Значение: 1. Штриховка выполнена с использованием объекта цветового градиента.
 Описание
 Перечисление HatchObjectType определяет тип объекта, используемого для штриховки.
 Ваши комментарии по поводу этого топика: Послать отзыв!