Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DwgFiler.ReadInt32
 Послать отзыв
 Метод предназначен для получения значения Int32 из текущего элемента данного объекта Filer.
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract int ReadInt32();
Копировать Код
Public MustOverride Function ReadInt32() As Integer
 Возвращает
 Возвращает значение из текущего элемента данного объекта Filer. Тип int.
 Описание
 Метод предназначен для получения значения Int32 из текущего элемента данного объекта Filer.
 Ссылки
 Teigha.DatabaseServices.DwgFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!