Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.Dimzin
 Послать отзыв
 Свойство управляет подавлением нулей в значениях размеров, заданных в основных единицах измерения.
 Синтаксис
C#
Visual Basic
Копировать Код
public int Dimzin;
Копировать Код
Public Property Dimzin As Integer
 Возвращает
 Возвращает вариант подавления нулей в значениях размеров. Тип int.
 Описание
 Свойство управляет подавлением нулей в значениях размеров, заданных в основных единицах измерения.
 Возможны следующие варианты подавления:
 Значение
 Описание
 0
 Подавляются нулевые значения целых футов и дюймов.
 1
 Отображаются нулевые значения целых футов и дюймов.
 2
 Отображаются нули в футах и подавляются нули в дюймах.
 3
 Подавляются нули в футах и отображаются нули в дюймах.
 4
 Подавляются ведущие нули.
 8
 Подавляются замыкающие нули.
 12
 Подавляются как ведущие, так и замыкающие нули.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!