Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector3d./
 Послать отзыв
 Оператор реализует деление указанного 3D-вектора на заданный масштабный множитель.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d operator /( Vector3d a, double factor );
Копировать Код
Public Operator /( a As Vector3d, factor As Double )
 Параметры
 Параметры
 Описание
 a
 Входной вектор. Тип Vector3d.
 factor
 Входной скалярный множитель. Тип double.
 Возвращает
 Возвращает вектор, который получен делением 3D-вектора a на заданный масштабный множитель factor. Тип Vector3d.
 Описание
 Оператор реализует деление указанного 3D-вектора a на заданный масштабный множитель factor.
 Ссылки
 Teigha.Geometry.Vector3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!