Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.HostApplicationServices.UserBreak
 Послать отзыв
 Метод вызывается (обычно кодом базы данных), чтобы определить, ввел ли пользователь команду CTRL+C. В текущей версии метод не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual bool UserBreak();
Копировать Код
Public Overridable Function UserBreak() As Boolean
 Возвращает
 Возвращает true, если пользователь нажал CTRL+C. В противном случае возвращает false.
 Описание
 Метод вызывается (обычно кодом базы данных), чтобы определить, ввел ли пользователь команду CTRL+C. В текущей версии метод не реализован.
 Ссылки
 Teigha.DatabaseServices.HostApplicationServices, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!