Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Viewport.AmbientLightColor
 Послать отзыв
 Свойство AmbientLightColor представляет цвет рассеянного света в данном видовом экране.
 Синтаксис
C#
Visual Basic
Копировать Код
public Teigha.Colors.Color AmbientLightColor;
Копировать Код
Public Property AmbientLightColor As Teigha.Colors.Color
 Возвращает
 Возвращает цвет рассеянного света. Тип Teigha.Colors.Color.
 Описание
 Свойство AmbientLightColor представляет цвет рассеянного света в данном видовом экране.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Viewport, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!