Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Cell.Value
 Послать отзыв
 Свойство обеспечивает доступ к значению, хранимому в данной ячейке.
 Синтаксис
C#
Visual Basic
Копировать Код
public Object Value;
Копировать Код
Public Property Value As Object
 Возвращает
 Возвращает к значению, хранимому в данной ячейке. Тип Object.
 Описание
 Свойство обеспечивает доступ к значению, хранимому в данной ячейке.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Cell, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!