Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DictionaryWithDefaultDictionary
 Послать отзыв
 Данный класс представляет словарь, обладающий записью по умолчанию.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::GraphicsInterface::Drawable Teigha::DatabaseServices::DBObject Teigha::DatabaseServices::DBDictionary Teigha::DatabaseServices::DictionaryWithDefaultDictionary
 Синтаксис
C#
Visual Basic
Копировать Код
[DefaultMember("Item")] [Wrapper("AcDbDictionaryWithDefault")] public class DictionaryWithDefaultDictionary : DBDictionary;
Копировать Код
<DefaultMember("Item")> <Wrapper("AcDbDictionaryWithDefault")> Public Class DictionaryWithDefaultDictionary Inherits DBDictionary
 Описание
 Этот класс расширяет класс DBDictionary концепцией записи «по умолчанию». Каждый экземпляр этого класса включает элемент данных HardPointerId, в котором хранится идентификатор объекта одной из его записей. Этот идентификатор жесткого указателя определяет запись по умолчанию. Для доступа к нему предусмотрены соответствующие методы GetAt() и SetAt().
 Методы
 Конструкторы
 Teigha.GraphicsInterface.Drawable
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 Drawable
 Конструктор класса Teigha.GraphicsInterface.Drawable. (Унаследован от Drawable)
 Teigha.DatabaseServices.DBObject
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 DBObject
 Конструктор. (Унаследован от DBObject)
 Teigha.DatabaseServices.DBDictionary
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 DBDictionary
 Конструктор по умолчанию. (Унаследован от DBDictionary)
 Teigha.DatabaseServices.DictionaryWithDefaultDictionary
 Имя
 Описание
 DictionaryWithDefaultDictionary
 Это обзор перегрузок DictionaryWithDefaultDictionary.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.GraphicsInterface.Drawable
 Имя
 Описание
 Drawable Методы
 Ниже перечислены методы класса Drawable.
 Drawable Свойства
 Ниже перечислены свойства класса Drawable.
 Teigha.DatabaseServices.DBObject
 Имя
 Описание
 DBObject Методы
 Ниже перечислены методы класса DBObject.
 DBObject Свойства
 Ниже перечислены свойства класса DBObject.
 DBObject События
 Ниже перечислены события класса DBObject.
 Teigha.DatabaseServices.DBDictionary
 Имя
 Описание
 DBDictionary Методы
 Ниже перечислены методы класса DBDictionary.
 DBDictionary Свойства
 Ниже перечислены свойства класса DBDictionary.
 Teigha.DatabaseServices.DictionaryWithDefaultDictionary
 Имя
 Описание
 DictionaryWithDefaultDictionary Свойства
 Ниже перечислены свойства класса DictionaryWithDefaultDictionary.
 Ссылки
 DictionaryWithDefaultDictionary Конструктор, DictionaryWithDefaultDictionary Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства, DBObject События
 Ваши комментарии по поводу этого топика: Послать отзыв!