Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBVisualStyle.Name
 Послать отзыв
 Свойство предоставляет доступ к имени визуального стиля.
 Синтаксис
C#
Visual Basic
Копировать Код
public String Name;
Копировать Код
Public Property Name() As String
 Возвращает
 Возвращает имя стиля. Тип String.
 Описание
 Свойство предоставляет доступ к имени визуального стиля.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.DBVisualStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!