Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.ToleranceSuppressTrailingZeros
 Послать отзыв
 Свойство управляет подавлением замыкающих нулей в отклонениях размеров, выраженных в основных единицах.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool ToleranceSuppressTrailingZeros;
Копировать Код
Public Property ToleranceSuppressTrailingZeros As Boolean
 Возвращает
 Возвращает true, если подавление включено. В противном случае возвращает false.
 Описание
 Свойство позволяет включить или отключить подавление замыкающих нулей в отклонениях размеров, выраженных в основных единицах.
 Это свойство действует только в том случае, когда для свойства Dimtol установлено значение true.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!