Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SectionSettings.SetFaceTransparency
 Послать отзыв
 Метод позволяет задать значение прозрачности граней геометрии указанного типа.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetFaceTransparency( SectionType nSecType, SectionGeometry nGeometry, int nTransparency );
Копировать Код
Public Sub SetFaceTransparency( nSecType As SectionType, nGeometry As SectionGeometry, nTransparency As Integer )
 Параметры
 Параметры
 Описание
 nSecType
 Тип сечения. Перечисление SectionType.
 nGeometry
 Типы элементов геометрии сечения. Перечисление SectionGeometry.
 nTransparency
 Значение прозрачности граней геометрии указанного типа. Тип int.
 Описание
 Метод позволяет задать значение прозрачности граней геометрии указанного типа.
 Ссылки
 Teigha.DatabaseServices.SectionSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!