Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Torus.IsHollow
 Послать отзыв
 Свойство IsHollow позволяет проверить, что данный тор имеет форму с отверстием посередине.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsHollow;
Копировать Код
Public ReadOnly Property IsHollow As Boolean
 Возвращает
 Возвращает true, если большой радиус тора превышает его малый радиус, что приводит к образованию отверстия посередине тора. В противном случае возвращает false.
 Описание
 Свойство IsHollow позволяет проверить, что данный тор имеет форму с отверстием посередине. Такая форма означает, что большой радиус превышает малый радиус.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.Torus, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!