Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector2d.Y
 Послать отзыв
 Свойство Y представляет Y-координату данного вектора.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Y;
Копировать Код
Public ReadOnly Property Y As Double
 Возвращает
 Возвращает значение Y-координаты данного вектора. Тип double.
 Описание
 Свойство Y представляет значение Y-координаты данного вектора.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.Vector2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!