Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.SetFieldId
 Послать отзыв
 Метод позволяет задать идентификатор ObjectId поля для указанной ячейки.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetFieldId( int row, int col, DatabaseServices.ObjectId fieldId );
Копировать Код
Public virtual Sub SetFieldId( row As Integer, col As Integer, fieldId As DatabaseServices.ObjectId )
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 col
 Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
 fieldId
 Идентификатор ObjectId поля. Тип DatabaseServices.ObjectId.
 Описание
 Метод позволяет задать идентификатор ObjectId поля для указанной ячейки.
 Замечания
 Для получения того же результата предпочтительнее использовать Table.Cells[row,column].FieldId.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!