Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector3d.XAxis
 Послать отзыв
 Свойство возвращает направление оси X.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d XAxis;
Копировать Код
Public Property XAxis() As Vector3d
 Возвращает
 Возвращает направление оси X. Тип Vector3d.
 Описание
 Свойство возвращает направление оси X.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.Vector3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!