Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FormattedTableData.GetTextHeight
 Послать отзыв
 Метод предназначен для получения высоты текста в указанной ячейке.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual double GetTextHeight( int row, int column );
Копировать Код
Public Overridable Function GetTextHeight( row As Integer, column As Integer ) As Double
 Параметры
 Параметры
 Описание
 row
 Индекс строки. Тип int. Должен быть неотрицательным и меньше количества строк в таблице.
 column
 Индекс столбца. Тип int. Должен быть неотрицательным и меньше количества столбцов в таблице.
 Возвращает
 Возвращает высоту текста. Тип double.
 Описание
 Метод предназначен для получения высоты текста в указанной ячейке.
 Ссылки
 Teigha.DatabaseServices.FormattedTableData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!