Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MText.Ascent
 Послать отзыв
 Свойство возвращает высоту максимального верхнего выносного элемента для строчных букв первой строки этого объекта MText.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Ascent;
Копировать Код
Public ReadOnly Property Ascent As Double
 Возвращает
 Возвращает высоту максимального выносного элемента. Тип double.
 Описание
 Свойство возвращает высоту максимального верхнего выносного элемента для строчных букв первой строки этого объекта MText. Это часть строчной буквы, возвышающаяся над основной строкой, например, "b", "d", "k", "l", "h", "t".
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.MText, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!