Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LayoutManager.LayoutCopied
 Послать отзыв
 Cобытие создается после завершения копирования листа.
 Синтаксис
C#
Visual Basic
Копировать Код
public event LayoutCopiedEventHandler LayoutCopied;
Копировать Код
Public Event LayoutCopied As LayoutCopiedEventHandler
 Описание
 Cобытие создается после завершения копирования листа.
 Ссылки
 Teigha.DatabaseServices.LayoutManager, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!