Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocNetwork
 Послать отзыв
 Класс AssocNetwork представляет сеть ассоциативных действий AssocAction. Не реализован.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::GraphicsInterface::Drawable Teigha::DatabaseServices::DBObject Teigha::DatabaseServices::AssocAction Teigha::DatabaseServices::AssocNetwork
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("AcDbAssocNetwork")] public class AssocNetwork : AssocAction;
Копировать Код
<Wrapper("AcDbAssocNetwork")> Public Class AssocNetwork Inherits AssocAction
 Описание
 Класс AssocNetwork поддерживает сеть ассоциативных действий, представленных объектами AssocAction.
 Поскольку класс AssocNetwork является производным от класса AssocAction, его экземпляры ведут себя как отдельные ассоциативные действия. Как следствие, сеть в целом может быть связана с другими объектами ассоциативными зависимостями AssocDependency или принадлежать сети AssocNetwork более высокого уровня, что позволяет создавать иерархические ассоциативные структуры.
 Зависимости между действиями в сети AssocNetwork определяют характер ассоциативных взаимосвязей действий и объектов. Например, если одно действие изменяет объект (write), а другое действие этот объект использует (read), то второе действие оказывается зависимым от первого, и вычислять это второе действие необходимо только после вычисления первого.
 В настоящее время класс не реализован.
 Методы
 Конструкторы
 Teigha.GraphicsInterface.Drawable
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 Drawable
 Конструктор класса Teigha.GraphicsInterface.Drawable. (Унаследован от Drawable)
 Teigha.DatabaseServices.DBObject
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 DBObject
 Конструктор. (Унаследован от DBObject)
 Teigha.DatabaseServices.AssocAction
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 AssocAction
 Конструктор по умолчанию. (Унаследован от AssocAction)
 Teigha.DatabaseServices.AssocNetwork
 Имя
 Описание
 AssocNetwork
 Это обзор перегрузок AssocNetwork.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.GraphicsInterface.Drawable
 Имя
 Описание
 Drawable Методы
 Ниже перечислены методы класса Drawable.
 Drawable Свойства
 Ниже перечислены свойства класса Drawable.
 Teigha.DatabaseServices.DBObject
 Имя
 Описание
 DBObject Методы
 Ниже перечислены методы класса DBObject.
 DBObject Свойства
 Ниже перечислены свойства класса DBObject.
 DBObject События
 Ниже перечислены события класса DBObject.
 Teigha.DatabaseServices.AssocAction
 Имя
 Описание
 AssocAction Методы
 Ниже перечислены методы класса AssocAction.
 AssocAction Свойства
 Ниже перечислены свойства класса AssocAction.
 Ссылки
 AssocNetwork Конструктор, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства, DBObject События
 Ваши комментарии по поводу этого топика: Послать отзыв!