Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод RasterImageDef.Embed
 Послать отзыв
 Синтаксис
C#
Visual Basic
public void Embed();
Public Sub Embed()
 Описание
 Этот метод в настоящее время не используется, но может быть использован в будущем.
 Ссылки
 Teigha.DatabaseServices.RasterImageDef, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!