Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GeoLocationData.ScaleEstimationMethod
 Послать отзыв
 Свойство обеспечивает доступ к текущему методу оценки масштаба в данном объекте GeoLocationData.
 Синтаксис
C#
Visual Basic
Копировать Код
public Teigha.DatabaseServices.ScaleEstimationMethod ScaleEstimationMethod;
Копировать Код
Public Property ScaleEstimationMethod As Teigha.DatabaseServices.ScaleEstimationMethod
 Возвращает
 Возвращает метод оценки масштаба как значение из перечисления Teigha.DatabaseServices.ScaleEstimationMethod.
 Описание
 Свойство обеспечивает доступ к текущему методу оценки масштаба в данном объекте GeoLocationData.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.GeoLocationData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!