Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FileDependencyInfo.IsAffectsGraphics
 Послать отзыв
 Свойство IsAffectsGraphics позволяет проверить, влияет ли эта запись на вид экрана.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsAffectsGraphics;
Копировать Код
Public ReadOnly Property IsAffectsGraphics As Boolean
 Возвращает
 Возвращает true, если данный объект влияет на вид экрана. В противном случае возвращает false.
 Описание
 Свойство IsAffectsGraphics позволяет проверить, влияет ли эта запись на вид экрана.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.FileDependencyInfo, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!