Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FitData.TangentsExist
 Послать отзыв
 Свойство позволяет проверить, определены ли касательные на концах сплайна.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool TangentsExist;
Копировать Код
Public ReadOnly Property TangentsExist As Boolean
 Возвращает
 Возвращает true, если касательные на концах сплайна определены. В противном случае возвращает false.
 Описание
 Свойство позволяет проверить, определены ли касательные на концах сплайна.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.FitData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!