Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство RasterImageDef.SearchForActivePath
 Послать отзыв
 Синтаксис
C#
Visual Basic
public String SearchForActivePath;
Public Property SearchForActivePath() As String
 Описание
 Свойство осуществляет поиск на локальных устройствах и в сети корректного файла изображения, который соответствует имени исходного файла, который был сохранен в файле чертежа. Этот механизм позволяет файлам изображений размещаться отдельно на рабочей станции, которая используется для редактирования или просмотра файла чертежа. Пользователь может установить пути поиска файлов в проекте, которые содержат каталоги, в которых могут располагаться файлы изображений и внешних ссылок.
 Поиск корректных файлов изображений производится в определенном порядке. Сначала, исходное имя файла (путь устанавливается с помощью SourceFileName и сохраняется в чертеже) проверяется, как оно есть. Если файл не найден, то имя файла выделяется из пути.
 Условия
 Только на чтение Note Например, путь c:\images\picture1.bmp имеет имя файла picture1.bmp. Это имя файла ищется в каждой из группы каталогов, определенных в текущем проекте, в соответствии со стандартными путями nanoCAD.
 Порядок поиска следующий:
По имени файла, как оно определено в RasterImageDef.SourceFileName.
В каталогах текущего проекта.
В текущем каталоге.
В каталоге, в котором содержится текущий файл чертежа.
В каталогах, заданных переменными окружения nanoCAD (если они определены).
В каталоге, содержащем программы nanoCAD.
 Первое же найденное корректное имя файла изображения останавливает поиск. Если расширение в имени файла пропущено, то файлы с тем же самым основным именем (picture1, picture1.txt, picture1.exe, и т.д.), также проверяются на корректность, как файлы изображения.
 Ссылки
 Teigha.DatabaseServices.RasterImageDef, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!