Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.DimBlockId
 Послать отзыв
 Свойство задает или возвращает идентификатор ObjectId записи BlockTableRecord, связанной с данным размером.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.ObjectId DimBlockId;
Копировать Код
Public Property DimBlockId As DatabaseServices.ObjectId
 Возвращает
 Возвращает идентификатор блока. Тип DatabaseServices.ObjectId.
 Описание
 Свойство задает или возвращает идентификатор ObjectId записи BlockTableRecord, связанной с данным размером.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!