Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Cylinder.Cylinder
 Послать отзыв
 Конструктор класса Cylinder. Создает экземпляр класса с указанными осью цилиндра, началом координат, радиусом, высотой, направлением отсчета углов, начальным и конечным углами.
 Синтаксис
C#
Visual Basic
Копировать Код
public Cylinder( double radius, Point3d origin, Vector3d axisOfSymmetry, Vector3d referenceAxis, ref Interval height, double startAngle, double endAngle );
Копировать Код
Public Sub New( radius As Double, origin As Point3d, axisOfSymmetry As Vector3d, referenceAxis As Vector3d, ByRef height As Interval, startAngle As Double, endAngle As Double )
 Параметры
 Параметры
 Описание
 radius
 Радиус цилиндра. Тип double.
 origin
 Точка на оси цилиндра в качестве начала координат. Тип Point3d.
 axisOfSymmetry
 Ось цилиндра. Тип Vector3d.
 referenceAxis
 Направление отсчета углов. Тип Vector3d.
 height
 Высота цилиндра. Тип Interval.
 startAngle
 Начальный угол. Тип double.
 endAngle
 Конечный угол. Тип double.
 Описание
 Конструктор класса Cylinder. Создает экземпляр класса с указанными осью цилиндра, началом координат, радиусом, высотой, направлением отсчета углов, начальным и конечным углами.
 Ссылки
 Teigha.Geometry.Cylinder, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!