Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GraphNodeCollection.IndexOf
 Послать отзыв
 Метод позволяет получить индекс элемента коллекции, который соответствует указанному объекту GraphNode.
 Синтаксис
C#
Visual Basic
Копировать Код
public int IndexOf( ref GraphNode value );
Копировать Код
Public Function IndexOf( ByRef value As GraphNode ) As Integer
 Параметры
 Параметры
 Описание
 value
 Объект типа GraphNode, для которого предполагается найти индекс.
 Возвращает
 Возвращает индекс элемента коллекции, если объект value найден. В противном случае возвращает -1. Тип int. Индексирование элементов коллекции начинается с нуля.
 Описание
 Метод позволяет получить индекс элемента коллекции, который соответствует указанному объекту GraphNode.
 Ссылки
 Teigha.DatabaseServices.GraphNodeCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!