Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PolyMeshType
 Послать отзыв
 Перечисление PolyMeshType определяет поддерживаемые типы полигональных сетей.
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdDb.PolyMeshType")] public enum PolyMeshType { SimpleMesh = 0, QuadSurfaceMesh = 5, CubicSurfaceMesh = 6, BezierSurfaceMesh = 8 }
Копировать Код
<Wrapper("OdDb.PolyMeshType")> Public Enum PolyMeshType SimpleMesh = 0 QuadSurfaceMesh = 5 CubicSurfaceMesh = 6 BezierSurfaceMesh = 8 End Enum
 Члены
 Члены
 Описание
 BezierSurfaceMesh
 Значение: 8. Полигональная сеть для аппроксимации поверхностью Безье.
 CubicSurfaceMesh
 Значение: 6. Полигональная сеть для аппроксимации кубической B-сплайновой поверхностью.
 QuadSurfaceMesh
 Значение: 5. Полигональная сеть для аппроксимации квадратичной B-сплайновой поверхностью.
 SimpleMesh
 Значение: 0. Простая сеть без аппроксимации или сглаживания поверхности.
 Описание
 Перечисление PolyMeshType определяет поддерживаемые типы полигональных сетей.
 Ваши комментарии по поводу этого топика: Послать отзыв!