Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AbstractViewTableRecord.ViewOrthographic
 Послать отзыв
 Свойство ViewOrthographic представляет используемый тип ортогонального вида.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.OrthographicView ViewOrthographic;
Копировать Код
Public ReadOnly Property ViewOrthographic As DatabaseServices.OrthographicView
 Возвращает
 Возвращает тип ортогонального вида. Перечисление DatabaseServices.OrthographicView.
 Описание
 Свойство ViewOrthographic представляет используемый тип ортогонального вида, связывающий положения камеры вида и целевой точки вида.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.AbstractViewTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!