Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LinkedTableData.GetDataFormat
 Послать отзыв
 Метод позволяет получить формат данных в указанной ячейке.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual String GetDataFormat( int row, int column );
Копировать Код
Public Overridable Function GetDataFormat( row As Integer, column As Integer ) As String
 Параметры
 Параметры
 Описание
 row
 Индекс строки. Тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 column
 Индекс столбца. Тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице.
 Возвращает
 Возвращает формат данных. Тип String.
 Описание
 Метод позволяет получить формат данных в указанной ячейке.
 Ссылки
 Teigha.DatabaseServices.LinkedTableData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!