Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 BlockTableRecord.IsDynamicBlock
 Послать отзыв
 Свойство показывает, является ли данный блок динамическим.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsDynamicBlock { get; }
Копировать Код
Public ReadOnly Property IsDynamicBlock As Boolean
 Возвращает
 Возвращает тип данных bool:
true - блок является динамическим.
false - блок статический.
 Описание
 Свойство показывает, является ли данное определение блока динамическим.
 Динамические блоки, в отличие от статических, содержат в себе правила и ограничения, управляющие внешним видом и поведением блока при его вставке в чертеж.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.BlockTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!