Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Torus.IsApple
 Послать отзыв
 Свойство IsApple позволяет проверить, имеет ли данный тор форму "яблока", когда большой радиус меньше малого радиуса, но больше нуля, что дает тело с углублением посередине.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsApple;
Копировать Код
Public ReadOnly Property IsApple As Boolean
 Возвращает
 Возвращает true, если данный тор имеет форму "яблока" с углублением посередине. В противном случае возвращает false.
 Описание
 Свойство IsApple позволяет проверить, имеет ли данный тор форму "яблока", когда большой радиус меньше малого радиуса, но больше нуля, что дает тело с углублением посередине.
 Замечания
 Только одно из свойств IsLemon, IsApple, IsVortex и IsDoughnut всякого конкретного тора может возвращать значение true.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.Torus, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!