Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MeshDataCollection.MeshDataCollection
 Послать отзыв
 Конструктор структуры MeshDataCollection.
 Синтаксис
C#
Visual Basic
Копировать Код
public MeshDataCollection( ref Point3dCollection pts, ref Int32Collection faces, ref EntityColorCollection colors, ref ObjectIdCollection materialIds );
Копировать Код
Public Sub New( ByRef pts As Point3dCollection, ByRef faces As Int32Collection, ByRef colors As EntityColorCollection, ByRef materialIds As ObjectIdCollection )
 Параметры
 Параметры
 Описание
 pts
 Массив вершин сети. Тип Point3dCollection.
 faces
 Массив граней сети. Тип Int32Collection.
 colors
 Массив цветов граней. Тип EntityColorCollection.
 materialIds
 Массив идентификаторов материалов. Тип ObjectIdCollection.
 Описание
 Конструктор структуры MeshDataCollection.
 Ссылки
 Teigha.DatabaseServices.MeshDataCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!