Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Entity.CompoundObjectTransform
 Послать отзыв
 Свойство предназначено для получения матрицы преобразования, применяемой к внутренним объектам составного геометрического объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public Matrix3d CompoundObjectTransform;
Копировать Код
Public Property CompoundObjectTransform() As Matrix3d
 Возвращает
 Возвращает значение типа Matrix3d, представляющее собой трехмерную матрицу преобразования (включая смещение, поворот и масштабирование), используемую для корректного позиционирования и ориентации внутренних объектов внутри составного объекта.
 Описание
 Свойство предназначено для получения матрицы преобразования, применяемой к внутренним объектам составного геометрического объекта.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.Entity, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!