Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbCurve3dData
 Послать отзыв
 Структура NurbCurve3dData предназначена для хранения данных, которые определяют объект NurbCurve3d.
 Иерархия классов
Teigha::Geometry::NurbCurve3dData
 Синтаксис
C#
Visual Basic
Копировать Код
public struct NurbCurve3dData
Копировать Код
Public Structure NurbCurve3dData
 Описание
 Структура NurbCurve3dData предназначена для хранения данных, которые определяют объект NurbCurve3d.
 Замечания
 Если сплайн NurbCurve3d является периодическим, длина узлового вектора будет больше длины массива управляющих вершин на 1. В противном случае длина узлового вектора будет на degree + 1 больше длины массива управляющих вершин.
 Топики
 Имя
 Описание
 NurbCurve3dData Методы
 Ниже перечислены методы класса NurbCurve3dData.
 NurbCurve3dData Операторы
 Ниже перечислены операторы класса NurbCurve3dData.
 NurbCurve3dData Свойства
 Ниже перечислены свойства класса NurbCurve3dData.
 Ссылки
 NurbCurve3dData Методы, NurbCurve3dData Операторы, NurbCurve3dData Свойства, Топики, NurbCurve3dData Методы, NurbCurve3dData Операторы, NurbCurve3dData Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!