Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Surface.IsClosedInV
 Послать отзыв
 Метод позволяет проверить, является ли данная поверхность замкнутой в направлении V.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsClosedInV();
Копировать Код
Public Function IsClosedInV() As Boolean
 Возвращает
 Возвращает true, если в пределах точности Tolerance.Global данную поверхность можно считать замкнутой в направлении V. В противном случае возвращает false.
 Описание
 Метод позволяет проверить, является ли данная поверхность замкнутой в направлении V. Предполагает реализацию в производных классах.
 Замечания
 Используется вызов метода Surface.IsClosedInV(Tolerance tolerance) с точностью по умолчанию Tolerance.Global.
 Ссылки
 Teigha.Geometry.Surface, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!