Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.TableStyle.Alignment
 Послать отзыв
 Метод позволяет определить тип выравнивания содержимого в ячейках строк указанного типа.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual CellAlignment Alignment( RowType rowType );
Копировать Код
Public Overridable Function Alignment( rowType As RowType ) As CellAlignment
 Параметры
 Параметры
 Описание
 rowType
 Тип строки. Перечисление RowType.
 Возвращает
 Возвращает тип выравнивания содержимого в ячейках. Перечисление CellAlignment.
 Описание
 Метод позволяет определить тип выравнивания содержимого в ячейках строк указанного типа.
 Ссылки
 Teigha.DatabaseServices.TableStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!