Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Solid3d.Slice
 Послать отзыв
 Метод разрезает твердое тело указанной поверхностью и преобразует исходное твердое тело в часть, оставшуюся со стороны от режущей поверхности с положительным направлением нормали. Дополнительно метод позволяет получить в виде твердого тела и "отрицательную" половину исходного 3D-тела.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual Solid3d Slice( ref DatabaseServices.Surface surface, bool negativeHalfToo );
Копировать Код
Public Overridable Function Slice( ByRef surface As DatabaseServices.Surface, negativeHalfToo As Boolean ) As Solid3d
 Параметры
 Параметры
 Описание
 surface
 Режущая поверхность. Тип DatabaseServices.Surface.
 negativeHalfToo
 Флаг, определяющий, должна ли другая ("отрицательная") часть исходного тела создаваться как отдельное тело. Тип bool.
 Возвращает
 Возвращает созданное твердое тело, представляющее "отрицательную" половину исходного 3D-тела. Тип Solid3d.
 Описание
 Метод разрезает твердое тело указанной поверхностью и преобразует исходное твердое тело в часть, оставшуюся со стороны от режущей поверхности с положительным направлением нормали. Дополнительно метод позволяет получить в виде твердого тела и "отрицательную" половину исходного 3D-тела.
 Этот метод реализован только в среде пространственного моделирования.
 Ссылки
 Teigha.DatabaseServices.Solid3d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!