Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.ExternalBoundedSurface.IsTorus
 Послать отзыв
 Свойство IsTorus позволяет проверить, является ли неограниченная базовая поверхность данного объекта тором.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsTorus;
Копировать Код
Public ReadOnly Property IsTorus As Boolean
 Возвращает
 Возвращает true, если базовая поверхность данного объекта является тором. В противном случае возвращает false.
 Описание
 Свойство IsTorus определяет тип неограниченной базовой поверхности данного объекта и возвращает true, если она является тором.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.ExternalBoundedSurface, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!