Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Событие Database.ObjectErased
 Послать отзыв
 Синтаксис
C#
Visual Basic
public event ObjectErasedEventHandler ObjectErased;
Public Event ObjectErased As ObjectErasedEventHandler
 Описание
 Событие показывает, что объект в базе данных начал вычищаться или его очистка отменяется.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!