Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GlyphDisplayType
 Послать отзыв
 Данное перечисление определяет типы отображения глифов.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum GlyphDisplayType { GlyphDisplayAuto = 0, GlyphDisplayOff = 2, GlyphDisplayOn = 1 }
Копировать Код
Public Enum GlyphDisplayType GlyphDisplayAuto = 0 GlyphDisplayOff = 2 GlyphDisplayOn = 1 End Enum
 Члены
 Члены
 Описание
 GlyphDisplayAuto
 Значение: 0. Автоматическая настройка отображения глифов.
 GlyphDisplayOn
 Значение: 1. Отображение глифов включено.
 GlyphDisplayOff
 Значение: 2. Отображение глифов отключено.
 Описание
 Данное перечисление определяет типы отображения глифов.
 Ваши комментарии по поводу этого топика: Послать отзыв!