Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Graph.AddNode
 Послать отзыв
 Метод предназначен для добавления в данный граф нового узла GraphNode.
 Синтаксис
C#
Visual Basic
Копировать Код
public void AddNode( ref GraphNode nodeToAdd );
Копировать Код
Public Sub AddNode( ByRef nodeToAdd As GraphNode )
 Параметры
 Параметры
 Описание
 nodeToAdd
 Добавляемый узел. Тип GraphNode.
 Описание
 Метод предназначен для добавления нового узла nodeToAdd в данный объект Graph. Работа метода завершается ошибкой eInvalidOwnerObject, если узел nodeToAdd уже имеет владельца (т.е. уже является узлом другого графа).
 Ссылки
 Teigha.DatabaseServices.Graph, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!