Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DxfFiler.WriteDouble
 Послать отзыв
 Метод записывает в данный объект Filer указанное действительное значение с заданной точностью.
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract void WriteDouble( DxfCode opCode, double value, int precision );
Копировать Код
Public MustOverride Sub WriteDouble( opCode As DxfCode, value As Double, precision As Integer )
 Параметры
 Параметры
 Описание
 opCode
 Групповой код DXF. Тип DxfCode.
 value
 Значение, которое следует записать. Тип double.
 precision
 Количество десятичных знаков после разделителя в диапазоне от 0 до 16. Тип int.
 Описание
 Метод записывает в данный объект Filer групповой код DXF, указанное действительное значение и желаемую точность представления.
 Ссылки
 Teigha.DatabaseServices.DxfFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!