Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbCurve3dFitData.TangentsExist
 Послать отзыв
 Свойство TangentsExist позволяет проверить существование данных о касательных.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool TangentsExist;
Копировать Код
Public ReadOnly Property TangentsExist As Boolean
 Возвращает
 Возвращает true, если данные о касательных присутствуют. В противном случае возвращает false.
 Описание
 Свойство TangentsExist позволяет проверить существование данных о касательных.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.NurbCurve3dFitData, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!