Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Surface.ImprintEntity
 Послать отзыв
 Метод позволяет построить пересечение указанного объекта с данной поверхностью и добавить в неё новую фасетную грань путем клеймения.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void ImprintEntity( ref Entity entityToImprint );
Копировать Код
Public Overridable Sub ImprintEntity( ByRef entityToImprint As Entity )
 Параметры
 Параметры
 Описание
 entityToImprint
 Объект для клеймения на данном твердом теле. Тип Entity.
 Описание
 Метод позволяет построить пересечение указанного объекта entity с данной поверхностью и добавить в неё новую фасетную грань путем клеймения.
 В случае образования замкнутого контура ребер создается новая грань. В случае создания незамкнутого контура ребер его можно добавить в виде выступа к существующему контуру ребер на грани или как разрез на грани.
 Типы объектов, клеймение которых на поверхности поддерживается данным методом:
Curve,
Solid3d,
Surface,
Body,
Region,
Trace,
Solid.
Face.
 Замечания
 Данный метод реализован только в среде пространственного моделирования Spatial Modeler.
 Ссылки
 Teigha.DatabaseServices.Surface, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!