Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.TableHitTestInfo.ToString
 Послать отзыв
 Метод позволяет получить эквивалентное строковое представление данного объекта, которое учитывает указанные языковые и региональные настройки.
 Синтаксис
C#
Visual Basic
Копировать Код
public String ToString( ref IFormatProvider provider );
Копировать Код
Public Function ToString( ByRef provider As IFormatProvider ) As String
 Параметры
 Параметры
 Описание
 provider
 Провайдер языковых и региональных настроек. Тип IFormatProvider.
 Возвращает
 Возвращает строковое представление данного объекта, учитывающее предписанные языковые и региональные настройки. Тип String. Строка содержит индексы строки и столбца таблицы.
 Описание
 Метод позволяет получить эквивалентное строковое представление данного объекта, которое учитывает указанные языковые и региональные настройки.
 Ссылки
 Teigha.DatabaseServices.TableHitTestInfo, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!