Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.Dimblk1s
 Послать отзыв
 Свойство задает или возвращает имя блока, используемого для отображения стрелки на первом конце размерной линии.
 Синтаксис
C#
Visual Basic
Копировать Код
public String Dimblk1s;
Копировать Код
Public Property Dimblk1s As String
 Возвращает
 Возвращает имя блока. Тип String.
 Описание
 Свойство задает или возвращает имя блока, используемого для отображения стрелки на первом конце размерной линии.
 Допустимы следующие имена:
 Значение
 Описание
 "None"
 Отсутствует.
 "Closed"
 Закрытая.
 "Dot"
 Точка.
 "ClosedBlank"
 Контурная замкнутая.
 "Oblique"
 Засечка.
 "ArchTick"
 Двойная засечка.
 "Open"
 Разомкнутая.
 "Origin"
 Указатель исходной точки.
 "Origin2"
 Указатель исходной точки 2.
 "Open90"
 Разомкнутая 90 градусов (прямой угол).
 "Open30"
 Разомкнутая 30 градусов.
 "DotBlank"
 Контурная точка.
 "DotSmall"
 Малая точка.
 "BoxFilled"
 Заполненный прямоугольник.
 "BoxBlank"
 Прямоугольник.
 "DatumFilled"
 Заполненный треугольник базы отсчета.
 "DatumBlank"
 Треугольник базы отсчета.
 "Integral"
 Интеграл.
 "Small"
 Контурная малая точка.
 Свойство работает, если в свойстве Dimsah установлено значение true. В противном случае тип стрелок определяется свойством Dimblks.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!