Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GeoLocationData.CoordinateProjectionRadius
 Послать отзыв
 Свойство предоставляет доступ к значению радиуса кривизны эллипсоида вращения, который используется в алгоритме коррекции высоты над уровнем моря.
 Синтаксис
C#
Visual Basic
Копировать Код
public double CoordinateProjectionRadius;
Копировать Код
Public Property CoordinateProjectionRadius As Double
 Возвращает
 Возвращает радиус кривизны эллипсоида вращения. Тип double. Измеряется в метрах.
 Описание
 Свойство предоставляет доступ к значению радиуса кривизны эллипсоида вращения, который используется в алгоритме коррекции высоты над уровнем моря.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.GeoLocationData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!