Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AttributeReference.LockPositionInBlock
 Послать отзыв
 Свойство предоставляет доступ к флагу, который определяет фиксированность относительного положения в блоке объекта AttributeReference.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool LockPositionInBlock;
Копировать Код
Public Property LockPositionInBlock() As Boolean
 Возвращает
 Возвращает true, если объект AttributeReference не может смещаться относительно геометрии. В противном случае возвращает false.
 Описание
 Свойство предоставляет доступ к флагу, который определяет фиксированность относительного положения в блоке объекта AttributeReference.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.AttributeReference, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!