Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Runtime.DynamicLinker
 Послать отзыв
 Класс DynamicLinker представляет объект динамического компоновщика.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::Runtime::DynamicLinker
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("AcRxDynamicLinker")] public sealed class DynamicLinker : RXObject
Копировать Код
<Wrapper("AcRxDynamicLinker")> Public NotInheritable Class DynamicLinker Inherits RXObject
 Описание
 Класс DynamicLinker представляет объект динамического компоновщика.
 Существует один и только один объект класса DynamicLinker. Для платформы nanoCAD он является глобальным, а для приложений .NET API nanoCAD - неинстанцируемым.
 Замечания
 Объект этого класса решает следующие задачи:
Получает адрес службы, зарегистрированной по имени.
Загружает и инициализирует список приложений типа .NET API nanoCAD.
Загружает и инициализирует один модуль типа .NET API nanoCAD.
Регистрирует именованную службу в реестре служб.
Добавляет реактор уведомлений в цепочку реакторов динамического компоновщика.
Удаляет реактор уведомлений из цепочки реакторов динамического компоновщика.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.Runtime.DynamicLinker
 Имя
 Описание
 DynamicLinker Методы
 Ниже перечислены методы класса DynamicLinker.
 DynamicLinker Свойства
 Ниже перечислены свойства класса DynamicLinker.
 DynamicLinker События
 Ниже перечислены события класса DynamicLinker.
 Ссылки
 DynamicLinker Методы, DynamicLinker Свойства, DynamicLinker События, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства, DynamicLinker События
 Ваши комментарии по поводу этого топика: Послать отзыв!