Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Section.AddVertex
 Послать отзыв
 Метод позволяет добавить в плоскость сечения новую вершину.
 Синтаксис
C#
Visual Basic
Копировать Код
public void AddVertex( int nInsertAt, Point3d pt );
Копировать Код
Public Sub AddVertex( nInsertAt As Integer, pt As Point3d )
 Параметры
 Параметры
 Описание
 nInsertAt
 Индекс, по которому добавляется новая вершина. Тип int.
 pt
 Координаты добавляемой вершины. Тип Point3d.
 Описание
 Метод позволяет добавить в плоскость сечения новую вершину.
 Чтобы новая вершина была добавлена после последней вершины, аргумент nInsertAt должен быть меньше нуля или равен или больше общего количества вершин.
 Ссылки
 Teigha.DatabaseServices.Section, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!