Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.PsolHeight
 Послать отзыв
 Синтаксис
C#
Visual Basic
public double PsolHeight;
Public Property PsolHeight() As Double
 Описание
 Возвращает или устанавливает текущее значение PSOLHEIGHT для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!