Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Database.SaveAs (StreamBuf^, SaveType, DwgVersion, bool, int)
 Послать отзыв
 This is SaveAs, a member of class Database.
 Синтаксис
C#
Visual Basic
[Category("For Teigha only")] public void SaveAs(ref StreamBuf fileBuf, SaveType st, DwgVersion version, bool saveThumbnailImage, int dxfPrecision);
<Category("For Teigha only")> Public Sub SaveAs(ByRef fileBuf As StreamBuf, st As SaveType, version As DwgVersion, saveThumbnailImage As bool, dxfPrecision As Integer)
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!