Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DxfFiler.ReadBoolean
 Послать отзыв
 Метод возвращает логическое значение из текущего элемента этого объекта Filer.
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract bool ReadBoolean();
Копировать Код
Public MustOverride Function ReadBoolean() As Boolean
 Возвращает
 Возвращает логическое значение. Тип bool.
 Описание
 Метод возвращает логическое значение из текущего элемента этого объекта Filer.
 Ссылки
 Teigha.DatabaseServices.DxfFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!