Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Torus.Torus
 Послать отзыв
 Конструктор класса Torus. Создает экземпляр класса с указанными параметрами.
 Синтаксис
C#
Visual Basic
Копировать Код
public Torus( double majorRadius, double minorRadius, Point3d origin, Vector3d axisOfSymmetry, Vector3d referenceAxis, double startAngleU, double endAngleU, double startAngleV, double endAngleV );
Копировать Код
Public Sub New( majorRadius As Double, minorRadius As Double, origin As Point3d, axisOfSymmetry As Vector3d, referenceAxis As Vector3d, startAngleU As Double, endAngleU As Double, startAngleV As Double, endAngleV As Double )
 Параметры
 Параметры
 Описание
 majorRadius
 Большой радиус тора (радиус направляющей окружности тора). Тип double.
 minorRadius
 Малый радиус тора (радиус образующей окружности тора). Тип double.
 origin
 Точка центра тора (начало координат тора). Тип Point3d.
 axisOfSymmetry
 Ось симметрии тора (ось вращения тора). Тип Vector3d.
 referenceAxis
 Вектор, определяющий начало отсчета угла поворота образующей окружности тора. Тип Vector3d.
 startAngleU
 Нижняя граница интервала параметра U. Начальный угол относительно оси симметрии тора. Тип double.
 endAngleU
 Верхняя граница интервала параметра U. Конечный угол относительно оси симметрии тора. Тип double.
 startAngleV
 Нижняя граница интервала параметра V. Начальный угол относительно трубы тора. Тип double.
 endAngleV
 Верхняя граница интервала параметра V. Конечный угол относительно трубы тора. Тип double.
 Описание
 Конструктор класса Torus. Создает экземпляр класса с указанными параметрами.
 Замечания
 Все углы задаются в радианах.
 Ссылки
 Teigha.Geometry.Torus, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!