Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Polyline.MinimizeMemory
 Послать отзыв
 Синтаксис
C#
Visual Basic
public void MinimizeMemory();
Public Sub MinimizeMemory()
 Описание
 Этот метод оптимизирует использование памяти полилинией. Этот процесс может занимать некоторое время и не должен быть применен до того, как все изменения полилинии в сессии будут сделаны.
 Ссылки
 Teigha.DatabaseServices.Polyline, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!