Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FormatOption
 Послать отзыв
 Данное перечисление определяет опции форматирования значений.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum FormatOption { ForEditing = 1, ForExpression = 2, FormatOptionNone = 0, IgnoreMtextFormat = 8, UseMaximumPrecision = 4 }
Копировать Код
Public Enum FormatOption ForEditing = 1 ForExpression = 2 FormatOptionNone = 0 IgnoreMtextFormat = 8 UseMaximumPrecision = 4 End Enum
 Члены
 Члены
 Описание
 FormatOptionNone
 Значение: 0. Опции форматирования отсутствуют.
 ForEditing
 Значение: 1. Для редактирования.
 ForExpression
 Значение: 2. Для выражения.
 IgnoreMtextFormat
 Значение: 8. Игнорировать формат объекта многострочного текста Mtext.
 UseMaximumPrecision
 Значение: 4. Использовать представление с максимальной точностью.
 Описание
 Данное перечисление определяет опции форматирования значений.
 Ваши комментарии по поводу этого топика: Послать отзыв!