Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.BeginInsertEventArgs
 Послать отзыв
 Класс представляет данные для события BeginInsert базы данных.
 Иерархия классов
Teigha::DatabaseServices::BeginInsertEventArgs
 Синтаксис
C#
Visual Basic
Копировать Код
public class BeginInsertEventArgs : EventArgs;
Копировать Код
Public Class BeginInsertEventArgs Inherits EventArgs
 Описание
 Этот класс представляет данные для события BeginInsert базы данных.
 Методы
 Конструкторы
 ПоказатьInternal
 Нет совпадений по текущему фильтру
 Имя
 Описание
 BeginInsertEventArgs
 This is BeginInsertEventArgs, a member of class BeginInsertEventArgs.
 Топики
 Имя
 Описание
 BeginInsertEventArgs Свойства
 Ниже перечислены свойства класса BeginInsertEventArgs.
 Ссылки
 BeginInsertEventArgs Свойства, Методы, Топики, BeginInsertEventArgs Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!