Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.PointEntity2d.Point
 Послать отзыв
 Свойство Point представляет двумерные координаты данного объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point2d Point;
Копировать Код
Public ReadOnly Property Point As Point2d
 Возвращает
 Возвращает двумерные координаты точки. Тип Point2d.
 Описание
 Свойство Point представляет двумерные координаты данного объекта.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.PointEntity2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!