Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SectionSettings.Color
 Послать отзыв
 Метод позволяет получить цвет указанной геометрии сечения.
 Синтаксис
C#
Visual Basic
Копировать Код
public Teigha.Colors.Color Color( SectionType nSecType, SectionGeometry nGeometry );
Копировать Код
Public Function Color( nSecType As SectionType, nGeometry As SectionGeometry ) As Teigha.Colors.Color
 Параметры
 Параметры
 Описание
 nSecType
 Входной тип создаваемого сечения. Перечисление SectionType.
 nGeometry
 Входной тип геометрии сечения. Перечисление SectionGeometry.
 Возвращает
 Возвращает экземпляр класса Teigha.Colors.Color, который представляет настройки цвета указанной геометрии.
 Описание
 Метод позволяет получить цвет указанной геометрии сечения.
 Ссылки
 Teigha.DatabaseServices.SectionSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!