Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CircularArc2d.IsClockWise
 Послать отзыв
 Свойство IsClockWise позволяет проверить, ориентирована ли данная дуга по часовой стрелке.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsClockWise;
Копировать Код
Public ReadOnly Property IsClockWise As Boolean
 Возвращает
 Возвращает true, если дуга ориентирована по часовой стрелке. В противном случае возвращает false.
 Описание
 Свойство IsClockWise позволяет проверить, ориентирована ли данная дуга по часовой стрелке.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.CircularArc2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!