Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.SurfaceSurfaceIntersector.NumResults
 Послать отзыв
 Свойство NumResults представляет общее количество пересечений любой размерности.
 Синтаксис
C#
Visual Basic
Копировать Код
public int NumResults;
Копировать Код
Public ReadOnly Property NumResults As Integer
 Возвращает
 Возвращает общее количество пересечений любой размерности. Тип int.
 Описание
 Свойство NumResults представляет общее количество пересечений любой размерности.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.SurfaceSurfaceIntersector, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!