Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 LayerTableRecord.IsReconciled
 Послать отзыв
 Свойство не реализовано. Обеспечивает доступ к признаку того, что слой является
 согласованным.
 Синтаксис
C#
Visual Basic
public bool IsReconciled;
Public Property IsReconciled() As bool
 Возвращает
 Возвращает тип данных bool.
 Описание
 Свойство не реализовано, всегда равно false.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.LayerTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!