Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBVisualStyle.Type
 Послать отзыв
 Свойство предоставляет доступ на изменение к типу визуального стиля.
 Синтаксис
C#
Visual Basic
Копировать Код
public VisualStyleType Type;
Копировать Код
Public Property Type() As VisualStyleType
 Возвращает
 Возвращает тип визуального стиля как значение из перечисления VisualStyleType.
 Описание
 Свойство предоставляет доступ на изменение к типу визуального стиля.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.DBVisualStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!