Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.SplineEntity3d.SetControlPointAt
 Послать отзыв
 Метод переопределяет положение управляющей вершины с указанным индексом в массиве управляющих вершин.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetControlPointAt( int i, Point3d point );
Копировать Код
Public Sub SetControlPointAt( i As Integer, point As Point3d )
 Параметры
 Параметры
 Описание
 i
 Входной индекс управляющей вершины. Тип int.
 point
 Новое положение управляющей вершины. Тип Point3d.
 Описание
 Метод переопределяет положение управляющей вершины с указанным индексом в массиве управляющих вершин.
 Замечания
 В текущей версии этот метод не реализован.
 Ссылки
 Teigha.Geometry.SplineEntity3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!