Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GripOverrule.SetNoFilter
 Послать отзыв
 Отключает все методы фильтрации (SetCustomFilter, SetExtensionDictionaryEntryFilter, SetIdFilter, SetXDataFilter, а также метод IsApplicable() базового класса Overrule) при определении необходимости применять переопределение.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetNoFilter();
Копировать Код
Public Sub SetNoFilter()
 Описание
 Отключает все методы фильтрации (SetCustomFilter, SetExtensionDictionaryEntryFilter, SetIdFilter, SetXDataFilter, а также метод IsApplicable() базового класса Overrule) при определении необходимости применять переопределение.
 Ссылки
 Teigha.DatabaseServices.GripOverrule, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!