Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MTextFragment.Overlined
 Послать отзыв
 Свойство позволяет проверить, является ли текст надчёркнутым.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool Overlined;
Копировать Код
Public ReadOnly Property Overlined As Boolean
 Возвращает
 Возвращает true, если текст является надчёркнутым. В противном случае возвращает false.
 Описание
 Свойство позволяет проверить, является ли текст надчёркнутым.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.MTextFragment, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!