Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DataColumn.ColumnType
 Послать отзыв
 Свойство обеспечивает доступ к типу данных в этом столбце.
 Синтаксис
C#
Visual Basic
Копировать Код
public CellType ColumnType;
Копировать Код
Public Property ColumnType() As CellType
 Возвращает
 Возвращает тип данных в этом столбце. Значение из перечисления Teigha.DatabaseServices.CellType.
 Описание
 Свойство обеспечивает доступ к типу данных в этом столбце.
 Условия
 Чтение и запись
 Ссылки
 Teigha.DatabaseServices.DataColumn, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!