Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.RadialDimensionLarge.RadialDimensionLarge
 Послать отзыв
 Конструктор класса RadialDimensionLarge.
 Синтаксис
C#
Visual Basic
Копировать Код
public RadialDimensionLarge( Point3d center, Point3d chordPoint, Point3d overrideCenter, Point3d jogPoint, double jogAngle, ref String dimensionText, DatabaseServices.ObjectId dimensionStyle );
Копировать Код
Public Sub New( center As Point3d, chordPoint As Point3d, overrideCenter As Point3d, jogPoint As Point3d, jogAngle As Double, ByRef dimensionText As String, dimensionStyle As DatabaseServices.ObjectId )
 Параметры
 Параметры
 Описание
 center
 Центр измеряемой дуги или окружности. Тип Point3d.
 chordPoint
 Конец хорды на измеряемой окружности или дуге, к которому подводится размерная линия. Тип Point3d.
 overrideCenter
 Точка переопределенного центра, от которой строится размерная линия. Тип Point3d.
 jogPoint
 Точка излома размерной линии при переходе от переопределенного центра к точке хорды. Тип Point3d.
 jogAngle
 Угол излома между линией, проходящей через переопределенный центр, и линией, проходящей через точку излома. Тип double.
 dimensionText
 Размерный текст для замены текста измеренного значения. Тип String.
 dimensionStyle
 Идентификатор объекта размерного стиля, который используется для отрисовки размера. Тип DatabaseServices.ObjectId.
 Описание
 Конструктор класса RadialDimensionLarge. Создает экземпляр класса с указанными параметрами.
 Ссылки
 Teigha.DatabaseServices.RadialDimensionLarge, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!