Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.HostApplicationServices.GetUrl
 Послать отзыв
 Метод позволяет сопоставить локальный файл с соответствующим адресом URL, с которого файл был загружен.
 Синтаксис
C#
Visual Basic
Копировать Код
public Uri GetUrl( ref String localFile );
Копировать Код
Public Function GetUrl( ByRef localFile As String ) As Uri
 Параметры
 Параметры
 Описание
 localFile
 Локальный файл. Тип String.
 Возвращает
 Возвращает URI загруженного файла. Тип Uri.
 Описание
 Метод позволяет сопоставить локальный файл с соответствующим адресом URL, с которого файл был загружен.
 Ссылки
 Teigha.DatabaseServices.HostApplicationServices, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!