Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MInsertBlock.MInsertBlock
 Послать отзыв
 Конструктор по умолчанию класса MInsertBlock.
 Синтаксис
C#
Visual Basic
Копировать Код
public MInsertBlock();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса MInsertBlock.
 Ссылки
 Teigha.DatabaseServices.MInsertBlock, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!