Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.TableEnumeratorOption
 Послать отзыв
 Данное перечисление определяет опции перебора ячеек перечислителем таблицы.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum TableEnumeratorOption { IterateColumns = 4, IterateRows = 2, IterateSelection = 1, None = 0, SkipMerged = 64, SkipReadOnlyContent = 16, SkipReadOnlyFormat = 32 }
Копировать Код
Public Enum TableEnumeratorOption IterateColumns = 4 IterateRows = 2 IterateSelection = 1 None = 0 SkipMerged = 64 SkipReadOnlyContent = 16 SkipReadOnlyFormat = 32 End Enum
 Члены
 Члены
 Описание
 None
 Значение: 0. Опции не заданы.
 IterateSelection
 Значение: 1. Перебор в пределах выделенных ячеек.
 IterateRows
 Значение: 2. Перебор строк.
 IterateColumns
 Значение: 4. Перебор столбцов.
 SkipReadOnlyContent
 Значение: 16 = 0x10. Пропускать ячейки, в которых содержимое заблокировано от изменений.
 SkipReadOnlyFormat
 Значение: 32 = 0x20. Пропускать ячейки, в которых формат заблокирован от изменений.
 SkipMerged
 Значение: 64. Пропускать ячейки, скрытые вследствие слияния. При этом будут пропущены все ячейки в диапазоне слияния, кроме верхней левой ячейки.
 Описание
 Данное перечисление определяет опции перебора ячеек перечислителем таблицы.
 Ваши комментарии по поводу этого топика: Послать отзыв!