Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CellRange.DeleteContent
 Послать отзыв
 Метод предназначен для удаления содержимого ячеек данного диапазона.
 Синтаксис
C#
Visual Basic
Копировать Код
public void DeleteContent();
Копировать Код
Public Sub DeleteContent()
 Описание
 Метод предназначен для удаления содержимого ячеек данного диапазона.
 Ссылки
 Teigha.DatabaseServices.CellRange, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!