Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Solid3d.ExtrudeAlongPath
 Послать отзыв
 Метод создает трехмерное твердое тело путем выдавливания указанной области вдоль заданной траектории.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void ExtrudeAlongPath( ref Region region, ref Curve path, double taperAngle );
Копировать Код
Public Overridable Sub ExtrudeAlongPath( ByRef region As Region, ByRef path As Curve, taperAngle As Double )
 Параметры
 Параметры
 Описание
 region
 Область, используемая операцией выдавливания в качестве профиля выдавливания. Тип Region.
 path
 Объект кривой, который служит траекторией выдавливания. Тип Curve.
 taperAngle
 Угол наклона при выдавливании (в радианах). Тип double. Диапазон допустимых значений [-PI/2..PI/2].
 Описание
 Метод создает трехмерное твердое тело путем выдавливания указанной области вдоль заданной траектории.
 В качестве траектории выдавливания допускается использование следующих объектов:
Линия Line,
Круглая дуга Arc,
Окружность Circle,
Эллипс Ellipse,
Сплайн Spline,
2D полилиния,
3D-полилиния без сглаживания сплайном (Non-spline fit 3D polyline).
 Объект траектории не должен иметь самопересечений и, желательно, участков большой кривизны.
 Если |taperAngle| < 1e-6, то угол наклона принимается равным нулю. В случае замкнутой траектории угол наклона игнорируется.
 Этот метод реализован в среде пространственного моделирования и, отчасти, для ModelerGeometry.
 Ссылки
 Teigha.DatabaseServices.Solid3d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!