Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbSurfaceDefinition.PropertiesInU
 Послать отзыв
 Свойство PropertiesInU представляет значение NurbSurfaceProperties как свойство поверхности в направлении U.
 Синтаксис
C#
Visual Basic
Копировать Код
public int PropertiesInU;
Копировать Код
Public ReadOnly Property PropertiesInU As Integer
 Возвращает
 Возвращает значение NurbSurfaceProperties как свойство поверхности в направлении U. Тип int.
 Описание
 Свойство PropertiesInU представляет значение NurbSurfaceProperties как свойство поверхности в направлении U.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.NurbSurfaceDefinition, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!