Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Interval.Interval
 Послать отзыв
 Конструктор класса Interval. Создает конечный интервал с указанными нижней и верхней границами, а также с заданной точностью определения границ.
 Синтаксис
C#
Visual Basic
Копировать Код
public Interval( double lower, double upper, double tolerance );
Копировать Код
Public Sub New( lower As Double, upper As Double, tolerance As Double )
 Параметры
 Параметры
 Описание
 lower
 Нижняя граница интервала. Тип double.
 upper
 Верхняя граница интервала. Тип double.
 tolerance
 Заданная точность определения границ. Тип double.
 Описание
 Конструктор класса Interval. Создает конечный интервал с заданными нижней и верхней границами, а также с указанной точностью определения границ.
 Ссылки
 Teigha.Geometry.Interval, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!