Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbSurfaceDefinition.Weights
 Послать отзыв
 Свойство Weights представляет массив весов NURBS поверхности.
 Синтаксис
C#
Visual Basic
Копировать Код
public DoubleCollection Weights;
Копировать Код
Public ReadOnly Property Weights As DoubleCollection
 Возвращает
 Возвращает массив значений весов. Тип DoubleCollection.
 Описание
 Свойство Weights представляет массив весов NURBS поверхности.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.NurbSurfaceDefinition, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!