Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.ExternalCurve2d.ExternalCurve2d
 Послать отзыв
 Конструктор класса ExternalCurve2d. Создает объект на основе указателя на определение внешней кривой и сведений о системе, в которой было создано ее определение.
 Синтаксис
C#
Visual Basic
Копировать Код
public ExternalCurve2d( IntPtr curveDef, ExternalEntityKind curveKind );
Копировать Код
Public Sub New( curveDef As IntPtr, curveKind As ExternalEntityKind )
 Параметры
 Параметры
 Описание
 curveDef
 Входное определение внешней кривой. Тип IntPtr.
 curveKind
 Информация о системе, в которой было создано определение внешнего объекта. Перечисление ExternalEntityKind.
 Описание
 Конструктор класса ExternalCurve2d. Создает объект на основе указателя на определение внешней кривой и сведений о системе, в которой было создано ее определение.
 Ссылки
 Teigha.Geometry.ExternalCurve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!