Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод RasterImageDef.GetEntityCount
 Послать отзыв
 Синтаксис
C#
Visual Basic
public int GetEntityCount([Out]bool% locked);
Public Function GetEntityCount(locked As [Out]bool%) As Integer
 Параметры
 Параметры
 Описание
 locked
 Величина для проверки блокировки
 Описание
 Возвращает количество геометрических объектов RasterImage в текущем чертеже, которые зависят от данного объекта для отображения графики. Если параметр locked не нулевой, то данная функция возвратит true, если любой зависимый геометрический объект размещен на заблокированных слоях.
 Ссылки
 Teigha.DatabaseServices.RasterImageDef, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!