Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBDictionaryEntry.m_value
 Послать отзыв
 Поле хранит ObjectId данной записи.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectId m_value;
Копировать Код
Public m_value As ObjectId
 Возвращает
 Возвращает ObjectId объекта, представленного данной записью.
 Описание
 Поле хранит ObjectId данной записи.
 Ссылки
 Teigha.DatabaseServices.DBDictionaryEntry, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!