Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DgnDefinition.UseMasterUnits
 Послать отзыв
 Свойство определяет, должна ли подложка использовать основные единицы измерения из файла DGN при преобразовании из формата DGN в формат DWG. Если основные единицы не используются, то используются вспомогательные.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool UseMasterUnits;
Копировать Код
Public Property UseMasterUnits() As Boolean
 Возвращает
 Возвращает true, если подложка должна использовать основные единицы измерения из файла DGN. В противном случае возвращает false.
 Описание
 Свойство определяет, должна ли подложка использовать основные единицы измерения из файла DGN при преобразовании из формата DGN в формат DWG. Если основные единицы не используются, то используются вспомогательные.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.DgnDefinition, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!