Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FieldUpdateResult.NumFound
 Послать отзыв
 Свойство NumFound представляет количество найденных полей.
 Синтаксис
C#
Visual Basic
Копировать Код
public int NumFound;
Копировать Код
Public NumFound As Integer
 Возвращает
 Возвращает количество найденных полей. Тип int.
 Описание
 Свойство NumFound представляет количество найденных полей.
 Ссылки
 Teigha.DatabaseServices.FieldUpdateResult, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!