Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CircularArc3d.EndAngle
 Послать отзыв
 Свойство EndAngle представляет угол конечной точки дуги.
 Синтаксис
C#
Visual Basic
Копировать Код
public double EndAngle;
Копировать Код
Public ReadOnly Property EndAngle As Double
 Возвращает
 Возвращает угол конечной точки дуги. Тип double.
 Описание
 Свойство EndAngle представляет угол конечной точки дуги.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.CircularArc3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!