Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Layout.Initialize
 Послать отзыв
 Этот метод выполняет закулисную работу по созданию видового экрана для листа.
 Это позволяет настроить лист и подготовить его для создания в нем других видовых экранов и объектов, а также задать различные свойства листа.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.ObjectId Initialize();
Копировать Код
Public Function Initialize() As DatabaseServices.ObjectId
 Возвращает
 Возвращает ObjectId созданного видового экрана в пространстве листа.
 Описание
 Этот метод выполняет закулисную работу по созданию видового экрана для листа.
 Это позволяет настроить лист и подготовить его для создания в нем других видовых экранов и объектов, а также задать различные свойства листа.
 Возвращает ObjectId видового экрана пространства листа, созданного этим методом.
 Ссылки
 Teigha.DatabaseServices.Layout, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!