Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SubDMesh.Setbox
 Послать отзыв
 Метод создает сеть в виде бокса с заданными размерами, количеством разделений в каждом из направлений и степенью сглаживания сети.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Setbox( double xlen, double ylen, double zlen, int divx, int divy, int divz, int smoothLevel );
Копировать Код
Public Sub Setbox( xlen As double, ylen As double, zlen As double, divx As Integer, divy As Integer, divz As Integer, smoothLevel As Integer )
 Параметры
 Параметры
 Описание
 xlen
 Глубина бокса, double.
 ylen
 Ширина бокса, double.
 zlen
 Высота бокса, double.
 divx
 Определяет, сколько разделений выполняется в направлении глубины, int.
 divy
 Определяет, сколько разделений выполняется в направлении ширины, int.
 divz
 Определяет, сколько разделений выполняется в направлении высоты, int.
 smoothLevel
 Степень сглаживания сети, int.
 Описание
 Метод создает сеть в виде бокса (прямоугольного параллелепипеда) с заданными размерами, количеством разделений в каждом из направлений и степенью сглаживания сети.
 Ссылки
 Teigha.DatabaseServices.SubDMesh, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!