Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GripDataCollection.Contains
 Послать отзыв
 Метод позволяет проверить, содержит ли эта коллекция объект, соответствующий указанному объекту GripData.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool Contains( ref GripData gripData );
Копировать Код
Public Function Contains( ByRef gripData As GripData ) As Boolean
 Параметры
 Параметры
 Описание
 gripData
 Входной проверяемый объект. Тип GripData.
 Возвращает
 Возвращает true, если объект gripData уже содержится в коллекции. В противном случае возвращает false.
 Описание
 Метод позволяет проверить, содержит ли эта коллекция объект, соответствующий указанному объекту GripData.
 Ссылки
 Teigha.DatabaseServices.GripDataCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!