Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Material.ChannelFlags
 Послать отзыв
 Свойство представляет флаги канала для данного материала и позволяет настраивать требуемые комбинации каналов.
 Синтаксис
C#
Visual Basic
Копировать Код
public GraphicsInterface.ChannelFlags ChannelFlags;
Копировать Код
Public Property ChannelFlags As GraphicsInterface.ChannelFlags
 Возвращает
 Возвращает комбинацию флагов из перечисления GraphicsInterface.ChannelFlags.
 Описание
 Свойство представляет флаги канала для данного материала и позволяет настраивать требуемые комбинации каналов.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Material, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!