Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve2d
 Послать отзыв
 Класс Curve2d является базовым классом для всех двумерных кривых.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Geometry::Entity2d Teigha::Geometry::Curve2d
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdGeCurve2d")] public abstract class Curve2d : Entity2d
Копировать Код
<Wrapper("OdGeCurve2d")> Public MustInherit Class Curve2d Inherits Entity2d
 Описание
 Класс Curve2d является базовым классом для всех двумерных кривых. Всякий класс, производный от этого класса, представляет 2D-кривую.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Geometry.Entity2d
 Имя
 Описание
 Entity2d Методы
 Ниже перечислены методы класса Entity2d.
 Teigha.Geometry.Curve2d
 Имя
 Описание
 Curve2d Методы
 Ниже перечислены методы класса Curve2d.
 Curve2d Свойства
 Ниже перечислены свойства класса Curve2d.
 Ссылки
 Curve2d Методы, Curve2d Свойства, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!