Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Viewport.Elevation
 Послать отзыв
 Свойство Elevation представляет возвышение плоскости ПСК (UCS) данного видового экрана.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Elevation;
Копировать Код
Public Property Elevation As Double
 Возвращает
 Возвращает возвышение плоскости ПСК. Тип double.
 Описание
 Свойство Elevation представляет возвышение плоскости ПСК (UCS) данного видового экрана. Возвышение - это расстояние от начала мировой системы координат (МСК, WCS) до плоскости ПСК этого объекта.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Viewport, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!