Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CurveCurveIntersector2d.Tolerance
 Послать отзыв
 Свойство Tolerance представляет текущее значение точности, которое будет использоваться при вычислении пересечений двух кривых.
 Синтаксис
C#
Visual Basic
Копировать Код
public Geometry.Tolerance Tolerance;
Копировать Код
Public ReadOnly Property Tolerance As Geometry.Tolerance
 Возвращает
 Возвращает текущее значение точности. Тип Geometry.Tolerance.
 Описание
 Свойство Tolerance представляет текущее значение точности, которое будет использоваться при вычислении пересечений двух кривых.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.CurveCurveIntersector2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!