Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство RasterImageDef.FileType
 Послать отзыв
 Синтаксис
C#
Visual Basic
public String FileType;
Public Property FileType() As String
 Описание
 Возвращает тип файла изображения, такой как BMP для точечного изображения.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.RasterImageDef, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!