Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.RevolveOptionsBuilder
 Послать отзыв
 Класс RevolveOptionsBuilder предназначен для редактирования свойств класса RevolveOptions, который является неизменяемым типом значения.
 Иерархия классов
Teigha::DatabaseServices::RevolveOptionsBuilder
 Синтаксис
C#
Visual Basic
Копировать Код
public class RevolveOptionsBuilder
Копировать Код
Public Class RevolveOptionsBuilder
 Описание
 Класс RevolveOptionsBuilder предназначен для редактирования свойств класса RevolveOptions, который является неизменяемым типом значения.
 Методы
 Конструкторы
 Имя
 Описание
 RevolveOptionsBuilder
 Это обзор перегрузок RevolveOptionsBuilder.
 Топики
 Имя
 Описание
 RevolveOptionsBuilder Методы
 Ниже перечислены методы класса RevolveOptionsBuilder.
 RevolveOptionsBuilder Свойства
 Ниже перечислены свойства класса RevolveOptionsBuilder.
 Ссылки
 RevolveOptionsBuilder Конструктор, RevolveOptionsBuilder Методы, RevolveOptionsBuilder Свойства, Методы, Топики, RevolveOptionsBuilder Методы, RevolveOptionsBuilder Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!