Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.IsTitleSuppressed
 Послать отзыв
 Устарело. Используйте функционал объекта Cell. Свойство позволяет подавлять или отменять подавление строки наименования объекта Table.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual bool IsTitleSuppressed;
Копировать Код
Public virtual Property IsTitleSuppressed() As Boolean
 Возвращает
 Возвращает true, если строка наименования таблицы подавлена, или false в противном случае.
 Описание
 Данное свойство предоставляет доступ на изменение к флагу подавления строки наименования объекта Table.
 Замечания
 Это свойство устарело. Используйте функционал объекта Cell.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!