Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Filters.SpatialFilterVolume.FromPoint
 Послать отзыв
 Свойство FromPoint возвращает точку "от" преобразованной границы отсечения.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d FromPoint;
Копировать Код
Public ReadOnly Property FromPoint As Point3d
 Возвращает
 Возвращает точку "от" преобразованной границы отсечения. Тип Point3d.
 Описание
 Свойство FromPoint возвращает точку "от" преобразованной границы отсечения.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Filters.SpatialFilterVolume, Teigha.DatabaseServices.Filters
 Ваши комментарии по поводу этого топика: Послать отзыв!