Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotStyleTable.LineweightSize
 Послать отзыв
 Свойство LineweightSize представляет логический размер списка весов линий в данном объекте PlotStyleTable.
 Синтаксис
C#
Visual Basic
Копировать Код
public unsigned int LineweightSize;
Копировать Код
Public ReadOnly Property LineweightSize As unsigned int
 Возвращает
 Возвращает логический размер списка весов (толщин) линий. Тип unsigned int.
 Описание
 Свойство LineweightSize представляет логический размер списка весов (толщин) линий в данной таблице стилей печати PlotStyleTable.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.PlotStyleTable, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!