Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 DimStyleTableRecord.Dimlwe
 Послать отзыв
 Свойство отвечает за настройку веса выносных линий.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual LineWeight Dimlwe { get; set; }
Копировать Код
Public Overridable Property Dimlwe As LineWeight
 Возвращает
 Возвращает тип данных Teigha.DatabaseServices.LineWeight.
 Описание
 В свойстве хранится текущая настройка веса выносных линий. Значение по умолчанию «По блоку». Свойство принимает значения перечисления Teigha.DatabaseServices.LineWeight.
 Свойство также доступно через системную переменную DIMLWE и пользовательское меню в окне изменения/создания размерного стиля:
  При изменении системной переменной DIMLWE будет создан новый размерный стиль под названием <переопределение> на основе текущего с новым значением DIMLWE.
 Условия
 Чтение и запись.
 Пример
 Пример изменения веса выносных линий (значения свойства Dimlwe) в размерном стиле Standard:
C#
 Копировать Код
public partial class Commands { [Teigha.Runtime.CommandMethod("DimlweChange")] public void DimlweStandardDimStyle() { // Получение ссылки на активный документ HostMgd.ApplicationServices.Document doc = HostMgd.ApplicationServices.Application.DocumentManager.MdiActiveDocument; // Получение ссылки на редактор документа HostMgd.EditorInput.Editor ed = doc.Editor; // Получение ссылки на базу данных документа Teigha.DatabaseServices.Database db = doc.Database; // Начало транзакции с базой данных документа using (Teigha.DatabaseServices.Transaction trans = db.TransactionManager.StartTransaction()) { // Открываем таблицу размерных стилей для чтения Teigha.DatabaseServices.DimStyleTable dimStyleTable = trans.GetObject(db.DimStyleTableId, Teigha.DatabaseServices.OpenMode.ForRead) as Teigha.DatabaseServices.DimStyleTable; // Находим в таблице размерных стилей ObjectId нужного стиля по его названию Teigha.DatabaseServices.ObjectId styleId = dimStyleTable["Standard"]; // Открываем таблицу размерного стиля для изменений Teigha.DatabaseServices.DimStyleTableRecord obj = trans.GetObject(styleId, Teigha.DatabaseServices.OpenMode.ForWrite) as Teigha.DatabaseServices.DimStyleTableRecord; ed.WriteMessage($"nDimlwe before: {obj.Dimlwe}"); // Изменяем вес выносных линий obj.Dimlwe = Teigha.DatabaseServices.LineWeight.LineWeight060; ed.WriteMessage($"nDimlwe after: {obj.Dimlwe}"); trans.Commit(); } } }
 Результат работы команды DimlweChange:
 Было:
 Стало:
 Ссылки
 Teigha.DatabaseServices.DimStyleTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!