Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Database.DxfOut (StreamBuf^, int, DwgVersion, bool)
 Послать отзыв
 This is DxfOut, a member of class Database.
 Синтаксис
C#
Visual Basic
[Category("For Teigha only")] public void DxfOut(ref StreamBuf fileBuf, int precision, DwgVersion version, bool saveThumbnailImage);
<Category("For Teigha only")> Public Sub DxfOut(ByRef fileBuf As StreamBuf, precision As Integer, version As DwgVersion, saveThumbnailImage As bool)
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!