Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.EllipticalCylinder.Set
 Послать отзыв
 Метод позволяет переопределить у данного объекта точку начала координат, малый и большой радиусы и направляющий вектор оси симметрии эллиптического цилиндра.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Set( double minorRadius, double majorRadius, Point3d origin, Vector3d axisOfSymmetry );
Копировать Код
Public Sub [Set]( minorRadius As Double, majorRadius As Double, origin As Point3d, axisOfSymmetry As Vector3d )
 Параметры
 Параметры
 Описание
 minorRadius
 Малый радиус эллиптического цилиндра. Тип double.
 majorRadius
 Большой радиус эллиптического цилиндра. Тип double.
 origin
 Начало координат эллиптического цилиндра. Тип Point3d.
 axisOfSymmetry
 Направляющий вектор оси симметрии цилиндра. Тип Vector3d.
 Описание
 Метод позволяет переопределить у данного объекта точку начала координат, малый и большой радиусы и направляющий вектор оси симметрии эллиптического цилиндра.
 Ссылки
 Teigha.Geometry.EllipticalCylinder, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!