Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.ContentColor
 Послать отзыв
 Метод предназначен для получения цвета содержимого ячейки, заданной индексами строки и столбца.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual Color ContentColor( int row, int col );
Копировать Код
Public virtual Function ContentColor( row As Integer, col As Integer ) As Color
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int.
 col
 Индекс столбца, тип int.
 Возвращает
 Возвращает цвет содержимого указанной ячейки. Тип Color.
 Описание
 Метод предназначен для получения цвета содержимого ячейки, заданной индексами строки и столбца.
 Замечания
 Для получения того же результата предпочтительнее использовать Table.Cells[row,column].ContentColor.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!