Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector2dCollection.ToArray
 Послать отзыв
 Метод создает массив объектов Vector2d, содержащий копии всех элементов данной коллекции.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector2d[] ToArray();
Копировать Код
Public Function ToArray() As Vector2d()
 Возвращает
 Возвращает массив, содержащий копии всех элементов данной коллекции. Тип Vector2d[].
 Описание
 Метод создает массив объектов Vector2d, содержащий копии всех элементов данной коллекции.
 Ссылки
 Teigha.Geometry.Vector2dCollection, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!