Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SaveType
 Послать отзыв
 Перечисление SaveType определяет допустимые типы сохраняемого файла.
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdDb.SaveType")] public enum SaveType { Save12 = 0, Save13 = 1, Save14 = 2, NoSave = -1 }
Копировать Код
<Wrapper("OdDb.SaveType")> Public Enum SaveType Save12 = 0 Save13 = 1 Save14 = 2 NoSave = -1 End Enum
 Члены
 Члены
 Описание
 NoSave
 Значение: -1. Формат файла еще не определен, база данных была создана с нуля.
 Save12
 Значение: 0. Файл сохраняется в формате .dwg; тип AutoCAD R12.
 Save13
 Значение: 1. Файл сохраняется в формате .dxf; тип AutoCAD R13.
 Save14
 Значение: 2. Файл сохраняется в формате двоичного .dxf; тип AutoCAD R14.
 Описание
 Перечисление SaveType определяет поддерживаемые типы сохраняемого файла.
 Ваши комментарии по поводу этого топика: Послать отзыв!