Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.PlanarEntity.IsParallelTo
 Послать отзыв
 Метод позволяет проверить параллельность данного объекта и указанной плоской поверхности в пределах предписанной точности.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsParallelTo( ref PlanarEntity otherPlanarEntity, Tolerance tolerance );
Копировать Код
Public Function IsParallelTo( ByRef otherPlanarEntity As PlanarEntity, tolerance As Tolerance ) As Boolean
 Параметры
 Параметры
 Описание
 otherPlanarEntity
 Проверяемая на параллельность плоская поверхность. Тип PlanarEntity.
 tolerance
 Входная геометрическая точность. Тип Tolerance.
 Возвращает
 Возвращает true, если в пределах заданной точности сравниваемые плоские объекты можно считать параллельными. В противном случае возвращает false.
 Описание
 Метод позволяет проверить параллельность данного объекта и указанной плоской поверхности в пределах точности tolerance.
 Ссылки
 Teigha.Geometry.PlanarEntity, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!