Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Leader.Dimtxsty
 Послать отзыв
 This is Dimtxsty, a member of class Leader.
 Синтаксис
C#
Visual Basic
public DatabaseServices::ObjectId Dimtxsty;
Public Property Dimtxsty() As DatabaseServices.ObjectId
 Ссылки
 Teigha.DatabaseServices.Leader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!