Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AttributeDefinition.MTextAttributeDefinition
 Послать отзыв
 Свойство обеспечивает доступ на изменение к объекту MText, который представляет определение многострочного атрибута.
 Синтаксис
C#
Visual Basic
Копировать Код
public MText MTextAttributeDefinition;
Копировать Код
Public Property MTextAttributeDefinition() As MText
 Возвращает
 Возвращает объект MText определения многострочного атрибута.
 Описание
 Свойство обеспечивает доступ на изменение к объекту MText, который представляет определение многострочного атрибута.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.AttributeDefinition, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!