Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.NurbSurface.NurbSurface
 Послать отзыв
 Конструктор класса NurbSurface. Создает NURBS поверхность, используя предоставленные параметры.
 Синтаксис
C#
Visual Basic
Копировать Код
public NurbSurface( int uDegree, int vDegree, bool rational, int uNumControlPoints, int vNumControlPoints, ref Point3dCollection ctrlPts, ref DoubleCollection weights, ref KnotCollection uKnots, ref KnotCollection vKnots );
Копировать Код
Public Sub New( uDegree As Integer, vDegree As Integer, rational As Boolean, uNumControlPoints As Integer, vNumControlPoints As Integer, ByRef ctrlPts As Point3dCollection, ByRef weights As DoubleCollection, ByRef uKnots As KnotCollection, ByRef vKnots As KnotCollection )
 Параметры
 Параметры
 Описание
 uDegree
 Степень сплайна в направлении u. Тип int.
 vDegree
 Степень сплайна в направлении v. Тип int.
 rational
 Если сплайн является рациональным, следует передать значение true, в противном случае передать false. Тип bool.
 uNumControlPoints
 Количество управляющих вершин в направлении u. Тип int.
 vNumControlPoints
 Количество управляющих вершин в направлении v. Тип int.
 ctrlPts
 Массив управляющих вершин сплайна. Тип Point3dCollection.
 weights
 Массив весов. Тип DoubleCollection.
 uKnots
 Узловой вектор в направлении u. Тип KnotCollection.
 vKnots
 Узловой вектор в направлении v. Тип KnotCollection.
 Описание
 Конструктор класса NurbSurface. Создает NURBS поверхность, используя предоставленные параметры.
 Замечания
 Индексы строк массива управляющих вершин относятся к направлению u, а индексы столбцов - к направлению v. Например, если поверхность имеет m управляющих вершин в направлении u и n управляющих вершин в направлении v, массив ctrlPts принимает вид [0,0], [0,1], ...[0,n-1], ..., [m-1,0], [m-1,1], ...[m-1,n-1].
 Если поверхность рациональная, массив весов должен содержать то же количество элементов, что и массив управляющих вершин. Все значения весов должны быть положительными. Порядок следования значений в массивах весов и управляющих вершин должен соответствовать порядку следования в массиве управляющих вершин. Если поверхность нерациональна, массив весов должен быть пустым.
 Если поверхность не является периодической в направлении u, размерность вектора uKnots должна равняться uNumControlPoints + uDegree + 1. Если поверхность периодична в направлении u, размерность вектора uKnots должна быть равна uNumControlPoints + 1.
 Аналогично, если поверхность не является периодической в направлении v, размерность вектора vKnots должна равняться vNumControlPoints + vDegree + 1. Если поверхность является периодической в направлении v, размерность вектора vKnots должна быть равна vNumControlPoints + 1.
 Последовательность значений в узловом векторе должна быть неубывающей.
 Если какой-либо из переданных параметров недействителен, поверхность создана не будет.
 Ссылки
 Teigha.DatabaseServices.NurbSurface, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!