Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LayoutCopiedEventArgs.NewId
 Послать отзыв
 Свойство представляет идентификатор объекта нового (скопированного) листа.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectId NewId;
Копировать Код
Public ReadOnly Property NewId As ObjectId
 Возвращает
 Возвращает идентификатор объекта нового листа-копии. Тип ObjectId.
 Описание
 Свойство представляет идентификатор объекта нового (скопированного) листа.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.LayoutCopiedEventArgs, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!