Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Spline.InsertKnot
 Послать отзыв
 Метод позволяет вставить новый узел в узловой вектор сплайна в позицию, определенную предоставленным значением параметра.
 Синтаксис
C#
Visual Basic
Копировать Код
public void InsertKnot( double value );
Копировать Код
Public Sub InsertKnot( value As Double )
 Параметры
 Параметры
 Описание
 value
 Значение вставляемого узла. Тип double.
 Описание
 Метод позволяет вставить новый узел в узловой вектор сплайна в позицию, определенную предоставленным значением параметра value.
 Значение value должно находиться в пределах параметрического диапазона сплайна. Чтобы выяснить этот параметрический диапазон, используйте свойство Spline.NurbsData, возвращающее коллекцию текущих значений узлов сплайна. Значения для первого и последнего узлов определяют начальное и конечное значения параметра сплайна, соответственно.
 Ссылки
 Teigha.DatabaseServices.Spline, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!