Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.JoinStyle
 Послать отзыв
 Синтаксис
C#
Visual Basic
public DatabaseServices::JoinStyle JoinStyle;
Public Property JoinStyle() As DatabaseServices.JoinStyle
 Описание
 Устанавливает или возвращает значение заголовка переменой стиля соединения базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!