Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SubentityOverrule.OnSubentGripStatusChanged
 Послать отзыв
 Данный метод переопределяет метод Entity.SetSubentityGripStatus() и вызывает его в случае реализации по умолчанию.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void OnSubentGripStatusChanged( ref Entity entity, GripStatus status, FullSubentityPath subentity );
Копировать Код
Public virtual Sub OnSubentGripStatusChanged( ByRef entity As Entity, status As GripStatus, subentity As FullSubentityPath )
 Параметры
 Параметры
 Описание
 entity
 Объект чертежа, тип Entity.
 status
 Состояние ручки из перечисления GripStatus.
 subentity
 Полный путь к подобъекту. Тип FullSubentityPath.
 Описание
 Данный метод переопределяет метод Entity.SetSubentityGripStatus() и вызывает его при реализации по умолчанию.
 Метод Entity.SetSubentityGripStatus() в реализации по умолчанию возвращает состояние ручки подобъекта. Метод OnSubentGripStatusChanged() настоящего класса позволяет переопределить этот механизм.
 Ссылки
 Teigha.DatabaseServices.SubentityOverrule, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!