Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод LinetypeTableRecord.SetShapeStyleAt
 Послать отзыв
 Синтаксис
C#
Visual Basic
public void SetShapeStyleAt(int index, DatabaseServices::ObjectId id);
Public Sub SetShapeStyleAt(index As Integer, id As DatabaseServices.ObjectId)
 Параметры
 Параметры
 Описание
 index
 Индекс (начинающийся с 0) строки, содержащей форму (текстовую строку), для которой производится установка стиля
 id
 Значение Id объекта для определения TextStyleTableRecord или textStyle
 Описание
 Этот метод устанавливает для строки LinetypeTableRecord со значением индекса index используемое значение ObjectId для TextStyleTableRecord для формы (или textStyle, если вместо формы текстовая строка). Если в строке LinetypeTableRecord нет ни формы, ни текстовой строки, то значение ObjectId должно быть null.
 Значение index должно быть больше или равно 0, но меньше чем значение, возвращаемое LinetypeTableRecord.NumDashes. index представляет собой индекс, начинающийся с нуля (формы и текстовые строки имеют тот же самый индекс, как и штриховка, предшествующая им в определении типа линии) с первым элементом типа линии, соответствующим индексу, равному 0.
 Для получения дополнительной информации об определении типа линии и длины штриховки, смотри раздел "Типы линий" в Инструкции пользователя по nanoCAD.
 Ссылки
 Teigha.DatabaseServices.LinetypeTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!