Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.HyperLinkCollection.Contains
 Послать отзыв
 Метод позволяет проверить, содержит ли эта коллекция гиперссылку, соответствующую указанному объекту HyperLink.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool Contains( ref HyperLink value );
Копировать Код
Public Function Contains( ByRef value As HyperLink ) As Boolean
 Параметры
 Параметры
 Описание
 value
 Проверяемая гиперссылка. Тип HyperLink.
 Возвращает
 Возвращает true, если в коллекции уже содержится указанный объект value. В противном случае возвращает false.
 Описание
 Метод позволяет проверить, содержит ли эта коллекция гиперссылку, соответствующую указанному объекту HyperLink.
 Ссылки
 Teigha.DatabaseServices.HyperLinkCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!