Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Filters.SpatialFilterDefinition.SpatialFilterDefinition
 Послать отзыв
 Конструктор класса SpatialFilterDefinition.
 Синтаксис
C#
Visual Basic
Копировать Код
public SpatialFilterDefinition( ref Point2dCollection pts, Vector3d normal, double elevation, double frontClip, double backClip, bool enabled );
Копировать Код
Public Sub New( ByRef pts As Point2dCollection, normal As Vector3d, elevation As Double, frontClip As Double, backClip As Double, enabled As Boolean )
 Параметры
 Параметры
 Описание
 pts
 Коллекция вершин выдавливаемого 2D-контура, который определяет форму области фильтра в плане. Если количество точек равно 2, они являются диагональными точками прямоугольника. В противном случае точки рассматриваются как вершины многоугольника. Многоугольник не должен иметь самопересечений. Тип Point2dCollection.
 normal
 Вектор, определяющий положительное направление выдавливания контура с вершинами pts в системе координат WCS. Тип Vector3d.
 elevation
 Расстояние от начала системы координат WCS до плоскости, в которой располагается выдавливаемый контур области фильтра. Тип double. Значение elevation и вектор нормали normal определяют плоскость для системы координат объекта (ECS), в которой задаются вершины pts выдавливаемого контура.
 frontClip
 Расстояние в направлении вектора normal до передней плоскости отсечения. Тип double.
 backClip
 Расстояние до задней плоскости отсечения в отрицательном направлении выдавливания. Тип double.
 enabled
 Флаг состояния пространственной области фильтра. Тип bool. Если область отключена (значение false), то зоной действия фильтра становится все 3D-пространство.
 Описание
 Конструктор класса SpatialFilterDefinition.
 Ссылки
 Teigha.DatabaseServices.Filters.SpatialFilterDefinition, Teigha.DatabaseServices.Filters
 Ваши комментарии по поводу этого топика: Послать отзыв!