Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry
 Послать отзыв
 Пространство имен Teigha.Geometry содержит классы и перечисления, предоставляющие функционал для работы с геометрическими объектами в среде nanoCAD.
 Описание
 Пространство имен Teigha.Geometry содержит классы и перечисления, предоставляющие обширный функционал для работы с геометрическими объектами в среде nanoCAD.
 Представлены базовые классы для 2D и 3D геометрических объектов, разнообразные графические примитивы (точки, кривые, поверхности, тела), классы для операций с 2D и 3D векторами и матрицами, а также ряд вспомогательных классов.
 Классы
 Имя
 Описание
 AugmentedPolylineCurve3d
 Класс AugmentedPolylineCurve3d представляет математический объект, используемый для поддержки различных типов сплайновых кривых в трехмерном пространстве.
 BoundBlock2d
 Класс BoundBlock2d реализует двумерную граничную рамку геометрического объекта.
 BoundBlock3d
 Класс BoundBlock3d представляет трехмерную граничную рамку.
 BoundedPlane
 Класс BoundedPlane представляет ограниченную плоскую параметрическую поверхность.
 CircularArc2d
 Класс CircularArc2d представляет окружности и круглые дуги в двумерном пространстве.
 CircularArc3d
 Класс CircularArc3d представляет окружности и круглые дуги в трёхмерном пространстве.
 ClipBoundary2d
 Класс ClipBoundary2d представляет ограничивающий многоугольник, определяющий плоскую границу обрезки произвольных 2D-полигонов или полилиний.
 ClipBoundary2dData
 Структура ClipBoundary2dData представляет данные, используемые классом ClipBoundary2d.
 CompositeCurve2d
 Класс CompositeCurve2d представляет двумерные составные кривые, которые состоят из произвольного количества подкривых, соединенных конец в конец.
 CompositeCurve3d
 Класс CompositeCurve3d представляет трехмерные составные кривые, которые состоят из произвольного количества подкривых, соединенных конец в конец.
 CompositeParameter
 Структура CompositeParameter представляет данные, которые определяют параметр точки на составной кривой.
 Cone
 Класс Cone представляет ограниченный прямой круговой конус.
 CoordinateSystem2d
 Структура CoordinateSystem2d представляет двумерную систему координат, которая определяется точкой начала и направлениями осей X и Y.
 CoordinateSystem3d
 Структура CoordinateSystem3d представляет трехмерную систему координат, которая определяется точкой начала и направлениями осей X, Y и Z.
 CubicSplineCurve2d
 Класс CubicSplineCurve2d представляет интерполяционный кубический сплайн в двумерном пространстве.
 CubicSplineCurve3d
 Класс CubicSplineCurve3d представляет интерполяционный кубический сплайн в трехмерном пространстве.
 Curve2d
 Класс Curve2d является базовым классом для всех двумерных кривых.
 Curve2dCollection
 Класс Curve2dCollection представляет коллекцию объектов Curve2d.
 Curve3d
 Этот абстрактный класс является базовым классом для всех трехмерных кривых.
 Curve3dCollection
 Класс Curve3dCollection представляет коллекцию объектов Curve3d.
 CurveBoundary
 Класс CurveBoundary представляет геометрию криволинейных границ на ограниченной поверхности.
 CurveBoundaryData
 Структура CurveBoundaryData представляет данные, которые определяют объект CurveBoundary.
 CurveCurveIntersector2d
 Класс CurveCurveIntersector2d представляет геометрию пересечений 2D-кривых общего вида.
 CurveCurveIntersector3d
 Класс CurveCurveIntersector3d представляет геометрию пересечений 3D-кривых общего вида.
 Cylinder
 Класс Cylinder представляет прямые круговые цилиндры.
 EllipticalArc2d
 Класс EllipticalArc2d представляет эллиптические дуги и полные эллипсы в двумерном пространстве.
 EllipticalArc3d
 Класс EllipticalArc3d представляет трехмерные эллиптические дуги и полные эллипсы в 3D-пространстве.
 EllipticalCone
 Класс EllipticalCone представляет прямые эллиптические конусы.
 EllipticalCylinder
 Класс EllipticalCylinder представляет эллиптические цилиндры.
 Entity2d
 Класс Entity2d служит базовым классом для всех двумерных геометрических объектов.
 Entity3d
 Класс Entity3d служит базовым классом для всех трехмерных геометрических объектов.
 ExternalBoundedSurface
 Класс ExternalBoundedSurface представляет ограниченные поверхности, определения которых являются внешними по отношению к геометрической библиотеке nanoCAD.
 ExternalCurve2d
 Класс ExternalCurve2d представляет 2D-кривые, определения которых являются внешними по отношению к геометрической библиотеке nanoCAD.
 ExternalCurve3d
 Класс ExternalCurve3d представляет 3D-кривые, определения которых являются внешними по отношению к геометрической библиотеке nanoCAD.
 ExternalSurface
 Класс ExternalSurface представляет неограниченные поверхности, определения которых являются внешними по отношению к геометрической библиотеке nanoCAD.
 GeoDataLonLatAltInfo
 Структура GeoDataLonLatAltInfo представляет географические координаты точки, включающие долготу, широту и высоту.
 Interval
 Класс Interval представляет конечный, бесконечный или полубесконечный интервал на действительной оси, границы которого определены с некоторой заданной точностью.
 KnotCollection
 Класс KnotCollection представляет однородный узловой вектор сплайна как неубывающую последовательность действительных значений.
 Line2d
 Класс Line2d представляет бесконечную линию в двумерном пространстве.
 Line2dCollection
 Класс Line2dCollection представляет коллекцию двумерных линий.
 Line3d
 Класс представляет бесконечные линии в трехмерном пространстве.
 LineSegment2d
 Класс LineSegment2d представляет линейные сегменты в двумерном пространстве.
 LineSegment3d
 Класс LineSegment3d представляет линейные сегменты в трехмерном пространстве.
 LinearEntity2d
 Класс LinearEntity2d является абстрактным базовым классом для всех классов двумерных линейных объектов.
 LinearEntity3d
 Класс LinearEntity3d является абстрактным базовым классом для всех классов трехмерных линейных объектов.
 Matrix2d
 Структура Matrix2d представляет двумерное афинное геометрическое преобразование (перемещение, вращение, масштабирование).
 Matrix2dBuilder
 Класс Matrix2dBuilder используется для создания экземпляров класса Teigha.Geometry.Matrix2d, который является неизменяемым типом.
 Matrix2dInfo
 Структура Matrix2dInfo инкапсулирует данные, возвращаемые методом Matrix2d.IsConformal().
 Matrix3d
 Класс Matrix3d представляет аффинное преобразование трехмерного пространства, включая вращения и трансляцию.
 Matrix3dBuilder
 Класс Matrix3dBuilder используется для создания экземпляров класса Teigha.Geometry.Matrix3d, который является неизменяемым типом.
 NurbCurve2d
 Класс NurbCurve2d представляет неоднородные рациональные B-сплайны (NURBS) в двумерном пространстве.
 NurbCurve2dData
 Структура NurbCurve2dData предназначена для хранения данных, которые определяют объект NurbCurve2d.
 NurbCurve2dFitData
 Структура NurbCurve2dFitData предназначена для хранения данных, которые возвращает свойство NurbCurve2d.FitData.
 NurbCurve3d
 Класс NurbCurve3d представляет неоднородные рациональные B-сплайны (NURBS) в трехмерном пространстве.
 NurbCurve3dData
 Структура NurbCurve3dData предназначена для хранения данных, которые определяют объект NurbCurve3d.
 NurbSurface
 Класс NurbSurface представляет параметрические NURBS поверхности.
 NurbSurfaceDefinition
 Структура NurbSurfaceDefinition организует данные определения NURBS поверхности, доступ к которым предоставляет метод NurbSurface.GetDefinition.
 OffsetCurve2d
 Класс OffsetCurve2d представляет двумерную кривую, получаемую операцией смещения исходной (базовой) кривой.
 OffsetCurve3d
 Класс OffsetCurve3d представляет трехмерную кривую, получаемую операцией смещения исходной (базовой) кривой.
 OffsetSurface
 Класс OffsetSurface представляет 3D-поверхность, которая построена как точное смещение другой поверхности.
 PlanarEntity
 Класс PlanarEntity является абстрактным базовым классом для всех типов плоских поверхностей в трехмерном пространстве.
 PlanarEquationCoefficients
 Структура PlanarEquationCoefficients представляет коэффициенты общего уравнения плоскости в трехмерном пространстве.
 Plane
 Класс Plane представляет параметризованную бесконечную плоскость в трехмерном пространстве.
 Point2d
 Данный класс представляет геометрические точки в 2D-пространстве.
 Point2dCollection
 Класс Point2dCollection представляет коллекцию двумерных точек.
 Point3d
 Этот класс представляет точки (позиции) в трехмерном пространстве.
 Point3dCollection
 Этот класс представляет коллекцию 3D-точек.
 PointEntity2d
 Класс PointEntity2d является базовым классом для всех классов двумерных точечных объектов.
 PointEntity3d
 Класс PointEntity3d является базовым классом для всех классов трехмерных точечных объектов.
 PointOnCurve2d
 Класс PointOnCurve2d представляет точку на параметрической 2D-кривой.
 PointOnCurve3d
 Этот класс представляет точку на трехмерной параметрической кривой.
 PointOnSurface
 Класс PointOnSurface представляет точку на трехмерной поверхности.
 PolylineCurve2d
 Класс PolylineCurve2d представляет кусочно-линейные сплайны в двумерном пространстве.
 PolylineCurve3d
 Класс PolylineCurve3d представляет кусочно-линейные сплайны в трехмерном пространстве.
 Position2d
 Класс Position2d представляет точки как позиции в двумерном пространстве.
 Position3d
 Класс Position3d представляет точки как позиции в трехмерном пространстве.
 Ray2d
 Класс Ray2d представляет двумерный луч, полубесконечную линию в двумерном пространстве.
 Ray3d
 Класс Ray3d представляет трехмерный луч, полубесконечную линию в трехмерном пространстве.
 Scale2d
 Структура Scale2d представляет преобразование масштаба в двумерном пространстве.
 Scale3d
 Структура Scale3d представляет преобразование масштаба в трехмерном пространстве.
 Sphere
 Класс Sphere представляет сферическую поверхность.
 SplineEntity2d
 Класс SplineEntity2d представляет различные двумерные сплайновые объекты. В текущей версии не реализован.
 SplineEntity3d
 Класс SplineEntity3d представляет различные сплайновые объекты в трехмерном пространстве. В текущей версии не реализован.
 Surface
 Класс Surface является абстрактным классом для всех параметрических поверхностей.
 SurfaceCurve2dTo3d
 Класс SurfaceCurve2dTo3d обеспечивает трехмерное представление кривых, определенных в двумерном параметрическом пространстве поверхности.
 SurfaceSurfaceIntersector
 Класс SurfaceSurfaceIntersector представляет данные пересечения двух поверхностей.
 SurfaceSurfaceIntersectorConfigurations
 Структура SurfaceSurfaceIntersectorConfigurations предназначена для хранения данных о конфигурации каждой из двух пересекающихся поверхностей в окрестности кривой пересечения.
 Tolerance
 Структура Tolerance представляет значения точности (допуски), используемые для проверки равенства точек и векторов.
 Torus
 Класс Torus представляет тороидальные сегменты.
 Vector2d
 Структура Vector2d представляет векторы в двумерном пространстве.
 Vector2dCollection
 Класс Vector2dCollection представляет коллекцию двумерных векторов.
 Vector2dCollectionEnumerator
 Класс Vector2dCollectionEnumerator представляет перечислитель для коллекции Vector2dCollection.
 Vector3d
 Этот класс представляет векторы в трехмерном пространстве.
 Vector3dCollection
 Класс Vector3dCollection представляет коллекцию трехмерных векторов.
 Vector3dCollectionEnumerator
 Класс Vector3dCollectionEnumerator представляет перечислитель для коллекции Vector3dCollection.
 Ссылки
 Классы, Перечисления, Структуры
 Ваши комментарии по поводу этого топика: Послать отзыв!