Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.PolylineCurve3d.Create
 Послать отзыв
 Метод создает объект на основе переданного неуправляемого указателя.
 Синтаксис
C#
Visual Basic
Копировать Код
public static PolylineCurve3d Create( IntPtr unmanagedPointer, bool autoDelete );
Копировать Код
Public Shared Function Create( unmanagedPointer As IntPtr, autoDelete As Boolean ) As PolylineCurve3d
 Параметры
 Параметры
 Описание
 unmanagedPointer
 Входной неуправляемый указатель на исходный объект. Тип IntPtr.
 autoDelete
 Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.
 Возвращает
 Возвращает созданный объект. Тип PolylineCurve3d.
 Описание
 Метод создает объект на основе переданного неуправляемого указателя.
 Ссылки
 Teigha.Geometry.PolylineCurve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!