Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MText.ColumnCount
 Послать отзыв
 Свойство представляет количество столбцов (текстовых колонок) у данного объекта MText.
 Синтаксис
C#
Visual Basic
Копировать Код
public int ColumnCount;
Копировать Код
Public Property ColumnCount As Integer
 Возвращает
 Возвращает количество столбцов. Тип int.
 Описание
 Свойство представляет количество столбцов (текстовых колонок) у данного объекта MText.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MText, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!