Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.NurbsData
 Послать отзыв
 Структура NurbsData заменяет любые имеющиеся данные сплайна данными, предоставленными через параметры этой структуры.
 Иерархия классов
Teigha::DatabaseServices::NurbsData
 Синтаксис
C#
Visual Basic
Копировать Код
public struct NurbsData
Копировать Код
Public Structure NurbsData
 Описание
 Структура NurbsData заменяет любые имеющиеся данные сплайна данными, предоставленными через параметры этой структуры.
 Топики
 Имя
 Описание
 NurbsData Методы
 Ниже перечислены методы класса NurbsData.
 NurbsData Операторы
 Ниже перечислены операторы класса NurbsData.
 NurbsData Свойства
 Ниже перечислены свойства класса NurbsData.
 Ссылки
 NurbsData Методы, NurbsData Операторы, NurbsData Свойства, Топики, NurbsData Методы, NurbsData Операторы, NurbsData Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!