Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 LayerTableRecord.IsLocked
 Послать отзыв
 Свойство предназначено для настройки блокировки слоя.
 Синтаксис
C#
Visual Basic
public bool IsLocked;
Public Property IsLocked() As bool
 Возвращает
 Возвращает тип данных bool:
true – слой заблокирован;
false – слой не заблокирован.
 Описание
 С помощью свойства можно получить информацию о том, заблокирован слой или нет в виде типа данных bool и изменить его значение. Объекты заблокированного слоя видны на чертеже, но недоступны для изменений и перемещений.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.LayerTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!