Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ResultBuffer.Equals
 Послать отзыв
 Метод предназначен для сравнения на идентичность с объектом obj, который передан в аргументе. Возвращает значение true, если объекты идентичны.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool Equals( ref Object obj );
Копировать Код
Public Function Equals( ByRef obj As Object ) As Boolean
 Параметры
 Параметры
 Описание
 obj
 Объект, с которым выполняется сравнение. Тип Object.
 Возвращает
 Возвращает true в случае, если оба объекта идентичны, и false в противном случае.
 Описание
 Метод предназначен для сравнения на идентичность с объектом obj, который передан в аргументе. Возвращает значение true, если объекты идентичны.
 Ссылки
 Teigha.DatabaseServices.ResultBuffer, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!