Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод BlockReference.ExplodeToOwnerSpace
 Послать отзыв
 Синтаксис
C#
Visual Basic
public void ExplodeToOwnerSpace();
Public Sub ExplodeToOwnerSpace()
 Описание
 Разбивает ссылку на блок на отдельные компоненты. Метод добавляет полученные геометрические объекты в ту BlockTableRecord, которая является собственником той BlockReference, в которой вызван метод. Note BlockReference должен быть в базе данных и должен быть однородно масштабирован.
 Ссылки
 Teigha.DatabaseServices.BlockReference, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!