Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.TableStyle.TextStyle
 Послать отзыв
 Метод позволяет получить текстовый стиль, предусмотренный в указанном стиле ячейки.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual DatabaseServices.ObjectId TextStyle( ref String styleName );
Копировать Код
Public Overridable Function TextStyle( ByRef styleName As String ) As DatabaseServices.ObjectId
 Параметры
 Параметры
 Описание
 styleName
 Имя стиля ячейки таблицы. Тип String.
 Возвращает
 Возвращает идентификатор текстового стиля. Тип DatabaseServices.ObjectId.
 Описание
 Метод позволяет получить текстовый стиль, предусмотренный в указанном стиле ячейки.
 Ссылки
 Teigha.DatabaseServices.TableStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!