Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbSurface
 Послать отзыв
 Класс NurbSurface представляет параметрические NURBS поверхности.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Geometry::Entity3d Teigha::Geometry::Surface Teigha::Geometry::NurbSurface
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdGeNurbSurface")] public sealed class NurbSurface : Surface
Копировать Код
<Wrapper("OdGeNurbSurface")> Public NotInheritable Class NurbSurface Inherits Surface
 Описание
 Класс NurbSurface представляет параметрические NURBS поверхности.
 Методы
 Конструкторы
 Teigha.Geometry.NurbSurface
 Имя
 Описание
 NurbSurface
 Это обзор перегрузок NurbSurface.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Geometry.Entity3d
 Имя
 Описание
 Entity3d Методы
 Ниже перечислены методы класса Entity3d.
 Teigha.Geometry.Surface
 Имя
 Описание
 Surface Методы
 Ниже перечислены методы класса Surface.
 Surface Свойства
 Ниже перечислены свойства класса Surface.
 Teigha.Geometry.NurbSurface
 Имя
 Описание
 NurbSurface Методы
 Ниже перечислены методы класса NurbSurface.
 NurbSurface Свойства
 Ниже перечислены свойства класса NurbSurface.
 Ссылки
 NurbSurface Конструктор, NurbSurface Методы, NurbSurface Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!