Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Face.Face
 Послать отзыв
 Конструктор класса Face по умолчанию.
 Синтаксис
C#
Visual Basic
Копировать Код
public Face();
Копировать Код
Public Sub New()
 Описание
 Конструктор класса Face по умолчанию.
 Ссылки
 Teigha.DatabaseServices.Face, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!