Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector3d.Y
 Послать отзыв
 Свойство возвращает значение Y-координаты данного вектора.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Y;
Копировать Код
Public Property Y() As Double
 Возвращает
 Возвращает значение координаты Y данного вектора. Тип double.
 Описание
 Свойство возвращает значение Y-координаты данного вектора.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.Vector3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!