Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve2d.GetDistanceTo
 Послать отзыв
 Метод вычисляет расстояние между ближайшими точками на этой кривой и указанной кривой.
 Синтаксис
C#
Visual Basic
Копировать Код
public double GetDistanceTo( ref Curve2d curve );
Копировать Код
Public Function GetDistanceTo( ByRef curve As Curve2d ) As Double
 Параметры
 Параметры
 Описание
 curve
 Входная кривая. Тип Curve2d.
 Возвращает
 Возвращает минимальное расстояние между точками на обеих кривых. Тип double.
 Описание
 Метод вычисляет расстояние между ближайшими точками на этой кривой и указанной кривой. Используется вызов метода Curve2d.GetDistanceTo(Curve2d curve, Tolerance tolerance) со значением точности по умолчанию, равным Tolerance.Global.
 Ссылки
 Teigha.Geometry.Curve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!