Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CompoundObjectId.CompoundObjectId
 Послать отзыв
 Конструктор класса CompoundObjectId, предназначенный для копирования объекта класса CompoundObjectId с использованием переданного идентификатора составного объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public CompoundObjectId( ref CompoundObjectId A_0 );
Копировать Код
Public Sub New( ByRef A_0 As CompoundObjectId )
 Параметры
 Параметры
 Описание
 A_0
 Идентификатор копируемого составного объекта. Тип CompoundObjectId.
 Описание
 Конструктор класса CompoundObjectId, предназначенный для копирования объекта класса CompoundObjectId с использованием переданного идентификатора составного объекта.
 Ссылки
 Teigha.DatabaseServices.CompoundObjectId, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!