Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DatabaseSummaryInfoBuilder.Subject
 Послать отзыв
 Свойство предоставляет доступ к описанию назначения данного объекта или предметной области, к которой он относится.
 Синтаксис
C#
Visual Basic
Копировать Код
public String Subject;
Копировать Код
Public Property Subject() As String
 Возвращает
 Возвращает значение поля Subject. Тип String.
 Описание
 Свойство предоставляет доступ к описанию назначения данного объекта или предметной области, к которой он относится.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.DatabaseSummaryInfoBuilder, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!