Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.SetRowHeight
 Послать отзыв
 Метод позволяет установить одинаковую высоту строки для всех строк в данном объекте Table.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetRowHeight( double height );
Копировать Код
Public virtual Sub SetRowHeight( height As double )
 Параметры
 Параметры
 Описание
 height
 Новая высота строки, double.
 Описание
 Метод позволяет установить одинаковую высоту строки для всех строк в данном объекте Table.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!