Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DxfFiler.RewindFiler
 Послать отзыв
 Метод предназначен для переключения файлера в состояние по умолчанию без изменения положения указателя на данные.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual int RewindFiler();
Копировать Код
Public Overridable Function RewindFiler() As Integer
 Возвращает
 Метод в реализации по умолчанию возвращает 0. Тип int.
 Описание
 Метод предназначен для переключения файлера в состояние по умолчанию без изменения положения указателя на данные, которые он считывает или записывает.
 Замечания
 Реализация по умолчанию этого метода не делает ничего.
 Ссылки
 Teigha.DatabaseServices.DxfFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!