Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Point3d.IsEqualTo
 Послать отзыв
 Метод проверяет совпадение 3D-точек.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsEqualTo( Point3d point );
Копировать Код
Public Function IsEqualTo( point As Point3d ) As Boolean
 Параметры
 Параметры
 Описание
 point
 Точка, с которой проверяется совпадение. Тип Point3d.
 Возвращает
 Возвращает true, если точки совпадают; в противном случае возвращает false.
 Описание
 Метод позволяет проверить, что данная точка совпадает с указанной точкой point. Реализация метода использует вызов Point3d.IsEqualTo(Point3d point, Tolerance tolerance) с допуском, равным Tolerance.Global.
 Ссылки
 Teigha.Geometry.Point3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!