Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CurveBoundary.Contour
 Послать отзыв
 Свойство Contour представляет данные определения этой криволинейной границы.
 Синтаксис
C#
Visual Basic
Копировать Код
public CurveBoundaryData Contour;
Копировать Код
Public Property Contour As CurveBoundaryData
 Возвращает
 Возвращает данные определения криволинейной границы. Тип CurveBoundaryData.
 Описание
 Свойство Contour представляет данные определения этой криволинейной границы.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.Geometry.CurveBoundary, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!