Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.EdgeRef
 Послать отзыв
 Класс EdgeRef представляет ссылку на ребро.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::DatabaseServices::GeomRef Teigha::DatabaseServices::SubentRef Teigha::DatabaseServices::EdgeRef
 Синтаксис
C#
Visual Basic
Копировать Код
[TypeDescriptionProvider("Teigha.ComponentModel.TypeDescriptionProvider`1[[Teigha.DatabaseServices.EdgeRef, TD_MgdDbConstraints]], TD_MgdDbConstraints"), Teigha.Runtime.Wrapper("AcDbEdgeRef")] public class EdgeRef : SubentRef;
Копировать Код
<TypeDescriptionProvider("Teigha.ComponentModel.TypeDescriptionProvider`1[[Teigha.DatabaseServices.EdgeRef, TD_MgdDbConstraints]], TD_MgdDbConstraints"), Teigha.Runtime.Wrapper("AcDbEdgeRef")> Public Class EdgeRef Inherits SubentRef
 Описание
 Класс EdgeRef представляет ссылку на ребро.
 Методы
 Конструкторы
 Teigha.DatabaseServices.EdgeRef
 Имя
 Описание
 EdgeRef
 Это обзор перегрузок EdgeRef.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.DatabaseServices.GeomRef
 Имя
 Описание
 GeomRef Методы
 Ниже перечислены методы класса GeomRef.
 GeomRef Свойства
 Ниже перечислены свойства класса GeomRef.
 Teigha.DatabaseServices.SubentRef
 Имя
 Описание
 SubentRef Методы
 Ниже перечислены методы класса SubentRef.
 SubentRef Свойства
 Ниже перечислены свойства класса SubentRef.
 Teigha.DatabaseServices.EdgeRef
 Имя
 Описание
 EdgeRef Свойства
 Ниже перечислены свойства класса EdgeRef.
 Ссылки
 EdgeRef Конструктор, EdgeRef Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!