Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CurveCurveIntersector2d.CurveCurveIntersector2d
 Послать отзыв
 Конструктор класса CurveCurveIntersector2d. Создает объект с двумя переданными кривыми и заданной геометрической точностью.
 Синтаксис
C#
Visual Basic
Копировать Код
public CurveCurveIntersector2d( ref Curve2d curve1, ref Curve2d curve2, Geometry.Tolerance tolerance );
Копировать Код
Public Sub New( ByRef curve1 As Curve2d, ByRef curve2 As Curve2d, tolerance As Geometry.Tolerance )
 Параметры
 Параметры
 Описание
 curve1
 Первая входная кривая. Тип Curve2d.
 curve2
 Вторая входная кривая. Тип Curve2d.
 tolerance
 Входное значение геометрической точности. Тип Geometry.Tolerance.
 Описание
 Конструктор класса CurveCurveIntersector2d. Создает объект с двумя переданными кривыми. Точки пересечения вычисляются в пределах заданной точности.
 Ссылки
 Teigha.Geometry.CurveCurveIntersector2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!