Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.TableHitTestInfo.Type
 Послать отзыв
 Свойство Type представляет тип результата проверки попадания в таблицу.
 Синтаксис
C#
Visual Basic
Копировать Код
public TableHitTestType Type;
Копировать Код
Public ReadOnly Property Type As TableHitTestType
 Возвращает
 Возвращает результат проверки попадания в таблицу. Значение из перечисления TableHitTestType.
 Описание
 Свойство Type представляет тип результата проверки попадания в таблицу. Отражается факт попадания в некоторую ячейку таблицы, либо мимо таблицы.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.TableHitTestInfo, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!