Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Line.Delta
 Послать отзыв
 Синтаксис
C#
Visual Basic
public Vector3d Delta;
Public Property Delta() As Vector3d
 Описание
 Возвращает вектор, полученный из начальной и конечной точек линии.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.Line, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!