Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 LayerTableRecord.GetViewportOverrides(ObjectId viewportId)
 Послать отзыв
 Метод предназначен для получения информации о переопределениях параметров слоя в видовом экране пространства листа.
 Синтаксис
C#
Visual Basic
Копировать Код
public LayerViewportProperties GetViewportOverrides(ObjectId viewportId);
Копировать Код
Public Function GetViewportOverrides(viewportId As ObjectId) As LayerViewportProperties
 Параметры
 Параметры
 Описание
 viewportId
 ObjectId видового экрана
 Возвращает
 Возвращает тип данных LayerViewportProperties.
 Описание
 В видовых экранах пространства листа можно переопределять цвет, тип линии, вес линии, прозрачность слоя. После переопределения параметров слоя в видовом экране будут применены новые параметры, а в остальных видовых экранах эти параметры останутся прежними.
 С помощью метода можно получить информацию о том, как переопределены параметры слоя в видовом экране.
 Ссылки
 Teigha.DatabaseServices.LayerTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!