Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.Dimlim
 Послать отзыв
 Свойство позволяет определить, включен ли режим отображения размерного текста в виде предельных размеров.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool Dimlim;
Копировать Код
Public Property Dimlim As Boolean
 Возвращает
 Возвращает true, если режим включен. В противном случае возвращает false.
 Описание
 Свойство позволяет определить, включен ли режим отображения размерного текста в виде предельных размеров.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!