Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.UnitType
 Послать отзыв
 Метод предназначен для получения типа единиц измерения (длины, площади, объема и т.п.) содержимого в строке указанного типа.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual DatabaseServices.UnitType UnitType( DatabaseServices.RowType type );
Копировать Код
Public virtual Function UnitType( type As DatabaseServices.RowType ) As DatabaseServices.UnitType
 Параметры
 Параметры
 Описание
 type
 Тип строки из перечисления RowType.
 Возвращает
 Возвращает тип единиц измерения как значение из перечисления DatabaseServices.UnitType.
 Описание
 Метод предназначен для получения типа единиц измерения для содержимого в строке указанного типа. Типы единиц определяются перечислением DatabaseServices.UnitType (безразмерная величина, длина, площадь, объем, углы и т.п.). Тип строки объекта Table определяется значением из перечисления RowType.
 Замечания
 Для получения того же результата предпочтительнее использовать Table.Cells[row,column].DataType.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!