Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.EllipticalArc2d.IsCircular
 Послать отзыв
 Метод позволяет проверить, не является ли данная дуга круглой. Используется геометрическая точность по умолчанию.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsCircular();
Копировать Код
Public Function IsCircular() As Boolean
 Возвращает
 Возвращает true, если с используемой точностью данную дугу можно считать круглой. В противном случае возвращает false.
 Описание
 Метод позволяет проверить, не является ли данная дуга круглой. Используется вызов метода EllipticalArc2d.IsCircular(Tolerance tolerance) с геометрической точностью, равной Tolerance.Global.
 Ссылки
 Teigha.Geometry.EllipticalArc2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!