Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocArrayPathParameters.GetEndOffset
 Послать отзыв
 Метод предоставляет смещение для конца массива по траектории.
 Синтаксис
C#
Visual Basic
Копировать Код
public double GetEndOffset( out String expression, out String evaluatorId );
Копировать Код
Public Function GetEndOffset( ByRef expression As String, ByRef evaluatorId As String ) As Double
 Параметры
 Параметры
 Описание
 expression
 Выражение для параметра. Тип String. Строка может быть пустой.
 evaluatorId
 Строковое представление идентификатора вычислителя. Тип String. Строка может быть пустой.
 Возвращает
 Возвращает смещение для конца массива по траектории. Тип double.
 Описание
 Метод предоставляет смещение для конца массива по траектории. Это смещение доступно, только если для распределения элементов массива по траектории используется метод MethodType.Divide.
 Если для параметра выражение отсутствует, то после выполнения метода строки expression и evaluatorId остаются пустыми.
 Ссылки
 Teigha.DatabaseServices.AssocArrayPathParameters, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!