Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Entity.IntersectWith(Entity
 Послать отзыв
 Метод вычисляет точки пересечения между текущим геометрическим объектом и указанным в параметре entityPointer, включая пересечения с ребрами ограничивающего прямоугольника. Найденные точки добавляются в коллекцию points в мировых координатах (WCS), а тип пересечения задаётся через параметр intersectType. Параметры thisGraphicSystemMarker и otherGraphicSystemMarker позволяют ограничить поиск пересечений конкретными подобъектами, но могут быть проигнорированы, если установлены в 0.
 Синтаксис
C#
Visual Basic
Копировать Код
public void IntersectWith(Entity entityPointer, Intersect intersectType, Point3dCollection points, IntPtr thisGraphicSystemMarker, IntPtr otherGraphicSystemMarker);
Копировать Код
Public Sub IntersectWith(entityPointer As Entity, intersectType As Intersect, points As Point3dCollection, thisGraphicSystemMarker As IntPtr, otherGraphicSystemMarker As IntPtr)
 Параметры
 Параметры
 Описание
 entityPointer
 Входной объект, с которым проверяется пересечение текущего объекта. Тип Entity
 intersectType
 Тип пересечения, определяющий поведение при поиске точек пересечения (с продлением или без). Тип Intersect
 points
 Коллекция, в которую добавляются все найденные точки пересечения (в WCS). Тип Point3dCollection
 thisGraphicSystemMarker
 Графический маркер подобъекта текущего объекта. Указывает на конкретный подобъект, участвующий в операции. Используется, например, при работе с объектными привязками. Если ? 0 — игнорируется. Тип IntPtr
 otherGraphicSystemMarker
 Графический маркер подобъекта целевого объекта entityPointer. Если ? 0 — параметр игнорируется. Тип IntPtr
 Описание
 Метод IntersectWith вычисляет точки пересечения между текущим геометрическим объектом и другим объектом, указанным через параметр entityPointer, включая пересечение с ребрами ограничивающего прямоугольника (bounding box) текущего объекта. Тип пересечения задается параметром intersectType, который определяет, требуется ли продление одного или обоих объектов для поиска точек пересечения.
 Все найденные точки пересечения добавляются в коллекцию points в мировой системе координат (WCS). Для локализации поиска пересечений между конкретными подобъектами используются параметры thisGraphicSystemMarker и otherGraphicSystemMarker. Эти параметры содержат графические маркеры, указывающие на подобъекты текущего и целевого объектов соответственно. Если значение какого-либо из них меньше или равно 0 — соответствующий параметр игнорируется.
 При реализации метода в производных классах рекомендуется использовать встроенные графические библиотеки и их функционал (например, методы IsOn() или IntersectWith() из классов Curve3d и CircularArc3d) для поиска пересечений на уровне примитивов. Если тип объекта entityPointer не поддерживается напрямую, можно вызвать его собственный метод IntersectWith(), передав ему текущий объект в качестве аргумента.
 Ссылки
 Teigha.DatabaseServices.Entity, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!