Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Viewport.CenterPoint
 Послать отзыв
 Свойство CenterPoint представляет центральную точку данного видового экрана в координатах МСК (WCS).
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d CenterPoint;
Копировать Код
Public Property CenterPoint As Point3d
 Возвращает
 Возвращает центральную точку видового экрана. Тип Point3d.
 Описание
 Свойство CenterPoint представляет центральную точку данного видового экрана в мировой системе координат (WCS).
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Viewport, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!