Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CompositeParameter.CompositeParameter
 Послать отзыв
 Конструктор структуры CompositeParameter. Создает экземпляр структуры с переданным индексом подкривой и значением локального параметра.
 Синтаксис
C#
Visual Basic
Копировать Код
public CompositeParameter( int segmentIndex, double localParameter );
Копировать Код
Public Sub New( segmentIndex As Integer, localParameter As Double )
 Параметры
 Параметры
 Описание
 segmentIndex
 Индекс подкривой. Тип int.
 localParameter
 Значение локального параметра точки на указанной подкривой. Тип double.
 Описание
 Конструктор структуры CompositeParameter. Создает экземпляр структуры с переданным индексом подкривой и значением локального параметра.
 Ссылки
 Teigha.Geometry.CompositeParameter, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!