Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.ExternalSurface.ExternalSurfaceKind
 Послать отзыв
 Свойство ExternalSurfaceKind представляет информацию о системе, в которой было создано определение внешней поверхности.
 Синтаксис
C#
Visual Basic
Копировать Код
public ExternalEntityKind ExternalSurfaceKind;
Копировать Код
Public ReadOnly Property ExternalSurfaceKind As ExternalEntityKind
 Возвращает
 Возвращает информацию о системе, в которой было создано определение внешней поверхности. Перечисление ExternalEntityKind.
 Описание
 Свойство ExternalSurfaceKind представляет информацию о системе, в которой было создано определение внешней поверхности.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.ExternalSurface, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!