Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.ObscuredColor
 Послать отзыв
 Синтаксис
C#
Visual Basic
public int ObscuredColor;
Public Property ObscuredColor() As Integer
 Описание
 Возвращает или устанавливает текущее значение OBSCUREDCOLOR для базы данных.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!