Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ObjectId.GetHashCode
 Послать отзыв
 Возвращает хэш-код для данного объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public int GetHashCode();
Копировать Код
Public Function GetHashCode() As Integer
 Возвращает
 Возвращает целочисленный хэш-код, тип int.
 Описание
 Возвращает хэш-код для данного объекта. Подробнее см. в документации Microsoft .NET API.
 Ссылки
 Teigha.DatabaseServices.ObjectId, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!