Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Database.DeepCloneObjects
 Послать отзыв
 Синтаксис
C#
Visual Basic
public void DeepCloneObjects(ref ObjectIdCollection identifiers, ObjectId id, ref IdMapping mapping, bool deferTranslation);
Public Sub DeepCloneObjects(ByRef identifiers As ObjectIdCollection, id As ObjectId, ByRef mapping As IdMapping, deferTranslation As bool)
 Параметры
 Параметры
 Описание
 identifiers
 Коллекция объектов, которые должны быть клонированы
 id
 Id объекта, который будет владельцем клонированных объектов
 mapping
 Возвращаемая коллекция объектов, используемая для преобразования отношений между Id объектов
 deferTranslation
 Признак, задающий, должно ли преобразование отношений Id быть сделано самим методом
 Описание
 Клонирует все объекты, Id которых указаны в параметре identifiers и добавляет их в контейнер объектов с определенным владельцем (заданным параметром id). Параметр mapping заполняется IdMapping объектов, которые содержат objectId пар исходного и клонированного объектов. Этот массив может быть использован для последующей обработки объектов, участвующих в операции deepClone.
 Когда новым объектам назначаются владельцы, объекты слоев инициируют, что владельцем является словарь слоя базы данных и слой присваивает имя в словаре, которое соответствует имени, хранимому внутри слоя (по умолчанию объектам, которыми владеет словарь, даются анонимные имена, такие как "*A1").
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!