Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector2d.MultiplyBy
 Послать отзыв
 Метод реализует умножение данного вектора на заданное число.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector2d MultiplyBy( double value );
Копировать Код
Public Function MultiplyBy( value As Double ) As Vector2d
 Параметры
 Параметры
 Описание
 value
 Входное значение скалярного множителя. Тип double.
 Возвращает
 Возвращает результат умножения данного вектора на скаляр value. Тип Vector2d.
 Описание
 Метод реализует умножение данного вектора на заданное вещественное число value.
 Ссылки
 Teigha.Geometry.Vector2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!