Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LayoutCopiedEventArgs
 Послать отзыв
 Этот класс представляет данные для события LayoutCopied в диспетчере листов.
 Иерархия классов
Teigha::DatabaseServices::LayoutCopiedEventArgs
 Синтаксис
C#
Visual Basic
Копировать Код
public class LayoutCopiedEventArgs : EventArgs;
Копировать Код
Public Class LayoutCopiedEventArgs Inherits EventArgs
 Описание
 Этот класс представляет данные для события LayoutCopied в диспетчере листов.
 Топики
 Имя
 Описание
 LayoutCopiedEventArgs Свойства
 Ниже перечислены свойства класса LayoutCopiedEventArgs.
 Ссылки
 LayoutCopiedEventArgs Свойства, Топики, LayoutCopiedEventArgs Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!