Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotStyleTable.PlotStyleAt
 Послать отзыв
 Метод предоставляет стиль печати, который присутствует в данной таблице PlotStyleTable под указанным именем
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual PlotStyle PlotStyleAt( ref String name );
Копировать Код
Public Overridable Function PlotStyleAt( ByRef name As String ) As PlotStyle
 Параметры
 Параметры
 Описание
 name
 Входное имя стиля печати. Тип String.
 Возвращает
 Возвращает найденный стиль печати. Тип PlotStyle.
 Описание
 Метод предоставляет стиль печати, который присутствует в данной таблице PlotStyleTable под указанным именем.
 Ссылки
 Teigha.DatabaseServices.PlotStyleTable, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!