Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.UnderlayReference.Position
 Послать отзыв
 Свойство Position представляет положение подложки в мировой системе координат (WCS).
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d Position;
Копировать Код
Public Property Position As Point3d
 Возвращает
 Возвращает 3D-точку, положение которой определяет положение подложки в WCS. Тип Point3d.
 Описание
 Свойство Position представляет точку привязки (положение) подложки в мировой системе координат (WCS).
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.UnderlayReference, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!