Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.PolylineCurve3d.PolylineCurve3d
 Послать отзыв
 Конструктор по умолчанию класса PolylineCurve3d. Создает новый объект без каких-либо реальных данных.
 Синтаксис
C#
Visual Basic
Копировать Код
public PolylineCurve3d();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса PolylineCurve3d. Создает новый объект без каких-либо реальных данных.
 Ссылки
 Teigha.Geometry.PolylineCurve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!