Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SymbolUtilityServices.ViewportActiveName
 Послать отзыв
 Свойство ViewportActiveName представляет предопределенную запись символа для активного имени видового экрана.
 Синтаксис
C#
Visual Basic
Копировать Код
public static String ViewportActiveName;
Копировать Код
Public Shared ReadOnly Property ViewportActiveName As String
 Возвращает
 Возвращает активное имя видового экрана. Тип String.
 Описание
 Свойство ViewportActiveName представляет предопределенную запись символа для активного имени видового экрана. Не может быть ни NULL, ни пустой строкой.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.SymbolUtilityServices, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!