Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CompositeCurve2d
 Послать отзыв
 Класс CompositeCurve2d представляет двумерные составные кривые, которые состоят из произвольного количества подкривых, соединенных конец в конец.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Geometry::Entity2d Teigha::Geometry::Curve2d Teigha::Geometry::CompositeCurve2d
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdGeCompositeCurve2d")] public sealed class CompositeCurve2d : Curve2d
Копировать Код
<Wrapper("OdGeCompositeCurve2d")> Public NotInheritable Class CompositeCurve2d Inherits Curve2d
 Описание
 Класс CompositeCurve2d представляет двумерную составную кривую, которая рассматривается как одна кривая, но состоящая из произвольного количества составляющих её подкривых, соединенных конец в конец. Например, составная кривая может состоять из четырех прямолинейных сегментов, образующих квадрат.
 Замечания
 Каждая из составляющих подкривых должна быть ограниченной кривой. Это означает, что бесконечные линии и лучи не могут использоваться в качестве элементов составной кривой.
 Объект CompositeCurve2d хранит список указателей на подкривые. Начальный параметр составной кривой равен 0.0. Значение параметра в конечной точке первой подкривой приблизительно равно длине первой подкривой (пусть это будет L1). Значение параметра в конечной точке второй подкривой будет равно L1 плюс приблизительная длина второй подкривой и т.д.
 Методы
 Конструкторы
 Teigha.Geometry.CompositeCurve2d
 Имя
 Описание
 CompositeCurve2d
 Конструктор класса CompositeCurve2d. Создает составную кривую из кривых в предоставленном списке.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Geometry.Entity2d
 Имя
 Описание
 Entity2d Методы
 Ниже перечислены методы класса Entity2d.
 Teigha.Geometry.Curve2d
 Имя
 Описание
 Curve2d Методы
 Ниже перечислены методы класса Curve2d.
 Curve2d Свойства
 Ниже перечислены свойства класса Curve2d.
 Teigha.Geometry.CompositeCurve2d
 Имя
 Описание
 CompositeCurve2d Методы
 Ниже перечислены методы класса CompositeCurve2d.
 Ссылки
 CompositeCurve2d Методы, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!