Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DxfFiler.Seek
 Послать отзыв
 Перемещает указатель ввода-вывода данного файлера в указанную позицию.
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract void Seek( long long offset, int method );
Копировать Код
Public MustOverride Sub Seek( offset As long long, method As Integer )
 Параметры
 Параметры
 Описание
 offset
 Смещение указателя в байтах. Тип long long.
 method
 Метод поиска новой позиции. Тип int. Допустимы следующие значения: 0 (абсолютное значение), 1 (относительно текущего положения), 2 (от конца файла).
 Описание
 Перемещает указатель ввода-вывода данного файлера в указанную позицию. Реализация по умолчанию этого метода не делает ничего.
 Ссылки
 Teigha.DatabaseServices.DxfFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!