Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AbstractViewPE.UpperRightCorner
 Послать отзыв
 Свойство UpperRightCorner представляет координаты правого верхнего угла связанного видового экрана.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point2d UpperRightCorner;
Копировать Код
Public ReadOnly Property UpperRightCorner As Point2d
 Возвращает
 Возвращает координаты правого верхнего угла видового экрана. Тип Point2d.
 Описание
 Свойство UpperRightCorner представляет координаты правого верхнего угла связанного видового экрана.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.AbstractViewPE, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!