Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.DeleteRows
 Послать отзыв
 Метод предназначен для удаления из таблицы заданного количества строк, начиная со строки с указанным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void DeleteRows( int row, int rows );
Копировать Код
Public virtual Sub DeleteRows( row As Integer, rows As Integer )
 Параметры
 Параметры
 Описание
 row
 Индекс первой удаляемой строки, тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 rows
 Количество удаляемых строк, тип int.
 Описание
 Метод предназначен для удаления из таблицы заданного количества строк, начиная со строки с указанным индексом.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!