Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 LayerTableRecord.LayerTableRecord(IntPtr, bool)
 Послать отзыв
 Конструктор класса.
 Синтаксис
C#
Visual Basic
public LayerTableRecord(IntPtr unmanagedPointer, bool autoDelete);
Public Sub New(unmanagedPointer As IntPtr, autoDelete As bool)
 Описание
 Конструктор по умолчанию. Инициализирует цвета до 7 (белый);
 устанавливает IsFrozen, IsLocked, IsOff, ViewportVisibilityDefault и IsPlottable в false; Id типа линии в null.
 Ссылки
 Teigha.DatabaseServices.LayerTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!