Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AlignedDimension.DimLinePoint
 Послать отзыв
 Свойство предоставляет доступ на изменение к точке определения размерной линии (в координатах WCS).
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d DimLinePoint;
Копировать Код
Public Property DimLinePoint() As Point3d
 Возвращает
 Возвращает точку Point3d в мировой системе координат (WCS).
 Описание
 Свойство предоставляет доступ на изменение к точке определения размерной линии (в координатах WCS). Эта точка гарантированно располагается где-то на размерной линии.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.AlignedDimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!