Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AbstractViewPE.FieldHeight
 Послать отзыв
 Свойство FieldHeight представляет высоту поля камеры вида.
 Синтаксис
C#
Visual Basic
Копировать Код
public double FieldHeight;
Копировать Код
Public ReadOnly Property FieldHeight As Double
 Возвращает
 Возвращает высоту поля камеры вида в системе координат дисплея (DCS). Тип double.
 Описание
 Свойство FieldHeight представляет высоту поля камеры вида. Определяется в системе координат дисплея (DCS).
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.AbstractViewPE, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!