Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PathOption
 Послать отзыв
 Данное перечисление определяет поддерживаемые опции файловых путей.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum PathOption { AbsolutePath = 3, NoPath = 1, PathAndFile = 4, RelativePath = 2 }
Копировать Код
Public Enum PathOption AbsolutePath = 3 NoPath = 1 PathAndFile = 4 RelativePath = 2 End Enum
 Члены
 Члены
 Описание
 AbsolutePath
 Значение: 3. Хранить абсолютный путь.
 NoPath
 Значение: 1. Не хранить путь.
 PathAndFile
 Значение: 4. Хранить путь и имя файла.
 RelativePath
 Значение: 2. Хранить относительный путь.
 Описание
 Данное перечисление определяет поддерживаемые опции файловых путей.
 Ваши комментарии по поводу этого топика: Послать отзыв!