Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.ClipBoundary2dData.ClippedVertices
 Послать отзыв
 Свойство ClippedVertices представляет массив обрезанных вершин.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point2dCollection ClippedVertices;
Копировать Код
Public ReadOnly Property ClippedVertices As Point2dCollection
 Возвращает
 Возвращает массив обрезанных вершин. Тип Point2dCollection.
 Описание
 Свойство ClippedVertices представляет массив обрезанных вершин.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.ClipBoundary2dData, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!