Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод DBText.ConvertFieldToText
 Послать отзыв
 Синтаксис
C#
Visual Basic
public void ConvertFieldToText();
Public Sub ConvertFieldToText()
 Описание
 Если текст содержит поля, этот метод преобразует их в текст и удаляет поля. Он не вычисляет поля до их преобразования.
 Ссылки
 Teigha.DatabaseServices.DBText, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!