Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.TableContent.SetRowHeight
 Послать отзыв
 Метод позволяет задать высоту строки с указанным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetRowHeight( int row, double height );
Копировать Код
Public Overridable Sub SetRowHeight( row As Integer, height As Double )
 Параметры
 Параметры
 Описание
 row
 Индекс строки. Тип int.
 height
 Новое значение высоты строки. Тип double.
 Описание
 Метод позволяет задать высоту строки с указанным индексом.
 Ссылки
 Teigha.DatabaseServices.TableContent, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!