Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotSettings.ShadePlotCustomDpi
 Послать отзыв
 Свойство ShadePlotCustomDpi представляет пользовательское разрешение, с которым будут выводиться на печать тонированные и векторизованные видовые экраны, если свойству ShadePlotResLevel задано значение ShadePlotResLevel.Custom.
 Синтаксис
C#
Visual Basic
Копировать Код
public short ShadePlotCustomDpi;
Копировать Код
Public Property ShadePlotCustomDpi As Short
 Возвращает
 Возвращает пользовательское разрешение при печати в единицах dpi (точки на дюйм). Тип short.
 Описание
 Свойство ShadePlotCustomDpi представляет пользовательское разрешение, с которым будут выводиться на печать тонированные и векторизованные видовые экраны, если свойству ShadePlotResLevel задано значение ShadePlotResLevel.Custom.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.PlotSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!