Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Ole2Frame
 Послать отзыв
 Этот класс обеспечивает поддержку объектов OLE 2 в чертежах nanoCAD.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::GraphicsInterface::Drawable Teigha::DatabaseServices::DBObject Teigha::DatabaseServices::Entity Teigha::DatabaseServices::Ole2Frame
 Синтаксис
C#
Visual Basic
Копировать Код
[TypeDescriptionProvider("Teigha.ComponentModel.TypeDescriptionProvider`1[[Teigha.DatabaseServices.Ole2Frame, TD_Mgd]], TD_Mgd")] [Wrapper("AcDbOle2Frame")] public class Ole2Frame : Entity
Копировать Код
<TypeDescriptionProvider("Teigha.ComponentModel.TypeDescriptionProvider`1[[Teigha.DatabaseServices.Ole2Frame, TD_Mgd]], TD_Mgd")> <Wrapper("AcDbOle2Frame")> Public Class Ole2Frame Inherits Entity
 Описание
 Этот класс обеспечивает поддержку объектов OLE 2 в чертежах nanoCAD. По сути, он предоставляет окно для отображения предписанного объекта OLE 2.
 Методы
 Конструкторы
 Teigha.GraphicsInterface.Drawable
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 Drawable
 Конструктор класса Teigha.GraphicsInterface.Drawable. (Унаследован от Drawable)
 Teigha.DatabaseServices.DBObject
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 DBObject
 Конструктор. (Унаследован от DBObject)
 Teigha.DatabaseServices.Ole2Frame
 Имя
 Описание
 Ole2Frame
 Конструктор по умолчанию класса Ole2Frame.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.GraphicsInterface.Drawable
 Имя
 Описание
 Drawable Методы
 Ниже перечислены методы класса Drawable.
 Drawable Свойства
 Ниже перечислены свойства класса Drawable.
 Teigha.DatabaseServices.DBObject
 Имя
 Описание
 DBObject Методы
 Ниже перечислены методы класса DBObject.
 DBObject Свойства
 Ниже перечислены свойства класса DBObject.
 DBObject События
 Ниже перечислены события класса DBObject.
 Teigha.DatabaseServices.Entity
 Имя
 Описание
 Entity Методы
 Ниже перечислены методы класса Entity.
 Entity Свойства
 Ниже перечислены свойства класса Entity.
 Teigha.DatabaseServices.Ole2Frame
 Имя
 Описание
 Ole2Frame Перечисления
 Ниже перечислены перечисления класса Ole2Frame.
 Ole2Frame Методы
 Ниже перечислены методы класса Ole2Frame.
 Ole2Frame Свойства
 Ниже перечислены свойства класса Ole2Frame.
 Ссылки
 Ole2Frame Перечисления, Ole2Frame Методы, Ole2Frame Свойства, Методы, Топики, Ole2Frame Перечисления, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства, DBObject События
 Ваши комментарии по поводу этого топика: Послать отзыв!