Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GeoLocationData.VerticalUnits
 Послать отзыв
 Свойство обеспечивает доступ к типу вертикальных единиц измерения.
 Синтаксис
C#
Visual Basic
Копировать Код
public UnitsValue VerticalUnits;
Копировать Код
Public Property VerticalUnits As UnitsValue
 Возвращает
 Возвращает тип единиц измерения из перечисления UnitsValue.
 Описание
 Свойство обеспечивает доступ к типу вертикальных единиц измерения.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.GeoLocationData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!