Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FitData.IsEqualTo
 Послать отзыв
 Метод предназначен для сравнения этого объекта с другим объектом FitData и возвращает true, если они равны.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsEqualTo( FitData other );
Копировать Код
Public Function IsEqualTo( other As FitData ) As Boolean
 Параметры
 Параметры
 Описание
 other
 Объект, с которым сравнивается данный. Тип FitData.
 Возвращает
 Возвращает true, если объект other равен данному объекту. В противном случае возвращает false.
 Описание
 Метод предназначен для сравнения этого объекта с другим объектом FitData и возвращает true, если они равны.
 Ссылки
 Teigha.DatabaseServices.FitData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!