Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbCurve3d.GetParametersOfC1Discontinuity
 Послать отзыв
 Метод предоставляет значения параметра всех точек сплайна, где в пределах указанной точности нарушена C1 непрерывность (неравные касательные векторы слева и справа от точки).
 Синтаксис
C#
Visual Basic
Копировать Код
public DoubleCollection GetParametersOfC1Discontinuity( Tolerance tolerance );
Копировать Код
Public Function GetParametersOfC1Discontinuity( tolerance As Tolerance ) As DoubleCollection
 Параметры
 Параметры
 Описание
 tolerance
 Входная точность. Тип Tolerance.
 Возвращает
 Возвращает массив значений параметра в точках с нарушенной C1 непрерывностью. Тип DoubleCollection.
 Описание
 Метод предоставляет значения параметра всех точек сплайна, где в пределах указанной точности нарушена C1 непрерывность. В таких точках касательные векторы слева и справа от точки хотя и коллинеарны, но отличаются по модулю.
 Ссылки
 Teigha.Geometry.NurbCurve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!