Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MlineStyleElementCollection.RemoveAt
 Послать отзыв
 Метод удаляет из коллекции элемент MlineStyleElement с указанным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public void RemoveAt( int index );
Копировать Код
Public Sub RemoveAt( index As Integer )
 Параметры
 Параметры
 Описание
 index
 Индекс удаляемого элемента коллекции. Тип int. Индексы отсчитываются от нуля.
 Описание
 Метод удаляет из коллекции элемент MlineStyleElement с указанным индексом. Нумерация элементов коллекции начинается с 0.
 Ссылки
 Teigha.DatabaseServices.MlineStyleElementCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!