Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AbstractViewportData.IsGridOn
 Послать отзыв
 Свойство IsGridOn позволяет определить, включен ли в видовом экране режим отображения сетки.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsGridOn;
Копировать Код
Public Property IsGridOn As Boolean
 Возвращает
 Возвращает true, если режим отображения сетки включен. В противном случае возвращает false.
 Описание
 Свойство IsGridOn позволяет определить, включен ли в видовом экране режим отображения сетки.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.AbstractViewportData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!