Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CellRange.CanInsertRow
 Послать отзыв
 Свойство позволяет определить, можно ли вставить строку в диапазон.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool CanInsertRow;
Копировать Код
Public ReadOnly Property CanInsertRow As Boolean
 Возвращает
 Возвращает true, если вставить строку можно. В противном случае возвращает false.
 Описание
 Свойство позволяет определить, можно ли вставить строку в диапазон.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.CellRange, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!