Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.HostApplicationServices.GRIPHOT
 Послать отзыв
 Свойство обеспечивает доступ к значению цвета выделенных ручек. Индекс цвета принимает значения в диапазоне [1..255].
 Синтаксис
C#
Visual Basic
Копировать Код
public short GRIPHOT;
Копировать Код
Public Property GRIPHOT As Short
 Возвращает
 Возвращает индекс цвета выделенных ручек. Тип short.
 Описание
 Свойство обеспечивает доступ к значению цвета выделенных ручек. Индекс цвета принимает значения в диапазоне [1..255].
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.HostApplicationServices, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!