Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbCurve3dFitData.FitPoints
 Послать отзыв
 Свойство FitPoints представляет массив определяющих точек NURB кривой.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3dCollection FitPoints;
Копировать Код
Public ReadOnly Property FitPoints As Point3dCollection
 Возвращает
 Возвращает массив определяющих точек NURB кривой. Тип Point3dCollection.
 Описание
 Свойство FitPoints представляет массив определяющих точек NURB кривой.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.NurbCurve3dFitData, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!