Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.KnotCollection.Add
 Послать отзыв
 Метод добавляет к данному узловому вектору новый узел и возвращает его индекс в коллекции.
 Синтаксис
C#
Visual Basic
Копировать Код
public int Add( double value );
Копировать Код
Public Function Add( value As Double ) As Integer
 Параметры
 Параметры
 Описание
 value
 Добавляемый узел. Тип double.
 Возвращает
 Возвращает индекс нового узла в коллекции. Тип int.
 Описание
 Метод добавляет к данному узловому вектору новый узел и возвращает его индекс в коллекции.
 Ссылки
 Teigha.Geometry.KnotCollection, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!