Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.BoundedPlane.Create
 Послать отзыв
 Метод создает объект BoundedPlane на основе переданного указателя.
 Синтаксис
C#
Visual Basic
Копировать Код
public static BoundedPlane Create( IntPtr unmanagedPointer, bool autoDelete );
Копировать Код
Public Shared Function Create( unmanagedPointer As IntPtr, autoDelete As Boolean ) As BoundedPlane
 Параметры
 Параметры
 Описание
 unmanagedPointer
 Входной неуправляемый указатель на объект, на основе которого создается данный объект. Тип IntPtr.
 autoDelete
 Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.
 Возвращает
 Возвращает вновь созданный экземпляр класса BoundedPlane.
 Описание
 Метод создает объект BoundedPlane на основе переданного указателя.
 Ссылки
 Teigha.Geometry.BoundedPlane, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!