Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.TableStyle.VerticalCellMargin
 Послать отзыв
 Свойство VerticalCellMargin представляет величину вертикального поля ячейки.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual double VerticalCellMargin;
Копировать Код
Public Overridable Property VerticalCellMargin As Double
 Возвращает
 Возвращает величину вертикального поля ячейки. Тип double.
 Описание
 Свойство VerticalCellMargin представляет величину вертикальных полей ячеек, предусмотренную данным табличным стилем.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.TableStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!