Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.XrefBlockId
 Послать отзыв
 Синтаксис
C#
Visual Basic
public DatabaseServices::ObjectId XrefBlockId;
Public Property XrefBlockId() As DatabaseServices.ObjectId
 Описание
 Возвращает ID записи таблицы блоков, которая ссылается на данную базу данных как на внешнюю ссылку.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!