Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Viewport.Viewport
 Послать отзыв
 Конструктор по умолчанию класса Viewport.
 Синтаксис
C#
Visual Basic
Копировать Код
public Viewport();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса Viewport.
 Ссылки
 Teigha.DatabaseServices.Viewport, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!