Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Matrix2d.Mirroring
 Послать отзыв
 Метод предоставляет матрицу, которая описывает зеркальное отражение относительно указанной точки.
 Синтаксис
C#
Visual Basic
Копировать Код
public static Matrix2d Mirroring( Point2d point );
Копировать Код
Public Shared Function Mirroring( point As Point2d ) As Matrix2d
 Параметры
 Параметры
 Описание
 point
 Точка зеркального отражения. Тип Point2d.
 Возвращает
 Возвращает матрицу зеркального отражения относительно точки point. Тип Matrix2d.
 Описание
 Метод предоставляет матрицу, которая описывает зеркальное отражение относительно указанной точки.
 Ссылки
 Teigha.Geometry.Matrix2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!