Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotSettings.PlotSettings
 Послать отзыв
 Конструктор класса PlotSettings. Создает экземпляр настроек печати на выбор для пространства модели, либо для пространства листа.
 Синтаксис
C#
Visual Basic
Копировать Код
public PlotSettings( bool modelType );
Копировать Код
Public Sub New( modelType As Boolean )
 Параметры
 Параметры
 Описание
 modelType
 Входное логическое значение, определяющее тип настроек печати. Тип bool. Значение true означает настройки для пространства модели, а значение false - настройки для пространства листа.
 Описание
 Конструктор класса PlotSettings. Создает экземпляр настроек печати для пространства модели, либо для пространства листа. Выбор пространства определяется значением входного аргумента modelType.
 Ссылки
 Teigha.DatabaseServices.PlotSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!