Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CircularArc3d.IsInside
 Послать отзыв
 Метод позволяет определить, лежит ли указанная точка внутри данной дуги.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsInside( Point3d pointValue );
Копировать Код
Public Function IsInside( pointValue As Point3d ) As Boolean
 Параметры
 Параметры
 Описание
 pointValue
 Входная точка. Тип Point3d.
 Возвращает
 Возвращает true, если точка pointValue лежит внутри полной окружности данной дуги. Возвращает значение false, если точка pointValue лежит на окружности или вне её или не лежит в плоскости дуги.
 Описание
 Метод позволяет определить, лежит ли указанная точка внутри данной дуги. Этот метод рассматривает дугу как полную окружность, даже если она ограничена, и определяет, лежит ли входная точка внутри этой полной окружности. Используется вызов метода CircularArc3d.IsInside(Point3d pointValue, Tolerance tolerance) с точностью, равной Tolerance.Global.
 Ссылки
 Teigha.Geometry.CircularArc3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!