Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GeometryOverrule.SetCustomFilter
 Послать отзыв
 Метод делает возможным использование метода IsApplicable базового класса Overrule, чтобы установить применимость объектных переопределений.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetCustomFilter();
Копировать Код
Public Sub SetCustomFilter()
 Описание
 Метод делает возможным использование метода IsApplicable базового класса Overrule, чтобы установить применимость объектных переопределений.
 Ссылки
 Teigha.DatabaseServices.GeometryOverrule, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!