Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство TableRegion.FirstColumn
 Послать отзыв
 This is FirstColumn, a member of class TableRegion.
 Синтаксис
C#
Visual Basic
public int FirstColumn;
Public Property FirstColumn() As Integer
 Ссылки
 TableRegion Класс, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!