Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор ObjectIdGraph.ObjectIdGraph
 Послать отзыв
 This is ObjectIdGraph, a member of class ObjectIdGraph.
 Синтаксис
C#
Visual Basic
internal ObjectIdGraph(IntPtr unmanagedObjPtr, bool autoDelete);
Friend Sub New(unmanagedObjPtr As IntPtr, autoDelete As bool)
 Ссылки
 Teigha.DatabaseServices.ObjectIdGraph, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!