Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve3d.IsDegenerate
 Послать отзыв
 Метод позволяет проверить, является ли кривая вырожденной, и если да, то возвращает тип объекта, в который выродилась кривая.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsDegenerate( out Entity3d result );
Копировать Код
Public Function IsDegenerate( result As out Entity3d ) As Boolean
 Возвращает
 Возвращает true в случае, если данная кривая является вырожденной, иначе - false.
 Описание
 Метод позволяет проверить, является ли кривая вырожденной, и если да, то возвращает объект result, в который выродилась кривая. Объект result действителен только в том случае, если метод возвращает значение true.
 Реализация метода использует вызов Curve3d.IsDegenerate(out Entity3d result, Tolerance tolerance) со значением точности, равным Tolerance.Global.
 Параметры
 Параметр
 Описание
 result
 Тип объекта, в который выродилась кривая (если выродилась). Тип Entity3d.
 Ссылки
 Teigha.Geometry.Curve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!