Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AttributeCollection.CopyTo
 Послать отзыв
 Копирует объекты коллекции в массив.
 Синтаксис
C#
Visual Basic
Копировать Код
public void CopyTo( ref ObjectId[], int index );
Копировать Код
Public Sub CopyTo( ByRef array As ObjectId[], index As Integer )
 Параметры
 Параметры
 Описание
 index
 Индекс массива, с которого начинается добавление объектов.
 array
 Массив, в который предстоит копировать объекты коллекции.
 Описание
 Копирует объекты коллекции в массив.
 Ссылки
 Teigha.DatabaseServices.AttributeCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!