Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 ViewTableRecord.ViewAssociatedToViewport
 Послать отзыв
 В свойстве хранится признак принадлежности именованного вида к видовому экрану пространства листа.
 Синтаксис
C#
Visual Basic
public bool ViewAssociatedToViewport;
Public Property ViewAssociatedToViewport() As bool
 Возвращает
 Возвращает тип данных bool:
true – именованный вид связан с видовым экраном;
false – именованный вид не связан с видовым экраном.
 Описание
 В свойстве хранится информация о принадлежности именованного вида к видовому экрану пространства листа.
 Условия
 Чтение и запись.
 Ссылки
 ViewTableRecord Класс, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!