Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.TextString
 Послать отзыв
 Метод предназначен для получения копии нуль-терминированной текстовой строки из указанной ячейки.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual String TextString( int row, int col );
Копировать Код
Public virtual Function TextString( row As Integer, col As Integer ) As String
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 col
 Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
 Возвращает
 Возвращает строку, String.
 Описание
 Метод предназначен для получения копии нуль-терминированной текстовой строки из указанной ячейки.
 Замечания
 Для получения того же результата предпочтительнее использовать Table.Cells[row,column].TextString.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!