Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.PointOnSurface.Surface
 Послать отзыв
 Свойство Surface представляет поверхность, на которой лежит точка данного объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public Surface Surface;
Копировать Код
Public Property Surface As Surface
 Возвращает
 Возвращает 3D-поверхность. Тип Surface.
 Описание
 Свойство Surface представляет поверхность, на которой лежит точка данного объекта.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.Geometry.PointOnSurface, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!