Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.HighlightOverrule.SetIdFilter
 Послать отзыв
 Метод включает режим фильтрации по ObjectId при поиске объектов, к которым будут применены переопределения. Переопределение будет вызвано только для объектов, чьи id присутствуют в заданном списке идентификаторов.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetIdFilter( ref ObjectId[] ids );
Копировать Код
Public Sub SetIdFilter( ByRef ids As ObjectId[] )
 Параметры
 Параметры
 Описание
 ids
 Массив идентификаторов ObjectId.
 Описание
 Метод включает режим фильтрации по ObjectId при поиске объектов, к которым будут применены переопределения.
 Используйте этот метод, если требуется, чтобы nanoCAD вызывал ваше переопределение только для объектов, чьи ObjectId присутствуют в заданном списке идентификаторов.
 Ссылки
 Teigha.DatabaseServices.HighlightOverrule, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!