Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Database.TryGetObjectId
 Послать отзыв
 This is TryGetObjectId, a member of class Database.
 Синтаксис
C#
Visual Basic
public bool TryGetObjectId(Handle objHandle, [Out] ObjectId% id);
Public Function TryGetObjectId(objHandle As Handle, id As [Out] ObjectId%) As bool
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!