Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SubentityId
 Послать отзыв
 Структура SubentityId представляет в базе данных идентификаторы подобъектов для графических объектов чертежа.
 Иерархия классов
Teigha::DatabaseServices::SubentityId
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdDbSubentId")] public struct SubentityId
Копировать Код
<Wrapper("OdDbSubentId")> Public Structure SubentityId
 Описание
 Структура SubentityId представляет в базе данных идентификаторы подобъектов для графических объектов чертежа.
 Объект чертежа может включать произвольное количество графических подобъектов. Типы подобъектов SubentType определяются перечислением SubentityType и могут принимать следующие значения:
 Имя
 Значение
 Null
 0
 Face
 1
 Edge
 2
 Vertex
 3
 MlineCache
 4
 Class
 5
 Каждый объект SubentityId создается на основе типа подобъекта и индекса.
 Замечания
 Рекомендуется использовать индексы в виде указателей.
 Методы
 Конструкторы
 Имя
 Описание
 SubentityId
 Это обзор перегрузок SubentityId.
 Топики
 Имя
 Описание
 SubentityId Методы
 Ниже перечислены методы класса SubentityId.
 SubentityId Операторы
 Ниже перечислены операторы класса SubentityId.
 SubentityId Свойства
 Ниже перечислены свойства класса SubentityId.
 Ссылки
 SubentityId Конструктор, SubentityId Методы, SubentityId Операторы, SubentityId Свойства, Методы, Топики, SubentityId Методы, SubentityId Операторы, SubentityId Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!