Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbSurface.PeriodicInU
 Послать отзыв
 Свойство PeriodicInU представляет период в направлении U, если данная NURBS поверхность является периодической в направлении U.
 Синтаксис
C#
Visual Basic
Копировать Код
public double PeriodicInU;
Копировать Код
Public ReadOnly Property PeriodicInU As Double
 Возвращает
 Возвращает период в направлении U. Тип double.
 Описание
 Свойство PeriodicInU представляет период в направлении U, если данная NURBS поверхность является периодической в направлении U.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.NurbSurface, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!