Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 DimStyleTableRecord.Dimaunit
 Послать отзыв
 Свойство отвечает за настройку формата единиц измерения в угловых размерах.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual int Dimaunit { get; set; }
Копировать Код
Public Overridable Property Dimaunit As Integer
 Возвращает
 Возвращает тип данных int.
 Возвращаемые значения
 Возвращаемые значения
 Описание
 0
 угловые размеры измеряются в десятичных градусах
 1
 угловые размеры измеряются в градусах-минутах-секундах
 2
 угловые размеры измеряются в градианах
 3
 угловые размеры измеряются в радианах
 4
 угловые размеры измеряются в топографическом формате
 Описание
 В свойстве хранится настройка формата единиц измерения в угловых размерах. В качестве значения свойства доступны следующие целые числа:
0 – десятичные градусы (по умолчанию);
1 – градусы-минуты-секунды;
2 – градианы;
3 – радианы;
4 – топографические.
 Свойство также доступно через системную переменную DIMAUNIT и пользовательское меню в окне изменения/создания размерного стиля:
  При изменении системной переменной DIMAUNIT будет создан новый размерный стиль под названием <переопределение> на основе текущего с новым значением DIMAUNIT.
 Условия
 Чтение и запись.
 Пример
 Пример изменения формата единиц измерения в угловых размерах (значения свойства Dimaunit) в размерном стиле Standard:
C#
 Копировать Код
public partial class Commands { [Teigha.Runtime.CommandMethod("DimaunitChange")] public void DimaunitStandardDimStyle() { // Получение ссылки на активный документ HostMgd.ApplicationServices.Document doc = HostMgd.ApplicationServices.Application.DocumentManager.MdiActiveDocument; // Получение ссылки на редактор документа HostMgd.EditorInput.Editor ed = doc.Editor; // Получение ссылки на базу данных документа Teigha.DatabaseServices.Database db = doc.Database; // Начало транзакции с базой данных документа using (Teigha.DatabaseServices.Transaction trans = db.TransactionManager.StartTransaction()) { // Открываем таблицу размерных стилей для чтения Teigha.DatabaseServices.DimStyleTable dimStyleTable = trans.GetObject(db.DimStyleTableId, Teigha.DatabaseServices.OpenMode.ForRead) as Teigha.DatabaseServices.DimStyleTable; // Находим в таблице размерных стилей ObjectId нужного стиля по его названию Teigha.DatabaseServices.ObjectId styleId = dimStyleTable["Standard"]; // Открываем таблицу размерного стиля для изменений Teigha.DatabaseServices.DimStyleTableRecord obj = trans.GetObject(styleId, Teigha.DatabaseServices.OpenMode.ForWrite) as Teigha.DatabaseServices.DimStyleTableRecord; ed.WriteMessage($"nDimaunit before: {obj.Dimaunit}"); // Изменяем настройку единиц измерения угловых размеров  // на 3 «радианы» obj.Dimaunit = 3; ed.WriteMessage($"nDimaunit after: {obj.Dimaunit}"); trans.Commit(); } } }
 Результат работы команды DimaunitChange:
 Было:
 Стало:
 Ссылки
 Teigha.DatabaseServices.DimStyleTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!