Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MentalRayRenderSettings.DiagnosticBSPMode
 Послать отзыв
 Свойство DiagnosticBSPMode представляет используемый режим диагностики BSP.
 Синтаксис
C#
Visual Basic
Копировать Код
public GraphicsInterface.DiagnosticBSPMode DiagnosticBSPMode;
Копировать Код
Public Property DiagnosticBSPMode As GraphicsInterface.DiagnosticBSPMode
 Возвращает
 Возвращает значение из перечисления GraphicsInterface.DiagnosticBSPMode.
 Описание
 Свойство DiagnosticBSPMode представляет используемый режим диагностики BSP (Binary Space Partitioning).
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MentalRayRenderSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!