Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ObjectIdCollection.ObjectIdCollection
 Послать отзыв
 Конструктор класса ObjectIdCollection. Создает коллекцию из массива идентификаторов объектов ObjectId.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectIdCollection( ref ObjectId[] values );
Копировать Код
Public Sub New( ByRef values() As ObjectId )
 Параметры
 Параметры
 Описание
 values
 Входной массив идентификаторов объектов. Тип ObjectId[].
 Описание
 Конструктор класса ObjectIdCollection. Создает коллекцию из массива идентификаторов объектов ObjectId.
 Ссылки
 Teigha.DatabaseServices.ObjectIdCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!