Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotSettingsValidator.SetClosestMediaName
 Послать отзыв
 Метод позволяет задать в указанном объекте PlotSettings имя носителя, который лучше других соответствует переданным параметрам.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetClosestMediaName( ref PlotSettings plotSet, double paperWidth, double paperHeight, PlotPaperUnit units, bool matchPrintableArea );
Копировать Код
Public Sub SetClosestMediaName( ByRef plotSet As PlotSettings, paperWidth As Double, paperHeight As Double, units As PlotPaperUnit, matchPrintableArea As Boolean )
 Параметры
 Параметры
 Описание
 plotSet
 Входной объект PlotSettings с настройками печати.
 paperWidth
 Ширина бумаги. Тип double.
 paperHeight
 Высота бумаги. Тип double.
 units
 Единицы измерения для бумажного носителя (миллиметры, дюймы, пиксели). Значение из перечисления PlotPaperUnit.
 matchPrintableArea
 Флаг, определяющий, идет ли речь о поиске соответствия по границам области печати (значение true) или по физическим размерам бумажного носителя (значение false). Тип bool.
 Описание
 Метод позволяет задать в указанном объекте PlotSettings имя носителя, который лучше других соответствует переданным параметрам.
 Единицы измерения бумажного носителя используются для определения полей области печати, смещений, формата бумаги и вычисления масштабов отображения объектов чертежа.
 Ссылки
 Teigha.DatabaseServices.PlotSettingsValidator, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!