Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Point2d.-
 Послать отзыв
 Оператор вычитания класса Point2d. Реализует вычитание компонент 2D-вектора b из координат точки a.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point2d operator - ( Point2d a, Vector2d b );
Копировать Код
Public Operator - ( a As Point2d, b As Vector2d )
 Параметры
 Параметры
 Описание
 a
 Левый операнд. Тип Point2d.
 b
 Правый операнд. Тип Vector2d.
 Возвращает
 Возвращает точку Point2d в новых координатах.
 Описание
 Оператор вычитания класса Point2d. Реализует вычитание компонент 2D-вектора b из координат точки a, что означает перемещение точки на вектор, обратный вектору b.
 Ссылки
 Teigha.Geometry.Point2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!