Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.TextAttachmentType
 Послать отзыв
 Данное перечисление определяет варианты расположения точки прикрепления выносной линии к многострочному тексту.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum TextAttachmentType { AttachmentAllLine = 8, AttachmentBottomLine = 5, AttachmentBottomOfBottom = 4, AttachmentBottomOfTop = 7, AttachmentBottomOfTopLine = 6, AttachmentCenter = 9, AttachmentLinedCenter = 10, AttachmentMiddle = 2, AttachmentMiddleOfBottom = 3, AttachmentMiddleOfTop = 1, AttachmentTopOfTop = 0 }
Копировать Код
Public Enum TextAttachmentType AttachmentAllLine = 8 AttachmentBottomLine = 5 AttachmentBottomOfBottom = 4 AttachmentBottomOfTop = 7 AttachmentBottomOfTopLine = 6 AttachmentCenter = 9 AttachmentLinedCenter = 10 AttachmentMiddle = 2 AttachmentMiddleOfBottom = 3 AttachmentMiddleOfTop = 1 AttachmentTopOfTop = 0 End Enum
 Члены
 Члены
 Описание
 AttachmentTopOfTop
 Значение: 0. Прикрепление к верхней границе верхней строки многострочного текста.
 AttachmentMiddleOfTop
 Значение: 1. Прикрепление к середине верхней строки многострочного текста.
 AttachmentMiddle
 Значение: 2. Прикрепление посередине многострочного текста.
 AttachmentMiddleOfBottom
 Значение: 3. Прикрепление к середине нижней строки многострочного текста.
 AttachmentBottomOfBottom
 Значение: 4. Прикрепление к нижней границе нижней строки многострочного текста.
 AttachmentBottomLine
 Значение: 5. Прикрепление к нижней границе нижней строки многострочного текста и отображение линии снизу.
 AttachmentBottomOfTopLine
 Значение: 6. Прикрепление к нижней границе верхней строки многострочного текста и отображение линии снизу.
 AttachmentBottomOfTop
 Значение: 7. Прикрепление к нижней границе верхней строки многострочного текста.
 AttachmentAllLine
 Значение: 8. Прикрепление к нижней границе верхней строки многострочного текста и отображение линий подчеркивания по всему тексту.
 AttachmentCenter
 Значение: 9. В качестве точки прикрепления вертикальной полки используется центр многострочного текста MText.
 AttachmentLinedCenter
 Значение: 10. В качестве точки прикрепления вертикальной полки используется центр многострочного текста. Сам объект MText сверху и снизу обрамляется горизонтальными линиями.
 Описание
 Данное перечисление определяет варианты расположения точки прикрепления выносной линии к многострочному тексту.
 Ваши комментарии по поводу этого топика: Послать отзыв!