Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.TableStyle.BitFlags
 Послать отзыв
 Свойство BitFlags представляет битовые флаги направления заполнения таблицы, предусмотренные данным стилем таблицы.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual int BitFlags;
Копировать Код
Public Overridable Property BitFlags As Integer
 Возвращает
 Возвращает битовые флаги направления заполнения таблицы. Тип int.
 Описание
 Свойство BitFlags представляет битовые флаги направления заполнения таблицы, предусмотренные данным стилем таблицы. См. свойство FlowDirection.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.TableStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!