Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FieldEngine.GetEvaluator
 Послать отзыв
 Метод предоставляет вычислитель поля FieldEvaluator по идентификатору вычислителя.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual FieldEvaluator GetEvaluator( ref String pszEvalId );
Копировать Код
Public Overridable Function GetEvaluator( ByRef pszEvalId As String ) As FieldEvaluator
 Параметры
 Параметры
 Описание
 pszEvalId
 Идентификатор вычислителя, по которому можно найти вычислитель поля. Тип String.
 Возвращает
 Возвращает найденный вычислитель поля FieldEvaluator или null, если соответствующий вычислитель поля не найден.
 Описание
 Метод предоставляет вычислитель поля FieldEvaluator по идентификатору вычислителя.
 Ссылки
 Teigha.DatabaseServices.FieldEngine, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!