Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.LightGlyphDisplay
 Послать отзыв
 Синтаксис
C#
Visual Basic
public int LightGlyphDisplay;
Public Property LightGlyphDisplay() As Integer
 Описание
 Устанавливает или возвращает признак того, отображаются ли источники света в видовом экране. 1 соответствует тому, что источники света отображаются и 0 в противном случае.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!