Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LayerStateManager.ImportLayerState
 Послать отзыв
 Метод ImportLayerState() импортирует в чертеж состояния слоя из указанного файла импорта.
 Синтаксис
C#
Visual Basic
Копировать Код
public void ImportLayerState( ref String fileName );
Копировать Код
Public Function ImportLayerState( ByRef fileName As String )
 Параметры
 Параметры
 Описание
 fileName
 Имя файла для импорта состояний слоя, String.
 Описание
 Метод ImportLayerState() считывает переданное имя файла (сохраненное при предыдущем экспорте) и извлекает состояния слоя для импорта.
 Если имя состояния слоя из файла импорта совпадает с уже существующим в чертеже именем состояния слоя, то импортированное состояние слоя игнорируется. Если имя импортируемого состояния слоя в чертеже не найдено, состояние с таким именем создается. Если какие-либо вновь созданные состояния слоев относятся к слоям, пока не существующим в чертеже, такие слои создаются с настройками по умолчанию.
 Ссылки
 Teigha.DatabaseServices.LayerStateManager, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!