Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DatabaseSummaryInfoBuilder.Comments
 Послать отзыв
 Свойство обеспечивает доступ к комментарию для объекта DatabaseSummaryInfo.
 Синтаксис
C#
Visual Basic
Копировать Код
public String Comments;
Копировать Код
Public Property Comments() As String
 Возвращает
 Возвращает комментарий. Тип String.
 Описание
 Свойство обеспечивает доступ к комментарию для объекта DatabaseSummaryInfo.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.DatabaseSummaryInfoBuilder, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!