Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Matrix2d.Displacement
 Послать отзыв
 Метод формирует трансляционную часть матрицы преобразования на основе указанного вектора.
 Синтаксис
C#
Visual Basic
Копировать Код
public static Matrix2d Displacement( Vector2d vector );
Копировать Код
Public Shared Function Displacement( vector As Vector2d ) As Matrix2d
 Параметры
 Параметры
 Описание
 vector
 Входной вектор переноса. Тип Vector2d.
 Возвращает
 Возвращает матрицу преобразования, трансляционная часть которой определяется вектором vector. Тип Matrix2d.
 Описание
 Метод формирует трансляционную часть матрицы преобразования на основе указанного вектора.
 Ссылки
 Teigha.Geometry.Matrix2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!