Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Viewport.RenderMode
 Послать отзыв
 Свойство RenderMode представляет текущий режим рендеринга в данном видовом экране.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.RenderMode RenderMode;
Копировать Код
Public Property RenderMode As DatabaseServices.RenderMode
 Возвращает
 Возвращает текущий режим рендеринга. Тип DatabaseServices.RenderMode.
 Описание
 Свойство RenderMode представляет текущий режим рендеринга в данном видовом экране.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Viewport, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!