Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Ole2Frame.Position3d
 Послать отзыв
 Свойство представляет координаты четырех угловых точек OLE-объекта в мировой системе координат (WCS).
 Синтаксис
C#
Visual Basic
Копировать Код
public Rectangle3d Position3d;
Копировать Код
Public Property Position3d As Rectangle3d
 Возвращает
 Возвращает четыре угловых точки OLE-объекта в виде объекта Rectangle3d.
 Описание
 Свойство представляет координаты четырех угловых точек OLE-объекта, определенные в мировой системе координат (WCS).
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Ole2Frame, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!