Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve2d.GetClosestPointTo
 Послать отзыв
 Метод позволяет получить одну точку на данной кривой и другую точку на указанной кривой такие, что расстояние между этими точками является минимальным.
 Синтаксис
C#
Visual Basic
Копировать Код
public PointOnCurve2d[] GetClosestPointTo( ref Curve2d curve );
Копировать Код
Public Function GetClosestPointTo( ByRef curve As Curve2d ) As PointOnCurve2d()
 Параметры
 Параметры
 Описание
 curve
 Входная кривая, на которой требуется найти точку, ближайшую к данной кривой. Тип Curve2d.
 Возвращает
 Возвращает массив из двух ближайших точек на каждой из кривых. Тип PointOnCurve2d[]. Точка с индексом 0 принадлежит данной кривой, а точка с индексом 1 принадлежит переданной кривой curve.
 Описание
 Метод позволяет получить одну точку на данной кривой и другую точку на указанной кривой такие, что расстояние между этими точками является минимальным. Используется вызов метода Curve2d.GetClosestPointTo(Curve2d curve, Tolerance tolerance) с точностью Tolerance.Global.
 Ссылки
 Teigha.Geometry.Curve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!