Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObject.ModifiedXData
 Послать отзыв
 Событие происходит каждый раз, когда данные XData были записаны в объект.
 Синтаксис
C#
Visual Basic
Копировать Код
public event EventHandler ModifiedXData;
Копировать Код
Public Event ModifiedXData As EventHandler
 Возвращает
 Тип данных EventHandler, представляющий обработчик события.
 Описание
 Событие происходит каждый раз, когда данные XData были записаны в объект.
 Ссылки
 Teigha.DatabaseServices.DBObject, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!