Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Point2dCollection.CopyTo
 Послать отзыв
 Метод копирует все элементы данной коллекции в указанный одномерный массив.
 Синтаксис
C#
Visual Basic
Копировать Код
public void CopyTo( ref Point2d[] a, int index );
Копировать Код
Public Sub CopyTo( ByRef a() As Point2d, index As Integer )
 Параметры
 Параметры
 Описание
 a
 Целевой массив, в который копируются элементы коллекции. Тип Point2d[].
 index
 Входной индекс в массиве a, начиная с которого в массив копируются элементы коллекции. Тип int.
 Описание
 Метод копирует все элементы данной коллекции в указанный одномерный массив, начиная с указанного индекса в этом массиве.
 Ссылки
 Teigha.Geometry.Point2dCollection, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!