Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve2d.EvaluatePoint
 Послать отзыв
 Метод позволяет получить на кривой точку, соответствующую указанному значению параметра.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point2d EvaluatePoint( double parameter );
Копировать Код
Public Function EvaluatePoint( parameter As Double ) As Point2d
 Параметры
 Параметры
 Описание
 parameter
 Входное значение параметра. Тип double.
 Возвращает
 Возвращает точку на кривой, соответствующую заданному значению параметра. Тип Point2d.
 Описание
 Метод позволяет получить на кривой точку, соответствующую указанному значению параметра.
 Ссылки
 Teigha.Geometry.Curve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!