Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LayerStateManager.GetLayerStateDescription
 Послать отзыв
 Извлекает описание, заданное методом SetLayerStateDescription().
 Синтаксис
C#
Visual Basic
Копировать Код
public String GetLayerStateDescription( ref String name );
Копировать Код
Public Function GetLayerStateDescription( ByRef name As String ) As String
 Параметры
 Параметры
 Описание
 name
 Имя состояния слоя, описание которого необходимо получить, тип String.
 Возвращает
 Возвращает строку с именем состояния слоя.
 Описание
 Извлекает описание, заданное методом SetLayerStateDescription().
 Ссылки
 Teigha.DatabaseServices.LayerStateManager, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!