Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LinkedTableData.GetCellState
 Послать отзыв
 Метод позволяет получить состояние первого элемента содержимого указанной ячейки.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual CellStates GetCellState( int row, int column );
Копировать Код
Public Overridable Function GetCellState( row As Integer, column As Integer ) As CellStates
 Параметры
 Параметры
 Описание
 row
 Индекс строки. Тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 column
 Индекс столбца. Тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице.
 Возвращает
 Возвращает состояние первого элемента содержимого ячейки. Перечисление CellStates.
 Описание
 Метод позволяет получить состояние первого элемента содержимого указанной ячейки.
 Замечания
 Метод выбрасывает исключение eInvalidInput, если индексы строки и/или столбца меньше 0 или больше размера таблицы.
 Ссылки
 Teigha.DatabaseServices.LinkedTableData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!