Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CellBorders.Left
 Послать отзыв
 Свойство возвращает границу ячейки на крайней левой линии сетки таблицы.
 Синтаксис
C#
Visual Basic
Копировать Код
public CellBorder Left;
Копировать Код
Public Property Left() As CellBorder
 Возвращает
 Возвращает границу ячейки. Тип CellBorder.
 Описание
 Свойство возвращает границу ячейки на крайней левой линии сетки таблицы.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.CellBorders, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!