Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Scale3d.==
 Послать отзыв
 Оператор равенства структуры Scale3d.
 Синтаксис
C#
Visual Basic
Копировать Код
public static bool operator ==( Scale3d a, Scale3d b );
Копировать Код
Public Shared Operator =( a As Scale3d, b As Scale3d ) As Boolean
 Параметры
 Параметры
 Описание
 a
 Левый операнд. Тип Scale3d.
 b
 Правый операнд. Тип Scale3d.
 Возвращает
 Возвращает true в случае равенства левого и правого операндов. В противном случае возвращает false.
 Описание
 Оператор равенства структуры Scale3d.
 Два экземпляра структуры Scale3d считаются равными, если в пределах используемой точности одновременно выполняются следующие условия:
масштабные коэффициенты по оси X равны;
масштабные коэффициенты по оси Y равны;
масштабные коэффициенты по оси Z равны.
 Ссылки
 Teigha.Geometry.Scale3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!