Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод RasterImageDef.Load
 Послать отзыв
 Синтаксис
C#
Visual Basic
public void Load();
Public Sub Load()
 Описание
 Эта функция использует "ленивую загрузку" данных растрового изображения из исходного файла (определенного RasterImageDef.SourceFileName) в объект OdGiRasterImage. Необходимо, чтобы RasterImageDef был открыт на запись). Уведомления будут посланы всем зависимым геометрическим объектам RasterImage для их перерисовки.
 Заметим, что при ленивой загрузке, изображение физически не загружается в память до тех пор, пока оно не потребуется (например, чтобы появиться на экране). Уведомление может быть задержано до того, как изображение физически будет загружено.
 Ссылки
 Teigha.DatabaseServices.RasterImageDef, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!