Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbCurve3dFitData.IsEqualTo
 Послать отзыв
 Метод позволяет проверить, идентичны ли данные аппроксимации NURB кривой в данном объекте соответствующим данным аппроксимации NURB кривой во входном объекте.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsEqualTo( NurbCurve3dFitData a );
Копировать Код
Public Function IsEqualTo( a As NurbCurve3dFitData ) As Boolean
 Параметры
 Параметры
 Описание
 a
 Данные 3D-аппроксимации NURB кривой. Тип NurbCurve3dFitData.
 Возвращает
 Возвращает true, если сравниваемые объекты идентичны. В противном случае возвращает false.
 Описание
 Метод позволяет проверить, идентичны ли данные аппроксимации NURB кривой в данном объекте соответствующим данным аппроксимации NURB кривой во входном объекте.
 Идентичность объектов NurbCurve3dFitData означает одновременное выполнение следующих условий:
Определяющие точки совпадают;
Равны степени обеих кривых;
Данные касательных присутствуют или отсутствуют для обеих кривых;
Равны начальные векторы касательных;
Равны конечные векторы касательных.
 Ссылки
 Teigha.Geometry.NurbCurve3dFitData, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!