Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.TableStyleDictionaryId
 Послать отзыв
 Синтаксис
C#
Visual Basic
public DatabaseServices::ObjectId TableStyleDictionaryId;
Public Property TableStyleDictionaryId() As DatabaseServices.ObjectId
 Описание
 Обеспечивает доступ к Id словаря таблицы стилей в словаре именованных объектов.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!