Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Database.ReadDwgFile (IntPtr, bool, String^)
 Послать отзыв
 Синтаксис
C#
Visual Basic
public void ReadDwgFile(IntPtr drawingFile, bool allowCPConversion, ref String password);
Public Sub ReadDwgFile(drawingFile As IntPtr, allowCPConversion As bool, ByRef password As String)
 Параметры
 Параметры
 Описание
 drawingFile
 Указатель на файл формата .dwg для чтения
 allowCPConversion
 Переменная, определяющая режим разрешения конвертации между кодовыми страницами
 password
 Строка, содержащая пароль файла
 Описание
 Читает файл чертежа, указанный в drawingFile, в базу данных, исполняющую данный метод.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!