Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.KnotCollection.EndParameter
 Послать отзыв
 Свойство EndParameter представляет значение параметра в конечном узле коллекции.
 Синтаксис
C#
Visual Basic
Копировать Код
public double EndParameter;
Копировать Код
Public ReadOnly Property EndParameter As Double
 Возвращает
 Возвращает значение параметра в конечном узле коллекции. Тип double.
 Описание
 Свойство EndParameter представляет значение параметра в конечном узле коллекции.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.KnotCollection, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!