Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FeatureControlFrame.SetDimstyleData
 Послать отзыв
 Метод позволяет задать для этого объекта настройки размерного стиля, включая переопределения, из указанной записи таблицы размерных стилей.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetDimstyleData( ref DimStyleTableRecord style );
Копировать Код
Public Sub SetDimstyleData( ByRef style As DimStyleTableRecord )
 Параметры
 Параметры
 Описание
 style
 Нерезидентная запись таблицы размерных стилей. Тип DimStyleTableRecord.
 Описание
 Метод позволяет задать для этого объекта настройки размерного стиля, включая переопределения, из указанной записи таблицы размерных стилей.
 Ссылки
 Teigha.DatabaseServices.FeatureControlFrame, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!