Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FullDwgVersion.!=
 Послать отзыв
 Оператор неравенства для класса FullDwgVersion.
 Синтаксис
C#
Visual Basic
Копировать Код
public static bool operator !=( FullDwgVersion ver1, FullDwgVersion ver2 );
Копировать Код
Public Shared Operator <>( ver1 As FullDwgVersion, ver2 As FullDwgVersion ) As Boolean
 Параметры
 Параметры
 Описание
 ver1
 Левый операнд. Тип FullDwgVersion.
 ver2
 Правый операнд. Тип FullDwgVersion.
 Возвращает
 Возвращает true при несовпадении версий ver1 и ver2. В противном случае возвращает false.
 Описание
 Оператор неравенства для класса FullDwgVersion.
 Ссылки
 Teigha.DatabaseServices.FullDwgVersion, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!