Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Material.Translucence
 Послать отзыв
 Свойство представляет полупрозрачность этого материала.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual double Translucence;
Копировать Код
Public Overridable Property Translucence As Double
 Возвращает
 Возвращает полупрозрачность материала. Тип double.
 Описание
 Свойство представляет полупрозрачность этого материала, характеризующую рассеивание света при прохождении через объект.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Material, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!