Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve3d.GetReverseParameterCurve
 Послать отзыв
 Метод изменяет параметрическое направление кривой на противоположное.
 Синтаксис
C#
Visual Basic
Копировать Код
public Curve3d GetReverseParameterCurve();
Копировать Код
Public Function GetReverseParameterCurve() As Curve3d
 Возвращает
 Возвращает кривую Curve3d с инвертированным направлением изменения параметра.
 Описание
 Метод изменяет параметрическое направление кривой на противоположное. Множество точек кривой остается неизменным, но параметрически направление кривой меняется на противоположное.
 Ссылки
 Teigha.Geometry.Curve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!