Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LoftOptions.LoftOptions
 Послать отзыв
 Конструктор класса LoftOptions. Создает новый объект LoftOptions, воспроизводя заданные параметры операции.
 Синтаксис
C#
Visual Basic
Копировать Код
public LoftOptions( ref LoftOptions opts );
Копировать Код
Public Sub New( ByRef opts As LoftOptions )
 Параметры
 Параметры
 Описание
 opts
 Входной объект с параметрами операции лофта. Тип LoftOptions.
 Описание
 Конструктор класса LoftOptions. Создает новый объект LoftOptions, воспроизводя заданные параметры операции.
 Ссылки
 Teigha.DatabaseServices.LoftOptions, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!