Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GraphNode.SetEdgeGrowthRate
 Послать отзыв
 Метод позволяет задать количество исходящих и входящих ребер, под которые одновременно резервируется память на узле графа.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetEdgeGrowthRate( int outEdgeRate, int inEdgeRate );
Копировать Код
Public Sub SetEdgeGrowthRate( outEdgeRate As Integer, inEdgeRate As Integer )
 Параметры
 Параметры
 Описание
 outEdgeRate
 Количество исходящих ребер, под которые одновременно выделяется память. Тип int.
 inEdgeRate
 Количество входящих ребер, под которые одновременно выделяется память. Тип int.
 Описание
 Метод позволяет задать количество исходящих и входящих ребер, под которые одновременно резервируется память на узле графа. Значения по умолчанию равны 4 и 2, соответственно. При большом количестве рёбер имеет смысл увеличить эти значения, что повышает производительность ценой выделения дополнительной памяти.
 Ссылки
 Teigha.DatabaseServices.GraphNode, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!