Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FormattedTableData.GetGridColor
 Послать отзыв
 Метод позволяет получить цвет сетки в ячейке, строке или столбце.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual Colors.Color GetGridColor( int row, int column, GridLineType gridLinetype );
Копировать Код
Public Overridable Function GetGridColor( row As Integer, column As Integer, gridLinetype As GridLineType ) As Colors.Color
 Параметры
 Параметры
 Описание
 row
 Индекс строки. Тип int. Может принимать значение -1.
 column
 Индекс столбца. Тип int. Может принимать значение -1.
 gridLinetype
 Тип линий сетки из перечисления GridLineType. Можно задать комбинацию типов линий сетки, объединив их с помощью оператора OR.
 Возвращает
 Возвращает цвет линий сетки ячейки. Тип Teigha.Colors.Color.
 Описание
 Метод позволяет получить цвет сетки в ячейке, строке или столбце.
 Чтобы указать ячейку, следует передать действительные индексы строки и столбца. Чтобы указать строку, следует передать действительный индекс строки и -1 в качестве индекса столбца. Чтобы указать столбец, следует передать действительный индекс столбца и -1 в качестве индекса строки.
 Ссылки
 Teigha.DatabaseServices.FormattedTableData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!