Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор DBText.DBText (IntPtr, bool)
 Послать отзыв
 Синтаксис
C#
Visual Basic
internal DBText(IntPtr unmanagedObjPtr, bool autoDelete);
Friend Sub New(unmanagedObjPtr As IntPtr, autoDelete As bool)
 Описание
 Конструктор по умолчанию.
 Ссылки
 Teigha.DatabaseServices.DBText, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!