Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CurveBoundaryData.Orientation2d
 Послать отзыв
 Свойство Orientation2d позволяет проверить логическую ориентацию 2D-кривых в параметрическом пространстве.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool Orientation2d;
Копировать Код
Public ReadOnly Property Orientation2d As Boolean
 Возвращает
 Возвращает true, если ориентация 2D-кривых является нормальной. В случае обратной ориентации возвращает false.
 Описание
 Свойство Orientation2d позволяет проверить логическую ориентацию 2D-кривых в параметрическом пространстве.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.CurveBoundaryData, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!