Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.IsBackgroundColorNone
 Послать отзыв
 Метод позволяет определить, задан ли цвет фона в указанной ячейке.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual bool IsBackgroundColorNone( int row, int col );
Копировать Код
Public virtual Function IsBackgroundColorNone( row As Integer, col As Integer ) As Boolean
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 col
 Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
 Возвращает
 Возвращает true, если для заданного типа строки цвет фона не определен (None); в противном случае возвращает false.
 Описание
 Метод позволяет определить, задан ли цвет фона в указанной ячейке. Ячейке задается индексами строки и столбца.
 Замечания
 Для получения того же результата предпочтительнее использовать Table.Cells[row,column].IsBackgroundColorNone.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!