Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Vertex3dType
 Послать отзыв
 Данное перечисление определяет типы вершин 3D-полилиний.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum Vertex3dType { ControlVertex = 1, FitVertex = 2, SimpleVertex = 0 }
Копировать Код
Public Enum Vertex3dType ControlVertex = 1 FitVertex = 2 SimpleVertex = 0 End Enum
 Члены
 Члены
 Описание
 SimpleVertex
 Значение: 0. Обычная вершина 3D-полилинии.
 ControlVertex
 Значение: 1. Управляющая вершина аппроксимирующего сплайна или кривой, 3D полилинии.
 FitVertex
 Значение: 2. Вершина, автоматически созданная в результате аппроксимации сплайном или кривой.
 Описание
 Данное перечисление определяет типы вершин 3D-полилиний.
 Ваши комментарии по поводу этого топика: Послать отзыв!