Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ObjectIdCollection.IndexOf
 Послать отзыв
 Метод предоставляет индекс идентификатора объекта в данной коллекции, соответствующий указанному идентификатору объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public int IndexOf( ObjectId value );
Копировать Код
Public Function IndexOf( value As ObjectId ) As Integer
 Параметры
 Параметры
 Описание
 value
 Входной идентификатор объекта, для которого ищется индекс. Тип ObjectId.
 Возвращает
 Возвращает индекс идентификатора объекта. Тип int. Если искомый идентификатор в коллекции отсутствует, метод возвращает -1.
 Описание
 Метод предоставляет индекс идентификатора объекта в данной коллекции, соответствующий указанному идентификатору объекта.
 Ссылки
 Teigha.DatabaseServices.ObjectIdCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!