Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.BoundBlock3d.Set
 Послать отзыв
 Метод позволяет переопределить минимальную и максимальную точки данной граничной рамки.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Set( Point3d basePoint, Point3d maximumPoint );
Копировать Код
Public Sub Set( basePoint As Point3d, maximumPoint As Point3d )
 Параметры
 Параметры
 Описание
 basePoint
 Новая минимальная точка граничной рамки. Тип Point3d.
 maximumPoint
 Новая максимальная точка граничной рамки. Тип Point3d.
 Описание
 Метод позволяет переопределить минимальную и максимальную точки данной граничной рамки.
 Ссылки
 Teigha.Geometry.BoundBlock3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!