Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ItemLocator.ItemIndex
 Послать отзыв
 Свойство обеспечивает доступ к индексу, который определяет позицию элемента в массиве относительно первого элемента массива.
 Синтаксис
C#
Visual Basic
Копировать Код
public int ItemIndex;
Копировать Код
Public Property ItemIndex() As Integer
 Возвращает
 Возвращает индекс данного элемента. Тип int.
 Описание
 Свойство обеспечивает доступ к индексу, который определяет позицию элемента в массиве относительно первого элемента массива.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.ItemLocator, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!