Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.TableBreakFlowDirection
 Послать отзыв
 Перечисление TableBreakFlowDirection определяет поддерживаемые направления разбиения таблицы.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum TableBreakFlowDirection { Right = 1, DownOrUp = 2, Left = 4 }
Копировать Код
Public Enum TableBreakFlowDirection Right = 1 DownOrUp = 2 Left = 4 End Enum
 Члены
 Члены
 Описание
 Right
 Значение: 1. Таблица разбивается слева направо.
 DownOrUp
 Значение: 2. Таблица разбивается сверху вниз или снизу вверх.
 Left
 Значение: 4. Таблица разбивается справа налево.
 Описание
 Перечисление TableBreakFlowDirection определяет поддерживаемые направления разбиения таблицы.
 Ваши комментарии по поводу этого топика: Послать отзыв!