Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocAction.PostProcessAfterDeepCloneCancel
 Послать отзыв
 Метод позволяет реализовать уведомление исходных действий об отмене их глубокого клонирования.
 Синтаксис
C#
Visual Basic
Копировать Код
public void PostProcessAfterDeepClone( ref IdMapping idMap );
Копировать Код
Public Sub PostProcessAfterDeepClone( ByRef idMap As IdMapping )
 Параметры
 Параметры
 Описание
 idMap
 Экземпляр класса IdMapping текущего сеанса глубокого клонирования. Тип IdMapping.
 Описание
 Метод позволяет реализовать уведомление исходных действий об отмене их глубокого клонирования. Метод вызывается из метода уведомления реактора. Исходное действие может получить свой клон, обратившись к переданному в метод объекту IdMapping сеанса глубокого клонирования.
 Если действие владеет объектом AssocActionBody с переопределенным обратным вызовом PostProcessAfterDeepCloneCancelOverride(), вызывается переопределенный обратный вызов. Заметим, что обычно безопаснее не переопределять этот обратный вызов и просто ничего не предпринимать.
 Ссылки
 Teigha.DatabaseServices.AssocAction, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!