Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.UnderlayDefinition
 Послать отзыв
 Класс UnderlayDefinition является абстрактным классом, который обеспечивает связь с внешним содержимым подложки.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::GraphicsInterface::Drawable Teigha::DatabaseServices::DBObject Teigha::DatabaseServices::UnderlayDefinition
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("AcDbUnderlayDefinition")] public abstract class UnderlayDefinition : DBObject
Копировать Код
<Wrapper("AcDbUnderlayDefinition")> Public MustInherit Class UnderlayDefinition Inherits DBObject
 Описание
 Класс UnderlayDefinition — это абстрактный класс, который обеспечивает связь с внешним содержимым подложки.
 Подложки аналогичны растровым изображениям, за исключением того, что пользователю доступны привязки к содержимому подложки. На экземпляр класса UnderlayDefinition могут ссылаться объекты UnderlayReferences. Класс UnderlayReference отвечает за размещение содержимого в чертеже, а класс UnderlayDefinition обеспечивает связь с содержимым подложки.
 Экземпляры конкретных классов, производных от UnderlayReference, вставляются в запись таблицы блоков. Экземпляры конкретных классов, производных от UnderlayDefinition, вставляются в словарь в словаре именованных объектов.
 Методы
 Конструкторы
 Teigha.GraphicsInterface.Drawable
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 Drawable
 Конструктор класса Teigha.GraphicsInterface.Drawable. (Унаследован от Drawable)
 Teigha.DatabaseServices.DBObject
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 DBObject
 Конструктор. (Унаследован от DBObject)
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.GraphicsInterface.Drawable
 Имя
 Описание
 Drawable Методы
 Ниже перечислены методы класса Drawable.
 Drawable Свойства
 Ниже перечислены свойства класса Drawable.
 Teigha.DatabaseServices.DBObject
 Имя
 Описание
 DBObject Методы
 Ниже перечислены методы класса DBObject.
 DBObject Свойства
 Ниже перечислены свойства класса DBObject.
 DBObject События
 Ниже перечислены события класса DBObject.
 Teigha.DatabaseServices.UnderlayDefinition
 Имя
 Описание
 UnderlayDefinition Методы
 Ниже перечислены методы класса UnderlayDefinition.
 UnderlayDefinition Свойства
 Ниже перечислены свойства класса UnderlayDefinition.
 Ссылки
 UnderlayDefinition Методы, UnderlayDefinition Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства, DBObject События
 Ваши комментарии по поводу этого топика: Послать отзыв!