Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.RenderEnvironment.FogBackgroundEnabled
 Послать отзыв
 Свойство FogBackgroundEnabled позволяет управлять учетом влияния тумана на фон.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool FogBackgroundEnabled;
Копировать Код
Public Property FogBackgroundEnabled As Boolean
 Возвращает
 Возвращает true, если режим влияния тумана на фон активен. В противном случае возвращает false.
 Описание
 Свойство FogBackgroundEnabled позволяет управлять учетом влияния тумана на фон.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.RenderEnvironment, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!