Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DecomposeForSaveReplacementRecord.DecomposeForSaveReplacementRecord
 Послать отзыв
 Конструктор структуры DecomposeForSaveReplacementRecord. Создает экземпляр структуры для замещающего объекта, который не является резидентом базы данных.
 Синтаксис
C#
Visual Basic
Копировать Код
public DecomposeForSaveReplacementRecord( ObjectId replacement, bool exchangeXData );
Копировать Код
Public Sub New( replacement As ObjectId, exchangeXData As Boolean )
 Параметры
 Параметры
 Описание
 replacement
 Идентификатор замещающего объекта. Тип ObjectId.
 exchangeXData
 Входной флаг, который определяет, следует ли передавать расширенные данные XData замещающему объекту. Тип bool.
 Описание
 Конструктор структуры DecomposeForSaveReplacementRecord. Создает экземпляр структуры для случая, когда замещающий объект не является резидентом базы данных.
 Ссылки
 Teigha.DatabaseServices.DecomposeForSaveReplacementRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!