Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.GetCellState
 Послать отзыв
 Метод предназначен для выяснения текущего состояния указанной ячейки данной таблицы.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual CellStates GetCellState( int row, int column );
Копировать Код
Public virtual Function GetCellState( row As Integer, column As Integer ) As CellStates
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 col
 Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
 Возвращает
 Возвращает текущее состояние ячейки из перечисления Teigha.DatabaseServices.CellStates.
 Описание
 Метод предназначен для выяснения текущего состояния ячейки, заданной индексами строки и столбца.
 Замечания
 Для получения того же результата предпочтительнее использовать Table.Cells[row,column].State.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!