Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.UnitsConverter.ConvertTo
 Послать отзыв
 Метод преобразует заданный объект к указанному типу в указанном контексте с учетом заданных языковых и региональных настроек.
 Синтаксис
C#
Visual Basic
Копировать Код
public override Object ConvertTo( ref ITypeDescriptorContext context, ref CultureInfo culture, ref Object value, ref Type destinationType );
Копировать Код
Public Overrides Function ConvertTo( ByRef context As ITypeDescriptorContext, ByRef culture As CultureInfo, ByRef value As Object, ByRef destinationType As Type ) As Object
 Параметры
 Параметры
 Описание
 context
 Контекст преобразования. Тип ITypeDescriptorContext.
 culture
 Региональные и языковые настройки. Тип CultureInfo.
 value
 Входной объект для преобразования. Тип Object.
 destinationType
 Целевой тип. Тип Type.
 Возвращает
 Возвращает результат преобразования. Тип Object.
 Описание
 Метод преобразует заданный объект к указанному типу в указанном контексте с учетом заданных языковых и региональных настроек.
 Ссылки
 Teigha.DatabaseServices.UnitsConverter, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!