Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocAction.IsActionBodyAProxy
 Послать отзыв
 Свойство позволяет проверить, не является ли тело действия прокси-объектом.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsActionBodyAProxy;
Копировать Код
Public Property IsActionBodyAProxy() As Boolean
 Возвращает
 Возвращает true, если тело действия является прокси-объектом. В противном случае возвращает false.
 Описание
 Свойство позволяет проверить, не является ли тело действия прокси-объектом.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.AssocAction, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!