Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBDictionaryEntry
 Послать отзыв
 Этот класс представляет запись в словаре DatabaseServices.DBDictionary, в которой содержатся ключ и идентификатор ObjectId объекта чертежа в базе данных.
 Иерархия классов
Teigha::DatabaseServices::DBDictionaryEntry
 Синтаксис
C#
Visual Basic
Копировать Код
[Serializable,StructLayout(LayoutKind.Sequential)] public class DBDictionaryEntry;
Копировать Код
<Serializable,StructLayout(LayoutKind.Sequential)> Public Class DBDictionaryEntry
 Описание
 Этот класс представляет запись в словаре DatabaseServices.DBDictionary. Каждая запись содержит ключ и идентификатор ObjectId объекта чертежа в базе данных.
 Методы
 Конструкторы
 Имя
 Описание
 DBDictionaryEntry
 Этот конструктор создает новый экземпляр класса DBDictionaryEntry с заданными ключом и значением ObjectId.
 Топики
 Имя
 Описание
 DBDictionaryEntry Данные
 Ниже перечислены данные класса DBDictionaryEntry.
 DBDictionaryEntry Методы
 Ниже перечислены методы класса DBDictionaryEntry.
 DBDictionaryEntry Операторы
 Ниже перечислены операторы класса DBDictionaryEntry.
 DBDictionaryEntry Свойства
 Ниже перечислены свойства класса DBDictionaryEntry.
 Ссылки
 DBDictionaryEntry Данные, DBDictionaryEntry Методы, DBDictionaryEntry Операторы, DBDictionaryEntry Свойства, Методы, Топики, DBDictionaryEntry Данные, DBDictionaryEntry Методы, DBDictionaryEntry Операторы, DBDictionaryEntry Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!