Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Hatch.HatchObjectType
 Послать отзыв
 Синтаксис
C#
Visual Basic
public DatabaseServices::HatchObjectType HatchObjectType;
Public Property HatchObjectType() As DatabaseServices.HatchObjectType
 Описание
 Обеспечивает доступ к текущему состоянию объекта градиент.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Hatch, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!