Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocArrayPathParameters.AlignItems
 Послать отзыв
 Свойство обеспечивает доступ к флагу равномерной расстановки элементов массива по траектории.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool AlignItems;
Копировать Код
Public Property AlignItems() As Boolean
 Возвращает
 Возвращает true, если элементы распределяются по траектории равномерно. В противном случае возвращает false.
 Описание
 Свойство обеспечивает доступ к флагу равномерной расстановки элементов массива по траектории.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.AssocArrayPathParameters, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!