Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.KnotCollection.Count
 Послать отзыв
 Свойство Count представляет общее количество элементов в коллекции.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual int Count;
Копировать Код
Public Overridable ReadOnly Property Count As Integer
 Возвращает
 Возвращает общее количество элементов в коллекции. Тип int.
 Описание
 Свойство Count представляет общее количество элементов в коллекции.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.KnotCollection, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!