Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MText.UseBackgroundColor
 Послать отзыв
 Свойство определяет, используется ли цвет фона экрана в качестве цвета фона этого объекта MText.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool UseBackgroundColor;
Копировать Код
Public Property UseBackgroundColor As Boolean
 Возвращает
 Возвращает true, если цвет фона многострочного текста совпадает с цветом фона экрана. В противном случае возвращает false.
 Описание
 Свойство определяет, используется ли цвет фона экрана в качестве цвета фона этого объекта MText.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MText, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!