Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DwgFiler.WriteSoftOwnershipId
 Послать отзыв
 Метод предназначен для записи в этот Filer указанного идентификатора мягкой ссылки владения объектом SoftOwnershipId.
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract void WriteSoftOwnershipId( ObjectId value );
Копировать Код
Public MustOverride Sub WriteSoftOwnershipId( value As ObjectId )
 Параметры
 Параметры
 Описание
 value
 Записываемое в Filer значение. Тип ObjectId.
 Описание
 Метод предназначен для записи в этот Filer указанного идентификатора мягкой ссылки владения объектом SoftOwnershipId.
 Ссылки
 Teigha.DatabaseServices.DwgFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!