Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Solid3d.TaperFaces
 Послать отзыв
 Метод реализует сужение указанных граней твердого тела на заданный угол относительно базовой плоскости, определяемой заданными базовой точкой и вектором.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void TaperFaces( ref SubentityId[] subentityIds, Point3d basePoint, Vector3d draftVector, double draftAngle );
Копировать Код
Public Overridable Sub TaperFaces( ByRef subentityIds() As SubentityId, basePoint As Point3d, draftVector As Vector3d, draftAngle As Double )
 Параметры
 Параметры
 Описание
 subentityIds
 Идентификаторы подобъектов граней данного твердого тела. Тип SubentityId[].
 basePoint
 Базовая точка плоскости сужения. Тип Point3d.
 draftVector
 Вектор направления сужения. Тип Vector3d.
 draftAngle
 Угол сужения в радианах. Тип double.
 Описание
 Метод реализует сужение указанных граней твердого тела на заданный угол относительно базовой плоскости, определяемой заданными базовой точкой и вектором.
 Грани, лежащие в базовой плоскости сужения, не изменяются. Следует иметь ввиду, что в некоторых случаях эта операция может привести к созданию недопустимого твердого тела.
 Этот метод доступен только в среде пространственного моделирования.
 Ссылки
 Teigha.DatabaseServices.Solid3d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!