Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocArrayPathParameters.SetEndOffset
 Послать отзыв
 Метод задаёт смещение для последнего элемента массива по траектории.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetEndOffset( double offset, ref String expression, ref String evaluatorId );
Копировать Код
Public Sub SetEndOffset( offset As Double, ByRef expression As String, ByRef evaluatorId As String )
 Параметры
 Параметры
 Описание
 offset
 Смещение элемента. Тип double. Задаваемое значение должно быть неотрицательным.
 expression
 Выражение для параметра. Тип String. Строка может быть пустой.
 evaluatorId
 Строковое представление идентификатора вычислителя. Тип String. Строка может быть пустой.
 Описание
 Метод задаёт смещение для последнего элемента массива по траектории. Это смещение доступно, только если для распределения элементов по траектории используется метод MethodType.Divide.
 Если для параметра выражение отсутствует, строки expression и evaluatorId должны быть пустыми.
 Ссылки
 Teigha.DatabaseServices.AssocArrayPathParameters, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!