Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MentalRayRenderSettings.GISampleRadiusEnabled
 Послать отзыв
 Свойство GISampleRadiusEnabled позволяет определить, следует ли использовать заданный пользователем радиус фотона.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool GISampleRadiusEnabled;
Копировать Код
Public Property GISampleRadiusEnabled As Boolean
 Возвращает
 Возвращает true, если следует использовать заданный пользователем радиус фотона. В противном случае возвращает false.
 Описание
 Свойство GISampleRadiusEnabled позволяет определить, следует ли использовать заданный пользователем радиус фотона.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MentalRayRenderSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!