Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.SetContentColor
 Послать отзыв
 Метод позволяет задать цвет элемента содержимого, заданного по его индексу в указанной ячейке таблицы.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetContentColor( int row, int column, int contentIndex, ref Color color );
Копировать Код
Public virtual Sub SetContentColor( row As Integer, column As Integer, contentIndex As Integer, ByRef color As Color )
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 contentIndex
 Индекс элемента содержимого ячейки, тип int. Индекс должен быть больше или равен нулю и меньше количества элементов содержимого в ячейке.
 color
 Новый цвет элемента содержимого ячейки. Тип Color.
 col
 Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
 Описание
 Метод позволяет задать цвет элемента содержимого, заданного по его индексу в указанной ячейке таблицы.
 Замечания
 Для получения того же результата предпочтительнее использовать Table.Cells[row,column].ContentColor.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!