Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Field.SetData
 Послать отзыв
 Метод предоставляет возможность задать в этом поле данные с указанным ключом.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetData( ref String key, ref Object data );
Копировать Код
Public Sub SetData( ByRef key As String, ByRef data As Object )
 Параметры
 Параметры
 Описание
 key
 Ключ, с которым ассоциированы сохраняемые в поле данные. Тип String. Не может иметь значение null или быть пустой строкой.
 data
 Данные для поля. Тип Object.
 Описание
 Метод предоставляет возможность задать в этом поле данные с указанным ключом.
 Ссылки
 Teigha.DatabaseServices.Field, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!