Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FitData.==
 Послать отзыв
 Оператор равенства класса FitData.
 Синтаксис
C#
Visual Basic
Копировать Код
public static bool operator ==( FitData a, FitData b );
Копировать Код
Public Shared Operator =( a As FitData, b As FitData ) As Boolean
 Параметры
 Параметры
 Описание
 a
 Левый операнд. Тип FitData.
 b
 Правый операнд. Тип FitData.
 Возвращает
 Возвращает true, если операнды равны. В противном случае возвращает false.
 Описание
 Оператор равенства класса FitData.
 Ссылки
 Teigha.DatabaseServices.FitData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!