Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Viewport.AnnotationScale
 Послать отзыв
 Свойство AnnotationScale представляет объект масштаба аннотаций в данном видовом экране.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.AnnotationScale AnnotationScale;
Копировать Код
Public Property AnnotationScale As DatabaseServices.AnnotationScale
 Возвращает
 Возвращает объект масштаба аннотаций. Тип DatabaseServices.AnnotationScale.
 Описание
 Свойство AnnotationScale представляет объект масштаба аннотаций в данном видовом экране.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Viewport, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!