Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbSurfaceDefinition.UKnots
 Послать отзыв
 Свойство UKnots представляет узловой вектор поверхности в направлении U.
 Синтаксис
C#
Visual Basic
Копировать Код
public KnotCollection UKnots;
Копировать Код
Public ReadOnly Property UKnots As KnotCollection
 Возвращает
 Возвращает узловой вектор в направлении U. Тип KnotCollection.
 Описание
 Свойство UKnots представляет узловой вектор поверхности в направлении U.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.NurbSurfaceDefinition, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!