Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Interval.IsEqualAtLower
 Послать отзыв
 Метод проверяет, совпадают ли нижние границы данного и указанного интервалов в пределах заданной точности.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsEqualAtLower( ref Interval otherInterval );
Копировать Код
Public Function IsEqualAtLower( ByRef otherInterval As Interval ) As Boolean
 Параметры
 Параметры
 Описание
 otherInterval
 Проверяемый интервал. Тип Interval.
 Возвращает
 Возвращает true, если нижние границы двух интервалов совпадают в пределах заданной в данном объекте точности, либо если оба интервала не ограничены снизу. В противном случае возвращает false.
 Описание
 Метод проверяет, совпадают ли нижние границы данного и указанного интервалов в пределах заданной в данном объекте точности определения границ.
 Ссылки
 Teigha.Geometry.Interval, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!