Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DataCell.SetDouble
 Послать отзыв
 Метод устанавливает для этой ячейки значение типа double.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetDouble( double value );
Копировать Код
Public Sub SetDouble( value As Double )
 Параметры
 Параметры
 Описание
 value
 Входное значение для ячейки. Тип double.
 Описание
 Метод устанавливает для этой ячейки значение типа double, заданное входным аргументом value.
 Ссылки
 Teigha.DatabaseServices.DataCell, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!