Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve2d.GetSamplePoints
 Послать отзыв
 Метод позволяет получить указанное количество точек на кривой, равномерно распределенных в параметрическом пространстве кривой.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point2d[] GetSamplePoints( int numSample );
Копировать Код
Public Function GetSamplePoints( numSample As Integer ) As Point2d()
 Параметры
 Параметры
 Описание
 numSample
 Заказанное количество точек. Тип int.
 Возвращает
 Возвращает массив точек на кривой. Тип Point2d[].
 Описание
 Метод позволяет получить указанное количество точек на кривой, равномерно распределенных в параметрическом пространстве кривой. Например, если параметрический интервал кривой равен [0, 2], а аргумент numSample равен 5, полученные точки будут соответствовать следующим параметрическим значениям: 0, 0.5, 1, 1.5, 2.
 Ссылки
 Teigha.Geometry.Curve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!