Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GripOverrule.SetCustomFilter
 Послать отзыв
 Включает использование метода IsApplicable базового класса Overrule для фильтрации объектов, подлежащих объектному переопределению.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetCustomFilter();
Копировать Код
Public Sub SetCustomFilter()
 Описание
 Включает использование метода IsApplicable базового класса Overrule для фильтрации объектов, подлежащих объектному переопределению.
 Ссылки
 Teigha.DatabaseServices.GripOverrule, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!