Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocArrayParameters.Commit
 Послать отзыв
 Метод предназначен для коммита (фиксации) изменений в объекте AssocArrayParameters и синхронизации изменений с базой данных, таким образом, изменения в массиве становятся видны на экране.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Commit();
Копировать Код
Public Sub Commit()
 Описание
 Метод предназначен для коммита (фиксации) изменений в объекте AssocArrayParameters и синхронизации изменений с базой данных, таким образом, изменения в массиве становятся видны на экране. Если у объекта AssocArrayParameters нет владельца, никакие изменения не фиксируются.
 Ссылки
 Teigha.DatabaseServices.AssocArrayParameters, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!