Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.HostApplicationServices.Program
 Послать отзыв
 Свойство возвращает наименование программы.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual String Program;
Копировать Код
Public Overridable ReadOnly Property Program As String
 Возвращает
 Возвращает наименование программы. Тип String.
 Описание
 Свойство возвращает наименование программы.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.HostApplicationServices, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!