Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.Measurement
 Послать отзыв
 Свойство возвращает значение размера как значение с плавающей точкой двойной точности.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Measurement;
Копировать Код
Public Property Measurement As Double
 Возвращает
 Возвращает значение размера. Тип double.
 Описание
 Свойство возвращает значение размера как значение с плавающей точкой двойной точности. Для линейных размеров — это длина, для угловых размеров — это угол. Объект Dimension вычисляют это значение автоматически. Изменять его нельзя.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!