Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbCurve2d.GetWeightAt
 Послать отзыв
 Метод предоставляет вес управляющей вершины с указанным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public double GetWeightAt( int index );
Копировать Код
Public Function GetWeightAt( index As Integer ) As Double
 Параметры
 Параметры
 Описание
 index
 Индекс управляющей вершины. Тип int. Должен быть неотрицательным и меньше количества управляющих вершин.
 Возвращает
 Возвращает значение веса по указанному индексу. Тип double.
 Описание
 Метод предоставляет значение веса для управляющей вершины с указанным индексом.
 Ссылки
 Teigha.Geometry.NurbCurve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!