Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Solid3dMassProperties.ProductsOfIntertia
 Послать отзыв
 Свойство ProductsOfIntertia представляет центробежные моменты инерции твердого тела относительно осей X, Y и Z.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d ProductsOfIntertia;
Копировать Код
Public ReadOnly Property ProductsOfIntertia As Vector3d
 Возвращает
 Возвращает центробежные моменты инерции. Тип Vector3d.
 Описание
 Свойство ProductsOfIntertia представляет центробежные моменты инерции твердого тела относительно осей X, Y и Z.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Solid3dMassProperties, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!