Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.ViewTableId
 Послать отзыв
 Синтаксис
C#
Visual Basic
public DatabaseServices::ObjectId ViewTableId;
Public Property ViewTableId() As DatabaseServices.ObjectId
 Описание
 Возвращает Id таблицы видов базы данных.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!