Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AbstractViewPE.ViewTwist
 Послать отзыв
 Свойство ViewTwist представляет угол поворота вида.
 Синтаксис
C#
Visual Basic
Копировать Код
public double ViewTwist;
Копировать Код
Public ReadOnly Property ViewTwist As Double
 Возвращает
 Возвращает угол поворота вида. Тип double.
 Описание
 Свойство ViewTwist представляет угол поворота вида.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.AbstractViewPE, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!