Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SubDMesh.SetSphere
 Послать отзыв
 Метод создает сеть в виде сферы.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetSphere( double radius, int divAxis, int divHeight, int smoothLevel );
Копировать Код
Public Sub SetSphere( radius As double, divAxis As Integer, divHeight As Integer, smoothLevel As Integer )
 Параметры
 Параметры
 Описание
 radius
 Радиус сферы, double.
 divAxis
 Определяет количество разделений в базовой окружности, int.
 divHeight
 Определяет количество разделений в направлдении высоты сферы, int.
 smoothLevel
 Степень сглаживания сети, int.
 Описание
 Метод создает сеть в виде сферы.
 Ссылки
 Teigha.DatabaseServices.SubDMesh, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!