Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Database.WblockCloneObjects
 Послать отзыв
 Синтаксис
C#
Visual Basic
public void WblockCloneObjects(ref ObjectIdCollection identifiers, ObjectId id, ref IdMapping mapping, DuplicateRecordCloning cloning, bool deferTranslation);
Public Sub WblockCloneObjects(ByRef identifiers As ObjectIdCollection, id As ObjectId, ByRef mapping As IdMapping, cloning As DuplicateRecordCloning, deferTranslation As bool)
 Параметры
 Параметры
 Описание
 identifiers
 Входная коллекция Id клонируемых объектов
 id
 Id объекта, который будет владельцем клонов
 mapping
 Коллекция IdPair пар объектов для использования для преобразования отношения между Id объектов
 cloning
 Действие при обнаружении повторений
 deferTranslation
 Признак необходимости выполнения Id преобразования методом
 Описание
 Клонирует все объекты коллекции identifiers и добавляет их в контейнер, с заданным параметром id владельцем. Объекты могут быть из разных баз данных, и должны соответствовать типу владельца и быть из другой базы данных, чем та, в которой находится объект-владелец.
 id может относиться только к объектам типа BlockTableRecord, Dictionary или SymbolTable. Если владелец — Dictionary, вновь клонированные геометрические объекты будут заданы как анонимные.
 mapping заполняется IdPair объектов, которые содержат пары Id объектов — исходного и клонированного. Этот объект может использоваться для последующей обработки объектов, включенных в операцию deepClone.
 Значение cloning определяет, что произойдет, если символы словаря будут клонированы и будет обнаружено их совпадение с уже существующими в базе данных назначения. Параметр cloning должен иметь одно и то же значение при множественных вызовах, и это должно быть одно из следующих значений:
Ignore — если совпадение с существующим символом произойдет, клон игнорируется, и продолжает использоваться существующая запись в базе данных назначения. Это такой же режим, как в команде INSERT и методе Database.insert().
Replace — если совпадение с существующим символом произойдет, запись заменяется на запись клонированного объекта.
MangleName — изменяет все входящие имена записей. Это изменение гарантирует уникальность имен. Это такой же режим, как при работе команды RefEdit.
UnmangleName — сначала используется RefEdit, и он проверяет записи в базах данных источников. Любые изменения, сделанные kDrcMangleName, отменяются и затем параметр устанавливается в Ignore. Другими словами, если повторения обнаружатся после удаления переименований, nanoCAD продолжит использовать существующую запись и игнорирует клонированную.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!