Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CellContent.GetTextString
 Послать отзыв
 Метод предоставляет содержимое ячейки в виде текстовой строки с предписанным форматированием.
 Синтаксис
C#
Visual Basic
Копировать Код
public String GetTextString( FormatOption formatOption );
Копировать Код
Public Function GetTextString( formatOption As FormatOption ) As String
 Параметры
 Параметры
 Описание
 formatOption
 Опции форматирования значений в ячейке. Перечисление FormatOption.
 Возвращает
 Возвращает содержимое ячейки в виде отформатированной текстовой строки. Тип String.
 Описание
 Метод предоставляет содержимое ячейки в виде текстовой строки, формат которой определяется аргументом formatOption.
 Ссылки
 Teigha.DatabaseServices.CellContent, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!