Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Ole2Frame.LinkPath
 Послать отзыв
 Свойство представляет имя файла, с которым связан данный объект Ole2Frame.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual String LinkPath;
Копировать Код
Public Overridable ReadOnly Property LinkPath As String
 Возвращает
 Возвращает полное имя файла. Тип String.
 Описание
 Свойство представляет имя файла и элемент, с которым связан данный объект Ole2Frame.
 Пример: D:/My Documents/My Workbook.xls
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Ole2Frame, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!