Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObjectCollection.Insert
 Послать отзыв
 Метод вставляет указанный объект DBObject в заданную позицию коллекции.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Insert( int index, ref DBObject value );
Копировать Код
Public Function Insert( index As Integer, ByRef value As DBObject )
 Параметры
 Параметры
 Описание
 index
 Индекс позиции для вставки объекта (тип int). DBObject value : Вставляемый объект типа DBObject.
 Описание
 Метод вставляет указанный объект DBObject в заданную позицию коллекции.
 Ссылки
 Teigha.DatabaseServices.DBObjectCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!