Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbCurve3d.AddControlPointAt
 Послать отзыв
 Метод добавляет управляющую вершину в указанном узле.
 Синтаксис
C#
Visual Basic
Копировать Код
public void AddControlPointAt( double newKnot, Point3d point, double weight );
Копировать Код
Public Sub AddControlPointAt( newKnot As Double, point As Point3d, weight As Double )
 Параметры
 Параметры
 Описание
 newKnot
 Параметр узла, в котором добавляется новая управляющая вершина. Тип double.
 point
 Координаты добавляемой управляющей вершины. Тип Point3d.
 weight
 Значение веса, которое присваивается управляющей вершине. Тип double.
 Описание
 Метод добавляет управляющую вершину в указанном узле.
 Ссылки
 Teigha.Geometry.NurbCurve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!