Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.PolylineCurve2d.NumberOfFitPoints
 Послать отзыв
 Свойство NumberOfFitPoints представляет количество определяющих точек данного сплайна.
 Синтаксис
C#
Visual Basic
Копировать Код
public int NumberOfFitPoints;
Копировать Код
Public ReadOnly Property NumberOfFitPoints As Integer
 Возвращает
 Возвращает количество определяющих точек сплайна. Тип int.
 Описание
 Свойство NumberOfFitPoints представляет количество определяющих точек данного сплайна.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.PolylineCurve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!