Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Solid3d.OffsetBody
 Послать отзыв
 Метод реализует смещение всех граней данного твердого тела на указанное расстояние.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void OffsetBody( double offsetDistance );
Копировать Код
Public Overridable Sub OffsetBody( offsetDistance As Double )
 Параметры
 Параметры
 Описание
 offsetDistance
 Величина смещения. Тип double.
 Описание
 Метод реализует смещение всех граней данного твердого тела на указанное расстояние.
 Если грань имеет поверхности, которые сместить невозможно, она удаляется. Это означает, что операция смещения может привести к тому, что тело станет недопустимым.
 Этот метод реализован только в среде пространственного моделирования.
 Ссылки
 Teigha.DatabaseServices.Solid3d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!