Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AttributeReference.Tag
 Послать отзыв
 Свойство позволяет получить или задать строковое значение тега данного объекта AttributeReference.
 Синтаксис
C#
Visual Basic
Копировать Код
public String Tag;
Копировать Код
Public Property Tag() As String
 Возвращает
 Возвращает строку тега. Тип String.
 Описание
 Свойство позволяет получить или задать строковое значение тега данного объекта AttributeReference.
 Замечания
 В DXF для тегов используется код группы 2.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.AttributeReference, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!