Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SectionSettings.GetHatchPatternName
 Послать отзыв
 Метод позволяет получить имя образца штриховки геометрии сечения указанного типа.
 Синтаксис
C#
Visual Basic
Копировать Код
public String GetHatchPatternName( SectionType nSecType, SectionGeometry nGeometry );
Копировать Код
Public Function GetHatchPatternName( nSecType As SectionType, nGeometry As SectionGeometry ) As String
 Параметры
 Параметры
 Описание
 nSecType
 Тип сечения. Перечисление SectionType.
 nGeometry
 Типы элементов геометрии сечения. Перечисление SectionGeometry.
 Возвращает
 Возвращает имя образца штриховки. Тип String.
 Описание
 Метод позволяет получить имя образца штриховки геометрии сечения указанного типа.
 Ссылки
 Teigha.DatabaseServices.SectionSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!