Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.UnderlayReference.GetClipBoundary
 Послать отзыв
 Метод предоставляет массив точек, определяющих границу обрезки данной подложки.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point2d[] GetClipBoundary();
Копировать Код
Public Function GetClipBoundary() As Point2d()
 Возвращает
 Возвращает массив точек границы обрезки. Тип Point2d[].
 Описание
 Метод предоставляет массив точек, определяющих границу обрезки данной подложки.
 Замечания
 Граница определяется в координатах модели. Для перехода к координатам мировой системы координат (WCS) используйте матрицу преобразования, возвращаемую свойством UnderlayReference.Transform.
 Ссылки
 Teigha.DatabaseServices.UnderlayReference, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!