Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Leader.EvaluateLeader
 Послать отзыв
 Синтаксис
C#
Visual Basic
public void EvaluateLeader();
Public Sub EvaluateLeader()
 Описание
 Вычисляет отношения выноски с ассоциированной аннотацией и обновляет геометрию выноски, если это необходимо.
 Это может вызвать изменения положения конечной точки выноски, и метод может полностью удалить ассоциативные связи в одном из следующих случаев:
Id аннотации выноски не является корректным Id объекта;
Id выноски не представлен постоянным реактором в аннотационном объекте.
 Ссылки
 Teigha.DatabaseServices.Leader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!