Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotStyleData.GrayScaleOn
 Послать отзыв
 Свойство GrayScaleOn позволяет определить, включен ли режим GrayScale.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool GrayScaleOn;
Копировать Код
Public Property GrayScaleOn As Boolean
 Возвращает
 Возвращает true, если в данном объекте включен режим отображения GrayScale. В противном случае возвращает false.
 Описание
 Свойство GrayScaleOn позволяет определить, включен ли в данном объекте режим GrayScale отображения объектов в полутонах серого..
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.PlotStyleData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!