Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Extents3d.AddPoint
 Послать отзыв
 Метод позволяет расширить данный объект Extents3d так, чтобы включить в свой объем указанную точку Point3d.
 Синтаксис
C#
Visual Basic
Копировать Код
public void AddPoint( Point3d pt );
Копировать Код
Public Sub AddPoint( pt As Point3d )
 Параметры
 Параметры
 Описание
 pt
 Входная 3D-точка. Тип Point3d.
 Описание
 Метод позволяет расширить данный объект Extents3d так, чтобы включить в свой объем указанную точку Point3d.
 Ссылки
 Teigha.DatabaseServices.Extents3d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!