Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FormattedTableData.SetBackgroundColor
 Послать отзыв
 Метод позволяет задать цвет фона в ячейке, строке или столбце.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetBackgroundColor( int row, int column, ref Colors.Color value );
Копировать Код
Public Overridable Sub SetBackgroundColor( row As Integer, column As Integer, ByRef value As Colors.Color )
 Параметры
 Параметры
 Описание
 row
 Индекс строки. Тип int. Индекс может равняться -1.
 column
 Индекс столбца. Тип int. Индекс может равняться -1.
 value
 Новый цвет фона. Тип Teigha.Colors.Color.
 Описание
 Метод позволяет задать цвет фона в ячейке, строке или столбце.
 Чтобы указать ячейку, следует передать действительные индексы строки и столбца. Чтобы указать строку, следует передать действительный индекс строки и -1 в качестве индекса столбца. Чтобы указать столбец, следует передать действительный индекс столбца и -1 в качестве индекса строки.
 Ссылки
 Teigha.DatabaseServices.FormattedTableData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!