Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocAction.EvaluateDependency
 Послать отзыв
 Метод реализует перевычисление ассоциативной зависимости на уровне действия-владельца.
 Синтаксис
C#
Visual Basic
Копировать Код
public void EvaluateDependency( ref AssocDependency dependency );
Копировать Код
Public Sub EvaluateDependency( ByRef dependency As AssocDependency )
 Параметры
 Параметры
 Описание
 dependency
 Входная ассоциативная зависимость. Тип AssocDependency.
 Описание
 Метод делегирован из метода AssocDependency.evaluateOverride() принадлежащей данному действию зависимости. Это позволяет действию-владельцу выполнять перевычисление вместо самой зависимости. Реализация по умолчанию всего лишь выставляет статус зависимости равным IsUpToDateAssocStatus.
 Если действию принадлежит объект AssocActionBody с переопределенным методом AssessmentDependencyOverride(), именно переопределенный метод вызывается для вычисления зависимости.
 Ссылки
 Teigha.DatabaseServices.AssocAction, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!