Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Ellipse.StartParam
 Послать отзыв
 Свойство StartParam обеспечивает доступ к значению начального параметра эллипса или эллиптической дуги.
 Синтаксис
C#
Visual Basic
Копировать Код
public double StartParam;
Копировать Код
Public Property StartParam As double
 Возвращает
 Возвращает значение начального параметра эллипса в радианах. Тип double.
 Описание
 Свойство StartParam обеспечивает доступ к значению начального параметра эллипса или эллиптической дуги. Параметр — это угол, измеряемый от большой оси против часовой стрелки в интервале от 0 до 2PI радиан, как если бы эллипс был окружностью с радиусом MajorRadius.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Ellipse, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!