Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SectionHitTestInfo.Index
 Послать отзыв
 Свойство Index представляет отсчитываемый от нуля индекс сегмента на линии сечения, который проходит рядом или через точку попадания.
 Синтаксис
C#
Visual Basic
Копировать Код
public int Index;
Копировать Код
Public ReadOnly Property Index As Integer
 Возвращает
 Возвращает индекс сегмента. Тип int.
 Описание
 Свойство Index представляет отсчитываемый от нуля индекс сегмента на линии сечения, который проходит рядом или через точку попадания.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.SectionHitTestInfo, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!