Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Surface.ConvertToNurbSurface
 Послать отзыв
 Метод предназначен для преобразования данного объекта в NURB-поверхности.
 Синтаксис
C#
Visual Basic
Копировать Код
public NurbSurface[] ConvertToNurbSurface();
Копировать Код
Public Function ConvertToNurbSurface() As NurbSurface()
 Возвращает
 Возвращает массив сгенерированных NURB-поверхностей. Тип NurbSurface[].
 Описание
 Метод предназначен для преобразования данного объекта в NURB-поверхности.
 Замечания
 Этот метод реализован только в среде пространственного моделирования Spatial Modeler.
 Ссылки
 Teigha.DatabaseServices.Surface, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!