Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Polyline.ConvertFrom
 Послать отзыв
 Синтаксис
C#
Visual Basic
public void ConvertFrom(ref Entity entity, bool transferId);
Public Sub ConvertFrom(ByRef entity As Entity, transferId As bool)
 Параметры
 Параметры
 Описание
 entity
 Указатель на копируемый объект Polyline2d
 transferId
 Признак, будет или нет производиться HandOverTo между Polyline2D и Polyline
 Описание
 Этот метод заполняет данными Polyline из объекта типа Polyline2d, на который указывает параметр entity. entity должен указывать на SimplePoly или FitCurvePoly типы объекта Polyline2d базы данных. Этот метод должен вызываться из объекта Polyline, который еще не является резидентным в базе данных.
 Если transferId установлен в true, объект Polyline станет резидентным в базе данных. Этот объект сможет получить Id объекта, дескриптор и любые расширенные данные геометрического объекта (кроме данных вершин), расширенный словарь и реакторы из Polyline2d, на который указывает параметр entity. entity будет затем удален и установлен в NULL.
 Если transferId установлен в false, entity останется в базе данных как он и был, и вызвавший метод должен закрыть его. Полученный объект Polyline не станет резидентом базы данных, и, если он не будет добавлен к базе данных, то должен быть удален.
 Ссылки
 Teigha.DatabaseServices.Polyline, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!