Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Filters.LayerFilter.IsValid
 Послать отзыв
 Свойство IsValid позволяет проверить, все ли добавленные в данный фильтр слои существуют в базе данных, с которой связан данный фильтр.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual bool IsValid;
Копировать Код
Public Overridable ReadOnly Property IsValid As Boolean
 Возвращает
 Возвращает true, только если все зарегистрированные в фильтре слои присутствуют в базе данных чертежа. В противном случае возвращает false.
 Описание
 Свойство IsValid позволяет проверить, все ли добавленные в данный фильтр слои существуют в базе данных, с которой связан данный фильтр.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Filters.LayerFilter, Teigha.DatabaseServices.Filters
 Ваши комментарии по поводу этого топика: Послать отзыв!