Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Mline.VertexAt
 Послать отзыв
 Метод позволяет получить вершину данного объекта MLine с указанным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d VertexAt( int index );
Копировать Код
Public Function VertexAt( index As Integer ) As Point3d
 Параметры
 Параметры
 Описание
 index
 Индекс искомой вершины. Тип int.
 Возвращает
 Возвращает точку Point3d в вершине с индексом index.
 Описание
 Метод позволяет получить точку Point3d в вершине данного объекта MLine с указанным индексом index.
 Ссылки
 Teigha.DatabaseServices.Mline, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!