Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Scale2d.Scale2d
 Послать отзыв
 Конструктор структуры Scale2d. Создает экземпляр структуры, который представляет преобразование масштаба с указанным массивом масштабных коэффициентов.
 Синтаксис
C#
Visual Basic
Копировать Код
public Scale2d( ref double[] xy );
Копировать Код
Public Sub New( ByRef xy As Double( )
 Параметры
 Параметры
 Описание
 xy
 Входной массив масштабных коэффициентов. Тип double[].
 Описание
 Конструктор структуры Scale2d. Создает экземпляр структуры, который представляет преобразование масштаба с указанным массивом масштабных коэффициентов.
 Замечания
 Используются только первые два элемента массива xy. Эти элементы массива не должны быть нулевыми.
 Каждый из элементов массива xy представляет свой масштабный коэффициент:
0 — масштабный коэффициент для оси X,
1 — масштабный коэффициент для оси Y.
 Ссылки
 Teigha.Geometry.Scale2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!