Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBVisualStyle.CopyFrom
 Послать отзыв
 Метод делает данный объект копией указанного визуального стиля VisualStyle.
 Синтаксис
C#
Visual Basic
Копировать Код
public void CopyFrom( ref VisualStyle pSrc );
Копировать Код
Public Sub CopyFrom( ByRef pSrc As VisualStyle )
 Параметры
 Параметры
 Описание
 pSrc
 Визуальный стиль, являющийся источником данных для операции копирования. Тип VisualStyle.
 Описание
 Метод делает данный объект копией указанного визуального стиля VisualStyle.
 Ссылки
 Teigha.DatabaseServices.DBVisualStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!