Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DrawLeaderOrderType
 Послать отзыв
 Данное перечисление определяет последовательность отрисовки линии выноски объекта MLeader.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum DrawLeaderOrderType { DrawLeaderHeadFirst = 0, DrawLeaderTailFirst = 1 }
Копировать Код
Public Enum DrawLeaderOrderType DrawLeaderHeadFirst = 0 DrawLeaderTailFirst = 1 End Enum
 Члены
 Члены
 Описание
 DrawLeaderHeadFirst
 Значение: 0. Последовательность отрисовки от первого сегмента к последнему.
 DrawLeaderTailFirst
 Значение: 1. Последовательность отрисовки от последнего сегмента к первому.
 Описание
 Данное перечисление определяет последовательность отрисовки линии выноски объекта MLeader.
 Ваши комментарии по поводу этого топика: Послать отзыв!