Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Hatch.GradientType
 Послать отзыв
 Синтаксис
C#
Visual Basic
public DatabaseServices::GradientPatternType GradientType;
Public Property GradientType() As DatabaseServices.GradientPatternType
 Описание
 Возвращает eнумератор, определяющий тип образца градиента.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.Hatch, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!