Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CompoundObjectId.FullPath
 Послать отзыв
 Свойство предоставляет полный путь, т.е. путь вхождений BlockReference, концом которого является идентификатор ObjectId.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectIdCollection FullPath;
Копировать Код
Public Property FullPath() As ObjectIdCollection
 Возвращает
 Возвращает полный путь вхождений BlockReference. Тип ObjectIdCollection.
 Описание
 Свойство предоставляет полный путь, т.е. путь вхождений BlockReference, концом которого является идентификатор ObjectId.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.CompoundObjectId, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!