Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PolygonMesh.PolyMeshType
 Послать отзыв
 Свойство предоставляет доступ к типу PolyMeshType сети PolygonMesh.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.PolyMeshType PolyMeshType;
Копировать Код
Public Property PolyMeshType() As DatabaseServices.PolyMeshType
 Возвращает
 Возвращает тип PolyMeshType сети.
 Описание
 Свойство предоставляет доступ к типу PolyMeshType сети PolygonMesh.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.PolygonMesh, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!