Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MlineStyle.EndSquareCap
 Послать отзыв
 Свойство управляет отображением квадратного торцевого ограничителя на завершающем торце мультилинии.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool EndSquareCap;
Копировать Код
Public Property EndSquareCap As Boolean
 Возвращает
 Возвращает true, если отображение квадратного торцевого ограничителя включено. В противном случае возвращает false.
 Описание
 Свойство управляет отображением квадратного торцевого ограничителя на завершающем торце мультилинии.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MlineStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!