Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DxfFiler.WriteInt64
 Послать отзыв
 Метод записывает в данный объект Filer указанное 64-разрядное целое число со знаком (long long).
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract void WriteInt64( DxfCode opCode, long long value );
Копировать Код
Public MustOverride Sub WriteInt64( opCode As DxfCode, value As long long )
 Параметры
 Параметры
 Описание
 opCode
 Групповой код DXF. Тип DxfCode.
 value
 Значение, которое следует записать. Тип long long.
 Описание
 Метод записывает в данный объект Filer указанные групповой код DXF и 64-разрядное целое число со знаком (long long).
 Ссылки
 Teigha.DatabaseServices.DxfFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!