Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObject.DisableUndoRecording(bool)
 Послать отзыв
 Метод управляет отменой записи этого объекта в буфер Undo.
 Синтаксис
C#
Visual Basic
Копировать Код
public void DisableUndoRecording(bool disable);
Копировать Код
Public Sub DisableUndoRecording(disable As bool)
 Параметры
 Параметры
 Описание
 disable
 Признак включения или выключения запись в буфер Undo
 Описание
 Метод включает или выключает запись в буфер Undo для объекта. Если значение disable равно true, запись в буфер Undo выключена.
 Ссылки
 Teigha.DatabaseServices.DBObject, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!