Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObject.IsNotifyEnabled
 Послать отзыв
 Свойство предоставляет информацию, открыт ли объект в режиме OpenMode.ForNotify.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsNotifyEnabled;
Копировать Код
Public Property IsNotifyEnabled() As bool
 Возвращает
 Возвращает тип данных bool. Возвращает true, если объект в настоящее время открыт в режиме OpenMode.ForNotify.
 Описание
 Свойство предоставляет информацию, открыт ли объект в режиме OpenMode.ForNotify.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.DBObject, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!