Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotStyleTable.Description
 Послать отзыв
 Свойство Description представляет описание данной таблицы стилей печати.
 Синтаксис
C#
Visual Basic
Копировать Код
public String Description;
Копировать Код
Public Property Description As String
 Возвращает
 Возвращает описание данной таблицы стилей печати. Тип String.
 Описание
 Свойство Description представляет описание данной таблицы стилей печати PlotStyleTable.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.PlotStyleTable, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!