Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MTextFragment.ShxFont
 Послать отзыв
 Свойство возвращает имя шрифта SHX.
 Синтаксис
C#
Visual Basic
Копировать Код
public String ShxFont;
Копировать Код
Public ReadOnly Property ShxFont As String
 Возвращает
 Возвращает имя шрифта SHX. Тип String.
 Описание
 Свойство возвращает имя шрифта SHX.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.MTextFragment, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!