Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SubDMesh.GetObjectMesh
 Послать отзыв
 Метод предназначен для тесселяции существующего твердого тела или поверхностного объекта для формирования данных сети с использованием заданных настроек фасетирования.
 Синтаксис
C#
Visual Basic
Копировать Код
public static MeshDataCollection GetObjectMesh( ref DBObject dbObj, MeshFaceterData faceterData );
Копировать Код
Public static Function GetObjectMesh( ByRef dbObj As DBObject, faceterData As MeshFaceterData ) As MeshDataCollection
 Параметры
 Параметры
 Описание
 dbObj
 Исходный объект для получения сети. Тип DBObject.
 faceterData
 Исходная информация о настройках фасетирования. Тип MeshFaceterData.
 Возвращает
 Возвращает коллекцию MeshDataCollection, содержащую массив вершин, массив списков граней и данные граней.
 Описание
 Метод предназначен для тесселяции существующего твердого тела или поверхностного объекта для формирования данных сети с использованием заданных настроек фасетирования. Данные сети включают в себя массив вершин, массив списков граней и данные граней.
 Ссылки
 Teigha.DatabaseServices.SubDMesh, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!