Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Viewport.SnapAngle
 Послать отзыв
 Свойство SnapAngle представляет угол поворота шаговой привязки в данном видовом экране относительно текущей ПСК (UCS).
 Синтаксис
C#
Visual Basic
Копировать Код
public double SnapAngle;
Копировать Код
Public Property SnapAngle As Double
 Возвращает
 Возвращает угол поворота шаговой привязки (в радианах). Тип double.
 Описание
 Свойство SnapAngle представляет угол поворота шаговой привязки в данном видовом экране относительно текущей пользовательской системы координат (ПСК, UCS).
 Угол поворота определяется в плоскости XY ПСК относительно оси X ПСК. Положительным направлением отсчета углов является направление против часовой стрелки, если смотреть вдоль оси Z ПСК в сторону начала системы координат.
 Замечания
 См. также описание системной переменной SNAPANG и команды SNAP.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Viewport, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!