Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Leader.HasHookLine
 Послать отзыв
 Синтаксис
C#
Visual Basic
public bool HasHookLine;
Public Property HasHookLine() As bool
 Описание
 Возвращает признак того, используется ли "полка" в выноске. "Полка" представляет собой маленькую горизонтальную линию в конце линии выноски сразу перед аннотацией.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.Leader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!