Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 DimStyleTableRecord.Dimaltrnd
 Послать отзыв
 Свойство предназначено для настройки округления альтернативных измерений в размерах.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual double Dimaltrnd { get; set; }
Копировать Код
Public Overridable Property Dimaltrnd As Double
 Возвращает
 Возвращает тип данных double.
 Описание
 В свойстве хранится значение точности округления альтернативных измерений в размерах. В свойстве могут храниться только положительные вещественные числа. Значение по умолчанию 0 означает, что округления нет.
 Свойство также доступно через системную переменную DIMALTRND и пользовательское меню в окне изменения/создания размерного стиля:
  При изменении системной переменной DIMALTRND будет создан новый размерный стиль под названием <переопределение> на основе текущего с новым значением DIMALTRND.
 Условия
 Чтение и запись.
 Пример
 В качестве примера работы со свойством Dimaltrnd можно рассмотреть пример, приведенный в описании свойства Dimrnd, заменив в нем Dimrnd на Dimaltrnd и добавив проверку признака отображения альтернативных измерений (значения свойства Dimalt) с изменением его на true (включить отображение альтернативных измерений), если оно равно false (отображение альтернативных измерений отключено).
 Ссылки
 Teigha.DatabaseServices.DimStyleTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!