Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Database.GetAllDatabases
 Послать отзыв
 This is GetAllDatabases, a member of class Database.
 Синтаксис
C#
Visual Basic
public Generic.List<Database^> GetAllDatabases();
Public Function GetAllDatabases() As Generic.List<Database^>
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!