Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.RenderGlobal.SaveFileName
 Послать отзыв
 Свойство SaveFileName представляет полный путь и имя файла изображения.
 Синтаксис
C#
Visual Basic
Копировать Код
public String SaveFileName;
Копировать Код
Public Property SaveFileName As String
 Возвращает
 Возвращает полное имя файла изображения (путь и имя). Тип String.
 Описание
 Свойство SaveFileName представляет полный путь и имя файла изображения.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.RenderGlobal, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!