Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CubicSplineCurve2d.GetFirstDerivativeAt
 Послать отзыв
 Метод позволяет получить вектор первой производной в определяющей точке этого сплайна с заданным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector2d GetFirstDerivativeAt( int index );
Копировать Код
Public Function GetFirstDerivativeAt( index As Integer ) As Vector2d
 Параметры
 Параметры
 Описание
 index
 Индекс определяющей точки, в которой требуется вычислить вектор первой производной. Тип int.
 Возвращает
 Возвращает вектор первой производной в указанной определяющей точке сплайна. Тип Vector2d.
 Описание
 Метод позволяет получить вектор первой производной в определяющей точке этого сплайна с заданным индексом.
 Ссылки
 Teigha.Geometry.CubicSplineCurve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!