Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.PlanarEntity.ClosestPointToLinearEntity
 Послать отзыв
 Метод вычисляет точку на данной плоской поверхности, которая располагается ближе всего к указанной линии, и точку на этой линии, которая ближе всего располагается к данной плоской поверхности. Вычисление координат точек выполняется в пределах точности по умолчанию.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d[] ClosestPointToLinearEntity( ref LinearEntity3d line );
Копировать Код
Public Function ClosestPointToLinearEntity( ByRef line As LinearEntity3d ) As Point3d()
 Параметры
 Параметры
 Описание
 line
 Входная линия. Тип LinearEntity3d.
 Возвращает
 Возвращает массив из двух точек. Тип Point3d[]. Первый элемент массива соответствует ближайшей точке на линии line, а второй — ближайшей точке на данной плоской поверхности.
 Описание
 Метод вычисляет точку на данной плоской поверхности, которая располагается ближе всего к указанной линии, и точку на этой линии, которая ближе всего располагается к данной плоской поверхности.
 Используется вызов метода PlanarEntity.ClosestPointToLinearEntity(LinearEntity3d line, Tolerance tolerance) с точностью по умолчанию, равной Tolerance.Global.
 Ссылки
 Teigha.Geometry.PlanarEntity, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!