Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Section.RemoveVertex
 Послать отзыв
 Метод предназначен для удаления из секущей плоскости вершины с указанным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public void RemoveVertex( int nIndex );
Копировать Код
Public Sub RemoveVertex( nIndex As Integer )
 Параметры
 Параметры
 Описание
 nIndex
 Индекс удаляемой вершины. Тип int.
 Описание
 Метод предназначен для удаления из секущей плоскости вершины с указанным индексом. Первую вершину удалить нельзя.
 Ссылки
 Teigha.DatabaseServices.Section, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!