Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LoftOptionsBuilder.AlignDirection
 Послать отзыв
 Свойство позволяет проверить состояние флага-индикатора "правильной" взаимной ориентации нормалей заданных поперечных сечений.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool AlignDirection;
Копировать Код
Public Property AlignDirection As Boolean
 Возвращает
 Возвращает true в случае корректной взаимной ориентации поперечных сечений. В противном случае возвращает false.
 Описание
 Свойство позволяет проверить состояние флага-индикатора "правильной" взаимной ориентации заданных поперечных сечений. Они должны быть ориентированы так, чтобы вектор нормали каждого сечения указывал на следующее сечение. Нарушение этого правила может приводить к нежелательным искривлениям или самопересечениям получаемой поверхности.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.LoftOptionsBuilder, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!