Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObject.IsReadEnabled
 Послать отзыв
 Свойство предоставляет информацию, открыт ли объект на чтение.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsReadEnabled;
Копировать Код
Public Property IsReadEnabled() As bool
 Возвращает
 Возвращает тип данных bool. Возвращает true, если объект в данный момент открыт в режиме OpenMode.ForRead.
 Описание
 Свойство предоставляет информацию, открыт ли объект на чтение.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.DBObject, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!