Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbCurve2d.SetFitData
 Послать отзыв
 Метод пересчитывает сплайн, используя заданные определяющие точки, векторы касательных в начальной и конечной точках и точность интерполяции.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetFitData( ref Point2dCollection fitPoints, Vector2d startTangent, Vector2d endTangent, Tolerance fitTolerance );
Копировать Код
Public Sub SetFitData( ByRef fitPoints As Point2dCollection, startTangent As Vector2d, endTangent As Vector2d, fitTolerance As Tolerance )
 Параметры
 Параметры
 Описание
 fitPoints
 Определяющие точки. Тип Point2dCollection.
 startTangent
 Вектор касательной в начальной точке. Тип Vector2d.
 endTangent
 Вектор касательной в конечной точке. Тип Vector2d.
 fitTolerance
 Требуемая точность интерполяции. Тип Tolerance.
 Описание
 Метод пересчитывает сплайн, используя заданные определяющие точки, векторы касательных в начальной и конечной точках и точность интерполяции.
 Если аргумент fitTolerance не равен 0, то построенный сплайн может не проходить точно через определяющие точки, но максимальное отклонение построенного сплайна от любой определяющей точки не будет превышать fitTolerance.
 Ссылки
 Teigha.Geometry.NurbCurve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!