Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CoordinateSystem3d.ToString
 Послать отзыв
 Метод позволяет получить эквивалентное строковое представление данного объекта в предписанном формате и с учетом заданных языковых и региональных настроек.
 Синтаксис
C#
Visual Basic
Копировать Код
public String ToString( ref String format, ref IFormatProvider provider );
Копировать Код
Public Function ToString( ByRef format As String, ByRef provider As IFormatProvider ) As String
 Параметры
 Параметры
 Описание
 format
 Предписанный формат строки. Тип String.
 provider
 Входной провайдер региональных и языковых настроек. Тип IFormatProvider.
 Возвращает
 Возвращает строковое представление данного объекта. Тип String.
 Описание
 Метод позволяет получить эквивалентное строковое представление данного объекта в предписанном формате и с учетом заданных языковых и региональных настроек. Возвращаемая строка включает начало этой системы координат и направления её осей X, Y и Z
 Ссылки
 Teigha.Geometry.CoordinateSystem3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!