Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Делегат Teigha.DatabaseServices.SystemVariableChangingEventHandler
 Послать отзыв
 This is type Teigha::DatabaseServices::SystemVariableChangingEventHandler.
 Синтаксис
C#
Visual Basic
public delegate SystemVariableChangingEventHandler();
Public Delegate Sub SystemVariableChangingEventHandler()
 Ваши комментарии по поводу этого топика: Послать отзыв!