Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.UnderlayItem.UsingPartialContent
 Послать отзыв
 Свойство UsingPartialContent позволяет определить, использует ли данный элемент только часть содержимого листа/модели, представленного элементом.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool UsingPartialContent;
Копировать Код
Public ReadOnly Property UsingPartialContent As Boolean
 Возвращает
 Возвращает true, если элемент использует лишь часть содержимого листа/модели. В противном случае возвращает false.
 Описание
 Свойство UsingPartialContent позволяет определить, использует ли данный элемент только часть содержимого листа/модели, представленного элементом.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.UnderlayItem, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!