Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.RevolveOptions.Clone
 Послать отзыв
 Метод предназначен для клонирования текущих настроек операции вращения.
 Синтаксис
C#
Visual Basic
Копировать Код
public Object Clone();
Копировать Код
Public Function Clone() As Object
 Возвращает
 Возвращает объект, являющийся клоном текущих настроек операции вращения. Тип Object.
 Описание
 Метод предназначен для клонирования текущих настроек операции вращения.
 Ссылки
 Teigha.DatabaseServices.RevolveOptions, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!