Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector2dCollection.Vector2dCollection
 Послать отзыв
 Конструктор класса Vector2dCollection. Создает новую коллекцию, заполненную объектами Vector2d из указанного массива.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector2dCollection( ref Vector2d[] values );
Копировать Код
Public Sub New( ByRef values() As Vector2d )
 Параметры
 Параметры
 Описание
 values
 Входной массив. Тип Vector2d[].
 Описание
 Конструктор класса Vector2dCollection. Создает новую коллекцию, заполненную объектами Vector2d из указанного массива values.
 Ссылки
 Teigha.Geometry.Vector2dCollection, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!