Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector3d.GetAngleTo
 Послать отзыв
 Метод вычисляет угол в интервале [0, Pi] между данным вектором и входным вектором.
 Синтаксис
C#
Visual Basic
Копировать Код
public double GetAngleTo( Vector3d vector );
Копировать Код
Public Function GetAngleTo( vector As Vector3d ) As Double
 Параметры
 Параметры
 Описание
 vector
 Входной трехмерный вектор. Тип Vector3d.
 Возвращает
 Возвращает угол между двумя трехмерными векторами в интервале [0, Pi]. Тип double.
 Описание
 Метод вычисляет угол в интервале [0, Pi] между данным вектором и входным вектором.
 Ссылки
 Teigha.Geometry.Vector3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!