Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CubicSplineCurve2d
 Послать отзыв
 Класс CubicSplineCurve2d представляет интерполяционный кубический сплайн в двумерном пространстве.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Geometry::Entity2d Teigha::Geometry::Curve2d Teigha::Geometry::SplineEntity2d Teigha::Geometry::CubicSplineCurve2d
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdGeCubicSplineCurve2d")] public sealed class CubicSplineCurve2d : SplineEntity2d
Копировать Код
<Wrapper("OdGeCubicSplineCurve2d")> Public NotInheritable Class CubicSplineCurve2d Inherits SplineEntity2d
 Описание
 Класс CubicSplineCurve2d представляет интерполяционный кубический сплайн в двумерном пространстве.
 Методы
 Конструкторы
 Teigha.Geometry.CubicSplineCurve2d
 Имя
 Описание
 CubicSplineCurve2d
 Это обзор перегрузок CubicSplineCurve2d.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Geometry.Entity2d
 Имя
 Описание
 Entity2d Методы
 Ниже перечислены методы класса Entity2d.
 Teigha.Geometry.Curve2d
 Имя
 Описание
 Curve2d Методы
 Ниже перечислены методы класса Curve2d.
 Curve2d Свойства
 Ниже перечислены свойства класса Curve2d.
 Teigha.Geometry.SplineEntity2d
 Имя
 Описание
 SplineEntity2d Методы
 Ниже перечислены методы класса SplineEntity2d.
 SplineEntity2d Свойства
 Ниже перечислены свойства класса SplineEntity2d.
 Teigha.Geometry.CubicSplineCurve2d
 Имя
 Описание
 CubicSplineCurve2d Методы
 Ниже перечислены методы класса CubicSplineCurve2d.
 CubicSplineCurve2d Свойства
 Ниже перечислены свойства класса CubicSplineCurve2d.
 Ссылки
 CubicSplineCurve2d Конструктор, CubicSplineCurve2d Методы, CubicSplineCurve2d Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!