Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Helix.TopRadius
 Послать отзыв
 Свойство обеспечивает доступ к радиусу верхнего основания спирали.
 Синтаксис
C#
Visual Basic
Копировать Код
public double TopRadius;
Копировать Код
Public Property TopRadius As Double
 Возвращает
 Возвращает радиус верхнего основания спирали. Тип double.
 Описание
 Свойство обеспечивает доступ к радиусу верхнего основания спирали.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Helix, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!