Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Scale3d.IsEqualTo
 Послать отзыв
 Метод проверяет равенство данного объекта вектору масштабирования, переданному в аргументе, с использованием заданной точности.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsEqualTo( Scale3d scaleVector, Tolerance tolerance );
Копировать Код
Public Function IsEqualTo( scaleVector As Scale3d, tolerance As Tolerance ) As Boolean
 Параметры
 Параметры
 Описание
 scaleVector
 Входной вектор масштабирования, который сравнивается с данным объектом. Тип Scale3d.
 tolerance
 Заданная геометрическая точность. Тип Tolerance.
 Возвращает
 Возвращает true, если в пределах используемой точности данный объект можно считать равным вектору масштабирования scaleVector. В противном случае возвращает false.
 Описание
 Метод проверяет равенство данного объекта вектору масштабирования, переданному в аргументе, с использованием заданной точности.
 Два экземпляра структуры Scale3d считаются равными, если в пределах предписанной точности одновременно выполняются следующие условия:
Равны масштабные коэффициенты по оси X;
Равны масштабные коэффициенты по оси Y;
Равны масштабные коэффициенты по оси Z.
 Ссылки
 Teigha.Geometry.Scale3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!