Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DwgFiler.WriteBytes
 Послать отзыв
 Метод предназначен для записи заданного байтового массива в этот объект Filer.
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract void WriteBytes( ref unsigned char[] value );
Копировать Код
Public MustOverride Sub WriteBytes( ByRef value() As unsigned char )
 Параметры
 Параметры
 Описание
 value
 Записываемый в Filer массив. Тип unsigned char[].
 Описание
 Метод предназначен для записи заданного байтового массива value в этот объект Filer.
 Ссылки
 Teigha.DatabaseServices.DwgFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!