Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GridPropertyParameter
 Послать отзыв
 Эта структура представляет свойства линий сетки для объектов Table.
 Иерархия классов
Teigha::DatabaseServices::GridPropertyParameter
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdGridProperty")] public class GridPropertyParameter;
Копировать Код
<Wrapper("OdGridProperty")> Public Class GridPropertyParameter
 Описание
 Эта структура представляет свойства линий сетки для объектов Table.
 Топики
 Имя
 Описание
 GridPropertyParameter Данные
 Ниже перечислены данные класса GridPropertyParameter.
 Ссылки
 GridPropertyParameter Данные, Топики, GridPropertyParameter Данные
 Ваши комментарии по поводу этого топика: Послать отзыв!