Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocArrayPolarParameters.ArcDirection
 Послать отзыв
 Перечисление ArcDirection представляет направление дуги, от которого зависят элементы кругового массива.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum ArcDirection { Clockwise = 0, CounterClockwise = 1 }
Копировать Код
Public Enum ArcDirection Clockwise = 0 CounterClockwise = 1 End Enum
 Члены
 Члены
 Описание
 Clockwise
 Направление по часовой стрелке.
 CounterClockwise
 Направление против часовой стрелки.
 Ваши комментарии по поводу этого топика: Послать отзыв!