Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CellRange.IEnumerableGetEnumerator
 Послать отзыв
 Метод позволяет получить перечислитель для этого диапазона ячеек.
 Синтаксис
C#
Visual Basic
Копировать Код
public IEnumerator IEnumerableGetEnumerator();
Копировать Код
Public Function IEnumerableGetEnumerator() As IEnumerator Implements IEnumerable.GetEnumerator
 Возвращает
 Возвращает перечислитель для диапазона ячеек. Тип IEnumerator.
 Описание
 Метод позволяет получить перечислитель для этого диапазона ячеек.
 Ссылки
 Teigha.DatabaseServices.CellRange, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!