Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Surface.GetArea
 Послать отзыв
 Метод предназначен для вычисления общей площади данной поверхности.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual double GetArea();
Копировать Код
Public Overridable Function GetArea() As Double
 Возвращает
 Возвращает площадь одной стороны данной поверхности. Тип double.
 Описание
 Метод предназначен для вычисления общей площади данной поверхности. Метод вычисляет площадь одной стороны поверхности.
 Замечания
 Данный метод реализован только в среде пространственного моделирования Spatial Modeler.
 Ссылки
 Teigha.DatabaseServices.Surface, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!