Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.XrefGraph.GetXrefNode
 Послать отзыв
 Метод позволяет получить объект XrefGraphNode, соответствующий указанному идентификатору объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public XrefGraphNode GetXrefNode( DatabaseServices.ObjectId btrId );
Копировать Код
Public Function GetXrefNode( btrId As DatabaseServices.ObjectId ) As XrefGraphNode
 Параметры
 Параметры
 Описание
 btrId
 Идентификатор объекта записи BlockTableRecord. Тип DatabaseServices.ObjectId.
 Возвращает
 Возвращает объект XrefGraphNode, если узел найден, или null в противном случае.
 Описание
 Метод позволяет получить объект XrefGraphNode, соответствующий указанному идентификатору объекта.
 Ссылки
 Teigha.DatabaseServices.XrefGraph, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!