Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Field.FilingOption
 Послать отзыв
 Свойство FilingOption представляет опции сохранения этого поля в файле.
 Синтаксис
C#
Visual Basic
Копировать Код
public FieldFilingOptions FilingOption;
Копировать Код
Public Property FilingOption As FieldFilingOptions
 Возвращает
 Возвращает опции сохранения в файл. Тип FieldFilingOptions.
 Описание
 Свойство FilingOption представляет опции сохранения этого поля в файле.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Field, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!