Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Элемент данных LinkedTableEnumerator.iRow
 Послать отзыв
 This is iRow, a member of class LinkedTableEnumerator.
 Синтаксис
C#
Visual Basic
private int iRow;
Private iRow As Integer
 Ссылки
 LinkedTableEnumerator Класс, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!