Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.PointOnCurve3d.Create
 Послать отзыв
 Метод создает точку на кривой на основе переданного указателя.
 Синтаксис
C#
Visual Basic
Копировать Код
public PointOnCurve3d Create( IntPtr unmanagedPointer, bool autoDelete );
Копировать Код
Public Function Create( unmanagedPointer As IntPtr, autoDelete As Boolean ) As PointOnCurve3d
 Параметры
 Параметры
 Описание
 unmanagedPointer
 Входной неуправляемый указатель на исходный объект. Тип IntPtr.
 autoDelete
 Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.
 Возвращает
 Возвращает точку на кривой. Тип PointOnCurve3d.
 Описание
 Метод создает точку на кривой на основе переданного указателя.
 Ссылки
 Teigha.Geometry.PointOnCurve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!