Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Point3d.GetVectorTo
 Послать отзыв
 Метод строит вектор от данной точки до указанной.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d GetVectorTo( Point3d point );
Копировать Код
Public Function GetVectorTo( point As Point3d ) As Vector3d
 Параметры
 Параметры
 Описание
 point
 3D-точка, до которой требуется построить вектор. Тип Point3d.
 Возвращает
 Возвращает вектор, соединяющий данную точку с входной точкой point. Тип Vector3d.
 Описание
 Метод создает вектор, началом которого служит данная точка, а концом - входная точка point.
 Ссылки
 Teigha.Geometry.Point3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!