Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.NurbSurface.RemoveControlPointsAtU
 Послать отзыв
 Метод удаляет из массива управляющих вершин ряд точек с указанным индексом в направлении u.
 Синтаксис
C#
Visual Basic
Копировать Код
public void RemoveControlPointsAtU( int iUIndex );
Копировать Код
Public Sub RemoveControlPointsAtU( iUIndex As Integer )
 Параметры
 Параметры
 Описание
 iUIndex
 Исходный индекс в направлении u удаляемого ряда управляющих вершин. Тип int.
 Описание
 Метод удаляет из массива управляющих вершин ряд точек с указанным индексом в направлении u. Эта операция влияет на форму поверхности.
 Если поверхность не содержит никакой NURBS информации, метод генерирует исключение eFail. Если этот метод в конкретном моделере не реализован, выбрасывается исключение eNotImplementedYet.
 Ссылки
 Teigha.DatabaseServices.NurbSurface, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!