Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GripOverrule.GetStretchPoints
 Послать отзыв
 Метод предоставляет все ручки, позволяющие растягивать объект чертежа.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void GetStretchPoints( ref Entity entity, ref Point3dCollection stretchPoints );
Копировать Код
Public virtual Sub GetStretchPoints( ByRef entity As Entity, ByRef stretchPoints As Point3dCollection )
 Параметры
 Параметры
 Описание
 entity
 Объект, тип Entity,
 stretchPoints
 Коллекция Point3dCollection точек для ручек.
 Описание
 Метод предоставляет все ручки, позволяющие растягивать объект чертежа.
 Ссылки
 Teigha.DatabaseServices.GripOverrule, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!