Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Point2d.ToString
 Послать отзыв
 Метод позволяет получить эквивалентное строковое представление данного объекта в предписанном формате и с учетом заданных языковых и региональных настроек.
 Синтаксис
C#
Visual Basic
Копировать Код
public String ToString( ref String format, ref IFormatProvider provider );
Копировать Код
Public Function ToString( ByRef format As String, ByRef provider As IFormatProvider ) As String
 Параметры
 Параметры
 Описание
 format
 Формат строки. Тип String.
 provider
 Провайдер языковых и региональных настроек. Тип IFormatProvider.
 Возвращает
 Возвращает представление данного объекта в виде форматированной строки. Тип String.
 Описание
 Метод позволяет получить эквивалентное строковое представление данного объекта в предписанном формате format и с учетом языковых и региональных настроек, заданных провайдером provider.
 Ссылки
 Teigha.Geometry.Point2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!