Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 ViewTableRecord.IsUcsAssociatedToView
 Послать отзыв
 В свойстве хранится информация о том, связан ли именованный вид с пользовательской системой координат.
 Синтаксис
C#
Visual Basic
public bool IsUcsAssociatedToView;
Public Property IsUcsAssociatedToView() As bool
 Возвращает
 Возвращает тип данных bool:
true - именованный вид связан с пользовательской системой координат;
false - именованный вид не привязан к пользовательской системе координат.
 Описание
 При создании именованного вида возможно привязать этот вид к пользовательской системе координат. Пользовательская система координат создается пользователем и именованный вид привязывается к ней, если он создается в этой системе координат. С помощью свойства можно определить, есть ли у именованного вида привязка к сохраненной пользовательской системе координат. Когда именованный вид не привязан к пользовательской системе координат, значит он привязан к мировой системе координат.
 Условия
 Чтение и запись.
 Ссылки
 ViewTableRecord Класс, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!