Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.RadialDimensionLarge.ChordPoint
 Послать отзыв
 Свойство ChordPoint представляет точку пересечения размерной линии и измеряемой дуги или окружности.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d ChordPoint;
Копировать Код
Public Property ChordPoint As Point3d
 Возвращает
 Возвращает точку пересечения размерной линии и дуги / окружности. Тип Point3d.
 Описание
 Свойство ChordPoint представляет точку пересечения размерной линии и измеряемой дуги или окружности.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.RadialDimensionLarge, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!