Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Database.ReclaimMemoryFromErasedObjects
 Послать отзыв
 Синтаксис
C#
Visual Basic
public void ReclaimMemoryFromErasedObjects(ref ObjectIdCollection ids);
Public Sub ReclaimMemoryFromErasedObjects(ByRef ids As ObjectIdCollection)
 Параметры
 Параметры
 Описание
 ids
 Коллекция объектов Id, чья память должна быть освобождена с удалением объектов. Все id объектов должны относиться к очищенным объектам, которые ранее были закрыты
 Описание
 Метод удаляет объекты, Id которых входят в коллекцию ids.
 Объекты, id которых находятся в массиве ids, должны быть уже удалены, и они должны находиться в этой базе данных. Объекты, владельцами которых являются объекты из коллекции ids, будут удалены, если они еще не удалены, и их память также освобождается.
 Все удаленные объекты могут быть восстановлены по Undo и снова удалены по Redo.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!