Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GripOverrule.SetXDataFilter
 Послать отзыв
 Включает фильтрацию по расширенным данным (xdata) прежде чем применить переопределения.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetXDataFilter( ref String registeredApplicationName );
Копировать Код
Public Sub SetXDataFilter( ByRef registeredApplicationName As String )
 Параметры
 Параметры
 Описание
 registeredApplicationName
 Имя зарегистрированного приложения, тип String.
 Описание
 Включает фильтрацию по расширенным данным (xdata) прежде чем применить переопределения.
 Используйте этот метод, когда требуется, чтобы nanoCAD выполнял поиск xdata с RegisteredApplicationName в переопределяемом объекте перед вызовом любого из ваших переопределений.
 Ссылки
 Teigha.DatabaseServices.GripOverrule, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!