Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbCurve3d
 Послать отзыв
 Класс NurbCurve3d представляет неоднородные рациональные B-сплайны (NURBS) в трехмерном пространстве.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Geometry::Entity3d Teigha::Geometry::Curve3d Teigha::Geometry::SplineEntity3d Teigha::Geometry::NurbCurve3d
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdGeNurbCurve3d")] public sealed class NurbCurve3d : SplineEntity3d
Копировать Код
<Wrapper("OdGeNurbCurve3d")> Public NotInheritable Class NurbCurve3d Inherits SplineEntity3d
 Описание
 Класс NurbCurve3d представляет неоднородные рациональные B-сплайны (NURBS) в трехмерном пространстве.
 Методы
 Конструкторы
 Teigha.Geometry.NurbCurve3d
 Имя
 Описание
 NurbCurve3d
 Это обзор перегрузок NurbCurve3d.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Geometry.Entity3d
 Имя
 Описание
 Entity3d Методы
 Ниже перечислены методы класса Entity3d.
 Teigha.Geometry.Curve3d
 Имя
 Описание
 Curve3d Методы
 Ниже перечислены методы класса Curve3d.
 Curve3d Свойства
 Ниже перечислены свойства класса Curve3d.
 Teigha.Geometry.SplineEntity3d
 Имя
 Описание
 SplineEntity3d Методы
 Ниже перечислены методы класса SplineEntity3d.
 SplineEntity3d Свойства
 Ниже перечислены свойства класса SplineEntity3d.
 Teigha.Geometry.NurbCurve3d
 Имя
 Описание
 NurbCurve3d Методы
 Ниже перечислены методы класса NurbCurve3d.
 NurbCurve3d Свойства
 Ниже перечислены свойства класса NurbCurve3d.
 Ссылки
 NurbCurve3d Конструктор, NurbCurve3d Методы, NurbCurve3d Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!