Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Database.IsValidLineWeight
 Послать отзыв
 Синтаксис
C#
Visual Basic
public bool IsValidLineWeight(int weight);
Public Function IsValidLineWeight(weight As Integer) As bool
 Параметры
 Параметры
 Описание
 weight
 Значение ширины в сотых долях миллиметра
 Описание
 Возвращает true, если weight содержит значение, соответствующее одной из предопределенных ширин линий, иначе возвращает false.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!