Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GripDataCollection.Remove
 Послать отзыв
 Метод удаляет из коллекции элемент, соответствующий указанному объекту GripData.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool Remove( ref GripData gripData );
Копировать Код
Public Function Remove( ByRef gripData As GripData ) As Boolean
 Параметры
 Параметры
 Описание
 gripData
 Удаляемый из коллекции объект. Тип GripData.
 Возвращает
 Возвращает true, если удаление из коллекции объекта gripData завершилось успешно. В противном случае возвращает false.
 Описание
 Метод удаляет из коллекции элемент, соответствующий указанному объекту GripData.
 Ссылки
 Teigha.DatabaseServices.GripDataCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!