Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Entity.SetGripStatus(GripStatus)
 Послать отзыв
 Метод вызывается перед удалением объекта ручки (GripStatus) и связанных с ним точек, чтобы геометрический объект мог выполнить необходимые действия по управлению ресурсами.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetGripStatus(GripStatus status);
Копировать Код
Public Function SetGripStatus(status As GripStatus) As void
 Параметры
 Параметры
 Описание
 status
 Значение, описывающее статус операции переноса. Тип GripStatus
 Описание
 Это уведомление позволяет геометрическому объекту выполнить любые требуемые задания по управлению ресурсами, перед тем как объект ручки GripStatus и любые альтернативные базовые точки объекта, на которые указывает объект GripStatus, будут удалены.
 Ссылки
 Teigha.DatabaseServices.Entity, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!