Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.SummaryInfo
 Послать отзыв
 Синтаксис
C#
Visual Basic
public DatabaseSummaryInfo SummaryInfo;
Public Property SummaryInfo() As DatabaseSummaryInfo
 Описание
 Возвращает общую информацию о базе данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!