Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotStyleTable.AciTableAvailable
 Послать отзыв
 Свойство AciTableAvailable позволяет определить, доступна ли таблица индексированных цветов.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool AciTableAvailable;
Копировать Код
Public Property AciTableAvailable As Boolean
 Возвращает
 Возвращает true, если таблица индексированных цветов доступна. В противном случае возвращает false.
 Описание
 Свойство AciTableAvailable позволяет определить, доступна ли таблица индексированных цветов.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.PlotStyleTable, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!