Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FullSubentityPath
 Послать отзыв
 Этот класс реализует однозначную идентификацию подобъектов в базе данных.
 Иерархия классов
Teigha::DatabaseServices::FullSubentityPath
 Синтаксис
C#
Visual Basic
Копировать Код
[StructLayout(LayoutKind.Sequential), Wrapper("OdDbFullSubentPath")] public class FullSubentityPath;
Копировать Код
<StructLayout(LayoutKind.Sequential), Wrapper("OdDbFullSubentPath")> Public Class FullSubentityPath
 Описание
 Этот класс реализует однозначную идентификацию подобъектов в базе данных. Каждый экземпляр этого класса включает объект SubentId и упорядоченный массив идентификаторов объектов. SubentId включает индекс и тип подобъекта subentType. Массив идентификаторов объектов определяет путь к объекту, содержащему указанный подобъект, начиная с самого внешнего объекта (в пространствах PaperSpace или ModelSpace).
 Методы
 Конструкторы
 Имя
 Описание
 FullSubentityPath
 Конструктор класса FullSubentityPath. Инициализирует встроенную коллекцию идентификаторов ObjectIdCollection и индекс встроенного подобъекта SubentityId.
 Топики
 Имя
 Описание
 FullSubentityPath Методы
 Ниже перечислены методы класса FullSubentityPath.
 FullSubentityPath Операторы
 Ниже перечислены операторы класса FullSubentityPath.
 FullSubentityPath Свойства
 Ниже перечислены свойства класса FullSubentityPath.
 Ссылки
 FullSubentityPath Методы, FullSubentityPath Операторы, FullSubentityPath Свойства, Методы, Топики, FullSubentityPath Методы, FullSubentityPath Операторы, FullSubentityPath Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!