Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 LayerTableRecord.HasOverrides
 Послать отзыв
 В свойстве хранится информация о переопределениях слоя в видовых экранах пространства листа.
 Синтаксис
C#
Visual Basic
public bool HasOverrides;
Public Property HasOverrides() As bool
 Возвращает
 Возвращает тип данных bool:
true – слой имеет переопределения;
false – у слоя нет переопределений.
 Описание
 В свойстве хранится информация о том, имеет ли слой переопределения в видовых экранах пространства листа. Переопределения слоя можно создавать для разных видовых экранов в пространстве листа, изменяя в одном экране цвет, тип линии, вес линии или прозрачность слоя. При этом в других видовых экранах пространства листа эти свойства слоя не изменятся.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.LayerTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!