Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Field.GetFieldCode
 Послать отзыв
 Метод предназначен для извлечения кода поля в виде текстовой строки.
 Синтаксис
C#
Visual Basic
Копировать Код
public String GetFieldCode();
Копировать Код
Public Function GetFieldCode() As String
 Возвращает
 Возвращает текстовую строку с кодом поля. Тип String.
 Описание
 Метод предназначен для извлечения кода поля в виде текстовой строки.
 Ссылки
 Teigha.DatabaseServices.Field, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!