Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.LinearEntity3d.IsPerpendicularTo
 Послать отзыв
 Метод позволяет проверить перпендикулярность данного объекта и указанной плоскости.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsPerpendicularTo( ref PlanarEntity plane );
Копировать Код
Public Function IsPerpendicularTo( ByRef plane As PlanarEntity ) As Boolean
 Параметры
 Параметры
 Описание
 plane
 Входная плоскость. Тип PlanarEntity.
 Возвращает
 Возвращает true, если данный объект перпендикулярен указанной плоскости. В противном случае возвращает false.
 Описание
 Метод позволяет проверить перпендикулярность данного объекта и указанной плоскости. Используется вызов метода LinearEntity3d.IsPerpendicularTo(PlanarEntity plane, Tolerance tolerance) с точностью, равной Tolerance.Global.
 Ссылки
 Teigha.Geometry.LinearEntity3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!