Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Hatch.SetGradientColors
 Послать отзыв
 Синтаксис
C#
Visual Basic
public void SetGradientColors(ref array<GradientColor> value);
Public Sub SetGradientColors(ByRef value As array<GradientColor>)
 Параметры
 Параметры
 Описание
 value
 Массив действительных чисел, представляющих интерполяцию значений, определяющих градиент
 Описание
 Метод предоставляет механизм для определения цветов, который должен быть применен к градиента. В простейшем случае, определение содержит начальный и конечный цвета. Начальный цвет относится к colors[0], а конечный — к colors[count-1]. Текущая реализация поддерживает не более двух цветов. Объект Hatch создает копию переданного в качестве параметра массива.
 Ссылки
 Teigha.DatabaseServices.Hatch, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!