Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 DimStyleTableRecord.Dimblk
 Послать отзыв
 Свойство связано с Dimblks и хранит в себе настройку вида окончаний размерных линий.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectId Dimblk { get; set; }
Копировать Код
Public Property Dimblk As ObjectId
 Возвращает
 Возвращает тип данных ObjectId.
 Описание
 В свойстве хранится текущая настройка внешнего вида окончаний размерной линии.
 Каждый вид окончания является блоком и в чертеже хранится, как тип данных BlockTableRecord в таблице блоков BlockTable.
 Коллекция блоков - окончаний размерных линий хранится в шаблоне чертежа и через API недоступна. Отдельные блоки из этой коллекции появляются в таблице блоков чертежа после того, как к ним обратились через свойство Dimblks/Dimblk1s/Dimblk2s или через пользовательский интерфейс:
  При изменении системной переменной DIMBLK будет создан новый размерный стиль под названием <переопределение> на основе текущего с новым значением DIMBLK.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.DimStyleTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!