Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObject.IsEraseStatusToggled
 Послать отзыв
 Свойство предоставляет информацию, был ли переключен бит очистки объекта с момента его открытия.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsEraseStatusToggled;
Копировать Код
Public Property IsEraseStatusToggled() As bool
 Возвращает
 Возвращает тип данных bool. Возвращает true, если бит очистки объекта был переключен с момента его открытия.
 Описание
 Свойство предоставляет информацию, был ли переключен бит очистки объекта с момента его открытия.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.DBObject, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!