Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Trace.Normal
 Послать отзыв
 Свойство Normal представляет нормаль плоскости, в которой располагается данная полоса.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d Normal;
Копировать Код
Public Property Normal As Vector3d
 Возвращает
 Возвращает единичный вектор в координатах WCS, который представляет нормаль плоскости полосы. Тип Vector3d.
 Описание
 Свойство Normal представляет нормаль плоскости, в которой располагается данная полоса.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Trace, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!