Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GradientColor.get_Value
 Послать отзыв
 Метод предоставляет интерполированное значение данного цвета в градиенте.
 Синтаксис
C#
Visual Basic
Копировать Код
public float get_Value();
Копировать Код
Public Function get_Value() As Single
 Возвращает
 Возвращает интерполированное значение данного цвета. Тип float.
 Описание
 Метод предоставляет интерполированное значение данного цвета в градиенте.
 Ссылки
 Teigha.DatabaseServices.GradientColor, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!