Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.TransactionManager.StartOpenCloseTransaction
 Послать отзыв
 Этот метод создает должным образом инициализированный объект OpenCloseTransaction.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual OpenCloseTransaction StartOpenCloseTransaction();
Копировать Код
Public virtual Function StartOpenCloseTransaction() As OpenCloseTransaction
 Возвращает
 Возвращает созданный объект OpenCloseTransaction.
 Описание
 Этот метод создает должным образом инициализированный объект OpenCloseTransaction.
 Ссылки
 Teigha.DatabaseServices.TransactionManager, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!