Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SymbolUtilityServices.LinetypeByBlockName
 Послать отзыв
 Свойство LinetypeByBlockName представляет предопределенную запись символа для имени типа линий "ByBlock".
 Синтаксис
C#
Visual Basic
Копировать Код
public static String LinetypeByBlockName;
Копировать Код
Public Shared ReadOnly Property LinetypeByBlockName As String
 Возвращает
 Возвращает предопределенное имя типа линий "ByBlock". Тип String.
 Описание
 Свойство LinetypeByBlockName представляет предопределенную запись символа для имени типа линий "ByBlock". Не может быть ни NULL, ни пустой строкой.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.SymbolUtilityServices, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!