Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Extmin
 Послать отзыв
 Синтаксис
C#
Visual Basic
public Point3d Extmin;
Public Property Extmin() As Point3d
 Описание
 Возвращает или устанавливает текущее значение EXTMIN пространства модели базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!