Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.LinearEntity3d.IntersectWith
 Послать отзыв
 Метод определяет точку пересечения данного объекта с другим линейным объектом.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d[] IntersectWith( ref LinearEntity3d line );
Копировать Код
Public Function IntersectWith( ByRef line As LinearEntity3d ) As Point3d()
 Параметры
 Параметры
 Описание
 line
 Проверяемый линейный объект. Тип LinearEntity3d.
 Возвращает
 Возвращает массив из одного элемента с точкой пересечения. Тип Point3d[].
 Описание
 Метод определяет, пересекается ли данный объект с указанным линейным объектом, и если да, возвращает точку их пересечения. Используется вызов метода LinearEntity3d.IntersectWith(LinearEntity3d line, Tolerance tolerance) с точностью, равной Tolerance.Global.
 Ссылки
 Teigha.Geometry.LinearEntity3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!