Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.GetColumnName
 Послать отзыв
 Метод предназначен для получения имени столбца, заданного его индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual String GetColumnName( int index );
Копировать Код
Public virtual Function GetColumnName( index As Integer ) As String
 Параметры
 Параметры
 Описание
 index
 Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
 Возвращает
 Возвращает имя столбца, тип String.
 Описание
 Метод предназначен для получения имени столбца, заданного его индексом. Имя столбца является опциональным, поэтому метод может вернуть пустую строку.
 Замечания
 Для получения того же результата предпочтительнее использовать свойство Table.Columns[i].Name.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!