Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.RadialDimension.Center
 Послать отзыв
 Свойство Center представляет трехмерные координаты (WCS) центра измеряемой дуги или окружности.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d Center;
Копировать Код
Public Property Center As Point3d
 Возвращает
 Возвращает центр дуги или окружности в мировой системе координат (WCS). Тип Point3d.
 Описание
 Свойство Center представляет трехмерные координаты (WCS) центра измеряемой дуги или окружности.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.RadialDimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!