Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.TypedValue.==
 Послать отзыв
 Оператор предназначен для определения равенства двух заданных типизированных значений.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool operator ==( TypedValue a, TypedValue b );
Копировать Код
Public Operator ==( a As TypedValue, b As TypedValue )
 Параметры
 Параметры
 Описание
 a
 Левый операнд, тип TypedValue.
 b
 Правый операнд, тип TypedValue.
 Возвращает
 Возвращает true, если операнды a и b равны, иначе - false.
 Описание
 Оператор предназначен для определения равенства двух заданных типизированных значений.
 Ссылки
 Teigha.DatabaseServices.TypedValue, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!