Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод LinetypeTableRecord.ShapeOffsetAt
 Послать отзыв
 Синтаксис
C#
Visual Basic
public Vector2d ShapeOffsetAt(int index);
Public Function ShapeOffsetAt(index As Integer) As Vector2d
 Параметры
 Параметры
 Описание
 index
 Индекс (начинающийся с 0) строки, для которой производится определение смещения
 Описание
 Этот метод возвращает объект Vector2d, координаты X и Y которого представляют значения смещения X и Y для формы (или текстовой строки) из строки LinetypeTableRecord со значением индекса index. Если в строке не используется форма, значения X и Y возвращаемого вектора равны 0.0.
 Ссылки
 Teigha.DatabaseServices.LinetypeTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!