Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LayerStateManager.AbortLayerStateDelete
 Послать отзыв
 Это событие создается, если прерван процесс удаления состояния слоя.
 Синтаксис
C#
Visual Basic
Копировать Код
public event LayerStateEventHandler AbortLayerStateDelete;
Копировать Код
Public Event AbortLayerStateDelete As LayerStateEventHandler
 Описание
 Это событие создается, если прерван процесс удаления состояния слоя.
 Ссылки
 Teigha.DatabaseServices.LayerStateManager, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!