Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.IsEmr
 Послать отзыв
 Синтаксис
C#
Visual Basic
public bool IsEmr;
Public Property IsEmr() As bool
 Описание
 Всегда возвращает false.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!