Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CircularArc2d.IsInside
 Послать отзыв
 Метод позволяет проверить с заданной точностью, находится ли указанная точка в пределах полной окружности данной дуги.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsInside( Point2d point, Tolerance tolerance );
Копировать Код
Public Function IsInside( point As Point2d, tolerance As Tolerance ) As Boolean
 Параметры
 Параметры
 Описание
 point
 Проверяемая 2D-точка. Тип Point2d.
 tolerance
 Заданная точность вычислений. Тип Tolerance.
 Возвращает
 Возвращает true, если точка point располагается в пределах полной окружности данной дуги с точностью tolerance. В противном случае возвращает false.
 Описание
 Метод позволяет проверить с заданной точностью tolerance, находится ли указанная точка point в пределах полной окружности данной дуги.
 Ссылки
 Teigha.Geometry.CircularArc2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!