Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Extents3d.Equals
 Послать отзыв
 Метод предназначен для проверки данного объекта на равенство другому объекту Extents3d.
 Синтаксис
C#
Visual Basic
Копировать Код
public sealed override bool Equals( ref Object obj );
Копировать Код
Public NotOverridable Overrides Function Equals( ByRef obj As Object ) As Boolean
 Параметры
 Параметры
 Описание
 obj
 Объект, проверяемый на равенство. Тип Object.
 Возвращает
 Возвращает true, если объект obj не является нулевым, и совпадают соответствующие координаты вершин сравниваемых объектов. В противном случае возвращает false.
 Описание
 Метод предназначен для проверки данного объекта на равенство другому объекту Extents3d.
 Замечания
 Переопределение методов Equals и GetHashCode должно выполняться совместно, чтобы не нарушать логику - если Equals возвращает true, хеш-коды сравниваемых объектов должны совпадать. Обратное не гарантируется - совпадение хеш-кодов не всегда означает совпадение объектов вследствие возможных коллизий. Хеш-коды следует формировать для полей, на которых основано равенство. Иногда используется метод Equals() из объекта C++, но поскольку сравниваются указатели, вы по-прежнему можете использовать Extents3d.GetHashCode(), в то время как метод Equals() может быть переопределен в производном классе.
 Ссылки
 Teigha.DatabaseServices.Extents3d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!