Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DataLink.DataLink
 Послать отзыв
 Конструктор класса.
 Синтаксис
C#
Visual Basic
Копировать Код
public DataLink( IntPtr unmanagedObjPtr, bool autoDelete );
Копировать Код
Public Sub New( unmanagedObjPtr As IntPtr, autoDelete As Boolean )
 Параметры
 Параметры
 Описание
 unmanagedObjPtr
 Неуправляемый указатель на входной объект. Тип IntPtr.
 autoDelete
 Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.
 Описание
 Конструктор класса.
 Ссылки
 Teigha.DatabaseServices.DataLink, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!