Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.EdgeRef.FaceSubentity
 Послать отзыв
 Свойство FaceSubentity обеспечивает доступ к идентификатору подобъекта-грани составного объекта, использованной для создания данной ссылки на ребро.
 Синтаксис
C#
Visual Basic
Копировать Код
public SubentityId FaceSubentity;
Копировать Код
Public Property FaceSubentity As SubentityId
 Возвращает
 Возвращает идентификатор подобъекта. Тип SubentityId.
 Описание
 Свойство FaceSubentity обеспечивает доступ к идентификатору подобъекта-грани составного объекта, использованной для создания данной ссылки на ребро.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.EdgeRef, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!