Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Point2d.IsEqualTo
 Послать отзыв
 Метод проверяет совпадение 2D-точек.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsEqualTo( Point2d a );
Копировать Код
Public Function IsEqualTo( a As Point2d ) As Boolean
 Параметры
 Параметры
 Описание
 a
 Точка, с которой проверяется совпадение. Тип Point2d.
 Возвращает
 Возвращает true, если точки совпадают; в противном случае возвращает false.
 Описание
 Метод позволяет проверить, что указанная точка a совпадает с данной точкой. Реализация метода использует вызов Point2d.IsEqualTo(Point2d a, Tolerance tolerance) с допуском, равным Tolerance.Global.
 Ссылки
 Teigha.Geometry.Point2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!