Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DynamicBlockReferencePropertyCollection.CopyTo
 Послать отзыв
 Метод предназначен для копирования данной коллекции в указанный массив по указанному индексу.
 Синтаксис
C#
Visual Basic
Копировать Код
public void CopyTo( ref DynamicBlockReferenceProperty[] a, int index );
Копировать Код
Public Sub CopyTo( ByRef a() As DynamicBlockReferenceProperty, index As Integer )
 Параметры
 Параметры
 Описание
 a
 Массив, в который копируется коллекция. Тип DynamicBlockReferenceProperty[].
 index
 Индекс, начиная с которого в массиве сохраняется коллекция. Тип int.
 Описание
 Метод предназначен для копирования данной коллекции в указанный массив по указанному индексу.
 Ссылки
 Teigha.DatabaseServices.DynamicBlockReferencePropertyCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!