Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector3dCollection.Vector3dCollection
 Послать отзыв
 Конструктор класса Vector3dCollection. Создает новую коллекцию, заполненную объектами Vector3d из указанного массива.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3dCollection( ref Vector3d[] values );
Копировать Код
Public Sub New( ByRef values() As Vector3d )
 Параметры
 Параметры
 Описание
 values
 Входной массив трехмерных векторов. Тип Vector3d[].
 Описание
 Конструктор класса Vector3dCollection. Создает новую коллекцию, заполненную объектами Vector3d из указанного массива values.
 Ссылки
 Teigha.Geometry.Vector3dCollection, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!