Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocAction.ActionBody
 Послать отзыв
 Свойство позволяет получить или задать ObjectId тела данного действия.
 Синтаксис
C#
Visual Basic
Копировать Код
public Teigha.DatabaseServices.ObjectId ActionBody;
Копировать Код
Public Property ActionBody() As Teigha.DatabaseServices.ObjectId
 Возвращает
 Возвращает идентификатор тела ассоциативного действия. Тип Teigha.DatabaseServices.ObjectId
 Описание
 Свойство позволяет получить или задать ObjectId объекта класса, производного от AssocActionBody, или значение null, если объект тела действия не задан. Объект AssocActionBody принадлежит данному объекту AssocAction и реализует тело пользовательского действия. Дополнительную информацию см. в описании класса AssocActionBody.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.AssocAction, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!