Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.NurbSurface.InsertControlPointsAtU
 Послать отзыв
 Метод позволяет вставить строку управляющих вершин для заданного значения параметра u узла.
 Синтаксис
C#
Visual Basic
Копировать Код
public void InsertControlPointsAtU( double dU, ref Point3dCollection vCtrlPts, ref DoubleCollection vWeights );
Копировать Код
Public Sub InsertControlPointsAtU( dU As Double, ByRef vCtrlPts As Point3dCollection, ByRef vWeights As DoubleCollection )
 Параметры
 Параметры
 Описание
 dU
 Входное значение параметра U. Тип double.
 vCtrlPts
 Входной массив добавляемых управляющих вершин. Тип Point3dCollection.
 vWeights
 Входной массив добавляемых весов, если поверхность является рациональной. Тип DoubleCollection.
 Описание
 Метод позволяет вставить строку управляющих вершин для заданного значения параметра u узла.
 Если поверхность не содержит никакой информации NURBS, метод выбрасывает исключение eFail. Если входное значение параметра dU выходит за пределы допустимого диапазона, выбрасывается исключение eOutOfRange.
 Ссылки
 Teigha.DatabaseServices.NurbSurface, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!