Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DataLinkManager.GetDataLink
 Послать отзыв
 Метод позволяет получить коллекцию идентификаторов ObjectId внешних ссылок.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectIdCollection GetDataLink();
Копировать Код
Public Function GetDataLink() As ObjectIdCollection
 Возвращает
 Возвращает коллекцию внешних ссылок. Тип ObjectIdCollection.
 Описание
 Метод позволяет получить коллекцию идентификаторов ObjectId внешних ссылок.
 Ссылки
 Teigha.DatabaseServices.DataLinkManager, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!