Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод DBText.getTextWithFieldCodes
 Послать отзыв
 This is getTextWithFieldCodes, a member of class DBText.
 Синтаксис
C#
Visual Basic
public String getTextWithFieldCodes();
Public Function getTextWithFieldCodes() As String
 Ссылки
 Teigha.DatabaseServices.DBText, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!