Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DimArrowFlag
 Послать отзыв
 Перечисление DimArrowFlag определяет флаги стрелок на концах размерной линии.
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("DimArrowFlags")] public enum DimArrowFlag { FirstArrow = 0, SecondArrow = 1 }
Копировать Код
<Wrapper("DimArrowFlags")> Public Enum DimArrowFlag FirstArrow = 0 SecondArrow = 1 End Enum
 Члены
 Члены
 Описание
 FirstArrow
 Значение: 0. Стрелка на первом конце размерной линии.
 SecondArrow
 Значение: 1. Стрелка на втором конце размерной линии.
 Описание
 Перечисление DimArrowFlag определяет флаги стрелок на концах размерной линии.
 Ваши комментарии по поводу этого топика: Послать отзыв!