Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotSettingsValidator.SetCustomPrintScale
 Послать отзыв
 Метод позволяет задать для указанного объекта PlotSettings пользовательский масштаб печати.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetCustomPrintScale( ref PlotSettings plotSet, CustomScale scale );
Копировать Код
Public Sub SetCustomPrintScale( ByRef plotSet As PlotSettings, scale As CustomScale )
 Параметры
 Параметры
 Описание
 plotSet
 Входной объект PlotSettings с настройками печати.
 scale
 Пользовательский масштаб. Тип CustomScale.
 Описание
 Метод позволяет задать для указанного объекта PlotSettings пользовательский масштаб печати.
 Пользовательский масштаб определяет отношение единиц листа к единицам носителя и всегда отражает масштаб, который будет использоваться при выводе на печать.
 Ссылки
 Teigha.DatabaseServices.PlotSettingsValidator, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!