Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObject.IsWriteEnabled
 Послать отзыв
 Свойство предоставляет информацию о статусе объекта: открыт ли он на запись и посылает ли уведомления.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsWriteEnabled;
Копировать Код
Public Property IsWriteEnabled() As bool
 Возвращает
 Тип данных bool. Возвращает true, если объект в данный момент доступен на запись и в данный момент не посылает уведомления.
 Описание
 Свойство предоставляет информацию о статусе открытия объекта и отправки им уведомлений.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.DBObject, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!