Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocArrayPolarParameters.RotateItems
 Послать отзыв
 Свойство обеспечивает доступ к флагу, который определяет, поворачиваются ли элементы при построении массива.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool RotateItems;
Копировать Код
Public Property RotateItems() As Boolean
 Возвращает
 Возвращает true, если элементы поворачиваются. В противном случае возвращает false.
 Описание
 Свойство обеспечивает доступ к флагу, который определяет, поворачиваются ли элементы при построении массива.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.AssocArrayPolarParameters, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!