Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LeaderType
 Послать отзыв
 Данное перечисление определяет типы линий выноски.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum LeaderType { InVisibleLeader = 0, SplineLeader = 2, StraightLeader = 1 }
Копировать Код
Public Enum LeaderType InVisibleLeader = 0 SplineLeader = 2 StraightLeader = 1 End Enum
 Члены
 Члены
 Описание
 InVisibleLeader
 Значение: 0. Невидимая линия выноски.
 StraightLeader
 Значение: 1. Прямая линия.
 SplineLeader
 Значение: 2. Линия-сплайн.
 Описание
 Данное перечисление определяет типы линий выноски.
 Ваши комментарии по поводу этого топика: Послать отзыв!