Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SubDMesh.ComputeSurfaceArea
 Послать отзыв
 Метод предназначен для вычисления текущей площади сети.
 Синтаксис
C#
Visual Basic
Копировать Код
public double ComputeSurfaceArea();
Копировать Код
Public Function ComputeSurfaceArea() As double
 Возвращает
 Возвращает площадь сети, тип double.
 Описание
 Метод предназначен для вычисления текущей площади сети.
 Ссылки
 Teigha.DatabaseServices.SubDMesh, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!