Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ObjectId.Database
 Послать отзыв
 Свойство предоставляет доступ к базе данных, в которой ID объекта является резидентным. Если идентификатор объекта равен NULL, то свойство возвращает NULL.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.Database Database;
Копировать Код
Public Property Database() As DatabaseServices.Database
 Возвращает
 Возвращает объект типа Teigha.DatabaseServices.Database.
 Описание
 Предоставляет доступ к базе данных, в которой ID объекта является резидентным. Если идентификатор объекта равен NULL, то свойство возвращает NULL.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.ObjectId, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!