Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FieldEvaluationResult.Evaluated
 Послать отзыв
 Свойство Evaluated возвращает количество вычисленных полей.
 Синтаксис
C#
Visual Basic
Копировать Код
public int Evaluated;
Копировать Код
Public ReadOnly Property Evaluated As Integer
 Возвращает
 Возвращает количество вычисленных полей. Тип int.
 Описание
 Свойство Evaluated возвращает количество вычисленных полей.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.FieldEvaluationResult, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!