Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор AssocArrayParameters.AssocArrayParameters
 Послать отзыв
 This is AssocArrayParameters, a member of class AssocArrayParameters.
 Синтаксис
C#
Visual Basic
internal AssocArrayParameters(IntPtr unmanagedPointer, bool autoDelete);
Friend Sub New(unmanagedPointer As IntPtr, autoDelete As bool)
 Ссылки
 Teigha.DatabaseServices.AssocArrayParameters, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!