Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Material.NormalMap
 Послать отзыв
 Свойство представляет компонент NormalMap этого материала.
 Синтаксис
C#
Visual Basic
Копировать Код
public MaterialNormalMapComponent NormalMap;
Копировать Код
Public Property NormalMap As MaterialNormalMapComponent
 Возвращает
 Возвращает компонент NormalMap материала. Тип MaterialNormalMapComponent.
 Описание
 Свойство представляет компонент NormalMap этого материала.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Material, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!