Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Group.SetAnonymous
 Послать отзыв
 Этот метод позволяет сделать данную группу анонимной. При этом текущее имя группы заменяется на автоматически созданное имя анонимной группы.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetAnonymous();
Копировать Код
Public Sub SetAnonymous()
 Описание
 Этот метод позволяет сделать данную группу анонимной. При этом текущее имя группы заменяется на автоматически созданное имя анонимной группы.
 Ссылки
 Teigha.DatabaseServices.Group, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!