Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.InsertRows
 Послать отзыв
 Метод позволяет вставить одну или несколько строк по указанному индексу.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void InsertRows( int row, double height, int rows );
Копировать Код
Public virtual Sub InsertRows( row As Integer, height As double, rows As Integer )
 Параметры
 Параметры
 Описание
 row
 Индекс строки, задающий место вставки, тип int. Должен быть больше или равен нулю и меньше количества строк в таблице.
 height
 Высота вставляемых строк, тип double.
 rows
 Количество вставляемых строк, тип int.
 Описание
 Метод позволяет вставить одну или несколько строк по указанному индексу.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!