Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CurveCurveIntersector2d.CurveCurveIntersector2d
 Послать отзыв
 Конструктор класса CurveCurveIntersector2d. Создает объект для вычисления с заданной точностью пересечений фрагментов указанных кривых, которые определены заданными параметрическими интервалами.
 Синтаксис
C#
Visual Basic
Копировать Код
public CurveCurveIntersector2d( ref Curve2d curve1, ref Curve2d curve2, ref Interval range1, ref Interval range2, Geometry.Tolerance tolerance );
Копировать Код
Public Sub New( ByRef curve1 As Curve2d, ByRef curve2 As Curve2d, ByRef range1 As Interval, ByRef range2 As Interval, tolerance As Geometry.Tolerance )
 Параметры
 Параметры
 Описание
 curve1
 Первая входная кривая. Тип Curve2d.
 curve2
 Вторая входная кривая. Тип Curve2d.
 range1
 Параметрический интервал для первой кривой. Тип Interval.
 range2
 Параметрический интервал для второй кривой. Тип Interval.
 tolerance
 Входное значение геометрической точности. Тип Geometry.Tolerance.
 Описание
 Конструктор класса CurveCurveIntersector2d. Создает объект для вычисления пересечений фрагментов указанных кривых, которые определены заданными параметрическими интервалами. Используется указанная геометрическая точность.
 Ссылки
 Teigha.Geometry.CurveCurveIntersector2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!