Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SectionSettings.Reset
 Послать отзыв
 Метод сбрасывает к значениям по умолчанию все настройки для указанного типа сечения.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Reset( SectionType nSecType );
Копировать Код
Public Sub Reset( nSecType As SectionType )
 Параметры
 Параметры
 Описание
 nSecType
 Тип сечения. Перечисление SectionType.
 Описание
 Метод сбрасывает к значениям по умолчанию все настройки для указанного типа сечения.
 Ссылки
 Teigha.DatabaseServices.SectionSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!