Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Matrix3d.PreMultiplyBy
 Послать отзыв
 Метод выполняет матричное умножение заданной матрицы на данную матрицу.
 Синтаксис
C#
Visual Basic
Копировать Код
public Matrix3d PreMultiplyBy( Matrix3d leftSide );
Копировать Код
Public Function PreMultiplyBy( leftSide As Matrix3d ) As Matrix3d
 Параметры
 Параметры
 Описание
 leftSide
 Матрица, которая выступает в матричном произведении левым сомножителем. Тип Matrix3d.
 Возвращает
 Возвращает результирующую матрицу. Тип Matrix3d.
 Описание
 Метод выполняет матричное умножение заданной матрицы leftSide на данную матрицу и возвращает результирующую матрицу.
 Ссылки
 Teigha.Geometry.Matrix3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!