Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObject.Copied
 Послать отзыв
 Событие возникает, когда для объекта был вызван метод копирования/клонирования.
 Синтаксис
C#
Visual Basic
Копировать Код
public event ObjectEventHandler Copied;
Копировать Код
Public Event Copied As ObjectEventHandler
 Возвращает
 Тип данных ObjectEventHandler, представляющий обработчик события.
 Описание
 Событие возникает, когда для объекта был вызван метод копирования/клонирования.
 Ссылки
 Teigha.DatabaseServices.DBObject, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!