Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Qtextmode
 Послать отзыв
 Синтаксис
C#
Visual Basic
public bool Qtextmode;
Public Property Qtextmode() As bool
 Описание
 Возвращает текущее значение QTEXTMODE для базы данных. Значение false соответствует 0. Значение true — 1.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!