Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Entity3d
 Послать отзыв
 Класс Entity3d служит базовым классом для всех трехмерных геометрических объектов.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Geometry::Entity3d
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdGeEntity3d")] public abstract class Entity3d : DisposableWrapper, ICloneable
Копировать Код
<Wrapper("OdGeEntity3d")> Public MustInherit Class Entity3d Inherits DisposableWrapper Implements ICloneable
 Описание
 Класс Entity3d служит базовым классом для всех трехмерных геометрических объектов.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Geometry.Entity3d
 Имя
 Описание
 Entity3d Методы
 Ниже перечислены методы класса Entity3d.
 Ссылки
 Entity3d Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!