Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocArrayPolarParameters.ItemCount
 Послать отзыв
 Свойство обеспечивает доступ к количеству элементов кругового массива.
 Синтаксис
C#
Visual Basic
Копировать Код
public int ItemCount;
Копировать Код
Public Property ItemCount() As Integer
 Возвращает
 Возвращает количество элементов кругового массива. Тип int.
 Описание
 Свойство обеспечивает доступ к количеству элементов кругового массива.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.AssocArrayPolarParameters, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!