Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор Circle.Circle ()
 Послать отзыв
 Синтаксис
C#
Visual Basic
public Circle();
Public Sub New()
 Описание
 Конструктор по умолчанию.
 Ссылки
 Teigha.DatabaseServices.Circle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!