Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Section.TopPlane
 Послать отзыв
 Свойство TopPlane представляет высоту индикатора секущей плоскости выше линии сечения.
 Синтаксис
C#
Visual Basic
Копировать Код
public double TopPlane;
Копировать Код
Public Property TopPlane As Double
 Возвращает
 Возвращает указанную высоту индикатора секущей плоскости. Тип double.
 Описание
 Свойство TopPlane представляет высоту индикатора секущей плоскости выше линии сечения.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Section, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!