Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DataTable.GetColumnIndexAtName
 Послать отзыв
 Метод позволяет определить индекс столбца с указанным именем.
 Синтаксис
C#
Visual Basic
Копировать Код
public int GetColumnIndexAtName( ref String name );
Копировать Код
Public Function GetColumnIndexAtName( ByRef name As String ) As Integer
 Параметры
 Параметры
 Описание
 name
 Имя искомого столбца. Тип String.
 Возвращает
 Возвращает индекс найденного столбца. Тип int. Если столбец с указанным именем в таблице отсутствует, возвращает 0.
 Описание
 Метод позволяет определить индекс столбца с указанным именем.
 Ссылки
 Teigha.DatabaseServices.DataTable, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!