Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 DimStyleTableRecord.Dimtvp
 Послать отзыв
 Свойство отвечает за настройку расстояния между размерной линией и серединой размерного текста.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual double Dimtvp { get; set; }
Копировать Код
Public Overridable Property Dimtvp As Double
 Возвращает
 Возвращает тип данных double.
 Описание
 В свойстве хранится текущее значение расстояния между размерной линией и серединой размерного текста. В качестве значения свойства доступны вещественные числа. Значение по умолчанию 0.0.
 Свойство также доступно через системную переменную DIMTVP.
  При изменении системной переменной DIMTVP будет создан новый размерный стиль под названием <переопределение> на основе текущего с новым значением DIMTVP.
 Условия
 Чтение и запись.
 Пример
 Пример изменения расстояния между размерной линией и серединой размерного текста (значения свойства Dimtvp) в размерном стиле Standard:
C#
 Копировать Код
public partial class Commands { [Teigha.Runtime.CommandMethod("DimtvpChange")] public void DimtvpStandardDimStyle() { // Получение ссылки на активный документ HostMgd.ApplicationServices.Document doc = HostMgd.ApplicationServices.Application.DocumentManager.MdiActiveDocument; // Получение ссылки на редактор документа HostMgd.EditorInput.Editor ed = doc.Editor; // Получение ссылки на базу данных документа Teigha.DatabaseServices.Database db = doc.Database; // Начало транзакции с базой данных документа using (Teigha.DatabaseServices.Transaction trans = db.TransactionManager.StartTransaction()) { // Открываем таблицу размерных стилей для чтения Teigha.DatabaseServices.DimStyleTable dimStyleTable = trans.GetObject(db.DimStyleTableId, Teigha.DatabaseServices.OpenMode.ForRead) as Teigha.DatabaseServices.DimStyleTable; // Находим в таблице размерных стилей ObjectId нужного стиля по его названию Teigha.DatabaseServices.ObjectId styleId = dimStyleTable["Standard"]; // Открываем таблицу размерного стиля для изменений Teigha.DatabaseServices.DimStyleTableRecord obj = trans.GetObject(styleId, Teigha.DatabaseServices.OpenMode.ForWrite) as Teigha.DatabaseServices.DimStyleTableRecord; ed.WriteMessage($"nDimtvp before: {obj.Dimtvp}"); // Изменяем расстояние между размерной линией и серединой размерного текста obj.Dimtvp = 2; ed.WriteMessage($"nDimtvp after: {obj.Dimtvp}"); trans.Commit(); } } }
 Результат работы команды DimtvpChange:
 Было:
 Стало:
 Ссылки
 Teigha.DatabaseServices.DimStyleTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!