Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.LinearEntity2d.GetPerpendicularLine
 Послать отзыв
 Метод позволяет получить линию, которая перпендикулярна данному объекту и проходит через указанную точку.
 Синтаксис
C#
Visual Basic
Копировать Код
public Line2d GetPerpendicularLine( Point2d point );
Копировать Код
Public Function GetPerpendicularLine( point As Point2d ) As Line2d
 Параметры
 Параметры
 Описание
 point
 Точка, через которую должен проходить перпендикуляр к данному объекту. Тип Point2d.
 Возвращает
 Возвращает перпендикуляр к данному объекту, который проходит через точку point. Тип Line2d.
 Описание
 Метод позволяет получить линию, которая перпендикулярна данному объекту и проходит через указанную точку point.
 Ссылки
 Teigha.Geometry.LinearEntity2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!