Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MeshFaceterData.FaceterMaxGrid
 Послать отзыв
 Свойство представляет максимальное количество линий сети, которые допустимо использовать.
 Синтаксис
C#
Visual Basic
Копировать Код
public unsigned short FaceterMaxGrid;
Копировать Код
Public Property FaceterMaxGrid As unsigned short
 Возвращает
 Возвращает максимальное количество линий сети. Тип short.
 Описание
 Свойство представляет максимальное количество линий сети, которые допустимо использовать.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MeshFaceterData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!