Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Rectangle3d.UpperLeft
 Послать отзыв
 Свойство UpperLeft представляет верхнюю левую вершину прямоугольника.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d UpperLeft;
Копировать Код
Public ReadOnly Property UpperLeft As Point3d
 Возвращает
 Возвращает указанную вершину прямоугольника. Тип Point3d.
 Описание
 Свойство UpperLeft представляет верхнюю левую вершину прямоугольника.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Rectangle3d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!