Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Entity.IsPlanar
 Послать отзыв
 Свойство предназначено для определения, лежит ли геометрический объект полностью в одной плоскости.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsPlanar;
Копировать Код
Public Property IsPlanar() As bool
 Возвращает
 Возвращает значение типа bool, где true указывает, что объект является плоским (все его точки находятся в одной плоскости), а false — что объект не является плоским.
 Описание
 Свойство предназначено для определения, лежит ли геометрический объект полностью в одной плоскости.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.Entity, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!