Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 ViewportTableRecord.UcsFollowMode
 Послать отзыв
 Свойство предназначено для управления видом при переключении между ПСК в видовом экране пространства модели.
 Синтаксис
C#
Visual Basic
public bool UcsFollowMode;
Public Property UcsFollowMode() As bool
 Возвращает
 Возвращает тип данных bool:
true – режим следования включен: при переключении между различными ПСК в видовом экране будет отображаться сохраненный вид;
false – режим следования отключен: при переключении между различными ПСК вид будет меняться.
 Описание
 С помощью свойства можно включать/выключать сохранение вида, установленного в видовом экране пространства модели при переключении между различными ПСК. Значение свойства также управляется с помощью системной переменной UCSFOLLOW, значение которой может быть различным для каждого видового экрана пространства модели.
 Условия
 Чтение и запись.
 Ссылки
 ViewportTableRecord Класс, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!