Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Перечисление Teigha.DatabaseServices.EntityVisualStyleType
 Послать отзыв
 This is record Teigha::DatabaseServices::EntityVisualStyleType.
 Синтаксис
C#
Visual Basic
[Wrapper("AcDbEntity.VisualStyleType")] public enum EntityVisualStyleType { EdgeVisualStyle = OdDbEntity.kEdgeVisualStyle, FaceVisualStyle = OdDbEntity.kFaceVisualStyle, FullVisualStyle = OdDbEntity.kFullVisualStyle }
<Wrapper("AcDbEntity.VisualStyleType")> Public Enum EntityVisualStyleType EdgeVisualStyle = OdDbEntity.kEdgeVisualStyle FaceVisualStyle = OdDbEntity.kFaceVisualStyle FullVisualStyle = OdDbEntity.kFullVisualStyle End Enum
 Ваши комментарии по поводу этого топика: Послать отзыв!