Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.UnderlayReference.Width
 Послать отзыв
 Свойство Width представляет ширину данной подложки на чертеже.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Width;
Копировать Код
Public Property Width As Double
 Возвращает
 Возвращает ширину подложки на чертеже. Тип double.
 Описание
 Свойство Width представляет ширину данной подложки на чертеже.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.UnderlayReference, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!