Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SectionSettings.SetLinetype
 Послать отзыв
 Метод позволяет задать имя типа линий для геометрии указанного типа.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetLinetype( SectionType nSecType, SectionGeometry nGeometry, ref String pszLinetype );
Копировать Код
Public Sub SetLinetype( nSecType As SectionType, nGeometry As SectionGeometry, ByRef pszLinetype As String )
 Параметры
 Параметры
 Описание
 nSecType
 Тип сечения. Перечисление SectionType.
 nGeometry
 Типы элементов геометрии сечения. Перечисление SectionGeometry.
 pszLinetype
 Имя типа линий. Тип String.
 Описание
 Метод позволяет задать имя типа линий для геометрии указанного типа.
 Ссылки
 Teigha.DatabaseServices.SectionSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!