Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.VertexRef.VertexRef
 Послать отзыв
 Конструктор класса VertexRef. Создает ссылку на вершину, расположенную в указанной точке.
 Синтаксис
C#
Visual Basic
Копировать Код
public VertexRef( Point3d point );
Копировать Код
Public Sub New( point As Point3d )
 Параметры
 Параметры
 Описание
 point
 Входная точка. Тип Point3d.
 Описание
 Конструктор класса VertexRef. Создает ссылку на вершину, расположенную в указанной точке.
 Ссылки
 Teigha.DatabaseServices.VertexRef, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!