Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObject.ModifyUndone
 Послать отзыв
 Событие происходит каждый раз, когда объект в данный момент выполняет операцию отмены изменений объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public event EventHandler ModifyUndone;
Копировать Код
Public Event ModifyUndone As EventHandler
 Возвращает
 Тип данных EventHandler, представляющий обработчик события.
 Описание
 Событие происходит каждый раз, когда объект в данный момент выполняет операцию отмены изменений объекта.
 Ссылки
 Teigha.DatabaseServices.DBObject, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!