Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.CameraDisplay
 Послать отзыв
 Синтаксис
C#
Visual Basic
public bool CameraDisplay;
Public Property CameraDisplay() As bool
 Описание
 Возвращает или устанавливает текущее значение системной переменной CAMERADISPLAY для базы данных (переменная указывает, надо отображать или скрыть камеры).
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!