Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MText.ColumnFlowReversed
 Послать отзыв
 Свойство определяет, является ли поток столбцов данного объекта MText обратным. Эта настройка влияет на способ добавления столбцов.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool ColumnFlowReversed;
Копировать Код
Public Property ColumnFlowReversed As Boolean
 Возвращает
 Возвращает true, если направление потока текстовых столбцов является обратным. В противном случае возвращает false.
 Описание
 Свойство определяет, является ли поток столбцов данного объекта MText обратным. Эта настройка влияет на способ добавления столбцов.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MText, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!