Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CircularArc2d.Set
 Послать отзыв
 Метод позволяет переопределить центр и радиус данной дуги.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Set( Point2d center, double radius );
Копировать Код
Public Sub Set( center As Point2d, radius As Double )
 Параметры
 Параметры
 Описание
 center
 Новое положение центра дуги. Тип Point2d.
 radius
 Новый радиус дуги. Тип double.
 Описание
 Метод позволяет переопределить центр и радиус данной дуги.
 Ссылки
 Teigha.Geometry.CircularArc2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!