Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Matrix2dInfo.ToString
 Послать отзыв
 Метод предоставляет эквивалентное строковое представление данного объекта с учетом заданных языковых и региональных настроек.
 Синтаксис
C#
Visual Basic
Копировать Код
public String ToString( ref IFormatProvider provider );
Копировать Код
Public Function ToString( ByRef provider As IFormatProvider ) As String
 Параметры
 Параметры
 Описание
 provider
 Входной провайдер языковых и региональных настроек. Тип IFormatProvider.
 Возвращает
 Возвращает эквивалентное строковое представление данного объекта с учетом заданных языковых и региональных настроек. Тип String.
 Описание
 Метод предоставляет эквивалентное строковое представление данного объекта с учетом заданных языковых и региональных настроек.
 Ссылки
 Teigha.Geometry.Matrix2dInfo, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!