Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Ellipse.IsNull
 Послать отзыв
 Свойство IsNull позволяет определить, действителен ли данный эллипс или эллиптическая дуга.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsNull;
Копировать Код
Public ReadOnly Property IsNull As Boolean
 Возвращает
 Возвращает true, если эллипс (или эллиптическая дуга) оказался недействительным. В противном случае возвращает false.
 Описание
 Свойство IsNull позволяет определить, действителен ли данный эллипс или эллиптическая дуга.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Ellipse, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!