Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.LinearEntity2d.PointOnLine
 Послать отзыв
 Свойство PointOnLine представляет произвольную точку, гарантированно расположенную на данном линейном объекте.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point2d PointOnLine;
Копировать Код
Public ReadOnly Property PointOnLine As Point2d
 Возвращает
 Возвращает точку на данном линейном объекте. Тип Point2d.
 Описание
 Свойство PointOnLine представляет произвольную точку, гарантированно расположенную на данном линейном объекте.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.LinearEntity2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!