Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MlineStyleElementCollection
 Послать отзыв
 Класс представляет коллекцию объектов MlineStyleElement.
 Иерархия классов
Teigha::DatabaseServices::MlineStyleElementCollection
 Синтаксис
C#
Visual Basic
Копировать Код
[DefaultMember("Item")] public sealed class MlineStyleElementCollection : ICollection
Копировать Код
<DefaultMember("Item")> Public NotInheritable Class MlineStyleElementCollection Implements ICollection
 Описание
 Класс представляет коллекцию объектов MlineStyleElement.
 Топики
 Имя
 Описание
 MlineStyleElementCollection Методы
 Ниже перечислены методы класса MlineStyleElementCollection.
 MlineStyleElementCollection Свойства
 Ниже перечислены свойства класса MlineStyleElementCollection.
 Ссылки
 MlineStyleElementCollection Методы, MlineStyleElementCollection Свойства, Топики, MlineStyleElementCollection Методы, MlineStyleElementCollection Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!