Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Point3d.Point3d
 Послать отзыв
 Конструктор класса Point3d. Создает трехмерную точку в заданных координатах.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d( double x, double y, double z );
Копировать Код
Public Sub New( x As Double, y As Double, z As Double )
 Параметры
 Параметры
 Описание
 x
 X-координата данной точки. Тип double.
 y
 Y-координата данной точки. Тип double.
 z
 Z-координата данной точки. Тип double.
 Описание
 Конструктор класса Point3d. Создает трехмерную точку с координатами x, y и z.
 Ссылки
 Teigha.Geometry.Point3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!