Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 DimStyleTableRecord.Dimarcsym
 Послать отзыв
 Свойство отвечает за размещение символов дуги в размерах длины дуги.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual int Dimarcsym { get; set; }
Копировать Код
Public Overridable Property Dimarcsym As Integer
 Возвращает
 Возвращает тип данных int.
 Возвращаемые значения
 Возвращаемые значения
 Описание
 0
 символ дуги размещен перед текстом размера в размерах длины дуги
 1
 символ дуги размещен над текстом размера в размерах длины дуги
 2
 символ дуги не отображается в размерах длины дуги
 Описание
 В свойстве хранится настройка размещения символов дуги в размерах длины дуги. В качестве значения свойства доступны следующие целые числа:
0 – перед текстом размера (по умолчанию);
1 – над текстом размера;
2 – не отображается.
 Свойство также доступно через системную переменную DIMARCSYM и пользовательское меню в окне изменения/создания размерного стиля:
  При изменении системной переменной DIMARCSYM будет создан новый размерный стиль под названием <переопределение> на основе текущего с новым значением DIMARCSYM.
 Условия
 Чтение и запись.
 Пример
 Пример изменения настройки размещения символа дуги в размерах длины дуги (значения свойства Dimarcsym) в размерном стиле Standard:
C#
 Копировать Код
public partial class Commands { [Teigha.Runtime.CommandMethod("DimarcsymChange")] public void DimarcsymStandardDimStyle() { // Получение ссылки на активный документ HostMgd.ApplicationServices.Document doc = HostMgd.ApplicationServices.Application.DocumentManager.MdiActiveDocument; // Получение ссылки на редактор документа HostMgd.EditorInput.Editor ed = doc.Editor; // Получение ссылки на базу данных документа Teigha.DatabaseServices.Database db = doc.Database; // Начало транзакции с базой данных документа using (Teigha.DatabaseServices.Transaction trans = db.TransactionManager.StartTransaction()) { // Открываем таблицу размерных стилей для чтения Teigha.DatabaseServices.DimStyleTable dimStyleTable = trans.GetObject(db.DimStyleTableId, Teigha.DatabaseServices.OpenMode.ForRead) as Teigha.DatabaseServices.DimStyleTable; // Находим в таблице размерных стилей ObjectId нужного стиля по его названию Teigha.DatabaseServices.ObjectId styleId = dimStyleTable["Standard"]; // Открываем таблицу размерного стиля для изменений Teigha.DatabaseServices.DimStyleTableRecord obj = trans.GetObject(styleId, Teigha.DatabaseServices.OpenMode.ForWrite) as Teigha.DatabaseServices.DimStyleTableRecord; ed.WriteMessage($"nDimarcsym before: {obj.Dimarcsym}"); // Изменяем настройку размещения символа дуги obj.Dimarcsym = 1; ed.WriteMessage($"nDimarcsym after: {obj.Dimarcsym}"); trans.Commit(); } } }
 Результат работы команды DimarcsymChange:
 Было:
 Стало:
 Ссылки
 Teigha.DatabaseServices.DimStyleTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!