Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SymbolUtilityServices.GetMaxSymbolNameLength
 Послать отзыв
 Метод предоставляет максимально допустимую длину имен символов.
 Синтаксис
C#
Visual Basic
Копировать Код
public static int GetMaxSymbolNameLength( bool isNewName, bool compatibilityMode );
Копировать Код
Public Shared Function GetMaxSymbolNameLength( isNewName As Boolean, compatibilityMode As Boolean ) As Integer
 Параметры
 Параметры
 Описание
 isNewName
 Флаг, определяющий, следует извлекать длину для расширенных или устаревших имен символов. Тип bool.
 compatibilityMode
 Флаг, определяющий, следует обрабатывать расширенные или устаревшие имена символов. Тип bool.
 Возвращает
 Возвращает максимально допустимую длину имен символов. Тип int.
 Описание
 Метод предоставляет максимально допустимую длину имен символов.
 Возвращаемые значения зависят от состояния флага compatibilityMode. Если установлено значение true, метод возвращает длину 255 символов, в противном случае возвращает 31.
 Ссылки
 Teigha.DatabaseServices.SymbolUtilityServices, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!