Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.RevolvedSurface.RevolveOptions
 Послать отзыв
 Свойство RevolveOptions представляет опции операции вращения, влияющие на форму получаемой поверхности.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.RevolveOptions RevolveOptions;
Копировать Код
Public Property RevolveOptions As DatabaseServices.RevolveOptions
 Возвращает
 Возвращает опции операции вращения. Тип DatabaseServices.RevolveOptions.
 Описание
 Свойство RevolveOptions представляет опции операции вращения, влияющие на форму получаемой поверхности.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.RevolvedSurface, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!