Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Curve.GetPointAtDist
 Послать отзыв
 Метод вычисляет точку на кривой, которая находится на заданном расстоянии вдоль кривой от её начала.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual Point3d GetPointAtDist( double value );
Копировать Код
Public virtual Function GetPointAtDist( value As double ) As Point3d
 Параметры
 Параметры
 Описание
 value
 Величина типа double, которая задает расстояние вдоль кривой от ее начала до положения искомой точки на кривой.
 Возвращает
 Объект типа Point3d, который представляет искомую точку на кривой.
 Описание
 Метод GetPointAtDist вычисляет точку Point3d на кривой, которая находится на заданном расстоянии value вдоль кривой от начальной точки кривой.
 Ссылки
 Teigha.DatabaseServices.Curve, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!