Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocArray.Explode
 Послать отзыв
 Метод создает коллекцию ObjectId объектов, образованных в результате разбиения на подобъекты входного ассоциативного массива.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectIdCollection Explode( ObjectId entity );
Копировать Код
Public Function Explode( entity As ObjectId ) As ObjectIdCollection
 Параметры
 Параметры
 Описание
 entity
 Идентификатор разбиваемого на подобъекты массива. Тип ObjectId.
 Возвращает
 Возвращает коллекцию идентификаторов объектов, полученных в результате разбиения на подобъекты. Тип ObjectIdCollection.
 Описание
 Метод создает коллекцию ObjectId объектов, образованных в результате разбиения на подобъекты входного ассоциативного массива. Каждый из объектов в этой коллекции получает уникальный ObjectId.
 Ссылки
 Teigha.DatabaseServices.AssocArray, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!