Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.PointOnCurve2d.Curve
 Послать отзыв
 Свойство Curve обеспечивает доступ к кривой, точку на которой представляет данный объект.
 Синтаксис
C#
Visual Basic
Копировать Код
public Curve2d Curve;
Копировать Код
Public Property Curve As Curve2d
 Возвращает
 Возвращает двумерную кривую. Тип Curve2d.
 Описание
 Свойство Curve обеспечивает доступ к кривой, точку на которой представляет данный объект.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.Geometry.PointOnCurve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!