Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DwgVersion
 Послать отзыв
 Данное перечисление определяет значения версий DWG.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum DwgVersion { AC1001 = 8, AC1002 = 9, AC1003 = 10, AC1004 = 11, AC1005 = 12, AC1006 = 13, AC1007 = 14, AC1008 = 15, AC1009 = 16, AC1010 = 17, AC1011 = 18, AC1012 = 19, AC1013 = 20, AC1014 = 21, AC1015 = 23, AC1021 = 27, AC1024 = 29, AC1027 = 31, AC1032 = 33, AC1500 = 22, AC1800 = 25, AC1800a = 24, AC1To2 = 1, AC1To40 = 2, AC1To50 = 3, AC2100a = 26, AC2400a = 28, AC2700a = 30, AC2To10 = 5, AC2To20 = 4, AC2To21 = 6, AC2To22 = 7, AC3200a = 32, Current = 33, Max = 32767, MC0To0 = 0, Newest = 33, Unknown = 32766, vAC025 = 9, vAC026 = 10, vAC09 = 11, vAC10 = 13, vAC12 = 16, vAC13 = 19, vAC14 = 21, vAC14beta = 20, vAC15 = 23, vAC18 = 25, vAC21 = 27, vAC24 = 29, vAC27 = 31, vAC32 = 33 }
Копировать Код
Public Enum DwgVersion AC1001 = 8 AC1002 = 9 AC1003 = 10 AC1004 = 11 AC1005 = 12 AC1006 = 13 AC1007 = 14 AC1008 = 15 AC1009 = 16 AC1010 = 17 AC1011 = 18 AC1012 = 19 AC1013 = 20 AC1014 = 21 AC1015 = 23 AC1021 = 27 AC1024 = 29 AC1027 = 31 AC1032 = 33 AC1500 = 22 AC1800 = 25 AC1800a = 24 AC1To2 = 1 AC1To40 = 2 AC1To50 = 3 AC2100a = 26 AC2400a = 28 AC2700a = 30 AC2To10 = 5 AC2To20 = 4 AC2To21 = 6 AC2To22 = 7 AC3200a = 32 Current = 33 Max = 32767 MC0To0 = 0 Newest = 33 Unknown = 32766 vAC025 = 9 vAC026 = 10 vAC09 = 11 vAC10 = 13 vAC12 = 16 vAC13 = 19 vAC14 = 21 vAC14beta = 20 vAC15 = 23 vAC18 = 25 vAC21 = 27 vAC24 = 29 vAC27 = 31 vAC32 = 33 End Enum
 Члены
 Члены
 Описание
 MC0To0
 Значение: 0.
 AC1To2
 Значение: 1.
 AC1To40
 Значение: 2.
 AC1To50
 Значение: 3.
 AC2To10
 Значение: 5.
 AC2To20
 Значение: 4.
 AC2To21
 Значение: 6.
 AC2To22
 Значение: 7.
 AC1001
 Значение: 8.
 AC1002
 Значение: 9.
 AC1003
 Значение: 10.
 AC1004
 Значение: 11.
 AC1005
 Значение: 12.
 AC1006
 Значение: 13.
 AC1007
 Значение: 14.
 AC1008
 Значение: 15.
 AC1009
 Значение: 16.
 AC1010
 Значение: 17.
 AC1011
 Значение: 18.
 AC1012
 Значение: 19.
 AC1013
 Значение: 20.
 AC1014
 Значение: 21.
 AC1015
 Значение: 23.
 AC1021
 Значение: 27.
 AC1024
 Значение: 29.
 AC1027
 Значение: 31.
 AC1032
 Значение: 33.
 AC1500
 Значение: 22.
 AC1800
 Значение: 25.
 AC1800a
 Значение: 24.
 AC2100a
 Значение: 26.
 AC2400a
 Значение: 28.
 AC2700a
 Значение: 30.
 AC3200a
 Значение: 32.
 Current
 Значение: 33. Текущая версия.
 Newest
 Значение: 33. Самая новая версия.
 Unknown
 Значение: 32766. Версия неизвестна.
 Max
 Значение: 32767.
 vAC025
 Значение: 9.
 vAC026
 Значение: 10.
 vAC09
 Значение: 11.
 vAC10
 Значение: 13.
 vAC12
 Значение: 16.
 vAC13
 Значение: 19.
 vAC14beta
 Значение: 20.
 vAC14
 Значение: 21.
 vAC15
 Значение: 23.
 vAC18
 Значение: 25.
 vAC21
 Значение: 27.
 vAC24
 Значение: 29.
 vAC27
 Значение: 31.
 vAC32
 Значение: 33.
 Описание
 Данное перечисление определяет значения версий DWG.
 Ваши комментарии по поводу этого топика: Послать отзыв!