Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Chamfera
 Послать отзыв
 Синтаксис
C#
Visual Basic
public double Chamfera;
Public Property Chamfera() As Double
 Описание
 Возвращает или устанавливает текущее значение CHAMFERA для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!