Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.OsnapPointRef.OsnapType
 Послать отзыв
 Свойство OsnapType представляет тип объектной привязки (Osnap) для связанной геометрии.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectSnapModes OsnapType;
Копировать Код
Public Property OsnapType As ObjectSnapModes
 Возвращает
 Возвращает тип объектной привязки. Перечисление ObjectSnapModes.
 Описание
 Свойство OsnapType представляет тип объектной привязки (Osnap) для связанной геометрии.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.OsnapPointRef, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!