Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GripData.GizmosEnabled
 Послать отзыв
 Свойство определяет, следует ли использовать гизмо для изменения ручки.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool GizmosEnabled;
Копировать Код
Public Property GizmosEnabled As Boolean
 Возвращает
 Возвращает true, если гизмо должны появляться при подсвечивании ручки курсором. В противном случае возвращает false.
 Описание
 Свойство определяет, следует ли использовать гизмо для изменения ручки. Если это свойство принимает значение true, гизмо появляются при подсвечивании ручки курсором.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.GripData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!