Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.RenderGlobal.DimensionsParameter.Width
 Послать отзыв
 Свойство Width представляет размер по ширине.
 Синтаксис
C#
Visual Basic
Копировать Код
public int Width;
Копировать Код
Public ReadOnly Property Width As Integer
 Возвращает
 Возвращает значение ширины. Тип int.
 Описание
 Свойство Width представляет размер по ширине.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.RenderGlobal.DimensionsParameter, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!