Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Unitmode
 Послать отзыв
 Синтаксис
C#
Visual Basic
public int Unitmode;
Public Property Unitmode() As Integer
 Описание
 Обеспечивает доступ к текущему значению UNITMODE для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!