Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SubDMesh.SmoothLevel
 Послать отзыв
 Свойство предоставляет доступ к текущей степени сглаженности сети.
 Синтаксис
C#
Visual Basic
Копировать Код
public int SmoothLevel;
Копировать Код
Public Property SmoothLevel() As Integer
 Возвращает
 Свойство возвращает степень сглаженности сети, int.
 Описание
 Свойство предоставляет доступ к текущей степени сглаженности сети.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.SubDMesh, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!