Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocManager.HasAssocNetwork
 Послать отзыв
 Метод проверяет, имеет ли указанная база данных глобальную ассоциативную сеть (представленную объектом AssocNetwork). Не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool HasAssocNetwork( ref Teigha.DatabaseServices.Database database );
Копировать Код
Public Function HasAssocNetwork( ByRef database As Teigha.DatabaseServices.Database ) As Boolean
 Параметры
 Параметры
 Описание
 database
 Проверяемая база данных. Тип Teigha.DatabaseServices.Database.
 Возвращает
 Возвращает true, если база данных database имеет глобальную ассоциативную сеть. В противном случае возвращает false.
 Описание
 Метод проверяет, имеет ли указанная база данных глобальную ассоциативную сеть (представленную объектом AssocNetwork). На данный момент не реализован.
 Ссылки
 Teigha.DatabaseServices.AssocManager, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!