Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CompositeCurve2d.Create
 Послать отзыв
 Метод предназначен для создания составной кривой на основе переданного указателя.
 Синтаксис
C#
Visual Basic
Копировать Код
public static CompositeCurve2d Create( IntPtr unmanagedPointer, bool autoDelete );
Копировать Код
Public Shared Function Create( unmanagedPointer As IntPtr, autoDelete As Boolean ) As CompositeCurve2d
 Параметры
 Параметры
 Описание
 unmanagedPointer
 Неуправляемый указатель на исходный объект. Тип IntPtr.
 autoDelete
 Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.
 Возвращает
 Возвращает созданную составную кривую. Тип CompositeCurve2d.
 Описание
 Метод предназначен для создания составной кривой на основе переданного указателя.
 Ссылки
 Teigha.Geometry.CompositeCurve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!