Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ObjectContext.UniqueIdentifier
 Послать отзыв
 Свойство представляет уникальный и неизменный идентификатор контекста.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual IntPtr UniqueIdentifier;
Копировать Код
Public Overridable ReadOnly Property UniqueIdentifier As IntPtr
 Возвращает
 Возвращает идентификатор контекста. Тип IntPtr.
 Описание
 Свойство представляет уникальный и неизменный идентификатор контекста. Используется для ссылки на объект контекста. Применять для этой цели имя контекста небезопасно, поскольку это имя может быть изменено.
 Данный идентификатор является неизменным в течение всего жизненного цикла контекста и уникальным в пределах коллекции контекстов ObjectContextCollection. Если конкретный экземпляр ObjectContext в настоящее время не находится в коллекции, уникальность возвращаемого идентификатора не гарантируется.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.ObjectContext, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!