Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Dimaltrnd
 Послать отзыв
 Синтаксис
C#
Visual Basic
public double Dimaltrnd;
Public Property Dimaltrnd() As Double
 Описание
 Возвращает или устанавливает текущее значение DIMALTRND для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!