Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.UnitsConverter.ConvertFrom
 Послать отзыв
 Метод предоставляет объект, полученный в результате преобразования предоставленного объекта в указанном контексте с учетом языковых и региональных настроек.
 Синтаксис
C#
Visual Basic
Копировать Код
public override Object ConvertFrom( ref ITypeDescriptorContext context, ref CultureInfo culture, ref Object value );
Копировать Код
Public Overrides Function ConvertFrom( ByRef context As ITypeDescriptorContext, ByRef culture As CultureInfo, ByRef value As Object ) As Object
 Параметры
 Параметры
 Описание
 context
 Контекст преобразования. Тип ITypeDescriptorContext.
 culture
 Региональные и языковые настройки. Тип CultureInfo.
 value
 Входной объект для преобразования. Тип Object.
 Возвращает
 Возвращает результат преобразования. Тип Object.
 Описание
 Метод предоставляет объект, полученный в результате преобразования предоставленного объекта в указанном контексте с учетом языковых и региональных настроек.
 Ссылки
 Teigha.DatabaseServices.UnitsConverter, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!