Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Pucsorg
 Послать отзыв
 Синтаксис
C#
Visual Basic
public Point3d Pucsorg;
Public Property Pucsorg() As Point3d
 Описание
 Возвращает текущее значение UCSORG пространства листа базы данных.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!