Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LayoutCopiedEventArgs.NewName
 Послать отзыв
 Свойство представляет имя нового листа (копии).
 Синтаксис
C#
Visual Basic
Копировать Код
public String NewName;
Копировать Код
Public ReadOnly Property NewName As String
 Возвращает
 Возвращает имя нового листа-копии. Тип String.
 Описание
 Свойство представляет имя нового листа (копии).
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.LayoutCopiedEventArgs, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!