Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 BlockTableRecord.IsFromExternalReference
 Послать отзыв
 Свойство предназначено для определения того, загружен блок из другого чертежа или создан непосредственно в этом чертеже.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsFromExternalReference { get; }
Копировать Код
Public ReadOnly Property IsFromExternalReference As Boolean
 Возвращает
 Возвращает тип данных bool:
true - блок является внешним для документа, то есть вставлен из другого документа.
false - блок был создан в текущем документе.
 Note Значение свойства используется для 3-его бита группового кода
 70 DXF.
 Описание
 Свойство показывает, является ли даное определение блока внешним для чертежа,либо создано непосредственно в этом чертеже.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.BlockTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!