Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.NurbSurface.Set
 Послать отзыв
 Метод предоставляет возможность задать новые данные для существующей NURBS поверхности.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Set( int iUDegree, int iVDegree, bool bRational, int iUNumControlPoints, int iVNumControlPoints, ref Point3dCollection ctrlPts, ref DoubleCollection weights, ref KnotCollection knotsInU, ref KnotCollection knotsInV );
Копировать Код
Public Sub [Set]( iUDegree As Integer, iVDegree As Integer, bRational As Boolean, iUNumControlPoints As Integer, iVNumControlPoints As Integer, ByRef ctrlPts As Point3dCollection, ByRef weights As DoubleCollection, ByRef knotsInU As KnotCollection, ByRef knotsInV As KnotCollection )
 Параметры
 Параметры
 Описание
 iUDegree
 Новая степень сплайна в направлении u. Тип int.
 iVDegree
 Новая степень сплайна в направлении v. Тип int.
 bRational
 Входной флаг, который определяет, что поверхность является рациональной (новое значение). Тип bool.
 iUNumControlPoints
 Новое количество управляющих вершин в направлении u. Тип int.
 iVNumControlPoints
 Новое количество управляющих вершин в направлении v. Тип int.
 ctrlPts
 Новый массив управляющих вершин (в мировой системе координат WCS). Тип Point3dCollection.
 weights
 Новый массив весов в каждой управляющей вершине. Тип DoubleCollection.
 knotsInU
 Новый узловой вектор в направлении u. Тип KnotCollection.
 knotsInV
 Новый узловой вектор в направлении v. Тип KnotCollection.
 Описание
 Метод предоставляет возможность задать новые данные для существующей NURBS поверхности.
 Индексы столбцов относятся к направлению v, а индексы рядов — к направлению u. Например, если поверхность имеет m управляющих вершин в направлении u и n управляющих вершин в направлении v, массив выглядит как [0,0], [0,1], ...[0,n-1], ..., [m-1,0], [m-1,1], ... [m-1,n-1].
 Если поверхность является рациональной, массив весов должен состоять из такого же количества элементов, что и массив управляющих вершин. Все значения веса должны быть положительными. Значения в массивах весов и управляющих вершин должны иметь тот же порядок следования, что и массив управляющих вершин. Если поверхность нерациональная, массив весов должен быть пустым.
 Если поверхность не является периодической в направлении u, размерность узлового вектора uKnots должна быть равной uNumControlPoints + uDegree + 1. Если поверхность периодична в направлении u, размерность узлового вектора uKnots должна равняться uNumControlPoints + 1. Аналогично, если поверхность не является периодической в направлении v, размерность узлового вектора vKnots должна быть равной vNumControlPoints + vDegree + 1. Если поверхность периодична в направлении v, размерность узлового вектора vKnots должна равняться vNumControlPoints + 1. Последовательность значений в узловом векторе должна быть неубывающей.
 Если какой-либо из переданных параметров недействителен, поверхность создана не будет. Если этот метод в конкретном моделере не реализован, выбрасывается исключение eNotImplementedYet.
 Ссылки
 Teigha.DatabaseServices.NurbSurface, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!