Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DwgFiler.ReadUInt64
 Послать отзыв
 Метод предназначен для получения 64-разрядного целого числа без знака (UInt64) из текущего элемента данного объекта Filer.
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract ulong ReadUInt64();
Копировать Код
Public MustOverride Function ReadUInt64() As ULong
 Возвращает
 Возвращает значение 64-разрядного целого числа без знака. Тип ulong.
 Описание
 Метод предназначен для получения 64-разрядного целого числа без знака (UInt64) из текущего элемента данного объекта Filer.
 Ссылки
 Teigha.DatabaseServices.DwgFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!