Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.HatchStyle
 Послать отзыв
 Перечисление HatchStyle определяет поддерживаемые стили штрихования.
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdDbHatch.HatchStyle")] public enum HatchStyle { Normal = 0, Outer = 1, Ignore = 2 }
Копировать Код
<Wrapper("OdDbHatch.HatchStyle")> Public Enum HatchStyle Normal = 0 Outer = 1 Ignore = 2 End Enum
 Члены
 Члены
 Описание
 Normal
 Значение: 0. Штриховка переключается на каждой границе.
Стиль штрихования Normal штрихует внутрь от внешнего цикла границы. При столкновении с внутренним пересечением штрихование отключается до тех пор, пока не встретится другое пересечение. Таким образом, области, отделенные от внешней стороны заштрихованной области нечетным числом пересечений, штрихуются, а области, отделенные четным числом пересечений, — нет.
 Outer
 Значение: 1. Штриховка отключается после встречи с первым внутренним циклом.
Стиль штрихования Outer штрихует внутрь от внешнего цикла границы. При столкновении с внутренним пересечением штрихование отключается и больше не включается. Поскольку этот процесс начинается с обоих концов каждой линии штриховки, штрихуется только самый внешний уровень структуры, оставляя внутреннюю структуру пустой.
 Ignore
 Значение: 2. Стиль штрихования Ignore предписывает штрихование внутрь от внешнего цикла при игнорировании любых внутренних циклов.
 Описание
 В текущей версии поддерживаются три стиля штрихования: Normal, Outer и Ignore. В отсутствие внутренних граничных циклов указание стиля штрихования не влияет на результирующую штриховку.
 Ваши комментарии по поводу этого топика: Послать отзыв!