Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Group.Description
 Послать отзыв
 Свойство обеспечивает доступ к описанию данного объекта Group.
 Синтаксис
C#
Visual Basic
Копировать Код
public String Description;
Копировать Код
Public Property Description As String
 Возвращает
 Возвращает описание группы. Тип String.
 Описание
 Свойство обеспечивает доступ к описанию данного объекта Group.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Group, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!