Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор RasterImageDef.RasterImageDef ()
 Послать отзыв
 Синтаксис
C#
Visual Basic
public RasterImageDef(IntPtr unmanagedPointer, bool autoDelete); public RasterImageDef();
Public Sub New(unmanagedPointer As IntPtr, autoDelete As bool) Public Sub New()
 Описание
 Конструктор по умолчанию.
 Ссылки
 Teigha.DatabaseServices.RasterImageDef, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!