Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FileDependencyManager.UpdateEntry
 Послать отзыв
 Метод обновляет в разделе .dwg списка файловых зависимостей ту запись, которая была создана указанным приложением или функцией.
 Синтаксис
C#
Visual Basic
Копировать Код
public void UpdateEntry( ref String feature, ref String fullFileName );
Копировать Код
Public Sub UpdateEntry( ByRef feature As String, ByRef fullFileName As String )
 Параметры
 Параметры
 Описание
 feature
 Имя приложения или функции, создавших запись. Тип String.
 fullFileName
 Полное имя файла для записи. Тип String.
 Описание
 Метод обновляет в разделе .dwg списка файловых зависимостей ту запись, которая была создана указанным приложением или функцией.
 Замечания
 Этот метод переопределяет заново значения полей mIsModified, mTimestamp и mFileSize записи.
 Ссылки
 Teigha.DatabaseServices.FileDependencyManager, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!