Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.BoundedPlane.BoundedPlane
 Послать отзыв
 Конструктор класса BoundedPlane. Создает ограниченную плоскую поверхность, определяемую точкой начала и двумя векторами в этой плоскости.
 Синтаксис
C#
Visual Basic
Копировать Код
public BoundedPlane( Point3d origin, Vector3d u, Vector3d v );
Копировать Код
Public Sub New( origin As Point3d, u As Vector3d, v As Vector3d )
 Параметры
 Параметры
 Описание
 origin
 Точка начала. Тип Point3d.
 u
 Вектор U. Тип Vector3d.
 v
 Вектор V. Тип Vector3d.
 Описание
 Конструктор класса BoundedPlane. Создает ограниченную плоскую поверхность, определяемую точкой начала и двумя векторами u и v в этой плоскости.
 Ссылки
 Teigha.Geometry.BoundedPlane, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!