Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.NumColumns
 Послать отзыв
 Данное свойство представляет количество столбцов в таблице. Устарело. Используйте Table.Columns.Count или Table.SetSize(int numRows, int numCols).
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual int NumColumns;
Копировать Код
Public virtual Property NumColumns() As Integer
 Возвращает
 Возвращает количество столбцов в таблице, int.
 Описание
 Данное свойство представляет количество столбцов в данной таблице.
 Замечания
 Устарело. Используйте свойство Table.Columns.Count или Table.SetSize(int numRows, int numCols).
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!