Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SubDMesh.ExtrudeFaces
 Послать отзыв
 Метод предназначен для выдавливания граней вдоль заданного направления и с заданным углом сужения.
 Синтаксис
C#
Visual Basic
Копировать Код
public void ExtrudeFaces( ref FullSubentityPath[] paths, double length, Vector3d dir, double taper );
Копировать Код
Public Sub ExtrudeFaces( ByRef paths As FullSubentityPath[], length As double, dir As Vector3d, taper As double )
 Параметры
 Параметры
 Описание
 paths
 Массив выдавливаемых подобъектов (поверхностей или сегментов сети). Тип FullSubentityPath[].
 length
 Длина выдавливания. Тип double.
 dir
 Направление выдавливания. Тип Vector3d.
 taper
 Угол сужения при выдавливании. Тип double.
 Описание
 Метод предназначен для выдавливания граней вдоль заданного направления и с заданным углом сужения.
 Ссылки
 Teigha.DatabaseServices.SubDMesh, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!