Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocAction.GetDependencies
 Послать отзыв
 Метод позволяет получить коллекцию зависимостей AssocDependency для данного ассоциативного действия.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectIdCollection GetDependencies( bool readDependenciesWanted, bool writeDependenciesWanted );
Копировать Код
Public Function GetDependencies( readDependenciesWanted As Boolean, writeDependenciesWanted As Boolean ) As ObjectIdCollection
 Параметры
 Параметры
 Описание
 readDependenciesWanted
 Если true, то следует искать действия, которые зависят от данного действия. Тип bool.
 writeDependenciesWanted
 Если true, то следует искать действия, которые влияют на данное действие. Тип bool.
 Возвращает
 Возвращает коллекцию ObjectId с найденными зависимостями. Тип ObjectIdCollection.
 Описание
 Метод позволяет получить зависимости AssocDependency для данного ассоциативного действия. Реализация по умолчанию получает все зависимости, принадлежащие базовому классу ассоциативных действий, и допускает настройку выбора в зависимости от требуемого типа зависимостей (чтение/запись).
 Если действию принадлежит объект AssocActionBody с переопределенным методом getDependencyOverride(), вызывается именно этот переопределенный метод, заменяя тем самым реализацию по умолчанию. Это позволяет пользовательским классам тел действий самим контролировать, какие зависимости возвращать, а какие не указывать.
 Ссылки
 Teigha.DatabaseServices.AssocAction, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!