Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotStyleData.DitherOn
 Послать отзыв
 Свойство DitherOn позволяет определить, включено ли в настройках стиля печати использование дизеринга.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool DitherOn;
Копировать Код
Public Property DitherOn As Boolean
 Возвращает
 Возвращает true, если использование дизеринга включено. В противном случае возвращает false.
 Описание
 Свойство DitherOn позволяет определить, включено ли в данном объекте PlotStyleData использование дизеринга.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.PlotStyleData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!