Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObject.Close()
 Послать отзыв
 Метод закрывает объект. Все изменения, внесенные в объект с момента его открытия, фиксируются в базе данных, и отправляется уведомление о том, что объект теперь "закрыт". В настоящее время не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
[Obsolete( "Use Transaction instead" )] public void Close();
Копировать Код
<Obsolete( "Use Transaction instead" )> Public Sub Close()
 Описание
 Закрывает объект. Все изменения, сделанные с объектом с момента открытия, фиксируются в базе данных, объект помечается как выгружаемый, и формируется событие "закрыт" (так же, как и, в соответствующих случаях, события "изменен", "очищен" и т.д.).
 Ссылки
 Teigha.DatabaseServices.DBObject, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!