Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBDictionary.Remove
 Послать отзыв
 Метод удаляет из словаря запись c заданным ключом.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.ObjectId Remove( ref String key );
Копировать Код
Public Function Remove( ByRef key As String ) As DatabaseServices.ObjectId
 Параметры
 Параметры
 Описание
 key
 Строка, представляющая ключ (имя) записи в словаре.
 Возвращает
 Возвращает идентификатор ObjectId удаляемого объекта.
 Описание
 Метод Remove удаляет из словаря запись c заданным ключом.
 Ссылки
 Teigha.DatabaseServices.DBDictionary, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!