Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Ellipse.MajorAxis
 Послать отзыв
 Свойство MajorAxis возвращает направление большой оси эллипса или эллиптической дуги.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d MajorAxis;
Копировать Код
Public ReadOnly Property MajorAxis As Vector3d
 Возвращает
 Возвращает направление большой оси эллипса или эллиптической дуги. Тип Vector3d.
 Описание
 Свойство MajorAxis возвращает направление большой оси эллипса или эллиптической дуги.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Ellipse, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!