Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Solid3d.CreatePyramid
 Послать отзыв
 Метод предназначен для создания твердого тела в виде пирамиды с указанными параметрами.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void CreatePyramid( double height, int sides, double radius, double topRadius );
Копировать Код
Public Overridable Sub CreatePyramid( height As Double, sides As Integer, radius As Double, topRadius As Double )
 Параметры
 Параметры
 Описание
 height
 Высота пирамиды. Тип double. Высота по модулю не может быть меньше 1e-6.
 sides
 Количество боковых граней пирамиды. Тип int. Диапазон допустимых значений - от 3 до 64, включительно.
 radius
 Радиус окружности, вписанной в нижнее основание пирамиды. Тип double. Значение по модулю не может быть меньше 1e-6.
 topRadius
 Радиус окружности, вписанной в верхнее основание пирамиды. Тип double. Значение по модулю не может быть меньше 1e-6.
 Описание
 Метод предназначен для создания твердого тела в виде пирамиды.
 Основание пирамиды параллельно плоскости x-y мировой системы координат (WCS). Направление пирамиды (от основания к вершине) совпадает с положительным направлением оси z. Середина высоты пирамиды совпадает с началом системы координат WCS.
 В случае равенства аргументов radius и topRadius создается призма.
 Ссылки
 Teigha.DatabaseServices.Solid3d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!