Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.TableStyle
 Послать отзыв
 Данное свойство предоставляет доступ к идентификатору ObjectId объекта TableStyle, на который ссылается объект Table.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual ObjectId TableStyle;
Копировать Код
Public virtual Property TableStyle() As ObjectId
 Возвращает
 Возвращает ObjectId текущего табличного стиля данной таблицы.
 Описание
 Данное свойство предоставляет доступ к идентификатору ObjectId объекта TableStyle, на который ссылается объект Table.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!