Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObject.Database
 Послать отзыв
 Свойство предоставляет доступ к базе данных, в которой хранится данный объект.
 Синтаксис
C#
Visual Basic
Копировать Код
public Database Database;
Копировать Код
Public Property Database() As Database
 Возвращает
 Возвращает базу данных, используемую объектом. Тип Database.
 Описание
 Свойство предоставляет доступ к базе данных, в которой хранится данный объект.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.DBObject, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!