Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 DimStyleTableRecord.Dimaltz
 Послать отзыв
 Свойство предназначено для настройки подавления нулей в альтернативных измерениях в размерах.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual int Dimaltz { get; set; }
Копировать Код
Public Overridable Property Dimaltz As Integer
 Возвращает
 Возвращает тип данных int.
 Возвращаемые значения
 Возвращаемые значения
 Описание
 0
 подавление ноль футов и ровно ноль дюймов, ведущие и конечные десятичные нули не подавляются (значение по умолчанию)
 1
 включение ноль футов и ровно ноль дюймов, ведущие и конечные десятичные нули не подавляются
 2
 включение ноль футов и подавление ровно ноль дюймов, ведущие и конечные десятичные нули не подавляются
 3
 подавление ноль футов и включение ровно ноль дюймов, ведущие и конечные десятичные нули не подавляются
 4
 подавление ведущих десятичных нулей
 8
 подавление конечных десятичных нулей
 12
 подавление начальных и конечных десятичных нулей
 Описание
 В свойстве хранится настройка подавления нулей в альтернативных измерениях в размерах. В качестве значений свойства доступны следующие целые числа:
0 – подавление ноль футов и ровно ноль дюймов, ведущие и конечные десятичные нули не подавляются (значение по умолчанию);
1 – включение ноль футов и ровно ноль дюймов, ведущие и конечные десятичные нули не подавляются;
2 – включение ноль футов и подавление ровно ноль дюймов, ведущие и конечные десятичные нули не подавляются;
3 – подавление ноль футов и включение ровно ноль дюймов, ведущие и конечные десятичные нули не подавляются;
4 – подавление ведущих десятичных нулей;
8 – подавление конечных десятичных нулей;
12 – подавление начальных и конечных десятичных нулей.
 Первые три значения свойства влияют только если в чертеже установлены измерения в дюймах, последние три – если в чертеже установлены измерения в миллиметрах.
 Примеры:
«Подавление ведущих десятичных нулей»: было без подавления 0,005 – стало ,005;
«Подавление конечных десятичных нулей»: было без подавления 0,5000 – стало 0,5;
«Подавление начальных и конечных десятичных нулей»: было без подавления 0,5000 – стало ,5.
 Свойство также доступно через системную переменную DIMALTZ и пользовательское меню в окне изменения/создания размерного стиля:
  При изменении системной переменной DIMALTZ будет создан новый размерный стиль под названием <переопределение> на основе текущего с новым значением DIMALTZ.
 Условия
 Чтение и запись.
 Пример
 В качестве примера работы со свойством Dimaltz можно рассмотреть пример, приведенный в описании свойства Dimzin, заменив в нем Dimzin на Dimaltz и добавив проверку признака отображения альтернативных измерений (значения свойства Dimalt) с изменением его на true (включить отображение альтернативных измерений), если оно равно false (отображение альтернативных измерений отключено).
 Ссылки
 Teigha.DatabaseServices.DimStyleTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!