Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CurveBoundary.IsDegenerate
 Послать отзыв
 Свойство IsDegenerate позволяет проверить тот факт, что граница кривой состоит из одного элемента и вырождена в одну точку трехмерного пространства.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsDegenerate;
Копировать Код
Public ReadOnly Property IsDegenerate As Boolean
 Возвращает
 Возвращает true, если граница кривой состоит из одного элемента и вырождена в одну точку трехмерного пространства. В противном случае возвращает false.
 Описание
 Свойство IsDegenerate позволяет проверить тот факт, что граница кривой состоит из одного элемента и вырождена в одну точку трехмерного пространства.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.CurveBoundary, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!