Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор BeginWblockObjectsEventArgs.BeginWblockObjectsEventArgs
 Послать отзыв
 This is BeginWblockObjectsEventArgs, a member of class BeginWblockObjectsEventArgs.
 Синтаксис
C#
Visual Basic
internal BeginWblockObjectsEventArgs(ref Database from, ref DatabaseServices::IdMapping idmapping);
Friend Sub New(ByRef from As Database, ByRef idmapping As DatabaseServices.IdMapping)
 Ссылки
 Teigha.DatabaseServices.BeginWblockObjectsEventArgs, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!