Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Point3AngularDimension.Point3AngularDimension
 Послать отзыв
 Конструктор класса Point3AngularDimension.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3AngularDimension( Point3d centerPoint, Point3d line1Point, Point3d line2Point, Point3d arcPoint, ref String dimensionText, DatabaseServices.ObjectId dimensionStyle );
Копировать Код
Public Sub New( centerPoint As Point3d, line1Point As Point3d, line2Point As Point3d, arcPoint As Point3d, ByRef dimensionText As String, dimensionStyle As DatabaseServices.ObjectId )
 Параметры
 Параметры
 Описание
 centerPoint
 Точка вершины измеряемого угла. Тип Point3d.
 line1Point
 Начальная точка первой выносной линии. Тип Point3d.
 line2Point
 Начальная точка второй выносной линии. Тип Point3d.
 arcPoint
 Точка, лежащая на размерной дуге. Тип Point3d.
 dimensionText
 Размерный текст для замены текста измеренного значения. Тип String.
 dimensionStyle
 Идентификатор ObjectId размерного стиля, который следует использовать для отрисовки данного размера. Тип DatabaseServices.ObjectId.
.
 Описание
 Конструктор класса Point3AngularDimension. Создает новый объект с указанными параметрами.
 Ссылки
 Teigha.DatabaseServices.Point3AngularDimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!