Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FillStyle
 Послать отзыв
 Перечисление FillStyle определяет стиль заливки замкнутых областей.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum FillStyle { FsSolid = 64, FsCheckerboard = 65, FsCrosshatch = 66, FsDiamonds = 67, FsHorizontalBars = 68, FsSlantLeft = 69, FsSlantRight = 70, FsSquareDots = 71, FsVerticalBars = 72, FsUseObject = 73, FsLast = 73 }
Копировать Код
Public Enum FillStyle FsSolid = 64 FsCheckerboard = 65 FsCrosshatch = 66 FsDiamonds = 67 FsHorizontalBars = 68 FsSlantLeft = 69 FsSlantRight = 70 FsSquareDots = 71 FsVerticalBars = 72 FsUseObject = 73 FsLast = 73 End Enum
 Члены
 Члены
 Описание
 FsSolid
 Значение: 64. Сплошная заливка замкнутой фигуры одним цветом без каких-либо узоров или текстур.
 FsCheckerboard
 Значение: 65. Заливка замкнутой области квадратами двух цветов в шахматном порядке (шахматная доска).
 FsCrosshatch
 Значение: 66. Штриховка замкнутой области линиями, пересекающимися под прямым углом.
 FsDiamonds
 Значение: 67. Заполнение замкнутой области повторяющимся узором из ромбов (алмазов), расположенных в узлах сетки.
 FsHorizontalBars
 Значение: 68. Заполнение замкнутой области параллельными горизонтальными полосами.
 FsSlantLeft
 Значение: 69. Штриховка замкнутой области параллельными линиями с наклоном влево.
 FsSlantRight
 Значение: 70. Штриховка замкнутой области параллельными линиями с наклоном вправо.
 FsSquareDots
 Значение: 71. Заполнение замкнутой области узором из равномерно распределенных квадратных точек.
 FsVerticalBars
 Значение: 72. Заполнение замкнутой области параллельными вертикальными полосами.
 FsUseObject
 Значение: 73. Стиль заливки замкнутой области определяется свойствами предоставленного объекта. Полезно при работе с объектами, имеющими собственные стили заливки.
 FsLast
 Значение: 73. Стиль заливки замкнутой области определяется последним использованным стилем заливки.
 Описание
 Перечисление FillStyle определяет стиль заливки замкнутых геометрических областей.
 Ваши комментарии по поводу этого топика: Послать отзыв!