Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AuditInfo.AuditPass
 Послать отзыв
 Свойство возвращает текущий проход аудита как значение из перечисления DatabaseServices.AuditPass.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.AuditPass AuditPass;
Копировать Код
Public Property AuditPass() As DatabaseServices.AuditPass
 Возвращает
 Возвращает текущий проход аудита как значение из перечисления DatabaseServices.AuditPass.
 Описание
 Свойство возвращает текущий проход аудита как значение из перечисления DatabaseServices.AuditPass. По каждому объекту аудит выполняется в два прохода.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.AuditInfo, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!