Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SubDMesh.SubdDivideDown
 Послать отзыв
 Метод уменьшает степень сглаженности сети на единицу.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SubdDivideDown();
Копировать Код
Public Sub SubdDivideDown()
 Описание
 Метод уменьшает степень сглаженности сети на единицу.
 Ссылки
 Teigha.DatabaseServices.SubDMesh, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!