Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.RenderSettings.PreviewImageFileName
 Послать отзыв
 Свойство PreviewImageFileName представляет полное имя файла изображения предварительного просмотра для данного объекта RenderSettings.
 Синтаксис
C#
Visual Basic
Копировать Код
public String PreviewImageFileName;
Копировать Код
Public Property PreviewImageFileName As String
 Возвращает
 Возвращает полное имя файла изображения. Тип String.
 Описание
 Свойство PreviewImageFileName представляет полное имя файла изображения предварительного просмотра для данного объекта RenderSettings.
 Если значение свойства представляет собой пустую строку, значит изображение предварительного просмотра не определено. По умолчанию PreviewImageFileName не задано.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.RenderSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!