Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.RenderSettings.TextureSampling
 Послать отзыв
 Свойство TextureSampling позволяет определить, включена ли выборка (фильтрация) текстур для изображения.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool TextureSampling;
Копировать Код
Public Property TextureSampling As Boolean
 Возвращает
 Возвращает true, если фильтрация текстур включена. В противном случае возвращает false.
 Описание
 Свойство TextureSampling позволяет определить, включена ли выборка (фильтрация) текстур для изображения.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.RenderSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!