Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DataLink.ToolTip
 Послать отзыв
 Свойство предоставляет доступ к строке подсказки связи с данными.
 Синтаксис
C#
Visual Basic
Копировать Код
public String ToolTip;
Копировать Код
Public Property ToolTip() As String
 Возвращает
 Возвращает строку подсказки. Тип String.
 Описание
 Свойство предоставляет доступ к строке подсказки связи с данными.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.DataLink, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!