Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SubentityOverrule.MoveGripPointsAtSubentPaths
 Послать отзыв
 Данный метод переопределяет метод Entity.MoveGripPointsAtSubentityPaths() и вызывает его в случае реализации по умолчанию.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void MoveGripPointsAtSubentPaths( ref Entity entity, ref FullSubentityPath[] path, ref GripDataCollection grips, Vector3d offset, MoveGripPointsFlags bitFlags );
Копировать Код
Public virtual Sub MoveGripPointsAtSubentPaths( ByRef entity As Entity, ByRef path As FullSubentityPath[], ByRef grips As GripDataCollection, offset As Vector3d, bitFlags As MoveGripPointsFlags )
 Параметры
 Параметры
 Описание
 entity
 Объект чертежа, тип Entity.
 path
 Массив полных путей объектов, идентифицирующих подобъекты, которые подлежат перемещению. Тип FullSubentityPath[].
 grips
 Массив указателей на ручки, которые подлежат перемещению. Тип GripDataCollection.
 offset
 Вектор, определяющий направление и величину перемещения ручек. Тип Vector3d.
 bitFlags
 Маска из одного или нескольких флагов из перечисления MoveGripPointsFlags.
 Описание
 Данный метод переопределяет метод Entity.MoveGripPointsAtSubentityPaths() и вызывает его в случае реализации по умолчанию. Метод Entity.MoveGripPointsAtSubentityPaths() в реализации по умолчанию перемещает ручки подобъектов на заданный вектор. Метод MoveGripPointsAtSubentPaths() настоящего класса позволяет переопределить этот механизм.
 Ссылки
 Teigha.DatabaseServices.SubentityOverrule, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!