Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Matrix3d.CoordinateSystem3d
 Послать отзыв
 Свойство выполняет приведение данной матрицы к типу Geometry.CoordinateSystem3d, который представляет систему координат.
 Синтаксис
C#
Visual Basic
Копировать Код
public Geometry.CoordinateSystem3d CoordinateSystem3d;
Копировать Код
Public Property CoordinateSystem3d() As Geometry.CoordinateSystem3d
 Возвращает
 Возвращает систему координат как объект Geometry.CoordinateSystem3d.
 Описание
 Свойство выполняет приведение данной матрицы к типу Geometry.CoordinateSystem3d, который представляет систему координат с началом и осями xAxis, yAxis и zAxis.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.Matrix3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!