Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Group.IsAnonymous
 Послать отзыв
 Свойство позволяет определить, является ли данная группа анонимной.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsAnonymous;
Копировать Код
Public ReadOnly Property IsAnonymous As Boolean
 Возвращает
 Возвращает true, если данная группа является анонимной. В противном случае возвращает false.
 Описание
 Свойство позволяет определить, является ли данная группа анонимной.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Group, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!