Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DataTable.InsertRowAt
 Послать отзыв
 Метод вставляет в таблицу заданную строку перед строкой с указанным индексом. Дополнительно метод позволяет проверить ячейки строки на соответствие структуре таблицы.
 Синтаксис
C#
Visual Basic
Копировать Код
public void InsertRowAt( int index, ref DataCellCollection row, bool validate );
Копировать Код
Public Sub InsertRowAt( index As Integer, ByRef row As DataCellCollection, validate As Boolean )
 Параметры
 Параметры
 Описание
 index
 Индекс строки, перед которой вставляется новая строка. Тип int. В случае недействительного индекса выбрасывается исключение Teigha.Runtime.ErrorStatus.eInvalidInput.
 row
 Вставляемая строка. Тип DataCellCollection.
 validate
 Флаг проверки. Тип bool. В текущей версии не используется. Если в ходе проверки обнаружены ошибки, выбрасывается исключение Teigha.Runtime.ErrorStatus.eInvalidInput.
 Описание
 Метод вставляет в таблицу заданную строку перед строкой с указанным индексом.
 Параметр validate указывает, следует ли при добавлении строки выполнять проверку. Если validate имеет значение true, этот метод проверяет ячейки строки на соответствие столбцам таблицы по типам столбцов и их количеству.
 Ссылки
 Teigha.DatabaseServices.DataTable, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!