Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ObjectOverrule.SetNoFilter
 Послать отзыв
 Метод отключает использование любых методов предварительной фильтрации объектов перед вызовом переопределений (SetCustomFilter, SetExtensionDictionaryEntryFilter, SetIdFilter, SetXDataFilter, а также IsApplicable).
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetNoFilter();
Копировать Код
Public Sub SetNoFilter()
 Описание
 Метод отключает использование любых методов предварительной фильтрации объектов перед вызовом переопределений (SetCustomFilter, SetExtensionDictionaryEntryFilter, SetIdFilter, SetXDataFilter, а также IsApplicable).
 Ссылки
 Teigha.DatabaseServices.ObjectOverrule, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!