Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Событие Database.XrefSubCommandAborted
 Послать отзыв
 Синтаксис
C#
Visual Basic
public event XrefSubCommandAbortedEventHandler XrefSubCommandAborted;
Public Event XrefSubCommandAborted As XrefSubCommandAbortedEventHandler
 Описание
 Событие посылается, если подкоманда внешней ссылки снята во время вызова xrefSubCommandStart().
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!