Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.HostApplicationServices.VersionString
 Послать отзыв
 Свойство возвращает строку с основной и дополнительной версиями релиза.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual String VersionString;
Копировать Код
Public Overridable ReadOnly Property VersionString As String
 Возвращает
 Возвращает строку с основной и дополнительной версиями релиза. Тип String.
 Описание
 Свойство возвращает строку с основной и дополнительной версиями релиза.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.HostApplicationServices, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!