Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocDependency.DetachFromObject
 Послать отзыв
 Метод позволяет открепить данную зависимость от объекта DBObject, к которому она в данный момент прикреплена.
 Синтаксис
C#
Visual Basic
Копировать Код
public void DetachFromObject();
Копировать Код
Public Sub DetachFromObject()
 Описание
 Метод позволяет открепить данную зависимость от объекта DBObject, к которому она в данный момент прикреплена. Зависимость удаляется из списка постоянных реакторов объекта. Если этот объект является составным, зависимость удаляется из списков постоянных реакторов всех составляющих объектов, к которым она в данный момент прикреплена.
 Ссылки
 Teigha.DatabaseServices.AssocDependency, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!