Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Sphere.GetAnglesInV
 Послать отзыв
 Метод предоставляет текущий диапазон изменения параметра v.
 Синтаксис
C#
Visual Basic
Копировать Код
public double[] GetAnglesInV();
Копировать Код
Public Function GetAnglesInV() As Double()
 Возвращает
 Возвращает двухэлементный массив. Тип double[]. Элемент с индексом 0 соответствует начальному углу, а элемент с индексом 1 - конечному углу для параметра v.
 Описание
 Метод предоставляет текущий диапазон изменения параметра v.
 Ссылки
 Teigha.Geometry.Sphere, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!