Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MeshPointMaps.SourcePonints
 Послать отзыв
 Свойство SourcePonints представляет коллекцию исходных точек.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point2dCollection SourcePonints;
Копировать Код
Public Property SourcePonints As Point2dCollection
 Возвращает
 Возвращает коллекцию исходных точек. Тип Point2dCollection.
 Описание
 Свойство SourcePonints представляет коллекцию исходных точек.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MeshPointMaps, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!