Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CircularArc2d.CircularArc2d
 Послать отзыв
 Конструктор класса CircularArc2d. Создает круглую дугу с указанными центром, радиусом, начальным и конечным углами.
 Синтаксис
C#
Visual Basic
Копировать Код
public CircularArc2d( Point2d center, double radius, double startAngle, double endAngle, Vector2d referenceVector, bool isClockWise );
Копировать Код
Public Sub New( center As Point2d, radius As Double, startAngle As Double, endAngle As Double, referenceVector As Vector2d, isClockWise As Boolean )
 Параметры
 Параметры
 Описание
 center
 Центр дуги. Тип Point2d.
 radius
 Радиус дуги. Тип double.
 startAngle
 Начальный угол дуги. Тип double.
 endAngle
 Конечный угол дуги. Тип double.
 referenceVector
 Опорный вектор, определяющий направление начала отсчета углов дуги (направление нулевого угла). Тип Vector2d.
 isClockWise
 Флаг, определяющий, что дуга строится по часовой стрелке. Тип bool.
 Описание
 Конструктор класса CircularArc2d. Создает круглую дугу с указанными центром, радиусом, начальным и конечным углами. Кроме того, можно настроить направление, от которого будут отсчитываться углы, а также задать направление самой дуги (по часовой стрелке или против).
 Замечания
 Все углы выражены в радианах. Если задать endAng = startAng + 2*PI, будет построена полная окружность. Начальный угол должен быть меньше конечного угла.
 Ссылки
 Teigha.Geometry.CircularArc2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!