Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.HyperLinkCollection.Remove
 Послать отзыв
 Метод предназначен для удаления из коллекции гиперссылки, соответствующей указанному объекту HyperLink.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Remove( ref HyperLink value );
Копировать Код
Public Sub Remove( ByRef value As HyperLink )
 Параметры
 Параметры
 Описание
 value
 Удаляемая из коллекции гиперссылка. Тип HyperLink.
 Описание
 Метод предназначен для удаления из коллекции гиперссылки, соответствующей указанному объекту HyperLink.
 Ссылки
 Teigha.DatabaseServices.HyperLinkCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!