Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.SetColumnWidth
 Послать отзыв
 Метод позволяет задать новое значение ширины столбцу с заданным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetColumnWidth( int col, double width );
Копировать Код
Public virtual Sub SetColumnWidth( col As Integer, width As double )
 Параметры
 Параметры
 Описание
 col
 Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
 width
 Новое значение ширины указанного столбца. Тип double.
 Описание
 Метод позволяет задать новое значение ширины столбцу с заданным индексом.
 Замечания
 Для получения того же результата предпочтительнее использовать Table.Columns[col].Width.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!