Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Matrix2dBuilder.ToMatrix2d
 Послать отзыв
 Метод предоставляет двумерную матрицу, связанную с данным объектом.
 Синтаксис
C#
Visual Basic
Копировать Код
public Matrix2d ToMatrix2d();
Копировать Код
Public Function ToMatrix2d() As Matrix2d
 Возвращает
 Возвращает двумерную матрицу, связанную с данным объектом. Тип Matrix2d.
 Описание
 Метод предоставляет двумерную матрицу, связанную с данным объектом.
 Ссылки
 Teigha.Geometry.Matrix2dBuilder, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!