Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocEvaluationCallback.DeleteUnmanagedObject
 Послать отзыв
 Метод удаляет указатель на неуправляемый объект.
 Синтаксис
C#
Visual Basic
Копировать Код
public void DeleteUnmanagedObject();
Копировать Код
Public Sub DeleteUnmanagedObject()
 Описание
 Метод удаляет указатель на неуправляемый объект.
 Ссылки
 Teigha.DatabaseServices.AssocEvaluationCallback, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!