Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.ContentColor
 Послать отзыв
 Метод предназначен для получения цвета содержимого в строках заданного типа.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual Color ContentColor( RowType type );
Копировать Код
Public virtual Function ContentColor( type As RowType ) As Color
 Параметры
 Параметры
 Описание
 type
 Тип строки из перечисления RowType.
 Возвращает
 Возвращает цвет содержимого ячеек в строке указанного типа. Тип Color.
 Описание
 Метод предназначен для получения цвета содержимого в строках заданного типа. Возможные значения типа строки: DataRow, TitleRow и HeaderRow. Если тип строки не указан, будет использоваться значение по умолчанию DataRow.
 Замечания
 Для получения того же результата предпочтительнее использовать функционал объекта Cell.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!