Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Pdsize
 Послать отзыв
 Синтаксис
C#
Visual Basic
public double Pdsize;
Public Property Pdsize() As Double
 Описание
 Возвращает или устанавливает текущее значение PDSIZE для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!