Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotSettingsValidator.SetDefaultPlotConfig
 Послать отзыв
 Метод применяет параметры настроек печати по умолчанию к указанному объекту PlotSettings.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetDefaultPlotConfig( ref PlotSettings plotSet );
Копировать Код
Public Sub SetDefaultPlotConfig( ByRef plotSet As PlotSettings )
 Параметры
 Параметры
 Описание
 plotSet
 Входной объект PlotSettings с настройками печати.
 Описание
 Метод применяет параметры настроек печати по умолчанию к указанному объекту PlotSettings.
 Ссылки
 Teigha.DatabaseServices.PlotSettingsValidator, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!