Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.OsnapPointRef.XrefHandles
 Послать отзыв
 Свойство XrefHandles представляет массив дескрипторов для основного геометрического объекта внешней ссылки.
 Синтаксис
C#
Visual Basic
Копировать Код
public Handle[] XrefHandles;
Копировать Код
Public Property XrefHandles As Handle()
 Возвращает
 Возвращает массив дескрипторов для основного геометрического объекта внешней ссылки. Тип Handle[].
 Описание
 Свойство XrefHandles представляет массив дескрипторов для основного геометрического объекта внешней ссылки.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.OsnapPointRef, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!