Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FileDependencyInfo.TimeStamp
 Послать отзыв
 Свойство TimeStamp представляет временную метку (в секундах с даты 01.01.1980).
 Синтаксис
C#
Visual Basic
Копировать Код
public int TimeStamp;
Копировать Код
Public ReadOnly Property TimeStamp As Integer
 Возвращает
 Возвращает временную метку файла в секундах. Тип int.
 Описание
 Свойство TimeStamp представляет временную метку файла как количество секунд, прошедших с даты 01.01.1980.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.FileDependencyInfo, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!