Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SectionManager.GetUniqueSectionName
 Послать отзыв
 Метод позволяет получить уникальное имя секущей плоскости.
 Синтаксис
C#
Visual Basic
Копировать Код
public String GetUniqueSectionName( ref String pszBaseName );
Копировать Код
Public Function GetUniqueSectionName( ByRef pszBaseName As String ) As String
 Параметры
 Параметры
 Описание
 pszBaseName
 Базовое имя секущей плоскости. Тип String.
 Возвращает
 Возвращает уникальное имя секущей плоскости. Тип String.
 Описание
 Метод позволяет получить уникальное имя секущей плоскости.
 Ссылки
 Teigha.DatabaseServices.SectionManager, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!