Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MTextFragment.GetUnderLinePoints
 Послать отзыв
 Метод возвращает массив из двух точек, определяющих линию подчёркивания текста, если таковая используется.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d[] GetUnderLinePoints();
Копировать Код
Public Function GetUnderLinePoints() As Point3d()
 Возвращает
 Возвращает массив из двух точек, которые определяют линию подчёркивания. Тип Point3d[].
 Описание
 Метод возвращает массив из двух точек, определяющих линию подчёркивания текста, если таковая используется.
 Ссылки
 Teigha.DatabaseServices.MTextFragment, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!