Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.TransactionManager.GetAllObjects
 Послать отзыв
 Метод выполняет поиск всех существующих на данный момент объектов транзакции и возвращает коллекцию с указателями на все найденные объекты.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual DBObjectCollection GetAllObjects();
Копировать Код
Public virtual Function GetAllObjects() As DBObjectCollection
 Возвращает
 Возвращает коллекцию идентификаторов резидентных в транзакции объектов. Тип DBObjectCollection.
 Описание
 Метод выполняет поиск всех существующих на данный момент объектов транзакции и возвращает коллекцию с указателями на все найденные объекты.
 Ссылки
 Teigha.DatabaseServices.TransactionManager, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!