Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SubDMesh.SetDragStatus
 Послать отзыв
 Метод вызывается, когда начинается, завершается или прерывается операция перетаскивания, в которой задействован данный объект.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetDragStatus( DragStatus status );
Копировать Код
Public Sub SetDragStatus( status As DragStatus )
 Параметры
 Параметры
 Описание
 status
 Статус операции перетаскивания. Принимает значения из перечисления Dragstart.
 Описание
 Метод вызывается, когда начинается, завершается или прерывается операция перетаскивания, в которой задействован данный объект. Аргумент status предоставляет информацию о том, что происходит с операцией перетаскивания.
 Ссылки
 Teigha.DatabaseServices.SubDMesh, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!