Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Light.IlluminanceDistance
 Послать отзыв
 Свойство представляет дальность освещения для данного источника света.
 Синтаксис
C#
Visual Basic
Копировать Код
public double IlluminanceDistance;
Копировать Код
Public Property IlluminanceDistance As Double
 Возвращает
 Возвращает дальность освещения. Тип double.
 Описание
 Свойство представляет дальность освещения для данного источника света. Имеет смысл при условии, что свойству Light.PhysicalIntensity присвоено значение Illuminance.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Light, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!