Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ArcDimension.ArcDimension
 Послать отзыв
 Основной конструктор.
 Синтаксис
C#
Visual Basic
Копировать Код
public ArcDimension( Point3d centerPoint, Point3d xLine1Point, Point3d xLine2Point, Point3d arcPoint, ref String dimensionText, DatabaseServices.ObjectId dimensionStyle );
Копировать Код
Public Sub New( centerPoint As Point3d, xLine1Point As Point3d, xLine2Point As Point3d, arcPoint As Point3d, ByRef dimensionText As String, dimensionStyle As DatabaseServices.ObjectId )
 Параметры
 Параметры
 Описание
 centerPoint
 Центр дуги. Тип Point3d.
 xLine1Point
 Начальная точка первой выносной линии. Тип Point3d.
 xLine2Point
 Начальная точка второй выносной линии. Тип Point3d.
 arcPoint
 Точка, лежащая на размерной дуге. Тип Point3d.
 dimensionText
 Текст, заменяющий текстовое представление измеренного значения. Тип String.
 dimensionStyle
 ObjectId размерного стиля, который используется для отображения данного углового размера. Тип DatabaseServices.ObjectId.
 Описание
 Основной конструктор.
 Ссылки
 Teigha.DatabaseServices.ArcDimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!