Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Surface.ParameterOf
 Послать отзыв
 Метод вычисляет параметрическую точку (U, V), которая в параметрическом пространстве поверхности представляет указанную 3D-точку на поверхности в пространстве моделирования. Используется заданная геометрическая точность.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point2d ParameterOf( Point3d point, Tolerance tolerance );
Копировать Код
Public Function ParameterOf( point As Point3d, tolerance As Tolerance ) As Point2d
 Параметры
 Параметры
 Описание
 point
 Входная точка на поверхности, для которой требуется вычислить соответствующую параметрическую 2D-точку. Тип Point3d.
 tolerance
 Входная геометрическая точность. Тип Tolerance.
 Возвращает
 Возвращает 2D-точку в параметрическом пространстве, которая соответствует входной 3D-точке point в пространстве моделирования. Тип Point2d.
 Описание
 Метод вычисляет параметрическую точку (U, V), которая в параметрическом пространстве поверхности представляет указанную 3D-точку на поверхности в пространстве моделирования. Используется геометрическая точность tolerance.
 Замечания
 Входная точка point обязана находиться на данной поверхности. Чтобы в этом убедиться, используйте метод IsOn().
 Ссылки
 Teigha.Geometry.Surface, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!