Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Filters.SpatialFilter.SetPerspectiveCamera
 Послать отзыв
 Метод позволяет задать положение перспективной камеры в указанной 3D-точке.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetPerspectiveCamera( Point3d fromPoint );
Копировать Код
Public Sub SetPerspectiveCamera( fromPoint As Point3d )
 Параметры
 Параметры
 Описание
 fromPoint
 Точка установки перспективной камеры. Тип Point3d.
 Описание
 Метод позволяет задать положение перспективной камеры в 3D-точке, переданной аргументом fromPoint.
 Ссылки
 Teigha.DatabaseServices.Filters.SpatialFilter, Teigha.DatabaseServices.Filters
 Ваши комментарии по поводу этого топика: Послать отзыв!