Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LinkedData.Name
 Послать отзыв
 Свойство представляет наименование связываемых данных.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual String Name;
Копировать Код
Public Overridable Property Name As String
 Возвращает
 Возвращает наименование данных. Тип String.
 Описание
 Свойство представляет наименование связываемых данных.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.LinkedData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!