Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DataCellCollection
 Послать отзыв
 Класс представляет коллекцию объектов типа DataCell.
 Иерархия классов
Teigha::DatabaseServices::DataCellCollection
 Синтаксис
C#
Visual Basic
Копировать Код
[DefaultMember("Item")] [Wrapper("OdDbDataCellArray")] public class DataCellCollection : DisposableWrapper, Collections.IList;
Копировать Код
<DefaultMember("Item")> <Wrapper("OdDbDataCellArray")> Public Class DataCellCollection Inherits DisposableWrapper Inherits Collections.IList
 Описание
 Класс представляет коллекцию объектов типа DataCell.
 Методы
 Конструкторы
 Имя
 Описание
 DataCellCollection
 Это обзор перегрузок DataCellCollection.
 Топики
 Имя
 Описание
 DataCellCollection Методы
 Ниже перечислены методы класса DataCellCollection.
 DataCellCollection Свойства
 Ниже перечислены свойства класса DataCellCollection.
 Ссылки
 DataCellCollection Конструктор, DataCellCollection Методы, DataCellCollection Свойства, Методы, Топики, DataCellCollection Методы, DataCellCollection Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!