Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.OffsetCurve3d.OffsetCurve3d
 Послать отзыв
 Конструктор класса OffsetCurve3d. Создает кривую, которая является точным смещением на заданное расстояние указанной базовой кривой, располагающейся в указанной плоскости.
 Синтаксис
C#
Visual Basic
Копировать Код
public OffsetCurve3d( ref Curve3d baseCurve, Vector3d planeNormal, double offsetDistance );
Копировать Код
Public Sub New( ByRef baseCurve As Curve3d, planeNormal As Vector3d, offsetDistance As Double )
 Параметры
 Параметры
 Описание
 baseCurve
 Плоская базовая кривая. Тип Curve3d.
 planeNormal
 Нормаль плоскости, в которой лежит базовая кривая. Тип Vector3d.
 offsetDistance
 Величина смещения(со знаком). Тип double.
 Описание
 Конструктор класса OffsetCurve3d. Создает кривую, которая является точным смещением указанной базовой кривой. Направление смещения определяется знаком параметра offsetDistance и направлением planeNormal. Базовая кривая должна быть плоской, а вектор planeNormal должен быть перпендикулярен плоскости базовой кривой.
 Из этого правила есть два исключения:
Если расстояние смещения равно 0, то planeNormal может быть любым вектором, включая нулевой вектор (в случае нулевого смещения он не используется).
Если базовая кривая линейна, то вектор planeNormal должен быть перпендикулярен линии кривой.
 Ссылки
 Teigha.Geometry.OffsetCurve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!