Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 ViewportTableRecord.GridFollow
 Послать отзыв
 Свойство предназначено для управления следованием сетки за динамической системой координат.
 Синтаксис
C#
Visual Basic
public bool GridFollow;
Public Property GridFollow() As bool
 Возвращает
 Возвращает тип данных bool:
true – следование сетки ПСК включено;
false – следование сетки ПСК отключено.
 Описание
 С помощью свойства можно отключить или включить следование сетки за динамической системой координат. В интерфейсе свойство настраивается через диалоговое окно «Режимы черчения» для каждого видового экрана отдельно. Окно «Режимы черчения» можно открыть либо командой DDRMODES, DDSETTINGS, либо через меню Сервис -> Режимы черчения…
 Условия
 Чтение и запись.
 Ссылки
 ViewportTableRecord Класс, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!