Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.GridVisibility
 Послать отзыв
 Метод позволяет определить видимость сетки для заданного типа линий сетки и для конкретного типа строки объекта таблицы.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual bool GridVisibility( GridLineType gridlineType, RowType type );
Копировать Код
Public virtual Function GridVisibility( gridlineType As GridLineType, type As RowType ) As Boolean
 Параметры
 Параметры
 Описание
 gridlineType
 Тип линии сетки из перечисления GridLineType.
 type
 Тип строки из перечисления RowType.
 Возвращает
 Возвращает true, если видимость включена, и false в противном случае.
 Описание
 Метод позволяет определить видимость сетки для заданного типа линий сетки и для конкретного типа строки объекта таблицы. Допустимые типы линий сетки и типы строк задаются перечислениями GridLineType и RowType, соответственно.
 Замечания
 Для получения того же результата предпочтительнее использовать функционал объекта Cell.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!