Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CircularArc3d.IntersectWith
 Послать отзыв
 Метод позволяет найти точки пересечения этой дуги с указанной плоскостью.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d[] IntersectWith( ref PlanarEntity plane );
Копировать Код
Public Function IntersectWith( ByRef plane As PlanarEntity ) As Point3d()
 Параметры
 Параметры
 Описание
 plane
 Плоскость, с которой требуется найти точки пересечения данной дуги. Тип PlanarEntity.
 Возвращает
 Возвращает массив точек пересечения дуги и плоскости. Тип Point3d[].
 Описание
 Метод позволяет найти точки пересечения этой дуги с указанной плоскостью. Используется вызов метода CircularArc3d.IntersectWith(PlanarEntity plane, Tolerance permit) с точностью, равной Tolerance.Global.
 Ссылки
 Teigha.Geometry.CircularArc3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!