Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Point3d.X
 Послать отзыв
 Свойство, представляющее координату X данной точки.
 Синтаксис
C#
Visual Basic
Копировать Код
public double X;
Копировать Код
Public Property X() As Double
 Возвращает
 Возвращает координату X данной точки.Тип double.
 Описание
 Свойство, представляющее координату X данной точки.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.Point3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!