Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Interval.IsEqualAtLower
 Послать отзыв
 Метод проверяет, совпадает ли нижняя граница данного интервала с указанным значением в пределах заданной точности.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsEqualAtLower( double value );
Копировать Код
Public Function IsEqualAtLower( value As Double ) As Boolean
 Параметры
 Параметры
 Описание
 value
 Проверяемое значение. Тип double.
 Возвращает
 Возвращает true, если данный интервал ограничен снизу, и его нижняя граница равна значению value в пределах заданной в данном объекте точности определения границ. В противном случае возвращает false.
 Описание
 Метод проверяет, совпадает ли нижняя граница данного интервала с указанным значением в пределах заданной точности.
 Ссылки
 Teigha.Geometry.Interval, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!