Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.TextStringConst
 Послать отзыв
 Метод позволяет получить копию нуль-терминированной текстовой строки, хранящейся в указанной ячейке.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual String TextStringConst( int row, int col );
Копировать Код
Public virtual Function TextStringConst( row As Integer, col As Integer ) As String
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 col
 Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
 Возвращает
 Возвращает нуль-терминированную строку, тип String.
 Описание
 Метод позволяет получить копию нуль-терминированной текстовой строки, хранящейся в указанной ячейке.
 Замечания
 Для получения того же результата предпочтительнее использовать Table.Cells[row,column].TextString.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!