Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LinkedTableData.InsertColumn
 Послать отзыв
 Метод вставляет в данную таблицу указанное количество столбцов по указанному индексу столбца.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual int InsertColumn( int index, int columnsNumber );
Копировать Код
Public Overridable Function InsertColumn( index As Integer, columnsNumber As Integer ) As Integer
 Параметры
 Параметры
 Описание
 index
 Индекс столбца, по которому вставляются новые столбцы. Тип int.
 columnsNumber
 Количество вставляемых столбцов. Тип int.
 Возвращает
 Возвращает начальный индекс вставленных столбцов. Тип int.
 Описание
 Метод вставляет в данную таблицу указанное количество столбцов по указанному индексу столбца.
 Замечания
 Метод выбрасывает исключение eInvalidInput, если значение columnsNumber окажется не положительным.
 Ссылки
 Teigha.DatabaseServices.LinkedTableData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!