Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 DimStyleTableRecord.Dimcen
 Послать отзыв
 Свойство отвечает за настройку меток и линий центра дуг и окружностей при нанесении на них размера.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual double Dimcen { get; set; }
Копировать Код
Public Overridable Property Dimcen As Double
 Возвращает
 Возвращает тип данных double.
 Возвращаемые значения
 Возвращаемые значения
 Описание
 0
 при нанесении на окружность размера-диаметра или радиуса центральной метки и линий нет
 &lt;0
 при нанесении на окружность размера - диаметра или радиуса видны центральные метки и линии, число указывает их размер
 &gt;0
 при нанесении на окружность размера - диметра или радиуса видны только центральные линии, число указывает их размер
 Описание
 В свойстве хранится число double, которое определяет размер маркера центра при нанесении на окружность размера-диаметра. Возможны следующие значения:
0 – нет центральных меток и линий;
 (Dimcen = 0)
<0 – центральные метки и линии, число указывает их размер;
 (Dimcen = -3)
>0 – только центральные линии, число указывает их размер.
 (Dimcen = 3)
 Свойство также доступно через системную переменную DIMCEN и пользовательское меню в окне изменения/создания размерного стиля:
  При изменении системной переменной DIMCEN будет создан новый размерный стиль под названием <переопределение> на основе текущего с новым значением DIMCEN.
 Условия
 Чтение и запись.
 Пример
 Пример изменения настройки меток и линий центра дуг и окружностей (значения свойства Dimcen) в размерном стиле Standard:
C#
 Копировать Код
public partial class Commands { [Teigha.Runtime.CommandMethod("DimcenChange")] public void DimcenStandardDimStyle() { // Получение ссылки на активный документ HostMgd.ApplicationServices.Document doc = HostMgd.ApplicationServices.Application.DocumentManager.MdiActiveDocument; // Получение ссылки на редактор документа HostMgd.EditorInput.Editor ed = doc.Editor; // Получение ссылки на базу данных документа Teigha.DatabaseServices.Database db = doc.Database; // Начало транзакции с базой данных документа using (Teigha.DatabaseServices.Transaction trans = db.TransactionManager.StartTransaction()) { // Открываем таблицу размерных стилей для чтения Teigha.DatabaseServices.DimStyleTable dimStyleTable = trans.GetObject(db.DimStyleTableId, Teigha.DatabaseServices.OpenMode.ForRead) as Teigha.DatabaseServices.DimStyleTable; // Находим в таблице размерных стилей ObjectId нужного стиля по его названию Teigha.DatabaseServices.ObjectId styleId=dimStyleTable["Standard"]; // Открываем таблицу размерного стиля для изменений Teigha.DatabaseServices.DimStyleTableRecord obj = trans.GetObject(styleId, Teigha.DatabaseServices.OpenMode.ForWrite) as Teigha.DatabaseServices.DimStyleTableRecord; ed.WriteMessage($"nDimcen before: {obj.Dimcen}"); // Изменяем размер центральной метки obj.Dimcen = 3; ed.WriteMessage($"nDimcen after: {obj.Dimcen}"); trans.Commit(); } } }
 Результат работы команды DimcenChange:
 Было:
 Стало:
 Ссылки
 Teigha.DatabaseServices.DimStyleTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!