Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DataCellCollection.Clear
 Послать отзыв
 Метод очищает коллекцию от ее содержимого.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Clear();
Копировать Код
Public Sub Clear()
 Описание
 Метод очищает коллекцию от ее содержимого.
 Ссылки
 Teigha.DatabaseServices.DataCellCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!