Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 LayerTableRecord.PlotStyleName
 Послать отзыв
 В свойстве хранится название стиля печати, установленного в слое.
 Синтаксис
C#
Visual Basic
public String PlotStyleName;
Public Property PlotStyleName() As String
 Возвращает
 Возвращает тип данных string.
 Описание
 С помощью свойства можно получить название стиля печати, который используется в слое и изменить стиль печати, сохранив в свойстве название другого стиля печати.
 Стиль печати, установленный в слое, будет у всех объектов чертежа, расположенных на этом слое, если стиль печати этих объектов установлен в значение «По слою».
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.LayerTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!