Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Leader.AnnoHeight
 Послать отзыв
 Синтаксис
C#
Visual Basic
public double AnnoHeight;
Public Property AnnoHeight() As Double
 Описание
 Возвращает высоту аннотации.
 Если аннотация имеет тип MText (мультитекст), то возвращаемое значение является действительной высотой текста. Если аннотация имеет тип FeatureControlFrame, то возвращаемое значение представляет высоту ограничивающего прямоугольника. Для остальных типов аннотации возвращается значение 0.0.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.Leader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!