Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.KnotCollection
 Послать отзыв
 Класс KnotCollection представляет однородный узловой вектор сплайна как неубывающую последовательность действительных значений.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Geometry::KnotCollection
 Синтаксис
C#
Visual Basic
Копировать Код
[DefaultMember("Item")] [Wrapper("AcGeKnotVector")] public sealed class KnotCollection : DisposableWrapper, IList
Копировать Код
<DefaultMember("Item")> <Wrapper("AcGeKnotVector")> Public NotInheritable Class KnotCollection Inherits DisposableWrapper Implements IList
 Описание
 Класс KnotCollection представляет однородный узловой вектор сплайна как неубывающую последовательность равномерно распределенных действительных значений.
 Методы
 Конструкторы
 Teigha.Geometry.KnotCollection
 Имя
 Описание
 KnotCollection
 Конструктор по умолчанию класса KnotCollection.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Geometry.KnotCollection
 Имя
 Описание
 KnotCollection Методы
 Ниже перечислены методы класса KnotCollection.
 KnotCollection Свойства
 Ниже перечислены свойства класса KnotCollection.
 Ссылки
 KnotCollection Методы, KnotCollection Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!