Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.LinearEntity2d.IsColinearTo
 Послать отзыв
 Метод позволяет проверить, является ли указанный линейный объект коллинеарным данному линейному объекту с некоторой заданной точностью.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsColinearTo( ref LinearEntity2d line, Tolerance tolerance );
Копировать Код
Public Function IsColinearTo( ByRef line As LinearEntity2d, tolerance As Tolerance ) As Boolean
 Параметры
 Параметры
 Описание
 line
 Проверяемый линейный объект. Тип LinearEntity2d.
 tolerance
 Входное значение геометрической точности. Тип Tolerance.
 Возвращает
 Возвращает true, если в пределах точности tolerance можно считать, что данный объект коллинеарен объекту line. В противном случае возвращает false.
 Описание
 Метод позволяет проверить, является ли указанный линейный объект коллинеарным данному линейному объекту с некоторой заданной точностью.
 Ссылки
 Teigha.Geometry.LinearEntity2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!