Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector3d.Negate
 Послать отзыв
 Метод создает вектор, обратный данному.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d Negate();
Копировать Код
Public Function Negate() As Vector3d
 Возвращает
 Возвращает вектор, обратный данному. Тип Vector3d.
 Описание
 Метод создает вектор, обратный данному. Компоненты полученного вектора отличаются лишь знаком (-x, -y, -z).
 Ссылки
 Teigha.Geometry.Vector3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!