Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DynamicDimensionDataCollection.Add
 Послать отзыв
 Метод Add() добавляет в коллекцию объект DynamicDimensionData.
 Синтаксис
C#
Visual Basic
Копировать Код
public int Add( ref DynamicDimensionData data );
Копировать Код
Public Function Add( ByRef data As DynamicDimensionData ) As Integer
 Параметры
 Параметры
 Описание
 data
 Добавляемый в коллекцию объект. Тип DynamicDimensionData.
 Возвращает
 Возвращает позицию нового элемента в коллекции. Тип int.
 Описание
 Метод Add() добавляет в коллекцию объект DynamicDimensionData и возвращает его индекс в коллекции.
 Ссылки
 Teigha.DatabaseServices.DynamicDimensionDataCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!