Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MText.ObliqueChange
 Послать отзыв
 Свойство возвращает строку изменения угла наклона текста "Q".
 Синтаксис
C#
Visual Basic
Копировать Код
public static String ObliqueChange;
Копировать Код
Public Shared ReadOnly Property ObliqueChange As String
 Возвращает
 Возвращает строку изменения угла наклона текста. Тип String.
 Описание
 Свойство возвращает строку изменения угла наклона текста "Q". Может использоваться вместо строковой константы "Q", чтобы сделать код более понятным. При использовании в строке, возвращаемой свойством MText.Contents, "Q" означает изменения угла наклона текста.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.MText, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!