Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Ellipse
 Послать отзыв
 Класс Ellipse реализует в базе данных объекты эллипса и эллиптической дуги.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::GraphicsInterface::Drawable Teigha::DatabaseServices::DBObject Teigha::DatabaseServices::Entity Teigha::DatabaseServices::Curve Teigha::DatabaseServices::Ellipse
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("AcDbEllipse")] public class Ellipse : Curve;
Копировать Код
<Wrapper("AcDbEllipse")> Public Class Ellipse Inherits Curve
 Описание
 Класс Ellipse реализует в базе данных объект эллипса. Этот класс наследует базовую функциональность объектов чертежа Entity.
 Объект Ellipse может представлять собой либо эллиптическую замкнутую фигуру (эллипс), либо незамкнутый эллиптический сегмент (т.е. эллиптическую дугу) в мировой системе координат. Когда начальный угол совпадает с конечным углом, фигура считается замкнутой, в этом случае объект представляет из себя эллипс. Когда начальный угол отличается от конечного угла более чем на 1e-6, фигура считается незамкнутой, в этом случае объект представляет из себя эллиптическую дугу.
 Замечания
 Эллипс должен удовлетворять условию замкнутости — (StartAngle = 0) и (EndAngle = 2PI). Эллиптическая дуга должна удовлетворять условию незамкнутости — (EndAngle - StartAngle) > 1e-6. Отношение малого радиуса к большому должно находиться в диапазоне [1e-6..1,0].
 Методы
 Конструкторы
 Teigha.GraphicsInterface.Drawable
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 Drawable
 Конструктор класса Teigha.GraphicsInterface.Drawable. (Унаследован от Drawable)
 Teigha.DatabaseServices.DBObject
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 DBObject
 Конструктор. (Унаследован от DBObject)
 Teigha.DatabaseServices.Ellipse
 Имя
 Описание
 Ellipse
 Это обзор перегрузок Ellipse.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.GraphicsInterface.Drawable
 Имя
 Описание
 Drawable Методы
 Ниже перечислены методы класса Drawable.
 Drawable Свойства
 Ниже перечислены свойства класса Drawable.
 Teigha.DatabaseServices.DBObject
 Имя
 Описание
 DBObject Методы
 Ниже перечислены методы класса DBObject.
 DBObject Свойства
 Ниже перечислены свойства класса DBObject.
 DBObject События
 Ниже перечислены события класса DBObject.
 Teigha.DatabaseServices.Entity
 Имя
 Описание
 Entity Методы
 Ниже перечислены методы класса Entity.
 Entity Свойства
 Ниже перечислены свойства класса Entity.
 Teigha.DatabaseServices.Curve
 Имя
 Описание
 Curve Методы
 Ниже перечислены методы класса Curve.
 Curve Свойства
 Ниже перечислены свойства класса Curve.
 Teigha.DatabaseServices.Ellipse
 Имя
 Описание
 Ellipse Методы
 Ниже перечислены методы класса Ellipse.
 Ellipse Свойства
 Ниже перечислены свойства класса Ellipse.
 Ссылки
 Ellipse Конструктор, Ellipse Методы, Ellipse Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства, DBObject События
 Ваши комментарии по поводу этого топика: Послать отзыв!