Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBDictionary.TreatElementsAsHard
 Послать отзыв
 Свойство определяет, защищает ли данный словарь свои элементы от удаления при очистке (purge).
 Синтаксис
C#
Visual Basic
Копировать Код
public bool TreatElementsAsHard;
Копировать Код
Public Property TreatElementsAsHard() As Boolean
 Возвращает
 Возвращает true, если словарь защищает свои элементы от удаления при очистке (purge).
 Описание
 Свойство определяет, защищает ли данный словарь свои элементы от удаления при очистке (purge).
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.DBDictionary, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!