Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LayerStateEventArgs.Name
 Послать отзыв
 Свойство Name представляет имя слоя.
 Синтаксис
C#
Visual Basic
Копировать Код
public String Name;
Копировать Код
Public ReadOnly Property Name As String
 Возвращает
 Возвращает имя слоя. Тип String.
 Описание
 Свойство Name представляет имя слоя.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.LayerStateEventArgs, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!