Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Cell.GetValue
 Послать отзыв
 Метод позволяет получить значение, сохраненное в данной ячейке.
 Синтаксис
C#
Visual Basic
Копировать Код
public Object GetValue( FormatOption formatOption );
Копировать Код
Public Function GetValue( formatOption As FormatOption ) As Object
 Параметры
 Параметры
 Описание
 formatOption
 Опции форматирования значения из ячейки из перечисления FormatOption.
 Возвращает
 Возвращает значение из ячейки в требуемом формате. Тип Object.
 Описание
 Метод позволяет получить значение, сохраненное в данной ячейке. Аргумент formatOption позволяет настроить формат возвращаемого объекта.
 Ссылки
 Teigha.DatabaseServices.Cell, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!