Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Entity.Highlight(FullSubentityPath
 Послать отзыв
 Метод подсвечивает указанный геометрический подобъект, определённый с помощью параметра subId. Если subId не задан, подсвечивается весь объект, а параметр highlightAll определяет, будет ли подсветка отображена во всех видовых экранах.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Highlight(FullSubentityPath subId, bool highlightAll);
Копировать Код
Public Sub Highlight(subId As FullSubentityPath, highlightAll As bool)
 Параметры
 Параметры
 Описание
 subId
 Полный путь к подобъекту, который необходимо подсветить. Тип FullSubentityPath
 highlightAll
 Признак подсветки во всех видовых экранах. Тип bool
 Описание
 Использование метода
 Этот метод использует параметр FullSubentityPath для определения того, какой подобъект геометрического объекта является требуемым. Затем он подсвечивает его на экране. Если аргумент FullSubentityPath не задан, то подсвечивается весь геометрический объект.
 Обычно, FullSubentityPath, переданный в subId, получается из метода Entity.GetSubentPathsAtGraphicsMarker(). Это гарантирует, что он правильно и полностью заполнен.
 Этот метод использует метод GetGraphicsMarkersAtSubentPath() геометрического объекта для получения GS маркера, связанного с subId.
 Не является необходимым соответствие каждого вызова метода Highlight() с вызовом метода Unhighlight(). Вызов метода Unhighlight() снимает выделение геометрического объекта независимо от того, сколько раз до этого вызывался метод Highlight().
 Разработка метода в производных классах
 Реализация метода Entity.Highlight() делает всю необходимую работу для подсветки геометрических подобъектов, относящихся к subId. Поэтому, нет необходимости переопределять этот метод, за исключением случая, когда вы хотите выполнить некоторые до- или после- операционные действия, или вы хотите отменить подсветку геометрических подобъектов.
 Если метод переопределен, и он подсвечивает геометрические подобъекты, то метод Entity.Highlight() должен быть вызван в некоторой точке переопределенного метода, чтобы выполнить реальное подсвечивание.
 Для большей информации о параметре subId, смотри документацию на методы Entity.GetGraphicsMarkersAtSubentPath() или GetSubentPathsAtGraphicsMarker().
 Ссылки
 Teigha.DatabaseServices.Entity, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!