Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Sphere.Sphere
 Послать отзыв
 Конструктор по умолчанию класса Sphere. Создает единичную сферу с центром в начале координат.
 Синтаксис
C#
Visual Basic
Копировать Код
public Sphere();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса Sphere. Создает единичную сферу с центром в начале координат.
 Ссылки
 Teigha.Geometry.Sphere, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!