Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Useri4
 Послать отзыв
 Синтаксис
C#
Visual Basic
public int Useri4;
Public Property Useri4() As Integer
 Описание
 Обеспечивает доступ к текущему значению USERI4 для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!