Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocDependency.DependentOnObject
 Послать отзыв
 Свойство возвращает объект базы данных, с которым связана данная зависимость.
 Синтаксис
C#
Visual Basic
Копировать Код
public Teigha.DatabaseServices.ObjectId DependentOnObject;
Копировать Код
Public Property DependentOnObject() As Teigha.DatabaseServices.ObjectId
 Возвращает
 Возвращает идентификатор связанного объекта. Тип Teigha.DatabaseServices.ObjectId.
 Описание
 Свойство возвращает объект базы данных, с которым связана данная зависимость, или ObjectId.Null, если зависимость не прикреплена ни к какому объекту. Зависимость прикрепляется к связанному объекту DBObject как постоянный реактор.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.AssocDependency, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!