Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.EllipticalCylinder.IsClosed
 Послать отзыв
 Метод позволяет проверить, является ли основание этого эллиптического цилиндра полным эллипсом в пределах указанной точности.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsClosed( Tolerance tolerance );
Копировать Код
Public Function IsClosed( tolerance As Tolerance ) As Boolean
 Параметры
 Параметры
 Описание
 tolerance
 Входная геометрическая точность. Тип Tolerance.
 Возвращает
 Возвращает true, если в пределах точности tolerance основание эллиптического цилиндра представляет собой полный эллипс. В противном случае возвращает false.
 Описание
 Метод позволяет проверить, является ли основание этого эллиптического цилиндра полным эллипсом в пределах указанной точности.
 Ссылки
 Teigha.Geometry.EllipticalCylinder, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!