Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.NurbSurface.IsPeriodicInV
 Послать отзыв
 Свойство позволяет проверить, является ли данная поверхность периодической в направлении v.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsPeriodicInV;
Копировать Код
Public ReadOnly Property IsPeriodicInV As Boolean
 Возвращает
 Возвращает true, если поверхность в указанном направлении является периодической. В противном случае возвращает false.
 Описание
 Свойство позволяет проверить, является ли данная поверхность периодической в направлении v.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.NurbSurface, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!