Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MlineStyleElement.Offset
 Послать отзыв
 Свойство возвращает смещение для данного элемента стиля.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Offset;
Копировать Код
Public ReadOnly Property Offset As Double
 Возвращает
 Возвращает смещение для данного элемента стиля. Тип double.
 Описание
 Свойство возвращает смещение для данного элемента стиля.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.MlineStyleElement, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!