Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FitData.GetFitPoints
 Послать отзыв
 Метод предоставляет коллекцию определяющих точек сплайна, заданных в координатах WCS.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3dCollection GetFitPoints();
Копировать Код
Public Function GetFitPoints() As Point3dCollection
 Возвращает
 Возвращает коллекцию определяющих точек сплайна. Тип Point3dCollection.
 Описание
 Метод предоставляет коллекцию определяющих точек сплайна, заданных в координатах WCS.
 Ссылки
 Teigha.DatabaseServices.FitData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!