Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Viewport.VisualStyleId
 Послать отзыв
 Свойство VisualStyleId представляет идентификатор объекта визуального стиля, который используется в данном видовом экране.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.ObjectId VisualStyleId;
Копировать Код
Public Property VisualStyleId As DatabaseServices.ObjectId
 Возвращает
 Возвращает идентификатор объекта визуального стиля. Тип DatabaseServices.ObjectId.
 Описание
 Свойство VisualStyleId представляет идентификатор объекта визуального стиля, который используется в данном видовом экране.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Viewport, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!