Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GridPropertyParameter.LineStyle
 Послать отзыв
 Свойство представляет стиль линий сетки GridLineStyle.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.GridLineStyle LineStyle;
Копировать Код
Public LineStyle As DatabaseServices.GridLineStyle
 Возвращает
 Возвращает стиль линий сетки. Тип DatabaseServices.GridLineStyle.
 Описание
 Свойство представляет стиль линий сетки GridLineStyle.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.GridPropertyParameter, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!