Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.HatchEdgeType
 Послать отзыв
 Перечисление HatchEdgeType определяет типы геометрических кривых, используемые для границ областей штриховки.
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdDbHatch.HatchEdgeType")] public enum HatchEdgeType { Line = 1, CircularArc = 2, EllipticalArc = 3, Spline = 4 }
Копировать Код
<Wrapper("OdDbHatch.HatchEdgeType")> Public Enum HatchEdgeType Line = 1 CircularArc = 2 EllipticalArc = 3 Spline = 4 End Enum
 Члены
 Члены
 Описание
 CircularArc
 Значение: 2. Круглая дуга.
 EllipticalArc
 Значение: 3. Эллиптическая дуга.
 Line
 Значение: 1. Линейный сегмент.
 Spline
 Значение: 4. Сплайн.
 Описание
 Перечисление HatchEdgeType определяет типы геометрических кривых, которые могут использоваться для построения границ областей штриховки.
 Ваши комментарии по поводу этого топика: Послать отзыв!