Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Dimclrt
 Послать отзыв
 Синтаксис
C#
Visual Basic
public Colors::Color Dimclrt;
Public Property Dimclrt() As Colors.Color
 Описание
 Возвращает или устанавливает текущее значение DIMCLRT для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!