Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DgnDefinition.XrefDepth
 Послать отзыв
 Свойство представляет значение глубины вложенности внешней ссылки, которое используется при экспорте файла DWG в формат DGN. При преобразовании из DWG в DGN подложки DGN становятся внешними ссылками DGN с указанным значением глубины вложенности.
 Синтаксис
C#
Visual Basic
Копировать Код
public int XrefDepth;
Копировать Код
Public Property XrefDepth() As Integer
 Возвращает
 Возвращает глубину вложенности внешних ссылок. Тип int.
 Описание
 Свойство представляет значение глубины вложенности внешней ссылки, которое используется при экспорте файла DWG в формат DGN. При преобразовании из DWG в DGN подложки DGN становятся внешними ссылками DGN с указанным значением глубины вложенности.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.DgnDefinition, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!