Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CurveCurveIntersector2d.CurveCurveIntersector2d
 Послать отзыв
 Конструктор класса CurveCurveIntersector2d. Создает объект с двумя переданными кривыми.
 Синтаксис
C#
Visual Basic
Копировать Код
public CurveCurveIntersector2d( ref Curve2d curve1, ref Curve2d curve2 );
Копировать Код
Public Sub New( ByRef curve1 As Curve2d, ByRef curve2 As Curve2d )
 Параметры
 Параметры
 Описание
 curve1
 Первая входная кривая. Тип Curve2d.
 curve2
 Вторая входная кривая. Тип Curve2d.
 Описание
 Конструктор класса CurveCurveIntersector2d. Создает объект с двумя переданными кривыми. Точки пересечения вычисляются в пределах точности по умолчанию.
 Ссылки
 Teigha.Geometry.CurveCurveIntersector2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!