Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод LinetypeTableRecord.ShapeIsUcsOrientedAt
 Послать отзыв
 Синтаксис
C#
Visual Basic
public bool ShapeIsUcsOrientedAt(int index);
Public Function ShapeIsUcsOrientedAt(index As Integer) As bool
 Параметры
 Параметры
 Описание
 index
 Индекс (начинающийся с 0) строки, содержащей форму (текстовую строку), для которой производится проверка
 Описание
 Этот метод возвращает true, если форма (текстовая строка) в строке LinetypeTableRecord с индексом index имеет бит UcsOriented (бит 1) установленным в 1, и false в противном случае.
 Ссылки
 Teigha.DatabaseServices.LinetypeTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!