Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Polyline.OnSegmentAt
 Послать отзыв
 Синтаксис
C#
Visual Basic
public bool OnSegmentAt(int index, Point2d pt2d, double value);
Public Function OnSegmentAt(index As Integer, pt2d As Point2d, value As Double) As bool
 Параметры
 Параметры
 Описание
 index
 Индекс (отсчитываемый от 0) вершины
 pt2d
 Точка (в координатах OCS полилинии) для проверки
 value
 Выходной параметр типа вершины
 Описание
 Этот метод определяет, находится или нет точка, на которую указывает pt2d (определенная в координатной системе полилинии), на сегменте полилинии, начинающейся с вершины index. value является параметрической формой типа сегмента (другими словами, линия или дуга).
 Метод возвращает true, если точка находится на полилинии.
 Ссылки
 Teigha.DatabaseServices.Polyline, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!