Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.RevolveOptionsCheckRevolveCurveOut.RevolveOptionsCheckRevolveCurveOut
 Послать отзыв
 Конструктор по умолчанию класса RevolveOptionsCheckRevolveCurveOut.
 Синтаксис
C#
Visual Basic
Копировать Код
public RevolveOptionsCheckRevolveCurveOut();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса RevolveOptionsCheckRevolveCurveOut.
 Ссылки
 Teigha.DatabaseServices.RevolveOptionsCheckRevolveCurveOut, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!