Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.BoundBlock3d
 Послать отзыв
 Класс BoundBlock3d представляет трехмерную граничную рамку.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Geometry::Entity3d Teigha::Geometry::BoundBlock3d
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdGeBoundBlock3d")] public sealed class BoundBlock3d : Entity3d
Копировать Код
<Wrapper("OdGeBoundBlock3d")> Public NotInheritable Class BoundBlock3d Inherits Entity3d
 Описание
 Класс BoundBlock3d представляет реализацию трехмерной граничной рамки. Геометрически граничная рамка может принимать форму как обычного прямоугольного параллелепипеда, ориентированного по осям системы координат, так и непрямоугольного параллелепипеда.
 Методы
 Конструкторы
 Teigha.Geometry.BoundBlock3d
 Имя
 Описание
 BoundBlock3d
 Это обзор перегрузок BoundBlock3d.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Geometry.Entity3d
 Имя
 Описание
 Entity3d Методы
 Ниже перечислены методы класса Entity3d.
 Teigha.Geometry.BoundBlock3d
 Имя
 Описание
 BoundBlock3d Методы
 Ниже перечислены методы класса BoundBlock3d.
 BoundBlock3d Свойства
 Ниже перечислены свойства класса BoundBlock3d.
 Ссылки
 BoundBlock3d Конструктор, BoundBlock3d Методы, BoundBlock3d Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!