Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Torus.IsLemon
 Послать отзыв
 Свойство IsLemon позволяет проверить, что данный тор имеет форму "лимона".
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsLemon;
Копировать Код
Public ReadOnly Property IsLemon As Boolean
 Возвращает
 Возвращает true, если большой радиус тора отрицателен, но по модулю не превышает величину малого радиуса. В противном случае возвращает false.
 Описание
 Свойство IsLemon позволяет проверить, что данный тор имеет форму "лимона", когда большой радиус отрицателен, но по модулю не превышает малый радиус.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.Torus, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!