Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Trace.SetPointAt
 Послать отзыв
 Метод переопределяет положение вершины с указанным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetPointAt( short index, Point3d pointValue );
Копировать Код
Public Sub SetPointAt( index As Short, pointValue As Point3d )
 Параметры
 Параметры
 Описание
 index
 Индекс переопределяемой вершины полосы. Тип short.
 pointValue
 Новые координаты вершины. Тип Point3d.
 Описание
 Метод переопределяет положение вершины с указанным индексом index.
 Ссылки
 Teigha.DatabaseServices.Trace, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!