Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LoftOptionsBuilder.SetOptionsFromSysvars
 Послать отзыв
 Метод предназначен для задания параметров лофта в соответствии со значениями системных переменных в указанной базе данных.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetOptionsFromSysvars( ref Database pDb );
Копировать Код
Public Sub SetOptionsFromSysvars( ByRef pDb As Database )
 Параметры
 Параметры
 Описание
 pDb
 База данных, которая служит источником значений параметров. Тип Database.
 Описание
 Метод предназначен для задания параметров лофта в соответствии со значениями системных переменных в указанной базе данных.
 Ссылки
 Teigha.DatabaseServices.LoftOptionsBuilder, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!