Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SectionSettings.Linetype
 Послать отзыв
 Метод позволяет получить имя типа линий для геометрии указанного типа.
 Синтаксис
C#
Visual Basic
Копировать Код
public String Linetype( SectionType nSecType, SectionGeometry nGeometry );
Копировать Код
Public Function Linetype( nSecType As SectionType, nGeometry As SectionGeometry ) As String
 Параметры
 Параметры
 Описание
 nSecType
 Тип сечения. Перечисление SectionType.
 nGeometry
 Типы элементов геометрии сечения. Перечисление SectionGeometry.
 Возвращает
 Возвращает имя типа линий. Тип String.
 Описание
 Метод позволяет получить имя типа линий для геометрии указанного типа.
 Ссылки
 Teigha.DatabaseServices.SectionSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!