Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Viewport.IsLayerFrozenInViewport
 Послать отзыв
 Метод позволяет определить, заморожен ли указанный слой в данном видовом экране.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsLayerFrozenInViewport( DatabaseServices.ObjectId layerId );
Копировать Код
Public Function IsLayerFrozenInViewport( layerId As DatabaseServices.ObjectId ) As Boolean
 Параметры
 Параметры
 Описание
 layerId
 Идентификатор проверяемого слоя. Тип DatabaseServices.ObjectId.
 Возвращает
 Возвращает true, если слой заморожен в данном видовом экране. В противном случае возвращает false.
 Описание
 Метод позволяет определить, заморожен ли указанный слой в данном видовом экране.
 Ссылки
 Teigha.DatabaseServices.Viewport, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!