Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve2d.GetParameterAtLength
 Послать отзыв
 Метод находит значение параметра для точки на кривой, длина вдоль кривой до которой от заданной точки равна заданному значению.
 Синтаксис
C#
Visual Basic
Копировать Код
public double GetParameterAtLength( double datumParameter, double length, bool parameterDirection );
Копировать Код
Public Function GetParameterAtLength( datumParameter As Double, length As Double, parameterDirection As Boolean ) As Double
 Параметры
 Параметры
 Описание
 datumParameter
 Входное значение параметра для точки отсчета длины. Тип double.
 length
 Входная длина вдоль кривой. Тип double.
 parameterDirection
 Направление изменения параметра. Тип bool.
 Возвращает
 Возвращает значение параметра для искомой точки на кривой. Тип double.
 Описание
 Метод находит значение параметра для точки на кривой, длина вдоль кривой до которой от заданной точки равна заданному значению. Используется вызов Curve2d.GetParameterAtLength(Double datumParameter, Double length, Boolean parameterDirection, Tolerance tolerance) со значением точности, равным Tolerance.Global. Положение на кривой точки отсчета длины задается входным параметром datumParameter. Направление вдоль кривой указывается входным флагом parameterDirection.
 Ссылки
 Teigha.Geometry.Curve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!