Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SectionSettings.DivisionLines
 Послать отзыв
 Метод позволяет определить, отображаются ли линии разделения для указанной геометрии.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool DivisionLines( SectionType nSecType, SectionGeometry nGeometry );
Копировать Код
Public Function DivisionLines( nSecType As SectionType, nGeometry As SectionGeometry ) As Boolean
 Параметры
 Параметры
 Описание
 nSecType
 Тип сечения. Перечисление SectionType.
 nGeometry
 Типы элементов геометрии сечения. Перечисление SectionGeometry.
 Возвращает
 Возвращает true, если линии разделения отображаются для указанного типа и геометрии сечения. В противном случае возвращает false.
 Описание
 Метод позволяет определить, отображаются ли линии разделения для указанной геометрии.
 Ссылки
 Teigha.DatabaseServices.SectionSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!