Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Vertex2d.TangentUsed
 Послать отзыв
 Свойство TangentUsed позволяет определить, используется ли данной вершиной направление определяющей касательной к кривой.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool TangentUsed;
Копировать Код
Public Property TangentUsed As Boolean
 Возвращает
 Возвращает true, если направление касательной используется. В противном случае возвращает false.
 Описание
 Свойство TangentUsed позволяет определить, используется ли данной вершиной направление определяющей касательной к кривой.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Vertex2d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!