Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve2d.IsOn
 Послать отзыв
 Метод позволяет проверить, лежит ли указанная точка на данной кривой, и если это так, определяет соответствующее этой точке значение параметра.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsOn( Point2d point, out double value );
Копировать Код
Public Function IsOn( point As Point2d, ByRef value As Double ) As Boolean
 Параметры
 Параметры
 Описание
 point
 Проверяемая точка. Тип Point2d.
 value
 Выходное значение параметра, соответствующее проверяемой точке. Тип double. Это значение действительно только в том случае, если метод возвращает значение true.
 Возвращает
 Возвращает true, если точка point лежит на данной кривой. В противном случае возвращает false.
 Описание
 Метод позволяет проверить, лежит ли указанная точка на данной кривой, и если это так, определяет соответствующее этой точке значение параметра. Используется вызов метода Curve2d.IsOn(Point2d point, out double value, Tolerance tolerance) со значением точности, равным Tolerance.Global.
 Ссылки
 Teigha.Geometry.Curve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!