Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.ReselectSubRegion
 Послать отзыв
 Метод предназначен для получения подобъектов ячеек текущей подвыборки.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void ReselectSubRegion( ref FullSubentityPath[] paths );
Копировать Код
Public virtual Sub ReselectSubRegion( ByRef paths As FullSubentityPath[] )
 Параметры
 Параметры
 Описание
 paths
 Массив путей подобъектов. Тип FullSubentityPath[].
 Описание
 Метод предназначен для получения подобъектов ячеек текущей подвыборки. Пути могут быть пустыми, если в подвыборке нет ячеек.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!