Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MeshFaceterData.FaceterDevSurface
 Послать отзыв
 Свойство FaceterDevSurface представляет максимальное отклонение сети от поверхности.
 Синтаксис
C#
Visual Basic
Копировать Код
public double FaceterDevSurface;
Копировать Код
Public Property FaceterDevSurface As Double
 Возвращает
 Возвращает максимальное отклонение сети от поверхности. Тип double.
 Описание
 Свойство FaceterDevSurface представляет максимальное отклонение сети от поверхности. Это значение используется для управления отклонением сети от грани в процессе разбиения ребер, а также при размещении линий сети на грани.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MeshFaceterData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!