Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MText.WidthChange
 Послать отзыв
 Свойство возвращает строку перехода к другой ширине текста "W".
 Синтаксис
C#
Visual Basic
Копировать Код
public static String WidthChange;
Копировать Код
Public Shared ReadOnly Property WidthChange As String
 Возвращает
 Возвращает строку перехода к другой ширине текста. Тип String.
 Описание
 Свойство возвращает строку перехода к другой ширине текста "W". Может использоваться вместо строковой константы "W", чтобы сделать код более понятным. При использовании в строке, возвращаемой свойством MText.Contents, "W" означает переход к другой ширине текста.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.MText, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!