Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Matrix3d.IsInverse
 Послать отзыв
 Метод позволяет проверить, является ли указанная матрица обратной по отношению к данной матрице.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsInverse( Matrix3d inv );
Копировать Код
Public Function IsInverse( inv As Matrix3d ) As Boolean
 Параметры
 Параметры
 Описание
 inv
 Матрица, с которой выполняется сравнение. Тип Matrix3d.
 Возвращает
 Возвращает true, если матрица inv является обратной по отношению к данной, иначе - false.
 Описание
 Метод позволяет проверить, является ли матрица inv обратной по отношению к данной матрице. Реализация метода использует вызов Matrix3d.IsInverse(Matrix3d inv, Tolerance tolerance) с допуском, равным Tolerance.Global.
 Ссылки
 Teigha.Geometry.Matrix3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!