Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CurveCurveIntersector3d.CurveCurveIntersector3d
 Послать отзыв
 Конструктор класса CurveCurveIntersector3d. Создает объект для вычисления с заданной точностью пересечений двух кривых на их участках, которые определены заданными параметрическими интервалами.
 Синтаксис
C#
Visual Basic
Копировать Код
public CurveCurveIntersector3d( ref Curve3d curve1, ref Curve3d curve2, ref Interval range1, ref Interval range2, Vector3d planeNormal, Geometry.Tolerance tolerance );
Копировать Код
Public Sub New( ByRef curve1 As Curve3d, ByRef curve2 As Curve3d, ByRef range1 As Interval, ByRef range2 As Interval, planeNormal As Vector3d, tolerance As Geometry.Tolerance )
 Параметры
 Параметры
 Описание
 curve1
 Первая входная кривая. Тип Curve3d.
 curve2
 Вторая входная кривая. Тип Curve3d.
 range1
 Параметрический интервал для первой кривой. Тип Interval.
 range2
 Параметрический интервал для второй кривой. Тип Interval.
 planeNormal
 Опциональный вектор нормали плоскости. Тип Vector3d.
 tolerance
 Заданная точность геометрических вычислений. Тип Geometry.Tolerance.
 Описание
 Конструктор класса CurveCurveIntersector3d. Создает объект для вычисления пересечений фрагментов указанных кривых, которые определены заданными параметрическими интервалами. Используется точность, заданная входным аргументом tolerance.
 Замечания
 Точки пересечения и наложения возвращаются только в том случае, если они находятся в пределах двух указанных параметрических интервалов.
 Ссылки
 Teigha.Geometry.CurveCurveIntersector3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!