Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Filters.FilteredBlockIterator.BuffersForComposition
 Послать отзыв
 Свойство позволяет проверить, должен ли итератор индекса, если он не является основным итератором, буферизовать свои выходные данные.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool BuffersForComposition;
Копировать Код
Public ReadOnly Property BuffersForComposition As Boolean
 Возвращает
 Возвращает true тогда и только тогда, когда итератор индекса, если он не является основным итератором, должен буферизовать свои выходные данные. В противном случае возвращает false.
 Описание
 Свойство BuffersForComposition позволяет проверить, должен ли итератор индекса, если он не является основным итератором, буферизовать свои выходные данные. Если должен, свойство возвращает true.
 В случае значения false «настоящий» обход индекса выполняется только в первой паре индекс/фильтр, а последующие пары запрашиваются через вызовы метода Accepts(). В случае значения true после того, как все идентификаторы из предыдущего итератора были добавлены в буфер, для перебора данных должны использоваться метод Start() и свойства Next и Id этого итератора.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Filters.FilteredBlockIterator, Teigha.DatabaseServices.Filters
 Ваши комментарии по поводу этого топика: Послать отзыв!