Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.ClipError
 Послать отзыв
 Данное перечисление определяет поддерживаемые ошибки обрезки.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum ClipError { OK = 0, InvalidClipBoundary = 1, NotInitialized = 2 }
Копировать Код
Public Enum ClipError OK = 0 InvalidClipBoundary = 1 NotInitialized = 2 End Enum
 Члены
 Члены
 Описание
 OK
 Значение: 0. Ошибок нет.
 InvalidClipBoundary
 Значение: 1. Граница обрезки недействительна.
 NotInitialized
 Значение: 2. Граница обрезки не была инициализирована.
 Описание
 Данное перечисление определяет поддерживаемые ошибки обрезки.
 Ваши комментарии по поводу этого топика: Послать отзыв!