Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Line2dCollection
 Послать отзыв
 Класс Line2dCollection представляет коллекцию двумерных линий.
 Иерархия классов
Teigha::Geometry::Line2dCollection
 Синтаксис
C#
Visual Basic
Копировать Код
[DefaultMember("Item")] public sealed class Line2dCollection : IList
Копировать Код
<DefaultMember("Item")> Public NotInheritable Class Line2dCollection Implements IList
 Описание
 Класс Line2dCollection представляет коллекцию двумерных линий.
 Замечания
 Индексация элементов коллекции начинается с нуля.
 Методы
 Конструкторы
 Имя
 Описание
 Line2dCollection
 Конструктор по умолчанию класса Line2dCollection. Создает пустую коллекцию 2D-линий.
 Топики
 Имя
 Описание
 Line2dCollection Методы
 Ниже перечислены методы класса Line2dCollection.
 Line2dCollection Свойства
 Ниже перечислены свойства класса Line2dCollection.
 Ссылки
 Line2dCollection Методы, Line2dCollection Свойства, Методы, Топики, Line2dCollection Методы, Line2dCollection Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!