Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MentalRayRenderSettings.RayTracingEnabled
 Послать отзыв
 Свойство RayTracingEnabled позволяет определить, включена ли трассировка лучей.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool RayTracingEnabled;
Копировать Код
Public Property RayTracingEnabled As Boolean
 Возвращает
 Возвращает true, если трассировка лучей включена. В противном случае возвращает false.
 Описание
 Свойство RayTracingEnabled позволяет определить, включена ли трассировка лучей.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MentalRayRenderSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!