Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Matrix2d.PostMultiplyBy
 Послать отзыв
 Метод реализует правое умножение данной матрицы на указанную матрицу, являющуюся правым множителем.
 Синтаксис
C#
Visual Basic
Копировать Код
public Matrix2d PostMultiplyBy( Matrix2d rightSide );
Копировать Код
Public Function PostMultiplyBy( rightSide As Matrix2d ) As Matrix2d
 Параметры
 Параметры
 Описание
 rightSide
 Входная матрица, которая в произведении является правым множителем. Тип Matrix2d.
 Возвращает
 Возвращает результат правого произведения данной матрицы на матрицу rightSide. Тип Matrix2d.
 Описание
 Метод реализует правое умножение данной матрицы на матрицу rightSide, которая в произведении выполняет роль правого множителя. Результат произведения (данная матрица) х (rightSide) сохраняется в данной матрице.
 Ссылки
 Teigha.Geometry.Matrix2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!