Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Spline.IsRational
 Послать отзыв
 Свойство IsRational позволяет проверить, является ли данный сплайн рациональным.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsRational;
Копировать Код
Public ReadOnly Property IsRational As Boolean
 Возвращает
 Возвращает true, если сплайн является рациональным. В противном случае возвращает false.
 Описание
 Свойство IsRational позволяет проверить, является ли данный сплайн рациональным.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Spline, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!