Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Scale3d.ToString
 Послать отзыв
 Метод предоставляет эквивалентное строковое представление данного объекта, которое учитывает указанные языковые и региональные настройки.
 Синтаксис
C#
Visual Basic
Копировать Код
public String ToString( ref IFormatProvider provider );
Копировать Код
Public Function ToString( ByRef provider As IFormatProvider ) As String
 Параметры
 Параметры
 Описание
 provider
 Входной провайдер языковых и региональных настроек. Тип IFormatProvider.
 Возвращает
 Возвращает эквивалентное строковое представление данного объекта, которое учитывает указанные языковые и региональные настройки. Тип String.
 Описание
 Метод предоставляет эквивалентное строковое представление данного объекта. Возвращаемая строка содержит компоненты вектора масштабирования, отформатированные с учетом указанных языковых и региональных настроек.
 Ссылки
 Teigha.Geometry.Scale3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!