Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GeoLocationData.NorthDirectionVector
 Послать отзыв
 Свойство обеспечивает доступ к вектору направления на истинный север в проектных координатах DWG.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector2d NorthDirectionVector;
Копировать Код
Public Property NorthDirectionVector As Vector2d
 Возвращает
 Возвращает направление на истинный север. Тип Vector2d.
 Описание
 Свойство обеспечивает доступ к вектору направления на истинный север в проектных координатах DWG.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.GeoLocationData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!