Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AbstractViewTableRecord.FrontClipAtEye
 Послать отзыв
 Свойство FrontClipAtEyeOn позволяет определить, проходит ли передняя плоскость отсечения через точку камеры.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool FrontClipAtEye;
Копировать Код
Public Property FrontClipAtEye As Boolean
 Возвращает
 Возвращает true, если передняя плоскость отсечения проходит через камеру (точку глаза) независимо от значения FrontClipDistance. В противном случае возвращает false.
 Описание
 Свойство FrontClipAtEyeOn позволяет определить, проходит ли передняя плоскость отсечения через точку камеры.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.AbstractViewTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!