Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.UnderlayDefinition.SourceFileName
 Послать отзыв
 Свойство SourceFileName представляет полное или относительное имя исходного файла, на который ссылается эта подложка.
 Синтаксис
C#
Visual Basic
Копировать Код
public String SourceFileName;
Копировать Код
Public Property SourceFileName As String
 Возвращает
 Возвращает полное или относительное имя файла. Тип String.
 Описание
 Свойство SourceFileName представляет имя исходного файла, на который ссылается эта подложка. Путь к файлу может быть как полным, так и относительным.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.UnderlayDefinition, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!