Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Extents2d
 Послать отзыв
 Этот класс представляет двумерные ограничивающие боксы для различных графических объектов.
 Иерархия классов
Teigha::DatabaseServices::Extents2d
 Синтаксис
C#
Visual Basic
Копировать Код
[StructLayout(LayoutKind.Sequential)] public class Extents2d : IFormattable;
Копировать Код
<StructLayout(LayoutKind.Sequential)> Public Class Extents2d Inherits IFormattable
 Описание
 Этот класс представляет двумерные ограничивающие боксы для различных графических объектов. 2D-бокс представляет собой описанный вокруг объекта прямоугольник, определяемый двумя вершинами главной диагонали (минимальной и максимальной точками).
 Методы
 Конструкторы
 Имя
 Описание
 Extents2d
 Это обзор перегрузок Extents2d.
 Топики
 Имя
 Описание
 Extents2d Методы
 Ниже перечислены методы класса Extents2d.
 Extents2d Операторы
 Ниже перечислены операторы класса Extents2d.
 Extents2d Свойства
 Ниже перечислены свойства класса Extents2d.
 Ссылки
 Extents2d Конструктор, Extents2d Методы, Extents2d Операторы, Extents2d Свойства, Методы, Топики, Extents2d Методы, Extents2d Операторы, Extents2d Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!