Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeader.RemoveLeader
 Послать отзыв
 Метод позволяет удалить из данной мультивыноски кластер с указанным индексом
 Синтаксис
C#
Visual Basic
Копировать Код
public void RemoveLeader( int index );
Копировать Код
Public Sub RemoveLeader( index As Integer )
 Параметры
 Параметры
 Описание
 index
 Индекс удаляемого кластера. Тип int.
 Описание
 Метод позволяет удалить из данной мультивыноски кластер с указанным индексом
 Ссылки
 Teigha.DatabaseServices.MLeader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!