Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Point3d.DistanceTo
 Послать отзыв
 Метод определяет расстояние между этой и заданной точками.
 Синтаксис
C#
Visual Basic
Копировать Код
public double DistanceTo( Point3d point );
Копировать Код
Public Function DistanceTo( point As Point3d ) As Double
 Параметры
 Параметры
 Описание
 point
 Входная 3D-точка, до которой измеряется расстояние. Тип Point3d.
 Возвращает
 Возвращает расстояние между точками. Тип double.
 Описание
 Метод определяет расстояние от данной точки до заданной 3D-точки point.
 Ссылки
 Teigha.Geometry.Point3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!