Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Sphere.IsOuterNormal
 Послать отзыв
 Свойство IsOuterNormal позволяет проверить, направлена ли нормаль данной сферической поверхности наружу.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsOuterNormal;
Копировать Код
Public ReadOnly Property IsOuterNormal As Boolean
 Возвращает
 Возвращает true, если нормаль данной сферической поверхности направлена наружу. В противном случае возвращает false.
 Описание
 Свойство IsOuterNormal позволяет проверить, направлена ли нормаль данной сферической поверхности наружу.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.Sphere, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!