Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Surface.GetSubentityMaterial
 Послать отзыв
 Метод позволяет извлечь материал для указанного подобъекта данной поверхности.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual DatabaseServices.ObjectId GetSubentityMaterial( SubentityId subEntityId );
Копировать Код
Public Overridable Function GetSubentityMaterial( subEntityId As SubentityId ) As DatabaseServices.ObjectId
 Параметры
 Параметры
 Описание
 subEntityId
 Идентификатор подобъекта. Тип SubentityId.
 Возвращает
 Возвращает идентификатор объекта материала. Тип DatabaseServices.ObjectId.
 Описание
 Метод позволяет извлечь материал для указанного подобъекта данной поверхности.
 Ссылки
 Teigha.DatabaseServices.Surface, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!