Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.AugmentedPolylineCurve3d.SetVectorAt
 Послать отзыв
 Метод позволяет задать вектор с указанным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetVectorAt( int index, Vector3d point );
Копировать Код
Public Sub SetVectorAt( index As Integer, point As Vector3d )
 Параметры
 Параметры
 Описание
 index
 Входной индекс вектора. Тип int.
 point
 Входной вектор. Тип Vector3d.
 Описание
 Метод позволяет задать вектор с указанным индексом.
 Ссылки
 Teigha.Geometry.AugmentedPolylineCurve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!