Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Matrix3d.IsUniscaledOrtho
 Послать отзыв
 Метод позволяет проверить, являются ли векторы-столбцы линейной части данной матрицы одинаковыми по длине и перпендикулярными друг другу.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsUniscaledOrtho();
Копировать Код
Public Function IsUniscaledOrtho() As Boolean
 Возвращает
 Возвращает true, если векторы-столбцы линейной части данной матрицы перпендикулярны друг другу и одинаковы по длине. В противном случае возвращает false.
 Описание
 Метод позволяет проверить, являются ли векторы-столбцы линейной части данной матрицы одинаковыми по длине и перпендикулярными друг другу. Реализация метода использует вызов Matrix3d.IsUniscaledOrtho(Tolerance tolerance) с точностью, равной Tolerance.Global.
 Ссылки
 Teigha.Geometry.Matrix3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!