Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve3d.GetDistanceTo
 Послать отзыв
 Метод вычисляет минимальное расстояние от указанной точки до данной кривой.
 Синтаксис
C#
Visual Basic
Копировать Код
public double GetDistanceTo( Point3d point );
Копировать Код
Public Function GetDistanceTo( point As Point3d ) As Double
 Параметры
 Параметры
 Описание
 point
 Точка, до которой вычисляется расстояние. Тип Point3d.
 Возвращает
 Возвращает минимальное расстояние от точки до кривой. Тип double.
 Описание
 Метод вычисляет минимальное расстояние от указанной точки до данной кривой. Вызывается метод Curve3d.GetDistanceTo(Point3d point, Tolerance tolerance) с допуском Tolerance.Global.
 Ссылки
 Teigha.Geometry.Curve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!