Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Pucsxdir
 Послать отзыв
 Синтаксис
C#
Visual Basic
public Vector3d Pucsxdir;
Public Property Pucsxdir() As Vector3d
 Описание
 Возвращает текущее значение UCSXDIR пространства листа базы данных.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!