Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.NurbSurface.SetControlPointAt
 Послать отзыв
 Метод позволяет задать новую управляющую вершину в указанной позиции массива управляющих вершин.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetControlPointAt( int iUDegree, int iVDegree, Point3d point );
Копировать Код
Public Sub SetControlPointAt( iUDegree As Integer, iVDegree As Integer, point As Point3d )
 Параметры
 Параметры
 Описание
 iUDegree
 Индекс управляющей вершины в направлении u. Тип int. Начальное значение 0.
 iVDegree
 Индекс управляющей вершины в направлении v. Тип int. Начальное значение 0.
 point
 Новая управляющая вершина, которая создается в указанной позиции [(u,v)]. Тип Point3d. Координаты определяются в мировой системе координат WCS.
 Описание
 Метод позволяет задать новую управляющую вершину (в мировой системе координат WCS) в указанной позиции массива управляющих вершин.
 Если поверхность не содержит информации об управляющих вершинах, метод генерирует исключение eFail. Если параметры iUDegree или iVDegree выходят за пределы допустимого диапазона, выбрасывается исключение eOutOfRange. Если этот метод в конкретном моделере не реализован, выбрасывается исключение eNotImplementedYet.
 Ссылки
 Teigha.DatabaseServices.NurbSurface, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!