Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Scale3d.PostMultiplyBy
 Послать отзыв
 Метод реализует векторное произведение данного объекта на указанный вектор масштабирования (данный вектор) * (rightSide).
 Синтаксис
C#
Visual Basic
Копировать Код
public Scale3d PostMultiplyBy( Scale3d rightSide );
Копировать Код
Public Function PostMultiplyBy( rightSide As Scale3d ) As Scale3d
 Параметры
 Параметры
 Описание
 rightSide
 Входной вектор масштабирования, используемый в качестве множителя. Тип Scale3d.
 Возвращает
 Возвращает результат векторного умножения. Тип Scale3d.
 Описание
 Метод сохраняет в данном объекте результат векторного произведения данного объекта на указанный вектор масштабирования (данный вектор) * (rightSide).
 Замечания
 Умножение векторов масштабирования является коммутативным.
 Ссылки
 Teigha.Geometry.Scale3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!