Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ColumnsCollection
 Послать отзыв
 Класс ColumnsCollection представляет коллекцию столбцов таблицы.
 Иерархия классов
Teigha::DatabaseServices::ColumnsCollection
 Синтаксис
C#
Visual Basic
Копировать Код
[DefaultMember("Item")] public sealed class ColumnsCollection : IEnumerable<Column>
Копировать Код
<DefaultMember("Item")> Public NotInheritable Class ColumnsCollection Implements IEnumerable(Of Column)
 Описание
 Класс ColumnsCollection представляет коллекцию объектов Column.
 Топики
 Имя
 Описание
 ColumnsCollection Методы
 Ниже перечислены методы класса ColumnsCollection.
 ColumnsCollection Свойства
 Ниже перечислены свойства класса ColumnsCollection.
 Ссылки
 ColumnsCollection Методы, ColumnsCollection Свойства, Топики, ColumnsCollection Методы, ColumnsCollection Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!