Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve2d.HasEndPoint
 Послать отзыв
 Свойство HasEndPoint позволяет проверить, существует ли у данной кривой конечная точка.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool HasEndPoint;
Копировать Код
Public ReadOnly Property HasEndPoint As Boolean
 Возвращает
 Возвращает true, если кривая имеет конечную точку. В противном случае возвращает false.
 Описание
 Свойство HasEndPoint позволяет проверить, существует ли у данной кривой конечная точка. Значение false означает, что параметрический интервал кривой не ограничен сверху.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.Curve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!