Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.UcsTableRecord
 Послать отзыв
 Класс UcsTableRecord представляет записи в таблице UcsTable, каждая из которых связана с конкретной пользовательской системой координат, сохраненной в базе данных чертежа.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::GraphicsInterface::Drawable Teigha::DatabaseServices::DBObject Teigha::DatabaseServices::SymbolTableRecord Teigha::DatabaseServices::UcsTableRecord
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("AcDbUcsTableRecord")] public class UcsTableRecord : SymbolTableRecord
Копировать Код
<Wrapper("AcDbUcsTableRecord")> Public Class UcsTableRecord Inherits SymbolTableRecord
 Описание
 Класс UcsTableRecord представляет записи в таблице UcsTable, каждая из которых связана с конкретной пользовательской системой координат, сохраненной в базе данных чертежа. Этот класс наследует базовую функциональность именованных записей.
 Методы
 Конструкторы
 Teigha.GraphicsInterface.Drawable
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 Drawable
 Конструктор класса Teigha.GraphicsInterface.Drawable. (Унаследован от Drawable)
 Teigha.DatabaseServices.DBObject
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 DBObject
 Конструктор. (Унаследован от DBObject)
 Teigha.DatabaseServices.SymbolTableRecord
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 SymbolTableRecord
 This is SymbolTableRecord, a member of class SymbolTableRecord. (Унаследован от SymbolTableRecord)
 Teigha.DatabaseServices.UcsTableRecord
 Имя
 Описание
 UcsTableRecord
 Конструктор по умолчанию класса UcsTableRecord.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.GraphicsInterface.Drawable
 Имя
 Описание
 Drawable Методы
 Ниже перечислены методы класса Drawable.
 Drawable Свойства
 Ниже перечислены свойства класса Drawable.
 Teigha.DatabaseServices.DBObject
 Имя
 Описание
 DBObject Методы
 Ниже перечислены методы класса DBObject.
 DBObject Свойства
 Ниже перечислены свойства класса DBObject.
 DBObject События
 Ниже перечислены события класса DBObject.
 Teigha.DatabaseServices.SymbolTableRecord
 Имя
 Описание
 SymbolTableRecord Свойства
 Ниже перечислены свойства класса SymbolTableRecord.
 Teigha.DatabaseServices.UcsTableRecord
 Имя
 Описание
 UcsTableRecord Методы
 Ниже перечислены методы класса UcsTableRecord.
 UcsTableRecord Свойства
 Ниже перечислены свойства класса UcsTableRecord.
 Ссылки
 UcsTableRecord Методы, UcsTableRecord Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства, DBObject События
 Ваши комментарии по поводу этого топика: Послать отзыв!