Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Shape.Name
 Послать отзыв
 Свойство Name представляет имя данного объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public String Name;
Копировать Код
Public Property Name As String
 Возвращает
 Возвращает имя объекта. Тип String.
 Описание
 Свойство Name представляет имя данного объекта.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Shape, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!