Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.UndoRecording
 Послать отзыв
 Синтаксис
C#
Visual Basic
public bool UndoRecording;
Public Property UndoRecording() As bool
 Описание
 Возвращает true, если буфер Undo доступен в базе данных.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!