Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DxfFiler.Thickness
 Послать отзыв
 Свойство возвращает толщину. Не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual double Thickness;
Копировать Код
Public Overridable ReadOnly Property Thickness As Double
 Возвращает
 Возвращает толщину. Тип double.
 Описание
 Свойство возвращает толщину. Не реализовано.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.DxfFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!