Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AbstractViewTableRecord.SunId
 Послать отзыв
 Свойство SunId представляет идентификатор объекта, связанного с объектом солнца в видовом экране.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.ObjectId SunId;
Копировать Код
Public ReadOnly Property SunId As DatabaseServices.ObjectId
 Возвращает
 Возвращает идентификатор объекта солнца. Тип DatabaseServices.ObjectId.
 Описание
 Свойство SunId представляет идентификатор объекта, связанного с объектом солнца в видовом экране.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.AbstractViewTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!