Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Polyline.ConvertTo
 Послать отзыв
 Синтаксис
C#
Visual Basic
public Polyline2d ConvertTo(bool transferId);
Public Function ConvertTo(transferId As bool) As Polyline2d
 Параметры
 Параметры
 Описание
 transferId
 Признак, будет или нет производиться HandOverTo между Polyline и Polyline2D
 Описание
 Этот метод создает Polyline2D из объекта Polyline и возвращает вновь созданный объект Polyline2D.
 Если transferId установлен в true, объект Polyline2D станет резидентным в базе данных. Этот объект сможет получить Id объекта, дескриптор и любые расширенные данные, расширенный словарь и реакторы из Polyline, из которого вызван метод. Объект Polyline перестанет быть резидентом базы данных и может быть удален с помощью оператора delete C++.
 Если transferId установлен в false, Polyline останется в базе данных как он и был и вызвавший метод должен закрыть его. Полученный объект Polyline2D и все его вершины не станут резидентом базы данных, и, если они не будут добавлены к базе данных, то должны быть удалены.
 Ссылки
 Teigha.DatabaseServices.Polyline, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!