Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 DimStyleTableRecord.Dimalt
 Послать отзыв
 Свойство отвечает за настройку отображения альтернативных измерений в размерах.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual bool Dimalt { get; set; }
Копировать Код
Public Overridable Property Dimalt As Boolean
 Возвращает
 Возвращает тип данных bool:
true - отображение альтернативных измерений в размерах включено;
false - отображение альтернативных измерений в размерах выключено.
 Описание
 В свойстве хранится текущая настройка отображения альтернативных измерений в размерах. В качестве значения свойства доступны следующие:
false – отключено (по умолчанию);
true – включено.
 Свойство также доступно через системную переменную DIMALT и пользовательское меню в окне изменения/создания размерного стиля:
  При изменении системной переменной DIMALT будет создан новый размерный стиль под названием <переопределение> на основе текущего с новым значением DIMALT.
 Условия
 Чтение и запись.
 Пример
 Пример изменения настройки отображения альтернативных измерений в размерах (значения свойства Dimalt) в размерном стиле Standard:
C#
 Копировать Код
public partial class Commands { [Teigha.Runtime.CommandMethod("DimaltChange")] public void DimaltStandardDimStyle() { // Получение ссылки на активный документ HostMgd.ApplicationServices.Document doc = HostMgd.ApplicationServices.Application.DocumentManager.MdiActiveDocument; // Получение ссылки на редактор документа HostMgd.EditorInput.Editor ed = doc.Editor; // Получение ссылки на базу данных документа Teigha.DatabaseServices.Database db = doc.Database; // Начало транзакции с базой данных документа using (Teigha.DatabaseServices.Transaction trans = db.TransactionManager.StartTransaction()) { // Открываем таблицу размерных стилей для чтения Teigha.DatabaseServices.DimStyleTable dimStyleTable = trans.GetObject(db.DimStyleTableId, Teigha.DatabaseServices.OpenMode.ForRead) as Teigha.DatabaseServices.DimStyleTable; // Находим в таблице размерных стилей ObjectId нужного стиля по его названию Teigha.DatabaseServices.ObjectId styleId = dimStyleTable["Standard"]; // Открываем таблицу размерного стиля для изменений Teigha.DatabaseServices.DimStyleTableRecord obj = trans.GetObject(styleId, Teigha.DatabaseServices.OpenMode.ForWrite) as Teigha.DatabaseServices.DimStyleTableRecord; ed.WriteMessage($"nDimalt before: {obj.Dimalt}"); // Изменяем признак отображения альтернативных единиц в размерах obj.Dimalt = true; ed.WriteMessage($"nDimalt after: {obj.Dimalt}"); trans.Commit(); } } }
 Результат работы команды DimaltChange:
 Было:
 Стало:
 Ссылки
 Teigha.DatabaseServices.DimStyleTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!