Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbCurve2d.NurbCurve2d
 Послать отзыв
 Конструктор класса NurbCurve2d. Создает двумерную NURBS кривую, которая интерполирует указанный массив двумерных точек в пределах точности по умолчанию.
 Синтаксис
C#
Visual Basic
Копировать Код
public NurbCurve2d( ref Point2dCollection fitPoints );
Копировать Код
Public Sub New( ByRef fitPoints As Point2dCollection )
 Параметры
 Параметры
 Описание
 fitPoints
 Входная коллекция определяющих точек. Тип Point2dCollection.
 Описание
 Конструктор класса NurbCurve2d. Создает двумерную NURBS кривую, которая интерполирует указанный массив двумерных точек в пределах точности по умолчанию.
 Ссылки
 Teigha.Geometry.NurbCurve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!