Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ObjectId.IsResident
 Послать отзыв
 Свойство возвращает значение true, если объект, связанный с этим ObjectId, находится в памяти.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsResident;
Копировать Код
Public Property IsResident() As Boolean
 Возвращает
 Возвращает значение true, если объект, связанный с этим ObjectId, находится в памяти. В противном случае возвращает false.
 Описание
 Свойство возвращает значение true, если объект, связанный с этим ObjectId, находится в памяти.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.ObjectId, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!