Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DwgFiler.WriteAddress
 Послать отзыв
 Метод предназначен для записи указанного адреса памяти в данный объект Filer.
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract void WriteAddress( IntPtr value );
Копировать Код
Public MustOverride Sub WriteAddress( value As IntPtr )
 Параметры
 Параметры
 Описание
 value
 Адрес, который следует записать в Filer. Тип IntPtr.
 Описание
 Метод предназначен для записи указанного адреса памяти в данный объект Filer.
 Ссылки
 Teigha.DatabaseServices.DwgFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!