Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LayoutPaperPE
 Послать отзыв
 Класс LayoutPaperPE является классом расширения протокола для объектов Layout, позволяющий настраивать фон чертежа во время векторизации пространства PaperSpace.
 Иерархия классов
Teigha::DatabaseServices::LayoutPaperPE
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdDbLayoutPaperPE")] public abstract class LayoutPaperPE : RXObject
Копировать Код
<Wrapper("OdDbLayoutPaperPE")> Public MustInherit Class LayoutPaperPE Inherits RXObject
 Описание
 Класс LayoutPaperPE является классом расширения протокола для объектов Layout.
 Класс расширения протокола может быть зарегистрирован в классе Layout, чтобы предоставить клиентскому приложению для векторизации возможность настраивать фон чертежа во время векторизации пространства PaperSpace.
 Топики
 Имя
 Описание
 LayoutPaperPE Методы
 Ниже перечислены методы класса LayoutPaperPE.
 Ссылки
 LayoutPaperPE Методы, Топики, LayoutPaperPE Методы
 Ваши комментарии по поводу этого топика: Послать отзыв!