Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocAction.GetActionsDependentOnObject
 Послать отзыв
 Метод позволяет получить все действия, которые зависят от заданного объекта DBObject (т.е. имеют зависимости AssocDependency для этого объекта).
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectIdCollection GetActionsDependentOnObject( ref DBObject dbObj, bool readDependenciesWanted, bool writeDependenciesWanted );
Копировать Код
Public Function GetActionsDependentOnObject( ByRef dbObj As DBObject, readDependenciesWanted As Boolean, writeDependenciesWanted As Boolean ) As ObjectIdCollection
 Параметры
 Параметры
 Описание
 dbObj
 Входной объект, для которого ищутся ассоциативные действия. Тип DBObject. Объект должен быть открыт по крайней мере для чтения.
 readDependenciesWanted
 Если true, то следует искать действия, которые зависят от объекта dbObj. Тип bool.
 writeDependenciesWanted
 Если true, то следует искать действия, которые изменяют объект dbObj. Тип bool.
 Возвращает
 Возвращает коллекцию ObjectId найденных зависимостей. Тип ObjectIdCollection.
 Описание
 Метод позволяет получить все действия, которые зависят от заданного объекта DBObject (т.е. имеют зависимости AssocDependency для этого объекта).
 Ссылки
 Teigha.DatabaseServices.AssocAction, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!