Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Entity2d.Clone
 Послать отзыв
 Метод предназначен для создания полной копии данного объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual Object Clone();
Копировать Код
Public Overridable Function Clone() As Object
 Возвращает
 Возвращает новый объект, являющийся полной копией данного объекта. Тип Object.
 Описание
 Метод предназначен для создания полной копии данного объекта.
 Ссылки
 Teigha.Geometry.Entity2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!