Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbCurve2dFitData.FitTolerance
 Послать отзыв
 Свойство FitTolerance представляет заданную точность интерполяции.
 Синтаксис
C#
Visual Basic
Копировать Код
public Tolerance FitTolerance;
Копировать Код
Public ReadOnly Property FitTolerance As Tolerance
 Возвращает
 Возвращает точность интерполяции. Тип Tolerance.
 Описание
 Свойство FitTolerance представляет заданную точность интерполяции.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.NurbCurve2dFitData, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!