Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.BoundBlock3d.Direction2
 Послать отзыв
 Свойство Direction2 представляет направление и длину второй стороны данной граничной рамки.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d Direction2;
Копировать Код
Public ReadOnly Property Direction2 As Vector3d
 Возвращает
 Возвращает вектор, определяющий вторую сторону граничной рамки. Тип Vector3d.
 Описание
 Свойство Direction2 представляет направление и длину второй стороны данной граничной рамки.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.BoundBlock3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!