Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод DBText.CorrectSpelling
 Послать отзыв
 Синтаксис
C#
Visual Basic
public int CorrectSpelling();
Public Function CorrectSpelling() As Integer
 Описание
 Метод выполняет проверку правописания текста для исправления орфографических ошибок. Проверка правописания встроена в nanoCAD, поэтому метод может не разрабатываться в пользовательских библиотеках.
 Метод возвращает 0 в случае успеха (если ошибок нет или они исправлены) и 1 в противном случае.
 Ссылки
 Teigha.DatabaseServices.DBText, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!