Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Событие Database.DeepCloneEnded
 Послать отзыв
 Синтаксис
C#
Visual Basic
public event EventHandler DeepCloneEnded;
Public Event DeepCloneEnded As EventHandler
 Описание
 Событие показывает, что операция глубокого клонирования успешно завершена.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!