Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CubicSplineCurve3d.SetFitPointAt
 Послать отзыв
 Метод позволяет переопределить в этом сплайне определяющую точку с указанным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetFitPointAt( int i, Point3d point );
Копировать Код
Public Sub SetFitPointAt( i As Integer, point As Point3d )
 Параметры
 Параметры
 Описание
 i
 Индекс определяющей точки. Тип int.
 point
 Новые координаты определяющей точки с индексом i. Тип Point3d.
 Описание
 Метод позволяет переопределить в этом сплайне определяющую точку с указанным индексом.
 Ссылки
 Teigha.Geometry.CubicSplineCurve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!