Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DwgFiler.Seek
 Послать отзыв
 Метод предназначен для перемещения указателя ввода-вывода в указанное место в этом объекте Filer.
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract void Seek( long long offset, int method );
Копировать Код
Public MustOverride Sub Seek( offset As Long Long, method As Integer )
 Параметры
 Параметры
 Описание
 offset
 Смещение в количестве байтов. Тип long long.
 method
 Тип поиска. Тип int
 Описание
 Метод предназначен для перемещения указателя ввода-вывода в указанное место в этом объекте Filer. Характер смещения можно настроить аргументом method:
 Тип
 Описание
 0
 Абсолютное значение
 1
 Относительно текущего положения
 2
 От конца файла
 Ссылки
 Teigha.DatabaseServices.DwgFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!