Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Line2d.Set
 Послать отзыв
 Метод позволяет переопределить данную прямую, используя две новых опорных точки.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Set( Point2d point1, Point2d point2 );
Копировать Код
Public Sub [Set]( point1 As Point2d, point2 As Point2d )
 Параметры
 Параметры
 Описание
 point1
 Первая точка, через которую проходит прямая. Тип Point2d.
 point2
 Вторая точка, через которую проходит прямая. Тип Point2d.
 Описание
 Метод позволяет переопределить данную прямую, используя две новых опорных точки.
 Ссылки
 Teigha.Geometry.Line2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!