Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Делегат Teigha.DatabaseServices.LayerStateRenameEventHandler
 Послать отзыв
 This is type Teigha::DatabaseServices::LayerStateRenameEventHandler.
 Синтаксис
C#
Visual Basic
public delegate LayerStateRenameEventHandler();
Public Delegate Sub LayerStateRenameEventHandler()
 Ваши комментарии по поводу этого топика: Послать отзыв!