Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GridPropertyParameter.Linetype
 Послать отзыв
 Свойство представляет тип линий сетки.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.ObjectId Linetype;
Копировать Код
Public Linetype As DatabaseServices.ObjectId
 Возвращает
 Возвращает идентификатор типа линий сетки. Тип DatabaseServices.ObjectId.
 Описание
 Свойство представляет тип линий сетки.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.GridPropertyParameter, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!