Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CompoundObjectId.Set
 Послать отзыв
 Метод позволяет определить данный CompoundObjectId, используя входной идентификатор ObjectId из указанной базы данных.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Set( ObjectId id, ref Database hostDatabase );
Копировать Код
Public Sub Set( id As ObjectId, ByRef hostDatabase As Database )
 Параметры
 Параметры
 Описание
 id
 Входной идентификатор объекта. Тип ObjectId.
 hostDatabase
 Главная база данных. Тип Database.
 Описание
 Метод позволяет определить данный CompoundObjectId, используя входной идентификатор ObjectId из указанной базы данных.
 Ссылки
 Teigha.DatabaseServices.CompoundObjectId, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!