Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство DBText.Thickness
 Послать отзыв
 Синтаксис
C#
Visual Basic
public double Thickness;
Public Property Thickness() As Double
 Описание
 Обеспечивает доступ к значению толщины текста. Толщина текста — это размер текста по направлению вдоль вектора нормали (иногда называемым направлением "вытеснения").
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.DBText, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!