Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AttributeCollection.Count
 Послать отзыв
 Свойство предоставляет доступ к количеству элементов в коллекции.
 Синтаксис
C#
Visual Basic
Копировать Код
public int Count;
Копировать Код
Public Property Count() As Integer
 Описание
 Свойство Count предоставляет доступ к количеству элементов в коллекции.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.AttributeCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!