Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LayoutManager.AbortLayoutRemoved
 Послать отзыв
 Cобытие создается, когда прерывается удаление листа.
 Синтаксис
C#
Visual Basic
Копировать Код
public event LayoutEventHandler AbortLayoutRemoved;
Копировать Код
Public Event AbortLayoutRemoved As LayoutEventHandler
 Описание
 Cобытие создается, когда прерывается удаление листа.
 Ссылки
 Teigha.DatabaseServices.LayoutManager, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!