Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MentalRayRenderSettings.TileOrder
 Послать отзыв
 Свойство TileOrder представляет порядок тайлинга (укладки) фрагментов изображения при рендеринге.
 Синтаксис
C#
Visual Basic
Копировать Код
public GraphicsInterface.TileOrder TileOrder;
Копировать Код
Public Property TileOrder As GraphicsInterface.TileOrder
 Возвращает
 Возвращает порядок тайлинга фрагментов изображения при рендеринге. Значение из перечисления GraphicsInterface.TileOrder.
 Описание
 Свойство TileOrder представляет порядок тайлинга (укладки) фрагментов изображения при рендеринге.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MentalRayRenderSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!