Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Column
 Послать отзыв
 Класс Column представляет столбец диапазона ячеек.
 Иерархия классов
Teigha::DatabaseServices::CellRange Teigha::DatabaseServices::Column
 Синтаксис
C#
Visual Basic
Копировать Код
[DefaultMember("Item")] public sealed class Column : CellRange
Копировать Код
<DefaultMember("Item")> Public NotInheritable Class Column Inherits CellRange
 Описание
 Класс Column представляет столбец диапазона ячеек.
 Топики
 Имя
 Описание
 CellRange Методы
 Ниже перечислены методы класса CellRange.
 CellRange Операторы
 Ниже перечислены операторы класса CellRange.
 CellRange Свойства
 Ниже перечислены свойства класса CellRange.
 Teigha.DatabaseServices.Column
 Имя
 Описание
 Column Свойства
 Ниже перечислены свойства класса Column.
 Ссылки
 Column Свойства, Топики, CellRange Методы, CellRange Операторы, CellRange Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!