Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.OsnapPointRef.UpdateSubentPath
 Послать отзыв
 Метод обновляет пути подобъектов, используя предоставленную карту идентификаторов.
 Синтаксис
C#
Visual Basic
Копировать Код
public override void UpdateSubentPath( ref IdMapping idMap );
Копировать Код
Public Overrides Sub UpdateSubentPath( ByRef idMap As IdMapping )
 Параметры
 Параметры
 Описание
 idMap
 Входная карта идентификаторов для обновления путей подобъектов. Тип IdMapping.
 Описание
 Метод обновляет пути подобъектов, используя предоставленную карту сопоставления идентификаторов.
 Ссылки
 Teigha.DatabaseServices.OsnapPointRef, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!