Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CellContentsCollection.Add
 Послать отзыв
 Метод добавляет в коллекцию дополнительное содержимое с недействительными индексами.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Add();
Копировать Код
Public Sub Add()
 Описание
 Метод добавляет в коллекцию дополнительное содержимое с недействительными индексами.
 Ссылки
 Teigha.DatabaseServices.CellContentsCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!