Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Field.GetData
 Послать отзыв
 Метод предназначен для получения данных из объекта поля по указанному ключу.
 Синтаксис
C#
Visual Basic
Копировать Код
public Object GetData( ref String key );
Копировать Код
Public Function GetData( ByRef key As String ) As Object
 Параметры
 Параметры
 Описание
 key
 Ключ для извлечения данных. Тип String. Не может быть null или пустой строкой.
 Возвращает
 Возвращает данные по указанному ключу. Тип Object.
 Описание
 Метод предназначен для получения данных из объекта поля по указанному ключу.
 Ссылки
 Teigha.DatabaseServices.Field, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!