Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SurfaceSliceResults.NewSurface
 Послать отзыв
 Свойство NewSurface представляет положительную половину разрезанной поверхности, когда поверхность не может быть отредактирована непосредственно, поскольку она наследует геометрию другой поверхности Surface.
 Синтаксис
C#
Visual Basic
Копировать Код
public SuDatabaseServices.Surfacerface NewSurface;
Копировать Код
Public Property NewSurface As DatabaseServices.Surface
 Возвращает
 Возвращает положительную (новую) половину разрезанной поверхности. Тип SuDatabaseServices.Surfacerface.
 Описание
 Свойство NewSurface представляет положительную половину разрезанной поверхности, когда поверхность не может быть отредактирована непосредственно, поскольку она наследует геометрию другой поверхности Surface.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.SurfaceSliceResults, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!