Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ObjectOverrule
 Послать отзыв
 Этот класс переопределяет подмножество операций для объекта базы данных. Он является базовым для классов, производных от OdDbObject, и используется для настройки их поведения.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::Runtime::Overrule Teigha::DatabaseServices::ObjectOverrule
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdDbObjectOverrule")] public class ObjectOverrule : Overrule;
Копировать Код
<Wrapper("OdDbObjectOverrule")> Public Class ObjectOverrule Inherits Overrule
 Описание
 Этот класс переопределяет подмножество операций для объекта базы данных. Он является базовым для классов, производных от OdDbObject, и используется для настройки их поведения. Каждая реализация по умолчанию вызывает соответствующий метод целевого класса.
 Методы
 Конструкторы
 Teigha.DatabaseServices.ObjectOverrule
 Имя
 Описание
 ObjectOverrule
 Это обзор перегрузок ObjectOverrule.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.Runtime.Overrule
 Имя
 Описание
 Overrule Методы
 Ниже перечислены методы класса Overrule.
 Overrule Свойства
 Ниже перечислены свойства класса Overrule.
 Teigha.DatabaseServices.ObjectOverrule
 Имя
 Описание
 ObjectOverrule Методы
 Ниже перечислены методы класса ObjectOverrule.
 Ссылки
 ObjectOverrule Конструктор, ObjectOverrule Методы, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!