Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Entity.GetSubentityPathsAtGraphicsMarker(SubentityType
 Послать отзыв
 Метод предназначен для получения массива путей к геометрическим подобъектам (FullSubentityPath) на основе графического маркера (GS-маркера) и дополнительных параметров выбора, таких как тип подобъекта, точка выбора и матрица преобразования. Он используется для определения конкретного подобъекта сложного геометрического объекта, выбранного пользователем на экране, с учетом вложенных блоков и контекста отображения.
 Этот метод особенно важен при работе с интерактивным редактированием, подсветкой или выбором отдельных элементов составных объектов.
 Синтаксис
C#
Visual Basic
Копировать Код
[Obsolete("Use the overload taking IntPtr instead.")] public FullSubentityPath[] GetSubentityPathsAtGraphicsMarker(SubentityType type, int gsMark, Point3d pickPoint, Matrix3d viewTransform, int numInserts, ObjectId[] entityAndInsertStack);
Копировать Код
<Obsolete("Use the overload taking IntPtr instead.")> Public Function GetSubentityPathsAtGraphicsMarker(type As SubentityType, gsMark As Integer, pickPoint As Point3d, viewTransform As Matrix3d, numInserts As Integer, entityAndInsertStack As ObjectId[]) As FullSubentityPath[]
 Параметры
 Параметры
 Описание
 type
 Требуемый тип геометрического подобъекта, возможные типы подобъектов — это SubentityType.Face, SubentityType.Edge, SubentityType.Vertex, SubentityType.Mline
 gsMark
 GS маркер, представляющий конкретный геометрический подобъект (обычно полученный из ads_ssnamex()). Тип int
 pickPoint
 Выбранная при выборе объекта точка (в WCS координатах) (эта точка должна быть на или очень близко к требуемому подобъекту). Тип Point3d
 viewTransform
 Матрица преобразования из WCS в DCS. Тип Matrix3d
 numInserts
 Количество Id объектов BlockReferences в entityAndInsertStack (должно быть на 1 меньше, чем общее количество геометрических объектов в entityAndInsertStack, поскольку первый вход — это сам геометрический объект, который отсутствует в BlockReference). Если владельцем объекта прямо является пространство модели или пространство листа BlockTableRecords, то опустите этот параметр и ему будет подставлено значение по умолчанию, равное 0. Тип int
 entityAndInsertStack
 Массив Id объектов, которые составляют геометрический объект. Список упорядочен от "главного" объекта, к наиболее удаленным BlockReference, которые есть в пространстве модели или листа. Если владельцем геометрического объекта прямо является пространство модели или листа, то опустите этот параметр, и ему будет подставлено значение по умолчанию, равное null. Тип ObjectId[]
 Возвращает
 Метод возвращает массив объектов типа FullSubentityPath, каждый из которых представляет собой полный путь к конкретному геометрическому подобъекту внутри иерархии объектов чертежа. Каждый путь включает информацию о типе подобъекта, его идентификаторе и контексте вложенности (включая блоки и вставки), что позволяет однозначно определить, какой именно элемент был выбран пользователем.
 Если подходящих подобъектов не найдено, метод может вернуть пустой массив. В случае ошибки (например, при некорректных входных данных) также может возвращаться значение null.
 Описание
 Геометрические объекты используют различные геометрические примитивы при своем графическом отображении. Частью этого механизма является способность установки соответствия целого идентификатора, называемого графически системным маркером (или GS маркером) с каждым примитивом или группой примитивов. Посредством использования определенных механизмов отбора, может быть получен GS маркер для реального геометрического подобъекта, выбранного на экране, и, вместе с некоторой другой информацией, передан в данный метод, и может быть использован для создания одного или нескольких объектов FullSubentityPath, каждый из которых представляет геометрический подобъект и обеспечивает более полное описание геометрического подобъекта и его окружения. Такие объекты FullSubentityPath могут использоваться этим и некоторыми другими методами для различных целей, таких как подсветка и отмена подсветки геометрических подобъектов на экране.
 Использование метода
 Если собственником геометрического объекта (частью которого является геометрический подобъект) является прямо пространство модели или пространство листа BlockTableRecord, то numInserts и entityAndInsertStack не учитываются и используются их значения по умолчанию.
 viewTransform может быть вычислен с использованием функции ads_trans() на векторах (1,0,0), (0,1,0) и (0,0,1) для преобразования их из DCS в WCS. Эти три вектора преобразования (с дополнительным 0, добавленным в конец каждого из них), могут быть использованы как первые три строки матрицы. Последняя строка не используется, и остается, как она есть. Этот параметр не используется для любых встроенных в nanoCAD геометрических объектов.
 Если геометрический блок вложен в одно из определений блока, то параметры numInserts и entityAndInsertStack должны быть заполнены не нулевыми значениями и не значением null. Если эти параметры не заполнены, то данный метод выдает ошибку и возвращает ошибочный статус. Один из способов получения необходимых Id объекта, заключается в использовании ads_nentselp() для получения списка ads_names контейнеров объектов. Этот список должен быть затем преобразован в список Id объектов и наоборот.
 Разработка метода в производных классах
 Классы геометрических объектов, которые не устанавливают GS маркеры, вероятно, не должны использовать этот метод, т.к. GS маркер является первичным (и, часто, единственным) средством различия геометрических подобъектов.
 Если он реализован, этот метод должен использовать данные типов gsMark, pickPoint, viewTransform, numInserts и entityAndInsertStack для определения того, какой геометрический объект или подобъект соответствует критериям по этим параметрам. Далее метод должен создать динамический массив FullSubentityPaths (созданный с помощью оператора new) с одним элементом на каждый геометрический подобъект, определенный на первом шаге. В завершении, метод должен заполнить в каждом объекте FullSubentityPaths массива информацию, соответствующую тому геометрическому подобъекту, который этот элемент представляет.
 Если numInserts == 0 и entityAndInsertStack == NULL, важно проверить, что владелец геометрического объекта в самом деле пространство модели или пространство листа BlockTableRecord. Это может быть сделано с использованием метода геометрического объекта ownerId() для получения Id объекта владельца, и затем открытия этого объекта и использования метода name() для получения имени в виде строки. Если собственник объекта — не пространство модели или пространство листа BlockTableRecord, и numInserts == 0 и/или entityAndInsertStack == NULL, то входные данные являются не корректными и метод должен установить numPaths в 0 и вернуть NULL.
 Если объект FullSubentityPath имеет две части, и массив из Id объектов содержит все входящие объекты, то встроенное свойство SubentId, в свою очередь, содержит два элемента: значение индекса и SubentityType.
 Если "главный" геометрический объект (геометрический объект, от имени которого метод вызывается) не расположен внутри BlockReferences (это означает, что numInserts == 0 и entityAndInsertStack == NULL), то массив Id объектов должен содержать Id "главного" геометрического объекта. Если "главный" объект включен в один или несколько BlockReferences, то ObjectIdArray тот же самый, что и entityAndInsertStack, поэтому все, что требуется в этом случае — это копирование элементов entityAndInsertStack в ObjectIdArray.
 Элементы данных SubentType во встроенном SubentityId должны быть установлены, также как и тип.
 Элемент данных индекса во встроенном SubentityId может иметь любое значение, которое вы установите (часто это просто значение GS маркера), но, если оно применяется, следующие методы должны быть в состоянии интерпретировать его для определения соответствующего GS маркера(ов) геометрического подобъекта (подобъектов):
GetGraphicsMarkersAtSubentPath()
GetSubentity()
 Параметры pickPoint и viewTransform обеспечивают дополнительную помощь (если необходимо) в определении того, какие геометрические подобъекты участвуют. Например, некоторые типы геометрических объектов могут отображаться по-разному в зависимости от видового экрана. В таких случаях может использоваться матрица преобразования viewTransform.
 Параметр viewTransform представляет матрицу преобразования из WCS (мировых координат) в DCS.
 Отображаемая система координат ориентирована так, что положительное направление оси Z направлено из монитора по направлению к пользователю, положительное направление оси X направлено по горизонтали слева направо в экране, и положительное направление оси Y направлено вертикально вверх экрана.
 Так, если текущий видовой экран в точке (1,0,0) (просмотр всегда производится от точки (0,0,0)), то матрица преобразования viewTransform должна быть
 0 1 0 0
 0 0 1 0
 1 0 0 0
 0 0 0 1
 В этой матрице последняя строка и последний столбец не используются. Заметим также, что третья строка задает ось Z DCS в WCS координатах (который представляет WCS версию системной переменной nanoCAD VIEWPOINT).
 Возвращает динамически созданный массив из одного или более FullSubentityPath созданных из GS маркера и другой переданной в метод информации.
 Ссылки
 Teigha.DatabaseServices.Entity, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!