Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ResultBuffer.ToString
 Послать отзыв
 Метод предназначен для получения эквивалентного строкового представления этого объекта в указанном формате и с использованием языковых и региональных настроек, определяемых заданным провайдером.
 Синтаксис
C#
Visual Basic
Копировать Код
public String ToString( ref String format, ref IFormatProvider provider );
Копировать Код
Public Function ToString( ByRef format As String, ByRef provider As IFormatProvider ) As String
 Параметры
 Параметры
 Описание
 format
 Формат строкового представления этого объекта, тип String.
 provider
 Провайдер языковых и региональных настроек, тип IFormatProvider.
 Возвращает
 Возвращает эквивалентное строковое представление этого объекта, тип String.
 Описание
 Метод предназначен для получения эквивалентного строкового представления этого объекта в указанном формате и с использованием языковых и региональных настроек, определяемых заданным провайдером.
 Подробнее см. в документации Microsoft .NET API.
 Ссылки
 Teigha.DatabaseServices.ResultBuffer, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!