Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.Dimtmove
 Послать отзыв
 Свойство определяет правила перемещения размерного текста относительно размерной линии.
 Синтаксис
C#
Visual Basic
Копировать Код
public int Dimtmove;
Копировать Код
Public Property Dimtmove As Integer
 Возвращает
 Возвращает код правила перемещения размерного текста относительно размерной линии. Тип int.
 Описание
 Свойство Dimtmove задает или возвращает правило перемещения размерного текста и размерных линий относительно друг друга при перетаскивании текста.
 Значение
 Описание
 0
 Текст размера и размерная линия перемещаются совместно.
 1
 Текст размера перемещается независимо от размерной линии и соединяется с ней выноской.
 2
 Текст размера перемещается независимо от размерной линии, выноска не отображается.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!