Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObject.DxfIn(DxfFiler)
 Послать отзыв
 Метод считывает данные этого объекта из файла формата dxf.
 Синтаксис
C#
Visual Basic
Копировать Код
public void DxfIn(DxfFiler filer);
Копировать Код
Public Sub DxfIn(filer As DxfFiler)
 Параметры
 Параметры
 Описание
 filer
 Набор данных, которые необходимо считать из dxf-файла. Тип DxfFiler
 Описание
 Этот метод выполняет несколько внутренних учетных действий, и затем читает любые xdata, присоединенные к объекту. Note Создание объектов с xdata перед данными объекта не является хорошей практикой, но для совместимости такой режим поддерживается.
 Ссылки
 Teigha.DatabaseServices.DBObject, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!