Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Matrix3d.WorldToPlane
 Послать отзыв
 Метод формирует матрицу преобразования кординат из мировой системы координат (WCS) в координаты на заданной плоскости.
 Синтаксис
C#
Visual Basic
Копировать Код
public Matrix3d WorldToPlane( ref Plane plane );
Копировать Код
Public Function WorldToPlane( ByRef plane As Plane ) As Matrix3d
 Параметры
 Параметры
 Описание
 plane
 Целевая плоскость. Тип Plane.
 Возвращает
 Возвращает матрицу Matrix3d, которая обеспечивает заданное преобразование координат.
 Описание
 Метод формирует матрицу преобразования кординат из мировой системы координат (WCS) в координаты на заданной плоскости.
 Ссылки
 Teigha.Geometry.Matrix3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!