Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.KnotCollection.IsOn
 Послать отзыв
 Метод позволяет проверить, является ли указанный узел элементом данной коллекции узлов в пределах заданной точности KnotCollection.Tolerance.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsOn( double knot );
Копировать Код
Public Function IsOn( knot As Double ) As Boolean
 Параметры
 Параметры
 Описание
 knot
 Проверяемое значение. Тип double.
 Возвращает
 Возвращает true, если значение knot является элементом данной коллекции в пределах заданной точности. В противном случае возвращает false.
 Описание
 Метод позволяет проверить, является ли указанный узел элементом данной коллекции узлов в пределах заданной точности KnotCollection.Tolerance.
 Ссылки
 Teigha.Geometry.KnotCollection, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!