Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Assoc2dConstraintGroup.GetDOF
 Послать отзыв
 Свойство позволяет получить число степеней свободы (DOF) данной группы ограничений.
 Синтаксис
C#
Visual Basic
Копировать Код
public int GetDOF;
Копировать Код
Public Property GetDOF() As Integer
 Возвращает
 Возвращает количество степеней свободы. Тип int.
 Описание
 Свойство позволяет получить число степеней свободы (DOF) данной группы ограничений. Это число включает в себя позиционные степени свободы корректно заданной модели.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Assoc2dConstraintGroup, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!