Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SymbolUtilityServices.GetTextStyleStandardId
 Послать отзыв
 Метод позволяет извлечь идентификатор стандартного текстового стиля.
 Синтаксис
C#
Visual Basic
Копировать Код
public static ObjectId GetTextStyleStandardId( ref Database databasePointer );
Копировать Код
Public Shared Function GetTextStyleStandardId( ByRef databasePointer As Database ) As ObjectId
 Параметры
 Параметры
 Описание
 databasePointer
 База данных, из которой извлекается идентификатор объекта. Тип Database.
 Возвращает
 Возвращает ненулевой идентификатор стандартного текстового стиля. Тип ObjectId.
 Описание
 Метод позволяет извлечь идентификатор стандартного текстового стиля.
 Ссылки
 Teigha.DatabaseServices.SymbolUtilityServices, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!