Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Entity.GetPlane()
 Послать отзыв
 Метод предназначен для получения плоскости, в которой расположен объект.
 Синтаксис
C#
Visual Basic
Копировать Код
public Plane GetPlane();
Копировать Код
Public Function GetPlane() As Plane
 Возвращает
 Возвращает плоскость, в которой расположен текущий объект. Тип Plane
 Описание
 Метод позволяет получить плоскость, в которой расположен текущий геометрический объект. Используется для определения координатной плоскости, содержащей геометрию кривой.
 Ссылки
 Teigha.DatabaseServices.Entity, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!