Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.HyperLinkCollection.Item
 Послать отзыв
 Свойство предоставляет доступ к элементу коллекции с указанным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public HyperLink this[int index];
Копировать Код
Default Public Property Item( index As Integer ) As HyperLink
 Параметры
 Параметры
 Описание
 index
 Индекс элемента коллекции. Тип int.
 Возвращает
 Возвращает элемент коллекции с индексом index. Тип HyperLink.
 Описание
 Свойство предоставляет доступ к элементу коллекции с указанным индексом index.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.HyperLinkCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!