Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод RasterImage.AssociateRasterDef
 Послать отзыв
 Синтаксис
C#
Visual Basic
public void AssociateRasterDef(ref RasterImageDef definition);
Public Sub AssociateRasterDef(ByRef definition As RasterImageDef)
 Параметры
 Параметры
 Описание
 definition
 Определение растрового изображения
 Описание
 Связывает определение растрового изображения с объектом.
 Ссылки
 Teigha.DatabaseServices.RasterImage, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!