Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DwgFiler.ReadInt16
 Послать отзыв
 Метод предназначен для получения значения Int16 из текущего элемента данного объекта Filer.
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract short ReadInt16();
Копировать Код
Public MustOverride Function ReadInt16() As Short
 Возвращает
 Возвращает значение из текущего элемента данного объекта Filer. Тип short.
 Описание
 Метод предназначен для получения значения Int16 из текущего элемента данного объекта Filer.
 Ссылки
 Teigha.DatabaseServices.DwgFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!