Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Viewport.HiddenLinesRemoved
 Послать отзыв
 Свойство HiddenLinesRemoved позволяет определить, будут ли удалены скрытые линии в данном видовом экране при выводе на печать.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool HiddenLinesRemoved;
Копировать Код
Public Property HiddenLinesRemoved As Boolean
 Возвращает
 Возвращает true, если скрытые линии будут удалены. В противном случае возвращает false.
 Описание
 Свойство HiddenLinesRemoved позволяет определить, будут ли удалены скрытые линии в данном видовом экране при выводе на печать.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Viewport, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!