Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.SurfaceSurfaceIntersectorConfigurations.Dimension
 Послать отзыв
 Свойство Dimension представляет размерность объекта пересечения двух поверхностей.
 Синтаксис
C#
Visual Basic
Копировать Код
public int Dimension;
Копировать Код
Public ReadOnly Property Dimension As Integer
 Возвращает
 Возвращает размерность объекта пересечения двух поверхностей. Тип int. В случае точки возвращает 0, в случае кривой 1.
 Описание
 Свойство Dimension представляет размерность объекта пересечения двух поверхностей (кривая или точка).
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.SurfaceSurfaceIntersectorConfigurations, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!