Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GripData.CallWorldDraw
 Послать отзыв
 Метод предназначен для отрисовки графики пользовательского глифа ручки, которая не зависит от видового экрана.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool CallWorldDraw( ref GraphicsInterface.WorldDraw worldDraw, ObjectId entityId, DrawType t, Point3d? imageGripPoint, double dGripSize );
Копировать Код
Public Function CallWorldDraw( ByRef worldDraw As GraphicsInterface.WorldDraw, entityId As ObjectId, t As DrawType, imageGripPoint As Point3d?, dGripSize As Double ) As Boolean
 Параметры
 Параметры
 Описание
 worldDraw
 Входной интерфейс Teigha.GraphicsInterface.WorldDraw.
 entityId
 Идентификатор объекта чертежа. Тип ObjectId.
 t
 Тип отображения ручки. Перечисление GripData.DrawType.
 imageGripPoint
 Базовая точка изображения ручки. Тип Point3d?.
 dGripSize
 Размер ручки. Тип double.
 Возвращает
 Возвращает true в случае успешного завершения операции. В противном случае возвращает false.
 Описание
 Метод предназначен для отрисовки графики пользовательского глифа ручки, которая не зависит от видового экрана.
 Ссылки
 Teigha.DatabaseServices.GripData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!