Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObject.SwapIdWith(ObjectId
 Послать отзыв
 Метод заменяет идентификаторы объектов, Handles, расширенные данные (XData) и словарь расширений местами между этим объектом и другим объектом.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SwapIdWith(ObjectId otherId, bool swapExtendedData, bool swapExtensionDictionary);
Копировать Код
Public Sub SwapIdWith(otherId As ObjectId, swapExtendedData As bool, swapExtensionDictionary As bool)
 Параметры
 Параметры
 Описание
 otherId
 Id объекта, с которым производится обмен. Тип ObjectId
 swapExtendedData
 Признак, показывающий, должен ли быть обмен расширенными данными. Тип bool геометрических объектов
 swapExtensionDictionary
 Признак, показывающий, должен ли быть обмен расширенными словарями. Тип bool
 Описание
 Этот метод меняет Id и Handle между объектом, определенным параметром otherId и объектом, вызвавшим этот метод. Оба объекта должны быть резидентами базы данных и должны размешаться в одной и той же базе данных. Если swapExtendedData установлен в true, то будет производиться обмен расширенными данными геометрических объектов. Если swapExtensionDictionary установлен в true, то и обмен расширенными словарями будет произведен.
 Ссылки
 Teigha.DatabaseServices.DBObject, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!