Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.IdMapping.DuplicateRecordCloning
 Послать отзыв
 Свойство возвращает тип клонирования повторяющихся записей для этого объекта IdMapping.
 Синтаксис
C#
Visual Basic
Копировать Код
public DuplicateRecordCloning DuplicateRecordCloning;
Копировать Код
Public Property DuplicateRecordCloning As DatabaseServices.DuplicateRecordCloning
 Возвращает
 Возвращает тип клонирования повторяющихся записей. Тип DuplicateRecordCloning.
 Описание
 Свойство возвращает тип клонирования повторяющихся записей для этого объекта IdMapping.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.IdMapping, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!