Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.SetContentColor
 Послать отзыв
 Метод позволяет задать цвет содержимого в ячейках указанных типов строк.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetContentColor( ref Color color, int rowType );
Копировать Код
Public virtual Sub SetContentColor( ByRef color As Color, rowType As Integer )
 Параметры
 Параметры
 Описание
 color
 Новый цвет содержимого ячейки. Тип Color.
 rowType
 Тип строки, int.
 Описание
 Метод позволяет задать цвет содержимого в ячейках указанных типов строк.
 Возможными значениями типа строки являются DataRow, TitleRow и HeaderRow (см. перечисление RowType). Различные типы строк можно комбинировать с использованием оператора OR. Если тип строки не указан, действие метода распространяется на все возможные типы строк.
 Замечания
 Для получения того же результата предпочтительнее использовать функционал объекта Cell.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!