Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.SetDimstyleData
 Послать отзыв
 Метод предназначен для копирования настроек размерного стиля, включая все переопределения, из указанной записи таблицы размерных стилей в данный объект Dimension.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetDimstyleData( ref DimStyleTableRecord style );
Копировать Код
Public Sub SetDimstyleData( ByRef style As DimStyleTableRecord )
 Параметры
 Параметры
 Описание
 style
 Размерный стиль, который служит источником копируемых данных. Тип DimStyleTableRecord.
 Описание
 Метод предназначен для копирования настроек размерного стиля, включая все переопределения, из указанной записи таблицы размерных стилей в данный объект Dimension.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!