Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.RevolvedSurface.AxisPoint
 Послать отзыв
 Свойство AxisPoint представляет 3D-точку, через которую проходит ось вращения.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d AxisPoint;
Копировать Код
Public Property AxisPoint As Point3d
 Возвращает
 Возвращает 3D-точку на оси вращения. Тип Point3d.
 Описание
 Свойство AxisPoint представляет 3D-точку, через которую проходит ось вращения.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.RevolvedSurface, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!