Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LayerStateManager.SetLayerStateMask
 Послать отзыв
 Обновляет маску LayerStateMasks, используемую при восстановлении состояния слоя.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetLayerStateMask( ref String name, LayerStateMasks mask );
Копировать Код
Public Function SetLayerStateMask( ByRef name As String, mask As LayerStateMasks )
 Параметры
 Параметры
 Описание
 name
 Имя состояния слоя для маски, тип String.
 mask
 Маска, применяемая к состоянию слоя, тип LayerStateMasks.
 Описание
 Обновляет маску LayerStateMasks, используемую при восстановлении состояния слоя.
 Ссылки
 Teigha.DatabaseServices.LayerStateManager, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!