Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Interval.Interval
 Послать отзыв
 Конструктор класса Interval. Создает полубесконечный интервал с указанной верхней границей и заданной точностью определения границ. Возможно также создать интервал, ограниченный снизу.
 Синтаксис
C#
Visual Basic
Копировать Код
public Interval( int boundedBelow, double bound, double tolerance );
Копировать Код
Public Sub New( boundedBelow As Integer, bound As Double, tolerance As Double )
 Параметры
 Параметры
 Описание
 boundedBelow
 Флаг, который определяет, что интервал является ограниченным снизу. Тип int.
 bound
 Значение верхней и, возможно, нижней границы. Тип double.
 tolerance
 Заданная точность определения границ. Тип double.
 Описание
 Конструктор класса Interval. Создает интервал с верхней границей, равной bound. Если значение аргумента boundedBelow равно 1, то он задает нижнюю границу, равной bound, в противном случае интервал остается неограниченным снизу. Конструктор принимает также точность определения границ интервала tolerance.
 Ссылки
 Teigha.Geometry.Interval, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!