Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DataColumn.GetCellAt
 Послать отзыв
 Метод предоставляет ячейку данных, которая находится в этом столбце по указанному индексу.
 Синтаксис
C#
Visual Basic
Копировать Код
public DataCell GetCellAt( int index );
Копировать Код
Public Function GetCellAt( index As Integer ) As DataCell
 Параметры
 Параметры
 Описание
 index
 Индекс ячейки данных. Тип int. В случае недействительного индекса происходит завершение работы приложения и появляется сообщение 'Operation is not valid due to the current state of the object.' (Операция не может быть выполнена вследствие текущего состояния объекта.)
 Возвращает
 Возвращает ячейку данных. Тип DataCell.
 Описание
 Метод предоставляет ячейку данных, которая находится в этом столбце по указанному индексу.
 Ссылки
 Teigha.DatabaseServices.DataColumn, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!