Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Filters.FilteredBlockIterator.Id
 Послать отзыв
 Свойство Id возвращает идентификатор объекта в текущей позиции итератора.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectId Id;
Копировать Код
Public ReadOnly Property Id As ObjectId
 Возвращает
 Возвращает идентификатор объекта в текущей позиции итератора. Тип ObjectId.
 Описание
 Свойство Id возвращает идентификатор объекта в текущей позиции итератора.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Filters.FilteredBlockIterator, Teigha.DatabaseServices.Filters
 Ваши комментарии по поводу этого топика: Послать отзыв!