Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Ltscale
 Послать отзыв
 Синтаксис
C#
Visual Basic
public double Ltscale;
Public Property Ltscale() As Double
 Описание
 Возвращает или устанавливает текущее значение LTSCALE для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!