Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DataLinkManager.Update
 Послать отзыв
 Метод обновляет данные всех внешних ссылок в данном экземпляре DataLinkManager.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Update( UpdateDirection direction, UpdateOption option );
Копировать Код
Public Sub Update( direction As UpdateDirection, option As UpdateOption )
 Параметры
 Параметры
 Описание
 direction
 Направление обновления. Тип UpdateDirection.
 option
 Опции обновления. Тип UpdateOption.
 Описание
 Метод обновляет данные всех внешних ссылок в данном экземпляре DataLinkManager.
 Ссылки
 Teigha.DatabaseServices.DataLinkManager, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!