Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Деструктор BlockReference.~BlockReference
 Послать отзыв
 This is ~BlockReference, a member of class BlockReference.
 Синтаксис
C#
Visual Basic
protected ~BlockReference();
Protected Sub Finalize()
 Ссылки
 Teigha.DatabaseServices.BlockReference, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!