Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocAction.OwnedDependencyStatusChanged
 Послать отзыв
 Метод позволяет уведомить действие-владельца зависимости о том, что статус этой зависимости был только что изменен.
 Синтаксис
C#
Visual Basic
Копировать Код
public void OwnedDependencyStatusChanged( ref AssocDependency ownedDependency, AssocStatus previousStatus );
Копировать Код
Public Sub OwnedDependencyStatusChanged( ByRef ownedDependency As AssocDependency, previousStatus As AssocStatus )
 Параметры
 Параметры
 Описание
 ownedDependency
 Входная зависимость, чей статус был только что изменен. Тип AssocDependency.
 previousStatus
 Предыдущий статус этой зависимости из перечисления AssocStatus.
 Описание
 Метод уведомляет действие-владельца зависимости о том, что статус этой зависимости был только что изменен.
 Этот метод представляет собой обратный вызов из AssocDependency.SetStatus(..., true). Он уведомляет действие, владеющее зависимостью, о том, что статус зависимости только что был изменен. Зависимость остается пока открытой на запись и уже имеет новый статус.
 Если действию принадлежит объект AssocActionBody с переопределенным методом OwnedDependencyStatusChangedOverride(), то он вызывается после выполнения реализации по умолчанию в классе AssocAction. Впрочем, переопределять этот метод обычно не требуется.
 Ссылки
 Teigha.DatabaseServices.AssocAction, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!