Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotStyleData.Color
 Послать отзыв
 Свойство Color представляет текущий цвет для данного объекта PlotStyleData.
 Синтаксис
C#
Visual Basic
Копировать Код
public Colors.EntityColor Color;
Копировать Код
Public Property Color As Colors.EntityColor
 Возвращает
 Возвращает текущий цвет. Тип Colors.EntityColor.
 Описание
 Свойство Color представляет текущий цвет для данного объекта PlotStyleData.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.PlotStyleData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!