Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector2d.*
 Послать отзыв
 Оператор реализует умножение скалярного множителя на 2D-вектор.
 Синтаксис
C#
Visual Basic
Копировать Код
public static Vector2d Vector2d *( double factor, Vector2d a );
Копировать Код
Public Shared Operator *( factor As Double, a As Vector2d ) As Vector2d
 Параметры
 Параметры
 Описание
 factor
 Левый операнд. Тип double.
 a
 Правый операнд. Тип Vector2d.
 Возвращает
 Возвращает результат умножения скалярного множителя factor на 2D-вектор a. Тип Vector2d.
 Описание
 Оператор реализует умножение скалярного множителя factor на 2D-вектор a.
 Ссылки
 Teigha.Geometry.Vector2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!