Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FieldCodeWithChildren.Add
 Послать отзыв
 Метод добавляет в массив дочерних полей новое дочернее поле по указанному индексу.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Add( int i, ref Field field );
Копировать Код
Public Sub Add( i As Integer, ByRef field As Field )
 Параметры
 Параметры
 Описание
 i
 Индекс, под которым в массив добавляется новое поле. Тип int.
 field
 Добавляемое дочернее поле. Тип Field.
 Описание
 Метод добавляет новое дочернее поле field в массив дочерних полей по указанному индексу i.
 Ссылки
 Teigha.DatabaseServices.FieldCodeWithChildren, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!