Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Hatch.Area
 Послать отзыв
 This is Area, a member of class Hatch.
 Синтаксис
C#
Visual Basic
public double Area;
Public Property Area() As Double
 Ссылки
 Teigha.DatabaseServices.Hatch, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!