Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DrawOrderTable.MoveBelow
 Послать отзыв
 Метод предназначен для перемещения указанной группы объектов ниже целевого объекта в последовательности отрисовки данного объекта DrawOrderTable.
 Синтаксис
C#
Visual Basic
Копировать Код
public void MoveBelow( ref ObjectIdCollection collection, DatabaseServices::ObjectId target );
Копировать Код
Public Sub MoveBelow( ByRef collection As ObjectIdCollection, target As DatabaseServices.ObjectId )
 Параметры
 Параметры
 Описание
 collection
 Идентификаторы объектов, для которых изменяется порядок отрисовки. Тип ObjectIdCollection.
 target
 Идентификатор целевого объекта. Тип DatabaseServices.ObjectId.
 Описание
 Метод предназначен для перемещения объектов с указанными идентификаторами ниже целевого объекта в последовательности отрисовки данного объекта DrawOrderTable. Относительный порядок отрисовки в пределах группы перемещаемых объектов не изменяется.
 Ссылки
 Teigha.DatabaseServices.DrawOrderTable, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!