Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.AugmentedPolylineCurve3d.GetD2VectorAt
 Послать отзыв
 Метод предоставляет вектор второй производной по указанному индексу.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d GetD2VectorAt( int index );
Копировать Код
Public Function GetD2VectorAt( index As Integer ) As Vector3d
 Параметры
 Параметры
 Описание
 index
 Индекс извлекаемого вектора. Тип int.
 Возвращает
 Возвращает вектор второй производной. Тип Vector3d.
 Описание
 Метод предоставляет вектор второй производной по указанному индексу.
 Ссылки
 Teigha.Geometry.AugmentedPolylineCurve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!