Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocAction.IsEqualTo
 Послать отзыв
 Метод реализует сравнение данного действия на равенство указанному действию.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsEqualTo( ref AssocAction otherAction );
Копировать Код
Public Function IsEqualTo( ByRef otherAction As AssocAction ) As Boolean
 Параметры
 Параметры
 Описание
 otherAction
 Входное действие. Тип AssocAction. Должно быть доступно для чтения.
 Возвращает
 Возвращает true в случае равенства действий. В противном случае возвращает false.
 Описание
 Метод сравнивает данное действие с указанным действием и возвращает true тогда и только тогда, когда они равны (что бы это ни значило). Оба действия должны быть доступны как минимум для чтения.
 Если действие владеет объектом AssocActionBody с переопределенным предикатом IsEqualToOverride(), вызывается именно этот переопределенный предикат.
 Ссылки
 Teigha.DatabaseServices.AssocAction, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!