Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DataColumn.Assign
 Послать отзыв
 Метод назначает этому объекту новый столбец.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Assign( ref DataColumn col );
Копировать Код
Public Sub Assign( ByRef col As DataColumn )
 Параметры
 Параметры
 Описание
 col
 Исходный столбец. Тип DataColumn.
 Описание
 Метод назначает этому объекту новый столбец.
 Ссылки
 Teigha.DatabaseServices.DataColumn, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!