Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MlineStyle.EndRoundCap
 Послать отзыв
 Свойство управляет отображением круглого торцевого ограничителя на завершающем торце мультилинии.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool EndRoundCap;
Копировать Код
Public Property EndRoundCap As Boolean
 Возвращает
 Возвращает true, если отображение круглого торцевого ограничителя включено. В противном случае возвращает false.
 Описание
 Свойство управляет отображением круглого торцевого ограничителя на завершающем торце мультилинии. Это внешняя дуга между крайними элементами мультилинии.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MlineStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!