Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.TableHitTestInfo.Row
 Послать отзыв
 Свойство Row представляет индекс строки таблицы.
 Синтаксис
C#
Visual Basic
Копировать Код
public int Row;
Копировать Код
Public ReadOnly Property Row As Integer
 Возвращает
 Возвращает индекс строки таблицы. Тип int.
 Описание
 Свойство Row представляет индекс строки таблицы.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.TableHitTestInfo, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!