Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Filters
 Послать отзыв
 Пространство имен Teigha.DatabaseServices.Filters включает классы, предназначенные для создания программных фильтров.
 Описание
 Пространство имен Teigha.DatabaseServices.Filters включает классы, предназначенные для реализации программных фильтров.
 Классы
 Имя
 Описание
 Filter
 Данный класс является базовым для всех классов фильтров. Этот класс определяет "запрос" и предоставляет "ключ" к объекту FilteredBlockIterator. Индекс, соответствующий этому ключу возвращает свойство IndexClass.
 FilteredBlockIterator
 Данный класс реализует итераторы, выполняющие проход по запросам, которые определены объектами Filter в записях таблицы блоков.
 Index
 Этот класс является базовым классом для всех индексов. Его наследниками являются классы SpatialIndex и LayerIndex.
 IndexUpdateData
 Этот класс предназначен для сопоставления идентификаторов объектов ObjectId с любыми данными или флагами, специфичными для индекса.
 LayerFilter
 Класс реализует объекты LayerFilter в экземпляре базы данных Database.
 LayerIndex
 Этот класс представляет собой реализацию индекса для фильтра слоев.
 SpatialFilter
 Этот класс реализует объекты пространственного фильтра в экземпляре базы данных.
 SpatialFilterDefinition
 Этот класс инкапсулирует данные, необходимые для определения пространственного фильтра SpatialFilter.
 SpatialFilterVolume
 Класс представляет данные, необходимые для описания объема пространственного фильтра.
 SpatialIndex
 Этот класс представляет собой реализацию индекса, учитывающую специфику пространственного индекса.
 Ссылки
 Классы
 Ваши комментарии по поводу этого топика: Послать отзыв!