Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DatabaseSummaryInfo.Author
 Послать отзыв
 Свойство предоставляет доступ к имени автора данного объекта DatabaseSummaryInfo.
 Синтаксис
C#
Visual Basic
Копировать Код
public String Author;
Копировать Код
Public Property Author() As String
 Возвращает
 Возвращает имя автора. Тип String.
 Описание
 Свойство предоставляет доступ к имени автора данного объекта DatabaseSummaryInfo.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.DatabaseSummaryInfo, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!