Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Vertex2d.EndWidth
 Послать отзыв
 Свойство EndWidth представляет конечную ширину сегмента полилинии, следующего за этой вершиной.
 Синтаксис
C#
Visual Basic
Копировать Код
public double EndWidth;
Копировать Код
Public Property EndWidth As Double
 Возвращает
 Возвращает ширину конца сегмента полилинии. Тип double.
 Описание
 Свойство EndWidth представляет конечную ширину сегмента полилинии, следующего за этой вершиной.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Vertex2d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!