Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.BreakFlowDirection
 Послать отзыв
 Данное свойство предоставляет доступ к направлению разбиения таблицы.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual DatabaseServices.TableBreakFlowDirection BreakFlowDirection;
Копировать Код
Public virtual Property BreakFlowDirection() As DatabaseServices.TableBreakFlowDirection
 Возвращает
 Возвращает направление разбиения таблицы как значение из перечисления Teigha.DatabaseServices.TableBreakFlowDirection.
 Описание
 Данное свойство предоставляет доступ к направлению разбиения таблицы. Оно определяет относительное расположение фрагментов, на которые разбивается исходная таблица, в случае активации режима разбиения.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!