Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DataTable.GetColumnTypeAt
 Послать отзыв
 Метод позволяет получить тип столбца с указанным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public CellType GetColumnTypeAt( int index );
Копировать Код
Public Function GetColumnTypeAt( index As Integer ) As CellType
 Параметры
 Параметры
 Описание
 index
 Индекс искомого столбца. Тип int.
 Возвращает
 Возвращает тип столбца. Тип CellType. Если индекс оказался недействительным, метод выбрасывает исключение Teigha.Runtime.ErrorStatus.eInvalidInput.
 Описание
 Метод позволяет получить тип столбца с указанным индексом.
 Ссылки
 Teigha.DatabaseServices.DataTable, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!