Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AbstractViewTableRecord.Background
 Послать отзыв
 Свойство Background предоставляет доступ к объекту фона, который связан с данным видом.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.ObjectId Background;
Копировать Код
Public Property Background As DatabaseServices.ObjectIdObjectId
 Возвращает
 Возвращает идентификатор объекта фона. Тип DatabaseServices.ObjectId.
 Описание
 Свойство Background предоставляет доступ к объекту фона, который связан с данным видом. Чтобы подавить фон, следует задать значение NULL.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.AbstractViewTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!