Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Ole2Frame.WcsWidth
 Послать отзыв
 Свойство представляет фактическую ширину этого OLE-объекта в мировой системе координат (WCS).
 Синтаксис
C#
Visual Basic
Копировать Код
public double WcsWidth;
Копировать Код
Public Property WcsWidth As Double
 Возвращает
 Возвращает ширину OLE-объекта. Тип double.
 Описание
 Свойство представляет фактическую ширину этого OLE-объекта в мировой системе координат (WCS).
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Ole2Frame, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!