Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Celtscale
 Послать отзыв
 Синтаксис
C#
Visual Basic
public double Celtscale;
Public Property Celtscale() As Double
 Описание
 Возвращает или устанавливает текущее значение CELTSCALE для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!