Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotSettings.PlotSettingsName
 Послать отзыв
 Свойство PlotSettingsName представляет имя данного объекта PlotSettings.
 Синтаксис
C#
Visual Basic
Копировать Код
public String PlotSettingsName;
Копировать Код
Public Property PlotSettingsName As String
 Возвращает
 Возвращает имя данного объекта. Тип String.
 Описание
 Свойство PlotSettingsName представляет имя данного объекта PlotSettings.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.PlotSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!