Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.UnderlayLayerCollection
 Послать отзыв
 Класс UnderlayLayerCollection представляет коллекцию слоев подложки.
 Иерархия классов
Teigha::DatabaseServices::UnderlayLayerCollection
 Синтаксис
C#
Visual Basic
Копировать Код
[DefaultMember("Item")] public sealed class UnderlayLayerCollection : ICollection
Копировать Код
<DefaultMember("Item")> Public NotInheritable Class UnderlayLayerCollection Implements ICollection
 Описание
 Класс UnderlayLayerCollection представляет коллекцию слоев подложки.
 Топики
 Имя
 Описание
 UnderlayLayerCollection Методы
 Ниже перечислены методы класса UnderlayLayerCollection.
 UnderlayLayerCollection Свойства
 Ниже перечислены свойства класса UnderlayLayerCollection.
 Ссылки
 UnderlayLayerCollection Методы, UnderlayLayerCollection Свойства, Топики, UnderlayLayerCollection Методы, UnderlayLayerCollection Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!