Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.ClipBoundary2d.ClipPolygon
 Послать отзыв
 Метод обрезает указанный многоугольник, используя данный объект границы обрезки.
 Синтаксис
C#
Visual Basic
Копировать Код
public ClipBoundary2dData ClipPolygon( ref Point2dCollection rawVertices );
Копировать Код
Public Function ClipPolygon( ByRef rawVertices As Point2dCollection ) As ClipBoundary2dData
 Параметры
 Параметры
 Описание
 rawVertices
 Входная коллекция вершин обрезаемого многоугольника. Тип Point2dCollection.
 Возвращает
 Возвращает многоугольник, полученный в результате операции обрезки. Тип ClipBoundary2dData.
 Описание
 Метод обрезает указанный многоугольник, используя данный объект границы обрезки.
 Ссылки
 Teigha.Geometry.ClipBoundary2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!