Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FeatureControlFrame.Normal
 Послать отзыв
 Свойство Normal возвращает вектор нормали плоскости, в которой располагается данный объект.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual Vector3d Normal;
Копировать Код
Public Overridable ReadOnly Property Normal As Vector3d
 Возвращает
 Возвращает вектор нормали плоскости. Тип Vector3d.
 Описание
 Свойство Normal возвращает вектор нормали плоскости, в которой располагается данный объект.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.FeatureControlFrame, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!