Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.UnmergeCells
 Послать отзыв
 Метод предназначен для отмены объединения ячеек в указанном диапазоне.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void UnmergeCells( ref CellRange range );
Копировать Код
Public virtual Sub UnmergeCells( ByRef range As CellRange )
 Параметры
 Параметры
 Описание
 range
 Заданный диапазон ячеек таблицы. Тип CellRange.
 Описание
 Метод предназначен для отмены объединения ячеек в указанном диапазоне.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!