Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve2d.GetOrthoBoundBlockOf
 Послать отзыв
 Метод предоставляет граничную рамку для участка данной кривой, который соответствует заданному параметрическому подынтервалу.
 Синтаксис
C#
Visual Basic
Копировать Код
public BoundBlock2d GetOrthoBoundBlockOf( ref Interval range );
Копировать Код
Public Function GetOrthoBoundBlockOf( ByRef range As Interval ) As BoundBlock2d
 Параметры
 Параметры
 Описание
 range
 Входной параметрический подынтервал. Тип Interval.
 Возвращает
 Возвращает граничную рамку для указанного участка кривой. Тип BoundBlock2d.
 Описание
 Метод предоставляет граничную рамку для участка данной кривой, который соответствует заданному параметрическому подынтервалу. Стороны граничной рамки ориентированы по осям системы координат.
 Ссылки
 Teigha.Geometry.Curve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!