Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.UcsTableRecord.XAxis
 Послать отзыв
 Свойство XAxis представляет 3D-вектор в мировой системе координат, который определяет направление оси X пользовательской системы координат для данного объекта UcsTableRecord.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d XAxis;
Копировать Код
Public Property XAxis As Vector3d
 Возвращает
 Возвращает направление оси X пользовательской системы координат. Тип Vector3d. Задан в мировой системе координат.
 Описание
 Свойство XAxis представляет 3D-вектор в мировой системе координат (WCS, МСК), который определяет направление оси X пользовательской системы координат (UCS, ПСК) для данного объекта UcsTableRecord.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.UcsTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!