Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObject.ExtensionDictionary
 Послать отзыв
 Свойство предоставляет идентификатор словаря расширения этого объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectId ExtensionDictionary;
Копировать Код
Public Property ExtensionDictionary() As ObjectId
 Возвращает
 Тип данных ObjectId.
 Описание
 Свойство предоставляет идентификатор словаря расширения этого объекта.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.DBObject, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!