Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Face.Face
 Послать отзыв
 Конструктор класса Face. Создает новую треугольную грань с указанными вершинами и значениями видимости ребер.
 Синтаксис
C#
Visual Basic
Копировать Код
public Face( Point3d pointer1, Point3d pointer2, Point3d pointer3, bool value1, bool value2, bool value3, bool value4 );
Копировать Код
Public Sub New( pointer1 As Point3d, pointer2 As Point3d, pointer3 As Point3d, value1 As Boolean, value2 As Boolean, value3 As Boolean, value4 As Boolean )
 Параметры
 Параметры
 Описание
 pointer1
 Первая угловая вершина грани. Тип Point3d.
 pointer2
 Вторая угловая вершина грани. Тип Point3d.
 pointer3
 Третья угловая вершина грани. Тип Point3d.
 value1
 Флаг видимости первого ребра. Тип bool.
 value2
 Флаг видимости второго ребра. Тип bool.
 value3
 Флаг видимости третьего ребра. Тип bool.
 value4
 Флаг видимости четвертого ребра. Тип bool.
 Описание
 Конструктор класса Face. Создает новый объект Face с указанными вершинами и значениями видимости ребер.
 Точки pointer1, pointer2 и pointer3 служат угловыми вершинами грани, при этом точка pointer2 используется дважды как для третьей, так и для четвертой угловой вершины. В результате получается треугольная грань. Точки задаются в мировой системе координат WCS.
 Аргументы value1 – value4 управляют видимостью ребер грани. Флаг value1 задает видимость ребра между вершинами pointer1 и pointer2, value2 — видимость ребра между pointer2 и pointer3 и т.д. Значение true означает, что ребро должно быть видимым.
 Кроме того, выполняется стандартная процедура инициализации объекта Entity.
 Ссылки
 Teigha.DatabaseServices.Face, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!