Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.Normal
 Послать отзыв
 Свойство задает или возвращает 3D-вектор нормали данного размера (в координатах WCS).
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d Normal;
Копировать Код
Public Property Normal As Vector3d
 Возвращает
 Возвращает вектор нормали размера. Тип Vector3d.
 Описание
 Свойство задает или возвращает 3D-вектор нормали данного размера (в координатах WCS).
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!