Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CurveCurveIntersector3d.GetPointOnCurve1
 Послать отзыв
 Метод позволяет получить точку пересечения с указанным индексом как точку PointOnCurve3d на первой кривой.
 Синтаксис
C#
Visual Basic
Копировать Код
public PointOnCurve3d GetPointOnCurve1( int intersection );
Копировать Код
Public Function GetPointOnCurve1( intersection As Integer ) As PointOnCurve3d
 Параметры
 Параметры
 Описание
 intersection
 Входной индекс точки пересечения кривых. Тип int.
 Возвращает
 Возвращает объект PointOnCurve3d для точки пересечения на первой кривой.
 Описание
 Метод позволяет получить точку пересечения с заданным индексом как точку PointOnCurve3d на первой кривой. Класс PointOnCurve3d предоставляет доступ к 3D-координатам и значению параметра возвращаемой точки.
 Ссылки
 Teigha.Geometry.CurveCurveIntersector3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!