Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Событие Database.InitialDwgFileOpenComplete
 Послать отзыв
 Синтаксис
C#
Visual Basic
public event EventHandler InitialDwgFileOpenComplete;
Public Event InitialDwgFileOpenComplete As EventHandler
 Описание
 Событие посылается при завершении начальной загрузки.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!