Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор AssocArrayCommonParameters.AssocArrayCommonParameters
 Послать отзыв
 This is AssocArrayCommonParameters, a member of class AssocArrayCommonParameters.
 Синтаксис
C#
Visual Basic
internal AssocArrayCommonParameters(IntPtr unmanagedPointer, bool autoDelete);
Friend Sub New(unmanagedPointer As IntPtr, autoDelete As bool)
 Ссылки
 Teigha.DatabaseServices.AssocArrayCommonParameters, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!