Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.LinearEntity2d.GetLine
 Послать отзыв
 Метод предоставляет бесконечную линию, коллинеарную данному линейному объекту.
 Синтаксис
C#
Visual Basic
Копировать Код
public Line2d GetLine();
Копировать Код
Public Function GetLine() As Line2d
 Возвращает
 Возвращает бесконечную линию, коллинеарную данному линейному объекту. Тип Line2d.
 Описание
 Метод предоставляет бесконечную линию, коллинеарную данному линейному объекту.
 Замечания
 В случае таких объектов как LineSeg2d или Ray2d этот метод позволяет получить бесконечную линию из ограниченного линейного объекта.
 Ссылки
 Teigha.Geometry.LinearEntity2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!