Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Mline.Normal
 Послать отзыв
 Свойство представляет вектор нормали плоскости, в которой располагается данный объект Mline.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d Normal;
Копировать Код
Public Property Normal As Vector3d
 Возвращает
 Возвращает вектор нормали плоскости данной мультилинии. Тип Vector3d.
 Описание
 Свойство представляет вектор нормали плоскости, в которой располагается данный объект Mline.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Mline, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!