Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SecurityParameters.ToString
 Послать отзыв
 Метод позволяет получить эквивалентное строковое представление данного объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public sealed override String ToString();
Копировать Код
Public NotOverridable Overrides Function ToString() As String
 Возвращает
 Возвращает эквивалентное представление данного объекта в виде текстовой строки, в которой хранятся поля и значения параметров безопасности. Тип String.
 Описание
 Метод позволяет получить эквивалентное строковое представление данного объекта.
 Ссылки
 Teigha.DatabaseServices.SecurityParameters, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!