Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Entity.SetDragStatus(DragStatus)
 Послать отзыв
 Метод вызывается при изменении состояния операции перетаскивания геометрического объекта, например, при её начале, завершении или отмене, и использует параметр status для получения информации о текущем состоянии операции.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetDragStatus(DragStatus status);
Копировать Код
Public Sub SetDragStatus(status As DragStatus)
 Параметры
 Параметры
 Описание
 status
 Параметр передает состояние операции перетаскивания, в которой участвует геометрический объект. Он указывает, была ли операция начата, завершена или отменена. Тип DragStatus
 Описание
 Эта функция вызывается, если операция перетаскивания, в которой участвует данный геометрический объект, начинается, заканчивается или снимается. Параметр status обеспечивает метод информацией о том, что произошло с операцией перетаскивания.
 Ссылки
 Teigha.DatabaseServices.Entity, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!