Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LayerStateManager.LayerStateRestored
 Послать отзыв
 Событие завершения восстановления состояния слоя.
 Синтаксис
C#
Visual Basic
Копировать Код
public event LayerStateEventHandler LayerStateRestored;
Копировать Код
Public Event LayerStateRestored As LayerStateEventHandler
 Описание
 Событие завершения восстановления состояния слоя.
 Ссылки
 Teigha.DatabaseServices.LayerStateManager, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!