Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ObjectOverrule.SetIdFilter
 Послать отзыв
 Метод включает предварительную фильтрацию объектов по списку ObjectId прежде чем применять переопределения.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetIdFilter( ref ObjectId[] ids );
Копировать Код
Public Sub SetIdFilter( ByRef ids As ObjectId[] )
 Параметры
 Параметры
 Описание
 ids
 Массив идентификаторов ObjectId.
 Описание
 Метод включает предварительную фильтрацию объектов по их ObjectId прежде чем применять переопределения.
 Переопределения будут применяться только к тем объектам, чьи ObjectId присутствуют в заданном массиве идентификаторов.
 Ссылки
 Teigha.DatabaseServices.ObjectOverrule, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!