Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Line2d.Line2d
 Послать отзыв
 Конструктор по умолчанию класса Line2d. Создает бесконечную линию, совпадающую с осью X системы координат.
 Синтаксис
C#
Visual Basic
Копировать Код
public Line2d();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса Line2d. Создает бесконечную линию, совпадающую с осью X системы координат.
 Ссылки
 Teigha.Geometry.Line2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!