Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Ole2Frame.Rotation
 Послать отзыв
 Свойство представляет угол поворота для этого OLE-объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Rotation;
Копировать Код
Public Property Rotation As Double
 Возвращает
 Возвращает угол поворота OLE-объекта (в радианах). Тип double.
 Описание
 Свойство представляет угол поворота для этого OLE-объекта.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Ole2Frame, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!