Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Mline.SupressStartCaps
 Послать отзыв
 Свойство предоставляет доступ к флагу, который управляет подавлением торцевого ограничителя в начале данной мультилинии.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool SupressStartCaps;
Копировать Код
Public Property SupressStartCaps As Boolean
 Возвращает
 Возвращает true, если торцевой ограничитель в начале мультилинии подавлен. В противном случае возвращает false.
 Описание
 Свойство предоставляет доступ к флагу, который управляет подавлением торцевого ограничителя в начале данной мультилинии.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Mline, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!