Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocArray.RemoveSourceEntity
 Послать отзыв
 Метод удаляет исходный объект с заданным ObjectId и обновляет каждый элемент ассоциативного массива, которым управляет соответствующее действие.
 Синтаксис
C#
Visual Basic
Копировать Код
public void RemoveSourceEntity( ObjectId sourceEntity );
Копировать Код
Public Sub RemoveSourceEntity( sourceEntity As ObjectId )
 Параметры
 Параметры
 Описание
 sourceEntity
 Идентификатор удаляемого из массива исходного объекта. Тип ObjectId.
 Описание
 Метод удаляет исходный объект с заданным ObjectId и обновляет каждый элемент ассоциативного массива, которым управляет соответствующее действие.
 Ссылки
 Teigha.DatabaseServices.AssocArray, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!