Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Entity.TransformBy(Matrix3d)
 Послать отзыв
 Метод применяет указанную матрицу преобразования к геометрическому объекту, изменяя его положение, ориентацию или размер в соответствии с заданным преобразованием. Реализация метода в производных классах позволяет определять поддерживаемые типы преобразований и обеспечивает корректное отображение объекта после их применения.
 Синтаксис
C#
Visual Basic
Копировать Код
public void TransformBy(Matrix3d transform);
Копировать Код
Public Sub TransformBy(transform As Matrix3d)
 Параметры
 Параметры
 Описание
 transform
 Матрица преобразования, которая должна быть применена к геометрическому объекту. Тип Matrix3d
 Описание
 Этот метод обеспечивает инструмент, с помощью которого nanoCAD и приложения могут предложить геометрическому объекту применить матрицу преобразования(xform) к самому себе.
 Каждый класс геометрических объектов должен разработать этот метод, поэтому ограничения на то, какие типы преобразований поддерживаются, должны быть устранены разработчиком классов геометрического объекта. Встроенные nanoCAD классы геометрических объектов для типов геометрических объектов, которые существуют до R13 (такие как Circle, Line, Arc, 2dPolyline, и т.д.) требуют, чтобы матрица преобразования представляла однородно масштабируемое ортогональное преобразование. Остальные nanoCAD встроенные классы не имеют ограничений.
 Разработка метода в производных классах
 Этот метод должен приложить матрицу преобразования xform к геометрическому объекту и изменить состояние геометрического объекта для отражения преобразования. Полностью на усмотрение разработчика отдается то, как применить преобразование. Также на усмотрение разработчика остается решение, что, или какие, ограничения будут у данного типа поддерживаемого преобразования. Если какие-либо ограничения требуются, то разработчик этого метода должен удовлетворить им.
 Если в вашем производном классе разработанный TransformBy() метод не вызывает этот же метод базового класса, вы должны вызвать DBObject.XDataTransformBy() или ваши Xdata не будут преобразованы. Note Если метод не переопределен, то такие команды nanoCAD, как MOVE, ROTATE, SCALE и т.д. не будут вызывать никакого результата для геометрических объектов данного класса.
 Ссылки
 Teigha.DatabaseServices.Entity, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!