Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Arc.Arc()
 Послать отзыв
 Конструктор по умолчанию.
 Синтаксис
C#
Visual Basic
public Arc();
Public Sub New()
 Описание
 Конструктор создаёт арку с нормалью (0,0,1), центральной точкой (0,0,0) радиусом, начальным и конечными углами, равными 0.0. Необходимо изменить радиус на ненулевое значение перед закрытием объекта первый раз. Центральная точка и вектор нормали должны быть в WCS координатах.
 Ссылки
 Teigha.DatabaseServices.Arc, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!