Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DwgFiler.WriteHandle
 Послать отзыв
 Метод предназначен для записи заданного дескриптора объекта в этот объект Filer.
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract void WriteHandle( Handle handle );
Копировать Код
Public MustOverride Sub WriteHandle( handle As Handle )
 Параметры
 Параметры
 Описание
 handle
 Записываемый в Filer дескриптор объекта. Тип Handle.
 Описание
 Метод предназначен для записи заданного дескриптора Handle в этот объект Filer.
 Ссылки
 Teigha.DatabaseServices.DwgFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!