Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocArrayCommonParameters
 Послать отзыв
 Класс AssocArrayCommonParameters предоставляет интерфейс для управления параметрами ассоциативного массива, которые являются общими для параметров прямоугольного и кругового массива, а также массива по траектории.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::DatabaseServices::AssocArrayParameters Teigha::DatabaseServices::AssocArrayCommonParameters
 Синтаксис
C#
Visual Basic
Копировать Код
[TypeDescriptionProvider("Teigha.ComponentModel.TypeDescriptionProvider`1[[Teigha.DatabaseServices.AssocArrayCommonParameters, TD_MgdDbConstraints]], TD_MgdDbConstraints")] [Teigha.Runtime.Wrapper("AcDbAssocArrayCommonParameters")] public class AssocArrayCommonParameters : AssocArrayParameters;
Копировать Код
<TypeDescriptionProvider("Teigha.ComponentModel.TypeDescriptionProvider`1[[Teigha.DatabaseServices.AssocArrayCommonParameters, TD_MgdDbConstraints]], TD_MgdDbConstraints")> <Teigha.Runtime.Wrapper("AcDbAssocArrayCommonParameters")> Public Class AssocArrayCommonParameters Inherits AssocArrayParameters
 Описание
 Класс AssocArrayCommonParameters предоставляет интерфейс для управления параметрами ассоциативного массива, которые являются общими для параметров прямоугольного и кругового массива, а также массива по траектории.
 Производные от него классы реализуют конкретные интерфейсы для управления параметрами, специфичными для каждого из указанных типов массивов.
 Методы
 Конструкторы
 Teigha.DatabaseServices.AssocArrayParameters
 ПоказатьInternalУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 AssocArrayParameters
 This is AssocArrayParameters, a member of class AssocArrayParameters. (Унаследован от AssocArrayParameters)
 Teigha.DatabaseServices.AssocArrayCommonParameters
 ПоказатьInternal
 Нет совпадений по текущему фильтру
 Имя
 Описание
 AssocArrayCommonParameters
 This is AssocArrayCommonParameters, a member of class AssocArrayCommonParameters.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.DatabaseServices.AssocArrayParameters
 Имя
 Описание
 AssocArrayParameters Методы
 Ниже перечислены методы класса AssocArrayParameters.
 AssocArrayParameters Свойства
 Ниже перечислены свойства класса AssocArrayParameters.
 Teigha.DatabaseServices.AssocArrayCommonParameters
 Имя
 Описание
 AssocArrayCommonParameters Методы
 Ниже перечислены методы класса AssocArrayCommonParameters.
 AssocArrayCommonParameters Свойства
 Ниже перечислены свойства класса AssocArrayCommonParameters.
 Ссылки
 AssocArrayCommonParameters Методы, AssocArrayCommonParameters Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!