Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DataLink.Update
 Послать отзыв
 Метод обновляет ссылки на пути к внешним исходным файлам. Не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Update( UpdateDirection dir, DatabaseServices.UpdateOption option );
Копировать Код
Public Sub Update( dir As UpdateDirection, option As DatabaseServices.UpdateOption )
 Параметры
 Параметры
 Описание
 dir
 Направление обновления. Значение из перечисления UpdateDirection.
 option
 Опции обновления. Значение из перечисления DatabaseServices.UpdateOption.
 Описание
 Метод обновляет ссылки на пути к внешним исходным файлам. На данный момент не реализован.
 Ссылки
 Teigha.DatabaseServices.DataLink, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!