Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Событие Database.WblockEnded
 Послать отзыв
 Синтаксис
C#
Visual Basic
public event EventHandler WblockEnded;
Public Event WblockEnded As EventHandler
 Описание
 Событие показывает, что операция wblock, выполняемая над чертежом, выполнена успешно.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!