Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод BlockReference.GeometryExtentsBestFit (Matrix3d)
 Послать отзыв
 Синтаксис
C#
Visual Basic
public Extents3d GeometryExtentsBestFit(Matrix3d parentTransform);
Public Function GeometryExtentsBestFit(parentTransform As Matrix3d) As Extents3d
 Параметры
 Параметры
 Описание
 parentTransform
 Преобразование, которое применяется к геометрии блока, на который производится ссылка
 Описание
 Получает копию всех геометрических объектов в записи таблицы блоков, на которую указывает ссылка, применяет к ним преобразование parentTransform, и затем вычисляет пределы размещения результирующего множества геометрических объектов. Note Этот метод выполняется рекурсивно для вложенных ссылок на блоки. Когда этот метод вызывается в самой удаленной (самой внешней) ссылке (обычная ситуация для приложения), parentTransform представляет собой некоторую матрицу. Для вызовов для вложенных ссылок на блоки, parentTransform должен представлять совокупное преобразование от самой внешней ссылки на блок до ссылки на блок, которая находится в записи таблице блоков, которая является владельцем ссылки, для которой метод вызывается.
 Ссылки
 Teigha.DatabaseServices.BlockReference, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!