Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MText.ActualWidth
 Послать отзыв
 Свойство возвращает фактическую ширину габаритного бокса для данного объекта MText (зависит от содержимого).
 Синтаксис
C#
Visual Basic
Копировать Код
public double ActualWidth;
Копировать Код
Public ReadOnly Property ActualWidth As Double
 Возвращает
 Возвращает фактическую ширину габаритного бокса данного объекта. Тип double.
 Описание
 Свойство возвращает фактическую ширину габаритного бокса для данного объекта MText (зависит от содержимого).
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.MText, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!