Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DimAssoc.OpenedForModify
 Послать отзыв
 Метод уведомления, который вызывается, когда объект, представленный указателем pObject, открывается на изменение, и какой-либо из его методов вызывает метод AssertWriteEnabled().
 Синтаксис
C#
Visual Basic
Копировать Код
public void OpenedForModify( ref DBObject pObject );
Копировать Код
Public Sub OpenedForModify( ByRef pObject As DBObject )
 Параметры
 Параметры
 Описание
 pObject
 Указатель на объект, который открывается на изменение. Тип DBObject.
 Описание
 Метод уведомления, который вызывается, когда объект, представленный указателем pObject, открывается на изменение, и какой-либо из его методов вызывает метод AssertWriteEnabled().
 Ссылки
 Teigha.DatabaseServices.DimAssoc, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!