Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство IdPair.Value
 Послать отзыв
 This is Value, a member of class IdPair.
 Синтаксис
C#
Visual Basic
public ObjectId Value;
Public Property Value() As ObjectId
 Ссылки
 IdPair Структура, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!