Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GraphNode.CycleIn
 Послать отзыв
 Метод возвращает указанную по индексу входящую циклическую ссылку этого объекта GraphNode.
 Синтаксис
C#
Visual Basic
Копировать Код
public GraphNode CycleIn( int index );
Копировать Код
Public Function CycleIn( index As Integer ) As GraphNode
 Параметры
 Параметры
 Описание
 index
 Входной индекс циклической ссылки. Тип int.
 Возвращает
 Возвращает входящую циклическую ссылку. Тип GraphNode. Если указанный индекс недействителен, возвращает нулевой указатель.
 Описание
 Метод возвращает указанную по индексу входящую циклическую ссылку этого объекта GraphNode. Результат будет действительным только при условии, что с момента последнего вызова метода Graph.FindCycles(), используемого для обнаружения циклов, граф не претерпевал каких-либо промежуточных изменений.
 Ссылки
 Teigha.DatabaseServices.GraphNode, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!