Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotStyleData.ColorPolicy
 Послать отзыв
 Свойство ColorPolicy представляет битовые флаги, определяющие использование цвета стилем печати цвета для отображения объектов чертежа.
 Синтаксис
C#
Visual Basic
Копировать Код
public int ColorPolicy;
Копировать Код
Public Property ColorPolicy As Integer
 Возвращает
 Возвращает битовые флаги, определяющие использование цвета для отображения объектов чертежа. Тип int.
 Описание
 Свойство ColorPolicy представляет битовые флаги, определяющие использование цвета стилем печати цвета для отображения объектов чертежа.
 Предусмотрено использование следующих значений:
kDither = 1,
kGrayScale = 2,
kNotUseObject = 4.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.PlotStyleData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!