Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.BlockInsertionPointsEventArgs.InsertionPoints
 Послать отзыв
 Свойство предоставляет доступ к коллекции точек вставки.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3dCollection InsertionPoints;
Копировать Код
Public Property InsertionPoints() As Point3dCollection
 Возвращает
 Возвращает коллекцию точек вставки. Тип Point3dCollection.
 Описание
 Свойство предоставляет доступ к коллекции точек вставки.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.BlockInsertionPointsEventArgs, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!