Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Group
 Послать отзыв
 Этот класс представляет объекты группы в экземпляре базы данных.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::GraphicsInterface::Drawable Teigha::DatabaseServices::DBObject Teigha::DatabaseServices::Group
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("AcDbGroup")] public class Group : DBObject;
Копировать Код
<Wrapper("AcDbGroup")> Public Class Group Inherits DBObject
 Описание
 Класс Group представляет собой коллекцию объектов, на которые можно ссылаться, используя одно, общее для всех имя группы. В отличие от элементов блока, объектами внутри группы можно манипулировать индивидуально.
 Один и тот же объект может принадлежать более чем одной группе. Однако в любой такой группе он может присутствовать только в одном экземпляре.
 Индексы членов группы отсчитываются от нуля. Таким образом, первый элемент в группе имеет индекс 0.
 Методы
 Конструкторы
 Teigha.GraphicsInterface.Drawable
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 Drawable
 Конструктор класса Teigha.GraphicsInterface.Drawable. (Унаследован от Drawable)
 Teigha.DatabaseServices.DBObject
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 DBObject
 Конструктор. (Унаследован от DBObject)
 Teigha.DatabaseServices.Group
 Имя
 Описание
 Group
 Это обзор перегрузок Group.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.GraphicsInterface.Drawable
 Имя
 Описание
 Drawable Методы
 Ниже перечислены методы класса Drawable.
 Drawable Свойства
 Ниже перечислены свойства класса Drawable.
 Teigha.DatabaseServices.DBObject
 Имя
 Описание
 DBObject Методы
 Ниже перечислены методы класса DBObject.
 DBObject Свойства
 Ниже перечислены свойства класса DBObject.
 DBObject События
 Ниже перечислены события класса DBObject.
 Teigha.DatabaseServices.Group
 Имя
 Описание
 Group Методы
 Ниже перечислены методы класса Group.
 Group Свойства
 Ниже перечислены свойства класса Group.
 Ссылки
 Group Конструктор, Group Методы, Group Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства, DBObject События
 Ваши комментарии по поводу этого топика: Послать отзыв!