Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CellStates
 Послать отзыв
 Данное перечисление определяет различные состояния данных в ячейке.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum CellStates { ContentLocked = 1, ContentModifiedAfterUpdate = 8, ContentReadOnly = 2, FormatLocked = 16, FormatModifiedAfterUpdate = 64, FormatReadOnly = 32, Linked = 4, None = 0 }
Копировать Код
Public Enum CellStates ContentLocked = 1 ContentModifiedAfterUpdate = 8 ContentReadOnly = 2 FormatLocked = 16 FormatModifiedAfterUpdate = 64 FormatReadOnly = 32 Linked = 4 None = 0 End Enum
 Члены
 Члены
 Описание
 None
 Значение: 0. Не задано.
 ContentLocked
 Значение: 1. Содержимое ячейки доступно только для чтения. Может быть разблокировано пользователем.
 ContentReadOnly
 Значение: 2. Содержимое ячейки доступно только для чтения. Не может быть разблокировано пользователем.
 Linked
 Значение: 4. Ячейка связана с внешним источником данных.
 ContentModifiedAfterUpdate
 Значение: 8. Содержимое ячейки было изменено с момента последнего обновления.
 FormatLocked
 Значение: 16 = 0x10. Формат ячейки доступен только для чтения, но может быть разблокирован пользователем.
 FormatReadOnly
 Значение: 32 = 0x20. Формат ячейки доступен только для чтения. Не может быть разблокирован пользователем.
 FormatModifiedAfterUpdate
 Значение: 64 = 0x40. Формат ячейки был изменен с момента последнего обновления.
 Описание
 Данное перечисление определяет различные состояния данных в ячейке.
 Ваши комментарии по поводу этого топика: Послать отзыв!