Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SystemVariableChangingEventArgs.Name
 Послать отзыв
 Свойство Name представляет имя изменяемой системной переменной.
 Синтаксис
C#
Visual Basic
Копировать Код
public String Name;
Копировать Код
Public ReadOnly Property Name As String
 Возвращает
 Возвращает имя изменяемой системной переменной. Тип String.
 Описание
 Свойство Name представляет имя изменяемой системной переменной.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.SystemVariableChangingEventArgs, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!