Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.EndCap
 Послать отзыв
 Перечисление EndCap определяет поддерживаемые типы отображения торцов линий.
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdDb.EndCaps")] public enum EndCap { None = 0, Round = 1, Angle = 2, Square = 3 }
Копировать Код
<Wrapper("OdDb.EndCaps")> Public Enum EndCap None = 0 Round = 1 Angle = 2 Square = 3 End Enum
 Члены
 Члены
 Описание
 None
 Значение: 0. Не назначен.
 Round
 Значение: 1. Торец линии имеет скругленную форму.
 Angle
 Значение: 2. Торец линии имеет угловую форму.
 Square
 Значение: 3. Торец линии имеет квадратную форму.
 Описание
 Перечисление EndCap определяет поддерживаемые типы отображения торцов линий.
 Ваши комментарии по поводу этого топика: Послать отзыв!