Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор Leader.Leader ()
 Послать отзыв
 Синтаксис
C#
Visual Basic
public Leader(IntPtr unmanagedObjPtr, bool autoDelete); public Leader();
Public Sub New(unmanagedObjPtr As IntPtr, autoDelete As bool) Public Sub New()
 Описание
 Конструктор по умолчанию.
 Ссылки
 Teigha.DatabaseServices.Leader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!