Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotSettings.PlotPlotStyles
 Послать отзыв
 Свойство PlotPlotStyles позволяет определить, применяются ли стили печати для данного объекта PlotSettings.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool PlotPlotStyles;
Копировать Код
Public Property PlotPlotStyles As Boolean
 Возвращает
 Возвращает true, если стили печати выводятся на печать. В противном случае возвращает false.
 Описание
 Свойство PlotPlotStyles позволяет определить, применяются ли стили печати для данного объекта PlotSettings. т.е. выводятся ли на печать стили печати (а не просто показываются).
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.PlotSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!