Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeader.RemoveLastVertex
 Послать отзыв
 Метод позволяет удалить последнюю вершину из указанной линии выноски.
 Синтаксис
C#
Visual Basic
Копировать Код
public void RemoveLastVertex( int leaderLineIndex );
Копировать Код
Public Sub RemoveLastVertex( leaderLineIndex As Integer )
 Параметры
 Параметры
 Описание
 leaderLineIndex
 Индекс линии выноски, у которой удаляется вершина. Тип int.
 Описание
 Метод позволяет удалить последнюю вершину из линии выноски с указанным индексом.
 Ссылки
 Teigha.DatabaseServices.MLeader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!