Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.TableStyle.SetColor
 Послать отзыв
 Метод позволяет задать цвет текста в строках указанного типа.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetColor( ref Teigha.Colors.Color color, int rowTypes );
Копировать Код
Public Overridable Sub SetColor( ByRef color As Teigha.Colors.Color, rowTypes As Integer )
 Параметры
 Параметры
 Описание
 color
 Цвет текста. Тип Teigha.Colors.Color.
 rowTypes
 Один или комбинация нескольких типов строк таблицы. Тип int. См. перечисление RowType.
 Описание
 Метод позволяет задать цвет текста в строках указанного типа.
 Ссылки
 Teigha.DatabaseServices.TableStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!