Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Group.RemoveAt
 Послать отзыв
 Метод позволяет удалить из данной группы указанные объекты, причем они должны иметь индексы равные или больше некоторого заданного индекса.
 Синтаксис
C#
Visual Basic
Копировать Код
public void RemoveAt( int index, ref ObjectIdCollection ids );
Копировать Код
Public Sub RemoveAt( index As Integer, ByRef ids As ObjectIdCollection )
 Параметры
 Параметры
 Описание
 index
 Индекс, начиная с которого будут удаляться объекты из коллекции ids. Тип int.
 ids
 Коллекция удаляемых объектов. Тип ObjectIdCollection. Все объекты должны находиться в этой группе и иметь индекс, равный или превышающий указанное значение index.
 Описание
 Метод позволяет удалить из данной группы указанные объекты, причем они должны иметь индексы равные или больше некоторого заданного индекса.
 Ссылки
 Teigha.DatabaseServices.Group, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!