Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocAction.AddDependency
 Послать отзыв
 Метод добавляет к данному действию заданную ассоциативную зависимость AssocDependency.
 Синтаксис
C#
Visual Basic
Копировать Код
public void AddDependency( Teigha.DatabaseServices.ObjectId dependencyId, bool setThisActionAsOwningAction );
Копировать Код
Public Sub AddDependency( dependencyId As Teigha.DatabaseServices.ObjectId, setThisActionAsOwningAction As Boolean )
 Параметры
 Параметры
 Описание
 dependencyId
 Идентификатор добавляемой зависимости. Тип Teigha.DatabaseServices.ObjectId.
 setThisActionAsOwningAction
 Флаг "присвоения" зависимости действием. Тип bool. В случае значения true данное действие становится владельцем добавляемой зависимости. В противном случае действие будет просто ссылаться на зависимость.
 Описание
 Метод добавляет к данному действию заданную ассоциативную зависимость AssocDependency. Если аргумент setThisActionAsOwningAction имеет значение true, данное действие становится владельцем указанной зависимости (что является наиболее распространенным случаем). В противном случае действие будет просто ссылаться на эту зависимость.
 Ссылки
 Teigha.DatabaseServices.AssocAction, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!