Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DxfFiler.FilerType
 Послать отзыв
 Свойство возвращает конкретный тип данного объекта Filer.
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract FilerType FilerType;
Копировать Код
Public MustOverride ReadOnly Property FilerType As FilerType
 Возвращает
 Возвращает тип данного файлера как значение из перечисления Teigha.DatabaseServices.FilerType.
 Описание
 Свойство возвращает конкретный тип данного объекта Filer.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.DxfFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!