Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Point3d.Y
 Послать отзыв
 Свойство, представляющее координату Y данной точки.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Y;
Копировать Код
Public Property Y() As Double
 Возвращает
 Возвращает координату Y данной точки.Тип double.
 Описание
 Свойство, представляющее координату Y данной точки.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.Point3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!