Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.BeginWblockBlockEventArgs.BlockId
 Послать отзыв
 Свойство предоставляет идентификатор блока, для которого выполняется операция Wblock.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectId BlockId;
Копировать Код
Public Property BlockId() As ObjectId
 Возвращает
 Возвращает идентификатор блока. Тип ObjectId.
 Описание
 Свойство предоставляет идентификатор блока, для которого выполняется операция Wblock.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.BeginWblockBlockEventArgs, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!