Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.RevolvedSurface.SetRevolve
 Послать отзыв
 Метод позволяет установить в данном объекте новые значения указанных параметров поверхности вращения.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetRevolve( Point3d axisPoint, Vector3d axisDirection, double revolveAngle, ref RevolveOptions revolveOptions );
Копировать Код
Public Sub SetRevolve( axisPoint As Point3d, axisDirection As Vector3d, revolveAngle As Double, ByRef revolveOptions As RevolveOptions )
 Параметры
 Параметры
 Описание
 axisPoint
 Точка, через которую проходит ось вращения. Тип Point3d.
 axisDirection
 Направляющий вектор оси вращения. Тип Vector3d.
 revolveAngle
 Угол поворота (в радианах). Положительное направление отсчета углов - против часовой стрелки, если смотреть навстречу направляющему вектору оси вращения. Тип double.
 revolveOptions
 Опции операции вращения. Тип DatabaseServices.RevolveOptions.
 Описание
 Метод позволяет установить в данном объекте новые значения указанных параметров поверхности вращения.
 Ссылки
 Teigha.DatabaseServices.RevolvedSurface, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!