Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство RasterImageDef.Organization
 Послать отзыв
 Синтаксис
C#
Visual Basic
public ImageOrg Organization;
Public Property Organization() As ImageOrg
 Описание
 Возвращает схема организации точек исходного файла изображения. Для того чтобы свойство работало правильно, требуется, чтобы файл был загружен. Если файл не загружен, возвращается значение RGBA.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.RasterImageDef, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!