Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Field.GetStringValue
 Послать отзыв
 Метод позволяет получить строковое значение, связанное с данным полем.
 Синтаксис
C#
Visual Basic
Копировать Код
public String GetStringValue();
Копировать Код
Public Function GetStringValue() As String
 Возвращает
 Возвращает строковое значение, связанное с данным полем. Тип String.
 Описание
 Метод позволяет получить строковое значение, связанное с данным полем.
 Ссылки
 Teigha.DatabaseServices.Field, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!