Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Matrix2dInfo.Scale
 Послать отзыв
 Свойство Scale представляет масштабный коэффициент матрицы.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Scale;
Копировать Код
Public ReadOnly Property Scale As Double
 Возвращает
 Возвращает масштабный коэффициент матрицы. Тип double.
 Описание
 Свойство Scale представляет масштабный коэффициент матрицы. Возвращаемое значение равно квадратному корню длины вектора-столбца наибольшей длины.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.Matrix2dInfo, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!