Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector2d.RotateBy
 Послать отзыв
 Метод вращает данный вектор на указанный угол.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector2d RotateBy( double angle );
Копировать Код
Public Function RotateBy( angle As Double ) As Vector2d
 Параметры
 Параметры
 Описание
 angle
 Заданный угол вращения в радианах. Тип double.
 Возвращает
 Возвращает вектор, который является результатом вращения данного вектора на угол angle. Тип Vector2d.
 Описание
 Метод вращает данный вектор на указанный угол angle.
 Замечания
 Положительным направлением поворота считается направление вращения от оси X к оси Y.
 Ссылки
 Teigha.Geometry.Vector2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!