Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Database.DisableUndoRecording
 Послать отзыв
 Синтаксис
C#
Visual Basic
public void DisableUndoRecording(bool disable);
Public Sub DisableUndoRecording(disable As bool)
 Параметры
 Параметры
 Описание
 disable
 Параметр, указывающий, надо ли включить или выключить запись в буфер Undo
 Описание
 Эта функция отключает или включает запись в буфер Undo для операций, выполняемых с базой данных. Если disable==true, то запись в буфер Undo производиться не будет.
 Эта функция не удаляет никакую уже находящуюся в буфере информацию. Она только включает или выключает запись в буфер Undo.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!