Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Group.SetHighlight
 Послать отзыв
 Метод позволяет подсветить или отменить подсветку объектов данной группы.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetHighlight( bool value );
Копировать Код
Public Sub SetHighlight( value As Boolean )
 Параметры
 Параметры
 Описание
 value
 Флаг подсветки объектов группы. Тип bool. Если он принимает значение true, будут подсвечены все объекты в группе. В противном случае подсветка отменяется.
 Описание
 Метод позволяет подсветить или отменить подсветку (Highlight) объектов данной группы. Новое состояние определяется переданным в метод логическим аргументом value.
 Ссылки
 Teigha.DatabaseServices.Group, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!