Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Spline.NumFitPoints
 Послать отзыв
 Свойство NumFitPoints представляет количество определяющих точек у данного сплайна.
 Синтаксис
C#
Visual Basic
Копировать Код
public int NumFitPoints;
Копировать Код
Public ReadOnly Property NumFitPoints As Integer
 Возвращает
 Возвращает количество определяющих точек. Тип int.
 Описание
 Свойство NumFitPoints представляет количество определяющих точек у данного сплайна.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Spline, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!