Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Entity.GetGripPoints(Point3dCollection
 Послать отзыв
 Метод GetGripPoints реализует поддержку "старого стиля" работы с ручками (точками управления) и предназначен для добавления координат ручек текущего геометрического объекта в уже существующий массив gripPoints.
 Синтаксис
C#
Visual Basic
Копировать Код
public void GetGripPoints(Point3dCollection gripPoints, IntegerCollection snapModes, IntegerCollection geometryIds);
Копировать Код
Public Sub GetGripPoints(gripPoints As Point3dCollection, snapModes As IntegerCollection, geometryIds As IntegerCollection)
 Параметры
 Параметры
 Описание
 gripPoints
 Заранее существующий массив, куда добавляются координаты ручек. В результат к массиву добавляются координаты ручек данного геометрического объекта. Тип Point3dCollection
 snapModes
 Не используется
 geometryIds
 Не используется
 Возвращает
 Возвращает тип данных bool: true, если ручки были успешно добавлены, и false — в случае ошибки или отсутствия доступных ручек.
 Описание
 Использование метода
 Этот метод поддерживает "старый стиль" ручек, в приложениях, созданных до улучшения функциональности работы с ручками.
 Разработка метода в производных классах
 Этот метод должен добавить к массиву gripPoints те точки, которые рассматриваются как координаты ручек для геометрического объекта.
 Массив gripPoints должен быть передан для всех геометрических объектов, включенных в операцию с ручками, так что массив может уже содержать координаты ручек для других геометрических объектов. Поэтому, является очень важным добавление новых точек в массив вместо назначения им уже существующих элементов массива.
 Параметры snapModes и geometryIds в настоящее время не используются.
 Ссылки
 Teigha.DatabaseServices.Entity, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!