Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.OffsetCurve2d.OffsetCurve2d
 Послать отзыв
 Конструктор класса OffsetCurve2d. Создает кривую из указанной базовой кривой со смещением на заданное расстояние.
 Синтаксис
C#
Visual Basic
Копировать Код
public OffsetCurve2d( ref Curve2d baseCurve, double offsetDistance );
Копировать Код
Public Sub New( ByRef baseCurve As Curve2d, offsetDistance As Double )
 Параметры
 Параметры
 Описание
 baseCurve
 Входная базовая кривая. Тип Curve2d.
 offsetDistance
 Величина смещения. Тип double.
 Описание
 Конструктор класса OffsetCurve2d. Создает кривую смещения из базовой кривой baseCurve со смещением offsetDistance.
 Ссылки
 Teigha.Geometry.OffsetCurve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!