Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AbstractViewportData.SetProps
 Послать отзыв
 Метод позволяет переопределить свойства связанного видового экрана, используя свойства указанного вида.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetProps( ref RXObject pSourceView );
Копировать Код
Public Sub SetProps( ByRef pSourceView As RXObject )
 Параметры
 Параметры
 Описание
 pSourceView
 Входной вид, который служит источником данных для свойств. Тип RXObject.
 Описание
 Метод позволяет переопределить свойства связанного видового экрана, используя свойства указанного вида.
 Ссылки
 Teigha.DatabaseServices.AbstractViewportData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!