Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DataColumn.PhysicalLength
 Послать отзыв
 Свойство возвращает физическую длину данного столбца.
 Синтаксис
C#
Visual Basic
Копировать Код
public int PhysicalLength;
Копировать Код
Public Property PhysicalLength() As Integer
 Возвращает
 Возвращает количество строк в столбце. Тип int.
 Описание
 Свойство возвращает физическую длину данного столбца, т.е. количество строк в столбце.
 Физическая длина столбца представляет собой максимальное количество ячеек, которые может содержать столбец, прежде чем его длина будет увеличена автоматически.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.DataColumn, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!