Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SectionGeometry
 Послать отзыв
 Перечисление SectionGeometry определяет типы элементов геометрии, составляющих сечения и разрезы.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum SectionGeometry { BackgroundGeometry = 4, CurveTangencyLines = 16, ForegroundGeometry = 8, IntersectionBoundary = 1, IntersectionFill = 2 }
Копировать Код
Public Enum SectionGeometry BackgroundGeometry = 4 CurveTangencyLines = 16 ForegroundGeometry = 8 IntersectionBoundary = 1 IntersectionFill = 2 End Enum
 Члены
 Члены
 Описание
 IntersectionBoundary
 Значение: 1. Геометрия границ пересечения.
 IntersectionFill
 Значение: 2. Геометрия заливки сечений и разрезов.
 BackgroundGeometry
 Значение: 4. Геометрия фона.
 ForegroundGeometry
 Значение: 8. Геометрия переднего плана.
 CurveTangencyLines
 Значение: 16. Геометрия касательных линий.
 Описание
 Перечисление SectionGeometry определяет типы элементов геометрии, составляющих сечения и разрезы. Используется для настройки свойств этой геометрии.
 Ваши комментарии по поводу этого топика: Послать отзыв!