Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObject.Reappended
 Послать отзыв
 Событие происходит каждый раз, когда повторно обрабатывается добавление объекта в базу данных.
 Синтаксис
C#
Visual Basic
Копировать Код
public event EventHandler Reappended;
Копировать Код
Public Event Reappended As EventHandler
 Возвращает
 Тип данных EventHandler, представляющий обработчик события.
 Описание
 Событие вызывается каждый раз, когда повторно обрабатывается добавление объекта в базу данных.
 Ссылки
 Teigha.DatabaseServices.DBObject, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!