Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DatabaseSummaryInfoBuilder.Title
 Послать отзыв
 Свойство обеспечивает доступ заголовку Title.
 Синтаксис
C#
Visual Basic
Копировать Код
public String Title;
Копировать Код
Public Property Title() As String
 Возвращает
 Возвращает значение поля Title. Тип String
 Описание
 Свойство обеспечивает доступ заголовку Title.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.DatabaseSummaryInfoBuilder, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!