Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Mline.GetClosestPointTo
 Послать отзыв
 Метод позволяет найти точку на объекте MLine, которая является ближайшей к проекции заданной точки на плоскость данной мультилинии.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d GetClosestPointTo( Point3d givenPoint, Vector3d normal, bool extend, bool excludeCaps );
Копировать Код
Public Function GetClosestPointTo( givenPoint As Point3d, normal As Vector3d, extend As Boolean, excludeCaps As Boolean ) As Point3d
 Параметры
 Параметры
 Описание
 givenPoint
 Точка, для которой выполняется поиск ближайшей точки на объекте Mline. Тип Point3d.
 normal
 Нормаль плоскости, на которую выполняется проецирование. Тип Vector3d.
 extend
 Флаг, который определяет, следует ли в процессе поиска ближайшей точки продлевать конечные элементы объекта Mline. Тип bool.
 excludeCaps
 Флаг, определяющий, следует ли исключить из рассмотрения торцевые ограничители и обозначения стыков сегментов данной мультилинии. Тип bool.
 Возвращает
 Возвращает точку на объекте MLine, ближайшую к проекции заданной точки givenPoint. Тип Point3d.
 Описание
 Метод позволяет найти точку на объекте MLine, которая является ближайшей к проекции заданной точки givenPoint на плоскость данной мультилинии.
 Сначала точка givenPoint проецируется вдоль вектора normal на плоскость, содержащую объект MLine. Затем спроецированная точка используется для поиска ближайшей точки на объекте MLine. Если аргумент extend равен true, то конечные элементы объекта MLine будут «виртуально» продлены для поиска ближайшей точки. Если аргумент excludeCaps равен true, то любые торцевые ограничители и обозначения стыков сегментов объекта MLine будут игнорироваться.
 Ссылки
 Teigha.DatabaseServices.Mline, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!