Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Entity.IntersectWith(Entity
 Послать отзыв
 Метод вычисляет точки пересечения между текущим геометрическим объектом и указанным в параметре entityPointer, учитывая тип пересечения intersectType и проекционную плоскость projectionPlane. Найденные точки пересечения добавляются в коллекцию points в координатах WCS.
 Синтаксис
C#
Visual Basic
Копировать Код
public void IntersectWith(Entity entityPointer, Intersect intersectType, Plane projectionPlane, Point3dCollection points, IntPtr thisGraphicSystemMarker, IntPtr otherGraphicSystemMarker);
Копировать Код
Public Sub IntersectWith(entityPointer As Entity, intersectType As Intersect, projectionPlane As Plane, points As Point3dCollection, thisGraphicSystemMarker As IntPtr, otherGraphicSystemMarker As IntPtr)
 Параметры
 Параметры
 Описание
 entityPointer
 Входной объект, с которым проверяется пересечение текущего объекта. Тип Entity
 intersectType
 Тип пересечения, определяющий, как обрабатывать продление объектов при поиске пересечений. Тип Teigha.DatabaseServices.Intersect
 projectionPlane
 Плоскость проекции, используемая при вычислении пересечений. Тип Plane
 points
 Коллекция, в которую добавляются найденные точки пересечения (в WCS). Тип Point3dCollection
 thisGraphicSystemMarker
 Маркер графической системы, указывающий на подобъект текущего объекта. Используется для локализации пересечения. Если значение ? 0 — параметр игнорируется. Тип IntPtr
 otherGraphicSystemMarker
 Маркер графической системы, указывающий на подобъект объекта entityPointer. Если значение ? 0 — параметр игнорируется. Тип IntPtr
 Описание
 Метод IntersectWith вычисляет точки пересечения между текущим геометрическим объектом и другим объектом, указанным в параметре entityPointer. При этом учитываются рёбра ограничивающего прямоугольника (bounding box) текущего объекта. Тип пересечения задаётся параметром intersectType, который определяет, требуется ли продление объектов для поиска "видимых" пересечений.
 Найденные точки пересечения добавляются в коллекцию points в мировой системе координат (WCS).
 Для более точного определения участвующих подобъектов используются параметры thisGraphicSystemMarker и otherGraphicSystemMarker — это графические маркеры, указывающие на конкретные подобъекты текущего и целевого объектов соответственно. Если какой-либо из этих параметров равен 0, соответствующий маркер игнорируется.
 При реализации метода в производных классах рекомендуется использовать возможности графических библиотек (например, методы IsOn() или IntersectWith() из классов Curve3d и CircularArc3d) для вычисления пересечений с графическими примитивами. Также, если тип объекта не поддерживается напрямую, можно вызвать его метод IntersectWith, передав туда текущий объект как аргумент.
 Ссылки
 Teigha.DatabaseServices.Entity, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!