Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeaderStyle.EnableFrameText
 Послать отзыв
 Свойство позволяет контролировать отображение рамки вокруг текста мультивыноски.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool EnableFrameText;
Копировать Код
Public Property EnableFrameText As Boolean
 Возвращает
 Возвращает true, если рамка вокруг текста отображается. В противном случае возвращает false.
 Описание
 Свойство позволяет контролировать отображение рамки вокруг текста мультивыноски.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MLeaderStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!