Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Field.ConvertToTextField
 Послать отзыв
 Метод предоставляет возможность преобразовать поле в текстовое. Не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public void ConvertToTextField();
Копировать Код
Public Sub ConvertToTextField()
 Описание
 Метод предоставляет возможность преобразовать поле в текстовое. Не реализовано.
 Ссылки
 Teigha.DatabaseServices.Field, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!