Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Interval.IsPeriodicallyOn
 Послать отзыв
 Метод позволяет проверить, является ли указанное значение периодическим на этом интервале с заданным периодом.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsPeriodicallyOn( double period, out double value );
Копировать Код
Public Function IsPeriodicallyOn( period As Double, value As Out Double ) As Boolean
 Параметры
 Параметры
 Описание
 period
 Входное значение периода. Тип double.
 value
 Выходное значение. Тип double. Если метод возвращает true, то value получает значение, которое с периодом period целое количество раз попадает в данный интервал.
 Возвращает
 Возвращает true, если существует положительное целое число N, такое что значение value + N * period принадлежит данному интервалу. В противном случае возвращает false.
 Описание
 Метод позволяет проверить, является ли указанное значение периодическим на этом интервале с заданным периодом. Другими словами, существует ли такое положительное целое число N, что значение value + N * period принадлежит данному интервалу.
 Ссылки
 Teigha.Geometry.Interval, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!