Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Solid3d.CreateLoftedSolid
 Послать отзыв
 Метод предназначен для создания трехмерного твердого тела методом лофта - вытягиванием по сечениям.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void CreateLoftedSolid( ref Entity[] crossSectionCurves, ref Entity[] guideCurves, ref Entity pathCurve, ref LoftOptions loftOptions );
Копировать Код
Public Overridable Sub CreateLoftedSolid( ByRef crossSectionCurves() As Entity, ByRef guideCurves() As Entity, ByRef pathCurve As Entity, ByRef loftOptions As LoftOptions )
 Параметры
 Параметры
 Описание
 crossSectionCurves
 Массив кривых, которые будут использоваться операцией лофта в качестве поперечных сечений. Тип Entity[].
 guideCurves
 Массив направляющих. Тип Entity[].
 pathCurve
 Кривая пути. Тип Entity.
 loftOptions
 Опции операции лофта. Тип LoftOptions.
 Описание
 Метод предназначен для создания трехмерного твердого тела методом лофта - вытягиванием по сечениям.
 Ссылки
 Teigha.DatabaseServices.Solid3d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!