Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocDependency.IsDependentOnCompoundObject
 Послать отзыв
 Свойство позволяет проверить, является ли связанный с зависимостью объект составным, т.е. используется ли данной зависимостью идентификатор составного объекта CompoundObjectId.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsDependentOnCompoundObject;
Копировать Код
Public Property IsDependentOnCompoundObject() As Boolean
 Возвращает
 Возвращает true, если зависимость использует идентификатор CompoundObjectId. В противном случае возвращает false.
 Описание
 Свойство позволяет проверить, является ли связанный с зависимостью объект составным, т.е. используется ли данной зависимостью идентификатор составного объекта CompoundObjectId.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.AssocDependency, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!