Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MeshFaceterData.FaceterMaxEdgeLength
 Послать отзыв
 Свойство представляет максимальную длину ребер сети.
 Синтаксис
C#
Visual Basic
Копировать Код
public double FaceterMaxEdgeLength;
Копировать Код
Public Property FaceterMaxEdgeLength As Double
 Возвращает
 Возвращает максимальную длину ребер сети. Тип double.
 Описание
 Свойство представляет максимальную длину ребер сети.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MeshFaceterData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!