Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MlineStyleElementCollectionEnumerator.MoveNext
 Послать отзыв
 Метод выполняет переход к следующему элементу в коллекции.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool MoveNext();
Копировать Код
Public Function MoveNext() As Boolean
 Возвращает
 Возвращает true, если новое значение индекса остается в допустимом диапазоне. Если новое значение индекса выходит за пределы коллекции, метод возвращает false.
 Описание
 Метод выполняет переход к следующему элементу в коллекции. В случае успешного перехода возвращает true.
 Ссылки
 Teigha.DatabaseServices.MlineStyleElementCollectionEnumerator, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!