Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MeshPointMap
 Послать отзыв
 Структура MeshPointMap хранит данные, возвращаемые методом Teigha.DatabaseServices.GeoLocationData.GetMashPointMap().
 Иерархия классов
Teigha::DatabaseServices::MeshPointMap
 Синтаксис
C#
Visual Basic
Копировать Код
public struct MeshPointMap
Копировать Код
Public Structure MeshPointMap
 Описание
 Структура MeshPointMap хранит данные, возвращаемые методом Teigha.DatabaseServices.GeoLocationData.GetMashPointMap().
 Методы
 Конструкторы
 Имя
 Описание
 MeshPointMap
 Конструктор структуры MeshPointMap.
 Топики
 Имя
 Описание
 MeshPointMap Свойства
 Ниже перечислены свойства класса MeshPointMap.
 Ссылки
 MeshPointMap Свойства, Методы, Топики, MeshPointMap Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!