Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Filters.SpatialFilterVolume.ViewField
 Послать отзыв
 Свойство ViewField возвращает вектор области просмотра преобразованной границы отсечения.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector2d ViewField;
Копировать Код
Public ReadOnly Property ViewField As Vector2d
 Возвращает
 Возвращает вектор области просмотра. Тип Vector2d.
 Описание
 Свойство ViewField возвращает вектор области просмотра преобразованной границы отсечения.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Filters.SpatialFilterVolume, Teigha.DatabaseServices.Filters
 Ваши комментарии по поводу этого топика: Послать отзыв!