Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Light.GlyphDisplayType
 Послать отзыв
 Свойство представляет вариант отображения глифа для данного источника света.
 Синтаксис
C#
Visual Basic
Копировать Код
public GlyphDisplayType GlyphDisplayType;
Копировать Код
Public Property GlyphDisplayType As GlyphDisplayType
 Возвращает
 Возвращает вариант отображения глифа для данного источника света. Перечисление GlyphDisplayType.
 Описание
 Свойство представляет вариант отображения глифа для данного источника света.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Light, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!