Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 LayerTableRecord.LinetypeObjectId
 Послать отзыв
 В свойстве хранится ObjectId типа линии, который установлен в слое.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectId LinetypeObjectId { get; set; }
Копировать Код
Public Property LinetypeObjectId As ObjectId
 Возвращает
 Возвращает тип данных ObjectId.
 Описание
 С помощью свойства можно получить ObjectId типа линии, который используется в слое. Установленный тип линии будет у всех объектов, распложенных на этом слое, если тип линии каждого объекта установлен в значение "По слою".
 Зная ObjectId типа линии можно открыть его из базы данных чертежа и посмотреть подробную информацию об этом типе линии. Также можно установить новый тип линии в слое, поменяв значение свойства на ObjectId нужного типа линии.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.LayerTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!