Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Событие Database.DatabaseToBeDestroyed
 Послать отзыв
 Синтаксис
C#
Visual Basic
public event EventHandler DatabaseToBeDestroyed;
Public Event DatabaseToBeDestroyed As EventHandler
 Описание
 Событие показывает, что база данных чертежа уничтожена.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!