Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CellBorder.LineWeight
 Послать отзыв
 Свойство LineWeight представляет вес линии, которая используется для границы ячейки.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.LineWeight? LineWeight;
Копировать Код
Public Property LineWeight As DatabaseServices.LineWeight?
 Возвращает
 Возвращает вес (толщину) линии. Перечисление DatabaseServices.LineWeight?.
 Описание
 Свойство LineWeight представляет вес (толщину) линии, которая используется для границы ячейки.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.CellBorder, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!