Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DwgFiler
 Послать отзыв
 Этот класс является абстрактным базовым классом для классов, которые используются для файловых операций ввода-вывода в формате DWG.
 Иерархия классов
Teigha::DatabaseServices::DwgFiler
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdDbDwgFiler")] public class DwgFiler : RXObject;
Копировать Код
<Wrapper("OdDbDwgFiler")> Public Class DwgFiler Inherits RXObject
 Описание
 Этот класс является абстрактным базовым классом для классов, которые используются для файловых операций ввода-вывода в формате DWG.
 Топики
 Имя
 Описание
 DwgFiler Методы
 Ниже перечислены методы класса DwgFiler.
 DwgFiler Свойства
 Ниже перечислены свойства класса DwgFiler.
 Ссылки
 DwgFiler Методы, DwgFiler Свойства, Топики, DwgFiler Методы, DwgFiler Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!