Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CircularArc2d.StartPoint
 Послать отзыв
 Свойство StartPoint представляет начальную точку дуги.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point2d StartPoint;
Копировать Код
Public ReadOnly Property StartPoint As Point2d
 Возвращает
 Возвращает начальную точку дуги. Тип Point2d.
 Описание
 Свойство StartPoint представляет начальную точку дуги.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.CircularArc2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!