Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObject.CreateExtensionDictionary()
 Послать отзыв
 Метод создает словарь расширения этого объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public void CreateExtensionDictionary();
Копировать Код
Public Sub CreateExtensionDictionary()
 Описание
 Создает объект DBDictionary и устанавливает его как расширенный словарь для объекта DBObject.
 Ссылки
 Teigha.DatabaseServices.DBObject, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!