Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LoftOptions.NoTwist
 Послать отзыв
 Свойство возвращает значение опции noTwist (нет кручения).
 Синтаксис
C#
Visual Basic
Копировать Код
public bool NoTwist;
Копировать Код
Public ReadOnly Property NoTwist As Boolean
 Возвращает
 Возвращает true, если установлена опция "нет кручения". В противном случае возвращает false.
 Описание
 Свойство возвращает значение опции noTwist (нет кручения). Эту опцию можно использовать для минимизации скручивания поверхности, когда все поперечные сечения являются замкнутыми. Значение по умолчанию — true. В этом случае начальная точка каждого замкнутого сечения выравнивается по другим сечениям для минимизации скручивания всей поверхности.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.LoftOptions, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!