Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Polyline.GetPoint3dAt
 Послать отзыв
 Синтаксис
C#
Visual Basic
public Point3d GetPoint3dAt(int index);
Public Function GetPoint3dAt(index As Integer) As Point3d
 Параметры
 Параметры
 Описание
 index
 Индекс (отсчитываемый от 0) вершины
 Описание
 Этот метод возвращает 3D расположение вершины полилинии, заданной параметром index, в Мировой системе координат.
 Ссылки
 Teigha.DatabaseServices.Polyline, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!