Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.BackgroundColor
 Послать отзыв
 Метод определяет цвет фона указанной ячейки таблицы.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual Color BackgroundColor( int row, int col );
Копировать Код
Public virtual Function BackgroundColor( row As Integer, col As Integer ) As Color
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int.
 col
 Индекс столбца, тип int.
 Возвращает
 Возвращает цвет фона ячейки в виде экземпляра класса Color.
 Описание
 Метод определяет цвет фона ячейки таблицы, заданной индексами строки и столбца.
 Замечания
 Для получения того же результата предпочтительнее использовать функционал объекта Cell.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!