Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocArray.GetAssociativeArray
 Послать отзыв
 Метод позволяет найти ассоциативный массив AssocArray, в котором участвует заданный объект.
 Синтаксис
C#
Visual Basic
Копировать Код
public AssocArray GetAssociativeArray( ObjectId entity );
Копировать Код
Public Function GetAssociativeArray( entity As ObjectId ) As AssocArray
 Параметры
 Параметры
 Описание
 entity
 Идентификатор объекта, для которого ищется ассоциативный массив. Тип ObjectId.
 Возвращает
 Возвращает найденный ассоциативный массив. Тип AssocArray. Если ассоциативный массив не существует, возвращает Null.
 Описание
 Метод позволяет найти ассоциативный массив AssocArray, в котором участвует заданный объект entity.
 Идентификатор объекта ActionBody, отвечающего за вычисления с entity в ассоциативном массиве, указан в массиве AssocArray. Если такого ActionBody не существует, метод возвращает нулевой указатель.
 Ссылки
 Teigha.DatabaseServices.AssocArray, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!