Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Database.GetViewports
 Послать отзыв
 Синтаксис
C#
Visual Basic
public ObjectIdCollection GetViewports(bool bGetPaperspaceVports);
Public Function GetViewports(bGetPaperspaceVports As bool) As ObjectIdCollection
 Параметры
 Параметры
 Описание
 bGetPaperspaceVports
 Признак, указывающий, нужно ли возвращать видовые экраны пространства листа, ассоциированные со слоями
 Описание
 Функция нумерует видовые экраны чертежа.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!