Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.Dimjust
 Послать отзыв
 Свойство задает или возвращает горизонтальное выравнивание поля размерного текста (относительно выносных линий).
 Синтаксис
C#
Visual Basic
Копировать Код
public int Dimjust;
Копировать Код
Public Property Dimjust As Integer
 Возвращает
 Возвращает код горизонтального выравнивания поля размерного текста. Тип int.
 Описание
 Свойство задает или возвращает горизонтальное выравнивание поля размерного текста (относительно выносных линий).
 Список допустимых значений:
 Значение
 Описание
 0
 Размещение текста над размерной линией и центром (выравнивание между выносными линиями).
 1
 Размещение текста рядом с первой выносной линией.
 2
 Размещение текста рядом со второй выносной линией.
 3
 Размещение текста выше и параллельно первой выносной линии.
 4
 Размещение текста выше и параллельно второй выносной линии.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!