Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve3d.IsLinear
 Послать отзыв
 Метод проверяет, является ли данная кривая линейной в пределах заданного геометрического допуска.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsLinear( out Line3d line, Tolerance tolerance );
Копировать Код
Public Function IsLinear( line As out Line3d, tolerance As Tolerance ) As Boolean
 Параметры
 Параметры
 Описание
 line
 Линия, с которой совпадает кривая в случае ее прямолинейности. Тип Line3d.
 tolerance
 Требуемая точность вычислений. Тип Tolerance.
 Возвращает
 Возвращает true, если кривая является линейной, и false в противном случае.
 Описание
 Метод проверяет, является ли данная кривая линейной в пределах заданного геометрического допуска. Параметр line содержит значимые данные только в том случае, если метод возвращает значение true.
 Ссылки
 Teigha.Geometry.Curve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!