Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AlignedDimension
 Послать отзыв
 Класс AlignedDimension представляет тип размера, определяющего расстояние между двумя произвольными точками в пространстве.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::GraphicsInterface::Drawable Teigha::DatabaseServices::DBObject Teigha::DatabaseServices::Entity Teigha::DatabaseServices::Dimension Teigha::DatabaseServices::AlignedDimension
 Синтаксис
C#
Visual Basic
Копировать Код
[TypeDescriptionProvider("Teigha.ComponentModel.TypeDescriptionProvider`1[[Teigha.DatabaseServices.AlignedDimension, TD_Mgd]], TD_Mgd"),Wrapper("AcDbAlignedDimension")] public class AlignedDimension : Dimension;
Копировать Код
<TypeDescriptionProvider("Teigha.ComponentModel.TypeDescriptionProvider`1[[Teigha.DatabaseServices.AlignedDimension, TD_Mgd]], TD_Mgd"),Wrapper("AcDbAlignedDimension")> Public Class AlignedDimension Inherits Dimension
 Описание
 Класс AlignedDimension используется для представления размера, определяющего расстояние между двумя произвольными точками в пространстве. Вектор нормали размера должен быть перпендикулярен линии, соединяющей эти две опорные точки. Опорные точки служат началом двух выносных линий размера.
 Замечания
 Когда вновь созданный объект AlignedDimension закрывается в первый раз, для него автоматически создается анонимный блок, на который можно ссылаться для визуализации. Анонимный блок представлен записью BlockTableRecord, которая содержит все используемые линии, дуги, сплошные стрелки, текст и т.д. Имя блока имеет префикс *D.
 Если размер AlignedDimension был настроен на использование конкретной позиции текста, которая отличается от положения по умолчанию (т.е. было переопределено значение Dimension.TextPosition), и для системной переменной DIMFIT не задано значение 4, то позиция текста будет иметь приоритет над значением dimLine.
 Методы
 Конструкторы
 Teigha.GraphicsInterface.Drawable
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 Drawable
 Конструктор класса Teigha.GraphicsInterface.Drawable. (Унаследован от Drawable)
 Teigha.DatabaseServices.DBObject
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 DBObject
 Конструктор. (Унаследован от DBObject)
 Teigha.DatabaseServices.AlignedDimension
 Имя
 Описание
 AlignedDimension
 Это обзор перегрузок AlignedDimension.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.GraphicsInterface.Drawable
 Имя
 Описание
 Drawable Методы
 Ниже перечислены методы класса Drawable.
 Drawable Свойства
 Ниже перечислены свойства класса Drawable.
 Teigha.DatabaseServices.DBObject
 Имя
 Описание
 DBObject Методы
 Ниже перечислены методы класса DBObject.
 DBObject Свойства
 Ниже перечислены свойства класса DBObject.
 DBObject События
 Ниже перечислены события класса DBObject.
 Teigha.DatabaseServices.Entity
 Имя
 Описание
 Entity Методы
 Ниже перечислены методы класса Entity.
 Entity Свойства
 Ниже перечислены свойства класса Entity.
 Teigha.DatabaseServices.Dimension
 Имя
 Описание
 Dimension Методы
 Ниже перечислены методы класса Dimension.
 Dimension Свойства
 Ниже перечислены свойства класса Dimension.
 Teigha.DatabaseServices.AlignedDimension
 Имя
 Описание
 AlignedDimension Свойства
 Ниже перечислены свойства класса AlignedDimension.
 Ссылки
 AlignedDimension Конструктор, AlignedDimension Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства, DBObject События
 Ваши комментарии по поводу этого топика: Послать отзыв!