Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AbstractViewportData.IsUcsIconVisible
 Послать отзыв
 Свойство IsUcsIconVisible позволяет определить, включено ли отображение значка UCS (ПСК) в видовом экране.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsUcsIconVisible;
Копировать Код
Public Property IsUcsIconVisible As Boolean
 Возвращает
 Возвращает true, если отображение значка UCS (ПСК) включено. В противном случае возвращает false.
 Описание
 Свойство IsUcsIconVisible позволяет определить, включено ли отображение значка UCS (ПСК) в видовом экране.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.AbstractViewportData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!