Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Filters.Filter.IndexClass
 Послать отзыв
 Свойство IndexClass предоставляет доступ к дескриптору класса Index для данного фильтра.
 Синтаксис
C#
Visual Basic
Копировать Код
public RXClass IndexClass;
Копировать Код
Public ReadOnly Property IndexClass As RXClass
 Возвращает
 Возвращает дескриптор класса. Тип RXClass.
 Описание
 Свойство IndexClass предоставляет доступ к дескриптору класса Index для данного фильтра. Используется при инициализации перечислителя FilteredBlockIterator.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Filters.Filter, Teigha.DatabaseServices.Filters
 Ваши комментарии по поводу этого топика: Послать отзыв!