Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeaderStyle.ContentType
 Послать отзыв
 Свойство представляет тип содержимого мультивыноски, предусмотренный данным стилем.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.ContentType ContentType;
Копировать Код
Public Property ContentType As DatabaseServices.ContentType
 Возвращает
 Возвращает тип содержимого мультивыноски. Значение из перечисления DatabaseServices.ContentType.
 Описание
 Свойство представляет тип содержимого мультивыноски, предусмотренный данным стилем.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MLeaderStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!