Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CurveCurveIntersector2d.Curve2
 Послать отзыв
 Свойство Curve2 представляет указатель на вторую кривую в данном объекте.
 Синтаксис
C#
Visual Basic
Копировать Код
public Geometry.Curve2d Curve2;
Копировать Код
Public ReadOnly Property Curve2 As Geometry.Curve2d
 Возвращает
 Возвращает вторую кривую. Тип Geometry.Curve2d.
 Описание
 Свойство Curve2 представляет указатель на вторую кривую в данном объекте.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.CurveCurveIntersector2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!