Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DatabaseSummaryInfo.RevisionNumber
 Послать отзыв
 Свойство предоставляет доступ к номеру ревизии данного объекта DatabaseSummaryInfo.
 Синтаксис
C#
Visual Basic
Копировать Код
public String RevisionNumber;
Копировать Код
Public Property RevisionNumber() As String
 Возвращает
 Возвращает номер ревизии данного объекта. Тип String.
 Описание
 Свойство предоставляет доступ к номеру ревизии данного объекта DatabaseSummaryInfo.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.DatabaseSummaryInfo, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!