Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Interval.IsBounded
 Послать отзыв
 Свойство IsBounded позволяет проверить, является ли данный интервал ограниченным с обеих сторон.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsBounded;
Копировать Код
Public ReadOnly Property IsBounded As Boolean
 Возвращает
 Возвращает true, если данный интервал является ограниченным как сверху, так и снизу. В противном случае возвращает false.
 Описание
 Свойство IsBounded позволяет проверить, является ли данный интервал ограниченным с обеих сторон, т.е. конечным.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.Interval, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!