Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 DimStyleTableRecord.Dimlim
 Послать отзыв
 Свойство отвечает за настройку отображения предельных допусков размеров.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual bool Dimlim { get; set; }
Копировать Код
Public Overridable Property Dimlim As Boolean
 Возвращает
 Возвращает тип данных bool:
true – отображение пределов размеров включено;
false – отображение пределов размеров выключено.
 Описание
 В свойстве хранится настройка отображения предельных допусков размеров. В качестве значения свойства доступны следующие:
true – отображение пределов размеров включено;
false – отображение пределов размеров выключено.
 Свойство также доступно через системную переменную DIMLIM и пользовательское меню в окне изменения/создания размерного стиля:
  При изменении системной переменной DIMLIM будет создан новый размерный стиль под названием <переопределение> на основе текущего с новым значением DIMLIM.
 Условия
 Чтение и запись.
 Пример
 Пример изменения настройки отображения предельных допусков размеров (значения свойства Dimlim) в размерном стиле Standard:
C#
 Копировать Код
public partial class Commands { [Teigha.Runtime.CommandMethod("DimlimChange")] public void DimlimStandardDimStyle() { // Получение ссылки на активный документ HostMgd.ApplicationServices.Document doc = HostMgd.ApplicationServices.Application.DocumentManager.MdiActiveDocument; // Получение ссылки на редактор документа HostMgd.EditorInput.Editor ed = doc.Editor; // Получение ссылки на базу данных документа Teigha.DatabaseServices.Database db = doc.Database; // Начало транзакции с базой данных документа using (Teigha.DatabaseServices.Transaction trans = db.TransactionManager.StartTransaction()) { // Открываем таблицу размерных стилей для чтения Teigha.DatabaseServices.DimStyleTable dimStyleTable = trans.GetObject(db.DimStyleTableId, Teigha.DatabaseServices.OpenMode.ForRead) as Teigha.DatabaseServices.DimStyleTable; // Находим в таблице размерных стилей ObjectId нужного стиля по его названию Teigha.DatabaseServices.ObjectId styleId = dimStyleTable["Standard"]; // Открываем таблицу размерного стиля для изменений Teigha.DatabaseServices.DimStyleTableRecord obj = trans.GetObject(styleId, Teigha.DatabaseServices.OpenMode.ForWrite) as Teigha.DatabaseServices.DimStyleTableRecord; ed.WriteMessage($"nDimlim before: {obj.Dimlim}"); // Изменяем признак отображения допусков obj.Dimlim = false; ed.WriteMessage($"nDimlim after: {obj.Dimlim}"); trans.Commit(); } } }
 Результат работы команды DimlimChange:
 Было:
 Стало:
 Ссылки
 Teigha.DatabaseServices.DimStyleTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!