Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 ViewportTableRecord.CircleSides
 Послать отзыв
 Свойство предназначено для управления коэффициентом сглаживания кривых.
 Синтаксис
C#
Visual Basic
public short CircleSides;
Public Property CircleSides() As short
 Возвращает
 Возвращает тип данных short.
 Описание
 С помощью свойства можно управлять коэффициентом сглаживания кривых. Значение по умолчанию 1000. Диапазон возможных значений – от 0 до 20000.
 Условия
 Чтение и запись.
 Ссылки
 ViewportTableRecord Класс, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!