Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.XrefGraphNode
 Послать отзыв
 Класс XrefGraphNode представляет в базе данных узлы графа внешних ссылок.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::DatabaseServices::GraphNode Teigha::DatabaseServices::XrefGraphNode
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdDbXrefGraphNode")] public class XrefGraphNode : GraphNode
Копировать Код
<Wrapper("OdDbXrefGraphNode")> Public Class XrefGraphNode Inherits GraphNode
 Описание
 Класс XrefGraphNode представляет в базе данных узлы графа внешних ссылок.
 Граф внешних ссылок реализуется классом XrefGraph, этот ориентированный граф описывает связи между главным чертежом и чертежами, на которые в нем имеются внешние ссылки, а также с любыми чертежами по вложенным внешним ссылкам. Каждый узел графа внешних ссылок представляет записи внешней базы данных или ее таблицы блоков, на которые имеются внешние ссылки. Корневой узел всегда представляет главный чертеж. Каждая внешняя ссылка (между базами данных) представлена в графе своим ребром. Входящие ребра узла соответствуют ссылкам на этот узел, а исходящие - ссылкам этого узла на другие узлы.
 Родительский класс GraphNode предоставляет свойства и методы для работы с входящими и исходящими ссылками узла. Хотя по внешней ссылке на одну запись в таблице блоков вполне могут ссылаться несколько вхождений блоков, между узлами XrefNode создается только одно соответствующее ребро.
 Методы
 Конструкторы
 Teigha.DatabaseServices.GraphNode
 Имя
 Описание
 GraphNode
 Это обзор перегрузок GraphNode.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.DatabaseServices.GraphNode
 Имя
 Описание
 GraphNode Методы
 Ниже перечислены методы класса GraphNode.
 GraphNode Свойства
 Ниже перечислены свойства класса GraphNode.
 Teigha.DatabaseServices.XrefGraphNode
 Имя
 Описание
 XrefGraphNode Свойства
 Ниже перечислены свойства класса XrefGraphNode.
 Ссылки
 XrefGraphNode Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!