Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Делегат Teigha.DatabaseServices.BlockInsertionPointsEventHandler
 Послать отзыв
 This is type Teigha::DatabaseServices::BlockInsertionPointsEventHandler.
 Синтаксис
C#
Visual Basic
public delegate BlockInsertionPointsEventHandler();
Public Delegate Sub BlockInsertionPointsEventHandler()
 Ваши комментарии по поводу этого топика: Послать отзыв!