Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Point3AngularDimension.XLine1Point
 Послать отзыв
 Свойство XLine1Point представляет начальную точку первой выносной линии углового размера.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d XLine1Point;
Копировать Код
Public Property XLine1Point As Point3d
 Возвращает
 Возвращает начальную точку первой выносной линии размера. Тип Point3d.
 Описание
 Свойство XLine1Point представляет конечную точку первой опорной линии данного размера. Эта точка определяет начальную точку первой выносной линии углового размера.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Point3AngularDimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!