Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Viewport.NonRectClipOn
 Послать отзыв
 Свойство NonRectClipOn позволяет определить, включен ли в данном видовом экране режим обрезки непрямоугольным объектом.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool NonRectClipOn;
Копировать Код
Public Property NonRectClipOn As Boolean
 Возвращает
 Возвращает true, если режим обрезки непрямоугольным объектом включен. В противном случае возвращает false.
 Описание
 Свойство NonRectClipOn позволяет определить, включен ли в данном видовом экране режим обрезки непрямоугольным объектом.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Viewport, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!