Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve2d.IsClosed
 Послать отзыв
 Метод выполняет проверку, замкнута ли данная кривая с учетом заданной точности.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsClosed( Tolerance tolerance );
Копировать Код
Public Function IsClosed( tolerance As Tolerance ) As Boolean
 Параметры
 Параметры
 Описание
 tolerance
 Входная геометрическая точность. Тип Tolerance.
 Возвращает
 Возвращает true, если начальная и конечная точки кривой совпадают с точностью tolerance. В противном случае возвращает false.
 Описание
 Метод проверяет замкнутость данной кривой с учетом заданной точности. Кривая считается замкнутой, если в пределах указанной точности начальная и конечная точки кривой совпадают.
 Ссылки
 Teigha.Geometry.Curve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!