Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Dimscale
 Послать отзыв
 Синтаксис
C#
Visual Basic
public double Dimscale;
Public Property Dimscale() As Double
 Описание
 Возвращает или устанавливает текущее значение DIMSCALE для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!