Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObject.IsObjectIdsInFlux
 Послать отзыв
 Свойство предоставляет информацию, находится ли данный объект в процессе преобразования.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsObjectIdsInFlux;
Копировать Код
Public Property IsObjectIdsInFlux() As bool
 Возвращает
 Возвращает тип данных bool.
 Описание
 Свойство проверяет условие, которое происходит в процессе выполнения глубокого клонирования. Свойство возвращает true, если Id клонированных объектов еще не преобразованы, и, следовательно, не могут использоваться в любых операциях с объектами. Это условие обычно происходит только при CEventReactorImpl.beginDeepCloneXlation, DBObject.DeepClone, или DBObject.WblockClone. Любые операции, которые включают ссылку на Id объектов, таких как записи таблицы символов, должны быть отложены до окончания endDeepClone. DBObject.SubClose, чтобы не вызвать никаких объектов, Id которых могут находиться в процессе преобразования.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.DBObject, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!