Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DataColumn.GrowLength
 Послать отзыв
 Свойство возвращает или позволяет изменить величину приращения длины столбца. Не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public int GrowLength;
Копировать Код
Public Property GrowLength() As Integer
 Возвращает
 Свойство не реализовано. Всегда возвращает -200.
 Описание
 Свойство возвращает или позволяет изменить величину приращения длины столбца. Не реализовано.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.DataColumn, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!