Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.Dimexo
 Послать отзыв
 Свойство задает или возвращает отступ выносных линий от исходных точек.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Dimexo;
Копировать Код
Public Property Dimexo As Double
 Возвращает
 Возвращает отступ выносных линий от исходных точек. Тип double.
 Описание
 Свойство задает или возвращает отступ выносных линий от исходных точек. В случае выносных линий фиксированной длины Dimexo определяет минимальный отступ.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!