Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ResultBufferEnumerator.Reset
 Послать отзыв
 Метод реинициализирует данный перечислитель, устанавливая его указатель на первый элемент результирующего буфера.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Reset();
Копировать Код
Public Sub Reset()
 Описание
 Метод реинициализирует данный перечислитель, устанавливая его указатель на первый элемент результирующего буфера.
 Ссылки
 Teigha.DatabaseServices.ResultBufferEnumerator, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!