Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ObjectContextCollection
 Послать отзыв
 Класс ObjectContextCollection представляет интерфейс к определяемой приложением коллекции объектов ObjectContext.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::DatabaseServices::ObjectContextCollection
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdDbObjectContextCollection")] public abstract class ObjectContextCollection : RXObject, IEnumerable
Копировать Код
<Wrapper("OdDbObjectContextCollection")> Public MustInherit Class ObjectContextCollection Inherits RXObject Implements IEnumerable
 Описание
 Класс ObjectContextCollection представляет интерфейс к определяемой приложением коллекции объектов ObjectContext. Приложения реализуют этот интерфейс, чтобы определять пользовательские контексты для собственных контекстно-зависимых объектов.
 Приложения должны создать экземпляр коллекции (обычно один экземпляр в каждой базе данных) и зарегистрировать его средствами ObjectContextManager в базе данных, в которой предполагается поддержка требуемого типа контекста.
 Каждая коллекция контекстов имеет состояние. Оно представлено списком предусмотренных контекстов, "текущим" контекстом и возможностью блокировать или разблокировать экземпляры контекста.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.DatabaseServices.ObjectContextCollection
 Имя
 Описание
 ObjectContextCollection Методы
 Ниже перечислены методы класса ObjectContextCollection.
 ObjectContextCollection Свойства
 Ниже перечислены свойства класса ObjectContextCollection.
 Ссылки
 ObjectContextCollection Методы, ObjectContextCollection Свойства, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!