Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Ucsydir
 Послать отзыв
 Синтаксис
C#
Visual Basic
public Vector3d Ucsydir;
Public Property Ucsydir() As Vector3d
 Описание
 Обеспечивает доступ к текущему значению UCSYDIR для базы данных.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!