Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve2d.GetParameterOf
 Послать отзыв
 Метод вычисляет с указанной точностью значение параметра для заданной точки на кривой.
 Синтаксис
C#
Visual Basic
Копировать Код
public double GetParameterOf( Point2d point, Tolerance tolerance );
Копировать Код
Public Function GetParameterOf( point As Point2d, tolerance As Tolerance ) As Double
 Параметры
 Параметры
 Описание
 point
 Входная точка на кривой. Тип Point2d.
 tolerance
 Заданная точность вычислений. Тип Tolerance.
 Возвращает
 Возвращает значение параметра для точки point. Тип double.
 Описание
 Метод вычисляет с указанной точностью значение параметра для заданной точки на кривой.
 Реализация без проверки предполагает, что точка лежит на кривой. Если точка не лежит на кривой, метод возвращает непредсказуемый результат. Чтобы убедиться, что входная точка находится на кривой, используйте метод Curve2d.IsOn(Point2d point).
 Ссылки
 Teigha.Geometry.Curve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!