Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DataColumn.NumCells
 Послать отзыв
 Свойство возвращает количество ячеек в этом столбце.
 Синтаксис
C#
Visual Basic
Копировать Код
public int NumCells;
Копировать Код
Public Property NumCells() As Integer
 Возвращает
 Возвращает количество ячеек. Тип int.
 Описание
 Свойство возвращает количество ячеек в этом столбце.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.DataColumn, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!