Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LinkedTableData.GetEnumerator
 Послать отзыв
 Метод позволяет получить перечислитель для данного объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public TableEnumerator GetEnumerator();
Копировать Код
Public Function GetEnumerator() As TableEnumerator
 Возвращает
 Возвращает перечислитель для таблицы. Тип TableEnumerator.
 Описание
 Метод позволяет получить перечислитель для данного объекта.
 Ссылки
 Teigha.DatabaseServices.LinkedTableData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!