Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Ray.BasePoint
 Послать отзыв
 Свойство BasePoint представляет базовую точку, от которой исходит луч (начало луча).
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d BasePoint;
Копировать Код
Public Property BasePoint As Point3d
 Возвращает
 Возвращает трехмерную точку. Тип Point3d.
 Описание
 Свойство BasePoint представляет базовую точку, от которой исходит луч (начало луча).
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Ray, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!