Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBDictionaryEntry.m_key
 Послать отзыв
 Поле хранит ключ записи.
 Синтаксис
C#
Visual Basic
Копировать Код
public String m_key;
Копировать Код
Public m_key As String
 Возвращает
 Возвращает строку типа String, представляющую ключ записи.
 Описание
 Поле хранит ключ записи.
 Ссылки
 Teigha.DatabaseServices.DBDictionaryEntry, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!