Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство LinetypeTableRecord.PatternLength
 Послать отзыв
 Синтаксис
C#
Visual Basic
public double PatternLength;
Public Property PatternLength() As Double
 Описание
 Возвращает длину (в единицах чертежа nanoCAD - образец появится этой длины, если масштаб линий равен 1.0) образца в LinetypeTableRecord.
 Длина образца — это общая длина всех шриховок (включая пробелы).
 Встроенные формы или текстовые строки не добавляются к длине образца, поскольку они накладываются поверх и не прерывают реальный образец штриховки.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.LinetypeTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!