Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotStyleDescriptor.PlotStyleDescriptor
 Послать отзыв
 Конструктор. Создает новый объект PlotStyleDescriptor.
 Синтаксис
C#
Visual Basic
Копировать Код
public PlotStyleDescriptor( ObjectId id, PlotStyleNameType type );
Копировать Код
Public Sub New( id As ObjectId, type As PlotStyleNameType )
 Параметры
 Параметры
 Описание
 id
 Идентификатор ObjectId листа печати.
 type
 Тип стиля печати PlotStyleNameType.
 Описание
 Конструктор. Создает новый объект PlotStyleDescriptor.
 Ссылки
 Teigha.DatabaseServices.PlotStyleDescriptor, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!