Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Section.SetHeight
 Послать отзыв
 Метод позволяет задать высоту индикатора секущей плоскости выше или ниже линии сечения.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetHeight( SectionHeight nHeightType, double fHeight );
Копировать Код
Public Sub SetHeight( nHeightType As SectionHeight, fHeight As Double )
 Параметры
 Параметры
 Описание
 nHeightType
 Входной тип высоты из перечисления SectionHeight (выше или ниже линии сечения).
 fHeight
 Входное значение высоты. Тип double.
 Описание
 Метод позволяет задать высоту индикатора секущей плоскости выше или ниже линии сечения. Используется, когда типом секущей плоскости является плоскость или граница, поскольку в этих случаях разрез в вертикальном направлении бесконечен.
 Ссылки
 Teigha.DatabaseServices.Section, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!