Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Solid3d.CopyFace
 Послать отзыв
 Метод позволяет сделать копию указанной грани в виде отдельного объекта класса Region или Body.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual Entity CopyFace( SubentityId subEntityId );
Копировать Код
Public Overridable Function CopyFace( subEntityId As SubentityId ) As Entity
 Параметры
 Параметры
 Описание
 subEntityId
 Идентификатор подобъекта грани в данном твердом теле. Тип SubentityId.
 Возвращает
 Возвращает копию указанной грани в виде отдельного геометрического объекта. Тип Entity.
 Описание
 Метод позволяет сделать копию указанной грани в виде отдельного объекта класса Region или Body.
 Ссылки
 Teigha.DatabaseServices.Solid3d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!