Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор DBText.DBText ()
 Послать отзыв
 This is DBText, a member of class DBText.
 Синтаксис
C#
Visual Basic
public DBText();
Public Sub New()
 Ссылки
 Teigha.DatabaseServices.DBText, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!