Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Limcheck
 Послать отзыв
 Синтаксис
C#
Visual Basic
public bool Limcheck;
Public Property Limcheck() As bool
 Описание
 Возвращает или устанавливает текущее значение LIMCHECK пространства модели для базы данных. Значение false соответствует 0. Значение true — 1.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!