Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.GetDimstyleData
 Послать отзыв
 Метод предназначен для копирования настроек размерного стиля данного объекта Dimension, включая переопределения, в указанную запись таблицы размерных стилей.
 Синтаксис
C#
Visual Basic
Копировать Код
public DimStyleTableRecord GetDimstyleData();
Копировать Код
Public Function GetDimstyleData() As DimStyleTableRecord
 Возвращает
 Возвращает объект DimStyleTableRecord с копией настроек размерного стиля.
 Описание
 Метод предназначен для копирования настроек размерного стиля данного объекта Dimension в указанную запись таблицы размерных стилей. Скопированные данные включают данные размерного стиля со всеми применимыми переопределениями.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!