Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Hatch
 Послать отзыв
 Класс представляет объект "штриховка" или "заливка" на чертеже.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::GraphicsInterface::Drawable Teigha::DatabaseServices::DBObject Teigha::DatabaseServices::Entity Teigha::DatabaseServices::Hatch
 Синтаксис
C#
Visual Basic
[Wrapper("AcDbHatch")] public class Hatch : Entity;
<Wrapper("AcDbHatch")> Public Class Hatch Inherits Entity
 Описание
 Hatch (заливка) является геометрическим объектом на плоскости, который может быть создан и размещен на произвольной плоскости в 3D пространстве.
 Плоскость заливки может быть однозначно определена по значению вектора нормали в WCS (Мировых координатах) и расстоянию от начала координат (в WCS) до плоскости заливки. Плоскость заливки принимает стандартную систему координат объекта nanoCAD (OCS). Ее начало совпадает с WCS источника, а оси X и Y вычисляются с использованием алгоритма задания осей nanoCAD.
 Контур заливки определяет область, заполняемую определенным образцом заливки. Внутреннее представление контура заливки состоит из набора петель на плоскости. Каждая такая петля состоит из коллекции ребер, дуг окружности и эллипса или сплайнов. Если контур заливки содержит две или более петель, области внутри каждой из них должны быть полностью не связанными или быть полностью включены одна в другую.
 Петля должна быть простой и протяженной, пересекающей саму себя только в конечной точке. Более того, ее начальная и конечная точки должны совпадать. При определении контура заливки, приложение должно убедиться, что замкнутые линии и ребра полностью определены. Если контур содержит две или более петель, они должны быть организованы во вложенные структуры, в которых внешняя петля создается первой, затем все вложенные петли в том порядке, как они вложены одна в другую. Если есть более чем одна внешняя петля контура, то этот процесс повторяется. nanoCAD обеспечивает некоторые проверки корректности контура заливки, чтобы обеспечить эффективность и производительность API.
 Внутреннее представление ребер контура заливки производится объектами GELIB в геометрии 2D, включая LineSegment2d, CircularArc2d, EllipticalArc2d и NurbCurve2d. Если контур заливки содержит полилинию, то конструирование петель производится с помощью специальных методов.
 Ассоциативная заливка позволяет приложению создать объект заливки, ассоциированный с контуром существующих в nanoCAD объектов, таких как LINE, ARC, CIRCLE, ELLIPSE, SPLINE, POLYLINE, TEXT, MTEXT, ATTRIBUTE DEFINITION, ATTRIBUTE, SHAPE, SOLID, TRACE, TOLERANCE, REGION, VIEWPORT, 3D FACE, BLOCK INSERT, XREF, LWPOLYLINE, RASTER и т.д. Когда вы редактируете исходную геометрию, объект заливки будет автоматически учитывать эти изменения.
 При использовании пользовательских геометрических объектов, вы должны определить метод разрыва для него, чтобы заливка работала. Ваш метод разрыва должен разбить ваш геометрический объект на более простые объекты. Этот может потребовать, чтобы Hatch рекурсивно вызывал метод разрыва геометрических объектов, возвращаемых этим же методом до тех пор, пока не произойдет разбивка на встроенные геометрические объекты nanoCAD.
 При определении контура заливки с использованием геометрических объектов в существующей базе данных, приложение должно гарантировать, что выбранные объекты имеют корректный контур заливки и являются компланарными с плоскостью заливки. Выбранные объекты должны также формировать однозначные определения петель. Вам также необходимо установить признак ассоциативности до установки контура заливки. Если контур заливки не удовлетворяет указанным требованиям, результат может быть непредсказуемым при создании заливки и ее заполнении.
 Mультилинии и сложные геометрические объекты, которые могут порождать более чем одну петлю, отклоняются в качестве границ заливки. Если вы используете API Hatch и выбираете объект MLine для заливки, заливка не будет отображена. Для того чтобы работать с таким объектом, вы должны разорвать мультилинию, получить результирующие ребра и строить границы уже по ним. Если метод Mline.Explode() создает множество ребер, которые не создают простой замкнутой линии, вы можете создать регион, используя ребра для создания объекта Region. Вы можете затем разбить регион для получения простых замкнутых линий и передать их в объект Hatch.
 В настоящее время nanoCAD поддерживает три типа Образцов заливки — пользовательская, стандартная и ранее созданная пользовательская. Для получения дополнительной информации, смотрите описание перечисления HatchPatternType.
 Следующие методы позволяют приложению установить или получить данные образцов, относящиеся к ее наполнению. Если вы используете Hatch.PatternScale (или любые из свойств образцов), значение масштаба изменяется, но на экране отображение заливки не меняется. Вам необходимо использовать Hatch.Pattern после изменения масштаба образца, угла наклона линий, имени и т.д. Один вызов метода достаточен для применения всех сделанных изменений наполнения.
 nanoCAD поддерживает три стиля заливки — "Нормальный", "Внешний", и "Игнорировать". Для получения дополнительной информации смотрите описание перечисления HatchStyle.
 После определения контура заливки и определения образца и стиля заливки, приложение должно выполнить создание линий заливки или ее сплошное заполнение для отображения. Класс Hatch обслуживает и вычисляет линии заливки и ее сплошное заполнение для поддержки методов WorldDraw() и ViewportDraw() для отображения объекта заливки. Тем не менее, вычисленные линии заливки и сплошное наполнение не сохраняются с чертежом или DXF файлом для экономии размера файла. nanoCAD перевычисляет линии заливки или ее сплошное наполнение, когда DWG или DXF файл открывается в nanoCAD.
 Если определение петель контура заливки или ее ребра удаляются или меняются, приложение должно перерасчитать линии заливки или ее сплошное заполнение для обновления отображения.
 Определение петель контура заливки и ее ребра не отображаются. Это не создает проблем, поскольку объект заливки всегда сопоставлен с существующей геометрией базы данных nanoCAD.
 Методы
 Конструкторы
 Teigha.GraphicsInterface.Drawable
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 Drawable
 Конструктор класса Teigha.GraphicsInterface.Drawable. (Унаследован от Drawable)
 Teigha.DatabaseServices.DBObject
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 DBObject
 Конструктор. (Унаследован от DBObject)
 Teigha.DatabaseServices.Hatch
 Имя
 Описание
 Hatch
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.GraphicsInterface.Drawable
 Имя
 Описание
 Drawable Методы
 Ниже перечислены методы класса Drawable.
 Drawable Свойства
 Ниже перечислены свойства класса Drawable.
 Teigha.DatabaseServices.DBObject
 Имя
 Описание
 DBObject Методы
 Ниже перечислены методы класса DBObject.
 DBObject Свойства
 Ниже перечислены свойства класса DBObject.
 DBObject События
 Ниже перечислены события класса DBObject.
 Teigha.DatabaseServices.Entity
 Имя
 Описание
 Entity Методы
 Ниже перечислены методы класса Entity.
 Entity Свойства
 Ниже перечислены свойства класса Entity.
 Teigha.DatabaseServices.Hatch
 Имя
 Описание
 Hatch Методы
 Ниже перечислены методы класса Hatch.
 Hatch Свойства
 Ниже перечислены свойства класса Hatch.
 Ссылки
 Hatch Методы, Hatch Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства, DBObject События
 Ваши комментарии по поводу этого топика: Послать отзыв!