Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DxfFiler.WriteScale3d
 Послать отзыв
 Метод записывает в данный объект Filer указанный масштаб.
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract void WriteScale3d( DxfCode opCode, Scale3d value, int precision );
Копировать Код
Public MustOverride Sub WriteScale3d( opCode As DxfCode, value As Scale3d, precision As Integer )
 Параметры
 Параметры
 Описание
 opCode
 Групповой код DXF. Тип DxfCode.
 value
 Масштаб, который следует записать. Тип Scale3d.
 precision
 Количество цифр после запятой в интервале от 0 до 16. Тип int. Используется для действительных значений.
 Описание
 Метод записывает в данный объект Filer указанные групповой код DXF, масштаб и точность представления действительных значений.
 Ссылки
 Teigha.DatabaseServices.DxfFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!