Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.PolylineCurve3d
 Послать отзыв
 Класс PolylineCurve3d представляет кусочно-линейные сплайны в трехмерном пространстве.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Geometry::Entity3d Teigha::Geometry::Curve3d Teigha::Geometry::SplineEntity3d Teigha::Geometry::PolylineCurve3d
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdGePolyline3d")] public class PolylineCurve3d : SplineEntity3d
Копировать Код
<Wrapper("OdGePolyline3d")> Public Class PolylineCurve3d Inherits SplineEntity3d
 Описание
 Класс PolylineCurve3d представляет кусочно-линейные сплайны в трехмерном пространстве.
 Методы
 Конструкторы
 Teigha.Geometry.PolylineCurve3d
 Имя
 Описание
 PolylineCurve3d
 Это обзор перегрузок PolylineCurve3d.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Geometry.Entity3d
 Имя
 Описание
 Entity3d Методы
 Ниже перечислены методы класса Entity3d.
 Teigha.Geometry.Curve3d
 Имя
 Описание
 Curve3d Методы
 Ниже перечислены методы класса Curve3d.
 Curve3d Свойства
 Ниже перечислены свойства класса Curve3d.
 Teigha.Geometry.SplineEntity3d
 Имя
 Описание
 SplineEntity3d Методы
 Ниже перечислены методы класса SplineEntity3d.
 SplineEntity3d Свойства
 Ниже перечислены свойства класса SplineEntity3d.
 Teigha.Geometry.PolylineCurve3d
 Имя
 Описание
 PolylineCurve3d Методы
 Ниже перечислены методы класса PolylineCurve3d.
 PolylineCurve3d Свойства
 Ниже перечислены свойства класса PolylineCurve3d.
 Ссылки
 PolylineCurve3d Конструктор, PolylineCurve3d Методы, PolylineCurve3d Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!