Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GraphNode
 Послать отзыв
 Класс GraphNode реализует базовый объект узла ориентированного графа.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::DatabaseServices::GraphNode
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdDbGraph")] public class Graph : DisposableWrapper;
Копировать Код
<Wrapper("OdDbGraph")> Public Class Graph Inherits DisposableWrapper
 Описание
 Класс GraphNode реализует базовый объект узла ориентированного графа.
 Такой граф представляет собой множество узлов (вершин), двунаправленно связанных между собой ориентированными ребрами. Связанное с узлом ребро представлено ссылкой (указателем) на узел на противоположном конце ребра. Ссылки в узле (ребра графа) делятся на входящие и исходящие. Каждой входящей ссылке соответствует исходящая ссылка, и наоборот. Всякий узел GraphNode может иметь неограниченное количество связанных с ним ссылок (ребер), что позволяет реализовать граф произвольной структуры.
 Методы
 Конструкторы
 Teigha.DatabaseServices.GraphNode
 Имя
 Описание
 GraphNode
 Это обзор перегрузок GraphNode.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.DatabaseServices.GraphNode
 Имя
 Описание
 GraphNode Методы
 Ниже перечислены методы класса GraphNode.
 GraphNode Свойства
 Ниже перечислены свойства класса GraphNode.
 Ссылки
 GraphNode Конструктор, GraphNode Методы, GraphNode Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!