Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Событие Database.DeepCloneAborted
 Послать отзыв
 Синтаксис
C#
Visual Basic
public event EventHandler DeepCloneAborted;
Public Event DeepCloneAborted As EventHandler
 Описание
 Событие показывает, что операция глубокого клонирования снята.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!