Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBDictionary.SetAt
 Послать отзыв
 Метод создает в словаре новую запись, заданную аргументом newValue, если ключ searchKey в словаре отсутствует. Если запись с ключом searchKey уже существует, то новая запись заменяет старую.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.ObjectId SetAt( ref String searchKey, ref DBObject newValue );
Копировать Код
Public Function SetAt( ByRef searchKey As String, ByRef newValue As DBObject ) As DatabaseServices.ObjectId
 Параметры
 Параметры
 Описание
 searchKey
 Строка, представляющая имя ключа заменяемого объекта.
 newValue
 Новый объект типа DBObject для добавления в словарь.
 Возвращает
 Возвращается идентификатор objectId созданной записи.
 Описание
 Метод создает в словаре новую запись, заданную аргументом newValue, если ключ searchKey в словаре отсутствует. Если запись с ключом searchKey уже существует, то старая запись удаляется, словарь удаляется из ее списка реакторов, а на ее место в словарь добавляется объект newValue. Имя объекта задается ключом searchKey. Возвращается идентификатор objectId созданной записи.
 Ссылки
 Teigha.DatabaseServices.DBDictionary, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!