Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Scale3d.*
 Послать отзыв
 Оператор умножения структуры Scale3d. Реализует векторное умножение двух векторов масштабирования.
 Синтаксис
C#
Visual Basic
Копировать Код
public static Scale3d Scale3d *( Scale3d a, Scale3d b );
Копировать Код
Public Shared Operator *( a As Scale3d, b As Scale3d ) As Scale3d
 Параметры
 Параметры
 Описание
 a
 Левый операнд. Тип Scale3d.
 b
 Правый операнд. Тип Scale3d.
 Возвращает
 Возвращает результат умножения (a * b) двух операндов a и b. Тип Scale3d.
 Описание
 Оператор умножения структуры Scale3d. Реализует умножение (a * b) двух векторов масштабирования a и b.
 Ссылки
 Teigha.Geometry.Scale3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!