Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LoftedSurface.LoftedSurface
 Послать отзыв
 Конструктор по умолчанию класса LoftedSurface.
 Синтаксис
C#
Visual Basic
Копировать Код
public LoftedSurface();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса LoftedSurface.
 Ссылки
 Teigha.DatabaseServices.LoftedSurface, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!