Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector3dCollectionEnumerator
 Послать отзыв
 Класс Vector3dCollectionEnumerator представляет перечислитель для коллекции Vector3dCollection.
 Иерархия классов
Teigha::Geometry::Vector3dCollectionEnumerator
 Синтаксис
C#
Visual Basic
Копировать Код
public class Vector3dCollectionEnumerator : IEnumerator
Копировать Код
Public Class Vector3dCollectionEnumerator Implements IEnumerator
 Описание
 Класс Vector3dCollectionEnumerator представляет перечислитель для коллекции трехмерных векторов Vector3dCollection.
 Топики
 Имя
 Описание
 Vector3dCollectionEnumerator Методы
 Ниже перечислены методы класса Vector3dCollectionEnumerator.
 Vector3dCollectionEnumerator Свойства
 Ниже перечислены свойства класса Vector3dCollectionEnumerator.
 Ссылки
 Vector3dCollectionEnumerator Методы, Vector3dCollectionEnumerator Свойства, Топики, Vector3dCollectionEnumerator Методы, Vector3dCollectionEnumerator Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!