Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.SurfaceSurfaceIntersector.Surface2
 Послать отзыв
 Свойство Surface2 представляет объект второй поверхности, связанный с данным объектом.
 Синтаксис
C#
Visual Basic
Копировать Код
public Surface Surface2;
Копировать Код
Public ReadOnly Property Surface2 As Surface
 Возвращает
 Возвращает объект второй поверхности. Тип Surface.
 Описание
 Свойство Surface2 представляет объект второй поверхности, связанный с данным объектом.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.SurfaceSurfaceIntersector, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!