Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.RenderEnvironment.Distances
 Послать отзыв
 Свойство Distances представляет расстояния для ближнего и дальнего тумана.
 Синтаксис
C#
Visual Basic
Копировать Код
public DoubleRangeParameter Distances;
Копировать Код
Public Property Distances As DoubleRangeParameter
 Возвращает
 Возвращает дальности для тумана. Тип DoubleRangeParameter.
 Описание
 Свойство Distances представляет расстояния для ближнего и дальнего тумана.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.RenderEnvironment, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!