Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.XrefGraphNode.Name
 Послать отзыв
 Свойство Name представляет имя, связанное с данным узлом.
 Синтаксис
C#
Visual Basic
Копировать Код
public String Name;
Копировать Код
Public ReadOnly Property Name As String
 Возвращает
 Возвращает связанное с данным узлом имя. Тип String.
 Описание
 Свойство Name представляет имя, связанное с данным узлом.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.XrefGraphNode, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!