Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.GraphicsInterface.Drawable.SubViewportDrawLogicalFlags
 Послать отзыв
 Метод предоставляет комбинацию атрибутных флагов, используемых для регенерации логического набора элементов отображаемой геометрии объекта, которая зависит от видовых представлений.
 Синтаксис
C#
Visual Basic
Копировать Код
public int SubViewportDrawLogicalFlags( ref GraphicsInterface.ViewportDraw vd );
Копировать Код
Public Function SubViewportDrawLogicalFlags( ByRef vd As GraphicsInterface.ViewportDraw ) As Integer
 Параметры
 Параметры
 Описание
 vd
 Входной интерфейс ViewportDraw. Тип GraphicsInterface.ViewportDraw.
 Возвращает
 Возвращает логическую комбинацию атрибутных флагов из перечисления Teigha.GraphicsInterface.AttributesFlags. Тип int.
 Описание
 Метод возвращает комбинацию атрибутных флагов GraphicsInterface.AttributesFlags, используемых для регенерации логического набора элементов отображаемой геометрии объекта, которая зависит от видовых представлений. Этот метод может быть переопределен в производных классах (которые наследуют Drawable), в реализации по умолчанию возвращает 1, что соответствует значению DrawableIsAnEnitity перечисления Teigha.GraphicsInterface.AttributesFlags. Переданный в метод контекст ViewportDraw может использоваться отображаемым объектом, чтобы определить, какой именно логический набор регенерируется.
 Ссылки
 Teigha.DatabaseServices.DBObject, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!