Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 BlockTableRecord.Explodable
 Послать отзыв
 Свойство указывает на возможность разбивать вставки этого блока на отдельные примитивы.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool Explodable { get; set; }
Копировать Код
Public ReadOnly Property Explodable As Boolean
 Возвращает
 Возвращает тип данных bool:
true - вставки этого определения блока можно разбить на отдельные примитивы;
false - вставки этого определения блока нельзя разбить на отдельные примитивы.
 Описание
 Свойство указывает, можно ли разбить вставки этого определения блока на отдельные примитивы.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.BlockTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!