Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbCurve2d.DeleteControlPointAt
 Послать отзыв
 Метод удаляет управляющую вершину с указанным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public void DeleteControlPointAt( int index );
Копировать Код
Public Sub DeleteControlPointAt( index As Integer )
 Параметры
 Параметры
 Описание
 index
 Индекс удаляемой управляющей вершины. Тип int.
 Описание
 Метод удаляет управляющую вершину с указанным индексом.
 Ссылки
 Teigha.Geometry.NurbCurve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!