Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocArray.ReplaceItems
 Послать отзыв
 Метод заменяет указанные по индексу элементы ассоциативного массива новыми объектами из входной коллекции с заданной базовой точкой.
 Синтаксис
C#
Visual Basic
Копировать Код
public void ReplaceItems( ref ItemLocator[] indices, ObjectIdCollection substEntities, VertexRef basePoint );
Копировать Код
Public Sub ReplaceItems( ByRef indices As ItemLocator(), substEntities As ObjectIdCollection, basePoint As VertexRef )
 Параметры
 Параметры
 Описание
 indices
 Локаторы заменяемых элементов ассоциативного массива. Тип ItemLocator[].
 substEntities
 Коллекция ObjectId новых объектов. Тип ObjectIdCollection.
 basePoint
 Базовая точка новых объектов. Тип VertexRef.
 Описание
 Метод позволяет заменить элементы ассоциативного массива с индексами из заданного массива indices на указанные объекты substEntities с заданный базовой точкой basePoint. Каждый объект, представленный ObjectId из колллекции substEntities, становится новым элементом массива и помещается в место, определяемое соответствующим локатором ItemLocator. Базовая точка basePoint связана с объектами substEntities и совместно с ними претерпевает геометрические преобразования.
 Ссылки
 Teigha.DatabaseServices.AssocArray, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!