Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CurveCurveIntersector2d.ChangeCurveOrder
 Послать отзыв
 Метод предназначен для изменения порядка кривых в данном объекте, делая первую кривую второй и наоборот.
 Синтаксис
C#
Visual Basic
Копировать Код
public void ChangeCurveOrder();
Копировать Код
Public Sub ChangeCurveOrder()
 Описание
 Метод предназначен для изменения порядка кривых в данном объекте, делая первую кривую второй и наоборот.
 Ссылки
 Teigha.Geometry.CurveCurveIntersector2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!