Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MeshPointMaps.MeshPointMaps
 Послать отзыв
 Конструктор структуры MeshPointMaps.
 Синтаксис
C#
Visual Basic
Копировать Код
public MeshPointMaps( ref Point2dCollection sourcePts, ref Point2dCollection destPts );
Копировать Код
Public Sub New( ByRef sourcePts As Point2dCollection, ByRef destPts As Point2dCollection )
 Параметры
 Параметры
 Описание
 sourcePts
 Исходные точки. Тип Point2dCollection.
 destPts
 Точки назначения. Тип Point2dCollection.
 Описание
 Конструктор структуры MeshPointMaps.
 Ссылки
 Teigha.DatabaseServices.MeshPointMaps, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!