Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CellRange.!=
 Послать отзыв
 Оператор неравенства для класса CellRange. Проверяет два диапазона ячеек на неравенство.
 Синтаксис
C#
Visual Basic
Копировать Код
public static bool operator !=( ref CellRange t1, ref CellRange t2 );
Копировать Код
Public Shared Operator <>( ByRef t1 As CellRange, ByRef t2 As CellRange ) As Boolean
 Параметры
 Параметры
 Описание
 t1
 Левый операнд. Тип CellRange. Может быть нулевым.
 t2
 Правый операнд. Тип CellRange. Может быть нулевым.
 Возвращает
 Возвращает true, только если операнды t1 и t2 не равны (любой из них может быть нулевым) ,т.е. не выполняется хотя бы одно из перечисленных ниже условий:
Совпадают верхние строки.
Совпадают нижние строки.
Совпадают левые столбцы.
Совпадают правые столбцы.
 В противном случае возвращает false.
 Описание
 Оператор неравенства для класса CellRange. Проверяет два диапазона ячеек на неравенство.
 Ссылки
 Teigha.DatabaseServices.CellRange, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!