Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Viewport.StandardScale
 Послать отзыв
 Свойство StandardScale представляет масштаб в данном видовом экране, используя стандартные значения масштабов из перечисления Teigha.DatabaseServices.StandardScaleType.
 Синтаксис
C#
Visual Basic
Копировать Код
public StandardScaleType StandardScale;
Копировать Код
Public Property StandardScale As StandardScaleType
 Возвращает
 Возвращает текущий масштаб в видовом экране как значение из перечисления Teigha.DatabaseServices.StandardScaleType.
 Описание
 Свойство StandardScale представляет масштаб в данном видовом экране, используя стандартные значения масштабов из перечисления Teigha.DatabaseServices.StandardScaleType. Если текущий масштаб не соответствует ни одному из стандартных, свойство StandardScale возвращает значение StandardScaleType.CustomScale.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Viewport, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!