Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObject.SetField(String
 Послать отзыв
 Метод устанавливает указанное поле для указанного свойства.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectId SetField(String propertyName, Field field);
Копировать Код
Public Function SetField(propertyName As String, field As Field) As ObjectId
 Параметры
 Параметры
 Описание
 propertyName
 Имя свойства, для которого устанавливается поле. Тип String
 field
 Устанавливаемое поле. Тип Field
 Возвращает
 Возвращает идентификатор установленного поля. Тип ObjectId
 Описание
 Метод устанавливает указанное поле для указанного свойства. Поле может быть задано в объекте, с исползованием имени свойства как ключа. Чтобы метод был успешным, необходимо, чтобы объект был в базе данных. Если поле еще не заведено в базе данных, оно будет заведено. Если поле уже есть в базе данных, оно будет открыто на запись.
 Ссылки
 Teigha.DatabaseServices.DBObject, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!