Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotSettings.DrawViewportsFirst
 Послать отзыв
 Свойство DrawViewportsFirst определяет, должны ли видовые экраны печататься раньше других объектов в пространстве листа для этого объекта PlotSettings.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool DrawViewportsFirst;
Копировать Код
Public Property DrawViewportsFirst As Boolean
 Возвращает
 Возвращает true, если первыми должны выводиться плавающие видовые экраны. В противном случае возвращает false.
 Описание
 Свойство DrawViewportsFirst определяет, должны ли видовые экраны печататься раньше других объектов в пространстве листа для этого объекта PlotSettings.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.PlotSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!