Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Dimltype
 Послать отзыв
 Синтаксис
C#
Visual Basic
public DatabaseServices::ObjectId Dimltype;
Public Property Dimltype() As DatabaseServices.ObjectId
 Описание
 Устанавливает или возвращает тип линии размера.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!