Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DimAssoc.SetPointRef
 Послать отзыв
 Метод позволяет задать опорную точку заданного типа, используя предоставленный указатель на точку привязки OsnapPointRef.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetPointRef( DimAssocPointType pointIndex, ref OsnapPointRef pOsnapPointRef );
Копировать Код
Public Sub SetPointRef( pointIndex As DimAssocPointType, ByRef pOsnapPointRef As OsnapPointRef )
 Параметры
 Параметры
 Описание
 pointIndex
 Входной индекс типа опорной точки. Значение из перечисления DimAssocPointType.
 pOsnapPointRef
 Объект точки привязки. Тип OsnapPointRef.
 Описание
 Метод позволяет задать опорную точку заданного типа, используя предоставленный указатель на точку привязки OsnapPointRef.
 Ссылки
 Teigha.DatabaseServices.DimAssoc, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!