Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FeatureControlFrame.Dimscale
 Послать отзыв
 Свойство Dimscale представляет текущее значение системной переменной DIMSCALE. Эта системная переменная определяет масштабный множитель, применяемый ко всем размерным переменным, которые регулируют размеры, смещения и расстояния.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Dimscale;
Копировать Код
Public Property Dimscale As Double
 Возвращает
 Возвращает текущее значение системной переменной DIMSCALE. Тип double.
 Описание
 Свойство Dimscale представляет текущее значение системной переменной DIMSCALE. Эта системная переменная определяет масштабный множитель, применяемый ко всем размерным переменным, которые регулируют размеры, смещения и расстояния.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.FeatureControlFrame, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!