Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObjectCollection.Clear
 Послать отзыв
 Метод удаляет из коллекции все элементы.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Clear();
Копировать Код
Public Function Clear()
 Описание
 Метод удаляет из коллекции все элементы.
 Ссылки
 Teigha.DatabaseServices.DBObjectCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!