Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GraphNodeCollection.Remove
 Послать отзыв
 Метод удаляет из коллекции элемент, соответствующий входному объекту GraphNode.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Remove( ref GraphNode value );
Копировать Код
Public Sub Remove( ByRef value As GraphNode )
 Параметры
 Параметры
 Описание
 value
 Удаляемый из коллекции элемент. Тип GraphNode.
 Описание
 Метод удаляет из коллекции элемент, соответствующий входному объекту GraphNode.
 Ссылки
 Teigha.DatabaseServices.GraphNodeCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!