Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector3d.ProjectTo
 Послать отзыв
 Метод строит трехмерный вектор, который является результатом параллельной проекции данного вектора на указанную плоскость в заданном направлении.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d ProjectTo( Vector3d planeNormal, Vector3d projectDirection );
Копировать Код
Public Function ProjectTo( planeNormal As Vector3d, projectDirection As Vector3d ) As Vector3d
 Параметры
 Параметры
 Описание
 planeNormal
 Входной вектор нормали плоскости. Тип Vector3d.
 projectDirection
 Входное направление проецирования. Тип Vector3d.
 Возвращает
 Возвращает результат параллельного проецирования на указанную плоскость. Тип Vector3d.
 Описание
 Метод строит трехмерный вектор, который является результатом параллельной проекции данного вектора на плоскость с нормалью planeNormal, проходящей через начало координат. Направление проекцирования определяется входным вектором projectDirection.
 Ссылки
 Teigha.Geometry.Vector3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!