Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GripOverrule.GetGripPoints
 Послать отзыв
 Метод предоставляет данные о всех ручках объекта чертежа.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void GetGripPoints( ref Entity entity, ref GripDataCollection grips, double curViewUnitSize, int gripSize, Vector3d curViewDir, GetGripPointsFlags bitFlags );
Копировать Код
Public virtual Sub GetGripPoints( ByRef entity As Entity, ByRef grips As GripDataCollection, curViewUnitSize As double, gripSize As Integer, curViewDir As Vector3d, bitFlags As GetGripPointsFlags )
 Параметры
 Параметры
 Описание
 entity
 Объект, тип Entity,
 grips
 Коллекция ручек, тип GripDataCollection. Может содержать элементы до выполнения метода. Новые элементы вставляются в конец коллекции.
 curViewUnitSize
 Размер в пикселах единицы измерения чертежа в текущем видовом экране, тип double,
 gripSize
 Текущий размер ручек в пикселах, тип int,
 curViewDir
 Текущая ориентация видового экрана, вектор Vector3d,
 bitFlags
 Флаги из перечисления GetGripPointsFlags.
 Описание
 Метод предоставляет данные о всех ручках объекта чертежа.
 Ссылки
 Teigha.DatabaseServices.GripOverrule, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!