Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Hatch.IsHatch
 Послать отзыв
 Синтаксис
C#
Visual Basic
public bool IsHatch;
Public Property IsHatch() As bool
 Описание
 Возвращает признак того, что объект заливки является образцом, а не сплошной или градиентно заполненной заливкой.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.Hatch, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!