Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Cell.GetDataLinkRange
 Послать отзыв
 Метод позволяет получить диапазон ячеек со ссылками на внешние данные.
 Синтаксис
C#
Visual Basic
Копировать Код
public CellRange GetDataLinkRange();
Копировать Код
Public Function GetDataLinkRange() As CellRange
 Возвращает
 Возвращает диапазон ячеек. Тип CellRange.
 Описание
 Метод позволяет получить диапазон ячеек со ссылками на внешние данные.
 Ссылки
 Teigha.DatabaseServices.Cell, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!