Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Matrix2d.ElementAt
 Послать отзыв
 Свойство ElementAt представляет элементы матрицы по их индексам.
 Синтаксис
C#
Visual Basic
Копировать Код
public double this[int i, int j];
Копировать Код
Default Public ReadOnly Property ElementAt( i As Integer, j As Integer ) As Double
 Параметры
 Параметры
 Описание
 i
 Номер строки элемента. Тип int.
 j
 Номер столбца элемента. Тип int.
 Возвращает
 Возвращает элемент матрицы в строке i и столбце j. Тип double.
 Описание
 Свойство ElementAt представляет элементы матрицы по их индексам.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.Matrix2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!