Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Runtime.Interop.CheckAds
 Послать отзыв
 Метод проверяет переданный аргумент на равенство значению HostMgd.EditorInput.PromptStatus.OK.
 Синтаксис
C#
Visual Basic
Копировать Код
public static void CheckAds( int returnValue );
Копировать Код
Public Shared Sub CheckAds( returnValue As Integer )
 Параметры
 Параметры
 Описание
 returnValue
 Входное значение. Тип int.
 Описание
 Метод проверяет переданное значение параметра returnValue на равенство значению HostMgd.EditorInput.PromptStatus.OK (5100). Если равенства нет, то метод выбрасывает исключение Teigha.Runtime.ErrorStatus.InvalidInput.
 Ссылки
 Teigha.Runtime.Interop, Teigha.Runtime
 Ваши комментарии по поводу этого топика: Послать отзыв!