Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Sphere.SetAnglesInV
 Послать отзыв
 Метод переопределяет параметрический диапазон данной сферической поверхности по широте (параметр V).
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetAnglesInV( double startAngle, double endAngle );
Копировать Код
Public Sub SetAnglesInV( startAngle As Double, endAngle As Double )
 Параметры
 Параметры
 Описание
 startAngle
 Новое значение начальной широты, которая определяется параметром V. Тип double. В случае полной (замкнутой) сферы этот угол должен быть равен -PI.
 endAngle
 Новое значение конечной широты, которая определяется параметром V. Тип double. В случае полной (замкнутой) сферы этот угол должен быть равен +PI.
 Описание
 Метод переопределяет параметрический диапазон данной сферической поверхности по широте (параметр V).
 Ссылки
 Teigha.Geometry.Sphere, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!