Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MTextFragment.BigFont
 Послать отзыв
 Свойство возвращает имя большого шрифта SHX.
 Синтаксис
C#
Visual Basic
Копировать Код
public String BigFont;
Копировать Код
Public ReadOnly Property BigFont As String
 Возвращает
 Возвращает имя большого шрифта. Тип String.
 Описание
 Свойство возвращает имя большого шрифта SHX.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.MTextFragment, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!