Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CoordinateSystem3d.IsEqualTo
 Послать отзыв
 Метод позволяет проверить, совпадает ли с данным объектом переданная в метод координатная система CoordinateSystem3d в пределах заданной точности.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsEqualTo( CoordinateSystem3d a, Tolerance tolerance );
Копировать Код
Public Function IsEqualTo( a As CoordinateSystem3d, tolerance As Tolerance ) As Boolean
 Параметры
 Параметры
 Описание
 a
 Проверяемая система координат. Тип CoordinateSystem3d.
 tolerance
 Заданная точность вычислений. Тип Tolerance.
 Возвращает
 Возвращает true, если переданная система координат a не является нулевой и имеет те же начальную точку и направляющие векторы осей X, Y и Z. В противном случае возвращает false.
 Описание
 Метод позволяет проверить, совпадает ли с данным объектом переданная в метод координатная система CoordinateSystem3d в пределах заданной точности.
 Ссылки
 Teigha.Geometry.CoordinateSystem3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!