Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Leader.VertexAt
 Послать отзыв
 Синтаксис
C#
Visual Basic
public Point3d VertexAt(int value);
Public Function VertexAt(value As Integer) As Point3d
 Параметры
 Параметры
 Описание
 value
 Значение индекса (начинающееся с 0) требуемой вершины
 Описание
 Возвращает Point3d, содержащую положение вершины с индексом (начинающимся с 0), указанным в параметре value массива вершин выноски.
 Ссылки
 Teigha.DatabaseServices.Leader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!