Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.RevolveOptionsCheckRevolveCurveOut.EndPointsOnAxis
 Послать отзыв
 Свойство EndPointsOnAxis позволяет определить, является ли вращаемый профиль незамкнутой кривой, концы которой лежат на оси вращения.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool EndPointsOnAxis;
Копировать Код
Public ReadOnly Property EndPointsOnAxis As Boolean
 Возвращает
 Возвращает true, если концы незамкнутого профиля лежат на оси вращения. В противном случае возвращает false.
 Описание
 Свойство EndPointsOnAxis позволяет определить, является ли вращаемый профиль незамкнутой кривой, концы которой лежат на оси вращения.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.RevolveOptionsCheckRevolveCurveOut, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!