Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Point2dCollection.Remove
 Послать отзыв
 Метод удаляет из коллекции первое вхождение указанного объекта Point2d.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Remove( Point2d value );
Копировать Код
Public Sub Remove( value As Point2d )
 Параметры
 Параметры
 Описание
 value
 Удаляемый из коллекции объект. Тип Point2d.
 Описание
 Метод удаляет из коллекции первое вхождение указанного объекта Point2d.
 Ссылки
 Teigha.Geometry.Point2dCollection, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!