Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 LayerTableRecord.IsFrozen
 Послать отзыв
 Свойство предназначено для управления заморозкой слоя.
 Синтаксис
C#
Visual Basic
public bool IsFrozen;
Public Property IsFrozen() As bool
 Возвращает
 Возвращает тип данных bool:
true – слой заморожен;
false – слой не заморожен.
 Описание
 С помощью свойства можно получить информацию о том, заморожен слой или нет в виде типа данных bool и изменить его значение. Объекты, расположенные на замороженных слоях, не отображаются на экране, не выводятся на печать и не участвуют в регенерации чертежа.
 Неиспользуемые слои следует замораживать, когда необходимо повысить скорость регенерации чертежа.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.LayerTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!