Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SweptSurface.ScaleAlongPath
 Послать отзыв
 Свойство ScaleAlongPath представляет масштабный коэффициент, использованный при получении данного объекта при вытягивании по траектории.
 Синтаксис
C#
Visual Basic
Копировать Код
public double ScaleAlongPath;
Копировать Код
Public Property ScaleAlongPath As Double
 Возвращает
 Возвращает масштабный коэффициент. Тип double.
 Описание
 Свойство ScaleAlongPath представляет масштабный коэффициент, использованный при получении данного объекта при вытягивании по траектории.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.SweptSurface, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!