Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Viewport.EffectivePlotStyleSheet
 Послать отзыв
 Свойство EffectivePlotStyleSheet представляет имя таблицы стилей печати, связанной с данным видовым экраном.
 Синтаксис
C#
Visual Basic
Копировать Код
public String EffectivePlotStyleSheet;
Копировать Код
Public ReadOnly Property EffectivePlotStyleSheet As String
 Возвращает
 Возвращает имя таблицы стилей печати. Тип String.
 Описание
 Свойство EffectivePlotStyleSheet представляет имя таблицы стилей печати, связанной с данным видовым экраном.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Viewport, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!