Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlaneSurface
 Послать отзыв
 Данный класс реализует объект трехмерной плоской поверхности.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::GraphicsInterface::Drawable Teigha::DatabaseServices::DBObject Teigha::DatabaseServices::Entity Teigha::DatabaseServices::Surface Teigha::DatabaseServices::PlaneSurface
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("AcDbPlaneSurface")] public class PlaneSurface : Surface
Копировать Код
<Wrapper("AcDbPlaneSurface")> Public Class PlaneSurface Inherits Surface
 Описание
 Данный класс реализует объект трехмерной плоской поверхности.
 Методы
 Конструкторы
 Teigha.GraphicsInterface.Drawable
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 Drawable
 Конструктор класса Teigha.GraphicsInterface.Drawable. (Унаследован от Drawable)
 Teigha.DatabaseServices.DBObject
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 DBObject
 Конструктор. (Унаследован от DBObject)
 Teigha.DatabaseServices.Surface
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 Surface
 Конструктор по умолчанию класса Surface. (Унаследован от Surface)
 Teigha.DatabaseServices.PlaneSurface
 Имя
 Описание
 PlaneSurface
 Это обзор перегрузок PlaneSurface.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.GraphicsInterface.Drawable
 Имя
 Описание
 Drawable Методы
 Ниже перечислены методы класса Drawable.
 Drawable Свойства
 Ниже перечислены свойства класса Drawable.
 Teigha.DatabaseServices.DBObject
 Имя
 Описание
 DBObject Методы
 Ниже перечислены методы класса DBObject.
 DBObject Свойства
 Ниже перечислены свойства класса DBObject.
 DBObject События
 Ниже перечислены события класса DBObject.
 Teigha.DatabaseServices.Entity
 Имя
 Описание
 Entity Методы
 Ниже перечислены методы класса Entity.
 Entity Свойства
 Ниже перечислены свойства класса Entity.
 Teigha.DatabaseServices.Surface
 Имя
 Описание
 Surface Методы
 Ниже перечислены методы класса Surface.
 Surface Свойства
 Ниже перечислены свойства класса Surface.
 Teigha.DatabaseServices.PlaneSurface
 Имя
 Описание
 PlaneSurface Методы
 Ниже перечислены методы класса PlaneSurface.
 Ссылки
 PlaneSurface Конструктор, PlaneSurface Методы, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства, DBObject События
 Ваши комментарии по поводу этого топика: Послать отзыв!