Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObject.IsReallyClosing
 Послать отзыв
 Свойство предоставляет информацию о статусе закрытия объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsReallyClosing;
Копировать Код
Public Property IsReallyClosing() As bool
 Возвращает
 Возвращает тип данных bool. Возвращает true, если вызванный в данный момент метод Close() действительно полностью закрыл объект. Например, если объект не находится в транзакции, и был открыт на чтение только одним пользователем, будет возвращено true.
 Описание
 Свойство предоставляет информацию о статусе закрытия объекта.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.DBObject, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!