Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Database.Audit
 Послать отзыв
 This is Audit, a member of class Database.
 Синтаксис
C#
Visual Basic
public void Audit(ref AuditInfo info);
Public Sub Audit(ByRef info As AuditInfo)
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!