Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Circle.Circumference
 Послать отзыв
 Синтаксис
C#
Visual Basic
public double Circumference;
Public Property Circumference() As Double
 Описание
 Возвращает или устанавливает значение длины окружности.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Circle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!