Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.SetGridLineStyle
 Послать отзыв
 Метод позволяет задать стиль линий сетки для ячеек, строк и столбцов.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetGridLineStyle( int row, int column, GridLineType gridLineType, GridLineStyle lineStyle );
Копировать Код
Public virtual Sub SetGridLineStyle( row As Integer, column As Integer, gridLineType As GridLineType, lineStyle As GridLineStyle )
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс может равняться -1.
 lineStyle
 Новый стиль линий сетки из перечисления GridLineStyle.
 col
 Индекс столбца, тип int. Индекс может равняться -1.
 gridlineType
 Тип линии сетки из перечисления GridLineType.
 Описание
 Метод позволяет задать стиль линий сетки для ячеек, строк и столбцов.
 Чтобы задать одинаковый стиль сразу для нескольких типов линий сетки, типы линий можно объединять с помощью оператора OR.
 Чтобы задать ячейку, следует указать допустимые индексы строки и столбца. Чтобы задать строку, следует указать допустимый индекс строки и -1 в качестве индекса столбца. Чтобы задать столбец, следует указать допустимый индекс столбца и -1 в качестве индекса строки.
 Замечания
 Для получения того же результата предпочтительнее использовать Table.Cells[row,column].{Top,Bottom,Left,Right}Edge.LineStyle.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!