Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PdfDefinition
 Послать отзыв
 Класс представляет функциональность определения подложки PDF.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::GraphicsInterface::Drawable Teigha::DatabaseServices::DBObject Teigha::DatabaseServices::UnderlayDefinition Teigha::DatabaseServices::PdfDefinition
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("AcDbPdfDefinition")] public class PdfDefinition : UnderlayDefinition
Копировать Код
<Wrapper("AcDbPdfDefinition")> Public Class PdfDefinition Inherits UnderlayDefinition
 Описание
 Класс представляет функциональность определения подложки PDF.
 Методы
 Конструкторы
 Teigha.GraphicsInterface.Drawable
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 Drawable
 Конструктор класса Teigha.GraphicsInterface.Drawable. (Унаследован от Drawable)
 Teigha.DatabaseServices.DBObject
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 DBObject
 Конструктор. (Унаследован от DBObject)
 Teigha.DatabaseServices.PdfDefinition
 Имя
 Описание
 PdfDefinition
 Это обзор перегрузок PdfDefinition.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.GraphicsInterface.Drawable
 Имя
 Описание
 Drawable Методы
 Ниже перечислены методы класса Drawable.
 Drawable Свойства
 Ниже перечислены свойства класса Drawable.
 Teigha.DatabaseServices.DBObject
 Имя
 Описание
 DBObject Методы
 Ниже перечислены методы класса DBObject.
 DBObject Свойства
 Ниже перечислены свойства класса DBObject.
 DBObject События
 Ниже перечислены события класса DBObject.
 Teigha.DatabaseServices.UnderlayDefinition
 Имя
 Описание
 UnderlayDefinition Методы
 Ниже перечислены методы класса UnderlayDefinition.
 UnderlayDefinition Свойства
 Ниже перечислены свойства класса UnderlayDefinition.
 Ссылки
 PdfDefinition Конструктор, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства, DBObject События
 Ваши комментарии по поводу этого топика: Послать отзыв!