Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.HyperLinkCollection.GetEnumerator
 Послать отзыв
 Метод позволяет получить перечислитель для данной коллекции.
 Синтаксис
C#
Visual Basic
Копировать Код
public System.Collections.IEnumerator GetEnumerator();
Копировать Код
Public Function GetEnumerator() As System.Collections.IEnumerator
 Возвращает
 Возвращает перечислитель коллекции. Тип IEnumerator.
 Описание
 Метод позволяет получить перечислитель для данной коллекции.
 Ссылки
 Teigha.DatabaseServices.HyperLinkCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!