Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GeometryOverrule.SetExtensionDictionaryEntryFilter
 Послать отзыв
 Метод делает возможным поиск в словаре расширений, чтобы установить необходимость применения объектных переопределений.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetExtensionDictionaryEntryFilter( ref String entryName );
Копировать Код
Public Sub SetExtensionDictionaryEntryFilter( ByRef entryName As String )
 Параметры
 Параметры
 Описание
 entryName
 Имя входного объекта, тип String.
 Описание
 Делает возможным поиск в словаре расширений, чтобы установить необходимость применения объектных переопределений.
 Используйте этот метод, если требуется, чтобы nanoCAD искал в словаре расширений запись с именем entryName для объекта с переопределениями перед вызовом любого из ваших переопределений. Переопределения не будут вызываться, если entryName отсутствует в словаре расширений.
 Ссылки
 Teigha.DatabaseServices.GeometryOverrule, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!