Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CellType
 Послать отзыв
 Перечисление CellType представляет типы данных, которые могут использоваться объектом DataCell.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum CellType { Unknown = 0, Integer = 1, Double = 2, CharPtr = 3, Point = 4, ObjectId = 5, HardOwnerId = 6, SoftOwnerId = 7, HardPtrId = 8, SoftPtrId = 9, Bool = 10, Vector = 11 }
Копировать Код
Public Enum CellType Unknown = 0 Integer = 1 Double = 2 CharPtr = 3 Point = 4 ObjectId = 5 HardOwnerId = 6 SoftOwnerId = 7 HardPtrId = 8 SoftPtrId = 9 Bool = 10 Vector = 11 End Enum
 Члены
 Члены
 Описание
 Unknown
 Значение = 0. Тип данных не задан.
 Integer
 Значение = 1. Целое число.
 Double
 Значение = 2. Число с плавающей точкой двойной точности.
 CharPtr
 Значение = 3. Строка, тип String.
 Point
 Значение = 4. Трехмерная точка Point3D.
 ObjectId
 Значение = 5. Идентификатор объекта, тип DatabaseServices.ObjectId.
 HardOwnerId
 Значение = 6. Идентификатор объекта с правом жесткого владения, тип DatabaseServices.ObjectId.
 SoftOwnerId
 Значение = 7. Идентификатор объекта с правом мягкого владения, тип DatabaseServices.ObjectId.
 HardPtrId
 Значение = 8. Идентификатор жесткого указателя, тип DatabaseServices.ObjectId.
 SoftPtrId
 Значение = 9. Идентификатор символьного (мягкого) указателя, тип DatabaseServices.ObjectId.
 Bool
 Значение = 10. Логический тип.
 Vector
 Значение = 11. Трехмерный вектор, тип Vector3d.
 Описание
 Перечисление CellType представляет типы данных, которые могут использоваться объектом DataCell.
 Ваши комментарии по поводу этого топика: Послать отзыв!