Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbSurface.NurbSurface
 Послать отзыв
 Конструктор по умолчанию класса NurbSurface. Создает пустой объект без каких-либо фактических данных.
 Синтаксис
C#
Visual Basic
Копировать Код
public NurbSurface();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса NurbSurface. Создает пустой объект без каких-либо фактических данных, который пригоден для использования только в качестве заглушки.
 Ссылки
 Teigha.Geometry.NurbSurface, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!