Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.PlanarEquationCoefficients.A
 Послать отзыв
 Свойство A представляет коэффициент a в общем уравнении плоскости.
 Синтаксис
C#
Visual Basic
Копировать Код
public double A;
Копировать Код
Public ReadOnly Property A As Double
 Возвращает
 Возвращает коэффициент a в общем уравнении плоскости. Тип double.
 Описание
 Свойство A представляет коэффициент a в общем уравнении плоскости.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.PlanarEquationCoefficients, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!