Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SectionSettings.GenerationOptions
 Послать отзыв
 Метод позволяет получить текущие опции генерации для указанного типа сечения.
 Синтаксис
C#
Visual Basic
Копировать Код
public SectionGeneration GenerationOptions( SectionType nSecType );
Копировать Код
Public Function GenerationOptions( nSecType As SectionType ) As SectionGeneration
 Параметры
 Параметры
 Описание
 nSecType
 Тип сечения. Перечисление SectionType.
 Возвращает
 Возвращает флаги настройки процесса генерации сечения. Перечисление SectionGeneration.
 Описание
 Метод позволяет получить текущие опции генерации для указанного типа сечения как комбинацию флагов из перечисления SectionGeneration.
 Ссылки
 Teigha.DatabaseServices.SectionSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!