Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ArcDimension.ArcPoint
 Послать отзыв
 Свойство предоставляет доступ к точке, через которую проходит размерная дуга.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d ArcPoint;
Копировать Код
Public Property ArcPoint() As Point3d
 Возвращает
 Возвращает точку, тип Point3d.
 Описание
 Свойство обеспечивает доступ к точке, определяющей положение размерной дуги. Точка задается в мировой системе коордмнат (WCS).
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.ArcDimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!