Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.UcsTable
 Послать отзыв
 Класс UcsTable реализует таблицу, которая служит контейнером для хранения в базе данных чертежа пользовательских систем координат (UCS).
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::GraphicsInterface::Drawable Teigha::DatabaseServices::DBObject Teigha::DatabaseServices::SymbolTable Teigha::DatabaseServices::UcsTable
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("AcDbUcsTable")] public class UcsTable : SymbolTable;
Копировать Код
<Wrapper("AcDbUcsTable")> Public Class UcsTable Inherits SymbolTable
 Описание
 Класс UcsTable реализует таблицу, которая служит контейнером для хранения в базе данных чертежа записей UCS. Каждая запись таблицы типизирована классом UcsTableRecord и представляет собой пользовательскую систему координат. Класс UcsTable наследует базовую функциональность предопределенных таблиц.
 Пример
 В качестве примера работы с таблицей пользовательских систем координат приведена команда UCASTABLEREADING. Она добавляет в таблицу новую пользовательскую систему координат UCS_1, затем перебирает все записи таблицы, выводя в командную строку названия и начальные точки всех записанных в ней пользовательских систем координат.
C#
 Копировать Код
[Teigha.Runtime.CommandMethod("UcsTableReading")] public void UcsTableReading() { // Получение ссылки на активный документ HostMgd.ApplicationServices.Document doc = HostMgd.ApplicationServices.Application.DocumentManager.MdiActiveDocument; // Получение ссылки на редактор документа HostMgd.EditorInput.Editor ed = doc.Editor; // Получение ссылки на базу данных документа Teigha.DatabaseServices.Database db = doc.Database; // Начало транзакции с базой данных документа using (Teigha.DatabaseServices.Transaction trans = db.TransactionManager.StartTransaction()) { // Открываем таблицу пользовательских систем координат для записи Teigha.DatabaseServices.UcsTable ucsTable = trans.GetObject(db.UcsTableId, Teigha.DatabaseServices.OpenMode.ForWrite) as Teigha.DatabaseServices.UcsTable; // Создаем новую запись для таблицы пользовательских координат Teigha.DatabaseServices.UcsTableRecord UcsRec = new Teigha.DatabaseServices.UcsTableRecord(); // Задаем имя новой записи UcsRec.Name = "UCS_1"; // Задаем начальную точку на чертеже UcsRec.Origin = new Teigha.Geometry.Point3d(100, 100, 100); if (ucsTable != null) { // Добавляем новую запись в таблицу ucsTable.Add(UcsRec); // Перебираем таблицу в цикле foreach (Teigha.DatabaseServices.ObjectId utr in ucsTable) { // Открываем каждую запись Teigha.DatabaseServices.UcsTableRecord obj = trans.GetObject(utr, Teigha.DatabaseServices.OpenMode.ForRead) as Teigha.DatabaseServices.UcsTableRecord; // Выводим в командную строку название каждой  // пользовательской системы координат и её начальную точку ed.WriteMessage($"nTable record name and origin: {obj.Name} , ucs origin ({obj.Origin.X},{obj.Origin.Y},{obj.Origin.Z}) "); } } // Завершаем транзакцию, сохранив в базе данных проделанные действия trans.Commit(); } }
 Результат работы команды в пустом dwg-файле:
 Методы
 Конструкторы
 Teigha.GraphicsInterface.Drawable
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 Drawable
 Конструктор класса Teigha.GraphicsInterface.Drawable. (Унаследован от Drawable)
 Teigha.DatabaseServices.DBObject
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 DBObject
 Конструктор. (Унаследован от DBObject)
 Teigha.DatabaseServices.SymbolTable
 ПоказатьPrivateУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 SymbolTable
 This is SymbolTable, a member of class SymbolTable. (Унаследован от SymbolTable)
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.GraphicsInterface.Drawable
 Имя
 Описание
 Drawable Методы
 Ниже перечислены методы класса Drawable.
 Drawable Свойства
 Ниже перечислены свойства класса Drawable.
 Teigha.DatabaseServices.DBObject
 Имя
 Описание
 DBObject Методы
 Ниже перечислены методы класса DBObject.
 DBObject Свойства
 Ниже перечислены свойства класса DBObject.
 DBObject События
 Ниже перечислены события класса DBObject.
 Teigha.DatabaseServices.SymbolTable
 Имя
 Описание
 SymbolTable Методы
 Ниже перечислены методы класса SymbolTable.
 SymbolTable Свойства
 Ниже перечислены свойства класса SymbolTable.
 Ссылки
 Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства, DBObject События
 Ваши комментарии по поводу этого топика: Послать отзыв!