Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbCurve2d.JoinWith
 Послать отзыв
 Метод дополняет данную кривую указанным сплайном и перевычисляет результирующую кривую.
 Синтаксис
C#
Visual Basic
Копировать Код
public void JoinWith( ref NurbCurve2d curve );
Копировать Код
Public Sub JoinWith( ByRef curve As NurbCurve2d )
 Параметры
 Параметры
 Описание
 curve
 Сплайн, который требуется присоединить к данной кривой. Тип NurbCurve2d.
 Описание
 Метод дополняет данную кривую указанным сплайном curve с последующим перевычислением результирующей кривой. Ни один из сплайнов не может быть замкнутым. Начальная точка сплайна curve должна совпадать с конечной точкой данного сплайна.
 Ссылки
 Teigha.Geometry.NurbCurve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!