Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Shape.ShapeNumber
 Послать отзыв
 Свойство ShapeNumber представляет номер данного объекта в файле SHX.
 Синтаксис
C#
Visual Basic
Копировать Код
public short ShapeNumber;
Копировать Код
Public Property ShapeNumber As Short
 Возвращает
 Возвращает код данного символа в файле SHX. Тип short.
 Описание
 Свойство ShapeNumber представляет номер данного объекта в файле SHX.
 Объект Shape, по сути, является одним из символов шрифта SHX. Данное свойство возвращает код этого символа.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Shape, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!