Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ObjectId.
 Послать отзыв
 Возвращает true, если value1 больше value2.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool operator >( ObjectId value1, ObjectId value2 );
Копировать Код
Public Operator >( value1 As ObjectId, value2 As ObjectId )
 Параметры
 Параметры
 Описание
 value1
 Левый операнд, тип ObjectId.
 value2
 Правый операнд, тип ObjectId.
 Возвращает
 Возвращает true, если value1 больше value2, иначе - false.
 Описание
 "/> "/>
 Возвращает true, если value1 больше value2.
 Ссылки
 Teigha.DatabaseServices.ObjectId, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!