Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.UnderlayHost.DgnHost
 Послать отзыв
 Свойство DgnHost представляет текущее хост-приложение для подложки DGN.
 Синтаксис
C#
Visual Basic
Копировать Код
public static UnderlayHost DgnHost;
Копировать Код
Public Shared ReadOnly Property DgnHost As UnderlayHost
 Возвращает
 Возвращает хост-приложение для подложки DGN. Тип UnderlayHost.
 Описание
 Свойство DgnHost представляет текущее хост-приложение для подложки DGN.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.UnderlayHost, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!