Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Leader.HasArrowHead
 Послать отзыв
 Синтаксис
C#
Visual Basic
public bool HasArrowHead;
Public Property HasArrowHead() As bool
 Описание
 Возвращает или устанавливает признак того, используется ли стрелка для данной выноски.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Leader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!