Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Scale2d.Inverse
 Послать отзыв
 Метод инвертирует данный вектор масштабирования.
 Синтаксис
C#
Visual Basic
Копировать Код
public Scale2d Inverse();
Копировать Код
Public Function Inverse() As Scale2d
 Возвращает
 Возвращает вектор масштабирования. Тип Scale2d.
 Описание
 Метод инвертирует данный вектор масштабирования.
 Ссылки
 Teigha.Geometry.Scale2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!