Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LayoutCopiedEventArgs.Name
 Послать отзыв
 Свойство представляет имя исходного листа.
 Синтаксис
C#
Visual Basic
Копировать Код
public String Name;
Копировать Код
Public ReadOnly Property Name As String
 Возвращает
 Возвращает имя листа. Тип String.
 Описание
 Свойство представляет имя исходного листа.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.LayoutCopiedEventArgs, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!