Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SectionSettings.SetSourceObjects
 Послать отзыв
 Метод позволяет задать коллекцию исходных объектов для случаев, когда выставлен флаг SectionGeneration.SourceSelectedObjects.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetSourceObjects( SectionType nSecType, ref ObjectIdCollection ids );
Копировать Код
Public Sub SetSourceObjects( nSecType As SectionType, ByRef ids As ObjectIdCollection )
 Параметры
 Параметры
 Описание
 nSecType
 Тип сечения. Перечисление SectionType.
 ids
 Коллекция идентификаторов исходных объектов. Тип ObjectIdCollection.
 Описание
 Метод позволяет задать коллекцию исходных объектов для случаев, когда выставлен флаг SectionGeneration.SourceSelectedObjects.
 Ссылки
 Teigha.DatabaseServices.SectionSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!