Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.GetCustomData
 Послать отзыв
 Метод предназначен для получения пользовательских данных, заданных в ячейке, строке или столбце в виде пар "ключ-значение".
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual Object GetCustomData( int row, int column, ref String key );
Копировать Код
Public virtual Function GetCustomData( row As Integer, column As Integer, ByRef key As String ) As Object
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс может равняться -1.
 key
 Ключ сохраненных пользовательских данных. Тип String.
 col
 Индекс столбца, тип int. Индекс может равняться -1.
 Возвращает
 Возвращает тип Object.
 Описание
 Метод предназначен для получения пользовательских данных, заданных в ячейке, строке или столбце в виде пар "ключ-значение".
 Чтобы указать ячейку, следует задать допустимые индексы строки и столбца. Чтобы указать строку, следует задать допустимый индекс строки и -1 в качестве индекса столбца. Чтобы указать столбец, следует задать допустимый индекс столбца и -1 в качестве индекса строки.
 Замечания
 Для получения того же результата предпочтительнее использовать метод Table.Cells[row,column].GetCustomData.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!