Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Vertex2d
 Послать отзыв
 Класс Vertex2d представляет в базе данных вершины двумерной полилинии.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::GraphicsInterface::Drawable Teigha::DatabaseServices::DBObject Teigha::DatabaseServices::Entity Teigha::DatabaseServices::Vertex Teigha::DatabaseServices::Vertex2d
 Синтаксис
C#
Visual Basic
Копировать Код
[TypeDescriptionProvider("Teigha.ComponentModel.TypeDescriptionProvider`1[[Teigha.DatabaseServices.Vertex2d, TD_Mgd]], TD_Mgd")] [Wrapper("AcDb2dVertex")] public class Vertex2d : Vertex
Копировать Код
<TypeDescriptionProvider("Teigha.ComponentModel.TypeDescriptionProvider`1[[Teigha.DatabaseServices.Vertex2d, TD_Mgd]], TD_Mgd")> <Wrapper("AcDb2dVertex")> Public Class Vertex2d Inherits Vertex
 Описание
 Класс Vertex2d представляет в базе данных вершины двумерной полилинии.
 Замечания
 Вершины Vertex2d являются подобъектами родительской полилинии, соответственно, они наследуют свойства родительского объекта (например, цвет, слой...). Хотя Vertex2d содержит методы Entity для задания подобных свойств объекта, но их использование для переопределения свойств на значения, отличные от родительских, порождает проблемные вершины. Поврежденные вершины может исправить аудит.
 Методы
 Конструкторы
 Teigha.GraphicsInterface.Drawable
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 Drawable
 Конструктор класса Teigha.GraphicsInterface.Drawable. (Унаследован от Drawable)
 Teigha.DatabaseServices.DBObject
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 DBObject
 Конструктор. (Унаследован от DBObject)
 Teigha.DatabaseServices.Vertex2d
 Имя
 Описание
 Vertex2d
 Это обзор перегрузок Vertex2d.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.GraphicsInterface.Drawable
 Имя
 Описание
 Drawable Методы
 Ниже перечислены методы класса Drawable.
 Drawable Свойства
 Ниже перечислены свойства класса Drawable.
 Teigha.DatabaseServices.DBObject
 Имя
 Описание
 DBObject Методы
 Ниже перечислены методы класса DBObject.
 DBObject Свойства
 Ниже перечислены свойства класса DBObject.
 DBObject События
 Ниже перечислены события класса DBObject.
 Teigha.DatabaseServices.Entity
 Имя
 Описание
 Entity Методы
 Ниже перечислены методы класса Entity.
 Entity Свойства
 Ниже перечислены свойства класса Entity.
 Teigha.DatabaseServices.Vertex2d
 Имя
 Описание
 Vertex2d Свойства
 Ниже перечислены свойства класса Vertex2d.
 Ссылки
 Vertex2d Конструктор, Vertex2d Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства, DBObject События
 Ваши комментарии по поводу этого топика: Послать отзыв!