Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Событие Database.XrefSubCommandEnd
 Послать отзыв
 This is XrefSubCommandEnd, a member of class Database.
 Синтаксис
C#
Visual Basic
public event XrefSubCommandEndEventHandler XrefSubCommandEnd;
Public Event XrefSubCommandEnd As XrefSubCommandEndEventHandler
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!