Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Событие Database.BeginDeepCloneTranslation
 Послать отзыв
 Синтаксис
C#
Visual Basic
public event IdMappingEventHandler BeginDeepCloneTranslation;
Public Event BeginDeepCloneTranslation As IdMappingEventHandler
 Описание
 Операция глубокого клонирования содержит две фазы. Сначала, каждый объект и все объекты, у которых есть владелец, клонируются. Далее, все Id объектов преобразуются в Id клонов.
 Событие возникает между этими двумя фазами.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!