Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Torus
 Послать отзыв
 Класс Torus представляет тороидальные сегменты.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Geometry::Entity3d Teigha::Geometry::Surface Teigha::Geometry::Torus
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdGeTorus")] public sealed class Torus : Surface
Копировать Код
<Wrapper("OdGeTorus")> Public NotInheritable Class Torus Inherits Surface
 Описание
 Класс Torus представляет тороидальные сегменты.
 Поверхность тора формируется вращением дуги образующей окружности вокруг оси симметрии (оси вращения), лежащей в плоскости этой окружности. Положение тора в пространстве определяется точкой его центра на оси симметрии тора. Центр образующей окружности находится на расстоянии majorRadius от центра тора, располагаясь при вращении на направляющей окружности радиуса majorRadius. Радиус образующей окружности равен minorRadius.
 Замечания
 Параметр U играет роль долготы, определяя меридианы, которые располагаются в плоскостях, проходящих через ось вращения тора. В случае замкнутого тора параметр U по умолчанию определен в диапазоне [-PI, PI). Начало отсчета U задается вектором refAxis, ортогональным оси симметрии тора. Положительное направление изменения параметра U определяется правилом правой руки при вращении вокруг оси симметрии тора.
 Параметр V параметризует круглую трубу тора, играя роль широты, и для замкнутой образующей окружности по умолчанию определен в диапазоне [-PI, PI). Положительное направление изменения параметра V определяется по правилу правой руки при вращении вокруг направления (axisOfSymmetry x refAxis).
 В пространстве параметров U,V тор является периодическим с периодом 2*PI. Параметрический прямоугольник [umin, umax] x [vmin, vmax] определяет четырехсторонний тороидальный участок, сторонами которого являются четыре круглых дуги. В определении такого тороидального участка приняты следующие ограничения:
umin < umax и |umin - umax| <= 2*PI.
vmin < vmax и |vmin - vmax| <= 2*PI.
 Методы
 Конструкторы
 Teigha.Geometry.Torus
 Имя
 Описание
 Torus
 Это обзор перегрузок Torus.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Geometry.Entity3d
 Имя
 Описание
 Entity3d Методы
 Ниже перечислены методы класса Entity3d.
 Teigha.Geometry.Surface
 Имя
 Описание
 Surface Методы
 Ниже перечислены методы класса Surface.
 Surface Свойства
 Ниже перечислены свойства класса Surface.
 Teigha.Geometry.Torus
 Имя
 Описание
 Torus Методы
 Ниже перечислены методы класса Torus.
 Torus Свойства
 Ниже перечислены свойства класса Torus.
 Ссылки
 Torus Конструктор, Torus Методы, Torus Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!