Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Pextmin
 Послать отзыв
 Синтаксис
C#
Visual Basic
public Point3d Pextmin;
Public Property Pextmin() As Point3d
 Описание
 Возвращает или устанавливает текущее значение EXTMIN для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!