Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 LayerTable.SkippingReconciled
 Послать отзыв
 В свойстве хранится коллекция несогласованных слоёв документа.
 Синтаксис
C#
Visual Basic
public LayerTable SkippingReconciled;
Public Property SkippingReconciled() As LayerTable
 Возвращает
 Возвращает пропущенные согласованные слои.
 Возвращает тип данных LayerTable.
 Описание
 С помощью свойства можно получить коллекцию несогласованных слоёв документа. Несогласованные слои – слои, которые были добавлены в документ после того, как коллекция слоёв была обновлена. У несогласованных слоёв свойство IsReconciled = false.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.LayerTable, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!