Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Graph
 Послать отзыв
 Класс Graph реализует базовый объект ориентированного графа и предоставляет базовый механизм для выявления циклов.
 Иерархия классов
Teigha::DatabaseServices::Graph
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdDbGraph")] public class Graph : DisposableWrapper;
Копировать Код
<Wrapper("OdDbGraph")> Public Class Graph Inherits DisposableWrapper
 Описание
 Класс Graph реализует базовый объект ориентированного графа.
 Граф представлен множеством узлов (вершин), связанных между собой ориентированными ребрами. Узлы графа реализуются классом GraphNode. Ребро, исходящее из узла, представляется указателем или ссылкой на узел на противоположном конце ребра. Ссылки делятся на входящие и исходящие. Каждой входящей ссылке соответствует исходящая ссылка, и наоборот. Каждый узел может иметь любое количество связанных с ним ссылок (ребер), что позволяет реализовать граф произвольной структуры. Класс Graph предоставляет метод Graph.FindCycles() в качестве базового механизма выявления циклов.
 Методы
 Конструкторы
 Имя
 Описание
 Graph
 Конструктор класса Graph. Создает новый объект Graph с указанным корневым узлом.
 Топики
 Имя
 Описание
 Graph Методы
 Ниже перечислены методы класса Graph.
 Graph Свойства
 Ниже перечислены свойства класса Graph.
 Ссылки
 Graph Методы, Graph Свойства, Методы, Топики, Graph Методы, Graph Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!