Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Measurement
 Послать отзыв
 Синтаксис
C#
Visual Basic
public DatabaseServices::MeasurementValue Measurement;
Public Property Measurement() As DatabaseServices.MeasurementValue
 Описание
 Возвращает или устанавливает текущее значение MEASUREMENT для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!