Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbCurve3d.SetFitTangents
 Послать отзыв
 Метод позволяет переопределить направления касательных на концах сплайна.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool SetFitTangents( Vector3d startTangent, Vector3d endTangent );
Копировать Код
Public Function SetFitTangents( startTangent As Vector3d, endTangent As Vector3d ) As Boolean
 Параметры
 Параметры
 Описание
 startTangent
 Направление касательной в начальной точке сплайна. Тип Vector3d.
 endTangent
 Направление касательной в конечной точке сплайна. Тип Vector3d.
 Возвращает
 Возвращает true, если перевычисление сплайна с новыми касательными завершилось успешно. В противном случае возвращает false.
 Описание
 Метод позволяет переопределить направления касательных на концах сплайна.
 Ссылки
 Teigha.Geometry.NurbCurve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!