Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MTextFragment
 Послать отзыв
 Этот класс описывает фрагмент текста, создаваемый методом MText.ExplodeFragments().
 Иерархия классов
Teigha::DatabaseServices::MTextFragment
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdDbMTextFragment")] public sealed class MTextFragment : DisposableWrapper
Копировать Код
<Wrapper("OdDbMTextFragment")> Public NotInheritable Class MTextFragment Inherits DisposableWrapper
 Описание
 Этот класс описывает фрагмент текста, создаваемый методом MText.ExplodeFragments(). Каждый такой фрагмент представляет собой часть текста с уникальным сочетанием информации о стиле (шрифт, размер, цвет и т.д.).
 Топики
 Имя
 Описание
 MTextFragment Методы
 Ниже перечислены методы класса MTextFragment.
 MTextFragment Свойства
 Ниже перечислены свойства класса MTextFragment.
 Ссылки
 MTextFragment Методы, MTextFragment Свойства, Топики, MTextFragment Методы, MTextFragment Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!