Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.SetTextString
 Послать отзыв
 Метод позволяет задать текстовое значение для элемента содержимого ячейки, который указывается по индексу.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetTextString( int row, int column, int contentIndex, ref String text );
Копировать Код
Public virtual Sub SetTextString( row As Integer, column As Integer, contentIndex As Integer, ByRef text As String )
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 contentIndex
 Индекс элемента содержимого ячейки, тип int. Индекс должен быть больше или равен нулю и меньше количества элементов содержимого в ячейке.
 text
 Нуль-терминированная текстовая строка, тип String.
 col
 Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
 Описание
 Метод позволяет задать текстовое значение для элемента содержимого ячейки, который указывается по индексу.
 Замечания
 Для получения того же результата предпочтительнее использовать Table.Cells[row,column].Contents[i].TextString.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!