Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.DgnFrame
 Послать отзыв
 Синтаксис
C#
Visual Basic
public int DgnFrame;
Public Property DgnFrame() As Integer
 Описание
 Зарезервировано для будущего использования.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!