Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObject.Erased
 Послать отзыв
 Cобытие возникает, когда объект был удалён методом Erase(), либо такое удаление было отменено.
 Синтаксис
C#
Visual Basic
Копировать Код
public event ObjectErasedEventHandler Erased;
Копировать Код
Public Event Erased As ObjectErasedEventHandler
 Возвращает
 Тип данных ObjectEventHandler, представляющий обработчик события.
 Описание
 Cобытие возникает, когда объект был удалён методом Erase(), либо удаление было отменено.
 Ссылки
 Teigha.DatabaseServices.DBObject, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!