Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Entity.SetDatabaseDefaults()
 Послать отзыв
 Метод устанавливает для геометрического объекта значения таких свойств, как цвет, слой, тип линии, масштаб линии, видимость, стиль печати и ширина линий, на основе значений по умолчанию из базы данных nanoCAD. Если объект ещё не добавлен в базу данных, для получения значений используется редактор текущей базы данных.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetDatabaseDefaults();
Копировать Код
Public Sub SetDatabaseDefaults()
 Описание
 Этот метод устанавливает для геометрического объекта:
Color (цвет);
Layer (слой);
Linetype (тип линий);
Linetype scale (масштаб типа линий);
Visibility (видимость);
Plot style name (имя стиля печати);
Line weight (ширина линий).
 по значениям по умолчанию базы данных, в которой объект находится или, если объект еще не является частью базы данных, то для получения значений используется редактор текущей базы данных nanoCAD.
 Ссылки
 Teigha.DatabaseServices.Entity, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!