Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.HighlightOverrule.Highlight
 Послать отзыв
 Метод реализует подсвечивание указанного пути к подобъекту в данном объекте чертежа.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void Highlight( ref Entity entity, FullSubentityPath subId, bool highlightAll );
Копировать Код
Public virtual Sub Highlight( ByRef entity As Entity, subId As FullSubentityPath, highlightAll As Boolean )
 Параметры
 Параметры
 Описание
 entity
 Объект, тип Entity,
 subId
 Полный путь к подсвечиваемому подобъекту, тип FullSubentityPath,
 highlightAll
 Если флаг имеет значение true, то подсвечивание выполняется во всех видовых экранах. Тип bool.
 Описание
 Метод реализует подсвечивание указанного пути к подобъекту в данном объекте чертежа.
 Ссылки
 Teigha.DatabaseServices.HighlightOverrule, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!