Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Database.ReadDwgFile (String^, FileOpenMode, bool, String^, bool)
 Послать отзыв
 This is ReadDwgFile, a member of class Database.
 Синтаксис
C#
Visual Basic
[Category("For Teigha only")] public void ReadDwgFile(ref String fileName, FileOpenMode mode, bool allowCPConversion, ref String password, bool bPartialLoad);
<Category("For Teigha only")> Public Sub ReadDwgFile(ByRef fileName As String, mode As FileOpenMode, allowCPConversion As bool, ByRef password As String, bPartialLoad As bool)
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!