Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ObjectId.ToString
 Послать отзыв
 Возвращает эквивалентное строковое представление данного объекта в формате, который учитывает языковые и региональные настройки, определенные указанным поставщиком IFormatProvider.
 Синтаксис
C#
Visual Basic
Копировать Код
public String ToString( ref IFormatProvider provider );
Копировать Код
Public Function ToString( ByRef provider As IFormatProvider ) As String
 Параметры
 Параметры
 Описание
 provider
 Поставщик IFormatProvider языковых и региональных настроек.
 Возвращает
 Возвращает тип String.
 Описание
 Возвращает эквивалентное строковое представление данного объекта в формате, который учитывает языковые и региональные настройки, определенные указанным поставщиком IFormatProvider. Подробнее см. в документации Microsoft .NET API.
 Ссылки
 Teigha.DatabaseServices.ObjectId, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!