Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.EndCaps
 Послать отзыв
 Синтаксис
C#
Visual Basic
public DatabaseServices::EndCap EndCaps;
Public Property EndCaps() As DatabaseServices.EndCap
 Описание
 Возвращает или устанавливает значение заголовка переменной endCaps базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!