Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocDependency.HasCachedValue
 Послать отзыв
 Свойство позволяет установить, хранит ли данная зависимость кэшированное значение для объекта, с которым она связана.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool HasCachedValue;
Копировать Код
Public Property HasCachedValue() As Boolean
 Возвращает
 Возвращает true, если зависимость хранит кэшированное значение для связанного объекта. В противном случае возвращает false.
 Описание
 Свойство позволяет установить, хранит ли данная зависимость кэшированное значение для связанного объекта. Кэшированное значение не обязательно является актуальным и не обязательно совпадает с текущим значением для связанного объекта. Если связанный объект изменился, хранимое зависимостью кэшированное значение, может по-прежнему отражать предыдущее состояние объекта. Но если статус зависимости равен IsUpToDateAssocStatus, кэшированное значение должно быть синхронизировано со связанным объектом.
 Реализация этого предиката по умолчанию делегирует принятие решения действию-владельцу, вызывая его метод AssocAction.HasDependencyCachedValue(). Делегирование можно отключить, если свойству IsDelegatingToOwningAction задать значение false. Реализация AssocAction.HasDependencyCachedValue() по умолчанию возвращает false.
 Если зависимость владеет объектом AssocDependencyBody, который переопределяет предикат HasCachedValueOverride(), вызов переопределения заменяет реализацию по умолчанию.
 Значение по умолчанию false.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.AssocDependency, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!