Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.Dimdli
 Послать отзыв
 Свойство задает или возвращает шаг размерных линий в размерах от общей базы.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Dimdli;
Копировать Код
Public Property Dimdli As Double
 Возвращает
 Возвращает шаг в базовых размерах. Тип double.
 Описание
 Свойство задает или возвращает шаг размерных линий в размерах от общей базы.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!