Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.NurbSurface.GetControlPointAt
 Послать отзыв
 Метод позволяет вычислить управляющую вершину для заданной позиции в массиве управляющих вершин.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d GetControlPointAt( int uIndex, int vIndex );
Копировать Код
Public Function GetControlPointAt( uIndex As Integer, vIndex As Integer ) As Point3d
 Параметры
 Параметры
 Описание
 uIndex
 Индекс управляющей вершины в направлении u. Тип int. Начальное значение индекса равно 0.
 vIndex
 Индекс управляющей вершины в направлении v. Тип int. Начальное значение индекса равно 0.
 Возвращает
 Возвращает положение управляющей вершины. Тип Point3d.
 Описание
 Метод позволяет вычислить управляющую вершину (в мировой системе координат WCS) для заданной позиции в массиве управляющих вершин.
 Если поверхность не содержит информации о управляющих вершин, метод выбрасывает исключение eFail. Метод выбрасывает исключение eOutOfRange, если входные аргументы uIndex или vIndex оказываются недействительными.
 Ссылки
 Teigha.DatabaseServices.NurbSurface, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!