Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DecomposeForSaveReplacementRecord
 Послать отзыв
 Структура DecomposeForSaveReplacementRecord инкапсулирует три выходных параметра, используемых методом Object.DecomposeForSave().
 Иерархия классов
Teigha::DatabaseServices::DecomposeForSaveReplacementRecord
 Синтаксис
C#
Visual Basic
Копировать Код
public struct DecomposeForSaveReplacementRecord
Копировать Код
Public Structure DecomposeForSaveReplacementRecord
 Описание
 Структура DecomposeForSaveReplacementRecord инкапсулирует три выходных параметра, используемых методом Object.DecomposeForSave(). Эти значения относятся:
к замещающему объекту, если он не является резидентом базы данных,
к идентификатору замещающего объекта, если он является резидентом базы данных, и
к флагу, который определяет, следует ли передавать расширенные данные XData замещающему объекту.
 Методы
 Конструкторы
 Имя
 Описание
 DecomposeForSaveReplacementRecord
 Это обзор перегрузок DecomposeForSaveReplacementRecord.
 Топики
 Имя
 Описание
 DecomposeForSaveReplacementRecord Свойства
 Ниже перечислены свойства класса DecomposeForSaveReplacementRecord.
 Ссылки
 DecomposeForSaveReplacementRecord Конструктор, DecomposeForSaveReplacementRecord Свойства, Методы, Топики, DecomposeForSaveReplacementRecord Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!