Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.GetDataLink
 Послать отзыв
 Метод предназначен для получения идентификатора ссылки на данные, если указанная ячейка связана с источником данных по ссылке.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual DatabaseServices.ObjectId GetDataLink( int row, int column );
Копировать Код
Public virtual Function GetDataLink( row As Integer, column As Integer ) As DatabaseServices.ObjectId
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 col
 Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
 Возвращает
 Возвращает идентификатор ссылки на данные. Тип DatabaseServices.ObjectId.
 Описание
 Метод предназначен для получения идентификатора ссылки на данные, если указанная ячейка связана с источником данных по ссылке. Вернет null, если ячейка не имеет ссылки на данные.
 Замечания
 Для получения того же результата предпочтительнее использовать Table.Cells[row,column].DataLink.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!