Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CompoundObjectId.IsValid
 Послать отзыв
 Метод предназначен для установления валидности идентификатора составного объекта при заданном уровне проверки.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsValid( int validityCheckingLevel );
Копировать Код
Public Function IsValid( validityCheckingLevel As Integer ) As Boolean
 Параметры
 Параметры
 Описание
 validityCheckingLevel
 Входной уровень проверки. Тип int.
 Возвращает
 Возвращает true, если объект при заданном уровне проверки считается валидным. В противном случае возвращает false.
 Описание
 Метод предназначен для установления валидности идентификатора составного объекта при заданном уровне проверки.
 Входной целочисленный аргумент validityCheckingLevel определяет уровень проверки объекта на валидность. Более высокие значения соответствуют более глубоким проверкам.
 Параметр validityCheckingLevel в настоящее время не используется.
 Ссылки
 Teigha.DatabaseServices.CompoundObjectId, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!