Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.TStackAlign
 Послать отзыв
 Синтаксис
C#
Visual Basic
public int TStackAlign;
Public Property TStackAlign() As Integer
 Описание
 Обеспечивает доступ к текущему значению TSTACKALIGN для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!