Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Событие Database.InsertEnded
 Послать отзыв
 Синтаксис
C#
Visual Basic
public event EventHandler InsertEnded;
Public Event InsertEnded As EventHandler
 Описание
 Событие показывает, что операция вставки в базе данных чертежа успешно завершена.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!