Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SweepOptionsCheckSweepCurveOut.ApproximateArcLength
 Послать отзыв
 Свойство ApproximateArcLength представляет аппроксимированную длину дуги.
 Синтаксис
C#
Visual Basic
Копировать Код
public double ApproximateArcLength;
Копировать Код
Public ReadOnly Property ApproximateArcLength As Double
 Возвращает
 Возвращает аппроксимированную длину дуги. Тип double.
 Описание
 Свойство ApproximateArcLength представляет аппроксимированную длину дуги.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.SweepOptionsCheckSweepCurveOut, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!