Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeader.GetContentGeomExtents
 Послать отзыв
 Метод позволяет получить ограничивающий бокс для данной мультивыноски.
 Синтаксис
C#
Visual Basic
Копировать Код
public Extents3d GetContentGeomExtents();
Копировать Код
Public Function GetContentGeomExtents() As Extents3d
 Возвращает
 Возвращает ограничивающий бокс. Тип Extents3d.
 Описание
 Метод позволяет получить ограничивающий бокс для данного объекта MLeader. Это прямоугольный параллелепипед минимального размера, ориентированный по осям системы координат, в который вписана вся геометрия мультивыноски (габаритный бокс).
 Ссылки
 Teigha.DatabaseServices.MLeader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!