Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Group.Prepend
 Послать отзыв
 Метод предназначен для добавления указанного объекта в начало списка членов данной группы.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Prepend( DatabaseServices.ObjectId id );
Копировать Код
Public Sub Prepend( id As DatabaseServices.ObjectId )
 Параметры
 Параметры
 Описание
 id
 Идентификатор вставляемого объекта. Тип DatabaseServices.ObjectId.
 Описание
 Метод предназначен для добавления указанного объекта в начало списка членов данной группы.
 Ссылки
 Teigha.DatabaseServices.Group, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!