Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Filters.SpatialIndex.SpatialIndex
 Послать отзыв
 Конструктор по умолчанию класса SpatialIndex.
 Синтаксис
C#
Visual Basic
Копировать Код
public SpatialIndex();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса SpatialIndex.
 Ссылки
 Teigha.DatabaseServices.Filters.SpatialIndex, Teigha.DatabaseServices.Filters
 Ваши комментарии по поводу этого топика: Послать отзыв!