Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.LineSegment2d.Set
 Послать отзыв
 Метод позволяет переопределить данный линейный сегмент таким образом, чтобы он оказался касательным к обеим указанным кривым.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Set( ref Curve2d curve1, ref Curve2d curve2, double parameter1, double parameter2 );
Копировать Код
Public Sub Set( ByRef curve1 As Curve2d, ByRef curve2 As Curve2d, parameter1 As Double, parameter2 As Double )
 Параметры
 Параметры
 Описание
 curve1
 Первая входная кривая, касательность к которой требуется обеспечить. Тип Curve2d.
 curve2
 Вторая входная кривая, касательность к которой требуется обеспечить. Тип Curve2d.
 parameter1
 Значение параметра точки на кривой curve1, в которой кривая касается линейного сегмента. Тип double.
 parameter2
 Значение параметра точки на кривой curve2, в которой кривая касается линейного сегмента. Тип double.
 Описание
 Метод позволяет переопределить данный линейный сегмент таким образом, чтобы он оказался касательным к обеим указанным кривым. Входные значения параметров parameter1 для кривой curve1 и parameter2 для кривой curve2 используются в качестве первоначальных приближений при вычислении точек касания.
 Ссылки
 Teigha.Geometry.LineSegment2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!