Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.RevolveOptionsCheckRevolveCurveOut
 Послать отзыв
 Класс RevolveOptionsCheckRevolveCurveOut представляет индикаторы возможных проблем, выявляемых при проверке возможности вращения объекта.
 Иерархия классов
Teigha::DatabaseServices::RevolveOptionsCheckRevolveCurveOut
 Синтаксис
C#
Visual Basic
Копировать Код
public class RevolveOptionsCheckRevolveCurveOut
Копировать Код
Public Class RevolveOptionsCheckRevolveCurveOut
 Описание
 Класс RevolveOptionsCheckRevolveCurveOut представляет индикаторы, выводимые методом RevolveOptions.CheckRevolveCurve() в результате проверки допустимости конкретного объекта чертежа для операции вращения вокруг определенной оси.
 Методы
 Конструкторы
 Имя
 Описание
 RevolveOptionsCheckRevolveCurveOut
 Конструктор по умолчанию класса RevolveOptionsCheckRevolveCurveOut.
 Топики
 Имя
 Описание
 RevolveOptionsCheckRevolveCurveOut Свойства
 Ниже перечислены свойства класса RevolveOptionsCheckRevolveCurveOut.
 Ссылки
 RevolveOptionsCheckRevolveCurveOut Свойства, Методы, Топики, RevolveOptionsCheckRevolveCurveOut Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!