Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CompositeCurve3d
 Послать отзыв
 Класс CompositeCurve3d представляет трехмерные составные кривые, которые состоят из произвольного количества подкривых, соединенных конец в конец.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Geometry::Entity3d Teigha::Geometry::Curve3d Teigha::Geometry::CompositeCurve3d
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdGeCompositeCurve3d")] public sealed class CompositeCurve3d : Curve3d
Копировать Код
<Wrapper("OdGeCompositeCurve3d")> Public NotInheritable Class CompositeCurve3d Inherits Curve3d
 Описание
 Класс CompositeCurve3d представляет трехмерную составную кривую, которая рассматривается как одна кривая, но состоящая из произвольного количества составляющих её подкривых, соединенных конец в конец. Например, составная кривая может состоять из четырех прямолинейных сегментов, образующих квадрат.
 Замечания
 Каждая из составляющих подкривых должна быть ограниченной кривой. Это означает, что бесконечные линии и лучи не могут использоваться в качестве элементов составной кривой. Подкривые не обязаны лежать в одной плоскости. Объект составной кривой CompositeCurve3d хранит список указателей на объекты своих подкривых.
 Начальный параметр составной кривой равен 0.0. Значение параметра в конечной точке первой подкривой приблизительно равно длине первой подкривой (пусть это будет L1). Значение параметра в конечной точке второй подкривой будет равно L1 плюс приблизительная длина второй подкривой и т.д.
 Методы
 Конструкторы
 Teigha.Geometry.CompositeCurve3d
 Имя
 Описание
 CompositeCurve3d
 Конструктор класса CompositeCurve3d. Создает составную кривую из кривых в предоставленном массиве.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Geometry.Entity3d
 Имя
 Описание
 Entity3d Методы
 Ниже перечислены методы класса Entity3d.
 Teigha.Geometry.Curve3d
 Имя
 Описание
 Curve3d Методы
 Ниже перечислены методы класса Curve3d.
 Curve3d Свойства
 Ниже перечислены свойства класса Curve3d.
 Teigha.Geometry.CompositeCurve3d
 Имя
 Описание
 CompositeCurve3d Методы
 Ниже перечислены методы класса CompositeCurve3d.
 Ссылки
 CompositeCurve3d Методы, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!