Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocDependency.IsObjectStateDependent
 Послать отзыв
 Свойство позволяет задать или проверить, требует ли владеющее зависимостью действие AssocAction, чтобы связанный DBObject находился в ожидаемом «состоянии объекта» с точки зрения списка зависимостей объекта, прежде чем действие можно будет перевычислить.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsObjectStateDependent;
Копировать Код
Public Property IsObjectStateDependent() As Boolean
 Возвращает
 Возвращает true, если вычисление действия предполагает пребывание объекта в некотором определенном состоянии. В противном случае возвращает false.
 Описание
 Свойство позволяет задать или проверить, требует ли владеющее зависимостью действие AssocAction, чтобы связанный DBObject с точки зрения списка зависимостей объекта находился в ожидаемом «состоянии объекта», прежде чем действие можно будет перевычислить.
 Это означает, что действия-владельцы влияющих на объект зависимостей, которые предшествуют данной в общем списке зависимостей объекта, должны быть вычислены, а действия-владельцы влияющих на объект зависимостей, которые следуют в списке после этой зависимости, должны оставаться пока не обновленными. Это также означает, что объект переходит в желаемое состояние после вычисления непосредственно предшествующего действия, но до вычисления следующего действия, которое может снова изменить объект, переведя его в следующее состояние.
 Значение этого флага по умолчанию — true.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.AssocDependency, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!