Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.Dimexe
 Послать отзыв
 Свойство задает или возвращает расстояние, на которое выносные линии выступают за пределы размерных линий.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Dimexe;
Копировать Код
Public Property Dimexe As Double
 Возвращает
 Возвращает расстояние, на которое выносные линии выступают за пределы размерных линий. Тип double.
 Описание
 Свойство задает или возвращает расстояние, на которое выносные линии выступают за пределы размерных линий.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!