Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.TableStyle.TextStyle
 Послать отзыв
 Метод позволяет получить стиль текста в строках указанного типа.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual DatabaseServices.ObjectId TextStyle( RowType rowType );
Копировать Код
Public Overridable Function TextStyle( rowType As RowType ) As DatabaseServices.ObjectId
 Параметры
 Параметры
 Описание
 rowType
 Тип строки таблицы. Перечисление RowType.
 Возвращает
 Возвращает идентификатор текстового стиля. Тип DatabaseServices.ObjectId.
 Описание
 Метод позволяет получить стиль текста в строках указанного типа.
 Ссылки
 Teigha.DatabaseServices.TableStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!