Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Solid.Solid
 Послать отзыв
 Конструктор класса Solid. Создает 2D-тело нулевой толщины по четырем заданным точкам.
 Синтаксис
C#
Visual Basic
Копировать Код
public Solid( Point3d point1, Point3d point2, Point3d point3, Point3d point4 );
Копировать Код
Public Sub New( point1 As Point3d, point2 As Point3d, point3 As Point3d, point4 As Point3d )
 Параметры
 Параметры
 Описание
 point1
 Первая точка. Тип Point3d.
 point2
 Вторая точка. Тип Point3d.
 point3
 Третья точка. Тип Point3d.
 point4
 Четвертая точка. Тип Point3d.
 Описание
 Конструктор класса Solid. Создает 2D-тело нулевой толщины по четырем заданным точкам. Координаты точек должны быть заданы в мировой системе координат (WCS). Вектор нормали принимает значение (0,0,1).
 Ссылки
 Teigha.DatabaseServices.Solid, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!