Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.EllipticalArc2d.EllipticalArc2d
 Послать отзыв
 Конструктор класса EllipticalArc2d. Создает эллипс или эллиптическую дугу с указанными центром, осями, радиусами, а также начальным и конечным углами.
 Синтаксис
C#
Visual Basic
Копировать Код
public EllipticalArc2d( Point2d center, Vector2d majorAxis, Vector2d minorAxis, double majorRadius, double minorRadius, double startAngle, double endAngle );
Копировать Код
Public Sub New( center As Point2d, majorAxis As Vector2d, minorAxis As Vector2d, majorRadius As Double, minorRadius As Double, startAngle As Double, endAngle As Double )
 Параметры
 Параметры
 Описание
 center
 Центр эллипса. Тип Point2d.
 majorAxis
 Большая ось эллипса. Тип Vector2d.
 minorAxis
 Малая ось эллипса. Тип Vector2d.
 majorRadius
 Большой радиус эллипса. Тип double.
 minorRadius
 Малый радиус эллипса. Тип double.
 startAngle
 Начальный угол эллиптической дуги (угловое смещение начальной точки дуги). Тип double.
 endAngle
 Конечный угол эллиптической дуги (угловое смещение конечной точки дуги). Тип double.
 Описание
 Конструктор класса EllipticalArc2d. Создает эллипс или эллиптическую дугу с указанными центром, большой и малой осями, большим и малым радиусами, а также начальным и конечным углами.
 Замечания
 Угол точки на эллипсе измеряется путем проецирования этой точки перпендикулярно большой оси на окружность, центр которой совпадает с центром эллипса, а радиус равен большому радиусу этого эллипса. Угол между большой осью эллипса и вектором из центра эллипса в спроецированную точку на окружности, измеренный против часовой стрелки, является углом этой точки на эллипсе.
 У полного эллипса разница между EndAngle и StartAngle составляет 2 x Pi.
 Ссылки
 Teigha.Geometry.EllipticalArc2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!