Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LineAngularDimension2.LineAngularDimension2
 Послать отзыв
 Конструктор класса LineAngularDimension2. Создает новый объект LineAngularDimension2 с указанными параметрами.
 Синтаксис
C#
Visual Basic
Копировать Код
public LineAngularDimension2( Point3d line1Start, Point3d line1End, Point3d line2Start, Point3d line2End, Point3d arcPoint, ref String dimensionText, DatabaseServices.ObjectId dimensionStyle );
Копировать Код
Public Sub New( line1Start As Point3d, line1End As Point3d, line2Start As Point3d, line2End As Point3d, arcPoint As Point3d, ByRef dimensionText As String, dimensionStyle As DatabaseServices.ObjectId )
 Параметры
 Параметры
 Описание
 line1Start
 Начальная точка первой опорной линии углового размера. Тип Point3d.
 line1End
 Конечная точка первой опорной линии углового размера, она же является начальной точкой первой выносной линии. Тип Point3d.
 line2Start
 Начальная точка второй опорной линии углового размера. Тип Point3d.
 line2End
 Конечная точка второй опорной линии углового размера, она же является начальной точкой второй выносной линии. Тип Point3d.
 arcPoint
 Точка, гарантированно принадлежащая размерной дуге. Тип Point3d.
 dimensionText
 Размерный текст для замены текста реального измеренного значения. Тип String.
 dimensionStyle
 Идентификатор объекта размерного стиля, который используется для отрисовки размера. Тип DatabaseServices.ObjectId.
 Описание
 Конструктор класса LineAngularDimension2. Создает новый объект LineAngularDimension2 с указанными параметрами.
 Ссылки
 Teigha.DatabaseServices.LineAngularDimension2, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!