Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DatabaseSummaryInfoBuilder.Keywords
 Послать отзыв
 Свойство обеспечивает доступ к ключевым словам.
 Синтаксис
C#
Visual Basic
Копировать Код
public String Keywords;
Копировать Код
Public Property Keywords() As String
 Возвращает
 Возвращает строку с ключевыми словами. Тип String.
 Описание
 Свойство обеспечивает доступ к ключевым словам.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.DatabaseSummaryInfoBuilder, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!