Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeaderStyle.ArrowSize
 Послать отзыв
 Свойство представляет размер стрелки, предусмотренный данным стилем.
 Синтаксис
C#
Visual Basic
Копировать Код
public double ArrowSize;
Копировать Код
Public Property ArrowSize As Double
 Возвращает
 Возвращает размер стрелки. Тип double.
 Описание
 Свойство представляет размер стрелки, предусмотренный данным стилем.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MLeaderStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!