Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.SplineEntity3d.KnotAt
 Послать отзыв
 Метод находит значение узла с указанным индексом. В текущей версии не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public double KnotAt( int i );
Копировать Код
Public Function KnotAt( i As Integer ) As Double
 Параметры
 Параметры
 Описание
 i
 Входной индекс узла. Тип int.
 Возвращает
 Возвращает значение узла с индексом index. Тип double.
 Описание
 Метод находит значение узла с заданным индексом index.
 Замечания
 В текущей версии этот метод не реализован.
 Ссылки
 Teigha.Geometry.SplineEntity3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!