Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FeatureControlFrame.DimensionStyle
 Послать отзыв
 Свойство DimensionStyle представляет идентификатор объекта размерного стиля для этого объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectId DimensionStyle { get; set; }
Копировать Код
Public Property DimensionStyle As ObjectId
 Возвращает
 Возвращает идентификатор объекта размерного стиля. Тип ObjectId.
 Описание
 Свойство DimensionStyle представляет идентификатор объекта размерного стиля для этого объекта.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.FeatureControlFrame, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!