Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Dimclre
 Послать отзыв
 Синтаксис
C#
Visual Basic
public Colors::Color Dimclre;
Public Property Dimclre() As Colors.Color
 Описание
 Возвращает или устанавливает текущее значение DIMCLRE для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!