Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LoftOptions.DraftStartMag
 Послать отзыв
 Свойство возвращает величину вытягивания поверхности из первого поперечного сечения (start draft magnitude).
 Синтаксис
C#
Visual Basic
Копировать Код
public double DraftStartMag;
Копировать Код
Public ReadOnly Property DraftStartMag As Double
 Возвращает
 Возвращает величину вытягивания поверхности из первого поперечного сечения. Тип double.
 Описание
 Свойство возвращает величину вытягивания поверхности из первого поперечного сечения (start draft magnitude). Она управляет модулем вектора касательной к поверхности в первом поперечном сечении. Значение по умолчанию — 0, т.е. система автоматически вычислит оптимальную величину для первого поперечного сечения.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.LoftOptions, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!