Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.GetContentLayout
 Послать отзыв
 Метод предназначен для получения макета первого элемента содержимого заданной ячейки.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual CellContentLayout GetContentLayout( int row, int column );
Копировать Код
Public virtual Function GetContentLayout( row As Integer, column As Integer ) As CellContentLayout
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 col
 Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
 Возвращает
 Возвращает макет для элемента содержимого из перечисления Teigha.DatabaseServices.CellContentLayout.
 Описание
 Метод предназначен для получения макета для первого элемента содержимого ячейки, заданной индексами строки и столбца.
 Замечания
 Для получения того же результата предпочтительнее использовать Table.Cells[row,column].ContentLayout.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!