Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FeatureControlFrame.Dimclrt
 Послать отзыв
 Свойство Dimclrt представляет текущее значение системной переменной DIMCLRT, которая задает цвет размерного текста.
 Синтаксис
C#
Visual Basic
Копировать Код
public Colors.Color Dimclrt;
Копировать Код
Public Property Dimclrt As Colors.Color
 Возвращает
 Возвращает цвет размерного текста. Тип Colors.Color.
 Описание
 Свойство Dimclrt представляет текущее значение системной переменной DIMCLRT, которая задает цвет размерного текста.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.FeatureControlFrame, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!