Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Ole2Frame.LockAspect
 Послать отзыв
 Свойство позволяет управлять блокировкой пропорций окна данного объекта при изменении размеров окна.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool LockAspect;
Копировать Код
Public Property LockAspect As Boolean
 Возвращает
 Возвращает true, если при изменении размеров окна объекта пропорции окна должны оставаться неизменными. В противном случае возвращает false.
 Описание
 Свойство представляет состояние флага блокировки соотношения сторон окна данного объекта. Это свойство влияет на поведение объекта OLE при изменении его размера.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Ole2Frame, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!