Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.NurbSurface.Evaluate
 Послать отзыв
 Метод предназначен для вычисления 3D-точки на NURBS поверхности для заданных значений параметров (dU, dV). Дополнительно метод вычисляет в этой точке первые производные по u и v.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Evaluate( double dU, double dV, Point3d pos, Vector3d uDeriv, Vector3d vDeriv );
Копировать Код
Public Sub Evaluate( dU As Double, dV As Double, pos As Point3d, uDeriv As Vector3d, vDeriv As Vector3d )
 Параметры
 Параметры
 Описание
 dU
 Входной параметр в направлении U. Тип double.
 dV
 Входной параметр в направлении V. Тип double.
 pos
 Вычисленная 3D-точка на NURBS поверхности. Тип Point3d.
 uDeriv
 Вычисленная первая производная по u в заданной точке. Тип Vector3d.
 vDeriv
 Вычисленная первая производная по v в заданной точке. Тип Vector3d.
 Описание
 Метод предназначен для вычисления 3D-точки на NURBS поверхности для заданных значений параметров (dU, dV). Дополнительно метод вычисляет в этой точке первые производные по u и v.
 Замечания
 Если поверхность не содержит никакой NURBS информации, выбрасывается исключение eFail. Если любое из значений dU или dV выходит за пределы допустимого диапазона, генерируется исключение eOutOfRange. Если этот метод в конкретном моделере не реализован, выбрасывается исключение eNotImplementedYet.
 Ссылки
 Teigha.DatabaseServices.NurbSurface, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!