Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 BlockTableRecord.HasPreviewIcon
 Послать отзыв
 Признак наличия иконки предпросмотра у блока.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool HasPreviewIcon { get; }
Копировать Код
Public ReadOnly Property HasPreviewIcon As Boolean
 Возвращает
 Возвращает тип данных bool:
true - у блока есть иконка предпросмотра;
false - у блока нет иконки предпросмотра.
 Описание
 В свойстве хранится признак наличия у блока иконки предпросмотра.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.BlockTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!