Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Ellipse.Ellipse
 Послать отзыв
 Конструктор класса Ellipse. Создает эллипс (или эллиптическую дугу) с указанными параметрами.
 Синтаксис
C#
Visual Basic
Копировать Код
public Ellipse( Point3d center, Vector3d unitNormal, Vector3d majorAxis, double radiusRatio, double startAngle, double endAngle );
Копировать Код
Public Sub New( center As Point3d, unitNormal As Vector3d, majorAxis As Vector3d, radiusRatio As Double, startAngle As Double, endAngle As Double )
 Параметры
 Параметры
 Описание
 center
 Центр эллипса в мировой системе координат (WCS). Тип Point3d.
 unitNormal
 Единичный вектор нормали к плоскости, в которой располагается эллипс. Задается в WCS. Тип Vector3d.
 majorAxis
 Направление большой оси эллипса в WCS. Тип Vector3d. По модулю составляет половину главной оси эллипса.
 radiusRatio
 Отношение малого радиуса эллипса к большому. Тип double. Для получения действительного эллипса этот параметр не должен быть меньше 1E-6 или больше 1.0.
 startAngle
 Начальный угол эллиптической дуги. Тип double.
 endAngle
 Конечный угол эллиптической дуги. Тип double.
 Описание
 Конструктор класса Ellipse. Создает эллипс (или эллиптическую дугу) с указанными параметрами.
 Параметры center, unitNormal и majorAxis используются для вычисления начальной точки и ориентации эллипса в мировой системе координат. Вектор majorAxis по модулю равен половине большой оси эллипса и задает начало отсчета для углов startAngle и endAngle. Положительное направление отсчета углов определяется правилом правой руки - если смотреть вдоль вектора нормали на центр эллипса, то положительным считается направление против часовой стрелки.
 Условиями замкнутости эллипса являются (startAngle = 0) и (endAngle = 2PI). Значение radiusRatio должно находиться в диапазоне от 1E-6 до 1.0. Скалярное произведение unitNormal с самим собой и majorAxis с самим собой должны превышать 1E-12. Направления majorAxis и unitNormal должны быть перпендикулярными в пределах допуска 1E-6. Разница между углами startAngle и endAngle должна быть больше 1E-6.
 Чтобы проверить, удалось ли этому конструктору инициализировать эллипс переданными значениями, следует воспользоваться свойством isNull. В случае успешной инициализации оно возвращает значение false.
 Замечания
 Все углы задаются в радианах.
 Ссылки
 Teigha.DatabaseServices.Ellipse, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!