Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Point3d.-
 Послать отзыв
 Оператор вычитания класса Point3d. Реализует вычитание компонент 3D-вектора b из координат точки a.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d operator -( Point3d a, Vector3d b );
Копировать Код
Public Operator -( a As Point3d, b As Vector3d )
 Параметры
 Параметры
 Описание
 a
 Левый операнд. Тип Point3d.
 b
 Правый операнд. Тип Vector3d.
 Возвращает
 Возвращает точку Point3d в новых координатах.
 Описание
 Оператор вычитания класса Point3d. Реализует вычитание компонент 3D-вектора b из координат точки a, что эквивалентно перемещению точки на вектор, обратный вектору b.
 Ссылки
 Teigha.Geometry.Point3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!