Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CurveCurveIntersector2d.Set
 Послать отзыв
 Метод позволяет переопределить в данном объекте обе кривые и параметрические интервалы для каждой из них. Точки пересечения вычисляются в пределах точности по умолчанию.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Set( ref Curve2d curve1, ref Curve2d curve2, ref Interval range1, ref Interval range2 );
Копировать Код
Public Sub Set( ByRef curve1 As Curve2d, ByRef curve2 As Curve2d, ByRef range1 As Interval, ByRef range2 As Interval )
 Параметры
 Параметры
 Описание
 curve1
 Первая входная кривая. Тип Curve2d.
 curve2
 Вторая входная кривая. Тип Curve2d.
 range1
 Параметрический интервал для первой кривой. Тип Interval.
 range2
 Параметрический интервал для второй кривой. Тип Interval.
 Описание
 Метод позволяет переопределить в данном объекте обе кривые и параметрические интервалы для каждой из них. Точки пересечения вычисляются в пределах точности по умолчанию.
 Ссылки
 Teigha.Geometry.CurveCurveIntersector2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!