Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SectionHitTestInfo.PtOnSegment
 Послать отзыв
 Свойство PtOnSegment представляет координаты трехмерной точки на сегменте секущей плоскости, которая соответствует точке попадания.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d PtOnSegment;
Копировать Код
Public ReadOnly Property PtOnSegment As Point3d
 Возвращает
 Возвращает координаты трехмерной точки. Тип Point3d.
 Описание
 Свойство PtOnSegment представляет координаты трехмерной точки на сегменте секущей плоскости, которая соответствует точке попадания, или значение NULL, если это не требуется.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.SectionHitTestInfo, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!