Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector3d.==
 Послать отзыв
 Оператор реализует сравнение на равенство двух 3D-векторов.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool operator ==( Vector3d a, Vector3d b );
Копировать Код
Public Operator ==( a As Vector3d, b As Vector3d )
 Параметры
 Параметры
 Описание
 a
 Входной вектор. Тип Vector3d.
 b
 Входной вектор. Тип Vector3d.
 Возвращает
 Возвращает true, если вектора a и b равны друг другу. В противном случае возвращает false.
 Описание
 Оператор реализует сравнение на равенство двух заданных 3D-векторов.
 Ссылки
 Teigha.Geometry.Vector3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!