Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Dimtoh
 Послать отзыв
 Синтаксис
C#
Visual Basic
public bool Dimtoh;
Public Property Dimtoh() As bool
 Описание
 Возвращает или устанавливает текущее значение DIMTOH для базы данных. Значение false соответствует 0. Значение true — 1.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!