Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SymbolUtilityServices.GetPathNameFromSymbolName
 Послать отзыв
 Метод позволяет извлечь имя пути из указанных имени блока и расширения (или расширений).
 Синтаксис
C#
Visual Basic
Копировать Код
public static String GetPathNameFromSymbolName( ref String symbolName, ref String extensions );
Копировать Код
Public Shared Function GetPathNameFromSymbolName( ByRef symbolName As String, ByRef extensions As String ) As String
 Параметры
 Параметры
 Описание
 symbolName
 Имя блока, из которого требуется получить путь. Тип String.
 extensions
 Список расширений, для которых выполняется поиск путей. Тип String.
 Возвращает
 Возвращает имя пути. Тип String.
 Описание
 Метод позволяет извлечь имя пути из указанных имени блока и расширения (или расширений).
 Строка расширения добавляется в конец полученной строки, если она не имеет расширения. В списке расширения должны разделяться точкой с запятой и не должны иметь точек перед именами расширений, например: "dwg;dxf".
 Ссылки
 Teigha.DatabaseServices.SymbolUtilityServices, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!