Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.IsBackgroundColorNone
 Послать отзыв
 Метод позволяет определить, задан ли цвет фона для заданного типа строки объекта Table.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual bool IsBackgroundColorNone( RowType type );
Копировать Код
Public virtual Function IsBackgroundColorNone( type As RowType ) As Boolean
 Параметры
 Параметры
 Описание
 type
 Тип строки из перечисления RowType.
 Возвращает
 Возвращает true, если для заданного типа строки цвет фона не задан (None); в противном случае возвращает false.
 Описание
 Метод позволяет определить, задан ли цвет фона для заданного типа строки объекта Table. Если тип строки не указан, используется значение DataRow по умолчанию.
 Замечания
 Для получения того же результата предпочтительнее использовать функционал объекта Cell.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!