Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Material.Reflection
 Послать отзыв
 Свойство представляет компонент отражения данного материала.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual MaterialMap Reflection;
Копировать Код
Public Overridable Property Reflection As MaterialMap
 Возвращает
 Возвращает компонент отражения материала. Тип MaterialMap.
 Описание
 Свойство представляет компонент отражения данного материала.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Material, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!