Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBDictionaryEntry.DictionaryEntry
 Послать отзыв
 Оператор неявного преобразования.
 Синтаксис
C#
Visual Basic
Копировать Код
public explicit operator DictionaryEntry(DBDictionaryEntry entry);
Копировать Код
Public Operator DictionaryEntry(entry As DBDictionaryEntry)
 Ссылки
 Teigha.DatabaseServices.DBDictionaryEntry, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!