Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LayerStateManager.SaveLayerState
 Послать отзыв
 Метод сохраняет текущее состояние слоя в состоянии слоя с указанным именем.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SaveLayerState( ref String name, LayerStateMasks mask, DatabaseServices.ObjectId id );
Копировать Код
Public Function SaveLayerState( ByRef name As String, mask As LayerStateMasks, id As DatabaseServices.ObjectId )
 Параметры
 Параметры
 Описание
 name
 Имя сохраняемого состояния слоя, тип String.
 mask
 Маска для применения к состоянию слоя, тип LayerStateMasks,
 id
 ObjectId видового экрана, чья настройка VPLAYER должна быть сохранена, тип DatabaseServices.ObjectId.
 Описание
 Метод сохраняет текущее состояние слоя в состоянии слоя с указанным именем. Этот метод сохраняет также настройки VPLAYER для указанного видового экрана. Чтобы сохранить состояние слоя без настроек VPLAYER, следует аргументу id задать значение Null.
 Ссылки
 Teigha.DatabaseServices.LayerStateManager, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!