Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Region.Area
 Послать отзыв
 Свойство Area представляет площадь данной области.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual double Area;
Копировать Код
Public Overridable ReadOnly Property Area As Double
 Возвращает
 Возвращает площадь данной области. Тип double.
 Описание
 Свойство Area представляет площадь данной области. Величина площади возвращается в текущих единицах чертежа, возведенных в квадрат.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Region, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!