Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector3d.IsParallelTo
 Послать отзыв
 Метод позволяет проверить, параллелен ли данный вектор входному вектору в пределах заданной точности.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsParallelTo( Vector3d vector, Tolerance tolerance );
Копировать Код
Public Function IsParallelTo( vector As Vector3d, tolerance As Tolerance ) As Boolean
 Параметры
 Параметры
 Описание
 vector
 Входной вектор для сравнения. Тип Vector3d.
 tolerance
 Входная точность для сравнения векторов. Тип Tolerance.
 Возвращает
 В случае параллельности векторов возвращает true. В противном случае возвращает false.
 Описание
 Метод позволяет проверить, параллелен ли данный вектор входному вектору vector в пределах заданной точности tolerance.
 Реализация приводит оба вектора к единичной длине. В случае отрицательного скалярного произведения векторов, изменяет направление данного вектора на противоположное. Затем выполняется проверка на совпадение полученных векторов в пределах заданного допуска Tolerance.EqualVector(). Метод возвращает true, если это условие выполнено, и false в противном случае.
 Ссылки
 Teigha.Geometry.Vector3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!