Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 DimStyleTableRecord.Dimtxsty
 Послать отзыв
 Свойство отвечает за настройку стиля размерного текста.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual ObjectId Dimtxsty { get; set; }
Копировать Код
Public Overridable Property Dimtxsty As ObjectId
 Возвращает
 Возвращает тип данных ObjectId.
 Описание
 В свойстве хранится ObjectId текущего стиля размерного текста.
 Свойство также доступно через системную переменную DIMTXSTY и пользовательское меню в окне изменения/создания размерного стиля:
  При изменении системной переменной DIMTXSTY будет создан новый размерный стиль под названием <переопределение> на основе текущего с новым значением DIMTXSTY.
 Условия
 Чтение и запись.
 Пример
 Пример изменения стиля размерного текста (значения свойства Dimtxsty) в размерном стиле Standard:
C#
 Копировать Код
public partial class Commands { [Teigha.Runtime.CommandMethod("DimtxstyChange")] public void DimtxstyStandardDimStyle() { // Получение ссылки на активный документ HostMgd.ApplicationServices.Document doc = HostMgd.ApplicationServices.Application.DocumentManager.MdiActiveDocument; // Получение ссылки на редактор документа HostMgd.EditorInput.Editor ed = doc.Editor; // Получение ссылки на базу данных документа Teigha.DatabaseServices.Database db = doc.Database; // Начало транзакции с базой данных документа using (Teigha.DatabaseServices.Transaction trans = db.TransactionManager.StartTransaction()) { // Открываем таблицу размерных стилей для чтения Teigha.DatabaseServices.DimStyleTable dimStyleTable = trans.GetObject(db.DimStyleTableId, Teigha.DatabaseServices.OpenMode.ForRead) as Teigha.DatabaseServices.DimStyleTable; // Находим в таблице размерных стилей ObjectId нужного стиля по его названию Teigha.DatabaseServices.ObjectId styleId = dimStyleTable["Standard"]; // Открываем таблицу размерного стиля для изменений Teigha.DatabaseServices.DimStyleTableRecord obj = trans.GetObject(styleId, Teigha.DatabaseServices.OpenMode.ForWrite) as Teigha.DatabaseServices.DimStyleTableRecord; ed.WriteMessage($"nDimtxsty before: {obj.Dimtxsty}"); // Для того, чтобы изменить стиль текста, открываем сначала таблицу текстовых стилей для чтения Teigha.DatabaseServices.TextStyleTable tsTable = trans.GetObject(db.TextStyleTableId, Teigha.DatabaseServices.OpenMode.ForRead) as Teigha.DatabaseServices.TextStyleTable; // Ищем в таблице текстовых стилей нужный нам стиль по названию Teigha.DatabaseServices.ObjectId ts = tsTable["ГОСТ 2.304"]; // Изменяем стиль размерного текста obj.Dimtxsty = ts; ed.WriteMessage($"nDimtxsty after: {obj.Dimtxsty}"); trans.Commit(); } } }
 Результат работы команды DimtxstyChange:
 Было:
 Стало:
 Ссылки
 Teigha.DatabaseServices.DimStyleTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!