Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.EllipticalCone
 Послать отзыв
 Класс EllipticalCone представляет прямые эллиптические конусы.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Geometry::Entity3d Teigha::Geometry::Surface Teigha::Geometry::EllipticalCone
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdGeEllipCone")] public sealed class EllipticalCone : Surface
Копировать Код
<Wrapper("OdGeEllipCone")> Public NotInheritable Class EllipticalCone Inherits Surface
 Описание
 Класс EllipticalCone представляет прямые эллиптические конусы.
 Эллиптический конус определяется его:
осью симметрии,
высотой,
синусом и косинусом половинного угла,
началом координат (точкой на оси симметрии),
большим и малым радиусами в начале координат,
большой осью,
масштабом параметра U.
 Замечания
 Основание конуса - поперечное сечение конуса плоскостью, перпендикулярной оси конуса, в которой располагается начало координат конуса. Радиусы эллипса в основании не могут равняться нулю. Вершина данного эллиптического конуса может располагаться по любую сторону от основания, но конус не может быть двойным конусом.
 Половинный угол измеряется от оси симметрии конуса до точки эллипса в основании, располагающейся на большой оси. Если косинус половинного угла положительный, эллиптический конус является выпуклым, если отрицательный, то конус - вогнутый. Если косинус и синус половинного угла имеют одинаковый знак, вершина конуса смещена от основания в направлении, противоположном оси симметрии конуса, таким образом, при движении вдоль оси симметрии радиус увеличивается. Если же косинус и синус половинного угла имеют разные знаки, вершина конуса смещена от основания в направлении оси симметрии конуса, таким образом, при движении вдоль оси симметрии радиус уменьшается. Как косинус, так и синус половинного угла не могут равняться нулю.
 Параметр V определяет угол вращения вокруг оси симметрии конуса, измеряемый от большой оси. Для замкнутого эллиптического конуса он равен [-PI, +PI). Положительное направление изменения параметра V определяется правилом правой руки при движении вдоль оси симметрии конуса. Боковая поверхность конуса периодична по V с периодом 2PI.
 Угол точки на эллипсе измеряется путем проецирования этой точки перпендикулярно большой оси на окружность, лежащую в той же плоскости, центр которой совпадает с центром эллипса, а радиус равен большому радиусу этого эллипса.
 Угол между большой осью эллипса и вектором из центра эллипса в спроецированную точку на окружности, измеренный против часовой стрелки, является углом этой точки на эллипсе.
 Интервал высот эллиптического конуса определяется относительно начала координат конуса. Высота увеличивается в направлении оси симметрии. Интервал высот должен быть ограничен.
 Параметр U изменяется вдоль образующей конуса. U является безразмерным, измеряется в масштабе параметра U (который по умолчанию равен большому радиусу), умноженном на абсолютное значение косинуса половинного угла. Значение параметра U увеличивается в направлении оси симметрии, если масштаб положительный. Однако, если масштаб параметра U отрицателен, U уменьшается в направлении оси симметрии. Нулевое значение U соответствует основанию эллиптического конуса.
 Если косинус и синус половинного угла имеют одинаковые знаки, в вершине конуса значения параметра U и высоты отрицательны. Если же косинус и синус половинного угла имеют разные знаки, то в вершине конуса значения параметра U и высоты положительны.
 Параметрическая область [umin, umax] x [vmin, vmax] определяет четырехсторонний участок конической поверхности, ограниченный двумя прямыми линиями (под углами vmin и vmax) и двумя дугами (для значений umin и umax).
 При определении эллиптического конуса необходимо соблюдать следующие условия:
umin < umax;
vmax - vmin| <= 2PI;
majorRadius > 0.0;
minorRadius > 0.0.
 Методы
 Конструкторы
 Teigha.Geometry.EllipticalCone
 Имя
 Описание
 EllipticalCone
 Это обзор перегрузок EllipticalCone.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Geometry.Entity3d
 Имя
 Описание
 Entity3d Методы
 Ниже перечислены методы класса Entity3d.
 Teigha.Geometry.Surface
 Имя
 Описание
 Surface Методы
 Ниже перечислены методы класса Surface.
 Surface Свойства
 Ниже перечислены свойства класса Surface.
 Teigha.Geometry.EllipticalCone
 Имя
 Описание
 EllipticalCone Методы
 Ниже перечислены методы класса EllipticalCone.
 EllipticalCone Свойства
 Ниже перечислены свойства класса EllipticalCone.
 Ссылки
 EllipticalCone Конструктор, EllipticalCone Методы, EllipticalCone Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!