Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve2dCollection.Add
 Послать отзыв
 Метод добавляет в данную коллекцию новую кривую Curve2d.
 Синтаксис
C#
Visual Basic
Копировать Код
public int Add( ref Curve2d value );
Копировать Код
Public Function Add( ByRef value As Curve2d ) As Integer
 Параметры
 Параметры
 Описание
 value
 Входная кривая, которая добавляется в коллекцию. Тип Curve2d.
 Возвращает
 Возвращает индекс добавленной кривой в данной коллекции. Тип int.
 Описание
 Метод добавляет в данную коллекцию новую кривую Curve2d.
 Ссылки
 Teigha.Geometry.Curve2dCollection, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!