Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CellBorder.DoubleLineSpacing
 Послать отзыв
 Свойство DoubleLineSpacing представляет величину интервала между двойными линиями границы.
 Синтаксис
C#
Visual Basic
Копировать Код
public double? DoubleLineSpacing;
Копировать Код
Public Property DoubleLineSpacing As Double?
 Возвращает
 Возвращает величину интервала между двойными линиями границы. Тип double?.
 Описание
 Свойство DoubleLineSpacing представляет величину интервала между двойными линиями границы.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.CellBorder, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!