Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Curve.GetSecondDerivative
 Послать отзыв
 Метод предназначен для получения вектора второй производной кривой в точке, заданной параметром value.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual Vector3d GetSecondDerivative( double value );
Копировать Код
Public virtual Function GetSecondDerivative( value As double ) As Vector3d
 Параметры
 Параметры
 Описание
 value
 Заданное значение параметра, которое определчяет точку на кривой.
 Возвращает
 Возвращает вторую производную кривой в заданной точке, представленную экземпляром класса Vector3d.
 Описание
 Метод предназначен для получения вектора второй производной кривой в точке, заданной параметром value.
 Ссылки
 Teigha.DatabaseServices.Curve, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!