Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LightingUnits
 Послать отзыв
 Перечисление LightingUnits определяет единицы освещенности для чертежа.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum LightingUnits { LightingUnitsGeneric = 0, LightingUnitsAmerican = 1, LightingUnitsInternational = 2 }
Копировать Код
Public Enum LightingUnits LightingUnitsGeneric = 0 LightingUnitsAmerican = 1 LightingUnitsInternational = 2 End Enum
 Члены
 Члены
 Описание
 LightingUnitsAmerican
 Значение: 1. Американские единицы освещенности.
 LightingUnitsGeneric
 Значение: 0. Универсальные единицы освещенности.
 LightingUnitsInternational
 Значение: 2. Международные единицы освещенности.
 Описание
 Перечисление LightingUnits определяет единицы освещенности для чертежа.
 Ваши комментарии по поводу этого топика: Послать отзыв!