Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CompoundObjectId.CompoundObjectId
 Послать отзыв
 Конструктор класса по умолчанию.
 Синтаксис
C#
Visual Basic
Копировать Код
public CompoundObjectId();
Копировать Код
Public Sub New()
 Описание
 Конструктор класса по умолчанию. Создает пустой объект CompoundObjectId.
 Ссылки
 Teigha.DatabaseServices.CompoundObjectId, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!