Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FieldEvaluationContext
 Послать отзыв
 Данное перечисление определяет контекст вычисления поля.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum FieldEvaluationContext { Demand = 32, Etransmit = 8, Open = 1, Plot = 4, Preview = 64, Regen = 16, Save = 2 }
Копировать Код
Public Enum FieldEvaluationContext Demand = 32 Etransmit = 8 Open = 1 Plot = 4 Preview = 64 Regen = 16 Save = 2 End Enum
 Члены
 Члены
 Описание
 Open
 Значение: 1. Вычисление в процессе открытия чертежа.
 Save
 Значение: 2. Вычисление в процессе сохранения чертежа.
 Plot
 Значение: 4. Вычисление в процессе печати.
 Etransmit
 Значение: 8. Вычисление в процессе eTransmit.
 Regen
 Значение: 16. Вычисление в процессе регенерации чертежа.
 Demand
 Значение: 32. Вычисление по требованию
 Preview
 Значение: 64. Вычисление для предварительного просмотра. В контексте Preview поле всегда вычисляется независимо от установок в базе данных.
 Описание
 Данное перечисление определяет контекст вычисления поля.
 Ваши комментарии по поводу этого топика: Послать отзыв!