Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PolygonMesh
 Послать отзыв
 Класс PolygonMesh представляет полигональную сеть в nanoCAD.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::GraphicsInterface::Drawable Teigha::DatabaseServices::DBObject Teigha::DatabaseServices::Entity Teigha::DatabaseServices::PolygonMesh
 Синтаксис
C#
Visual Basic
Копировать Код
public class PolygonMesh : Entity, System.Collections.IEnumerable;
Копировать Код
Public Class PolygonMesh Inherits Entity Inherits System.Collections.IEnumerable
 Описание
 Класс PolygonMesh представляет полигональную сеть в nanoCAD.
 Сеть PolygonMesh имеет размерность M x N, где M это количество вершин в строке сети, а N это количество вершин в столбце сети.
 Сеть может быть открытой или замкнутой в одном или обоих направлениях M и N. Сеть, замкнутая в некотором направлении, считается непрерывной на стыке последней и первой строк (или, соответственно, столбцов).
 Все вершины сети хранятся в одном списке. Для сети без подгонки к поверхности первые N вершин образуют первый столбец, вторые N вершин - второй столбец и так далее, пока вершины не закончатся. Вершины не обязаны полностью заполнять сеть размера M x N.
 В случае сети с подгонкой к поверхности вместо размерностей M и N для строк и столбцов используются значения поверхностной плотности вершин.
 Методы
 Конструкторы
 Teigha.GraphicsInterface.Drawable
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 Drawable
 Конструктор класса Teigha.GraphicsInterface.Drawable. (Унаследован от Drawable)
 Teigha.DatabaseServices.DBObject
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 DBObject
 Конструктор. (Унаследован от DBObject)
 Teigha.DatabaseServices.PolygonMesh
 Имя
 Описание
 PolygonMesh
 Это обзор перегрузок PolygonMesh.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.GraphicsInterface.Drawable
 Имя
 Описание
 Drawable Методы
 Ниже перечислены методы класса Drawable.
 Drawable Свойства
 Ниже перечислены свойства класса Drawable.
 Teigha.DatabaseServices.DBObject
 Имя
 Описание
 DBObject Методы
 Ниже перечислены методы класса DBObject.
 DBObject Свойства
 Ниже перечислены свойства класса DBObject.
 DBObject События
 Ниже перечислены события класса DBObject.
 Teigha.DatabaseServices.Entity
 Имя
 Описание
 Entity Методы
 Ниже перечислены методы класса Entity.
 Entity Свойства
 Ниже перечислены свойства класса Entity.
 Teigha.DatabaseServices.PolygonMesh
 Имя
 Описание
 PolygonMesh Методы
 Ниже перечислены методы класса PolygonMesh.
 PolygonMesh Свойства
 Ниже перечислены свойства класса PolygonMesh.
 Ссылки
 PolygonMesh Конструктор, PolygonMesh Методы, PolygonMesh Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства, DBObject События
 Ваши комментарии по поводу этого топика: Послать отзыв!