Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Viewport.GridOn
 Послать отзыв
 Свойство GridOn позволяет определить, включен ли режим отображения сетки в данном видовом экране.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool GridOn;
Копировать Код
Public Property GridOn As Boolean
 Возвращает
 Возвращает true, если режим отображения сетки включен. В противном случае возвращает false.
 Описание
 Свойство GridOn позволяет определить, включен ли режим отображения сетки в данном видовом экране.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Viewport, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!