Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbCurve2d.NurbCurve2d
 Послать отзыв
 Конструктор класса NurbCurve2d. Создает двумерную NURBS кривую, которая интерполирует указанный линейный сегмент.
 Синтаксис
C#
Visual Basic
Копировать Код
public NurbCurve2d( ref LineSegment2d linSegment );
Копировать Код
Public Sub New( ByRef linSegment As LineSegment2d )
 Параметры
 Параметры
 Описание
 linSegment
 Входной линейный сегмент. Тип LineSegment2d.
 Описание
 Конструктор класса NurbCurve2d. Создает двумерную NURBS кривую, которая интерполирует указанный линейный сегмент.
 Ссылки
 Teigha.Geometry.NurbCurve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!