Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DxfFiler.WriteAngle
 Послать отзыв
 Метод записывает в данный объект Filer указанное значение угла.
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract void WriteAngle DxfCode opCode, double value, int precision );
Копировать Код
Public MustOverride Sub WriteAngle( opCode As DxfCode, value As Double, precision As Integer )
 Параметры
 Параметры
 Описание
 opCode
 Групповой код DXF. Тип DxfCode.
 value
 Значение, которое следует записать. Тип double.
 precision
 Количество цифр после запятой в интервале от 0 до 16. Тип int. Определяет точность представления числа с плавающей точкой.
 Описание
 Метод записывает в данный объект Filer указанные групповой код DXF, значение угла и точность представления числа с плавающей точкой.
 Ссылки
 Teigha.DatabaseServices.DxfFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!