Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Light.TargetLocation
 Послать отзыв
 Свойство представляет положение цели данного источника света.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d TargetLocation;
Копировать Код
Public Property TargetLocation As Point3d
 Возвращает
 Возвращает положение цели источника света. Тип Point3d.
 Описание
 Свойство представляет положение цели данного источника света.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Light, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!