Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ProxyResurrectionCompletedEventArgs
 Послать отзыв
 Класс ProxyResurrectionCompletedEventArgs предоставляет данные для события ProxyResurrectionCompleted базы данных.
 Иерархия классов
Teigha::DatabaseServices::ProxyResurrectionCompletedEventArgs
 Синтаксис
C#
Visual Basic
Копировать Код
public sealed class ProxyResurrectionCompletedEventArgs : EventArgs
Копировать Код
Public NotInheritable Class ProxyResurrectionCompletedEventArgs Inherits EventArgs
 Описание
 Класс ProxyResurrectionCompletedEventArgs предоставляет данные для события ProxyResurrectionCompleted базы данных.
 Топики
 Имя
 Описание
 ProxyResurrectionCompletedEventArgs Свойства
 Ниже перечислены свойства класса ProxyResurrectionCompletedEventArgs.
 Ссылки
 ProxyResurrectionCompletedEventArgs Свойства, Топики, ProxyResurrectionCompletedEventArgs Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!