Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство OrdinateDimension.definingPoint
 Послать отзыв
 This is definingPoint, a member of class OrdinateDimension.
 Синтаксис
C#
Visual Basic
public set definingPoint;
Public Property definingPoint() As set
 Ссылки
 OrdinateDimension Класс, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!