Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LinkedData.IsEmpty
 Послать отзыв
 Свойство позволяет проверить, содержит ли этот объект какие-либо данные. Должно быть реализовано в производных классах.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual bool IsEmpty;
Копировать Код
Public Overridable ReadOnly Property IsEmpty As Boolean
 Возвращает
 Возвращает true, если данный объект содержит данные. В противном случае возвращает false.
 Описание
 Свойство позволяет проверить, содержит ли этот объект какие-либо данные. Должно быть реализовано в производных классах.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.LinkedData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!