Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ViewTableRecordRenderMode
 Послать отзыв
 Перечисление ViewTableRecordRenderMode определяет режимы рендеринга для записи таблицы видовых экранов.
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdDb.RenderMode")] public enum ViewTableRecordRenderMode { Optimized2D = 0, Wireframe = 1, HiddenLine = 2, FlatShaded = 3, GouraudShaded = 4, FlatShadedWithWireframe = 5, GouraudShadedWithWireframe = 6 }
Копировать Код
<Wrapper("OdDb.RenderMode")> Public Enum ViewTableRecordRenderMode Optimized2D = 0 Wireframe = 1 HiddenLine = 2 FlatShaded = 3 GouraudShaded = 4 FlatShadedWithWireframe = 5 GouraudShadedWithWireframe = 6 End Enum
 Члены
 Члены
 Описание
 FlatShaded
 Значение: 3. Равномерное тонирование.
 FlatShadedWithWireframe
 Значение: 5. Равномерное тонирование с отображением ребер каркаса.
 GouraudShaded
 Значение: 4. Тонирование по Гуро.
 GouraudShadedWithWireframe
 Значение: 6. Тонирование по Гуро с отображением ребер каркаса.
 HiddenLine
 Значение: 2. Представление, в котором подавлено отображение скрытых линий.
 Optimized2D
 Значение: 0. Визуализация, оптимизированная для 2D-графики (классическое 2D).
 Wireframe
 Значение: 1. Каркасное представление.
 Описание
 Перечисление ViewTableRecordRenderMode определяет режимы рендеринга для записи таблицы видовых экранов.
 Ваши комментарии по поводу этого топика: Послать отзыв!