Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Position2d
 Послать отзыв
 Класс Position2d представляет точки как позиции в двумерном пространстве.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Geometry::Entity2d Teigha::Geometry::PointEntity2d Teigha::Geometry::Position2d
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdGePosition2d")] public sealed class Position2d : PointEntity2d
Копировать Код
<Wrapper("OdGePosition2d")> Public NotInheritable Class Position2d Inherits PointEntity2d
 Описание
 Класс Position2d представляет точки как позиции в двумерном пространстве.
 Методы
 Конструкторы
 Teigha.Geometry.Position2d
 Имя
 Описание
 Position2d
 Это обзор перегрузок Position2d.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Geometry.Entity2d
 Имя
 Описание
 Entity2d Методы
 Ниже перечислены методы класса Entity2d.
 Teigha.Geometry.PointEntity2d
 Имя
 Описание
 PointEntity2d Методы
 Ниже перечислены методы класса PointEntity2d.
 PointEntity2d Свойства
 Ниже перечислены свойства класса PointEntity2d.
 Teigha.Geometry.Position2d
 Имя
 Описание
 Position2d Методы
 Ниже перечислены методы класса Position2d.
 Ссылки
 Position2d Конструктор, Position2d Методы, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!