Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotSettingsValidator.Current
 Послать отзыв
 Свойство представляет текущий элемент.
 Синтаксис
C#
Visual Basic
Копировать Код
public static PlotSettingsValidator Current;
Копировать Код
Public Shared ReadOnly Property Current As PlotSettingsValidator
 Возвращает
 Возвращает текущий элемент. Тип PlotSettingsValidator.
 Описание
 Свойство представляет текущий элемент.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.PlotSettingsValidator, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!