Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.LightsInBlocks
 Послать отзыв
 Синтаксис
C#
Visual Basic
public bool LightsInBlocks;
Public Property LightsInBlocks() As bool
 Описание
 Устанавливает или возвращает признак, что блоки игнорируются и не способствуют освещению общей сцены.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!