Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Orthomode
 Послать отзыв
 Синтаксис
C#
Visual Basic
public bool Orthomode;
Public Property Orthomode() As bool
 Описание
 Возвращает или устанавливает текущее значение ORTHOMODE для базы данных. Значение false соответствует 0. Значение true — 1.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!