Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Region.NumChanges
 Послать отзыв
 Свойство NumChanges представляет количество изменений в геометрии области с момента ее создания.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual int NumChanges;
Копировать Код
Public Overridable ReadOnly Property NumChanges As Integer
 Возвращает
 Возвращает количество изменений в геометрии области. Тип int.
 Описание
 Свойство NumChanges представляет количество изменений в геометрии области с момента ее создания.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Region, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!