Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.MLeaderStyleDictionaryId
 Послать отзыв
 Синтаксис
C#
Visual Basic
public DatabaseServices::ObjectId MLeaderStyleDictionaryId;
Public Property MLeaderStyleDictionaryId() As DatabaseServices.ObjectId
 Описание
 Для словаря ACAD_MLEADERSTYLE.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!