Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 DimStyleTableRecord.Dimasz
 Послать отзыв
 Свойство отвечает за размер стрелок в размерных линиях и выносках.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual double Dimasz { get; set; }
Копировать Код
Public Overridable Property Dimasz As Double
 Возвращает
 Возвращает тип данных double.
 Описание
 В свойстве хранится величина стрелок в размерных линиях и выносках в формате double. В качестве значений доступны положительные вещественные числа. Значение по умолчанию 2.5.
 Свойство также доступно через системную переменную DIMASZ и пользовательское меню в окне изменения/создания размерного стиля:
  При изменении системной переменной DIMASZ будет создан новый размерный стиль под названием <переопределение> на основе текущего с новым значением DIMASZ.
 Условия
 Чтение и запись.
 Пример
 Пример изменения величины стрелок в размерных линиях и выносках (значения свойства Dimasz) в размерном стиле Standard:
C#
 Копировать Код
public partial class Commands { [Teigha.Runtime.CommandMethod("DimaszChange")] public void DimaszStandardDimStyle() { // Получение ссылки на активный документ HostMgd.ApplicationServices.Document doc = HostMgd.ApplicationServices.Application.DocumentManager.MdiActiveDocument; // Получение ссылки на редактор документа HostMgd.EditorInput.Editor ed = doc.Editor; // Получение ссылки на базу данных документа Teigha.DatabaseServices.Database db = doc.Database; // Начало транзакции с базой данных документа using (Teigha.DatabaseServices.Transaction trans = db.TransactionManager.StartTransaction()) { // Открываем таблицу размерных стилей для чтения Teigha.DatabaseServices.DimStyleTable dimStyleTable = trans.GetObject(db.DimStyleTableId, Teigha.DatabaseServices.OpenMode.ForRead) as Teigha.DatabaseServices.DimStyleTable; // Находим в таблице размерных стилей ObjectId нужного стиля по его названию Teigha.DatabaseServices.ObjectId styleId = dimStyleTable["Standard"]; // Открываем таблицу размерного стиля для изменений Teigha.DatabaseServices.DimStyleTableRecord obj = trans.GetObject(styleId, Teigha.DatabaseServices.OpenMode.ForWrite) as Teigha.DatabaseServices.DimStyleTableRecord; ed.WriteMessage($"nDimasz before: {obj.Dimasz}"); // Изменяем величину окончаний размерных линий obj.Dimasz = 10; ed.WriteMessage($"nDimasz after: {obj.Dimasz}"); trans.Commit(); } } }
 Результат работы команды DimaszChange:
 Было:
 Стало:
 Ссылки
 Teigha.DatabaseServices.DimStyleTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!