Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DxfFiler.AtEndOfFile
 Послать отзыв
 Свойство позволяет определить, находится ли в конце файла указатель этого объекта Filer.
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract bool AtEndOfFile;
Копировать Код
Public MustOverride ReadOnly Property AtEndOfFile As Boolean
 Возвращает
 Возвращает true, если указатель объекта Filer находится в конце файла. В противном случае возвращает false.
 Описание
 Свойство позволяет определить, находится ли в конце файла указатель этого объекта Filer.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.DxfFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!