Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.FlowDirection
 Послать отзыв
 Данное свойство представляет направление следования таблицы от своей первой строки к последней.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual DatabaseServices.FlowDirection FlowDirection;
Копировать Код
Public virtual Property FlowDirection() As DatabaseServices.FlowDirection
 Возвращает
 Возвращает направление следования таблицы из перечисления DatabaseServices.FlowDirection. Возможными значениями для направления являются TopToBottom (сверху вниз) и BottomToTop (снизу вверх).
 Описание
 Данное свойство представляет направление следования таблицы от своей первой строки к последней. Направление задается значениями из перечисления DatabaseServices.FlowDirection.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!