Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Событие Database.BeginWblockBlock
 Послать отзыв
 Синтаксис
C#
Visual Basic
public event BeginWblockBlockEventHandler BeginWblockBlock;
Public Event BeginWblockBlock As BeginWblockBlockEventHandler
 Описание
 Событие показывает, что начала выполняться операция клонирования wblock.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!