Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Layout.Extents
 Послать отзыв
 Предоставляет доступ к текущей настройке границ листа. Это значение может быть не фактическим размером геометрии на листе, а лишь последним сохраненным в листе значением.
 Синтаксис
C#
Visual Basic
Копировать Код
public Extents3d Extents;
Копировать Код
Public Property Extents() As Extents3d
 Возвращает
 Возвращает границы листа в виде объекта Extents3d.
 Описание
 Предоставляет доступ к текущей настройке границ листа. Это значение может быть не фактическим размером геометрии на листе, а лишь последним сохраненным в листе значением.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Layout, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!