Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CellBorders
 Послать отзыв
 Класс представляет границы ячеек таблицы.
 Иерархия классов
Teigha::DatabaseServices::CellBorders
 Синтаксис
C#
Visual Basic
Копировать Код
public class CellBorders;
Копировать Код
Public Class CellBorders
 Описание
 Класс представляет границы ячеек таблицы.
 Методы
 Конструкторы
 ПоказатьInternal
 Нет совпадений по текущему фильтру
 Имя
 Описание
 CellBorders
 This is CellBorders, a member of class CellBorders.
 Топики
 Имя
 Описание
 CellBorders Свойства
 Ниже перечислены свойства класса CellBorders.
 Ссылки
 CellBorders Свойства, Методы, Топики, CellBorders Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!