Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Rectangle3d.UpperRight
 Послать отзыв
 Свойство UpperRight представляет правую верхнюю вершину прямоугольника.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d UpperRight;
Копировать Код
Public ReadOnly Property UpperRight As Point3d
 Возвращает
 Возвращает указанную вершину прямоугольника. Тип Point3d.
 Описание
 Свойство UpperRight представляет правую верхнюю вершину прямоугольника.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Rectangle3d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!