Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AbstractViewPE.HasViewport
 Послать отзыв
 Свойство HasViewport позволяет проверить, определён ли связанный видовой экран.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool HasViewport;
Копировать Код
Public ReadOnly Property HasViewport As Boolean
 Возвращает
 Возвращает true, если связанный видовой экран определён. В противном случае возвращает false.
 Описание
 Свойство HasViewport позволяет проверить, определён ли связанный видовой экран.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.AbstractViewPE, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!