Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Polyline3d.Closed
 Послать отзыв
 Свойство позволяет определить, является ли данная полилиния замкнутой.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool Closed;
Копировать Код
Public Property Closed() As Boolean
 Возвращает
 Возвращает true, если данная полилиния является замкнутой, и false в противном случае.
 Описание
 Свойство позволяет определить, является ли данная полилиния замкнутой. Если требуется замкнуть полилинию, между последней и первой вершинами будет построен линейный сегмент, образующий замкнутый многоугольник.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Polyline3d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!