Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DwgFiler.WriteByte
 Послать отзыв
 Метод предназначен для записи заданного байта в этот объект Filer.
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract void WriteByte( Byte value );
Копировать Код
Public MustOverride Sub WriteByte( value As Byte )
 Параметры
 Параметры
 Описание
 value
 Записываемое в Filer значение. Тип byte.
 Описание
 Метод предназначен для записи в этот объект Filer заданного байта value.
 Ссылки
 Teigha.DatabaseServices.DwgFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!