Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.LinearEntity3d.IsOn
 Послать отзыв
 Метод позволяет проверить, лежит ли данный объект в указанной плоскости в пределах заданной точности.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsOn( ref Plane plane, Tolerance tolerance );
Копировать Код
Public Function IsOn( ByRef plane As Plane, tolerance As Tolerance ) As Boolean
 Параметры
 Параметры
 Описание
 plane
 Входная плоскость. Тип Plane.
 tolerance
 Заданная геометрическая точность. Тип Tolerance.
 Возвращает
 Возвращает true, если в пределах точности tolerance данный объект лежит в плоскости plane. В противном случае возвращает false.
 Описание
 Метод позволяет проверить, лежит ли данный объект в указанной плоскости в пределах заданной точности.
 Ссылки
 Teigha.Geometry.LinearEntity3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!