Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ImageBackground.MaintainAspectRatio
 Послать отзыв
 Свойство позволяет выяснить, следует ли сохранять соотношение сторон исходного изображения в данном объекте.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool MaintainAspectRatio;
Копировать Код
Public Property MaintainAspectRatio As Boolean
 Возвращает
 Возвращает true, если соотношение сторон исходного изображения должно сохраняться. В противном случае возвращает false.
 Описание
 Свойство позволяет выяснить, следует ли сохранять соотношение сторон исходного изображения в данном объекте.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.ImageBackground, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!