Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод SymbolTable.Has (String^)
 Послать отзыв
 Синтаксис
C#
Visual Basic
public bool Has(ref String key);
Public Function Has(ByRef key As String) As bool
 Параметры
 Параметры
 Описание
 key
 Имя записи для поиска
 Описание
 Этот метод возвращает true, если таблица содержит запись с именем, соответствующим key. Если соответствие не найдено, то метод возвращает false.
 Ссылки
 Teigha.DatabaseServices.SymbolTable, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!