Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.PolylineCurve3d.PolylineCurve3d
 Послать отзыв
 Конструктор класса PolylineCurve3d. Создает полилинию с указанными управляющими вершинами и узловым вектором.
 Синтаксис
C#
Visual Basic
Копировать Код
public PolylineCurve3d( ref KnotCollection knots, ref Point3dCollection controlPoints );
Копировать Код
Public Sub New( ByRef knots As KnotCollection, ByRef controlPoints As Point3dCollection )
 Параметры
 Параметры
 Описание
 knots
 Входной узловой вектор. Тип KnotCollection.
 controlPoints
 Входные управляющие вершины. Тип Point3dCollection.
 Описание
 Конструктор класса PolylineCurve3d. Создает полилинию с указанными управляющими вершинами controlPoints и узловым вектором knots.
 Ссылки
 Teigha.Geometry.PolylineCurve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!