Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.Fill
 Послать отзыв
 Метод предназначен для заполнения или удаления содержимого ячеек в заданном диапазоне путем копирования или генерации ряда.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void Fill( ref CellRange fillRange, ref CellRange sourceRange, TableFillOptions options );
Копировать Код
Public virtual Sub Fill( ByRef fillRange As CellRange, ByRef sourceRange As CellRange, options As TableFillOptions )
 Параметры
 Параметры
 Описание
 fillRange
 Диапазон заполняемых ячеек. Не должен перекрываться с диапазоном sourceRange, за исключением случаев, когда в этом диапазоне выполняется удаление содержимого ячеек. В этом случае диапазон fillRange должен полностью содержаться в диапазоне sourceRange. Тип CellRange.
 sourceRange
 Диапазон-источник для копирования данных или использования в качества шаблона. В случае очистки ячеек не обязан быть действительным. Тип CellRange.
 options
 Опции копирования из перечисления Teigha.DatabaseServices.TableFillOptions.
 Описание
 Метод предназначен для заполнения или удаления содержимого ячеек в заданном диапазоне путем копирования или генерации ряда. Аргументы метода позволяют задавать опции заполнения ячеек.
 Замечания
 Метод не реализован.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!