Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve3d.GetDistanceTo
 Послать отзыв
 Метод вычисляет минимальное расстояние между точками данной кривой и кривой, переданной в метод первым аргументом.
 Синтаксис
C#
Visual Basic
Копировать Код
public double GetDistanceTo( ref Curve3d curve );
Копировать Код
Public Function GetDistanceTo( ByRef curve As Curve3d ) As Double
 Параметры
 Параметры
 Описание
 curve
 Кривая, до которой вычисляются расстояния. Тип Curve3d.
 Возвращает
 Возвращает минимальное расстояние между кривыми. Тип double.
 Описание
 Метод вычисляет минимальное расстояние между точками данной кривой и кривой, переданной в метод первым аргументом. Вызывается метод Curve3d.GetDistanceTo(Curve3d curve, Tolerance tolerance) с допуском Tolerance.Global.
 Ссылки
 Teigha.Geometry.Curve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!