Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Ole2Frame.OutputQuality
 Послать отзыв
 Свойство представляет текущую установку качества печати для данного OLE-объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual byte OutputQuality;
Копировать Код
Public Overridable Property OutputQuality As Byte
 Возвращает
 Возвращает значение качества печати. Тип byte.
 Описание
 Свойство представляет значение качества печати, установленное для данного OLE-объекта. Качество печати влияет на глубину цвета и разрешение, используемые при выводе OLE-объекта на печать.
 Множество допустимых значений:
 Наименование
 Значение
 Описание
 kMonochrome
 0
 Монохромный вывод. Электронная таблица.
 kLowGraphics
 1
 Невысокое разрешение. Цветной текст и круговые диаграммы.
 kHighGraphics
 2
 Высокое разрешение. Фотография.
 kAutomatic
 3
 Автоматический выбор.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Ole2Frame, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!