Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод RasterImageDef.CreateImageDictionary
 Послать отзыв
 Синтаксис
C#
Visual Basic
public DatabaseServices::ObjectId CreateImageDictionary(ref DatabaseServices::Database database);
Public Function CreateImageDictionary(ByRef database As DatabaseServices.Database) As DatabaseServices.ObjectId
 Параметры
 Параметры
 Описание
 database
 База данных, в которой должен быть создан словарь
 Описание
 Вызов данного метода предназначен для создания нового словаря изображения, если метод RasterImageDef.GetImageDictionary возвращает 0, что означает, что не существует словаря изображений.
 Ссылки
 Teigha.DatabaseServices.RasterImageDef, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!