Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Viewport.Locked
 Послать отзыв
 Свойство Locked позволяет определить, заблокирован ли масштабный коэффициент в данном видовом экране.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool Locked;
Копировать Код
Public Property Locked As Boolean
 Возвращает
 Возвращает true, если масштабный коэффициент заблокирован. В противном случае возвращает false.
 Описание
 Свойство Locked позволяет определить, заблокирован ли масштабный коэффициент в данном видовом экране.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Viewport, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!