Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DataCell.SetSoftOwnershipId
 Послать отзыв
 Метод делает ячейку владельцем указанного объекта по мягкой ссылке на идентификатор зависимого объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetSoftOwnershipId( DatabaseServices.ObjectId value );
Копировать Код
Public Sub SetSoftOwnershipId( value As DatabaseServices.ObjectId )
 Параметры
 Параметры
 Описание
 value
 Входное значение для ячейки. Тип DatabaseServices.ObjectId.
 Описание
 Метод делает ячейку владельцем указанного объекта по мягкой ссылке на идентификатор зависимого объекта value.
 Ссылки
 Teigha.DatabaseServices.DataCell, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!