Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Hatch.Normal
 Послать отзыв
 Синтаксис
C#
Visual Basic
public Vector3d Normal;
Public Property Normal() As Vector3d
 Описание
 Обеспечивает доступ к вектору нормали для объекта заливки. Вектор нормали выражен в мировых координатах и нормализован к единичной длине.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Hatch, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!