Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CompositeCurve2d.LocalToGlobalParameter
 Послать отзыв
 Метод позволяет получить значение глобального параметра составной кривой, которое соответствует переданному локальному значению параметра подкривой.
 Синтаксис
C#
Visual Basic
Копировать Код
public double LocalToGlobalParameter( CompositeParameter value );
Копировать Код
Public Function LocalToGlobalParameter( value As CompositeParameter ) As Double
 Параметры
 Параметры
 Описание
 value
 Значение локального параметра подкривой. Тип CompositeParameter.
 Возвращает
 Возвращает значение параметра точки на составной кривой. Тип double.
 Описание
 Метод позволяет получить значение глобального параметра составной кривой, которое соответствует переданному локальному значению параметра подкривой.
 Ссылки
 Teigha.Geometry.CompositeCurve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!