Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CellContent.Value
 Послать отзыв
 Свойство Value предоставляет доступ к значению содержимого ячейки.
 Синтаксис
C#
Visual Basic
Копировать Код
public Object Value;
Копировать Код
Public Property Value As Object
 Возвращает
 Возвращает объект, которым представлено содержимое ячейки. Тип Object.
 Описание
 Свойство Value предоставляет доступ к текущему значению содержимого ячейки.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.CellContent, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!