Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FileDependencyManager.CreateEntry
 Послать отзыв
 Метод создает запись в разделе .dwg списка файловых зависимостей.
 Синтаксис
C#
Visual Basic
Копировать Код
public int CreateEntry( ref String feature, ref String fullFileName, bool affectsGraphics, bool noIncrement );
Копировать Код
Public Function CreateEntry( ByRef feature As String, ByRef fullFileName As String, affectsGraphics As Boolean, noIncrement As Boolean ) As Integer
 Параметры
 Параметры
 Описание
 feature
 Имя приложения или функции, создающих запись. Тип String.
 fullFileName
 Полное имя файла для записи. Тип String.
 affectsGraphics
 Флаг, который определяет, влияет ли запись на отображаемый на экране вид. Тип bool.
 noIncrement
 Флаг, который определяет, следует ли создавать дублирующие записи вместо увеличения счетчика ссылок в случае, когда запись уже существует. Тип bool.
 Возвращает
 Возвращает уникальный идентификатор списка файловых зависимостей или 0, если создать запись не удалось. Тип int.
 Описание
 Метод создает запись в разделе .dwg списка файловых зависимостей и возвращает для неё уникальный идентификатор списка файловых зависимостей.
 Ссылки
 Teigha.DatabaseServices.FileDependencyManager, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!