Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CircularArc2d.IntersectWith
 Послать отзыв
 Метод позволяет получить точки пересечения данного объекта с указанной 2D-линией.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point2d[] IntersectWith( ref LinearEntity2d line );
Копировать Код
Public Function IntersectWith( ByRef line As LinearEntity2d ) As Point2d()
 Параметры
 Параметры
 Описание
 line
 Входная 2D-линия, точки пересечения с которой требуется вычислить. Тип LinearEntity2d.
 Возвращает
 Возвращает массив точек пересечения. Тип Point2d[].
 Описание
 Метод позволяет получить точки пересечения данного объекта с указанной 2D-линией.
 Ссылки
 Teigha.Geometry.CircularArc2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!