Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Ray2d.Ray2d
 Послать отзыв
 Конструктор класса Ray2d. Создает луч с указанной точкой начала и заданным направляющим вектором.
 Синтаксис
C#
Visual Basic
Копировать Код
public Ray2d( Point2d point, Vector2d vector );
Копировать Код
Public Sub New( point As Point2d, vector As Vector2d )
 Параметры
 Параметры
 Описание
 point
 Начальная точка луча. Тип Point2d.
 vector
 Направляющий вектор луча. Тип Vector2d. Должен иметь ненулевую длину.
 Описание
 Конструктор класса Ray2d. Создает луч с началом в точке point и направляющим вектором vector.
 Ссылки
 Teigha.Geometry.Ray2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!