Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.AltSuppressZeroInches
 Послать отзыв
 Свойство позволяет управлять подавлением отображения нулевого значения целых дюймов в размере формата футы-дюймы для альтернативных единиц измерения.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool AltSuppressZeroInches;
Копировать Код
Public Property AltSuppressZeroInches As Boolean
 Возвращает
 Возвращает true, если подавление включено. В противном случае возвращает false.
 Описание
 Свойство позволяет включить или отменить подавление нулевого значения дюймов в размере формата футы-дюймы. Этот функционал работает только в случае, если для свойства Dimalt установлено значение true.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!