Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SubDMesh.SplitFace
 Послать отзыв
 Метод разрезает грань на две грани, используя две точки на разных ребрах исходной грани.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SplitFace( SubentityId subentFaceId, SubentityId subent0, Point3d point0, SubentityId subent1, Point3d point1 );
Копировать Код
Public Sub SplitFace( subentFaceId As SubentityId, subent0 As SubentityId, point0 As Point3d, subent1 As SubentityId, point1 As Point3d )
 Параметры
 Параметры
 Описание
 subentFaceId
 Идентификатор SubentityId разрезаемой грани.
 subent0
 Идентификатор SubentityId первого ребра.
 point0
 Точка Point3d на первом ребре.
 subent1
 Идентификатор SubentityId второго ребра.
 point1
 Точка Point3d на втором ребре.
 Описание
 Метод разрезает грань на две грани, используя две точки на разных ребрах исходной грани.
 Ссылки
 Teigha.DatabaseServices.SubDMesh, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!