Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeader.BlockConnectionType
 Послать отзыв
 Свойство представляет вариант соединения блока с линиями выноски в данном объекте MLeader.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.BlockConnectionType BlockConnectionType;
Копировать Код
Public Property BlockConnectionType As DatabaseServices.BlockConnectionType
 Возвращает
 Возвращает вариант соединения блока с линиями выноски из перечисления DatabaseServices.BlockConnectionType.
 Описание
 Свойство представляет вариант соединения блока с линиями выноски (по границам блока, в базовой точке).
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MLeader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!