Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotStyleData.FillStyle
 Послать отзыв
 Свойство FillStyle представляет стиль заливки в данном объекте.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.FillStyle FillStyle;
Копировать Код
Public Property FillStyle As DatabaseServices.FillStyle
 Возвращает
 Возвращает стиль заливки. Перечисление DatabaseServices.FillStyle.
 Описание
 Свойство FillStyle представляет текущий стиль заливки в данном объекте PlotStyleData.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.PlotStyleData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!