Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Dimaltu
 Послать отзыв
 Синтаксис
C#
Visual Basic
public int Dimaltu;
Public Property Dimaltu() As Integer
 Описание
 Возвращает или устанавливает текущее значение DIMALTU для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!