Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Polyline.SetStartWidthAt
 Послать отзыв
 Синтаксис
C#
Visual Basic
public void SetStartWidthAt(int index, double startWidth);
Public Sub SetStartWidthAt(index As Integer, startWidth As Double)
 Параметры
 Параметры
 Описание
 index
 Индекс (отсчитываемый от 0) вершины
 startWidth
 Значение начальной ширины вершины index
 Описание
 Этот метод устанавливает начальную ширину для вершины index.
 Ссылки
 Teigha.DatabaseServices.Polyline, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!