Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CellBorder
 Послать отзыв
 Класс CellBorder представляет границу ячейки таблицы.
 Иерархия классов
Teigha::DatabaseServices::CellBorder
 Синтаксис
C#
Visual Basic
Копировать Код
public sealed class CellBorder
Копировать Код
Public NotInheritable Class CellBorder
 Описание
 Класс CellBorder представляет границу ячейки таблицы.
 Топики
 Имя
 Описание
 CellBorder Свойства
 Ниже перечислены свойства класса CellBorder.
 Ссылки
 CellBorder Свойства, Топики, CellBorder Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!