Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.GetOverrides
 Послать отзыв
 Метод позволяет получить переопределение для указанного типа линий сетки в ячейке, строке или столбце.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual CellProperties GetOverrides( int row, int column, GridLineType gridLineType );
Копировать Код
Public virtual Function GetOverrides( row As Integer, column As Integer, gridLineType As GridLineType ) As CellProperties
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс может равняться -1.
 gridLineType
 Тип линий сетки из перечисления GridLineType.
 col
 Индекс столбца, тип int. Индекс может равняться -1.
 Возвращает
 Возвращает значение из перечисления Teigha.DatabaseServices.CellProperties.
 Описание
 Метод позволяет получить переопределение для указанного типа линий сетки в ячейке, строке или столбце.
 Чтобы указать ячейку, следует задать допустимые индексы строки и столбца. Чтобы указать строку, следует задать допустимый индекс строки и -1 в качестве индекса столбца. Чтобы указать столбец, следует задать допустимый индекс столбца и -1 в качестве индекса строки.
 Замечания
 Для получения того же результата предпочтительнее использовать Table.Cells[row,column].{Top,Bottom,Left,Right}Edge.Overrides.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!