Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DataLink.DataLinkOption
 Послать отзыв
 Свойство предоставляет доступ к опциям связи с внешними данными.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.DataLinkOption DataLinkOption;
Копировать Код
Public Property DataLinkOption() As DatabaseServices.DataLinkOption
 Возвращает
 Возвращает опции подключения к внешним данным как значение из перечисления DatabaseServices.DataLinkOption.
 Описание
 Свойство предоставляет доступ к опциям связи с внешними данными.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.DataLink, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!