Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.EllipticalCylinder.EllipticalCylinder
 Послать отзыв
 Конструктор класса EllipticalCylinder. Создает экземпляр класса с указанными точкой начала координат, малым и большим радиусами и направляющим вектором оси симметрии цилиндра.
 Синтаксис
C#
Visual Basic
Копировать Код
public EllipticalCylinder( double minorRadius, double majorRadius, Point3d origin, Vector3d axisOfSymmetry );
Копировать Код
Public Sub New( minorRadius As Double, majorRadius As Double, origin As Point3d, axisOfSymmetry As Vector3d )
 Параметры
 Параметры
 Описание
 minorRadius
 Малый радиус эллиптического цилиндра. Тип double.
 majorRadius
 Большой радиус эллиптического цилиндра. Тип double.
 origin
 Начало координат эллиптического цилиндра. Тип Point3d.
 axisOfSymmetry
 Направляющий вектор оси симметрии цилиндра. Тип Vector3d.
 Описание
 Конструктор класса EllipticalCylinder. Создает экземпляр класса с указанными точкой начала координат, малым и большим радиусами и направляющим вектором оси симметрии цилиндра.
 Ссылки
 Teigha.Geometry.EllipticalCylinder, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!