Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocArrayPathParameters.StartOffset
 Послать отзыв
 Свойство обеспечивает доступ к смещению первого элемента массива.
 Синтаксис
C#
Visual Basic
Копировать Код
public double StartOffset;
Копировать Код
Public Property StartOffset() As Double
 Возвращает
 Возвращает смещение первого элемента массива. Тип double.
 Описание
 Свойство обеспечивает доступ к смещению первого элемента массива.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.AssocArrayPathParameters, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!