Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.ExternalBoundedSurface.ExternalBoundedSurface
 Послать отзыв
 Конструктор класса ExternalBoundedSurface. Создает объект на основе указателя на определение внешней поверхности и сведений о системе, в которой было создано ее определение.
 Синтаксис
C#
Visual Basic
Копировать Код
public ExternalBoundedSurface( IntPtr surfaceDefinition, ExternalEntityKind surfaceKind );
Копировать Код
Public Sub New( surfaceDefinition As IntPtr, surfaceKind As ExternalEntityKind )
 Параметры
 Параметры
 Описание
 surfaceDefinition
 Входное определение внешней поверхности. Тип IntPtr.
 surfaceKind
 Информация о системе, в которой было создано определение внешней ограниченной поверхности. Перечисление ExternalEntityKind.
 Описание
 Конструктор класса ExternalBoundedSurface. Создает объект на основе указателя на определение внешней поверхности и сведений о системе, в которой было создано ее определение.
 Ссылки
 Teigha.Geometry.ExternalBoundedSurface, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!