Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.SetOverrides
 Послать отзыв
 Метод позволяет задать переопределение в ячейке, строке, столбце или в элементе содержимого ячейки.
 Синтаксис
C#
Visual Basic
Копировать Код
public SetOverrides( int row, int column, int contentIndex, CellProperties overrd );
Копировать Код
Public Sub SetOverrides( row As Integer, column As Integer, contentIndex As Integer, overrd As CellProperties )
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс может равняться -1.
 contentIndex
 Индекс элемента содержимого ячейки, тип int. Индекс может равняться -1.
 overrd
 Задаваемое переопределение из перечисления CellProperties.
 col
 Индекс столбца, тип int. Индекс может равняться -1.
 Описание
 Метод позволяет задать переопределение в ячейке, строке, столбце или в элементе содержимого ячейки.
 Чтобы указать элемент содержимого, передайте допустимые индексы строки, столбца и элемента содержимого ячейки. Чтобы указать ячейку, передайте допустимые индексы строки и столбца и передайте -1 в качестве индекса элемента содержимого. Чтобы указать строку, передайте допустимый индекс строки и передайте -1 в качестве индексов столбца и элемента содержимого. Чтобы указать столбец, передайте допустимый индекс столбца и передайте -1 в качестве индексов строки и элемента содержимого.
 Замечания
 Для получения того же результата предпочтительнее использовать Table.Cells[row,column].Contents[i].Overrides.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!