Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.PlanarEntity.IsPerpendicularTo
 Послать отзыв
 Метод позволяет проверить перпендикулярность данного объекта и указанного линейного объекта (в пределах точности по умолчанию).
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsPerpendicularTo( ref LinearEntity3d linearEntity );
Копировать Код
Public Function IsPerpendicularTo( ByRef linearEntity As LinearEntity3d ) As Boolean
 Параметры
 Параметры
 Описание
 linearEntity
 Входной линейный объект. Тип LinearEntity3d.
 Возвращает
 Возвращает true, если в пределах точности по умолчанию линейный объект linearEntity можно считать перпендикулярным данной плоской поверхности. В противном случае возвращает false.
 Описание
 Метод позволяет проверить перпендикулярность данного объекта и линейного объекта linearEntity.
 Используется вызов метода PlanarEntity.IsPerpendicularTo(ref LinearEntity3d linearEntity, Tolerance tolerance) с точностью, равной Tolerance.Global.
 Ссылки
 Teigha.Geometry.PlanarEntity, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!