Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Scale2d.PostMultiplyBy
 Послать отзыв
 Метод реализует векторное произведение данного объекта на указанный вектор масштабирования (данный вектор) * (rightSide).
 Синтаксис
C#
Visual Basic
Копировать Код
public Scale2d PostMultiplyBy( Scale2d rightSide );
Копировать Код
Public Function PostMultiplyBy( rightSide As Scale2d ) As Scale2d
 Параметры
 Параметры
 Описание
 rightSide
 Входной вектор масштабирования, используемый в качестве множителя. Тип Scale2d.
 Возвращает
 Возвращает результат векторного умножения. Тип Scale2d.
 Описание
 Метод сохраняет в данном объекте результат векторного произведения данного объекта на указанный вектор масштабирования (данный вектор) * (rightSide).
 Замечания
 Умножение векторов масштабирования является коммутативным.
 Ссылки
 Teigha.Geometry.Scale2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!