Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Viewport.ShadePlotId
 Послать отзыв
 Свойство ShadePlotId представляет объект тени (визуальный стиль или предопределенные настройки рендеринга), который определяет, как будет выводиться на печать текущий видовой экран.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.ObjectId ShadePlotId;
Копировать Код
Public ReadOnly Property ShadePlotId As DatabaseServices.ObjectId
 Возвращает
 Возвращает идентификатор объекта тени. Тип DatabaseServices.ObjectId.
 Описание
 Свойство ShadePlotId представляет объект тени, связанный с данным видовым экраном. Объект тени — это визуальный стиль или предопределенные настройки рендеринга, которые определяют, как будет выводиться на печать текущий видовой экран.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Viewport, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!