Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Sphere.IntersectWith
 Послать отзыв
 Метод вычисляет точки пересечения данной сферы с указанным линейным объектом. Используется точность по умолчанию.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d[] IntersectWith( ref LinearEntity3d linearEntity );
Копировать Код
Public Function IntersectWith( ByRef linearEntity As LinearEntity3d ) As Point3d()
 Параметры
 Параметры
 Описание
 linearEntity
 Линейный объект, для которого требуется определить точки пересечения с данной сферой. Тип LinearEntity3d.
 Возвращает
 Возвращает двухэлементный массив. Тип Point3d[]. Элемент с индексом 0 соответствует первой точке пересечения (если она существует), а элемент с индексом 1 - второй точке пересечения (если она существует). Метод возвращает NULL при отсутствии точек пересечения, а также если метод не смог их определить.
 Описание
 Метод вычисляет точки пересечения данной сферы с указанным линейным объектом. Используется вызов метода Sphere.IntersectWith(LinearEntity3d linearEntity, Tolerance tolerance) с точностью, равной Tolerance.Global.
 Ссылки
 Teigha.Geometry.Sphere, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!