Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.BlockInsertionPointsEventArgs.BlockTableRecord
 Послать отзыв
 Свойство предоставляет доступ к измененной записи в таблице блоков.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.BlockTableRecord BlockTableRecord;
Копировать Код
Public Property BlockTableRecord() As DatabaseServices.BlockTableRecord
 Возвращает
 Возвращает запись в таблице блоков. Тип DatabaseServices.BlockTableRecord.
 Описание
 Свойство предоставляет доступ к измененной записи в таблице блоков.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.BlockInsertionPointsEventArgs, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!