Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SweepOptions.SweepOptions
 Послать отзыв
 Конструктор по умолчанию класса SweepOptions.
 Синтаксис
C#
Visual Basic
Копировать Код
public SweepOptions();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса SweepOptions.
 Ссылки
 Teigha.DatabaseServices.SweepOptions, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!