Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SubDMesh.SetCone
 Послать отзыв
 Метод создает сеть в виде конуса с заданными размерами, количеством разделений в каждом из направлений и степенью сглаживания сети.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetCone( double majorRadius, double minorRadius, double height, int divAxis, int divHeight, int divCap, double radiusRatio, int smoothLevel );
Копировать Код
Public Sub SetCone( majorRadius As double, minorRadius As double, height As double, divAxis As Integer, divHeight As Integer, divCap As Integer, radiusRatio As double, smoothLevel As Integer )
 Параметры
 Параметры
 Описание
 majorRadius
 Большая полуось основания, double.
 minorRadius
 Малая полуось основания, double.
 height
 Высота конуса, double.
 divAxis
 Определяет, сколько разделений выполняется в основании конуса, int.
 divHeight
 Определяет, сколько разделений выполняется в направлении высоты конуса, int.
 divCap
 Определяет, сколько радиальных разделений выполняется в основании конуса, int.
 radiusRatio
 Отношение верхнего радиуса к нижнему, double.
 smoothLevel
 Степень сглаживания сети, int.
 Описание
 Метод создает сеть в виде конуса с заданными размерами, количеством разделений в каждом из направлений и степенью сглаживания сети.
 Ссылки
 Teigha.DatabaseServices.SubDMesh, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!