Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Cell.FieldId
 Послать отзыв
 Свойство обеспечивает доступ к идентификатору поля в данной ячейке.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectId FieldId;
Копировать Код
Public Property FieldId As ObjectId
 Возвращает
 Возвращает идентификатор поля. Тип ObjectId.
 Описание
 Свойство обеспечивает доступ к идентификатору поля в данной ячейке.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Cell, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!