Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ImageBackground.UseTiling
 Послать отзыв
 Свойство позволяет проверить, является ли мозаичным данный фон на основе изображения.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool UseTiling;
Копировать Код
Public Property UseTiling As Boolean
 Возвращает
 Возвращает true, если фоновое изображение выкладывается мозаикой. В противном случае возвращает false.
 Описание
 Свойство позволяет проверить, является ли мозаичным данный фон на основе изображения.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.ImageBackground, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!