Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.SplineEntity2d.NumControlPoints
 Послать отзыв
 Свойство NumControlPoints представляет количество вершин в массиве управляющих вершин данного сплайна. Не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public int NumControlPoints;
Копировать Код
Public ReadOnly Property NumControlPoints As Integer
 Возвращает
 Возвращает количество вершин в массиве управляющих вершин данного сплайна. Тип int.
 Описание
 Свойство NumControlPoints представляет количество вершин в массиве управляющих вершин данного сплайна. Не реализовано.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.SplineEntity2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!