Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 DimStyleTableRecord.Dimlfac
 Послать отзыв
 Свойство отвечает за настройку множителя расстояния для измерений в линейных размерах.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual double Dimlfac { get; set; }
Копировать Код
Public Overridable Property Dimlfac As Double
 Возвращает
 Возвращает тип данных double.
 Описание
 В свойстве хранится множитель расстояния для измерений в линейных размерах. В качестве значения свойства доступны вещественные числа. Значение по умолчанию 1.0.
 Свойство также доступно через системную переменную DIMLFAC и пользовательское меню в окне изменения/создания размерного стиля:
  При изменении системной переменной DIMLFAC будет создан новый размерный стиль под названием <переопределение> на основе текущего с новым значением DIMLFAC.
 Условия
 Чтение и запись.
 Пример
 Пример изменения множителя расстояния в линейных размерах (значения свойства Dimlfac) в размерном стиле Standard:
C#
 Копировать Код
public partial class Commands { [Teigha.Runtime.CommandMethod("DimlfacChange")] public void DimlfacStandardDimStyle() { // Получение ссылки на активный документ HostMgd.ApplicationServices.Document doc = HostMgd.ApplicationServices.Application.DocumentManager.MdiActiveDocument; // Получение ссылки на редактор документа HostMgd.EditorInput.Editor ed = doc.Editor; // Получение ссылки на базу данных документа Teigha.DatabaseServices.Database db = doc.Database; // Начало транзакции с базой данных документа using (Teigha.DatabaseServices.Transaction trans = db.TransactionManager.StartTransaction()) { // Открываем таблицу размерных стилей для чтения Teigha.DatabaseServices.DimStyleTable dimStyleTable = trans.GetObject(db.DimStyleTableId, Teigha.DatabaseServices.OpenMode.ForRead) as Teigha.DatabaseServices.DimStyleTable; // Находим в таблице размерных стилей ObjectId нужного стиля по его названию Teigha.DatabaseServices.ObjectId styleId = dimStyleTable["Standard"]; // Открываем таблицу размерного стиля для изменений Teigha.DatabaseServices.DimStyleTableRecord obj = trans.GetObject(styleId, Teigha.DatabaseServices.OpenMode.ForWrite) as Teigha.DatabaseServices.DimStyleTableRecord; ed.WriteMessage($"nDimlfac before: {obj.Dimlfac}"); // Изменяем множитель измерения линейных размеров obj.Dimlfac = 2; ed.WriteMessage($"nDimlfac after: {obj.Dimlfac}"); trans.Commit(); } } }
 Результат работы команды DimlfacChange:
 Было:
 Стало:
 Ссылки
 Teigha.DatabaseServices.DimStyleTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!