Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeaderStyle.MLeaderStyle
 Послать отзыв
 Конструктор по умолчанию класса MLeaderStyle.
 Синтаксис
C#
Visual Basic
Копировать Код
public MLeaderStyle();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса MLeaderStyle.
 Ссылки
 Teigha.DatabaseServices.MLeaderStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!