Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MText.Width
 Послать отзыв
 Свойство представляет ширину абзаца многострочного текста.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Width;
Копировать Код
Public Property Width As Double
 Возвращает
 Возвращает ширину абзаца. Тип double.
 Описание
 Свойство представляет ширину абзаца многострочного текста. Если длина отдельного слова текста превышает ширину абзаца, то такое слово не переносится, а выходит за границы абзаца.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MText, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!