Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Section.ViewingDirection
 Послать отзыв
 Свойство ViewingDirection представляет вектор направления обзора этой секущей плоскости.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d ViewingDirection;
Копировать Код
Public Property ViewingDirection As Vector3d
 Возвращает
 Возвращает направление обзора. Тип Vector3d.
 Описание
 Свойство ViewingDirection представляет вектор направления обзора этой секущей плоскости. Этот вектор перпендикулярен плоскости первого сегмента.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Section, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!