Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ExtrudedSurface.SweepVec
 Послать отзыв
 Свойство SweepVec предоставляет доступ к вектору выдавливания.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d SweepVec;
Копировать Код
Public Property SweepVec As Vector3d
 Возвращает
 Возвращает вектор выдавливания. Тип Vector3d.
 Описание
 Свойство SweepVec предоставляет доступ к вектору выдавливания Vector3d.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.ExtrudedSurface, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!