Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.PointOnCurve2d.Point
 Послать отзыв
 Свойство Point возвращает точку, которую представляет данный объект.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point2d Point;
Копировать Код
Public ReadOnly Property Point As Point2d
 Возвращает
 Возвращает точку на кривой. Тип Point2d.
 Описание
 Свойство Point возвращает точку, которую представляет данный объект.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.PointOnCurve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!