Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Visibility
 Послать отзыв
 Данное перечисление определяет константы, отражающие видимость объектов.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum Visibility { Invisible = 1, Visible = 0 }
Копировать Код
Public Enum Visibility Invisible = 1 Visible = 0 End Enum
 Члены
 Члены
 Описание
 Visible
 Значение: 0. Объект является видимым.
 Invisible
 Значение: 1. Объект является невидимым.
 Описание
 Данное перечисление определяет константы, отражающие видимость объектов.
 Ваши комментарии по поводу этого топика: Послать отзыв!