Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Filters.Index.LastUpdatedAt
 Послать отзыв
 Свойство LastUpdatedAt предоставляет доступ к временной метке по юлианскому календарю для данного объекта Index.
 Синтаксис
C#
Visual Basic
Копировать Код
public DateTime LastUpdatedAt;
Копировать Код
Public Property LastUpdatedAt As Date
 Возвращает
 Возвращает временную метку для данного индекса по юлианскому календарю. Тип DateTime.
 Описание
 Свойство LastUpdatedAt предоставляет доступ к временной метке по юлианскому календарю для данного объекта Index.
 Использует значение системной переменной TDUPDATE базы данных при последнем обновлении индекса. Полезно для проверки актуальности индексов в сохраненных чертежах. Так, если значение переменной TDUPDATE не совпадает с временной меткой LastUpdatedAt, индекс следует считать устаревшим.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Filters.Index, Teigha.DatabaseServices.Filters
 Ваши комментарии по поводу этого топика: Послать отзыв!