Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.UpdateThumbnail
 Послать отзыв
 Синтаксис
C#
Visual Basic
public int UpdateThumbnail;
Public Property UpdateThumbnail() As Integer
 Описание
 Предоставляет доступ к значению заголовка переменной UPDATETHUMBNAIL.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!