Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DataCell.SetInteger
 Послать отзыв
 Метод устанавливает для этой ячейки значение типа int.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetInteger( int value );
Копировать Код
Public Sub SetInteger( value As Integer )
 Параметры
 Параметры
 Описание
 value
 Входное значение для ячейки. Тип int.
 Описание
 Метод устанавливает для этой ячейки значение типа int, заданное входным аргументом value.
 Ссылки
 Teigha.DatabaseServices.DataCell, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!