Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Layout.TabOrder
 Послать отзыв
 Предоставляет доступ к полю, управляющему порядком отображения листов в элементе управления вкладками, которое располагается в нижней части видового экрана.
 Синтаксис
C#
Visual Basic
Копировать Код
public int TabOrder;
Копировать Код
Public Property TabOrder() As Integer
 Возвращает
 Возвращает целочисленное значение, int.
 Описание
 Предоставляет доступ к полю, управляющему порядком отображения листов в элементе управления вкладками, которое располагается в нижней части видового экрана. Последовательность отображения на вкладках листов в базе данных должна быть уникальной.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Layout, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!