Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SecurityParameters.SecurityParameters
 Послать отзыв
 Конструктор по умолчанию класса SecurityParameters.
 Синтаксис
C#
Visual Basic
Копировать Код
public SecurityParameters();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса SecurityParameters. Задает алгоритм шифрования SecurityAlgorithm.RC4 с длиной ключа 40.
 Устарел. Рекомендуется использовать другие перегрузки.
 Ссылки
 Teigha.DatabaseServices.SecurityParameters, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!