Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Light.HotspotAngle
 Послать отзыв
 Свойство возвращает угол светового пучка источника света, определяющий самую яркую его часть (наиболее яркое пятно данного источника).
 Синтаксис
C#
Visual Basic
Копировать Код
public double HotspotAngle;
Копировать Код
Public ReadOnly Property HotspotAngle As Double
 Возвращает
 Возвращает угол светового пучка (в радианах). Тип double.
 Описание
 Свойство возвращает угол светового пучка источника света, определяющий самую яркую его часть (наиболее яркое пятно данного источника).
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Light, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!