Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 LayerTableRecord.IsPlottable
 Послать отзыв
 Свойство предназначено для настройки печатаемости слоя.
 Синтаксис
C#
Visual Basic
public bool IsPlottable;
Public Property IsPlottable() As bool
 Возвращает
 Возвращает тип данных bool:
true – слой доступен для печати;
false – слой не доступен для печати.
 Описание
 С помощью свойства можно получить информацию о том, доступен слой для печати или нет и изменить значение свойства. Объекты непечатаемого слоя не выводятся на печать, но видны на экране.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.LayerTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!