Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 BlockTableRecord.GetBlockReferenceIds(bool directOnly, bool forceValidity)
 Послать отзыв
 Метод предназначен для получения коллекции ObjectId всех вставок блоков чертежа, которые ссылаются на это определение блока.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectIdCollection GetBlockReferenceIds(bool directOnly, bool forceValidity);
Копировать Код
Public Function GetBlockReferenceIds(directOnly As Boolean, forceValidity As Boolean) As ObjectIdCollection
 Параметры
 Параметры
 Описание
 directOnly
 Признак добавления в коллекцию косвенных ссылок. Если прараметр равен true, то косвенные ссылки не будут включены в коллекцию, то есть она будет состоять только из прямых ссылок.
 forceValidity
 Этот параметр применим только, если параметр directOnly = false. При значении данного параметра равным true более старые чертежи будут полностью загружены для поиска ссылок в них. Это необходимо, так как в старых чертежах эта информация не хранилась и ссылки можно найти только полностью их загрузив.
 Возвращает
 Метод возвращает коллекцию ObjectId в формате ObjectIdCollection. Note При вызове данного метода нужно решить, какое значение forceValidity будет наиболее эффективным. Например, если нужно установить Id в порядке очереди BlockReference на
 регенерацию, чтобы избежать вызова REGENALL, возможно, более дешевым будет установить forceValidity в false и выполнить REGENALL.
 Полная регенерация будет быстрее и лучше использовать память,
 чем принудительная загрузка всего файла в память. Тем не
 менее, если метод вызывается для определения циклических
 ссылок в блоках, то forceValidity должен быть установлен в
 true для того, чтобы гарантировать, что все ссылки блоков
 (потенциально циклические) будут найдены.
 Описание
 Возвращает коллекцию ObjectId блоков, которые косвенно или напрямую ссылаются на данное определение блока. В коллекцию ссылок включаются только те ссылки, которые в данный момент активны. Можно использовать метод
 getErasedBlockReferenceIds() для получения списка очищенных
 ссылок.
 Ссылки
 Teigha.DatabaseServices.BlockTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!