Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DictionaryWithDefaultDictionary.DefaultId
 Послать отзыв
 Свойство предоставляет доступ на изменение к идентификатору объекта, который является записью по умолчанию для данного словаря.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.ObjectId DefaultId;
Копировать Код
Public Property DefaultId() As DatabaseServices.ObjectId
 Возвращает
 Возвращает жесткий идентификатор записи по умолчанию данного словаря. Тип DatabaseServices.ObjectId.
 Описание
 Свойство предоставляет доступ на изменение к идентификатору объекта, который является записью по умолчанию для данного словаря.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.DictionaryWithDefaultDictionary, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!