Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObject.HasSaveVersionOverride
 Послать отзыв
 Свойство предоставляет доступ к флагу, указывающему, что объект переопределяет способ сохранения объекта в dwg-файл.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool HasSaveVersionOverride;
Копировать Код
Public Property HasSaveVersionOverride() As bool
 Возвращает
 Возвращает тип данных bool. Возвращает true, если у объекта установлен бит переопределения способа сохранения объекта.
 Описание
 Свойство предоставляет доступ к флагу, указывающему, что объект переопределяет способ сохранения объекта в dwg-файл.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.DBObject, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!