Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ObjectId.Equals
 Послать отзыв
 Возвращает true, если данный объект равен объекту в аргументе.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool Equals( ref Object obj );
Копировать Код
Public Function Equals( ByRef obj As Object ) As Boolean
 Параметры
 Параметры
 Описание
 obj
 Объект для сравнения, тип Object.
 Возвращает
 Возвращает true, если данный объект равен объекту в аргументе, иначе - false.
 Описание
 Возвращает true, если данный объект равен объекту в аргументе.
 Ссылки
 Teigha.DatabaseServices.ObjectId, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!