Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.RemoveAllOverrides
 Послать отзыв
 Метод предназначен для удаления всех переопределений в ячейке, строке или столбце.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void RemoveAllOverrides( int row, int column );
Копировать Код
Public virtual Sub RemoveAllOverrides( row As Integer, column As Integer )
 Параметры
 Параметры
 Описание
 row
 Индекс строки ячейки, тип int. Индекс может равняться -1, если интересует весь столбец.
 col
 Индекс столбца ячейки, тип int. Индекс может равняться -1, если интересует вся строка.
 Описание
 Метод удаляет все переопределения в ячейке, строке или столбце.
 Чтобы указать ячейку, следует задать допустимые индексы строки и столбца. Чтобы указать строку, следует задать допустимый индекс строки и -1 в качестве индекса столбца. Чтобы указать столбец, следует задать допустимый индекс столбца и -1 в качестве индекса строки.
 Замечания
 Для получения того же результата предпочтительнее использовать функционал объекта Cell.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!