Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbCurve3d.DeleteFitPointAt
 Послать отзыв
 Метод удаляет определяющую точку с указанным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool DeleteFitPointAt( int index );
Копировать Код
Public Function DeleteFitPointAt( index As Integer ) As Boolean
 Параметры
 Параметры
 Описание
 index
 Индекс удаляемой определяющей точки. Тип int.
 Возвращает
 Возвращает true в случае успешного удаления определяющей точки. В противном случае возвращает false.
 Описание
 Метод удаляет определяющую точку с указанным индексом.
 Ссылки
 Teigha.Geometry.NurbCurve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!