Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.HyperLinkCollection.CopyTo
 Послать отзыв
 Метод предназначен для копирования этой коллекции в указанный массив по указанному индексу.
 Синтаксис
C#
Visual Basic
Копировать Код
public void CopyTo( ref HyperLink[] arr, int index );
Копировать Код
Public Sub CopyTo( ByRef arr() As HyperLink, index As Integer )
 Параметры
 Параметры
 Описание
 arr
 Массив, в который копируется данная коллекция. Тип HyperLink[].
 index
 Индекс массива, начиная с которого в массиве сохраняются элементы коллекции. Тип int.
 Описание
 Метод предназначен для копирования этой коллекции в массив arr по указанному индексу index.
 Ссылки
 Teigha.DatabaseServices.HyperLinkCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!