Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SweepOptions
 Послать отзыв
 Класс SweepOptions предназначен для управления параметрами, которые используются при создании поверхностей и твердых тел вытягиванием по траектории такими методами как SweptSurface.CreateSweptSurface() или Solid3d.CreateSweptSolid().
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::DatabaseServices::SweepOptions
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdDbSweepOptions")] public class SweepOptions : DisposableWrapper, ICloneable
Копировать Код
<Wrapper("OdDbSweepOptions")> Public Class SweepOptions Inherits DisposableWrapper Implements ICloneable
 Описание
 Класс SweepOptions предназначен для управления параметрами, которые используются при создании поверхностей и твердых тел вытягиванием по траектории такими методами как SweptSurface.CreateSweptSurface() или Solid3d.CreateSweptSolid(). Параметры вытягивания по траектории используются для настройки формы получаемой поверхности или твердого тела.
 Методы
 Конструкторы
 Teigha.DatabaseServices.SweepOptions
 Имя
 Описание
 SweepOptions
 Это обзор перегрузок SweepOptions.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.DatabaseServices.SweepOptions
 Имя
 Описание
 SweepOptions Методы
 Ниже перечислены методы класса SweepOptions.
 SweepOptions Свойства
 Ниже перечислены свойства класса SweepOptions.
 Ссылки
 SweepOptions Конструктор, SweepOptions Методы, SweepOptions Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!