Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.HorizontalRotation
 Послать отзыв
 Свойство управляет углом поворота размера в горизонтальной плоскости (в радианах).
 Синтаксис
C#
Visual Basic
Копировать Код
public double HorizontalRotation;
Копировать Код
Public Property HorizontalRotation As Double
 Возвращает
 Возвращает угол поворота размера в горизонтальной плоскости (в радианах). Тип double.
 Описание
 Свойство задает или возвращает угол поворота размера в горизонтальной плоскости.
 Угол задается в радианах в диапазоне от 0 до 2*PI рад. Положительное значение угла определяет вращение по часовой стрелке (вправо), если смотреть вниз вдоль оси Z на начало координат. Отрицательный угол означает поворот против часовой стрелки (влево).
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!