Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SubDMesh.SetCylinder
 Послать отзыв
 Метод предназначен для создания сети в виде цилиндра.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetCylinder( double majorRadius, double minorRadius, double height, int divAxis, int divHeight, int divCap, int smoothLevel );
Копировать Код
Public Sub SetCylinder( majorRadius As double, minorRadius As double, height As double, divAxis As Integer, divHeight As Integer, divCap As Integer, smoothLevel As Integer )
 Параметры
 Параметры
 Описание
 majorRadius
 Большая полуось основания, double.
 minorRadius
 Малая полуось основания, double.
 height
 Высота цилиндра, double.
 divAxis
 Определяет количество разделений в основании цилиндра, int.
 divHeight
 Определяет количество разделений в направлении высоты цилиндра, int.
 divCap
 Определяет количество разделений в основании цилиндра, int.
 smoothLevel
 Степень сглаживания сети, int.
 Описание
 Метод предназначен для создания сети в виде цилиндра.
 Ссылки
 Teigha.DatabaseServices.SubDMesh, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!