Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.BulgeVertex
 Послать отзыв
 Класс представляет безразмерную величину прогиба сегмента полилинии, берущего начало в двумерной вершине.
 Иерархия классов
Teigha::DatabaseServices::BulgeVertex
 Синтаксис
C#
Visual Basic
Копировать Код
public class BulgeVertex;
Копировать Код
Public Class BulgeVertex
 Описание
 Класс представляет безразмерную величину прогиба сегмента полилинии, берущего начало в соответствующей двумерной вершине.
 Численно значение прогиба определяется отношением высоты сегмента круглой дуги к половине длины хорды, стягивающей эту дугу. Так, если дуга представляет собой половину окружности, то прогиб = 1. Значение 0 соответствует прямолинейному сегменту.
 Знак прогиба определяется положением дуги относительно хорды. Если дуга располагается правее хорды, значение прогиба положительно (движение по дуге против часовой стрелки), если левее хорды - отрицательно (движение по дуге по часовой стрелке).
 Методы
 Конструкторы
 Имя
 Описание
 BulgeVertex
 Конструктор класса BulgeVertex.
 Топики
 Имя
 Описание
 BulgeVertex Свойства
 Ниже перечислены свойства класса BulgeVertex.
 Ссылки
 BulgeVertex Свойства, Методы, Топики, BulgeVertex Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!