Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.EllipticalArc3d.SetAngles
 Послать отзыв
 Метод позволяет переопределить начальный и конечный углы у данной эллиптической дуги.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetAngles( double startAngle, double endAngle );
Копировать Код
Public Sub SetAngles( startAngle As Double, endAngle As Double )
 Параметры
 Параметры
 Описание
 startAngle
 Начальный угол эллиптической дуги (угловое смещение начальной точки дуги). Тип double.
 endAngle
 Конечный угол эллиптической дуги (угловое смещение конечной точки дуги). Тип double.
 Описание
 Метод позволяет переопределить начальный и конечный углы у данной эллиптической дуги.
 Замечания
 Метод проверяет, чтобы конечный угол превышал начальный, и в случае необходимости меняет местами переданные значения.
 Ссылки
 Teigha.Geometry.EllipticalArc3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!