Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Cylinder
 Послать отзыв
 Класс Cylinder представляет прямые круговые цилиндры.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Geometry::Entity3d Teigha::Geometry::Surface Teigha::Geometry::Cylinder
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdGeCylinder")] public sealed class Cylinder : Surface
Копировать Код
<Wrapper("OdGeCylinder")> Public NotInheritable Class Cylinder Inherits Surface
 Описание
 Класс Cylinder представляет прямые круговые цилиндры (цилиндры вращения).
 Прямой круговой цилиндр определяется следующими параметрами:
радиус,
ось цилиндра,
начало координат (точка на оси цилиндра),
интервал параметра U.
 Цилиндр формируется вращением образующей линии, параллельной оси симметрии и отстоящей от нее на расстоянии радиуса.
 Интервал высоты цилиндра указывается относительно начала координат цилиндра. Направление возрастания высоты цилиндра совпадает с направлением оси цилиндра. Интервал высоты может быть неограниченным.
 Цилиндр параметризуется следующим образом.
 Параметр V представляет угол поворота, который измеряется от некоторого опорного направления ReferenceAxis, перпендикулярного оси цилиндра. Для замкнутого цилиндра угол поворота определяется интервалом [-PI, +PI). Положительное направление V определяется по правилу правой руки при движении вдоль направления оси симметрии цилиндра. Цилиндрическая поверхность периодична по V с периодом 2PI.
 Параметр U изменяется вдоль образующей линии. Он безразмерен и по умолчанию измеряется в единицах радиуса. Значения U обычно возрастают в направлении оси цилиндра, но может и убывать в случае отрицательной шкалы для U. Значение U = 0 соответствует основанию цилиндра.
 Параметрическая область [umin, umax] x [vmin, vmax] определяет цилиндрическую поверхность, ограниченную двумя прямыми линиями (для углов vmin и vmax) и двумя круглыми дугами (на высотах umin и umax).
 В этом определении используются следующие ограничения:
umin < umax;
vmax - vmin| <= 2PI;
радиус > 0.
 Методы
 Конструкторы
 Teigha.Geometry.Cylinder
 Имя
 Описание
 Cylinder
 Это обзор перегрузок Cylinder.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Geometry.Entity3d
 Имя
 Описание
 Entity3d Методы
 Ниже перечислены методы класса Entity3d.
 Teigha.Geometry.Surface
 Имя
 Описание
 Surface Методы
 Ниже перечислены методы класса Surface.
 Surface Свойства
 Ниже перечислены свойства класса Surface.
 Teigha.Geometry.Cylinder
 Имя
 Описание
 Cylinder Методы
 Ниже перечислены методы класса Cylinder.
 Cylinder Свойства
 Ниже перечислены свойства класса Cylinder.
 Ссылки
 Cylinder Конструктор, Cylinder Методы, Cylinder Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!