Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GraphNodeCollection.GetEnumerator
 Послать отзыв
 Метод предоставляет объект перечислителя для данной коллекции.
 Синтаксис
C#
Visual Basic
Копировать Код
public Collections.IEnumerator GetEnumerator();
Копировать Код
Public Function GetEnumerator() As Collections.IEnumerator
 Возвращает
 Возвращает перечислитель. Тип Collections.IEnumerator.
 Описание
 Метод предоставляет объект перечислителя для данной коллекции.
 Ссылки
 Teigha.DatabaseServices.GraphNodeCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!