Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocArrayPathParameters.AssocArrayPathParameters
 Послать отзыв
 Конструктор создает новый объект класса AssocArrayPathParameters с указанными параметрами ассоциативного массива.
 Синтаксис
C#
Visual Basic
Копировать Код
public AssocArrayPathParameters( double itemSpacing, double rowSpacing, double levelSpacing, int itemCount, int rowCount, int levelCount, double rowElevation );
Копировать Код
Public Sub New( itemSpacing As Double, rowSpacing As Double, levelSpacing As Double, itemCount As Integer, rowCount As Integer, levelCount As Integer, rowElevation As Double )
 Параметры
 Параметры
 Описание
 itemSpacing
 Расстояние между элементами массива. Тип double.
 rowSpacing
 Расстояние между рядами в массиве. Тип double.
 levelSpacing
 Расстояние между уровнями в массиве. Тип double.
 itemCount
 Количество элементов в массиве. Тип int.
 rowCount
 Количество рядов в массиве. Тип int.
 levelCount
 Количество уровней в массиве. Тип int.
 rowElevation
 Приращение отметок между соседними рядами массива. Тип double.
 Описание
 Конструктор создает новый объект класса AssocArrayPathParameters с указанными параметрами ассоциативного массива.
 Ссылки
 Teigha.DatabaseServices.AssocArrayPathParameters, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!