Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ObjectIdCollection
 Послать отзыв
 Класс представляет коллекцию идентификаторов объектов ObjectId.
 Иерархия классов
Teigha::DatabaseServices::ObjectIdCollection
 Синтаксис
C#
Visual Basic
Копировать Код
[DefaultMember("Item")] [Wrapper("OdDbObjectIdArray")] public sealed class ObjectIdCollection : DisposableWrapper, IList
Копировать Код
<DefaultMember("Item")> <Wrapper("OdDbObjectIdArray")> Public NotInheritable Class ObjectIdCollection Inherits DisposableWrapper Implements IList
 Описание
 Класс представляет коллекцию идентификаторов объектов ObjectId.
 Методы
 Конструкторы
 Имя
 Описание
 ObjectIdCollection
 Это обзор перегрузок ObjectIdCollection.
 Топики
 Имя
 Описание
 ObjectIdCollection Методы
 Ниже перечислены методы класса ObjectIdCollection.
 ObjectIdCollection Свойства
 Ниже перечислены свойства класса ObjectIdCollection.
 Ссылки
 ObjectIdCollection Конструктор, ObjectIdCollection Методы, ObjectIdCollection Свойства, Методы, Топики, ObjectIdCollection Методы, ObjectIdCollection Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!