Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.UnderlayReference.Rotation
 Послать отзыв
 Свойство Rotation представляет угол поворота (в радианах) вокруг оси, определяемой точкой привязки и вектором нормали плоскости данной подложки.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Rotation;
Копировать Код
Public Property Rotation As Double
 Возвращает
 Возвращает угол поворота подложки в радианах. Тип double.
 Описание
 Свойство Rotation представляет угол поворота (в радианах) вокруг оси, определяемой точкой привязки и вектором нормали плоскости данной подложки.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.UnderlayReference, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!