Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.SetDataType
 Послать отзыв
 Метод позволяет задать тип данных, тип единицы измерения и тип строки объекта Table.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetDataType( DatabaseServices.DataType nDataType, UnitType nUnitType, int rowTypes );
Копировать Код
Public virtual Sub SetDataType( nDataType As DatabaseServices.DataType, nUnitType As UnitType, rowTypes As Integer )
 Параметры
 Параметры
 Описание
 nDataType
 Тип данных. Тип DatabaseServices.DataType.
 nUnitType
 Тип единицы измерения данных. Тип UnitType.
 rowTypes
 Тип строки объекта Table, int. См. перечисление RowType.
 Описание
 Метод позволяет задать тип данных, тип единицы измерения и тип строки объекта Table.
 Замечания
 Для получения того же результата предпочтительнее использовать Table.Cells[row,column].DataType.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!