Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObject.DecomposeForSave(DwgVersion)
 Послать отзыв
 Метод определяет поведение пользовательских объектов при сохранении в dwg-файл.
 Синтаксис
C#
Visual Basic
Копировать Код
public DecomposeForSaveReplacementRecord DecomposeForSave(DwgVersion version);
Копировать Код
Public Function DecomposeForSave(version As DwgVersion) As DecomposeForSaveReplacementRecord
 Параметры
 Параметры
 Описание
 version
 Версия, в которой файл был сохранен
 Описание
 Этот метод используется для контроля поведения пользовательских объектов и геометрических объектов при сохранении в предыдущих форматах. Пользовательский объект может в этом случае разместить свои части в других объектах с помощью добавления дополнительных данных (xdata) к созданным объектам.
 Ссылки
 Teigha.DatabaseServices.DBObject, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!