Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LayerStateManager.LayerStateToBeRestored
 Послать отзыв
 Событие создается, если состояние слоя будет восстановлено.
 Синтаксис
C#
Visual Basic
Копировать Код
public event LayerStateEventHandler LayerStateToBeRestored;
Копировать Код
Public Event LayerStateToBeRestored As LayerStateEventHandler
 Описание
 Событие создается, если состояние слоя будет восстановлено.
 Ссылки
 Teigha.DatabaseServices.LayerStateManager, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!