Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DgnUnderlayItem
 Послать отзыв
 Этот класс представляет элементы подложки DGN.
 Иерархия классов
Teigha::DatabaseServices::UnderlayItem Teigha::DatabaseServices::DgnUnderlayItem
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdDbDgnUnderlayItem")] public class DgnUnderlayItem : UnderlayItem;
Копировать Код
<Wrapper("OdDbDgnUnderlayItem")> Public Class DgnUnderlayItem Inherits UnderlayItem
 Описание
 Этот класс представляет элементы подложки DGN.
 Топики
 Имя
 Описание
 UnderlayItem Свойства
 Ниже перечислены свойства класса UnderlayItem.
 Teigha.DatabaseServices.DgnUnderlayItem
 Имя
 Описание
 DgnUnderlayItem Свойства
 Ниже перечислены свойства класса DgnUnderlayItem.
 Ссылки
 DgnUnderlayItem Свойства, Топики, UnderlayItem Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!