Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SubDMesh.SetTorus
 Послать отзыв
 Метод создает сеть в виде тора.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetTorus( double majorRadius, int divSection, int divSweepPath, double sectionRadiusRatio, double sectionRotate, int smoothLevel );
Копировать Код
Public Sub SetTorus( majorRadius As double, divSection As Integer, divSweepPath As Integer, sectionRadiusRatio As double, sectionRotate As double, smoothLevel As Integer )
 Параметры
 Параметры
 Описание
 majorRadius
 Большой радиус тора (расстояние от центра образующей окружности до оси вращения тора), double.
 divSection
 Количество разделений для образующего сечения тора, int.
 divSweepPath
 Количество разделений вдоль окружности вращения сечения тора, int.
 sectionRadiusRatio
 Отношение большого радиуса к малому, double.
 sectionRotate
 Угол поворота образующего сечения тора, double.
 smoothLevel
 Степень сглаживания сети, int.
 Описание
 Метод создает сеть в виде тора.
 Ссылки
 Teigha.DatabaseServices.SubDMesh, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!