Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObject.RemoveField()
 Послать отзыв
 Метод предназначен для удаления текстового поля объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectId RemoveField();
Копировать Код
Public Function RemoveField() As ObjectId
 Возвращает
 Возвращает Id этого поля.
 Описание
 Метод удаляет текстовое поле.
 Ссылки
 Teigha.DatabaseServices.DBObject, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!