Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Point2dCollection.IndexOf
 Послать отзыв
 Метод определяет индекс конкретного элемента в коллекции, в котором хранится указанный объект Point2d.
 Синтаксис
C#
Visual Basic
Копировать Код
public int IndexOf( Point2d p );
Копировать Код
Public Function IndexOf( p As Point2d ) As Integer
 Параметры
 Параметры
 Описание
 p
 Входной объект. Тип Point2d.
 Возвращает
 Возвращает индекс объекта p в данной коллекции. Тип int. Если объект в коллекции отсутствует, возвращается значение -1.
 Описание
 Метод определяет индекс конкретного элемента коллекции, в котором хранится указанный объект Point2d.
 Ссылки
 Teigha.Geometry.Point2dCollection, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!