Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AbstractViewPE.LensLength
 Послать отзыв
 Свойство LensLength представляет фокусное расстояние в режиме перспективного проецирования.
 Синтаксис
C#
Visual Basic
Копировать Код
public double LensLength;
Копировать Код
Public Property LensLength As Double
 Возвращает
 Возвращает значение фокусного расстояния (в мм). Тип double.
 Описание
 Свойство LensLength представляет фокусное расстояние в режиме перспективного проецирования.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.AbstractViewPE, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!