Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DxfFiler.WriteVector3d
 Послать отзыв
 Метод записывает в данный объект Filer указанный 3D-вектор и точность представления координат вектора.
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract void WriteVector3d( DxfCode opCode, Vector3d value, int precision );
Копировать Код
Public MustOverride Sub WriteVector3d( opCode As DxfCode, value As Vector3d, precision As Integer )
 Параметры
 Параметры
 Описание
 opCode
 Групповой код DXF. Тип DxfCode.
 value
 Значение, которое следует записать. Тип Vector3d.
 precision
 Количество цифр после запятой в интервале от 0 до 16. Тип int.
 Описание
 Метод записывает в данный объект Filer указанные групповой код DXF, 3D-вектор и точность представления координат вектора.
 Ссылки
 Teigha.DatabaseServices.DxfFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!