Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.GroupDictionaryId
 Послать отзыв
 Синтаксис
C#
Visual Basic
public DatabaseServices::ObjectId GroupDictionaryId;
Public Property GroupDictionaryId() As DatabaseServices.ObjectId
 Описание
 Возвращает Id группового словаря базы данных.
 Условия
 На чтение
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!