Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.GetDataType
 Послать отзыв
 Метод предназначен для получения типа данных и типа единиц для указанного индексом элемента содержимого в ячейке.
 Синтаксис
C#
Visual Basic
Копировать Код
public DataTypeParameter GetDataType(int row, int column, int contentIndex); public virtual DataTypeParameter GetDataType( int row, int column, int contentIndex );
Копировать Код
Public virtual Function GetDataType( row As Integer, column As Integer, contentIndex As Integer ) As DataTypeParameter
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 contentIndex
 Индекс элемента содержимого ячейки, тип int. Индекс должен быть больше или равен нулю и меньше количества элементов содержимого в ячейке.
 col
 Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
 Возвращает
 Возвращает тип данных в элементе в виде объекта DataTypeParameter.
 Описание
 Метод предназначен для получения типа данных и типа единиц для указанного индексом элемента содержимого в ячейке. Ячейка задается индексами строки и столбца.
 Замечания
 Для получения того же результата предпочтительнее использовать Table.Cells[row,column].Contents[i].DataType.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!