Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.UnderlayLayerCollection.Count
 Послать отзыв
 Свойство Count представляет текущее количество элементов в данной коллекции.
 Синтаксис
C#
Visual Basic
Копировать Код
public int Count;
Копировать Код
Public ReadOnly Property Count As Integer
 Возвращает
 Возвращает текущее количество элементов в коллекции. Тип int.
 Описание
 Свойство Count представляет текущее количество элементов в данной коллекции.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.UnderlayLayerCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!