Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve3d.GetProjectedClosestPointTo
 Послать отзыв
 Метод находит точку на этой кривой, которая при проецировании кривой на заданную плоскость оказывается ближайшей точкой к проекции переданной в метод точки. Метод использует указанную точность вычислений.
 Синтаксис
C#
Visual Basic
Копировать Код
public PointOnCurve3d GetProjectedClosestPointTo( Point3d point, Vector3d projectDirection, Tolerance tolerance );
Копировать Код
Public Function GetProjectedClosestPointTo( point As Point3d, projectDirection As Vector3d, tolerance As Tolerance ) As PointOnCurve3d
 Параметры
 Параметры
 Описание
 point
 Заданная внешняя точка. Тип Point3d.
 projectDirection
 Нормаль плоскости проецирования. Тип Vector3d.
 tolerance
 Точность вычислений. Тип Tolerance.
 Возвращает
 Возвращает точку на кривой. Тип PointOnCurve3d.
 Описание
 Метод находит точку на этой кривой, которая при проецировании кривой на плоскость с нормалью projectDirection оказывается ближайшей точкой к проекции заданной точки point. Метод использует указанную точность вычислений tolerance.
 Данный метод используется в основном в задачах графической визуализации, где projectDirection служит направлением взгляда. В этом случае метод возвращает точку на кривой, которая кажется ближайшей к переданной в метод точке (хотя в действительности ближайшей точкой она может и не быть).
 Ссылки
 Teigha.Geometry.Curve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!