Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.AugmentedPolylineCurve3d.ApproximateTolerance
 Послать отзыв
 Свойство ApproximateTolerance представляет точность, которая использовалась при аппроксимации данной полилинией трехмерной кривой.
 Синтаксис
C#
Visual Basic
Копировать Код
public double ApproximateTolerance;
Копировать Код
Public Property ApproximateTolerance As Double
 Возвращает
 Возвращает точность аппроксимации. Тип double.
 Описание
 Свойство ApproximateTolerance представляет точность, которая использовалась при аппроксимации данной полилинией трехмерной кривой.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.Geometry.AugmentedPolylineCurve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!