Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.BoundaryRepresentation.MeshEntity
 Послать отзыв
 Класс MeshEntity представляет базовый интерфейсный класс для объектов и подобъектов сети.
 Иерархия классов
Teigha::BoundaryRepresentation::MeshEntity
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("AcBrMeshEntity")] public class MeshEntity : DisposableWrapper;
Копировать Код
<Wrapper("AcBrMeshEntity")> Public Class MeshEntity Inherits DisposableWrapper
 Описание
 Класс MeshEntity представляет базовый интерфейсный класс для объектов и подобъектов сети.
 Замечания
 Этот класс реализован только для среды пространственного моделирования.
 Топики
 Имя
 Описание
 MeshEntity Методы
 Ниже перечислены методы класса MeshEntity.
 MeshEntity Свойства
 Ниже перечислены свойства класса MeshEntity.
 Ссылки
 MeshEntity Методы, MeshEntity Свойства, Топики, MeshEntity Методы, MeshEntity Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!