Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Light.LampColorTemp
 Послать отзыв
 Свойство представляет цветовую температуру источника в Кельвинах, если в свойстве Light.LampColorType задан тип LampColorType.Kelvin.
 Синтаксис
C#
Visual Basic
Копировать Код
public double LampColorTemp;
Копировать Код
Public Property LampColorTemp As Double
 Возвращает
 Возвращает цветовую температуру источника в Кельвинах. Тип double.
 Описание
 Свойство представляет цветовую температуру источника в Кельвинах, если в свойстве Light.LampColorType задан тип LampColorType.Kelvin.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Light, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!