Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObject.Id
 Послать отзыв
 Свойство предоставляет идентификатор объекта в базе данных чертежа.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectId Id;
Копировать Код
Public Property Id() As ObjectId
 Возвращает
 Возвращает идентификатор объекта. Тип ObjectId.
 Описание
 Возвращает значение свойства Id.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.DBObject, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!