Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Ellipse.MinorRadius
 Послать отзыв
 Свойство MinorRadius возвращает длину малой полуоси эллипса или эллиптической дуги.
 Синтаксис
C#
Visual Basic
Копировать Код
public double MinorRadius;
Копировать Код
Public ReadOnly Property MinorRadius As Double
 Возвращает
 Возвращает длину малой полуоси эллипса. Тип double.
 Описание
 Свойство MinorRadius возвращает длину малой полуоси эллипса или эллиптической дуги.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Ellipse, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!