Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Line3d.Line3d
 Послать отзыв
 Конструктор. Создает бесконечную линию по точке и вектору.
 Синтаксис
C#
Visual Basic
Копировать Код
public Line3d( Point3d point, Vector3d vector );
Копировать Код
Public Sub New( point As Point3d, vector As Vector3d )
 Параметры
 Параметры
 Описание
 point
 Входная опорная точка. Тип Point3d.
 vector
 Входной вектор, задающий ориентацию прямой в пространстве. Тип Vector3d.
 Описание
 Конструктор. Создает бесконечную линию, проходящую через точку point и имеющую направление вектора vector. Указанный вектор обязан иметь ненулевую длину.
 Ссылки
 Teigha.Geometry.Line3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!