Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MTextFragment.Extents
 Послать отзыв
 Свойство возвращает ограничивающий (габаритный) бокс данного объекта в системе координат объекта (OCS).
 Синтаксис
C#
Visual Basic
Копировать Код
public Point2d Extents;
Копировать Код
Public ReadOnly Property Extents As Point2d
 Возвращает
 Возвращает размеры двумерного ограничивающего бокса в системе координат объекта (OCS). Тип Point2d.
 Описание
 Свойство возвращает ограничивающий (габаритный) бокс данного объекта в системе координат объекта (OCS). Координаты X и Y соответствуют ширине и высоте текста, соответственно.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.MTextFragment, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!