Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.TableStyleOverrides
 Послать отзыв
 Метод получает переопределения табличных стилей.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual TableStyleOverride[] TableStyleOverrides();
Копировать Код
Public virtual Function TableStyleOverrides() As TableStyleOverride()
 Возвращает
 Возвращает массив переопределений табличных стилей. Тип TableStyleOverride[].
 Описание
 Метод получает переопределения табличных стилей объекта Table.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!