Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GraphNode.In
 Послать отзыв
 Метод позволяет получить указанную по индексу входящую ссылку данного узла GraphNode.
 Синтаксис
C#
Visual Basic
Копировать Код
public GraphNode In( int index );
Копировать Код
Public Function [In]( index As Integer ) As GraphNode
 Параметры
 Параметры
 Описание
 index
 Индекс искомой ссылки. Тип int.
 Возвращает
 Возвращает входящую ссылку данного узла. Тип GraphNode. Если индекс недействителен, возвращает нулевой указатель.
 Описание
 Метод позволяет получить указанную по индексу входящую ссылку данного узла GraphNode.
 Ссылки
 Teigha.DatabaseServices.GraphNode, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!