Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.AugmentedPolylineCurve3d.AugmentedPolylineCurve3d
 Послать отзыв
 Конструктор по умолчанию класса AugmentedPolylineCurve3d.
 Синтаксис
C#
Visual Basic
Копировать Код
public AugmentedPolylineCurve3d();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса AugmentedPolylineCurve3d. Создает объект без присвоения действительных данных.
 Ссылки
 Teigha.Geometry.AugmentedPolylineCurve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!