Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbCurve3d.MakeRational
 Послать отзыв
 Метод позволяет преобразовать данную кривую в рациональный сплайн. Каждой управляющей вершине назначается указанный вес.
 Синтаксис
C#
Visual Basic
Копировать Код
public void MakeRational( double weight );
Копировать Код
Public Sub MakeRational( weight As Double )
 Параметры
 Параметры
 Описание
 weight
 Вес, который назначается каждой управляющей вершине. Тип double.
 Описание
 Метод позволяет преобразовать данную кривую в рациональный сплайн. Каждой управляющей вершине назначается указанный вес.
 Ссылки
 Teigha.Geometry.NurbCurve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!