Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Делегат Teigha.DatabaseServices.XrefComandeeredEventHandler
 Послать отзыв
 This is type Teigha::DatabaseServices::XrefComandeeredEventHandler.
 Синтаксис
C#
Visual Basic
public delegate XrefComandeeredEventHandler();
Public Delegate Sub XrefComandeeredEventHandler()
 Ваши комментарии по поводу этого топика: Послать отзыв!