Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Line3d.Line3d
 Послать отзыв
 Конструктор. Создает бесконечную линию, проходящую через две несовпадающие точки.
 Синтаксис
C#
Visual Basic
Копировать Код
public Line3d( Point3d point1, Point3d point2 );
Копировать Код
Public Sub New( point1 As Point3d, point2 As Point3d )
 Параметры
 Параметры
 Описание
 point1
 Первая опорная точка. Тип Point3d.
 point2
 Вторая опорная точка. Тип Point3d.
 Описание
 Конструктор. Создает бесконечную линию, проходящую через две несовпадающие точки point1 и point2.
 Ссылки
 Teigha.Geometry.Line3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!