Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.NurbsData.GetControlPoints
 Послать отзыв
 Метод возвращает коллекцию управляющих вершин данного объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3dCollection GetControlPoints();
Копировать Код
Public Function GetControlPoints() As Point3dCollection
 Возвращает
 Возвращает коллекцию управляющих вершин. Тип Point3dCollection.
 Описание
 Метод возвращает коллекцию управляющих вершин данного объекта.
 Ссылки
 Teigha.DatabaseServices.NurbsData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!