Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DataLink.ConnectionString
 Послать отзыв
 Свойство предоставляет доступ к строке подключения к источнику данных.
 Синтаксис
C#
Visual Basic
Копировать Код
public String ConnectionString;
Копировать Код
Public Property ConnectionString() As String
 Возвращает
 Возвращает строку подключения. Тип String.
 Описание
 Свойство предоставляет доступ к строке подключения к источнику данных.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.DataLink, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!