Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Dimjogang
 Послать отзыв
 Синтаксис
C#
Visual Basic
public double Dimjogang;
Public Property Dimjogang() As Double
 Описание
 Устанавливает или возвращает текущий большой радиальный угол (угол пересекающегося сегмента размерной линии, представляющей собой ломаную линию размера радиуса. Ломаные линии размеров радиуса строятся в случаях, когда центр расположен за пределами страницы).
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!