Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.Format
 Послать отзыв
 Метод предназначен для получения формата ячейки, заданной индексами строки и столбца.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual String Format( int row, int col );
Копировать Код
Public virtual Function Format( row As Integer, col As Integer ) As String
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 col
 Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
 Возвращает
 Возвращает формат ячейки. Тип String.
 Описание
 Метод предназначен для получения формата ячейки, заданной индексами строки и столбца.
 Замечания
 Метод не реализован. Используйте метод Table.Cells[row,column].DataFormat.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!