Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CircularArc2d.Set
 Послать отзыв
 Метод позволяет переопределить данную дугу по трем точкам.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Set( Point2d startPoint, Point2d point, Point2d endPoint );
Копировать Код
Public Sub Set( startPoint As Point2d, point As Point2d, endPoint As Point2d )
 Параметры
 Параметры
 Описание
 startPoint
 Начальная точка дуги. Тип Point2d.
 point
 Точка на дуге. Тип Point2d.
 endPoint
 Конечная точка дуги. Тип Point2d.
 Описание
 Метод позволяет переопределить данную дугу по трем точкам.
 Ссылки
 Teigha.Geometry.CircularArc2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!