Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.UnderlayHost.DgnDocHost
 Послать отзыв
 Свойство DgnDocHost представляет текущее хост-приложение для подложки DGN, которое использует текущий документ для объектов OLE.
 Синтаксис
C#
Visual Basic
Копировать Код
public static UnderlayHost DgnDocHost;
Копировать Код
Public Shared ReadOnly Property DgnDocHost As UnderlayHost
 Возвращает
 Возвращает хост-приложение для подложки DGN. Тип UnderlayHost.
 Описание
 Свойство DgnDocHost представляет текущее хост-приложение для подложки DGN, которое использует текущий документ для объектов OLE.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.UnderlayHost, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!