Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GridLineType
 Послать отзыв
 Данное перечисление определяет типы линий сетки в таблице.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum GridLineType { AllGridLines = 63, HorizontalBottom = 4, HorizontalGridLines = 7, HorizontalInside = 2, HorizontalTop = 1, InnerGridLines = 18, InvalidGridLine = 0, OuterGridLines = 45, VerticalGridLines = 56, VerticalInside = 16, VerticalLeft = 8, VerticalRight = 32 }
Копировать Код
Public Enum GridLineType AllGridLines = 63 HorizontalBottom = 4 HorizontalGridLines = 7 HorizontalInside = 2 HorizontalTop = 1 InnerGridLines = 18 InvalidGridLine = 0 OuterGridLines = 45 VerticalGridLines = 56 VerticalInside = 16 VerticalLeft = 8 VerticalRight = 32 End Enum
 Члены
 Члены
 Описание
 InvalidGridLine
 Значение: 0. Недействительный тип линий сетки таблицы.
 HorizontalTop
 Значение: 1. Горизонтальная верхняя или нижняя линия сетки таблицы, в зависимости от направления размещения контента.
 HorizontalInside
 Значение: 2. Все горизонтальные линии сетки таблицы, за исключением самой верхней и самой нижней.
 HorizontalBottom
 Значение: 4. Горизонтальная нижняя или верхняя линия сетки таблицы, в зависимости от направления размещения контента.
 HorizontalGridLines
 Значение: 7. Все горизонтальные линии сетки таблицы (HorizontalTop | HorizontalInside | HorizontalBottom).
 VerticalLeft
 Значение: 8. Самая левая линия сетки.
 VerticalInside
 Значение: 16. Все вертикальные линии сетки, за исключением самой левой и самой правой линий.
 InnerGridLines
 Значение: 18. Внутренние типы линий сетки таблицы (HorizontalInside | VerticalInside).
 VerticalRight
 Значение: 32. Самая правая линия сетки.
 OuterGridLines
 Значение: 45. Все внешние типы линий сетки (HorizontalTop | HorizontalBottom | VerticalLeft | VerticalRight).
 VerticalGridLines
 Значение: 56. Все вертикальные линии сетки (VerticalLeft | VerticalInside | VerticalRight).
 AllGridLines
 Значение: 63. Все типы линий сетки (OuterGridLines | InnerGridLines).
 Описание
 Данное перечисление определяет типы линий сетки в таблице.
 Ваши комментарии по поводу этого топика: Послать отзыв!