Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.ClipCondition
 Послать отзыв
 Данное перечисление определяет условия обрезки.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum ClipCondition { }
Копировать Код
Public Enum ClipCondition End Enum
 Члены
 Члены
 Описание
 Invalid
 Значение: 0. Ошибка в процессе обрезки.
 AllSegmentsInside
 Граница обрезки полностью включает входные сегменты.
 SegmentsIntersect
 По меньшей мере один входной сегмент пересекает границу обрезки.
 AllSegmentsOutsideZeroWinds
 Все входные сегменты находятся за пределами границы обрезки, а граница обрезки не окружена входным многоугольником.
 AllSegmentsOutsideOddWinds
 Все входные сегменты находятся за пределами границы обрезки, а граница обрезки окружена входным многоугольником нечетное количество раз.
 AllSegmentsOutsideEvenWinds
 Все входные сегменты находятся за пределами границы обрезки, а граница обрезки окружена входным многоугольником четное количество раз.
 Описание
 Данное перечисление определяет условия обрезки.
 Ваши комментарии по поводу этого топика: Послать отзыв!