Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.SetTextHeight
 Послать отзыв
 Метод позволяет задать высоту текста в указанной ячейке данной таблицы.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetTextHeight( int row, int col, double height );
Копировать Код
Public virtual Sub SetTextHeight( row As Integer, col As Integer, height As double )
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 col
 Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
 height
 Высота текста, тип double.
 Описание
 Метод позволяет задать высоту текста в указанной ячейке данной таблицы.
 Замечания
 Для получения того же результата предпочтительнее использовать Table.Cells[row,column].TextHeight.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!