Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbCurve3d.SetEvaluateMode
 Послать отзыв
 Метод задает режим вычислений, включающий или отключающий внутреннюю оптимизацию.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetEvaluateMode( bool evaluateMode );
Копировать Код
Public Sub SetEvaluateMode( evaluateMode As Boolean )
 Параметры
 Параметры
 Описание
 evaluateMode
 Режим вычислений NURBS кривой. Тип bool. Значение true включает внутреннюю оптимизацию, а значение false её отключает.
 Описание
 Метод задает режим вычислений, включающий или отключающий внутреннюю оптимизацию.
 Замечания
 Вычисления без оптимизации обычно следует использовать, только если требуется перевычислить одно-два значения на интервал между двумя последовательными узлами. Включение оптимизации дает более высокую производительность, если вычисляются три или более значений на интервал между узлами.
 Ссылки
 Teigha.Geometry.NurbCurve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!