Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FormattedTableData.GetTextStyle
 Послать отзыв
 Метод предназначен для получения текстового стиля указанной ячейки.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual DatabaseServices.ObjectId GetTextStyle( int row, int column );
Копировать Код
Public Overridable Function GetTextStyle( row As Integer, column As Integer ) As DatabaseServices.ObjectId
 Параметры
 Параметры
 Описание
 row
 Индекс строки. Тип int. Должен быть неотрицательным и меньше количества строк в таблице.
 column
 Индекс столбца. Тип int. Должен быть неотрицательным и меньше количества столбцов в таблице.
 Возвращает
 Возвращает идентификатор текстового стиля. Тип DatabaseServices.ObjectId.
 Описание
 Метод предназначен для получения текстового стиля указанной ячейки.
 Ссылки
 Teigha.DatabaseServices.FormattedTableData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!