Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.Dimasz
 Послать отзыв
 Свойство задает длину стрелок на размерных линиях и линиях выносок.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Dimasz;
Копировать Код
Public Property Dimasz As Double
 Возвращает
 Возвращает длину стрелок. Тип double.
 Описание
 Свойство задает длину стрелок на размерных линиях и линиях выносок.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!