Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FileDependencyInfo.FileSize
 Послать отзыв
 Свойство FileSize представляет текущий размер файла.
 Синтаксис
C#
Visual Basic
Копировать Код
public int FileSize;
Копировать Код
Public ReadOnly Property FileSize As Integer
 Возвращает
 Возвращает текущий размер файла. Тип int.
 Описание
 Свойство FileSize представляет текущий размер файла.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.FileDependencyInfo, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!