Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeaderStyle.MaxLeaderSegmentsPoints
 Послать отзыв
 Свойство представляет максимальное количество точек сегментов, используемых для построения линий выносок.
 Синтаксис
C#
Visual Basic
Копировать Код
public int MaxLeaderSegmentsPoints;
Копировать Код
Public Property MaxLeaderSegmentsPoints As Integer
 Возвращает
 Возвращает количество точек сегментов. Тип int.
 Описание
 Свойство представляет максимальное количество точек сегментов, используемых для построения линий выносок.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MLeaderStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!