Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotSettingsValidator.SetPlotOrigin
 Послать отзыв
 Метод задает в настройках печати PlotSettings смещение начала координат области печати на печатаемом листе.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetPlotOrigin( ref PlotSettings plotSet, Point2d origin );
Копировать Код
Public Sub SetPlotOrigin( ByRef plotSet As PlotSettings, origin As Point2d )
 Параметры
 Параметры
 Описание
 plotSet
 Входной объект PlotSettings с настройками печати.
 origin
 Смещение начала координат. Тип Point2d.
 Описание
 Метод задает смещение начала координат области печати для указанного объекта PlotSettings. Это смещение измеряется от границ печатаемой страницы и всегда в миллиметрах независимо от единиц чертежа.
 Ссылки
 Teigha.DatabaseServices.PlotSettingsValidator, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!