Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.NurbSurface.IsRational
 Послать отзыв
 Свойство позволяет проверить, является ли данная поверхность рациональной.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsRational;
Копировать Код
Public ReadOnly Property IsRational As Boolean
 Возвращает
 Возвращает true, если поверхность является рациональной. В противном случае возвращает false.
 Описание
 Свойство позволяет проверить, является ли данная поверхность рациональной. В случае рациональной поверхности управляющим вершинам поставлены в соответствие конкретные значения весов.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.NurbSurface, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!