Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.LinearEntity3d.GetPerpendicularPlane
 Послать отзыв
 Метод предоставляет плоскость, перпендикулярную данному линейному объекту и проходящую через указанную точку.
 Синтаксис
C#
Visual Basic
Копировать Код
public Plane GetPerpendicularPlane( Point3d intersectionPoint );
Копировать Код
Public Function GetPerpendicularPlane( intersectionPoint As Point3d ) As Plane
 Параметры
 Параметры
 Описание
 intersectionPoint
 Входная произвольная точка. Тип Point3d.
 Возвращает
 Возвращает плоскость, перпендикулярную данному линейному объекту и проходящую через точку intersectionPoint. Тип Plane.
 Описание
 Метод предоставляет плоскость, перпендикулярную данному линейному объекту и проходящую через указанную точку.
 Ссылки
 Teigha.Geometry.LinearEntity3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!