Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Matrix2d.IsConformal
 Послать отзыв
 Метод позволяет проверить, представляет ли данная матрица конформное линейное преобразование. Векторы в столбцах конформной матрицы равны по длине и взаимно ортогональны.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsConformal( Matrix2dInfo info );
Копировать Код
Public Function IsConformal( info As Matrix2dInfo ) As Boolean
 Параметры
 Параметры
 Описание
 info
 Выходной объект типа Matrix2dInfo, который предоставляет информацию о масштабном коэффициенте, угле поворота, наличии зеркального отражения и направлении зеркального отражения.
 Возвращает
 Возвращает true, если геометрическое преобразование, описываемое матрицей, является конформным, т.е. векторы в столбцах матрицы равны по длине и ортогональны друг другу. В противном случае возвращает false.
 Описание
 Метод позволяет проверить, представляет ли данная матрица конформное линейное преобразование, и возвращает сведения о масштабном коэффициенте, угле поворота, наличии зеркального отражения и направлении такого отражения.
 Замечания
 Векторы в столбцах конформной матрицы равны по длине и взаимно ортогональны. Проверка ортонормированности реализована в методе Matrix2d.IsUniscaledOrtho().
 Ссылки
 Teigha.Geometry.Matrix2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!