Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SectionSettings.SetColor
 Послать отзыв
 Метод позволяет задать цвет для отображения геометрии указанного типа.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetColor( SectionType nSecType, SectionGeometry nGeometry, ref Teigha.Colors.Color color );
Копировать Код
Public Sub SetColor( nSecType As SectionType, nGeometry As SectionGeometry, ByRef color As Teigha.Colors.Color )
 Параметры
 Параметры
 Описание
 nSecType
 Тип сечения. Перечисление SectionType.
 nGeometry
 Типы элементов геометрии сечения. Перечисление SectionGeometry.
 color
 Новое значение цвета. Тип Teigha.Colors.Color.
 Описание
 Метод позволяет задать цвет для отображения геометрии указанного типа.
 Ссылки
 Teigha.DatabaseServices.SectionSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!