Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ImageBackground.ImageBackground
 Послать отзыв
 Конструктор по умолчанию класса ImageBackground.
 Синтаксис
C#
Visual Basic
Копировать Код
public ImageBackground();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса ImageBackground.
 Ссылки
 Teigha.DatabaseServices.ImageBackground, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!