Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Scale2d.ToString
 Послать отзыв
 Метод предоставляет эквивалентное строковое представление данного объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public sealed override String ToString();
Копировать Код
Public NotOverridable Overrides Function ToString() As String
 Возвращает
 Возвращает эквивалентное строковое представление данного объекта. Тип String.
 Описание
 Метод предоставляет эквивалентное строковое представление данного объекта. Возвращаемая строка содержит компоненты вектора масштабирования.
 Ссылки
 Teigha.Geometry.Scale2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!