Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PolygonMesh.IsMClosed
 Послать отзыв
 Свойство позволяет определить, является ли сеть замкнутой в направлении M.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsMClosed;
Копировать Код
Public Property IsMClosed() As Boolean
 Возвращает
 Возвращает true, если сеть является замкнутой в направлении M. В противном случае возврщает false.
 Описание
 Свойство позволяет определить, является ли сеть замкнутой в направлении M.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.PolygonMesh, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!