Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.SetTextStyleId
 Послать отзыв
 Метод задает текстовый стиль указанному элементу содержимого ячейки.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetTextStyleId( int row, int column, int contentIndex, DatabaseServices.ObjectId id );
Копировать Код
Public virtual Sub SetTextStyleId( row As Integer, column As Integer, contentIndex As Integer, id As DatabaseServices.ObjectId )
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 contentIndex
 Индекс элемента содержимого ячейки, тип int. Индекс должен быть больше или равен нулю и меньше количества элементов содержимого в ячейке.
 id
 Идентификатор текстового стиля. Тип DatabaseServices.ObjectId.
 col
 Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
 Описание
 Метод задает текстовый стиль элементу содержимого ячейки. Элемент, которому нужно изменить стиль текста, указывается его порядковым номером (индексом) в коллекции содержимого ячейки.
 Замечания
 Для получения того же результата предпочтительнее использовать Table.Cells[row,column].Contents[i].TextStyleId.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!