Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Hatch.AppendLoop (HatchLoop^)
 Послать отзыв
 Синтаксис
C#
Visual Basic
public void AppendLoop(ref HatchLoop hatchLoop);
Public Sub AppendLoop(ByRef hatchLoop As HatchLoop)
 Параметры
 Параметры
 Описание
 hatchLoop
 Тип петли
 Описание
 Этот метод добавляет новую петлю контура (полилинию) объекта заливки.
 Ссылки
 Teigha.DatabaseServices.Hatch, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!