Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Filters.IndexUpdateData.GetIdData
 Послать отзыв
 Устарел - Используйте вместо него метод GetIdDataPtr.
 Метод позволяет получить 32-битные данные, связанные с указанным идентификатором объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
[Obsolete("Use System.IntPtr GetIdDataPtr)")] public int GetIdData( ObjectId id );
Копировать Код
<Obsolete("Use System.IntPtr GetIdDataPtr)")> Public Function GetIdData( id As ObjectId ) As Integer
 Параметры
 Параметры
 Описание
 id
 Входной идентификатор объекта. Тип ObjectId.
 Возвращает
 Возвращает целое число. Тип int.
 Описание
 Устарел - Используйте вместо него метод GetIdDataPtr.
 Метод позволяет получить 32-битные данные, связанные с указанным идентификатором объекта ObjectId.
 Ссылки
 Teigha.DatabaseServices.Filters.IndexUpdateData, Teigha.DatabaseServices.Filters
 Ваши комментарии по поводу этого топика: Послать отзыв!