Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObject.AddPersistentReactor(ObjectId)
 Послать отзыв
 Метод предназначен для добавления указанного постоянного реактора в список реакторов этого объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public void AddPersistentReactor(ObjectId objId);
Копировать Код
Public Sub AddPersistentReactor(objId As ObjectId)
 Параметры
 Параметры
 Описание
 objId
 Идентификатор объекта постоянного реактора
 Описание
 Метод добавляет указанный постоянный реактор в список реакторов этого объекта.
 Замечания
 Перед использованием этого метода, объект должен быть открыт в режиме ForWrite.
 Если у постоянного реактора нет владельца, он не сохраняется вместе с чертежом. Неграфические объекты, используемые в качестве постоянных реакторов, обычно хранятся в словаре в NamedObjectsDictionary или в словаре расширений, связанном с объектом.
 Ссылки
 Teigha.DatabaseServices.DBObject, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!