Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SweepOptionsBuilder
 Послать отзыв
 Класс SweepOptionsBuilder предназначен для настройки параметров, используемых методами SweptSurface.CreateSweptSurface() и Solid3d.CreateSweptSolid().
 Иерархия классов
Teigha::DatabaseServices::SweepOptionsBuilder
 Синтаксис
C#
Visual Basic
Копировать Код
public class SweepOptionsBuilder
Копировать Код
Public Class SweepOptionsBuilder
 Описание
 Класс SweepOptionsBuilder предназначен для настройки параметров, используемых методами SweptSurface.CreateSweptSurface() и Solid3d.CreateSweptSolid(). Опции влияют на геометрическую форму создаваемой поверхности или твердого тела.
 Методы
 Конструкторы
 Имя
 Описание
 SweepOptionsBuilder
 Это обзор перегрузок SweepOptionsBuilder.
 Топики
 Имя
 Описание
 SweepOptionsBuilder Методы
 Ниже перечислены методы класса SweepOptionsBuilder.
 SweepOptionsBuilder Свойства
 Ниже перечислены свойства класса SweepOptionsBuilder.
 Ссылки
 SweepOptionsBuilder Конструктор, SweepOptionsBuilder Методы, SweepOptionsBuilder Свойства, Методы, Топики, SweepOptionsBuilder Методы, SweepOptionsBuilder Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!