Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.BoundBlock3d.Set
 Послать отзыв
 Метод позволяет задать базовую точку и стороны граничной рамки с геометрией в виде параллелепипеда.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Set( Point3d basePoint, Vector3d dir1, Vector3d dir2, Vector3d dir3 );
Копировать Код
Public Sub Set( basePoint As Point3d, dir1 As Vector3d, dir2 As Vector3d, dir3 As Vector3d )
 Параметры
 Параметры
 Описание
 basePoint
 Входная базовая точка граничной рамки. Тип Point3d.
 dir1
 Первая сторона параллелепипеда. Тип Vector3d.
 dir2
 Вторая сторона параллелепипеда. Тип Vector3d.
 dir3
 Третья сторона параллелепипеда. Тип Vector3d.
 Описание
 Метод позволяет задать базовую точку и стороны граничной рамки с геометрией в виде параллелепипеда.
 Ссылки
 Teigha.Geometry.BoundBlock3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!