Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ObjectErasedEventArgs.Erased
 Послать отзыв
 Свойство позволяет проверить, является ли указанный объект удалённым.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool Erased;
Копировать Код
Public ReadOnly Property Erased As Boolean
 Возвращает
 Возвращает true, если объект считается удалённым. В противном случае возвращает false.
 Описание
 Свойство позволяет проверить, является ли указанный объект удалённым.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.ObjectErasedEventArgs, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!