Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод RasterImage.SetClipBoundary (Vector2d)
 Послать отзыв
 Синтаксис
C#
Visual Basic
public void SetClipBoundary(Vector2d size);
Public Sub SetClipBoundary(size As Vector2d)
 Параметры
 Параметры
 Описание
 size
 Вектор контура
 Описание
 Определяет многоугольный контур изображения. Контур изображения должен быть замкнут, т.е. его последняя точка должна совпадать с первой точкой. Значение type должно соответствовать форме точек в массиве.
 Ссылки
 Teigha.DatabaseServices.RasterImage, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!