Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DimensionCenterMarkType
 Послать отзыв
 Данное перечисление определяет режимы автоматического создания маркера центра и центровых линий для размеров радиуса и диаметра.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum DimensionCenterMarkType { Line = 1, Mark = 0, None = 2 }
Копировать Код
Public Enum DimensionCenterMarkType Line = 1 Mark = 0 None = 2 End Enum
 Члены
 Члены
 Описание
 Line
 Значение: 1. Линия. Включен режим автоматического создания центровых линий.
 Mark
 Значение: 0. Маркер. Включен режим автоматического создания маркера центра.
 None
 Значение: 2. Нет. Автоматическое создание маркера центра и центровых линий отключено.
 Описание
 Данное перечисление определяет режимы автоматического создания маркера центра и центровых линий для размеров радиуса и диаметра.
 Ваши комментарии по поводу этого топика: Послать отзыв!