Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Событие Database.ObjectUnappended
 Послать отзыв
 Синтаксис
C#
Visual Basic
public event ObjectEventHandler ObjectUnappended;
Public Event ObjectUnappended As ObjectEventHandler
 Описание
 Событие возникает, когда добавление объекта в базу данных отменяется по команде Undo.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!