Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.GetCellExtents
 Послать отзыв
 Метод предназначен для определения габаритов указанной ячейки.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void GetCellExtents( int row, int col, bool isOuterCell, ref Point3dCollection pts );
Копировать Код
Public virtual Sub GetCellExtents( row As Integer, col As Integer, isOuterCell As Boolean, ByRef pts As Point3dCollection )
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 col
 Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
 isOuterCell
 Флаг, указывающий, является ли указанная ячейка внешней ячейкой. Тип bool.
 pts
 Коллекция 3D-точек вершин ячейки, дает представление о габаритах ячейки. Тип Point3dCollection.
 Описание
 Метод предназначен для определения габаритов ячейки, заданной индексами строки и столбца.
 Замечания
 Для получения того же результата предпочтительнее использовать метод Table.Cells[row,column].GetExtents.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!