Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeader.Normal
 Послать отзыв
 Свойство представляет вектор нормали плоскости, в которой располагается данная мультивыноска.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d Normal;
Копировать Код
Public ReadOnly Property Normal As Vector3d
 Возвращает
 Возвращает вектор нормали плоскости. Тип Vector3d.
 Описание
 Свойство представляет вектор нормали плоскости, в которой располагается данная мультивыноска.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.MLeader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!