Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SecurityParameters.Algorithm
 Послать отзыв
 Свойство Algorithm представляет используемый алгоритм шифрования.
 Синтаксис
C#
Visual Basic
Копировать Код
public SecurityAlgorithm Algorithm;
Копировать Код
Public Property Algorithm As SecurityAlgorithm
 Возвращает
 Возвращает алгоритм шифрования. Перечисление SecurityAlgorithm.
 Описание
 Свойство Algorithm представляет используемый алгоритм шифрования.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.SecurityParameters, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!