Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Pdmode
 Послать отзыв
 Синтаксис
C#
Visual Basic
public int Pdmode;
Public Property Pdmode() As Integer
 Описание
 Возвращает или устанавливает текущее значение PDMODE для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!