Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Filters.SpatialFilter.SpatialFilter
 Послать отзыв
 Конструктор класса SpatialFilter по умолчанию..
 Синтаксис
C#
Visual Basic
Копировать Код
public SpatialFilter();
Копировать Код
Public Sub New()
 Описание
 Конструктор класса SpatialFilter по умолчанию.
 Ссылки
 Teigha.DatabaseServices.Filters.SpatialFilter, Teigha.DatabaseServices.Filters
 Ваши комментарии по поводу этого топика: Послать отзыв!