Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CompoundObjectId.SetEmpty
 Послать отзыв
 Метод позволяет задать данный объект CompoundObjectId как пустой идентификатор составного объекта, не имеющий каких-либо данных.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetEmpty();
Копировать Код
Public Sub SetEmpty()
 Описание
 Метод позволяет задать данный объект CompoundObjectId как пустой идентификатор составного объекта, не имеющий каких-либо данных.
 Ссылки
 Teigha.DatabaseServices.CompoundObjectId, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!