Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.UnitsConverter.GetConversionFactor
 Послать отзыв
 Метод позволяет вычислить коэффициент преобразования между единицами измерения блока и единицами текущего чертежа.
 Синтаксис
C#
Visual Basic
Копировать Код
public static double GetConversionFactor( UnitsValue from, UnitsValue to );
Копировать Код
Public Shared Function GetConversionFactor( from As UnitsValue, [to] As UnitsValue ) As Double
 Параметры
 Параметры
 Описание
 from
 Исходные единицы измерения. Перечисление UnitsValue.
 to
 Целевые единицы измерения. Перечисление UnitsValue.
 Возвращает
 Возвращает коэффициент преобразования между заданными единицами измерения. Тип double.
 Описание
 Метод позволяет вычислить коэффициент преобразования между единицами измерения блока и единицами текущего чертежа.
 Ссылки
 Teigha.DatabaseServices.UnitsConverter, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!