Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.ExternalCurve3d.Set
 Послать отзыв
 Метод позволяет переопределить параметры данного объекта, используя указатель на определение внешнего объекта и его тип.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Set( IntPtr curveDef, ExternalEntityKind curveKind );
Копировать Код
Public Sub Set( curveDef As IntPtr, curveKind As ExternalEntityKind )
 Параметры
 Параметры
 Описание
 curveDef
 Указатель на определение внешней кривой. Тип IntPtr.
 curveKind
 Информация о системе, в которой было создано определение внешнего объекта. Тип ExternalEntityKind.
 Описание
 Метод позволяет переопределить параметры данного объекта, используя указатель на определение внешнего объекта и его тип. Если текущий экземпляр определен и является владельцем данных своего определения, то существующее определение будет удалено.
 Ссылки
 Teigha.Geometry.ExternalCurve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!