Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CubicSplineCurve2d.SetFitPointAt
 Послать отзыв
 Метод позволяет переопределить в этом сплайне определяющую точку с указанным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetFitPointAt( int index, Point2d point );
Копировать Код
Public Sub SetFitPointAt( index As Integer, point As Point2d )
 Параметры
 Параметры
 Описание
 index
 Индекс определяющей точки. Тип int.
 point
 Новые координаты определяющей точки с индексом index. Тип Point2d.
 Описание
 Метод позволяет переопределить в этом сплайне определяющую точку с указанным индексом.
 Ссылки
 Teigha.Geometry.CubicSplineCurve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!