Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.Dimapost
 Послать отзыв
 Свойство определяет префикс или суффикс размерного текста (или и то, и другое) при использовании альтернативных единиц измерения.
 Синтаксис
C#
Visual Basic
Копировать Код
public String Dimapost;
Копировать Код
Public Property Dimapost As String
 Возвращает
 Возвращает префикс или суффикс размерного текста. Тип String.
 Описание
 Свойство определяет префикс или суффикс размерного текста (или и то, и другое) при использовании альтернативных единиц измерения.
 Dimpost имеет вид prefix<>suffix. Подстрока '<>' в Dimpost заменяется текстом размера в альтернативных единицах измерения.
 Это свойство действует при условии, что для свойства Dimalt установлено значение true.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!