Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор ObjectIterator.ObjectIterator
 Послать отзыв
 This is ObjectIterator, a member of class ObjectIterator.
 Синтаксис
C#
Visual Basic
internal ObjectIterator(IntPtr unmanagedPointer, bool autoDelete);
Friend Sub New(unmanagedPointer As IntPtr, autoDelete As bool)
 Ссылки
 ObjectIterator Класс, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!