Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ExposureType
 Послать отзыв
 Данное перечисление определяет поддерживаемые типы управления экспозицией при рендеринге.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum ExposureType { Automatic = 0, Logarithmic = 1 }
Копировать Код
Public Enum ExposureType Automatic = 0 Logarithmic = 1 End Enum
 Члены
 Члены
 Описание
 Automatic
 Значение: 0. Автоматический тип управления экспозицией.
 Logarithmic
 Значение: 1. Логарифмический тип управления экспозицией.
 Описание
 Данное перечисление определяет поддерживаемые типы управления экспозицией при рендеринге.
 Ваши комментарии по поводу этого топика: Послать отзыв!