Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GraphNodeCollection.RemoveAt
 Послать отзыв
 Метод удаляет из коллекции элемент по указанному индексу.
 Синтаксис
C#
Visual Basic
Копировать Код
public void RemoveAt( int index );
Копировать Код
Public Sub RemoveAt( index As Integer )
 Параметры
 Параметры
 Описание
 index
 Индекс удаляемого элемента коллекции. Тип int.
 Описание
 Метод удаляет из коллекции элемент по указанному индексу. Если предоставленный индекс недействителен, метод выбрасывает исключение ArgumentOutOfRangeException.
 Ссылки
 Teigha.DatabaseServices.GraphNodeCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!