Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Handle.IsOne
 Послать отзыв
 Возвращает true, если значение дескриптора у этого объекте равно 1.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsOne;
Копировать Код
Public Property IsOne() As Boolean
 Возвращает
 Возвращает true, если значение дескриптора у этого объекте равно 1, и false в противном случае.
 Описание
 Возвращает true, если значение дескриптора у этого объекте равно 1.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Handle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!