Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.RasterVariables.ImageFrame
 Послать отзыв
 Свойство ImageFrame представляет переменную, которая определяет тип отображения рамки изображения.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual FrameSetting ImageFrame;
Копировать Код
Public Overridable Property ImageFrame As FrameSetting
 Возвращает
 Возвращает тип отображения рамки. Значение из перечисления FrameSetting.
 Описание
 Свойство ImageFrame представляет переменную, которая определяет тип отображения рамки изображения.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.RasterVariables, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!