Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GripData.CallTooltip
 Послать отзыв
 Метод вызывает подсказку данной ручки.
 Синтаксис
C#
Visual Basic
Копировать Код
public String CallTooltip();
Копировать Код
Public Function CallTooltip() As String
 Возвращает
 Возвращает строку подсказки ручки. Тип String.
 Описание
 Метод вызывает подсказку данной ручки.
 Ссылки
 Teigha.DatabaseServices.GripData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!