Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Hatch.InsertLoopAt (int, HatchLoopTypes, ObjectIdCollection^)
 Послать отзыв
 Синтаксис
C#
Visual Basic
public void InsertLoopAt(int loopIndex, HatchLoopTypes loopType, ref ObjectIdCollection dbObjIds);
Public Sub InsertLoopAt(loopIndex As Integer, loopType As HatchLoopTypes, ByRef dbObjIds As ObjectIdCollection)
 Параметры
 Параметры
 Описание
 loopIndex
 Индекс вставляемой петли
 loopType
 Тип петли
 dbObjIds
 Множество Id объектов
 Описание
 Метод вставляет новую петлю контура (путь или полилинию) в объект заливки. Параметр loopIndex задает индекс, под которым петля будет вставлена в список петель контура заливки. hatchLoop задает тип петли. dbObjIds представляет множество Id объектов, которые составляют петлю контура. Id объектов будут использоваться, если объект заливки является ассоциированным.
 Ссылки
 Teigha.DatabaseServices.Hatch, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!