Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Extents2d.MaxPoint
 Послать отзыв
 Свойство обеспечивает доступ к максимальной точке данного объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point2d MaxPoint;
Копировать Код
Public ReadOnly Property MaxPoint As Point2d
 Возвращает
 Возвращает максимальную точку данного объекта. Тип Point2d.
 Описание
 Свойство обеспечивает доступ к максимальной точке данного объекта.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Extents2d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!