Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SweepOptionsCheckSweepCurveOut.Closed
 Послать отзыв
 Свойство Closed позволяет проверить, является ли вытянутый объект замкнутым.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool Closed;
Копировать Код
Public ReadOnly Property Closed As Boolean
 Возвращает
 Возвращает true, если вытянутый по траектории объект является замкнутым. В противном случае возвращает false.
 Описание
 Свойство Closed позволяет проверить, является ли вытянутый объект замкнутым.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.SweepOptionsCheckSweepCurveOut, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!