Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector3d.Subtract
 Послать отзыв
 Метод реализует вычитание указанного вектора из данного вектора.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d Subtract( Vector3d v );
Копировать Код
Public Function Subtract( v As Vector3d ) As Vector3d
 Параметры
 Параметры
 Описание
 v
 Вычитаемый вектор. Тип Vector3d.
 Возвращает
 Возвращает результат векторного вычитания. Тип Vector3d.
 Описание
 Метод реализует вычитание указанного вектора v из данного вектора.
 Ссылки
 Teigha.Geometry.Vector3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!