Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.NurbSurface.NurbSurface
 Послать отзыв
 Конструктор по умолчанию класса NurbSurface.
 Синтаксис
C#
Visual Basic
Копировать Код
public NurbSurface();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса NurbSurface.
 Ссылки
 Teigha.DatabaseServices.NurbSurface, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!