Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CurveBoundaryData.GetCurve2ds
 Послать отзыв
 Метод предоставляет массив 2D-кривых в параметрическом пространстве для данного объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public Curve2d[] GetCurve2ds();
Копировать Код
Public Function GetCurve2ds() As Curve2d()
 Возвращает
 Возвращает массив 2D-кривых для данного объекта. Тип Curve2d[].
 Описание
 Метод предоставляет массив 2D-кривых в параметрическом пространстве для данного объекта.
 Ссылки
 Teigha.Geometry.CurveBoundaryData, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!