Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Entity3d.ScaleBy
 Послать отзыв
 Метод масштабирует данный объект на заданную величину относительно указанной точки.
 Синтаксис
C#
Visual Basic
Копировать Код
public void ScaleBy( double scaleFactor, Point3d point );
Копировать Код
Public Sub ScaleBy( scaleFactor As Double, point As Point3d )
 Параметры
 Параметры
 Описание
 scaleFactor
 Коэффициент изменения масштаба объекта. Тип double.
 point
 Точка, относительно которой выполняется масштабирование объекта. Тип Point3d.
 Описание
 Метод масштабирует данный объект на заданную величину относительно указанной точки.
 Ссылки
 Teigha.Geometry.Entity3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!