Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotSettings.PrintLineweights
 Послать отзыв
 Свойство PrintLineweights позволяет определить, печатаются ли веса линий для этого объекта PlotSettings.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool PrintLineweights;
Копировать Код
Public Property PrintLineweights As Boolean
 Возвращает
 Возвращает true, если веса линий печатаются. В противном случае возвращает false.
 Описание
 Свойство PrintLineweights позволяет определить, печатаются ли веса линий для этого объекта PlotSettings.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.PlotSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!