Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Dimltex1
 Послать отзыв
 Синтаксис
C#
Visual Basic
public DatabaseServices::ObjectId Dimltex1;
Public Property Dimltex1() As DatabaseServices.ObjectId
 Описание
 Возвращает Id типа линии для выносной линии 1.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!