Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Point2dCollection.Point2dCollection
 Послать отзыв
 Конструктор класса Point2dCollection. Создает новую коллекцию, заполненную объектами Point2d из указанного массива.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point2dCollection( ref Point2d[] values );
Копировать Код
Public Sub New( ByRef values() As Point2d )
 Параметры
 Параметры
 Описание
 values
 Входной массив. Тип Point2d[].
 Описание
 Конструктор класса Point2dCollection. Создает новую коллекцию, заполненную объектами Point2d из указанного массива values.
 Ссылки
 Teigha.Geometry.Point2dCollection, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!