Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Material.GlobalIllumination
 Послать отзыв
 Свойство представляет текущий режим общего освещения для этого материала.
 Синтаксис
C#
Visual Basic
Копировать Код
public GraphicsInterface.GlobalIlluminationMode GlobalIllumination;
Копировать Код
Public Property GlobalIllumination As GraphicsInterface.GlobalIlluminationMode
 Возвращает
 Возвращает режим общего освещения. Перечисление GraphicsInterface.GlobalIlluminationMode.
 Описание
 Свойство представляет текущий режим общего освещения для этого материала.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Material, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!