Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FileDependencyManager.IteratorNext
 Послать отзыв
 Свойство IteratorNext представляет индекс следующей записи в разделе .dwg списка файловых зависимостей.
 Синтаксис
C#
Visual Basic
Копировать Код
public int IteratorNext;
Копировать Код
Public ReadOnly Property IteratorNext As Integer
 Возвращает
 Возвращает индекс следующей записи. Тип int.
 Описание
 Свойство IteratorNext представляет индекс следующей записи в разделе .dwg списка файловых зависимостей. Возвращаемое значение может использоваться в методах GetEntry() и EraseEntry().
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.FileDependencyManager, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!