Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.BoundBlock3d.GetMaximumPoint
 Послать отзыв
 Метод предоставляет максимальную точку данной граничной рамки.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d GetMaximumPoint();
Копировать Код
Public Function GetMaximumPoint() As Point3d
 Возвращает
 Возвращает экземпляр класса Point3d, который представляет максимальную точку граничной рамки.
 Описание
 Метод предоставляет максимальную точку данной граничной рамки.
 Ссылки
 Teigha.Geometry.BoundBlock3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!