Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbSurfaceDefinition.DegreeInV
 Послать отзыв
 Свойство DegreeInV представляет степень сплайна в направлении V.
 Синтаксис
C#
Visual Basic
Копировать Код
public int DegreeInV;
Копировать Код
Public ReadOnly Property DegreeInV As Integer
 Возвращает
 Возвращает степень сплайна в направлении V. Тип int.
 Описание
 Свойство DegreeInV представляет степень сплайна в направлении V.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.NurbSurfaceDefinition, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!