Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SubentRef
 Послать отзыв
 Класс SubentRef представляет ссылку на подобъект.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::DatabaseServices::GeomRef Teigha::DatabaseServices::SubentRef
 Синтаксис
C#
Visual Basic
Копировать Код
[TypeDescriptionProvider("Teigha.ComponentModel.TypeDescriptionProvider`1[[Teigha.DatabaseServices.SubentRef, TD_MgdDbConstraints]], TD_MgdDbConstraints")] [Wrapper("AcDbSubentRef")] public abstract class SubentRef : GeomRef
Копировать Код
<TypeDescriptionProvider("Teigha.ComponentModel.TypeDescriptionProvider`1[[Teigha.DatabaseServices.SubentRef, TD_MgdDbConstraints]], TD_MgdDbConstraints"), Teigha.Runtime.Wrapper("AcDbSubentRef")> Public Class SubentRef Inherits GeomRef
 Описание
 Класс SubentRef представляет ссылку на подобъект.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.DatabaseServices.GeomRef
 Имя
 Описание
 GeomRef Методы
 Ниже перечислены методы класса GeomRef.
 GeomRef Свойства
 Ниже перечислены свойства класса GeomRef.
 Teigha.DatabaseServices.SubentRef
 Имя
 Описание
 SubentRef Методы
 Ниже перечислены методы класса SubentRef.
 SubentRef Свойства
 Ниже перечислены свойства класса SubentRef.
 Ссылки
 SubentRef Методы, SubentRef Свойства, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!