Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.OsnapPointRef.UpdateDueToMirror
 Послать отзыв
 Метод обновляет состояние данного объекта при зеркальном отражении.
 Синтаксис
C#
Visual Basic
Копировать Код
public override void UpdateDueToMirror( bool inMirror );
Копировать Код
Public Overrides Sub UpdateDueToMirror( inMirror As Boolean )
 Параметры
 Параметры
 Описание
 inMirror
 Флаг, определяющий, находится ли данный объект в зеркально отраженном состоянии. Тип bool.
 Описание
 Метод обновляет состояние данного объекта при зеркальном отражении.
 Ссылки
 Teigha.DatabaseServices.OsnapPointRef, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!