Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.GetBlockAttributeValue
 Послать отзыв
 Метод предназначен для получения значения атрибута блока, если элемент по указанному индексу содержимого ячейки является блоком с атрибутами.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual String GetBlockAttributeValue( int row, int column, int contentIndex, DatabaseServices.ObjectId attDefId );
Копировать Код
Public virtual Function GetBlockAttributeValue( row As Integer, column As Integer, contentIndex As Integer, attDefId As DatabaseServices.ObjectId ) As String
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 contentIndex
 Индекс элемента содержимого ячейки. Индекс должен быть больше или равен нулю и меньше количества элементов содержимого в ячейке.
 col
 Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
 attributeDefinitionId
 Идентификатор определения атрибута. Тип DatabaseServices.ObjectId.
 Возвращает
 Возвращает значение атрибута блока как объект String.
 Описание
 Метод предназначен для получения значения атрибута блока, если элемент по указанному индексу содержимого ячейки является блоком с атрибутами. Ячейка задается индексами строки и столбца.
 Замечания
 Для получения того же результата предпочтительнее использовать Table.Cells[row,column].Contents[i].GetBlockAttributeValue.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!