Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotStyleDescriptor.Type
 Послать отзыв
 Свойство предоставляет доступ к имени стиля печати.
 Синтаксис
C#
Visual Basic
Копировать Код
public PlotStyleNameType Type;
Копировать Код
Public Property Type() As PlotStyleNameType
 Возвращает
 Возвращает имя стиля печати. Тип PlotStyleNameType.
 Описание
 Свойство предоставляет доступ к имени стиля печати.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.PlotStyleDescriptor, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!