Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AbstractViewportData.IsSnapOn
 Послать отзыв
 Свойство IsSnapOn позволяет определить, включен ли в видовом экране режим шаговой привязки.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsSnapOn;
Копировать Код
Public Property IsSnapOn As Boolean
 Возвращает
 Возвращает true, если режим шаговой привязки включен. В противном случае возвращает false.
 Описание
 Свойство IsSnapOn позволяет определить, включен ли в видовом экране режим шаговой привязки.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.AbstractViewportData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!