Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.BoundaryRepresentation.Mesh2dControl
 Послать отзыв
 Интерфейсный класс Mesh2dControl представляет элементы управления 2D-сетью Mesh2d.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::BoundaryRepresentation::MeshControl Teigha::BoundaryRepresentation::Mesh2dControl
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("AcBrMesh2dControl")] public class Mesh2dControl : MeshControl;
Копировать Код
<Wrapper("AcBrMesh2dControl")> Public Class Mesh2dControl Inherits MeshControl
 Описание
 Интерфейсный класс Mesh2dControl представляет элементы управления 2D-сетью Mesh2d. Он определяет конкретный функционал настройки элементов управления для генерации 2D-сетей.
 Замечания
 Этот класс реализован только в среде пространственного моделирования.
 Методы
 Конструкторы
 Teigha.BoundaryRepresentation.Mesh2dControl
 Имя
 Описание
 Mesh2dControl
 Конструктор по умолчанию класса Mesh2dControl.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.BoundaryRepresentation.MeshControl
 Имя
 Описание
 MeshControl Методы
 Ниже перечислены методы класса MeshControl.
 MeshControl Свойства
 Ниже перечислены свойства класса MeshControl.
 Teigha.BoundaryRepresentation.Mesh2dControl
 Имя
 Описание
 Mesh2dControl Свойства
 Ниже перечислены свойства класса Mesh2dControl.
 Ссылки
 Mesh2dControl Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!