Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SubDMesh.SetVertexAt
 Послать отзыв
 Метод задает вершину сети, используя заданный идентификатор подобъекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetVertexAt( SubentityId subentId, Point3d position );
Копировать Код
Public Sub SetVertexAt( subentId As SubentityId, position As Point3d )
 Параметры
 Параметры
 Описание
 subentId
 Идентификатор подобъекта. Тип SubentityId.
 position
 Положение вершины в пространстве, тип Point3d.
 Описание
 Метод задает вершину сети, используя заданный идентификатор подобъекта.
 Ссылки
 Teigha.DatabaseServices.SubDMesh, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!