Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve3d.OrthoBoundBlock
 Послать отзыв
 Свойство позволяет получить граничный бокс для данной кривой. Ребра бокса ориентированы по осям системы координат.
 Синтаксис
C#
Visual Basic
Копировать Код
public BoundBlock3d OrthoBoundBlock;
Копировать Код
Public Property OrthoBoundBlock() As BoundBlock3d
 Возвращает
 Возвращает граничный бокс для данной кривой. Тип BoundBlock3d.
 Описание
 Свойство позволяет получить граничный бокс для данной кривой. Ребра такого бокса ориентированы по осям системы координат.
 Замечания
 Граничный бокс представляет собой прямоугольный параллелепипед минимального объема, ребра которого параллельны координатным осям и в котором целиком помещается целевой геометрический объект. Ориентация ограничивающего бокса не зависит от пространственной ориентации геометрического объекта.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.Curve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!