Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CellRange.IsContentEditable
 Послать отзыв
 Свойство позволяет проверить, допустимо ли редактирование содержимого ячеек диапазона.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool? IsContentEditable;
Копировать Код
Public ReadOnly Property IsContentEditable As Boolean?
 Возвращает
 Возвращает true, если редактирование содержимого ячеек возможно. В противном случае возвращает false.
 Описание
 Свойство позволяет проверить, допустимо ли редактирование содержимого ячеек диапазона.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.CellRange, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!