Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Matrix2d.GetScale
 Послать отзыв
 Метод вычисляет масштабный коэффициент этой матрицы.
 Синтаксис
C#
Visual Basic
Копировать Код
public double GetScale();
Копировать Код
Public Function GetScale() As Double
 Возвращает
 Возвращает масштабный коэффициент матрицы. Тип double.
 Описание
 Метод вычисляет масштабный коэффициент этой матрицы.
 Масштабный коэффициент равен квадратному корню самого длинного вектора-столбца в линейной части этой матрицы
 Ссылки
 Teigha.Geometry.Matrix2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!