Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LayerViewportProperties.PlotStyleNameId
 Послать отзыв
 Свойство представляет идентификатор имени стиля печати.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.ObjectId PlotStyleNameId;
Копировать Код
Public Property PlotStyleNameId() As DatabaseServices.ObjectId
 Возвращает
 Возвращает идентификатор имени стиля печати. Тип DatabaseServices.ObjectId.
 Описание
 Свойство представляет идентификатор имени стиля печати.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.LayerViewportProperties, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!