Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.PlanarEntity.IsCoplanarTo
 Послать отзыв
 Метод позволяет проверить, является ли данный объект компланарным указанной плоской поверхности.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsCoplanarTo( ref PlanarEntity otherPlanarEntity );
Копировать Код
Public Function IsCoplanarTo( ByRef otherPlanarEntity As PlanarEntity ) As Boolean
 Параметры
 Параметры
 Описание
 otherPlanarEntity
 Проверяемый входной плоский объект. Тип PlanarEntity.
 Возвращает
 Возвращает true, если в пределах точности по умолчанию проверяемые плоские объекты можно считать компланарными. В противном случае возвращает false.
 Описание
 Метод позволяет проверить, является ли данный объект компланарным плоской поверхности otherPlanarEntity.
 Используется вызов метода PlanarEntity.IsCoplanarTo(PlanarEntity otherPlaneEntity, Tolerance tolerance) с точностью, равной Tolerance.Global.
 Ссылки
 Teigha.Geometry.PlanarEntity, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!