Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FileDependencyInfo.ReferenceCount
 Послать отзыв
 Свойство ReferenceCount представляет текущее количество ссылок в базе данных.
 Синтаксис
C#
Visual Basic
Копировать Код
public int ReferenceCount;
Копировать Код
Public ReadOnly Property ReferenceCount As Integer
 Возвращает
 Возвращает текущее количество ссылок в базе данных. Тип int.
 Описание
 Свойство ReferenceCount представляет текущее количество ссылок в базе данных.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.FileDependencyInfo, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!