Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AuditInfo.RequestRegen
 Послать отзыв
 Метод позволяет исправленным объектам уведомлять систему о необходимости выполнить их регенерацию.
 Синтаксис
C#
Visual Basic
Копировать Код
public void RequestRegen();
Копировать Код
Public Sub RequestRegen()
 Описание
 Метод позволяет исправленным объектам уведомлять систему о необходимости выполнить их регенерацию. В противном случае изменения будут внесены в базу данных лишь при следующем сохранении.
 Ссылки
 Teigha.DatabaseServices.AuditInfo, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!