Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AbstractViewPE.IsBackClipOn
 Послать отзыв
 Свойство IsBackClipOn позволяет определить, включен ли режим заднего отсечения.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsBackClipOn;
Копировать Код
Public Property IsBackClipOn As Boolean
 Возвращает
 Возвращает true, если отсечение по задней плоскости включено. В противном случае возвращает false.
 Описание
 Свойство IsBackClipOn позволяет определить, включен ли режим заднего отсечения.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.AbstractViewPE, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!