Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve3d.GetParameterOf
 Послать отзыв
 Метод позволяет получить с указанной точностью значение параметра для заданной точки на кривой.
 Синтаксис
C#
Visual Basic
Копировать Код
public double GetParameterOf( Point3d point, Tolerance tolerance );
Копировать Код
Public Function GetParameterOf( point As Point3d, tolerance As Tolerance ) As Double
 Параметры
 Параметры
 Описание
 point
 Точка на кривой. Тип Point3d.
 tolerance
 Точность вычисления параметра. Тип Tolerance.
 Возвращает
 Возвращает значение параметра для заданной точки на кривой. Тип double.
 Описание
 Метод позволяет получить с указанной точностью значение параметра для заданной точки на кривой.
 Реализация метода предполагает без проверки, что точка гарантированно лежит на кривой. Если это условие не соблюдается, метод вернет непредсказуемое значение.
 Ссылки
 Teigha.Geometry.Curve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!