Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve3d.GetDistanceTo
 Послать отзыв
 Метод вычисляет с заданной точностью минимальное расстояние между точками данной кривой и кривой, переданной в метод первым аргументом.
 Синтаксис
C#
Visual Basic
Копировать Код
public double GetDistanceTo( ref Curve3d curve, Tolerance tolerance );
Копировать Код
Public Function GetDistanceTo( ByRef curve As Curve3d, tolerance As Tolerance ) As Double
 Параметры
 Параметры
 Описание
 curve
 Кривая, до которой вычисляются расстояния. Тип Curve3d.
 tolerance
 Геометрический допуск, определяющий точность вычислений. Тип Tolerance.
 Возвращает
 Возвращает минимальное расстояние между кривыми. Тип double.
 Описание
 Метод вычисляет с заданной точностью минимальное расстояние между точками данной кривой и кривой, переданной в метод первым аргументом.
 Ссылки
 Teigha.Geometry.Curve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!