Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DynamicDimensionChangedEventArgs.Value
 Послать отзыв
 Свойство обеспечивает доступ к текущему значению размера.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Value;
Копировать Код
Public ReadOnly Property Value As Double
 Возвращает
 Возвращает текущее значение размера. Тип double.
 Описание
 Свойство обеспечивает доступ к текущему значению размера.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.DynamicDimensionChangedEventArgs, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!