Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Textstyle
 Послать отзыв
 Синтаксис
C#
Visual Basic
public DatabaseServices::ObjectId Textstyle;
Public Property Textstyle() As DatabaseServices.ObjectId
 Описание
 Обеспечивает доступ к текущему значению TEXTSTYLE для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!