Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve2d.IsOn
 Послать отзыв
 Метод позволяет проверить, лежит ли указанная точка на данной кривой.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsOn( Point2d point );
Копировать Код
Public Function IsOn( point As Point2d ) As Boolean
 Параметры
 Параметры
 Описание
 point
 Проверяемая точка. Тип Point2d.
 Возвращает
 Возвращает true, если точка point лежит на данной кривой. В противном случае возвращает false.
 Описание
 Метод позволяет проверить, лежит ли указанная точка на данной кривой. Используется вызов метода Curve2d.IsOn(Point2d point, Tolerance tolerance) со значением точности, равным Tolerance.Global.
 Ссылки
 Teigha.Geometry.Curve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!