Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.NurbSurface.NumberOfSpansInV
 Послать отзыв
 Свойство представляет количество простых поверхностных фрагментов, "сшитых" в направлении v.
 Синтаксис
C#
Visual Basic
Копировать Код
public int NumberOfSpansInV;
Копировать Код
Public ReadOnly Property NumberOfSpansInV As Integer
 Возвращает
 Возвращает количество простых поверхностных фрагментов в указанном направлении. Тип int.
 Описание
 Свойство представляет количество простых поверхностных фрагментов (патчей, лоскутов), "сшитых" в направлении v.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.NurbSurface, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!