Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.RenderGlobal.ProcedureAndDestinationParameter
 Послать отзыв
 Структура ProcedureAndDestinationParameter содержит информацию о процедуре и параметрах направления вывода для свойства RenderGlobal.ProcedureAndDestination.
 Иерархия классов
Teigha::DatabaseServices::RenderGlobal::ProcedureAndDestinationParameter
 Синтаксис
C#
Visual Basic
Копировать Код
public struct ProcedureAndDestinationParameter
Копировать Код
Public Structure ProcedureAndDestinationParameter
 Описание
 Структура ProcedureAndDestinationParameter содержит информацию о процедуре и параметрах направления вывода для свойства RenderGlobal.ProcedureAndDestination.
 Методы
 Конструкторы
 Имя
 Описание
 ProcedureAndDestinationParameter
 Конструктор структуры ProcedureAndDestinationParameter. Создает экземпляр структуры с указанными параметрами.
 Топики
 Имя
 Описание
 ProcedureAndDestinationParameter Свойства
 Ниже перечислены свойства класса ProcedureAndDestinationParameter.
 Ссылки
 ProcedureAndDestinationParameter Свойства, Методы, Топики, ProcedureAndDestinationParameter Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!