Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.DwfFrame
 Послать отзыв
 Синтаксис
C#
Visual Basic
public int DwfFrame;
Public Property DwfFrame() As Integer
 Описание
 Возвращает или устанавливает текущее значение DWFFRAME для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!