Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство RasterImageDef.ResolutionUnits
 Послать отзыв
 Синтаксис
C#
Visual Basic
public Unit ResolutionUnits;
Public Property ResolutionUnits() As Unit
 Описание
 Устанавливает или возвращает единицы, в которых определено разрешение изображения в исходном файле изображения. Если файл изображения не содержит информации о разрешении, то возвращается значение None.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.RasterImageDef, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!