Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.PlanarEntity.IsParallelTo
 Послать отзыв
 Метод позволяет проверить параллельность указанной линии и данной плоской поверхности в пределах точности по умолчанию.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsParallelTo( ref LinearEntity3d linearEntity );
Копировать Код
Public Function IsParallelTo( ByRef linearEntity As LinearEntity3d ) As Boolean
 Параметры
 Параметры
 Описание
 linearEntity
 Проверяемый линейный объект. Тип LinearEntity3d.
 Возвращает
 Возвращает true, если в пределах точности по умолчанию линейный объект linearEntity можно считать параллельным данной плоской поверхности. В противном случае возвращает false.
 Описание
 Метод позволяет проверить параллельность линейного объекта linearEntity и данной плоской поверхности.
 Используется метод PlanarEntity.IsParallelTo(ref LinearEntity3d linearEntity, Tolerance tolerance) с точностью, равной Tolerance.Global.
 Ссылки
 Teigha.Geometry.PlanarEntity, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!