Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MTextFragment.Color
 Послать отзыв
 Свойство возвращает цвет текста.
 Синтаксис
C#
Visual Basic
Копировать Код
public Colors.EntityColor Color;
Копировать Код
Public ReadOnly Property Color As Colors.EntityColor
 Возвращает
 Возвращает цвет текста. Тип Colors.EntityColor.
 Описание
 Свойство возвращает цвет текста.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.MTextFragment, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!