Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.PointOnCurve3d.PointOnCurve3d
 Послать отзыв
 Конструктор класса PointOnCurve3d. Создает точку на указанной кривой с указанным значением параметра.
 Синтаксис
C#
Visual Basic
Копировать Код
public PointOnCurve3d( ref Curve3d curve, double parameter );
Копировать Код
Public Sub New( ByRef curve As Curve3d, parameter As Double )
 Параметры
 Параметры
 Описание
 curve
 Входная кривая. Тип Curve3d.
 parameter
 Входное значение параметра для точки. Тип double.
 Описание
 Конструктор класса PointOnCurve3d. Создает точку на 3D-кривой curve со значением параметра parameter.
 Ссылки
 Teigha.Geometry.PointOnCurve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!