Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeader.EnableFrameText
 Послать отзыв
 Свойство позволяет проверить видимость рамки вокруг текста у данной мультивыноски.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool EnableFrameText;
Копировать Код
Public Property EnableFrameText As Boolean
 Возвращает
 Возвращает true, если рамка отображается. В противном случае возвращает false.
 Описание
 Свойство позволяет проверить видимость рамки вокруг текста у данной мультивыноски.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MLeader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!