Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GradientBackground.Horizon
 Послать отзыв
 Свойство обеспечивает доступ к значению горизонта в данном градиенте.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Horizon;
Копировать Код
Public Property Horizon As Double
 Возвращает
 Возвращает значение горизонта. Тип double.
 Описание
 Свойство обеспечивает доступ к значению горизонта в данном градиенте, которое определяет начальную точку среднего цвета.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.GradientBackground, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!