Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GeoLocationData.DoSeaLevelCorrection
 Послать отзыв
 Свойство обеспечивает доступ к флагу, который управляет применением поправки на высоту над уровнем моря к горизонтальным координатам в процессе преобразования локальных координат в координаты сети.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool DoSeaLevelCorrection;
Копировать Код
Public Property DoSeaLevelCorrection As Boolean
 Возвращает
 Возвращает true, если поправки на высоту над уровнем моря учитываются. В противном случае возвращает false.
 Описание
 Свойство обеспечивает доступ к флагу, который управляет применением поправки на высоту над уровнем моря к горизонтальным координатам в процессе преобразования локальных координат в координаты сети. Значение флага по умолчанию false.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.GeoLocationData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!