Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.EllipticalCone.BaseCenter
 Послать отзыв
 Свойство BaseCenter представляет положение начала координат данного конуса.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d BaseCenter;
Копировать Код
Public ReadOnly Property BaseCenter As Point3d
 Возвращает
 Возвращает точку начала координат данного эллиптического конуса. Тип Point3d.
 Описание
 Свойство BaseCenter представляет положение начала координат данного эллиптического конуса.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.EllipticalCone, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!