Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Делегат Teigha.DatabaseServices.ProxyResurrectionCompletedEventHandler
 Послать отзыв
 This is type Teigha::DatabaseServices::ProxyResurrectionCompletedEventHandler.
 Синтаксис
C#
Visual Basic
public delegate ProxyResurrectionCompletedEventHandler();
Public Delegate Sub ProxyResurrectionCompletedEventHandler()
 Ваши комментарии по поводу этого топика: Послать отзыв!