Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.TimeZone
 Послать отзыв
 Синтаксис
C#
Visual Basic
public DatabaseServices::TimeZone TimeZone;
Public Property TimeZone() As DatabaseServices.TimeZone
 Описание
 Обеспечивает доступ к значению часовой зоны для чертежа (одному из значений перечисления).
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!