Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство SymbolTable.SkipDeleted
 Послать отзыв
 Синтаксис
C#
Visual Basic
protected bool SkipDeleted;
Protected Property SkipDeleted() As bool
 Описание
 Возвращает очищенные записи таблицы символов в добавление ко всем присутствующим в данный момент записям таблицы.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.SymbolTable, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!