Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SymbolUtilityServices.LayerDefpointsName
 Послать отзыв
 Свойство LayerDefpointsName представляет предопределенную запись символа для имени слоя "Defpoints".
 Синтаксис
C#
Visual Basic
Копировать Код
public static String LayerDefpointsName;
Копировать Код
Public Shared ReadOnly Property LayerDefpointsName As String
 Возвращает
 Возвращает предопределенное имя слоя "Defpoints". Тип String.
 Описание
 Свойство LayerDefpointsName представляет предопределенную запись символа для имени слоя "Defpoints". Не может быть ни NULL, ни пустой строкой.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.SymbolUtilityServices, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!