Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Событие Database.XrefAttachAborted
 Послать отзыв
 Синтаксис
C#
Visual Basic
public event EventHandler XrefAttachAborted;
Public Event XrefAttachAborted As EventHandler
 Описание
 Событие показывает, что в операции присоединения этой внешней ссылки была выполнена в чертеже, но не завершилась успешно.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!