Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DatabaseSummaryInfoBuilder
 Послать отзыв
 Класс DatabaseSummaryInfoBuilder предназначен для создания объекта DatabaseSummaryInfo, в котором хранится набор строк с дополнительной информацией о файле .dwg.
 Иерархия классов
Teigha::DatabaseServices::DatabaseSummaryInfoBuilder
 Синтаксис
C#
Visual Basic
Копировать Код
public class DatabaseSummaryInfoBuilder;
Копировать Код
Public Class DatabaseSummaryInfoBuilder
 Описание
 Класс DatabaseSummaryInfoBuilder предназначен для создания объекта DatabaseSummaryInfo, в котором хранится набор строк с дополнительной информацией о файле .dwg.
 Методы
 Конструкторы
 Имя
 Описание
 DatabaseSummaryInfoBuilder
 Это обзор перегрузок DatabaseSummaryInfoBuilder.
 Топики
 Имя
 Описание
 DatabaseSummaryInfoBuilder Методы
 Ниже перечислены методы класса DatabaseSummaryInfoBuilder.
 DatabaseSummaryInfoBuilder Свойства
 Ниже перечислены свойства класса DatabaseSummaryInfoBuilder.
 Ссылки
 DatabaseSummaryInfoBuilder Конструктор, DatabaseSummaryInfoBuilder Методы, DatabaseSummaryInfoBuilder Свойства, Методы, Топики, DatabaseSummaryInfoBuilder Методы, DatabaseSummaryInfoBuilder Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!