Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObject.Cancelled
 Послать отзыв
 Событие возникает, когда операция открытия объекта была отменена.
 Синтаксис
C#
Visual Basic
Копировать Код
public event EventHandler Cancelled;
Копировать Код
Public Event Cancelled As EventHandler
 Возвращает
 Тип данных EventHandler, представляющий обработчик события.
 Описание
 Событие возникает, когда операция открытия объекта была отменена.
 Ссылки
 Teigha.DatabaseServices.DBObject, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!