Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LinkedTableData.InsertRow
 Послать отзыв
 Метод вставляет в данную таблицу указанное количество строк по указанному индексу строки.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual int InsertRow( int index, int rowsNumber );
Копировать Код
Public Overridable Function InsertRow( index As Integer, rowsNumber As Integer ) As Integer
 Параметры
 Параметры
 Описание
 index
 Индекс строки, по которому вставляются новые строки. Тип int.
 rowsNumber
 Количество вставляемых строк. Тип int.
 Возвращает
 Возвращает начальный индекс вставленных строк. Тип int.
 Описание
 Метод вставляет в данную таблицу указанное количество строк по указанному индексу строки.
 Замечания
 Метод выбрасывает исключение eInvalidInput, если значение rowsNumber окажется не положительным.
 Ссылки
 Teigha.DatabaseServices.LinkedTableData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!