Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Facetres
 Послать отзыв
 Синтаксис
C#
Visual Basic
public double Facetres;
Public Property Facetres() As Double
 Описание
 Возвращает или устанавливает текущее значение FACETRES пространства модели базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!