Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.TextAngleType
 Послать отзыв
 Данное перечисление определяет допустимые типы углов текста.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum TextAngleType { AlwaysRightReadingAngle = 2, HorizontalAngle = 1, InsertAngle = 0 }
Копировать Код
Public Enum TextAngleType AlwaysRightReadingAngle = 2 HorizontalAngle = 1 InsertAngle = 0 End Enum
 Члены
 Члены
 Описание
 InsertAngle
 Значение: 0. Направление текста определяется ориентацией последнего сегмента выноски.
 HorizontalAngle
 Значение: 1. Направление текста всегда горизонтальное.
 AlwaysRightReadingAngle
 Значение: 2. Направление текста определяется ориентацией последнего сегмента выноски. Направление письма всегда справа налево.
 Описание
 Данное перечисление определяет допустимые типы углов текста.
 Ваши комментарии по поводу этого топика: Послать отзыв!