Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ObjectEventArgs.DBObject
 Послать отзыв
 Свойство представляет измененный объект, с которым связано событие.
 Синтаксис
C#
Visual Basic
Копировать Код
public DBObject DBObject;
Копировать Код
Public ReadOnly Property DBObject As DBObject
 Возвращает
 Возвращает объект в базе данных. Тип DBObject.
 Описание
 Свойство представляет измененный объект, с которым связано событие.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.ObjectEventArgs, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!