Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DxfFiler.ReadVector3d
 Послать отзыв
 Метод возвращает 3D-вектор из текущего элемента этого объекта Filer.
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract Vector3d ReadVector3d();
Копировать Код
Public MustOverride Function ReadVector3d() As Vector3d
 Возвращает
 Возвращает 3D-вектор. Тип Vector3d.
 Описание
 Метод возвращает 3D-вектор из текущего элемента этого объекта Filer.
 Ссылки
 Teigha.DatabaseServices.DxfFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!