Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Shape.WidthFactor
 Послать отзыв
 Свойство WidthFactor представляет коэффициент ширины данного объекта, т.е. относительный масштабный коэффициент по ширине X.
 Синтаксис
C#
Visual Basic
Копировать Код
public double WidthFactor;
Копировать Код
Public Property WidthFactor As Double
 Возвращает
 Возвращает коэффициент ширины. Тип double.
 Описание
 Свойство WidthFactor представляет коэффициент ширины данного объекта, т.е. относительный масштабный коэффициент по ширине X.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Shape, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!