Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SubDMesh.GetVertexAt
 Послать отзыв
 Метод предназначен для определения координатной точки Point3d вершины с заданным идентификатором подобъекта SubentityId.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d GetVertexAt( SubentityId subentId );
Копировать Код
Public Function GetVertexAt( subentId As SubentityId ) As Point3d
 Параметры
 Параметры
 Описание
 subentId
 Идентификатор подобъекта. Тип SubentityId.
 Возвращает
 Возвращает точку Point3d для вершины с заданным идентификатором подобъекта.
 Описание
 Метод предназначен для определения координатной точки Point3d вершины с заданным идентификатором подобъекта SubentityId.
 Ссылки
 Teigha.DatabaseServices.SubDMesh, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!