Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство DBText.Position
 Послать отзыв
 Синтаксис
C#
Visual Basic
public Point3d Position;
Public Property Position() As Point3d
 Описание
 Обеспечивает доступ к точке вставки текста в мировых координатах.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.DBText, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!