Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.IsPartiallyOpened
 Послать отзыв
 Синтаксис
C#
Visual Basic
public bool IsPartiallyOpened;
Public Property IsPartiallyOpened() As bool
 Описание
 Возвращает true, если база данных имеет статус частично открытой, в противном случае возвращает false.
 Условия
 Только чтение
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!