Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 LayerTableRecord.Transparency
 Послать отзыв
 В свойстве хранится значение прозрачности слоя.
 Синтаксис
C#
Visual Basic
Копировать Код
public Transparency Transparency { get; set; }
Копировать Код
Public Property Transparency As Transparency
 Возвращает
 Возвращает тип данных Transparency.
 Описание
 С помощью свойства можно получить текущее значение прозрачности слоя и изменить его.
 Прозрачность, установленная в слое, будет у всех объектов чертежа, расположенных на этом слое, если прозрачность этих объектов имеет значение «По слою».
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.LayerTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!