Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Section.State
 Послать отзыв
 Свойство State представляет тип секущей плоскости.
 Синтаксис
C#
Visual Basic
Копировать Код
public SectionState State;
Копировать Код
Public Property State As SectionState
 Возвращает
 Возвращает тип секущей плоскости как значение из перечисления SectionState.
 Описание
 Свойство State представляет тип секущей плоскости.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Section, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!