Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 ViewportTableRecord.GridMajor
 Послать отзыв
 Свойство предназначено для настройки количества ячеек внутри основной ячейки.
 Синтаксис
C#
Visual Basic
public short GridMajor;
Public Property GridMajor() As short
 Возвращает
 Возвращает тип данных short.
 Описание
 С помощью свойства можно изменять количество маленьких ячеек сетки, входящих в более крупную ячейку. Размер маленьких ячеек определяется свойством GridIncrements. Свойство возвращает количество линий, определяющих маленькие ячейки, которое расположено внутри более крупной ячейки. Количество линий по горизонтали и вертикали одинаковое. В интерфейсе свойство настраивается через диалоговое окно «Режимы черчения» для каждого видового экрана отдельно. Окно «Режимы черчения» можно открыть либо командой DDRMODES, DDSETTINGS, либо через меню Сервис -> Режимы черчения…
 Условия
 Чтение и запись.
 Ссылки
 ViewportTableRecord Класс, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!