Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Dimtfac
 Послать отзыв
 Синтаксис
C#
Visual Basic
public double Dimtfac;
Public Property Dimtfac() As Double
 Описание
 Возвращает или устанавливает текущее значение DIMTFAC для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!