Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Cmaterial
 Послать отзыв
 Синтаксис
C#
Visual Basic
public DatabaseServices::ObjectId Cmaterial;
Public Property Cmaterial() As DatabaseServices.ObjectId
 Описание
 Возвращает или устанавливает значение ID материала слоя.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!