Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.ClipBoundary2dData.Equals
 Послать отзыв
 Метод предназначен для проверки на равенство данного и переданного в метод объектов.
 Синтаксис
C#
Visual Basic
Копировать Код
public sealed override bool Equals( ref Object obj );
Копировать Код
Public NotOverridable Overrides Function Equals( ByRef obj As Object ) As Boolean
 Параметры
 Параметры
 Описание
 obj
 Входной объект, с которым проверяется равенство. Тип Object.
 Возвращает
 Возвращает true, если оба сравниваемых объекта не являются нулевыми и выполняются условия равенства объектов ClipBoundary2dData (см. выше). В противном случае возвращает false.
 Описание
 Метод предназначен для проверки на равенство данного и переданного в метод объектов.
 Два объекта ClipBoundary2dData считаются равными, если одновременно выполняются следующие условия:
Совпадают обрезанные вершины;
Совпадают исходные метки обрезанных сегментов;
Совпадают условия обрезки.
 Замечания
 Переопределение методов Equals и GetHashCode должно выполняться согласованно с соблюдением общей логики. Если Equals возвращает true, хеш-коды сравниваемых объектов обязаны совпадать. Обратное не гарантируется - совпадение хеш-кодов не всегда означает совпадение объектов вследствие возможных коллизий. Хэш-коды должны формироваться с использованием полей, на которых основано равенство объектов.
 Иногда используется метод Equals() из объекта C++, но поскольку сравниваются указатели, вы по-прежнему можете использовать GetHashCode() отсюда, в то время как метод Equals() может быть переопределен в производном классе.
 Ссылки
 Teigha.Geometry.ClipBoundary2dData, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!