Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Viewport.UpdateDisplay
 Послать отзыв
 Метод обновляет представление на экране, чтобы отразить изменения в данном видовом экране.
 Синтаксис
C#
Visual Basic
Копировать Код
public void UpdateDisplay();
Копировать Код
Public Sub UpdateDisplay()
 Описание
 Метод обновляет изображение данного видового экрана, приводя его в соответствие с произошедшими изменениями.
 Ссылки
 Teigha.DatabaseServices.Viewport, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!