Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод RasterImage.SetClipBoundary (DatabaseServices::ClipBoundaryType, Point2dCollection^)
 Послать отзыв
 Синтаксис
C#
Visual Basic
public void SetClipBoundary(DatabaseServices::ClipBoundaryType type, ref Point2dCollection clipBoundaryVertices);
Public Sub SetClipBoundary(type As DatabaseServices.ClipBoundaryType, ByRef clipBoundaryVertices As Point2dCollection)
 Параметры
 Параметры
 Описание
 type
 Тип контура изображения
 clipBoundaryVertices
 Коллекция вершин контура изображения
 Описание
 Определяет многоугольные границы контура изображения. Контур изображения должен быть замкнут, т.е. его последняя точка должна совпадать с первой точкой. Значение type должно соответствовать форме точек в массиве.
 Ссылки
 Teigha.DatabaseServices.RasterImage, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!