Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Scale3d.MultiplyBy
 Послать отзыв
 Метод реализует умножение данного вектора масштабирования на заданный скалярный множитель.
 Синтаксис
C#
Visual Basic
Копировать Код
public Scale3d MultiplyBy( double s );
Копировать Код
Public Function MultiplyBy( s As Double ) As Scale3d
 Параметры
 Параметры
 Описание
 s
 Входное значение множителя. Тип double.
 Возвращает
 Возвращает результат умножения данного объекта на множитель s. Тип Scale3d.
 Описание
 Метод реализует умножение данного вектора масштабирования на переданный в аргументе скалярный множитель s.
 Ссылки
 Teigha.Geometry.Scale3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!