Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocArrayCommonParameters.GetRowCount
 Послать отзыв
 Метод позволяет получить количество рядов в данном массиве.
 Синтаксис
C#
Visual Basic
Копировать Код
public int GetRowCount( out String expression, out String evaluatorId );
Копировать Код
Public Function GetRowCount( ByRef expression As out String, ByRef evaluatorId As out String ) As Integer
 Параметры
 Параметры
 Описание
 expression
 Выражение для параметра. Тип String.
 evaluatorId
 Полученное строковое представление идентификатора вычислителя. Тип String.
 Возвращает
 Возвращает количество рядов в массиве. Тип int.
 Описание
 Метод позволяет получить количество рядов в данном массиве. Если для параметра выражение отсутствует, то после выполнения метода строки expression и evaluatorId остаются пустыми.
 Ссылки
 Teigha.DatabaseServices.AssocArrayCommonParameters, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!