Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DynamicDimensionDataCollection.Item
 Послать отзыв
 Свойство Item задает или возвращает элемент коллекции с указанным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public DynamicDimensionData this[int index];
Копировать Код
Default Public Property Item( index As Integer ) As DynamicDimensionData
 Параметры
 Параметры
 Описание
 index
 Индекс элемента коллекции. Тип int.
 Возвращает
 Возвращает элемент коллекции по его индексу. Тип DynamicDimensionData.
 Описание
 Свойство Item задает или возвращает элемент коллекции с указанным индексом.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.DynamicDimensionDataCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!