Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Assoc2dConstraintGroup.DeleteConstrainedGeometry
 Послать отзыв
 Метод удаляет используемый группой ограничений объект ConstrainedGeometry, а также связанный с ним объект AssocGeomDependency.
 Синтаксис
C#
Visual Basic
Копировать Код
public void DeleteConstrainedGeometry( Teigha.DatabaseServices.ObjectId geomDependencyId );
Копировать Код
Public Sub DeleteConstrainedGeometry( geomDependencyId As Teigha.DatabaseServices.ObjectId )
 Параметры
 Параметры
 Описание
 geomDependencyId
 Идентификатор удаляемого объекта. Тип Teigha.DatabaseServices.ObjectId.
 Описание
 Метод удаляет используемый группой ограничений объект ConstrainedGeometry, а также связанный с ним объект AssocGeomDependency.
 Ссылки
 Teigha.DatabaseServices.Assoc2dConstraintGroup, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!