Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Vertex2d.VertexType
 Послать отзыв
 Свойство VertexType представляет тип вершины полилинии из перечисления Vertex2dType.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vertex2dType VertexType;
Копировать Код
Public ReadOnly Property VertexType As Vertex2dType
 Возвращает
 Возвращает тип вершины. Перечисление Vertex2dType.
 Описание
 Свойство VertexType представляет тип вершины полилинии из перечисления Vertex2dType.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Vertex2d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!