Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SweepOptionsBuilder.AlignAngle
 Послать отзыв
 Свойство AlignAngle представляет величину угла выравнивания в радианах.
 Синтаксис
C#
Visual Basic
Копировать Код
public double AlignAngle;
Копировать Код
Public Property AlignAngle As Double
 Возвращает
 Возвращает угол выравнивания в радианах. Тип double.
 Описание
 Свойство AlignAngle представляет величину угла выравнивания в радианах.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.SweepOptionsBuilder, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!