Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.BulgeVertexCollection.CopyTo
 Послать отзыв
 Метод копирует эту коллекцию объектов BulgeVertex в заданный массив по указанному индексу.
 Синтаксис
C#
Visual Basic
Копировать Код
public void CopyTo( ref BulgeVertex[] array, int index );
Копировать Код
Public Sub CopyTo( ByRef array As BulgeVertex(), index As Integer )
 Параметры
 Параметры
 Описание
 array
 Массив, в который следует скопировать элементы данной коллекции. Тип BulgeVertex[].
 index
 Индекс, начиная с которого вставляются в массив элементы коллекции.
 Описание
 Метод копирует эту коллекцию объектов BulgeVertex в заданный массив по указанному индексу.
 Ссылки
 Teigha.DatabaseServices.BulgeVertexCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!