Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.HatchLoop.LoopType
 Послать отзыв
 Свойство возвращает тип этого контура штриховки.
 Синтаксис
C#
Visual Basic
Копировать Код
public HatchLoopTypes LoopType;
Копировать Код
Public ReadOnly Property LoopType As HatchLoopTypes
 Возвращает
 Возвращает тип контура штриховки. Перечисление HatchLoopTypes.
 Описание
 Свойство возвращает тип этого контура штриховки.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.HatchLoop, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!