Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Solid3d.NumChanges
 Послать отзыв
 Свойство NumChanges представляет количество изменений, произошедших с момента создания данного твердого тела.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual int NumChanges;
Копировать Код
Public Overridable ReadOnly Property NumChanges As Integer
 Возвращает
 Возвращает количество изменений данного объекта. Тип int.
 Описание
 Свойство NumChanges представляет количество изменений, произошедших с момента создания данного твердого тела.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Solid3d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!