Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocArrayCommonParameters.BasePoint
 Послать отзыв
 Свойство обеспечивает доступ к базовой точке базовой плоскости.
 Синтаксис
C#
Visual Basic
Копировать Код
public VertexRef BasePoint;
Копировать Код
Public Property BasePoint() As VertexRef
 Возвращает
 Возвращает объект VertexRef.
 Описание
 Свойство обеспечивает доступ к базовой точке базовой плоскости.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.AssocArrayCommonParameters, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!