Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.RenderGlobal.ProcedureAndDestinationParameter.Procedure
 Послать отзыв
 Свойство Procedure представляет текущее значение параметра процедуры рендеринга.
 Синтаксис
C#
Visual Basic
Копировать Код
public Procedure Procedure;
Копировать Код
Public ReadOnly Property Procedure As Procedure
 Возвращает
 Возвращает процедуру рендеринга. Значение из перечисления Procedure.
 Описание
 Свойство Procedure представляет текущее значение параметра процедуры рендеринга, который определяет заданный тип визуального контента в настройках рендеринга.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.RenderGlobal.ProcedureAndDestinationParameter, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!