Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Arc.Radius
 Послать отзыв
 Свойство предназначено для хранения величины радиуса дуги.
 Синтаксис
C#
Visual Basic
public double Radius;
Public Property Radius() As Double
 Возвращает
 Тип данных double. Note Величина радиуса используется для группового кода 40 DXF.
 Описание
 Устанавливает или возвращает радиус дуги.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Arc, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!