Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.GridColor
 Послать отзыв
 Метод предназначен для получения цвета сетки для заданного типа линий сетки и типа строки объекта таблицы.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual Color GridColor( GridLineType gridlineType, RowType type );
Копировать Код
Public virtual Function GridColor( gridlineType As GridLineType, type As RowType ) As Color
 Параметры
 Параметры
 Описание
 gridlineType
 Тип линии сетки, для которой следует получить цвет. Значение из перечисления GridLineType.
 type
 Тип строки, для которой следует получить цвет. Значение из перечисления RowType.
 Возвращает
 Возвращает цвет сетки. Тип Color.
 Описание
 Метод предназначен для получения цвета сетки для заданного типа линий сетки и типа строки объекта таблицы. Тип линий и тип строки задаются значениями из перечислений GridLineType и RowType, соответственно.
 Замечания
 Для получения того же результата предпочтительнее использовать функционал объекта Cell.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!