Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Position2d.Position2d
 Послать отзыв
 Конструктор по умолчанию класса Position2d. Создает объект позиции с координатами (0,0).
 Синтаксис
C#
Visual Basic
Копировать Код
public Position2d();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса Position2d. Создает объект позиции с координатами (0,0).
 Ссылки
 Teigha.Geometry.Position2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!