Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Handle.ToString
 Послать отзыв
 Возвращает эквивалентное строковое представление данного объекта в формате, который учитывает заданные поставщиком языковые и региональные параметры.
 Синтаксис
C#
Visual Basic
Копировать Код
public String ToString( ref IFormatProvider provider );
Копировать Код
Public Function ToString( ByRef provider As IFormatProvider ) As String
 Параметры
 Параметры
 Описание
 provider
 Поставщик настраиваемого формата, реализующий интерфейс IFormatProvider.
 Возвращает
 Возвращает эквивалентное строковое представление данного объекта, тип String.
 Описание
 Возвращает эквивалентное строковое представление данного объекта в формате, который учитывает заданные поставщиком языковые и региональные параметры. Подробнее см. в документации Microsoft по .NET API.
 Ссылки
 Teigha.DatabaseServices.Handle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!