Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.ExternalSurface
 Послать отзыв
 Класс ExternalSurface представляет неограниченные поверхности, определения которых являются внешними по отношению к геометрической библиотеке nanoCAD.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Geometry::Entity3d Teigha::Geometry::Surface Teigha::Geometry::ExternalSurface
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdGeExternalSurface")] public sealed class ExternalSurface : Surface
Копировать Код
<Wrapper("OdGeExternalSurface")> Public NotInheritable Class ExternalSurface Inherits Surface
 Описание
 Класс ExternalSurface представляет неограниченные поверхности, определения которых являются внешними по отношению к геометрической библиотеке nanoCAD.
 С экземплярами ExternalSurface можно работать как с любыми объектами Surface. Доступ к ExternalSurface можно получить как к соответствующей поверхности Surface, если она существует. Кроме того, возможно получить доступ к внешним данным в их нативной форме (что может оказаться более эффективным). Одним из примеров использования ExternalSurface является доступ к поверхности ACIS.
 Методы
 Конструкторы
 Teigha.Geometry.ExternalSurface
 Имя
 Описание
 ExternalSurface
 Это обзор перегрузок ExternalSurface.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Geometry.Entity3d
 Имя
 Описание
 Entity3d Методы
 Ниже перечислены методы класса Entity3d.
 Teigha.Geometry.Surface
 Имя
 Описание
 Surface Методы
 Ниже перечислены методы класса Surface.
 Surface Свойства
 Ниже перечислены свойства класса Surface.
 Teigha.Geometry.ExternalSurface
 Имя
 Описание
 ExternalSurface Методы
 Ниже перечислены методы класса ExternalSurface.
 ExternalSurface Свойства
 Ниже перечислены свойства класса ExternalSurface.
 Ссылки
 ExternalSurface Конструктор, ExternalSurface Методы, ExternalSurface Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!