Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CircularArc2d.StartAngle
 Послать отзыв
 Свойство StartAngle представляет начальный угол дуги.
 Синтаксис
C#
Visual Basic
Копировать Код
public double StartAngle;
Копировать Код
Public ReadOnly Property StartAngle As Double
 Возвращает
 Возвращает начальный угол дуги. Тип double.
 Описание
 Свойство StartAngle представляет начальный угол дуги.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.CircularArc2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!