Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CircularArc3d.Normal
 Послать отзыв
 Свойство Normal представляет вектор нормали плоскости дуги.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d Normal;
Копировать Код
Public ReadOnly Property Normal As Vector3d
 Возвращает
 Возвращает вектор нормали плоскости дуги. Тип Vector3d.
 Описание
 Свойство Normal представляет вектор нормали плоскости дуги.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.CircularArc3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!