Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Cylinder.Cylinder
 Послать отзыв
 Конструктор по умолчанию класса Cylinder.
 Синтаксис
C#
Visual Basic
Копировать Код
public Cylinder.Cylinder();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса Cylinder. Создает бесконечный цилиндр с осью цилиндра (0,1,0), радиусом основания 2.0, началом в точке (0,0,0) и опорным направлением отсчета углов (1,0,0).
 Ссылки
 Teigha.Geometry.Cylinder, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!