Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.NurbSurface.GetIsolineAtU
 Послать отзыв
 Метод предназначен для вычисления изопараметрической линии с заданным значением u. Изолинии создаются в направлении v.
 Синтаксис
C#
Visual Basic
Копировать Код
public Curve[] GetIsolineAtU( double dU );
Копировать Код
Public Function GetIsolineAtU( dU As Double ) As Curve()
 Параметры
 Параметры
 Описание
 dU
 Входное значение параметра U. Тип double.
 Возвращает
 Возвращает изолинию как массив кривых. Тип Curve[].
 Описание
 Метод предназначен для вычисления изопараметрической линии с заданным значением u. Изолинии создаются в направлении v.
 Если у поверхности есть отверстия, то изопараметрическая линия может состоять из нескольких сегментов. Если поверхность не содержит никакой информации NURBS, метод генерирует исключение eFail.
 Ссылки
 Teigha.DatabaseServices.NurbSurface, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!