Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector2dCollectionEnumerator.Reset
 Послать отзыв
 Метод выполняет сброс данного перечислителя в исходное состояние.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void Reset();
Копировать Код
Public Overridable Sub Reset()
 Описание
 Метод выполняет сброс данного перечислителя в исходное состояние, устанавливая текущий индекс перечислителя на -1.
 Ссылки
 Teigha.Geometry.Vector2dCollectionEnumerator, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!