Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocDependency.IsActionEvaluationInProgress
 Послать отзыв
 Свойство позволяет установить, занята ли система в данный момент вычислением действия или сети действий.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsActionEvaluationInProgress;
Копировать Код
Public Property IsActionEvaluationInProgress() As Boolean
 Возвращает
 Возвращает true, если в данный момент система выполняет обновление действия или сети действий. В противном случае возвращает false.
 Описание
 Свойство позволяет установить, занята ли система в данный момент вычислением действия или сети действий.
 Следует иметь ввиду, что в процессе обновления действий уведомления зависимостей отключаются. Зависимости игнорируют уведомления об изменении связанного объекта. Соответственно, не происходит и уведомление действий-владельцев этих зависимостей. Это необходимо, чтобы исключить зацикливание обновлений.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.AssocDependency, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!