Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Polyline.AddVertexAt
 Послать отзыв
 Синтаксис
C#
Visual Basic
public void AddVertexAt(int index, Point2d pt, double bulge, double startWidth, double endWidth);
Public Sub AddVertexAt(index As Integer, pt As Point2d, bulge As Double, startWidth As Double, endWidth As Double)
 Параметры
 Параметры
 Описание
 index
 Индекс вершины (отсчитываемый от 0), добавляемой к полилинии
 pt
 Координаты добавляемой точки
 bulge
 Степень выпуклости для вершины
 startWidth
 Начальная ширина вершины
 endWidth
 Конечная ширина вершины
 Описание
 Этот метод добавляет вершину к полилинии. Если index равен 0, то вершина становится первой из вершин полилинии. Если index — это значение, возвращаемое методом Polyline.NumberOfVertices, то добавляемая вершина станет последней вершиной полилинии. В остальных случаях вершина добавляется перед вершиной с номером index. Note pt должен быть определен в координатной системе полилинии, а не в Мировой системе координат (WCS).
 Ссылки
 Teigha.DatabaseServices.Polyline, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!