Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LoftOptionsNormalOption
 Послать отзыв
 Данное перечисление определяет варианты поведения вытягиваемой поверхности при прохождении поперечных сечений.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum LoftOptionsNormalOption { AllNormal = 4, EndsNormal = 3, FirstNormal = 1, LastNormal = 2, NoNormal = 0, UseDraftAngles = 5 }
Копировать Код
Public Enum LoftOptionsNormalOption AllNormal = 4 EndsNormal = 3 FirstNormal = 1 LastNormal = 2 NoNormal = 0 UseDraftAngles = 5 End Enum
 Члены
 Члены
 Описание
 NoNormal
 Значение: 0. Если установлено это значение, лофтинг по нормали к плоскости отключается, и система вычисляет направление поверхности в каждом поперечном сечении индивидуально.
 FirstNormal
 Значение: 1. Направление поверхности в первом поперечном сечении будет совпадать с нормалью плоскости поперечного сечения.
 LastNormal
 Значение: 2. Если установлено это значение, направление поверхности в последнем поперечном сечении будет совпадать с нормалью плоскости поперечного сечения.
 EndsNormal
 Значение: 3. Если установлено это значение, направление поверхности в первом и последнем сечениях будет совпадать с нормалями плоскостей соответствующих сечений.
 AllNormal
 Значение: 4. Если установлено это значение, направление поверхности в каждом поперечном сечении будет совпадать с нормалью плоскости этого поперечного сечения.
 UseDraftAngles
 Значение: 5. Направление поверхности в первом и последнем сечениях будет определяться заданными углами сопряжения лофт-поверхности с плоскостями соответствующих сечений (start draft angle и end draft angle).
 Описание
 Данное перечисление определяет варианты поведения вытягиваемой поверхности при прохождении поперечных сечений.
 Ваши комментарии по поводу этого топика: Послать отзыв!