Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LinkedTableData.SetDataFormat
 Послать отзыв
 Метод позволяет задать формат данных в первом элементе содержимого указанной ячейки таблицы.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetDataFormat( int row, int column, ref String format );
Копировать Код
Public Overridable Sub SetDataFormat( row As Integer, column As Integer, ByRef format As String )
 Параметры
 Параметры
 Описание
 row
 Индекс строки. Тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 column
 Индекс столбца. Тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице.
 format
 Формат данных. Тип String.
 Описание
 Метод позволяет задать формат данных в первом элементе содержимого указанной ячейки таблицы.
 Замечания
 Метод выбрасывает исключение eInvalidInput, если индексы строки и/или столбца выходят за допустимые пределы. Если содержимое ячейки недоступно для редактирования, метод выбрасывает исключение eIsWriteProtected.
 Ссылки
 Teigha.DatabaseServices.LinkedTableData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!