Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.IdMappingEventArgs.IdMapping
 Послать отзыв
 Свойство возвращает объект IdMapping, ассоциированный с данным событием.
 Синтаксис
C#
Visual Basic
Копировать Код
public IdMapping IdMapping;
Копировать Код
Public ReadOnly Property IdMapping As IdMapping
 Возвращает
 Возвращает карту сопоставления идентификаторов IdMapping, связанную с данным событием.
 Описание
 Свойство возвращает объект IdMapping, ассоциированный с данным событием.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.IdMappingEventArgs, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!