Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GradientColor.GradientColor
 Послать отзыв
 Конструктор по умолчанию класса GradientColor.
 Синтаксис
C#
Visual Basic
Копировать Код
public GradientColor();
Копировать Код
Public Sub New()
 Описание
 Конструктор класса GradientColor.
 Ссылки
 Teigha.DatabaseServices.GradientColor, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!