Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AuditPass
 Послать отзыв
 Перечисление AuditPass определяет этапы аудита объектов базы данных.
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdDbAuditInfo.AuditPass")] public enum AuditPass { Pass1 = 1, Pass2 = 2 }
Копировать Код
Public Enum AuditPass Pass1 = 1 Pass2 = 2 End Enum
 Члены
 Члены
 Описание
 Pass1
 Значение: 1. На этапе Pass1 члены класса должны проверять собственные поля данных, избегая проверок других объектов (даже проверок их существования).
 Pass2
 Значение: 2. На этапе Pass2 участники аудита должны проверять существование связанных объектов и связей между объектами. На этом проходе выполняется восстановление объектов (воссоздаются отсутствующие объекты, перенаправляются ссылки и т.п.).
 Описание
 Перечисление AuditPass определяет этапы аудита объектов базы данных. Аудит каждого объекта выполняется в два прохода Pass1 и Pass2.
 Ваши комментарии по поводу этого топика: Послать отзыв!