Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GripData.RubberBandLineDisabled
 Послать отзыв
 Свойство определяет, допускается ли отображать резиновую линию во время любых операций перетаскивания.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool RubberBandLineDisabled;
Копировать Код
Public Property RubberBandLineDisabled As Boolean
 Возвращает
 Возвращает true, если отображение резиновой линии не допускается. В противном случае возвращает false.
 Описание
 Свойство определяет, допускается ли отображать резиновую линию во время любых операций перетаскивания.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.GripData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!