Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CurveBoundary.SetToOwnCurves
 Послать отзыв
 Метод позволяет сделать данную криволинейную границу владельцем данных своего определения.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetToOwnCurves();
Копировать Код
Public Sub SetToOwnCurves()
 Описание
 Метод позволяет сделать данную криволинейную границу владельцем данных своего определения.
 Если текущий экземпляр уже является владельцем, то метод ничего не делает. В противном случае метод создает копию данных определения и делает данную граничную кривую владельцем скопированных данных.
 Ссылки
 Teigha.Geometry.CurveBoundary, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!