Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.OrthographicView
 Послать отзыв
 Данное перечисление определяет ортогональные виды относительно пользовательской системы координат.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum OrthographicView { NonOrthoView = 0, TopView = 1, BottomView = 2, FrontView = 3, BackView = 4, LeftView = 5, RightView = 6 }
Копировать Код
Public Enum OrthographicView NonOrthoView = 0 TopView = 1 BottomView = 2 FrontView = 3 BackView = 4 LeftView = 5 RightView = 6 End Enum
 Члены
 Члены
 Описание
 BackView
 Значение: 4. Вид представляет собой вид сзади в пользовательской системе координат.
 BottomView
 Значение: 2. Вид представляет собой вид снизу в пользовательской системе координат.
 FrontView
 Значение: 3. Вид представляет собой вид спереди в пользовательской системе координат.
 LeftView
 Значение: 5. Вид представляет собой вид слева в пользовательской системе координат.
 NonOrthoView
 Значение: 0. Вид не является ортогональным в пользовательской системе координат.
 RightView
 Значение: 6. Вид представляет собой вид справа в пользовательской системе координат.
 TopView
 Значение: 1. Вид представляет собой вид сверху в пользовательской системе координат.
 Описание
 Данное перечисление определяет ортогональные виды относительно пользовательской системы координат.
 Ваши комментарии по поводу этого топика: Послать отзыв!