Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MText.Direction
 Послать отзыв
 Свойство представляет вектор (WCS) направления оси X этого объекта MText.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d Direction;
Копировать Код
Public Property Direction As Vector3d
 Возвращает
 Возвращает направления оси X этого объекта. Тип Vector3d.
 Описание
 Свойство представляет вектор (WCS) направления оси X этого объекта MText.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MText, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!