Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocArrayCommonParameters.LevelCount
 Послать отзыв
 Свойство обеспечивает доступ к количеству уровней ассоциативного массива.
 Синтаксис
C#
Visual Basic
Копировать Код
public int LevelCount;
Копировать Код
Public Property LevelCount() As Integer
 Возвращает
 Возвращает количество уровней в массиве. Тип int.
 Описание
 Свойство обеспечивает доступ к количеству уровней ассоциативного массива.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.AssocArrayCommonParameters, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!