Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Surface.SetSubentityMaterial
 Послать отзыв
 Метод позволяет назначить новый материал указанному подобъекту данной поверхности.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetSubentityMaterial( SubentityId subEntityId, DatabaseServices.ObjectId materialId );
Копировать Код
Public Overridable Sub SetSubentityMaterial( subEntityId As SubentityId, materialId As DatabaseServices.ObjectId )
 Параметры
 Параметры
 Описание
 subEntityId
 Идентификатор подобъекта. Тип SubentityId.
 materialId
 Идентификатор материала, который назначается подобъекту. Тип DatabaseServices.ObjectId.
 Описание
 Метод позволяет назначить новый материал указанному подобъекту данной поверхности.
 Ссылки
 Teigha.DatabaseServices.Surface, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!