Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve3d.GetClosestPointTo
 Послать отзыв
 Метод позволяет найти с заданной точностью ближайшие точки между данной кривой и кривой, переданной в аргументе.
 Синтаксис
C#
Visual Basic
Копировать Код
public PointOnCurve3d[] GetClosestPointTo( ref Curve3d curve3d, Tolerance tolerance );
Копировать Код
Public Function GetClosestPointTo( ByRef curve3d As Curve3d, tolerance As Tolerance ) As PointOnCurve3d()
 Параметры
 Параметры
 Описание
 curve3d
 Кривая, для которой следует искать ближайшие точки. Тип Curve3d.
 tolerance
 Допуск, определяющий точность геометрических построений. Тип Tolerance.
 Возвращает
 Возвращает массив точек. Тип PointOnCurve3d[].
 Описание
 Метод позволяет найти с заданной точностью ближайшие точки между данной кривой и кривой, переданной в аргументе.
 Ссылки
 Teigha.Geometry.Curve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!