Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocDependency.DependentOnCompoundObject
 Послать отзыв
 Свойство возвращает родительский составной объект, к которому данная зависимость прикреплена как постоянный реактор.
 Синтаксис
C#
Visual Basic
Копировать Код
public CompoundObjectId DependentOnCompoundObject;
Копировать Код
Public Property DependentOnCompoundObject() As CompoundObjectId
 Возвращает
 Возвращает идентификатор составного объекта. Тип CompoundObjectId.
 Описание
 Свойство возвращает родительский составной объект, к которому данная зависимость прикреплена как постоянный реактор. Если зависимость не использует CompoundObjectId, свойство возвращает результат обращения к свойству DependentOnObject(), приведенный к типу CompoundObjectId.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.AssocDependency, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!