Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Matrix3d.Displacement
 Послать отзыв
 Метод формирует матрицу трансляции на заданный вектор.
 Синтаксис
C#
Visual Basic
Копировать Код
public Matrix3d Displacement( Vector3d vector );
Копировать Код
Public Function Displacement( vector As Vector3d ) As Matrix3d
 Параметры
 Параметры
 Описание
 vector
 Вектор трансляции. Тип Vector3d.
 Возвращает
 Возвращает матрицу перемещения на заданный вектор.
 Описание
 Метод формирует матрицу трансляции, которая описывает перемещение на заданный вектор (параллельный перенос).
 Ссылки
 Teigha.Geometry.Matrix3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!