Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Событие Database.AbortSave
 Послать отзыв
 Синтаксис
C#
Visual Basic
public event EventHandler AbortSave;
Public Event AbortSave As EventHandler
 Описание
 Событие показывает, что база данных чертежа начала сохраняться, но сохранение не выполнилось и аварийно завершилось.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!