Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Angbase
 Послать отзыв
 Синтаксис
C#
Visual Basic
public double Angbase;
Public Property Angbase() As Double
 Описание
 Возвращает или устанавливает текущее значение ANGBASE для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!