Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.XrefComandeeredEventArgs.From
 Послать отзыв
 Свойство From представляет базу данных, на которую осуществляется внешняя ссылка.
 Синтаксис
C#
Visual Basic
Копировать Код
public Database From;
Копировать Код
Public ReadOnly Property From As Database
 Возвращает
 Возвращает базу данных. Тип Database.
 Описание
 Свойство From представляет базу данных, на которую осуществляется внешняя ссылка.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.XrefComandeeredEventArgs, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!