Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LayoutManager.CloneLayout
 Послать отзыв
 Метод клонирует заданный объект Layout, присваивает клонированному листу указанное имя и положение соответствующей вкладки.
 Синтаксис
C#
Visual Basic
Копировать Код
public void CloneLayout( ref String copyName, ref String newName, int newTabOrder );
Копировать Код
Public Sub CloneLayout( ByRef copyName As String, ByRef newName As String, newTabOrder As Integer )
 Параметры
 Параметры
 Описание
 copyName
 Имя клонируемого листа, String.
 newName
 Имя нового листа, String.
 newTabOrder
 Опциональный аргумент, определяющий место листа среди вкладок, тип int.
 Описание
 Метод клонирует заданный объект Layout, присваивает клонированному листу указанное имя и положение соответствующей вкладки.
 Ссылки
 Teigha.DatabaseServices.LayoutManager, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!