Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CurveBoundary.DegenerateCurve
 Послать отзыв
 Свойство DegenerateCurve представляет 2D-кривую в параметрическом пространстве для вырожденной границы.
 Синтаксис
C#
Visual Basic
Копировать Код
public Geometry.Curve2d DegenerateCurve;
Копировать Код
Public ReadOnly Property DegenerateCurve As Geometry.Curve2d
 Возвращает
 Возвращает двумерную кривую в параметрическом пространстве, которая соответствует вырожденной границе. Тип Curve2d.
 Описание
 Свойство DegenerateCurve представляет 2D-кривую в параметрическом пространстве для вырожденной границы.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.CurveBoundary, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!