Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Database.GetNearestLineWeight
 Послать отзыв
 Синтаксис
C#
Visual Basic
public LineWeight GetNearestLineWeight(int weight);
Public Function GetNearestLineWeight(weight As Integer) As LineWeight
 Параметры
 Параметры
 Описание
 weight
 Ширина в сотых долях миллиметра
 Описание
 Метод getNearestLineWeight() по значению ширины линии возвращает ближайшее к этому значению значение из перечисления LineWeight. Например, для значения 4 будет возвращено значение LineWeight005.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!