Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotType
 Послать отзыв
 Данное перечисление определяет типы области печати.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum PlotType { Display = 0, Extents = 1, Layout = 5, Limits = 2, View = 3, Window = 4 }
Копировать Код
Public Enum PlotType Display = 0 Extents = 1 Layout = 5 Limits = 2 View = 3 Window = 4 End Enum
 Члены
 Члены
 Описание
 Display
 Значение: 0. Display / Экран. Вывод на печать текущего видового экрана в пространстве модели или текущего вида в пространстве листа.
 Extents
 Значение: 1. Extents / Границы. Вывод на печать области чертежа, которая в данный момент содержит какие-либо объекты. Печатаются все объекты текущего пространства.
 Limits
 Значение: 2. Limits / Лимиты. Вывод на печать объектов чертежа, расположенных в пределах заданных границ сетки (лимитов четрежа). Этот тип печати доступен только в пространстве модели.
 View
 Значение: 3. View / Вид. Вывод на печать предварительно сохранённого именованного вида.
 Window
 Значение: 4. Window / Рамка. Вывод на печать объектов, которые расположены в пределах области, заданной прямоугольной рамкой выбора.
 Layout
 Значение: 5. Layout / Лист. Вывод на печать всех объектов, расположенных на листе. Этот тип печати недоступен в пространстве модели.
 Описание
 Данное перечисление определяет варианты задания области печати (Экран / Границы / Лимиты / Лист / Вид / Рамка).
 Ваши комментарии по поводу этого топика: Послать отзыв!