Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Surface.CreateSectionObjects
 Послать отзыв
 Метод позволяет получить массив объектов, которые образуются в результате рассечения данной поверхности указанной плоскостью.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual Entity[] CreateSectionObjects( ref Plane sectionPlane );
Копировать Код
Public Overridable Function CreateSectionObjects( ByRef sectionPlane As Plane ) As Entity()
 Параметры
 Параметры
 Описание
 sectionPlane
 Плоскость сечения. Тип Plane.
 Возвращает
 Возвращает массив объектов, созданных в результате построения сечения. Тип Entity[].
 Описание
 Метод позволяет получить массив объектов, которые образуются в результате рассечения данной поверхности указанной плоскостью.
 Замечания
 Данный метод реализован только в среде пространственного моделирования Spatial Modeler.
 Ссылки
 Teigha.DatabaseServices.Surface, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!