Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.KnotCollection.Clear
 Послать отзыв
 Метод удаляет из коллекции все элементы.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Clear();
Копировать Код
Public Sub Clear()
 Описание
 Метод удаляет из коллекции все элементы. Длина коллекции становится равной нулю.
 Ссылки
 Teigha.Geometry.KnotCollection, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!