Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.BoundedPlane.Set
 Послать отзыв
 Метод позволяет переопределить данный объект, используя указанные координаты начала и два вектора в этой плоскости.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Set( Point3d origin, Vector3d u, Vector3d v );
Копировать Код
Public Sub Set( origin As Point3d, u As Vector3d, v As Vector3d )
 Параметры
 Параметры
 Описание
 origin
 Новое положение точки начала. Тип Point3d.
 u
 Входной вектор u. Тип Vector3d.
 v
 Входной вектор v. Тип Vector3d.
 Описание
 Метод позволяет переопределить данный объект, используя указанные координаты начала и два вектора u и v в этой плоскости.
 Ссылки
 Teigha.Geometry.BoundedPlane, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!