Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Sun.Intensity
 Послать отзыв
 Свойство Intensity представляет значение интенсивности солнечного освещения.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Intensity;
Копировать Код
Public Property Intensity As Double
 Возвращает
 Возвращает интенсивность солнечного освещения. Тип double.
 Описание
 Свойство Intensity представляет значение интенсивности солнечного освещения.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Sun, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!