Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.TextVerticalMode
 Послать отзыв
 Перечисление TextVerticalMode определяет типы вертикального выравнивания текста.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum TextVerticalMode { TextBase = 0, TextBottom = 1, TextVerticalMid = 2, TextTop = 3 }
Копировать Код
Public Enum TextVerticalMode TextBase = 0 TextBottom = 1 TextVerticalMid = 2 TextTop = 3 End Enum
 Члены
 Члены
 Описание
 TextBase
 Значение: 0. По точке вставки вертикально выравнивается базовая линия текста. Базовая линия (англ. baseline) — воображаемая прямая линия, проходящая по нижнему краю прямых знаков (напр., 'n', 'x') без учёта свисаний и нижних выносных элементов (напр., в буквах 'p', 'у', 'ф').
 TextBottom
 Значение: 1. По точке вставки вертикально выравнивается нижняя граница текстового блока.
 TextVerticalMid
 Значение: 2. По точке вставки вертикально выравнивается средняя линия текстового блока.
 TextTop
 Значение: 3. По точке вставки вертикально выравнивается верхняя граница текстового блока.
 Описание
 Перечисление TextVerticalMode определяет поддерживаемые типы вертикального выравнивания текста.
 Ваши комментарии по поводу этого топика: Послать отзыв!