Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve2d.GetNormalPoint
 Послать отзыв
 Метод находит на данной кривой точку, в которой нормаль к кривой пройдет через указанную точку.
 Синтаксис
C#
Visual Basic
Копировать Код
public PointOnCurve2d GetNormalPoint( Point2d point );
Копировать Код
Public Function GetNormalPoint( point As Point2d ) As PointOnCurve2d
 Параметры
 Параметры
 Описание
 point
 Произвольная двумерная точка, через которую должна пройти нормаль к кривой. Тип Point2d.
 Возвращает
 Возвращает точку на кривой, в которой нормаль к кривой пройдет через входную точку point. Тип PointOnCurve2d.
 Описание
 Метод находит на данной кривой точку, в которой нормаль к кривой пройдет через указанную точку. Используется вызов Curve2d.GetNormalPoint(Point2d point, Tolerance tolerance) со значением точности, равным Tolerance.Global. Если на кривой окажется более одной такой точки, возвращается точка с наименьшим значением параметра.
 Замечания
 Нормаль к кривой в точке на кривой представляет собой линию, проходящую через эту точку и перпендикулярную касательному вектору в этой точке.
 Ссылки
 Teigha.Geometry.Curve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!