Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 DimStyleTableRecord.GetArrowId()
 Послать отзыв
 Метод предназначен для получения ObjectId блока левого или правого окончания размерной линии.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectId GetArrowId(DimArrowFlag whichArrow);
Копировать Код
Public Function GetArrowId(whichArrow As DimArrowFlag) As ObjectId
 Параметры
 Параметры
 Описание
 whichArrow
 параметр типа DimArrowFlag, указывающий, ObjectId какой именно стрелки нужно получить: первой (левой) или второй (правой)
 Возвращает
 Возвращает ObjectId блока окончания размерной линии.
 Описание
 Метод предназначен для получения ObjectId блока левого или правого окончания размерной линии.
 Ссылки
 Teigha.DatabaseServices.DimStyleTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!