Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.BeginWblockBlockEventArgs.From
 Послать отзыв
 Свойство возвращает базу данных, для которой выполняется операция Wblock.
 Синтаксис
C#
Visual Basic
Копировать Код
public Database From;
Копировать Код
Public Property From() As Database
 Возвращает
 Возвращает базу данных. Тип Database.
 Описание
 Свойство возвращает базу данных, для которой выполняется операция Wblock.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.BeginWblockBlockEventArgs, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!