Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Torus.GetAnglesInU
 Послать отзыв
 Метод предоставляет начальный и конечный углы U поворота образующей окружности вокруг оси симметрии тора.
 Синтаксис
C#
Visual Basic
Копировать Код
public double[] GetAnglesInU();
Копировать Код
Public Function GetAnglesInU() As Double()
 Возвращает
 Возвращает двухэлементный массив, в котором нулевой и первый элементы представляют начальное и конечное значения U, соответственно. Тип double[].
 Описание
 Метод предоставляет начальный и конечный углы U поворота образующей окружности вокруг оси симметрии тора (начальную и конечную долготу).
 Замечания
 Результатом является массив с начальными и конечными углами для параметра U. Индексы возвращаемого массива:
0 — Начальный угол U.
1 — Конечный угол U.
 Ссылки
 Teigha.Geometry.Torus, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!