Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор BeginInsertEventArgs.BeginInsertEventArgs
 Послать отзыв
 This is BeginInsertEventArgs, a member of class BeginInsertEventArgs.
 Синтаксис
C#
Visual Basic
internal BeginInsertEventArgs(ref Database from);
Friend Sub New(ByRef from As Database)
 Ссылки
 Teigha.DatabaseServices.BeginInsertEventArgs, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!