Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocManager.AddGlobalEvaluationCallback
 Послать отзыв
 Метод добавляет указанный обратный вызов в глобальный объект AssocEvaluationMultiCallback. Не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public void AddGlobalEvaluationCallback( ref Object callback, int order );
Копировать Код
Public Sub AddGlobalEvaluationCallback( ByRef callback As Object, order As Integer )
 Параметры
 Параметры
 Описание
 callback
 Пользовательский обратный вызов, на который будет ссылаться объект AssocEvaluationMultiCallback. Тип Object.
 order
 Порядок выполнения пользовательских обратных вызовов. Тип int. Обратный вызов с меньшим значением order вызывается раньше, чем вызовы с более высокими значениями order.
 Описание
 Метод добавляет указанный объект обратного вызова в глобальный объект AssocEvaluationMultiCallback. Дополнительно задается порядок order этого обратного вызова. На данный момент не реализован.
 Ссылки
 Teigha.DatabaseServices.AssocManager, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!