Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MText.ColumnGutterWidth
 Послать отзыв
 Свойство представляет расстояние между столбцами текста (просвет между текстовыми колонками).
 Синтаксис
C#
Visual Basic
Копировать Код
public double ColumnGutterWidth;
Копировать Код
Public Property ColumnGutterWidth As Double
 Возвращает
 Возвращает расстояние между столбцами. Тип double.
 Описание
 Свойство представляет расстояние между столбцами текста (просвет между текстовыми колонками).
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MText, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!