Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.ExternalBoundedSurface
 Послать отзыв
 Класс ExternalBoundedSurface представляет ограниченные поверхности, определения которых являются внешними по отношению к геометрической библиотеке nanoCAD.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Geometry::Entity3d Teigha::Geometry::Surface Teigha::Geometry::ExternalBoundedSurface
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdGeExternalBoundedSurface")] public sealed class ExternalBoundedSurface : Surface
Копировать Код
<Wrapper("OdGeExternalBoundedSurface")> Public NotInheritable Class ExternalBoundedSurface Inherits Surface
 Описание
 Класс ExternalBoundedSurface представляет ограниченные поверхности, определения которых являются внешними по отношению к геометрической библиотеке nanoCAD.
 Логически каждый экземпляр ExternalBoundedSurface включает экземпляр ExternalSurface, представляющий геометрию неограниченной поверхности, и коллекцию экземпляров CurveBoundary, каждый из которых представляет некоторую границу на этой неограниченной поверхности.
 С экземплярами ExternalBoundedSurface можно работать как с любыми объектами Surface. Следует учитывать, что данное представление является геометрическим, в классе ExternalBoundedSurface не представлена никакая топологическая информация.
 Операции, характерные для ограниченных поверхностей, в своих алгоритмах учитывают границы (пример — вычисление ближайших точек).
 Доступ к ExternalBoundedSurface можно получить как к соответствующей поверхности Surface, если она существует. Кроме того, что более эффективно, можно получить доступ к внешним данным в их нативной форме. Одним из примеров использования ExternalBoundedSurface является доступ к поверхности ACIS.
 Методы
 Конструкторы
 Teigha.Geometry.ExternalBoundedSurface
 Имя
 Описание
 ExternalBoundedSurface
 Это обзор перегрузок ExternalBoundedSurface.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Geometry.Entity3d
 Имя
 Описание
 Entity3d Методы
 Ниже перечислены методы класса Entity3d.
 Teigha.Geometry.Surface
 Имя
 Описание
 Surface Методы
 Ниже перечислены методы класса Surface.
 Surface Свойства
 Ниже перечислены свойства класса Surface.
 Teigha.Geometry.ExternalBoundedSurface
 Имя
 Описание
 ExternalBoundedSurface Методы
 Ниже перечислены методы класса ExternalBoundedSurface.
 ExternalBoundedSurface Свойства
 Ниже перечислены свойства класса ExternalBoundedSurface.
 Ссылки
 ExternalBoundedSurface Конструктор, ExternalBoundedSurface Методы, ExternalBoundedSurface Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!