Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод BlockReference.ConvertToStaticBlock ()
 Послать отзыв
 Синтаксис
C#
Visual Basic
public void ConvertToStaticBlock();
Public Sub ConvertToStaticBlock()
 Описание
 Преобразует экземпляр динамического блока в наследуемый (не динамический) анонимный блок. Note При успехе, ссылка на блок фиксирует свойства динамического блока их текущими значениями и он прекращает быть динамическим блоком. Он становится для всех целей анонимным блоком.
 Ссылки
 Teigha.DatabaseServices.BlockReference, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!