Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObject.PaperOrientation
 Послать отзыв
 Свойство предназначено для получения значения свойства ориентации листа аннотационного объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public PaperOrientationStates PaperOrientation;
Копировать Код
Public Property PaperOrientation() As PaperOrientationStates
 Возвращает
 Возвращает текущее значение свойств ориентации листа аннотационного объекта. Тип PaperOrientationStates
 Описание
 Свойство предоставляет значение свойства ориентации листа аннотационного объекта.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.DBObject, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!