Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeader.BlockScale
 Послать отзыв
 Свойство представляет масштаб отрисовки блока, используемого данным объектом MLeader.
 Синтаксис
C#
Visual Basic
Копировать Код
public Scale3d BlockScale;
Копировать Код
Public Property BlockScale As Scale3d
 Возвращает
 Возвращает масштаб блока. Тип Scale3d.
 Описание
 Свойство представляет масштаб отрисовки блока, используемого данным объектом MLeader.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MLeader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!