Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MentalRayRenderSettings.RayTraceDepth
 Послать отзыв
 Свойство RayTraceDepth представляет максимальную глубину (уровень рекурсии) при трассировке лучей.
 Синтаксис
C#
Visual Basic
Копировать Код
public MentalRayRenderSettingsTraitsTraceParameter RayTraceDepth;
Копировать Код
Public Property RayTraceDepth As MentalRayRenderSettingsTraitsTraceParameter
 Возвращает
 Возвращает максимальную глубину (уровень рекурсии) при трассировке лучей. Тип MentalRayRenderSettingsTraitsTraceParameter.
 Описание
 Свойство RayTraceDepth представляет максимальную глубину (уровень рекурсии) при трассировке лучей.
 Параметр MentalRayRenderSettingsTraitsTraceParameter хранит значения для максимальных уровней рекурсии отраженных лучей, преломленных лучей, а также суммарно отраженных и преломленных лучей.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MentalRayRenderSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!