Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.XrefSubCommandEventArgs
 Послать отзыв
 Класс XrefSubCommandEventArgs представляет данные для событий базы данных, связанных с подкомандами внешних ссылок (XrefSubCommandStart, XrefSubCommandEnd и XrefSubCommandAborted).
 Иерархия классов
Teigha::DatabaseServices::XrefSubCommandEventArgs
 Синтаксис
C#
Visual Basic
Копировать Код
public class XrefSubCommandEventArgs : EventArgs
Копировать Код
Public Class XrefSubCommandEventArgs Inherits EventArgs
 Описание
 Класс XrefSubCommandEventArgs представляет данные для событий базы данных, связанных с подкомандами внешних ссылок (XrefSubCommandStart, XrefSubCommandEnd и XrefSubCommandAborted).
 Топики
 Имя
 Описание
 XrefSubCommandEventArgs Свойства
 Ниже перечислены свойства класса XrefSubCommandEventArgs.
 Ссылки
 XrefSubCommandEventArgs Свойства, Топики, XrefSubCommandEventArgs Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!