Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Entity3d.IsEqualTo
 Послать отзыв
 Метод проверяет данный объект на равенство указанному объекту с использованием заданной геометрической точности.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsEqualTo( ref Entity3d entity, Tolerance tolerance );
Копировать Код
Public Function IsEqualTo( ByRef entity As Entity3d, tolerance As Tolerance ) As Boolean
 Параметры
 Параметры
 Описание
 entity
 Входной объект, с которым выполняется сравнение. Тип Entity3d.
 tolerance
 Заданная геометрическая точность. Тип Tolerance.
 Возвращает
 Возвращает true в случае равенства объектов, т.е. оба объекта имеют один тип, совпадающие наборы точек в пределах указанной точности и одинаковую параметризацию. В противном случае возвращает false.
 Описание
 Метод проверяет данный объект на равенство указанному объекту с использованием заданной геометрической точности.
 Ссылки
 Teigha.Geometry.Entity3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!