Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.BulgeVertexCollection.Contains
 Послать отзыв
 Метод проверяет, содержится ли в данной коллекции указанный объект BulgeVertex.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool Contains( ref BulgeVertex value );
Копировать Код
Public Function Contains( ByRef value As BulgeVertex ) As Boolean
 Параметры
 Параметры
 Описание
 value
 Искомый объект. Тип BulgeVertex.
 Возвращает
 Возвращает true, если искомый объект найден в коллекции. В противном случае возвращает false.
 Описание
 Метод проверяет, содержится ли в данной коллекции указанный объект BulgeVertex.
 Ссылки
 Teigha.DatabaseServices.BulgeVertexCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!