Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector3d.DotProduct
 Послать отзыв
 Метод реализует скалярное произведение данного вектора с входным 3D-вектором.
 Синтаксис
C#
Visual Basic
Копировать Код
public double DotProduct( Vector3d v );
Копировать Код
Public Function DotProduct( v As Vector3d ) As Double
 Параметры
 Параметры
 Описание
 v
 Входной трехмерный вектор. Тип Vector3d.
 Возвращает
 Возвращает результат скалярного произведения векторов. Тип double.
 Описание
 Метод реализует скалярное произведение данного вектора с входным 3D-вектором v.
 Ссылки
 Teigha.Geometry.Vector3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!