Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DwgFiler.ReadPoint3d
 Послать отзыв
 Метод предназначен для получения точки Point3d из текущего элемента данного объекта Filer.
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract Point3d ReadPoint3d();
Копировать Код
Public MustOverride Function ReadPoint3d() As Point3d
 Возвращает
 Возвращает трехмерную точку. Тип Point3d.
 Описание
 Метод предназначен для получения точки Point3d из текущего элемента данного объекта Filer.
 Ссылки
 Teigha.DatabaseServices.DwgFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!