Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Group.Selectable
 Послать отзыв
 Свойство позволяет определить, возможно ли выделение всей группы целиком.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool Selectable;
Копировать Код
Public Property Selectable As Boolean
 Возвращает
 Возвращает true, если группа допускает выделение. В противном случае возвращает false.
 Описание
 Свойство позволяет определить, возможно ли выделить данную группу, чтобы обрабатывать ее как единое целое.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Group, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!