Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Событие Database.XrefRestoreEnded
 Послать отзыв
 Синтаксис
C#
Visual Basic
public event EventHandler XrefRestoreEnded;
Public Event XrefRestoreEnded As EventHandler
 Описание
 Событие показывает, что внешняя ссылка была ранее выгружена, а затем загружена, но ее файл не был изменен.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!