Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SweptSurface.TwistAlongPath
 Послать отзыв
 Свойство TwistAlongPath представляет угол кручения профиля по мере его вытягивания по траектории.
 Синтаксис
C#
Visual Basic
Копировать Код
public double TwistAlongPath;
Копировать Код
Public Property TwistAlongPath As Double
 Возвращает
 Возвращает угол кручения. Тип double.
 Описание
 Свойство TwistAlongPath представляет угол кручения профиля по мере его вытягивания по траектории.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.SweptSurface, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!