Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LinkedTableData.SetSize
 Послать отзыв
 Метод позволяет задать размеры для данной таблицы.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetSize( int numRows, int numCols );
Копировать Код
Public Overridable Sub SetSize( numRows As Integer, numCols As Integer )
 Параметры
 Параметры
 Описание
 numRows
 Количество строк в таблице. Тип int.
 numCols
 Количество столбцов в таблице. Тип int.
 Описание
 Метод позволяет задать размеры для данной таблицы.
 Замечания
 Метод выбрасывает исключение eInvalidInput, если аргументы numRows и/или numCols окажутся отрицательными.
 Ссылки
 Teigha.DatabaseServices.LinkedTableData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!