Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Point2dCollection.AddRange
 Послать отзыв
 Метод добавляет в коллекцию массив объектов Point2d.
 Синтаксис
C#
Visual Basic
Копировать Код
public void AddRange( ref Point2d[] range );
Копировать Код
Public Sub AddRange( ByRef range() As Point2d )
 Параметры
 Параметры
 Описание
 range
 Входной массив объектов, которые добавляются в данную коллекцию. Тип Point2d[].
 Описание
 Метод добавляет в коллекцию массив объектов Point2d.
 Ссылки
 Teigha.Geometry.Point2dCollection, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!