Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Polyline2d.GetEnumerator
 Послать отзыв
 Метод предназначен для получения перечислителя коллекции.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual System.Collections.IEnumerator GetEnumerator();
Копировать Код
Public virtual Function GetEnumerator() As System.Collections.IEnumerator
 Возвращает
 Возвращает перечислитель, тип System.Collections.IEnumerator.
 Описание
 Метод предназначен для получения перечислителя коллекции.
 Ссылки
 Teigha.DatabaseServices.Polyline2d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!