Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DxfFiler.WriteInt16
 Послать отзыв
 Метод записывает в данный объект Filer указанное 16-разрядное целое число со знаком (short).
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract void WriteInt16( DxfCode opCode, short value );
Копировать Код
Public MustOverride Sub WriteInt16( opCode As DxfCode, value As Short )
 Параметры
 Параметры
 Описание
 opCode
 Групповой код DXF. Тип DxfCode.
 value
 Значение, которое следует записать. Тип short.
 Описание
 Метод записывает в данный объект Filer указанные групповой код DXF и 16-разрядное целое число со знаком (short).
 Ссылки
 Teigha.DatabaseServices.DxfFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!