Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Polyline2d.CurveFit
 Послать отзыв
 Метод создает гладкую кривую, состоящую из пар дуг, соединяющих каждую пару вершин. Эта операция эквивалентна коменде PEDIT с опцией "Fit".
 Синтаксис
C#
Visual Basic
Копировать Код
public void CurveFit();
Копировать Код
Public Sub CurveFit()
 Описание
 Метод создает гладкую кривую, состоящую из пар дуг, соединяющих каждую пару вершин. Кривая проходит через все вершины полилинии и использует любые направления касательной, заданные отдельными вершинами.
 Эта операция эквивалентна коменде PEDIT с опцией "Fit".
 Ссылки
 Teigha.DatabaseServices.Polyline2d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!