Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.NurbSurface.ModifyPositionAndTangent
 Послать отзыв
 Метод позволяет изменить положение точки на поверхности с указанным параметром ([u, v]) и касательные вектора в этой точке. В текущей версии не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public void ModifyPositionAndTangent( double dU, double dV, Point3d point, Vector3d uDeriv, Vector3d vDeriv );
Копировать Код
Public Sub ModifyPositionAndTangent( dU As Double, dV As Double, point As Point3d, uDeriv As Vector3d, vDeriv As Vector3d )
 Параметры
 Параметры
 Описание
 dU
 Входной параметр U. Тип double.
 dV
 Входной параметр V. Тип double.
 point
 Новые координаты точки на поверхности. Тип Point3d.
 uDeriv
 Касательный вектор в направлении u. Тип Vector3d.
 vDeriv
 Касательный вектор в направлении v. Тип Vector3d.
 Описание
 Метод позволяет изменить положение точки на поверхности с указанным параметром ([u, v]) и касательные вектора по u и v в этой точке. Соответствующим образом корректируются и локальные управляющие вершины. Если параметры uDeriv и vDeriv имеют значение NULL, изменится только положение точки.
 В текущей версии не реализован.
 Ссылки
 Teigha.DatabaseServices.NurbSurface, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!