Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод TableRegion.Equals
 Послать отзыв
 This is Equals, a member of class TableRegion.
 Синтаксис
C#
Visual Basic
public bool Equals(ref Object tRegion);
Public Function Equals(ByRef tRegion As Object) As bool
 Ссылки
 TableRegion Класс, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!