Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FullDwgVersion.ToString
 Послать отзыв
 Метод предназначен для формирования эквивалентного строкового представления данного объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public sealed override String ToString();
Копировать Код
Public NotOverridable Overrides Function ToString() As String
 Возвращает
 Возвращает эквивалентное представление данного объекта в виде строки. Тип String.
 Описание
 Метод предназначен для формирования эквивалентного строкового представления данного объекта.
 Ссылки
 Teigha.DatabaseServices.FullDwgVersion, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!