Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AbstractViewTableRecord.Brightness
 Послать отзыв
 Свойство Brightness предоставляет доступ к коэффициенту яркости для данного видового экрана.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Brightness;
Копировать Код
Public Property Brightness As Double
 Возвращает
 Возвращает значение коэффициента яркости. Тип double.
 Описание
 Свойство Brightness предоставляет доступ к коэффициенту яркости для данного видового экрана.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.AbstractViewTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!