Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector2dCollection.IsFixedSize
 Послать отзыв
 Свойство IsFixedSize позволяет проверить, является ли размер данной коллекции фиксированным.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual bool IsFixedSize;
Копировать Код
Public Overridable ReadOnly Property IsFixedSize As Boolean
 Возвращает
 Возвращает true, если размер данной коллекции является фиксированным. В противном случае возвращает false.
 Описание
 Свойство IsFixedSize позволяет проверить, является ли размер данной коллекции фиксированным.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.Vector2dCollection, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!