Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.SetSize
 Послать отзыв
 Метод позволяет изменить размер данной таблицы.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetSize( int numRows, int numCols );
Копировать Код
Public virtual Sub SetSize( numRows As Integer, numCols As Integer )
 Параметры
 Параметры
 Описание
 numRows
 Количество строк, тип int.
 numCols
 Количество столбцов, тип int.
 Описание
 Метод позволяет изменить размер данной таблицы.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!