Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Hatch.PatternSpace
 Послать отзыв
 Синтаксис
C#
Visual Basic
public double PatternSpace;
Public Property PatternSpace() As Double
 Описание
 Обеспечивает доступ к размеру образца объекта заливки.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Hatch, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!