Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve3d.SetInterval
 Послать отзыв
 Метод переопределяет параметрический интервал данной кривой.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetInterval( ref Interval value );
Копировать Код
Public Sub SetInterval( ByRef value As Interval )
 Параметры
 Параметры
 Описание
 value
 Входной параметрический интервал, на котором определена кривая. Тип Interval.
 Описание
 Метод переопределяет параметрический интервал данной кривой.
 Ссылки
 Teigha.Geometry.Curve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!