Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Polyline.GetStartWidthAt
 Послать отзыв
 Синтаксис
C#
Visual Basic
public double GetStartWidthAt(int index);
Public Function GetStartWidthAt(index As Integer) As Double
 Параметры
 Параметры
 Описание
 index
 Индекс (отсчитываемый от 0) вершины
 Описание
 Метод возвращает начальную ширину линии в вершине index.
 Ссылки
 Teigha.DatabaseServices.Polyline, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!