Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.TransformOverrule.SetCustomFilter
 Послать отзыв
 Этот метод включает использование метода IsApplicable, чтобы устанавливать применимость объектного переопределения.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetCustomFilter();
Копировать Код
Public Sub SetCustomFilter()
 Описание
 Этот метод включает использование метода IsApplicable, чтобы устанавливать применимость объектного переопределения.
 Ссылки
 Teigha.DatabaseServices.TransformOverrule, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!