Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SweepOptionsCheckSweepCurveOut.Planarity
 Послать отзыв
 Свойство Planarity представляет оценку планарности объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.Planarity Planarity;
Копировать Код
Public ReadOnly Property Planarity As DatabaseServices.Planarity
 Возвращает
 Возвращает оценку планарности объекта как значение из перечисления DatabaseServices.Planarity.
 Описание
 Свойство Planarity представляет оценку планарности (плоскостности) объекта.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.SweepOptionsCheckSweepCurveOut, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!