Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Entity.ForceAnnoAllVisible
 Послать отзыв
 Свойство предназначено для получения или установки значения системной переменной ANNOALLVISIBLE, которая определяет, будут ли все аннотативные объекты видны при различных масштабах представления.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool ForceAnnoAllVisible;
Копировать Код
Public Property ForceAnnoAllVisible() As bool
 Возвращает
 Возвращает значение типа bool, где true указывает, что все аннотативные объекты отображаются независимо от текущего масштаба, а false — что их видимость зависит от установленных параметров масштабирования.
 Описание
 Свойство предоставляет доступ к значению или устанавливает текущее значение системной переменной ANNOALLVISIBLE.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Entity, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!