Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.SetAlignment
 Послать отзыв
 Метод позволяет задать выравнивание текста или вхождения блока в указанной ячейке таблицы.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetAlignment( int row, int col, CellAlignment align );
Копировать Код
Public virtual Sub SetAlignment( row As Integer, col As Integer, align As CellAlignment )
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 col
 Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
 align
 Тип выравнивания из перечисления CellAlignment.
 Описание
 Метод позволяет задать выравнивание текста или вхождения блока в указанной ячейке таблицы.
 Замечания
 Для получения того же результата предпочтительнее использовать Table.Cells[row,column].Alignment.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!