Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Viewport.BackClipOn
 Послать отзыв
 Свойство BackClipOn позволяет определить, включен ли в данном видовом экране режим заднего отсечения.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool BackClipOn;
Копировать Код
Public Property BackClipOn As Boolean
 Возвращает
 Возвращает true, если режим заднего отсечения включен. В противном случае возвращает false.
 Описание
 Свойство BackClipOn позволяет определить, включен ли в данном видовом экране режим заднего отсечения.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Viewport, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!