Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DataTypeParameter.UnitType
 Послать отзыв
 Свойство UnitType представляет тип единиц измерения для этого экземпляра структуры.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.UnitType UnitType;
Копировать Код
Public Property UnitType As DatabaseServices.UnitType
 Возвращает
 Возвращает тип единиц измерения. Значение из перечисления DatabaseServices.UnitType.
 Описание
 Свойство UnitType представляет тип единиц измерения для этого экземпляра структуры.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.DataTypeParameter, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!