Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.RasterVariables.ImageQuality
 Послать отзыв
 Свойство ImageQuality представляет качество отображения растрового изображения.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual DatabaseServices.ImageQuality ImageQuality;
Копировать Код
Public Overridable Property ImageQuality As DatabaseServices.ImageQuality
 Возвращает
 Возвращает настройку качества изображения. Значение из перечисления DatabaseServices.ImageQuality.
 Описание
 Свойство ImageQuality представляет текущую настройку качества отображения растрового изображения.
 Это свойство позволяет управлять балансом (скорость отображения - качество отображаемого изображения). В черновом режиме используются алгоритмы дискретизации и обработки, выигрывающие в скорости ценой снижения качества изображения. В режиме высокого качества используются более ресурсоемкие алгоритмы, которые как правило генерируют более точные и визуально приемлемые результаты.
 Замечания
 Данное свойство применяется только для вывода на дисплей. Печатная версия изображения всегда создается в режиме высокого качества.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.RasterVariables, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!