Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FormattedTableData.SetMargin
 Послать отзыв
 Метод позволяет задать размер полей в указанной ячейке, строке или столбце.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetMargin( int row, int column, CellMargins margin, double value );
Копировать Код
Public Overridable Sub SetMargin( row As Integer, column As Integer, margin As CellMargins, value As Double )
 Параметры
 Параметры
 Описание
 row
 Индекс строки. Тип int. Может принимать значение -1.
 column
 Индекс столбца. Тип int. Может принимать значение -1.
 margin
 Тип поля из перечисления CellMargins.
 value
 Новый размер полей. Тип double.
 Описание
 Метод позволяет задать размер полей (расстояний между границами и содержимым) в указанной ячейке, строке или столбце.
 Чтобы указать ячейку, следует передать действительные индексы строки и столбца. Чтобы указать строку, следует передать действительный индекс строки и -1 в качестве индекса столбца. Чтобы указать столбец, следует передать действительный индекс столбца и -1 в качестве индекса строки.
 Ссылки
 Teigha.DatabaseServices.FormattedTableData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!