Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DynamicBlockReferencePropertyCollection.Item
 Послать отзыв
 Свойство Item представляет элемент коллекции по указанному индексу.
 Синтаксис
C#
Visual Basic
Копировать Код
public DynamicBlockReferenceProperty this[int A_0];
Копировать Код
Public Property Item( A_0 As Integer ) As DynamicBlockReferenceProperty
 Параметры
 Параметры
 Описание
 A_0
 Индекс элемента коллекции. Тип int.
 Возвращает
 Возвращает элемент коллекции свойств. Тип DynamicBlockReferenceProperty.
 Описание
 Свойство Item представляет элемент коллекции по указанному индексу.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.DynamicBlockReferencePropertyCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!