Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector3d.OrthoProjectTo
 Послать отзыв
 Метод строит 3D-вектор, который является ортогональной проекцией данного вектора на заданную плоскость, проходящую через начало координат.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d OrthoProjectTo( Vector3d planeNormal );
Копировать Код
Public Function OrthoProjectTo( planeNormal As Vector3d ) As Vector3d
 Параметры
 Параметры
 Описание
 planeNormal
 Входной вектор нормали плоскости проецирования. Тип Vector3d.
 Возвращает
 Возвращает спроецированный вектор. Тип Vector3d.
 Описание
 Метод строит 3D-вектор, который является ортогональной проекцией данного вектора на плоскость, проходящую через начало координат и имеющую нормаль planeNormal.
 Ссылки
 Teigha.Geometry.Vector3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!