Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LoftOptionsBuilder.ToLoftOptions
 Послать отзыв
 Метод позволяет преобразовать данный объект в объект LoftOptions.
 Синтаксис
C#
Visual Basic
Копировать Код
public LoftOptions ToLoftOptions();
Копировать Код
Public Function ToLoftOptions() As LoftOptions
 Возвращает
 Возвращает результат преобразования. Тип LoftOptions.
 Описание
 Метод позволяет преобразовать данный объект в объект LoftOptions.
 Ссылки
 Teigha.DatabaseServices.LoftOptionsBuilder, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!