Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Событие Database.WblockNotice
 Послать отзыв
 Синтаксис
C#
Visual Basic
public event WblockNoticeEventHandler WblockNotice;
Public Event WblockNotice As WblockNoticeEventHandler
 Описание
 Событие показывает, что операция wblock начнет выполняться.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!