Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GeoLocationData.AddMeshPointMap
 Послать отзыв
 Метод добавляет по указанному индексу пару связанных точек - исходную точку и точку назначения.
 Синтаксис
C#
Visual Basic
Копировать Код
public void AddMeshPointMap( int index, Point2d sourcePt, Point2d destPt );
Копировать Код
Public Sub AddMeshPointMap( index As Integer, sourcePt As Point2d, destPt As Point2d )
 Параметры
 Параметры
 Описание
 index
 Входной индекс. Тип int.
 sourcePt
 Исходная точка. Тип Point2d.
 destPt
 Точка назначения. Тип Point2d.
 Описание
 Метод добавляет по указанному индексу пару связанных точек - исходную точку и точку назначения. Если указанный индекс недействителен, новая пара добавляется в конец массива сети.
 Ссылки
 Teigha.DatabaseServices.GeoLocationData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!