Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GripData.DrawAtDragImageGripPoint
 Послать отзыв
 Свойство определяет, следует ли отрисовывать глиф ручки в базовой точке перемещаемого изображения ручки.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool DrawAtDragImageGripPoint;
Копировать Код
Public Property DrawAtDragImageGripPoint As Boolean
 Возвращает
 Возвращает true, если глиф ручки должен отрисовываться. В противном случае возвращает false.
 Описание
 Свойство определяет, следует ли отрисовывать глиф ручки в базовой точке перемещаемого изображения ручки.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.GripData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!