Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.UnderlayReference.Monochrome
 Послать отзыв
 Свойство Monochrome позволяет определить, отображается ли содержимое подложки в монохромном режиме.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool Monochrome;
Копировать Код
Public Property Monochrome As Boolean
 Возвращает
 Возвращает true, если используется монохромный режим. В противном случае возвращает false.
 Описание
 Свойство Monochrome позволяет определить, отображается ли содержимое подложки в монохромном режиме.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.UnderlayReference, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!