Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObject
 Послать отзыв
 Этот класс является базовым классом для всех объектов, содержащихся в базе данных dwg-файла (Database).
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::GraphicsInterface::Drawable Teigha::DatabaseServices::DBObject
 Синтаксис
C#
Visual Basic
[Wrapper("AcDbObject" )] public class DBObject : GraphicsInterface::Drawable;
<Wrapper("AcDbObject" )> Public Class DBObject Inherits GraphicsInterface.Drawable
 Описание
 Этот класс является базовым классом для всех объектов, содержащихся в базе данных dwg-файла (Database).
 Замечания
 Создание и удаление объектов базы данных:
Объекты базы данных обычно создаются путем вызова Database.AddDBObject(). Когда объект создан, он находится в режиме OpenMode.ForWrite.
Экземпляры DBObject должны создаваться путем вызова метода AddDBObject().
Экземпляры DBObject создаются в режиме OpenMode.ForWrite.
Запрещено зависеть от других экземпляров DBObject при создании или удалении экземпляров.
Экземпляры DBObject должны удаляться из Database с помощью метода erase().
 Доступ к объектам базы данных:
Объекты базы данных должны быть открыты перед тем, как к ним можно будет получить доступ.
При наличии допустимого ObjectId объект базы данных открывается путем вызова Transaction.GetObject().
Объекты базы данных должны открываться в наиболее ограничительном режиме (если нет необходимости изменять объект, то OpenMode.ForRead).
 Объект может быть открыт в одном из следующих режимов:
 Режим
 Описание
 OpenMode.ForRead
 Позволяет выполнять операции, которые не изменяют этот объект. Объект базы данных может быть открыт в этом режиме любое количество раз (одновременно), если он не открыт в режимах ForWrite или ForNotify. Исключение будет выброшено, если попытаться выполнить любую операцию записи для объекта, открытого в этом режиме.
 OpenMode.ForWrite
 Позволяет выполнять операции чтения и записи для этого объекта. Объект базы данных может быть открыт в этом режиме только если он еще не открыт ни в каком другом режиме.
 OpenMode.ForNotify
 Объект открыт для целей уведомления. Объект базы данных может быть открыт в этом режиме, если он еще не открыт в режиме ForNotify.
 Методы
 Конструкторы
 Teigha.GraphicsInterface.Drawable
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 Drawable
 Конструктор класса Teigha.GraphicsInterface.Drawable. (Унаследован от Drawable)
 Teigha.DatabaseServices.DBObject
 Имя
 Описание
 DBObject
 Конструктор.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.GraphicsInterface.Drawable
 Имя
 Описание
 Drawable Методы
 Ниже перечислены методы класса Drawable.
 Drawable Свойства
 Ниже перечислены свойства класса Drawable.
 Teigha.DatabaseServices.DBObject
 Имя
 Описание
 DBObject Методы
 Ниже перечислены методы класса DBObject.
 DBObject Свойства
 Ниже перечислены свойства класса DBObject.
 DBObject События
 Ниже перечислены события класса DBObject.
 Ссылки
 DBObject Методы, DBObject Свойства, DBObject События, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства, DBObject События
 Ваши комментарии по поводу этого топика: Послать отзыв!