Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.BulgeVertex.BulgeVertex
 Послать отзыв
 Конструктор класса BulgeVertex.
 Синтаксис
C#
Visual Basic
Копировать Код
public BulgeVertex( Geometry.Point2d point, double bulge );
Копировать Код
Public Sub New( point As Geometry.Point2d, bulge As Double )
 Параметры
 Параметры
 Описание
 point
 2D-координаты новой вершины. Тип Geometry.Point2d.
 bulge
 Новое значение выпуклости. Тип double.
 Описание
 Конструктор класса BulgeVertex.
 Ссылки
 Teigha.DatabaseServices.BulgeVertex, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!