Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocAction
 Послать отзыв
 Класс AssocAction представляет ассоциативные действия, позволяющие реализовать ассоциативное поведение объектов.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::GraphicsInterface::Drawable Teigha::DatabaseServices::DBObject Teigha::DatabaseServices::AssocAction
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("AcDbAssocAction")] public class AssocAction : DBObject;
Копировать Код
<Wrapper("AcDbAssocAction")> Public Class AssocAction Inherits DBObject
 Описание
 Класс AssocAction представляет ассоциативные действия, позволяющие реализовать ассоциативное поведение объектов.
 Всякий объект, который должен отличаться ассоциативным поведением, т.е. должен автоматически обновляться ассоциативным механизмом в случае изменения влияющих на него объектов, должен быть производным от класса AssocActionBody (см. комментарии к классу AssocActionBody) и принадлежать родительскому объекту AssocAction. Действия полностью принадлежат своим родительским действиям. Например, удаление родительского действия удаляет и принадлежащее ему действие.
 Сам по себе класс AssocAction не имеет виртуальных методов, которые можно было бы переопределить, поэтому внешние разработчики не могут непосредственно наследовать класс AssocAction и переопределять его методы. Разработчики самой платформы nanoCAD в принципе могут наследовать класс AssocAction и переопределять его виртуальные методы, но к этому следует прибегать только в случае отсутствия всякой возможности создать прокси-объекты для объектов производных классов действий.
 Каждое действие принадлежит объекту AssocNetwork, который в свою очередь сам является действием, что делает возможным представление иерархических ассоциативных структур.
 Основным протоколом класса AssocAction является метод evaluate(), который вызывает метод evaluateOverride() принадлежащего ему объекта AssocActionBody.
 Действиям принадлежат объекты AssocDependency, которые позволяют действиям зависеть от любых объектов Objects. Связность в сети представлена следующим образом. В случае изменения объектов, от которых зависят зависимости, уведомления получают как сами зависимости, так и владеющие зависимостями действия, а также иерархия сетей, владеющих действиями. Эти уведомления лишь меняют статус AssocStatus зависимостей и действий/сетей, отражая сам факт изменений, но не приводя к перевычислению действий.
 Фактическое перевычисление действия происходит тогда, когда клиентский код вызывает метод evalaute() сети верхнего уровня. При этом автоматически перевычисляются все действия, которые принадлежат сети и которые нуждаются в обновлении, поскольку напрямую или опосредованно зависят от изменившихся объектов. Если некоторое действие изменяет зависимый объект (имеет write-dependency), и существует другое действие, которое использует этот измененный объект (имеет read-dependency), тогда при вычислении первого действия второе действие также потребует перевычисления
 Поток информации имеет следующий вид: Object1 --ReadDep--> Action1 --WriteDep1--> Object2 --ReadDep--> Action2 ...
 Обратите внимание, что действие может как зависеть от нескольких объектов, так может и изменять несколько других объектов. Сеть образует ориентированный ациклический граф.
 Алгоритм вычисления гарантирует, что вычисляются все требующие обновления действия, и что вычисления происходят в правильном порядке. Последнее означает, что всякое действие оценивается только после того, как были перевычислены все другие действия, изменяющие объекты, от которых это действие зависит. (В действительности ситуация несколько сложнее, поскольку есть и другие аспекты, контролирующие порядок вычислений.)
 Для перевычисления сети верхнего уровня базы данных следует использовать статический метод AssocManager.evaluateTopLevelNetwork(). Он подберет и вычислит все действия, которые в этом нуждаются. Явное перевычисление отдельных подсетей не рекомендуется.
 Методы
 Конструкторы
 Teigha.GraphicsInterface.Drawable
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 Drawable
 Конструктор класса Teigha.GraphicsInterface.Drawable. (Унаследован от Drawable)
 Teigha.DatabaseServices.DBObject
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 DBObject
 Конструктор. (Унаследован от DBObject)
 Teigha.DatabaseServices.AssocAction
 Имя
 Описание
 AssocAction
 Конструктор по умолчанию.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.GraphicsInterface.Drawable
 Имя
 Описание
 Drawable Методы
 Ниже перечислены методы класса Drawable.
 Drawable Свойства
 Ниже перечислены свойства класса Drawable.
 Teigha.DatabaseServices.DBObject
 Имя
 Описание
 DBObject Методы
 Ниже перечислены методы класса DBObject.
 DBObject Свойства
 Ниже перечислены свойства класса DBObject.
 DBObject События
 Ниже перечислены события класса DBObject.
 Teigha.DatabaseServices.AssocAction
 Имя
 Описание
 AssocAction Методы
 Ниже перечислены методы класса AssocAction.
 AssocAction Свойства
 Ниже перечислены свойства класса AssocAction.
 Ссылки
 AssocAction Методы, AssocAction Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства, DBObject События
 Ваши комментарии по поводу этого топика: Послать отзыв!