Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CellRange.TopLeft
 Послать отзыв
 Свойство возвращает верхнюю левую ячейку диапазона.
 Синтаксис
C#
Visual Basic
Копировать Код
public Cell TopLeft;
Копировать Код
Public ReadOnly Property TopLeft As Cell
 Возвращает
 Возвращает верхнюю левую ячейку диапазона. Тип Cell.
 Описание
 Свойство возвращает верхнюю левую ячейку диапазона.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.CellRange, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!