Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.OsnapOverrule.SetXDataFilter
 Послать отзыв
 Метод позволяет использовать расширенные данные в условии применимости объектного переопределения.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetXDataFilter( ref String registeredApplicationName );
Копировать Код
Public Sub SetXDataFilter( ByRef registeredApplicationName As String )
 Параметры
 Параметры
 Описание
 registeredApplicationName
 Имя зарегистрированного приложения, тип String.
 Описание
 Метод позволяет использовать расширенные данные в условии применимости объектного переопределения.
 Используйте этот метод, если требуется, чтобы перед вызовом любого из ваших переопределений nanoCAD выполнял фильтрацию переопределяемых объектов по имени RegisteredApplicationName в расширенных данных.
 Ссылки
 Teigha.DatabaseServices.OsnapOverrule, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!