Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AttributeReference.IsVerifiable
 Послать отзыв
 Свойство предоставляет доступ к флагу, который определяет статус "Контролируемый" данного объекта AttributeReference.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsVerifiable;
Копировать Код
Public Property IsVerifiable() As Boolean
 Возвращает
 Возвращает true, если объекту AttributeReference задан статус "Контролируемый". В противном случае возвращает false.
 Описание
 Свойство предоставляет доступ к флагу, который определяет статус "Контролируемый" данного объекта AttributeReference.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.AttributeReference, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!