Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Dimtzin
 Послать отзыв
 Синтаксис
C#
Visual Basic
public int Dimtzin;
Public Property Dimtzin() As Integer
 Описание
 Возвращает или устанавливает текущее значение DIMTZIN для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!