Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DgnReference.DgnReference
 Послать отзыв
 Конструктор класса DgnReference.
 Синтаксис
C#
Visual Basic
Копировать Код
public DgnReference( IntPtr unmanagedObjPtr, bool autoDelete );
Копировать Код
Public Sub New( unmanagedObjPtr As IntPtr, autoDelete As Boolean )
 Параметры
 Параметры
 Описание
 unmanagedObjPtr
 Неуправляемый указатель на исходный объект. Тип IntPtr.
 autoDelete
 Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.
 Описание
 Конструктор класса DgnReference.
 Ссылки
 Teigha.DatabaseServices.DgnReference, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!