Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.XrefFullSubentityPath.DxfOut
 Послать отзыв
 Метод записывает в указанный файлер данные DXF этого объекта с указанным смещением группового DXF.
 Синтаксис
C#
Visual Basic
Копировать Код
public void DxfOut( ref DatabaseServices.DxfFiler outputFiler, int groupCodeOffset );
Копировать Код
Public Sub DxfOut( ByRef outputFiler As DatabaseServices.DxfFiler, groupCodeOffset As Integer )
 Параметры
 Параметры
 Описание
 outputFiler
 Файлер, в который выполняется запись данных. Тип DatabaseServices.DxfFiler.
 groupCodeOffset
 Смещение группового кода DXF. Тип int.
 Описание
 Метод записывает в указанный DXF-файлер данные DXF этого объекта с указанным смещением группового DXF.
 Ссылки
 Teigha.DatabaseServices.XrefFullSubentityPath, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!