Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Cetransparency
 Послать отзыв
 This is Cetransparency, a member of class Database.
 Синтаксис
C#
Visual Basic
public Colors::Transparency Cetransparency;
Public Property Cetransparency() As Colors.Transparency
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!