Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Viewport.ViewTarget
 Послать отзыв
 Свойство ViewTarget представляет целевую точку данного видового экрана в мировой системе координат.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d ViewTarget;
Копировать Код
Public Property ViewTarget As Point3d
 Возвращает
 Возвращает целевую точку видового экрана в WCS. Тип Point3d.
 Описание
 Свойство ViewTarget представляет целевую точку данного видового экрана в мировой системе координат (МСК, WCS).
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Viewport, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!