Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.SetCellType
 Послать отзыв
 Метод позволяет задать тип ячейки, который будет применён к ячейке в указанной позиции.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetCellType( int row, int col, TableCellType type )
Копировать Код
Public virtual Sub SetCellType( row As Integer, col As Integer, type As TableCellType )
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 col
 Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
 type
 Новый тип ячейки из перечисления TableCellType. Допустимые значения для типа ячейки: TextCell и BlockCell.
 Описание
 Метод позволяет задать тип ячейки, который будет применён к ячейке в указанной позиции. Допустимые значения для типа ячейки: TextCell и BlockCell из перечисления TableCellType.
 Замечания
 Для получения того же результата предпочтительнее использовать функционал объекта Cell.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!