Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Viewport.Height
 Послать отзыв
 Свойство Height представляет высоту этого видового экрана в единицах чертежа.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Height;
Копировать Код
Public Property Height As Double
 Возвращает
 Возвращает высоту видового экрана в единицах чертежа. Тип double.
 Описание
 Свойство Height представляет высоту этого видового экрана в единицах чертежа.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Viewport, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!