Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.XrefFullSubentityPath.XrefObjHandles
 Послать отзыв
 Метод предоставляет упорядоченный массив дескрипторов объектов чертежа в базе данных.
 Синтаксис
C#
Visual Basic
Копировать Код
public Handle[] XrefObjHandles();
Копировать Код
Public Function XrefObjHandles() As Handle()
 Возвращает
 Возвращает упорядоченный массив дескрипторов объектов в базе данных. Тип Handle[].
 Описание
 Метод предоставляет упорядоченный массив дескрипторов объектов чертежа в базе данных.
 Ссылки
 Teigha.DatabaseServices.XrefFullSubentityPath, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!