Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Plane.IntersectWith
 Послать отзыв
 Метод вычисляет линейный сегмент, который представляет линию пересечения данной плоскости с указанной ограниченной плоскостью. Используется точность по умолчанию.
 Синтаксис
C#
Visual Basic
Копировать Код
public LineSegment3d IntersectWith( ref BoundedPlane boundPlane );
Копировать Код
Public Function IntersectWith( ByRef boundPlane As BoundedPlane ) As LineSegment3d
 Параметры
 Параметры
 Описание
 boundPlane
 Входная ограниченная плоскость. Тип BoundedPlane.
 Возвращает
 Возвращает линейный сегмент, который представляет линию пересечения. Тип LineSegment3d.
 Описание
 Метод вычисляет линейный сегмент, который представляет линию пересечения данной плоскости с указанной ограниченной плоскостью. Используется вызов метода Plane.IntersectWith(BoundedPlane boundPlane, Tolerance tolerance) с точностью, равной Tolerance.Global.
 Ссылки
 Teigha.Geometry.Plane, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!