Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DynamicBlockReferenceProperty.Description
 Послать отзыв
 Свойство Description возвращает описание данного свойства динамического блока.
 Синтаксис
C#
Visual Basic
Копировать Код
public String Description;
Копировать Код
Public ReadOnly Property Description As String
 Возвращает
 Возвращает описание свойства динамического блока. Тип String.
 Описание
 Свойство Description возвращает описание данного свойства динамического блока.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.DynamicBlockReferenceProperty, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!