Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeader.BlockContentId
 Послать отзыв
 Свойство представляет идентификатор ObjectId блока, на который ссылается данный объект MLeader.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.ObjectId BlockContentId;
Копировать Код
Public Property BlockContentId As DatabaseServices.ObjectId
 Возвращает
 Возвращает идентификатор объекта блока. Тип DatabaseServices.ObjectId.
 Описание
 Свойство представляет идентификатор ObjectId блока, на который ссылается данный объект MLeader.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MLeader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!