Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocArrayPolarParameters.SetAngleBetweenItems
 Послать отзыв
 Метод задает угол между соседними элементами кругового массива.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetAngleBetweenItems( double val, ref String expression, ref String evaluatorId );
Копировать Код
Public Sub SetAngleBetweenItems( val As Double, ByRef expression As String, ByRef evaluatorId As String )
 Параметры
 Параметры
 Описание
 val
 Новый угол между соседними элементами кругового массива. Указывается в радианах и должен быть положительным значением, которое укладывается в эквивалентный интервал (0–360] градусов. Тип double.
 expression
 Выражение для параметра. Тип String. Строка может быть пустой.
 evaluatorId
 Строковое представление идентификатора вычислителя. Тип String. Строка может быть пустой
 Описание
 Метод задает угол в радианах между базовыми точками соседних элементов кругового массива.
 Если для параметра выражение отсутствует, строки expression и evaluatorId должны быть пустыми.
 Ссылки
 Teigha.DatabaseServices.AssocArrayPolarParameters, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!