Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Body.BodyPtr
 Послать отзыв
 Свойство предоставляет указатель на геометрию, непосредственно связанную с данным объектом.
 Синтаксис
C#
Visual Basic
Копировать Код
public IntPtr BodyPtr;
Копировать Код
Public Property BodyPtr() As IntPtr
 Возвращает
 Возвращает указатель на геометрию данного объекта. Тип IntPtr.
 Описание
 Свойство предоставляет указатель на геометрию, непосредственно связанную с данным объектом.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Body, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!