Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve2d.Explode
 Послать отзыв
 Метод позволяет разбить данную кривую на составляющие ее подкривые.
 Синтаксис
C#
Visual Basic
Копировать Код
public Curve2d[] Explode( ref Interval interval );
Копировать Код
Public Function Explode( ByRef interval As Interval ) As Curve2d()
 Параметры
 Параметры
 Описание
 interval
 Параметрический интервал, на котором выполняется разбиение на подкривые. Тип Interval.
 Возвращает
 Возвращает массив подкривых. Тип Curve2d[].
 Описание
 Метод позволяет разбить данную кривую на составляющие ее подкривые.
 Ссылки
 Teigha.Geometry.Curve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!