Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.Dimtdec
 Послать отзыв
 Свойство задает или возвращает количество десятичных знаков после запятой в значениях допусков в основных единицах измерения.
 Синтаксис
C#
Visual Basic
Копировать Код
public int Dimtdec;
Копировать Код
Public Property Dimtdec As Integer
 Возвращает
 Возвращает количество десятичных знаков после запятой в значениях допусков. Тип int.
 Описание
 Свойство задает или возвращает количество десятичных знаков после запятой в значениях допусков в основных единицах измерения. Свойство оказывает влияние, только если включено отображение допусков (т.е. свойство Dimtol равно true).
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!