Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DwgFiler.ReadSoftPointerId
 Послать отзыв
 Метод предназначен для получения идентификатора мягкой ссылки на указатель (SoftPointerId) из текущего элемента данного объекта Filer.
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract ObjectId ReadSoftPointerId();
Копировать Код
Public MustOverride Function ReadSoftPointerId() As ObjectId
 Возвращает
 Возвращает идентификатора мягкой ссылки на указатель (SoftPointerId). Тип ObjectId.
 Описание
 Метод предназначен для получения идентификатора мягкой ссылки на указатель (SoftPointerId) из текущего элемента данного объекта Filer.
 Ссылки
 Teigha.DatabaseServices.DwgFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!