Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.MinimumColumnWidth
 Послать отзыв
 Метод позволяет получить для данной таблицы минимальную ширину столбца с заданным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual double MinimumColumnWidth( int col );
Копировать Код
Public virtual Function MinimumColumnWidth( col As Integer ) As double
 Параметры
 Параметры
 Описание
 col
 Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
 Возвращает
 Возвращает минимальную ширину столбца, тип double.
 Описание
 Метод позволяет получить для данной таблицы минимальную ширину столбца с заданным индексом.
 Замечания
 Для получения того же результата предпочтительнее использовать Table.Columns[col].MinimumWidth.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!