Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocArrayPolarParameters.GetFillAngle
 Послать отзыв
 Метод позволяет получить угол между первым и последним элементами кругового массива.
 Синтаксис
C#
Visual Basic
Копировать Код
public double GetFillAngle( out String expression, out String evaluatorId );
Копировать Код
Public Function GetFillAngle( ByRef expression As out String, ByRef evaluatorId As out String ) As Double
 Параметры
 Параметры
 Описание
 expression
 Выражение для параметра. Тип String. Строка может быть пустой.
 evaluatorId
 Строковое представление идентификатора вычислителя. Тип String. Строка может быть пустой
 Возвращает
 Возвращает угол в радианах между первым и последним элементами кругового массива. Тип double.
 Описание
 Метод позволяет получить угол в радианах между базовыми точками первого и последнего элементов кругового массива, который может варьироваться в интервале (0, 2PI].
 Если для параметра выражение отсутствует, то после выполнения метода строки expression и evaluatorId остаются пустыми.
 Ссылки
 Teigha.DatabaseServices.AssocArrayPolarParameters, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!