Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LayoutManager.LayoutSwitched
 Послать отзыв
 Cобытие создается после переключения листа.
 Синтаксис
C#
Visual Basic
Копировать Код
public event LayoutEventHandler LayoutSwitched;
Копировать Код
Public Event LayoutSwitched As LayoutEventHandler
 Описание
 Cобытие создается после переключения листа.
 Ссылки
 Teigha.DatabaseServices.LayoutManager, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!