Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.UnderlayReference.DefaultContrast
 Послать отзыв
 Свойство DefaultContrast представляет значение контраста по умолчанию.
 Синтаксис
C#
Visual Basic
Копировать Код
public static int DefaultContrast;
Копировать Код
Public Shared ReadOnly Property DefaultContrast As Integer
 Возвращает
 Возвращает значение контраста по умолчанию. Тип int.
 Описание
 Свойство DefaultContrast представляет значение контраста по умолчанию.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.UnderlayReference, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!