Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Point2d.+
 Послать отзыв
 Оператор сложения класса Point2d. Реализует сложение координат заданной точки с соответствующими компонентами заданного 2D-вектора.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point2d operator + ( Point2d a, Vector2d vector );
Копировать Код
Public Operator + ( a As Point2d, vector As Vector2d )
 Параметры
 Параметры
 Описание
 a
 Левый операнд. Тип Point2d.
 vector
 Правый операнд. Тип Vector2d.
 Возвращает
 Возвращает точку Point2d в новых координатах.
 Описание
 Оператор сложения класса Point2d. Реализует сложение координат точки a с соответствующими компонентами 2D-вектора vector, что эквивалентно перемещению точки a на заданный вектор.
 Ссылки
 Teigha.Geometry.Point2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!