Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CoordinateSystem2d.CoordinateSystem2d
 Послать отзыв
 Конструктор класса CoordinateSystem2d. Создает экземпляр класса с указанными параметрами.
 Синтаксис
C#
Visual Basic
Копировать Код
public CoordinateSystem2d( Point2d o, Vector2d x, Vector2d y );
Копировать Код
Public Sub New( o As Point2d, x As Vector2d, y As Vector2d )
 Параметры
 Параметры
 Описание
 o
 Точка начала системы координат. Тип Point2d.
 x
 Направляющий вектор оси X. Тип Vector2d.
 y
 Направляющий вектор оси Y. Тип Vector2d.
 Описание
 Конструктор класса CoordinateSystem2d. Создает экземпляр класса с указанными параметрами.
 Ссылки
 Teigha.Geometry.CoordinateSystem2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!