Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.PointOnCurve2d.GetDerivative
 Послать отзыв
 Метод переопределяет для данного объекта значение параметра и вычисляет в новой позиции производную кривой указанного порядка.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector2d GetDerivative( int order, double parameter );
Копировать Код
Public Function GetDerivative( order As Integer, parameter As Double ) As Vector2d
 Параметры
 Параметры
 Описание
 order
 Входной порядок производной. Тип int. Может принимать значения 1 или 2.
 parameter
 Новое значение параметра в данной точке на кривой. Тип double.
 Возвращает
 Возвращает вектор производной порядка order в данной точке на кривой. Тип Vector2d.
 Описание
 Метод переопределяет для данного объекта значение параметра и вычисляет в новой позиции производную кривой указанного порядка.
 Ссылки
 Teigha.Geometry.PointOnCurve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!