Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.TransformOverrule.Explode
 Послать отзыв
 Метод взрывает указанный в аргументе объект с получением множества более простых объектов.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void Explode( ref Entity entity, ref DBObjectCollection entitySet );
Копировать Код
Public virtual Sub Explode( ByRef entity As Entity, ByRef entitySet As DBObjectCollection )
 Параметры
 Параметры
 Описание
 entity
 Взрываемый объект. Тип Entity.
 entitySet
 Коллекция, в которую добавляются объекты, порождаемые взрывом объекта entity. Коллекция может содержать элементы перед выполнением метода; новые элементы добавляются в конец коллекции.
 Описание
 Метод взрывает указанный в аргументе entity объект с получением множества более простых объектов. Полученные объекты добавляются в коллекцию entitySet. Вновь созданные в результате взрыва объекты не являются резидентными в базе данных.
 Реализация этого метода по умолчанию порождает исключение eNotApplicable. Этот метод может переопределяться в пользовательских классах.
 Ссылки
 Teigha.DatabaseServices.TransformOverrule, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!