Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Layout.TabSelected
 Послать отзыв
 Включает/выключает доступ к вкладке листа при операциях выделения, затрагивающих несколько вкладок.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool TabSelected;
Копировать Код
Public Property TabSelected() As Boolean
 Возвращает
 Возвращает true, если включен доступ к вкладке листа при операциях выделения, затрагивающих несколько вкладок, и false в противном случае.
 Описание
 Включает/выключает доступ к вкладке листа при операциях выделения, затрагивающих несколько вкладок.
 Для множественного выделения в пользовательском интерфейсе можно использовать клик мышью при нажатой клавише Shift.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Layout, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!