Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DataLink.GetSourceFiles
 Послать отзыв
 Метод предоставляет внешние файлы, от которых зависит эта ссылка на данные.
 Синтаксис
C#
Visual Basic
Копировать Код
public ArrayList GetSourceFiles( DataLinkGetSourceContext nContext );
Копировать Код
Public Function GetSourceFiles( nContext As DataLinkGetSourceContext ) As ArrayList
 Параметры
 Параметры
 Описание
 nContext
 Входной контекст. В настоящее время не используется. Тип DataLinkGetSourceContext.
 Возвращает
 Возвращает массив внешних файлов. Тип ArrayList.
 Описание
 Метод предоставляет внешние файлы, от которых зависит эта ссылка на данные.
 Ссылки
 Teigha.DatabaseServices.DataLink, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!