Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Light.Position
 Послать отзыв
 Свойство представляет положение точечного источника света и прожектора.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d Position;
Копировать Код
Public Property Position As Point3d
 Возвращает
 Возвращает положение источника света в пространстве. Тип Point3d.
 Описание
 Свойство представляет положение точечного источника света и прожектора.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Light, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!