Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.VertexRef.VertexRef
 Послать отзыв
 Конструктор класса VertexRef. Создает ссылку на вершину на основе указанного объекта чертежа.
 Синтаксис
C#
Visual Basic
Копировать Код
public VertexRef( ref Teigha.DatabaseServices.Entity entity );
Копировать Код
Public Sub New( ByRef entity As Teigha.DatabaseServices.Entity )
 Параметры
 Параметры
 Описание
 entity
 Входной объект чертежа, 3D-точка. Тип Teigha.DatabaseServices.Entity.
 Описание
 Конструктор класса VertexRef. Создает ссылку на вершину на основе указанного объекта чертежа.
 Ссылки
 Teigha.DatabaseServices.VertexRef, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!