Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Longitude
 Послать отзыв
 Синтаксис
C#
Visual Basic
public double Longitude;
Public Property Longitude() As Double
 Описание
 Возвращает или устанавливает долготу расположения модели, в градусах. Допустимые значения от -180 до +180 градусов, а положительные значения соответствуют западной долготе.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!