Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObjectReferenceCollection.Item
 Послать отзыв
 Свойство Item предоставляет доступ к элементу коллекции с указанным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public DBObjectReference this[int iIndex];
Копировать Код
Default Public Property Item( iIndex As Integer ) As DBObjectReference
 Параметры
 Параметры
 Описание
 iIndex
 Индекс искомого элемента коллекции. Тип int.
 Возвращает
 Возвращает элемент коллекции с индексом iIndex. Тип DBObjectReference.
 Описание
 Свойство Item предоставляет доступ к элементу коллекции с указанным индексом.
 Замечания
 В случае недействительного значения iIndex выбрасывается исключение ArgumentOutOfRangeException.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.DBObjectReferenceCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!