Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DataColumn.InsertCellAt
 Послать отзыв
 Метод вставляет в столбец ячейку данных DataCell по указанному индексу.
 Синтаксис
C#
Visual Basic
Копировать Код
public void InsertCellAt( int index, ref DataCell cell );
Копировать Код
Public Sub InsertCellAt( index As Integer, ByRef cell As DataCell )
 Параметры
 Параметры
 Описание
 index
 Индекс, по которому следует вставить ячейку объект cell. Тип int. В случае недействительного индекса происходит завершение работы приложения, сопровождаемое сообщением 'Operation is not valid due to the current state of the object.' (Текущее состояния объекта не позволяет выполнить эту операцию.)
 cell
 Вставляемая ячейка данных. Тип DataCell.
 Описание
 Метод вставляет в столбец ячейку данных cell по указанному индексу index.
 Ссылки
 Teigha.DatabaseServices.DataColumn, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!