Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AlignedDimension.XLine1Point
 Послать отзыв
 Свойство предоставляет доступ на изменение к начальной точке первой выносной линии размера (в координатах WCS).
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d XLine1Point;
Копировать Код
Public Property XLine1Point() As Point3d
 Возвращает
 Возвращает начальную точку первой выносной линии размера (в координатах WCS). Тип Point3d.
 Описание
 Свойство предоставляет доступ на изменение к начальной точке первой выносной линии размера (в координатах WCS).
 Замечания
 Характер отображения выносной линии относительно этой точки определяет системная переменная DIMEXO. Начальная точка первой выносной линии соответствует группе DXF с кодом 13.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.AlignedDimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!