Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GetGripPointsFlags
 Послать отзыв
 Перечисление GetGripPointsFlags определяет флаги для точек привязки ручек.
 Синтаксис
C#
Visual Basic
Копировать Код
[Flags] [Wrapper("OdDbGripOperations.GetGripPointsFlags")] public enum GetGripPointsFlags { GripPointsOnly = 1, CyclableGripsOnly = 2, DynamicDimensionMode = 4 }
Копировать Код
<Flags> <Wrapper("OdDbGripOperations.GetGripPointsFlags")> Public Enum GetGripPointsFlags GripPointsOnly = 1 CyclableGripsOnly = 2 DynamicDimensionMode = 4 End Enum
 Члены
 Члены
 Описание
 GripPointsOnly
 Значение: 1. Только точки привязки ручек.
 CyclableGripsOnly
 Значение: 2. Только ручки, допускающие циклический перебор.
 DynamicDimensionMode
 Значение: 4. Режим динамических размеров.
 Описание
 Перечисление GetGripPointsFlags определяет флаги для точек привязки ручек.
 Ваши комментарии по поводу этого топика: Послать отзыв!