Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbCurve3d.NurbCurve3d
 Послать отзыв
 Конструктор класса NurbCurve3d. Создает NURBS кривую заданной степени, которая интерполирует вершины указанной полилинии и опционально может быть замкнутой.
 Синтаксис
C#
Visual Basic
Копировать Код
public NurbCurve3d( int degree, ref PolylineCurve3d fitPolyline, bool periodic );
Копировать Код
Public Sub New( degree As Integer, ByRef fitPolyline As PolylineCurve3d, periodic As Boolean )
 Параметры
 Параметры
 Описание
 degree
 Входная степень NURBS кривой. Тип int.
 fitPolyline
 3D-полилиния, вершины которой служат определяющими точками для NURBS кривой. Тип PolylineCurve3d.
 periodic
 Флаг, указывающий, что требуется получить периодическую (и замкнутую) NURBS кривую. Тип bool.
 Описание
 Конструктор класса NurbCurve3d. Создает NURBS кривую заданной степени, которая интерполирует вершины указанной полилинии и опционально может быть замкнутой.
 Замечания
 Более высокие значения степени делают кривую более гибкой. Например, степень 1 используется для определения полилинии, степень 2 используется для определения NURBS окружностей и круглых дуг (кривых постоянной кривизны) и т.д.
 Ссылки
 Teigha.Geometry.NurbCurve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!