Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство BlockReference.BlockTransform
 Послать отзыв
 Синтаксис
C#
Visual Basic
public Matrix3d BlockTransform;
Public Property BlockTransform() As Matrix3d
 Описание
 Возвращает или устанавливает позицию ссылки на блок (точку вставки), вектор нормали, масштаб, угол поворота, так что результирующее преобразование чертежа из MSC в WCS будет таким же, как и по матрице преобразования. MSC — это WCS в микропространстве записи таблицы блоков.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.BlockReference, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!