Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CompoundObjectId.IsEmpty
 Послать отзыв
 Свойство позволяет выяснить, содержит ли данные этот объект CompoundObjectId.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsEmpty;
Копировать Код
Public Property IsEmpty() As Boolean
 Возвращает
 Возвращает true, если этот объект является пустым, т.е. не содержит данных. В противном случае возвращает false.
 Описание
 Свойство позволяет выяснить, содержит ли данные этот объект CompoundObjectId.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.CompoundObjectId, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!