Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DynamicBlockReferencePropertyCollectionEnumerator.Reset
 Послать отзыв
 Этот метод сбрасывает позицию указателя перечислителя в начальное положение.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Reset();
Копировать Код
Public Sub Reset()
 Описание
 Метод Reset() сбрасывает позицию указателя перечислителя в начальное положение.
 Ссылки
 Teigha.DatabaseServices.DynamicBlockReferencePropertyCollectionEnumerator, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!