Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FieldEngine.FindEvaluator
 Послать отзыв
 Метод предоставляет вычислитель для указанного поля из набора зарегистрированных вычислителей, если поле не имеет идентификатора вычислителя.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual FieldEvaluator FindEvaluator( ref Field pField, ref String pszEvalId );
Копировать Код
Public Overridable Function FindEvaluator( ByRef pField As Field, ByRef pszEvalId As String ) As FieldEvaluator
 Параметры
 Параметры
 Описание
 pField
 Поле, для которого требуется найти вычислитель. Тип Field.
 pszEvalId
 Возвращаемый идентификатор найденного вычислителя поля. Тип String.
 Возвращает
 Возвращает найденный вычислитель поля FieldEvaluator или null, если соответствующий вычислитель поля не найден.
 Описание
 Метод предоставляет вычислитель для указанного поля из набора зарегистрированных вычислителей, если поле не имеет идентификатора вычислителя.
 Ссылки
 Teigha.DatabaseServices.FieldEngine, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!