Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector3dCollection.SyncRoot
 Послать отзыв
 Свойство SyncRoot предоставляет объект, который можно использовать для синхронизации доступа к данной коллекции.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual Object SyncRoot;
Копировать Код
Public Overridable ReadOnly Property SyncRoot As Object
 Возвращает
 Возвращает объект для синхронизации доступа к коллекции. Тип Object.
 Описание
 Свойство SyncRoot предоставляет объект, который можно использовать для синхронизации доступа к данной коллекции.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.Vector3dCollection, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!