Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор OrdinateDimension.OrdinateDimension (bool, Point3d, Point3d, String^, DatabaseServices::ObjectId)
 Послать отзыв
 This is OrdinateDimension, a member of class OrdinateDimension.
 Синтаксис
C#
Visual Basic
public OrdinateDimension(bool useXAxis, Point3d definingPoint, Point3d leaderEndPoint, ref String dimText, DatabaseServices::ObjectId dimStyle);
Public Sub New(useXAxis As bool, definingPoint As Point3d, leaderEndPoint As Point3d, ByRef dimText As String, dimStyle As DatabaseServices.ObjectId)
 Ссылки
 OrdinateDimension Класс, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!