Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Point2dCollection
 Послать отзыв
 Класс Point2dCollection представляет коллекцию двумерных точек.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Geometry::Point2dCollection
 Синтаксис
C#
Visual Basic
Копировать Код
[DefaultMember("Item")] [Wrapper("OdGePoint2dArray")] public sealed class Point2dCollection : DisposableWrapper, IList
Копировать Код
<DefaultMember("Item")> <Wrapper("OdGePoint2dArray")> Public NotInheritable Class Point2dCollection Inherits DisposableWrapper Implements IList
 Описание
 Класс Point2dCollection представляет коллекцию двумерных точек.
 Методы
 Конструкторы
 Teigha.Geometry.Point2dCollection
 Имя
 Описание
 Point2dCollection
 Это обзор перегрузок Point2dCollection.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Geometry.Point2dCollection
 Имя
 Описание
 Point2dCollection Данные
 Ниже перечислены данные класса Point2dCollection.
 Point2dCollection Методы
 Ниже перечислены методы класса Point2dCollection.
 Point2dCollection Свойства
 Ниже перечислены свойства класса Point2dCollection.
 Ссылки
 Point2dCollection Конструктор, Point2dCollection Данные, Point2dCollection Методы, Point2dCollection Свойства, Методы, Топики, Point2dCollection Данные, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!