Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SymbolUtilityServices.IsViewportActiveName
 Послать отзыв
 Метод позволяет проверить, соответствует ли входная строка активному имени видового экрана "*Active".
 Синтаксис
C#
Visual Basic
Копировать Код
public static bool IsViewportActiveName( ref String name );
Копировать Код
Public Shared Function IsViewportActiveName( ByRef name As String ) As Boolean
 Параметры
 Параметры
 Описание
 name
 Проверяемое имя. Тип String.
 Возвращает
 Возвращает true, если входная строка name соответствует активному имени видового экрана "*Active". В противном случае возвращает false.
 Описание
 Метод позволяет проверить, соответствует ли входная строка активному имени видового экрана "*Active".
 Ссылки
 Teigha.DatabaseServices.SymbolUtilityServices, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!