Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeader.MLeaderStyle
 Послать отзыв
 Свойство представляет идентификатор ObjectId используемого стиля мультивыноски.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.ObjectId MLeaderStyle;
Копировать Код
Public Property MLeaderStyle As DatabaseServices.ObjectId
 Возвращает
 Возвращает идентификатор стиля мультивыноски. Тип DatabaseServices.ObjectId.
 Описание
 Свойство представляет идентификатор ObjectId используемого стиля мультивыноски.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MLeader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!