Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CircularArc2d.GetTangent
 Послать отзыв
 Метод позволяет получить линию касательной к дуге в указанной точке, вычисленную с указанной точностью.
 Синтаксис
C#
Visual Basic
Копировать Код
public Line2d GetTangent( Point2d point, Tolerance tolerance );
Копировать Код
Public Function GetTangent( point As Point2d, tolerance As Tolerance ) As Line2d
 Параметры
 Параметры
 Описание
 point
 Входная точка, в которой требуется построить касательную к дуге. Тип Point2d.
 tolerance
 Входная точность геометрических вычислений. Тип Tolerance.
 Возвращает
 Возвращает линию касательной к дуге. Тип Line2d.
 Описание
 Метод позволяет получить линию касательной к дуге в указанной точке, вычисленную с указанной точностью.
 Ссылки
 Teigha.Geometry.CircularArc2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!