Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Событие Database.ObjectAppended
 Послать отзыв
 Синтаксис
C#
Visual Basic
public event ObjectEventHandler ObjectAppended;
Public Event ObjectAppended As ObjectEventHandler
 Описание
 Событие показывает, что объект добавлен в базу данных.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!