Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.DetailViewStyleDictionaryId
 Послать отзыв
 This is DetailViewStyleDictionaryId, a member of class Database.
 Синтаксис
C#
Visual Basic
public DatabaseServices::ObjectId DetailViewStyleDictionaryId;
Public Property DetailViewStyleDictionaryId() As DatabaseServices.ObjectId
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!