Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeader.MoveMLeader
 Послать отзыв
 Метод перемещает данный объект MLeader на заданный вектор.
 Синтаксис
C#
Visual Basic
Копировать Код
public void MoveMLeader( Vector3d vec, MoveType type );
Копировать Код
Public Sub MoveMLeader( vec As Vector3d, type As MoveType )
 Параметры
 Параметры
 Описание
 vec
 Вектор, определяющий направление и величину перемещения объекта. Тип Vector3d.
 type
 Вариант перемещения мультивыноски. Значение из перечисления MoveType.
 Описание
 Метод перемещает данный объект MLeader на заданный вектор. Аргумент type позволяет настроить опции перемещения.
 Ссылки
 Teigha.DatabaseServices.MLeader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!