Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GripData.WorldDraw
 Послать отзыв
 Метод предоставляет указатель на обратный вызов, который отвечает за отрисовку пользовательской графики глифа ручки, не зависящей от видового экрана.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool WorldDraw( ref GraphicsInterface.WorldDraw worldDraw, ObjectId entityId, DrawType t, Point3d? imageGripPoint, double dGripSize );
Копировать Код
Public Function WorldDraw( ByRef worldDraw As GraphicsInterface.WorldDraw, entityId As ObjectId, t As DrawType, imageGripPoint As Point3d?, dGripSize As Double ) As Boolean
 Параметры
 Параметры
 Описание
 worldDraw
 Входной интерфейс Teigha.GraphicsInterface.WorldDraw.
 entityId
 Идентификатор объекта чертежа. Тип ObjectId.
 t
 Тип отображения ручки. Перечисление GripData.DrawType.
 imageGripPoint
 Точка привязки ручки. Тип Point3d?.
 dGripSize
 Размер ручки. Тип double.
 Возвращает
 Возвращает true в случае успешного завершения операции. В противном случае возвращает false.
 Описание
 Метод предоставляет указатель на обратный вызов, который отвечает за отрисовку пользовательской графики глифа ручки, не зависящей от видового экрана. Возвращаемое значение может быть нулевым.
 Ссылки
 Teigha.DatabaseServices.GripData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!