Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.TableStyle.Format
 Послать отзыв
 Метод предназначен для получения формата, назначенного для строк указанного типа.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual String Format( RowType rowType );
Копировать Код
Public Overridable Function Format( rowType As RowType ) As String
 Параметры
 Параметры
 Описание
 rowType
 Тип строки. Перечисление RowType.
 Возвращает
 Возвращает пустую строку. Тип String.
 Описание
 Метод предназначен для получения формата, назначенного для строк указанного типа.
 Ссылки
 Teigha.DatabaseServices.TableStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!