Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.SetGridVisibility
 Послать отзыв
 Метод позволяет установить видимость сетки для данного типа линий сетки и типа строки объекта Table.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetGridVisibility( bool visible, int borders, int rows );
Копировать Код
Public virtual Sub SetGridVisibility( visible As Boolean, borders As Integer, rows As Integer )
 Параметры
 Параметры
 Описание
 visible
 Флаг видимости сетки, bool. Задать true, чтобы сетка была видимой, и false в противном случае.
 borders
 Типы линий сетки, для которых задаётся видимость, int. См. перечисление GridLineType.
 rows
 Тип строки объекта Table, для которого задаётся видимость, int. См. перечисление RowType.
 Описание
 Метод позволяет установить видимость сетки для данного типа линий сетки и типа строки объекта Table. Допускаются комбинации различных типов линий и типов строк.
 Замечания
 Для получения того же результата предпочтительнее использовать функционал объекта Cell.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!