Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Matrix2d.IsSingular
 Послать отзыв
 Метод позволяет проверить, является ли данная матрица сингулярной в пределах заданной точности.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsSingular( Tolerance tolerance );
Копировать Код
Public Function IsSingular( tolerance As Tolerance ) As Boolean
 Параметры
 Параметры
 Описание
 tolerance
 Заданная геометрическая точность. Тип Tolerance.
 Возвращает
 Возвращает true, если в пределах используемой точности хотя бы один из направляющих векторов координатных осей, возвращаемых свойством Matrix2d.CoordinateSystem2d, является нулевым, или эти векторы параллельны друг другу. В противном случае возвращает false.
 Описание
 Метод позволяет проверить, является ли данная матрица сингулярной в пределах заданной точности.
 Замечания
 Матрица является сингулярной, если для направляющих векторов координатных осей, возвращаемых свойством Matrix2d.CoordinateSystem2d, в пределах используемой точности выполняется хотя бы одно из следующих условий:
по крайней мере один из векторов имеет нулевую длину;
векторы являются параллельными друг другу.
 Ссылки
 Teigha.Geometry.Matrix2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!