Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MText.HeightChange
 Послать отзыв
 Свойство возвращает строку изменения высоты "H".
 Синтаксис
C#
Visual Basic
Копировать Код
public static String HeightChange;
Копировать Код
Public Shared ReadOnly Property HeightChange As String
 Возвращает
 Возвращает строку изменения высоты. Тип String.
 Описание
 Свойство возвращает строку изменения высоты "H". Может использоваться вместо строковой константы "H", чтобы сделать код более понятным. При использовании в строке, возвращаемой свойством MText.Contents, "H" означает изменение высоты.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.MText, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!