Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.BoundaryRepresentation.Node
 Послать отзыв
 Класс Node является интерфейсным классом для узлов сети.
 Иерархия классов
Teigha::BoundaryRepresentation::MeshEntity Teigha::BoundaryRepresentation::Node
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("AcBrNode")] public class Node : MeshEntity;
Копировать Код
<Wrapper("AcBrNode")> Public Class Node Inherits MeshEntity
 Описание
 Класс Node является интерфейсным классом для узлов сети.
 Замечания
 Этот класс реализован только в среде пространственного моделирования.
 Методы
 Конструкторы
 Teigha.BoundaryRepresentation.Node
 Имя
 Описание
 Node
 Конструктор по умолчанию класса Node.
 Топики
 Имя
 Описание
 MeshEntity Методы
 Ниже перечислены методы класса MeshEntity.
 MeshEntity Свойства
 Ниже перечислены свойства класса MeshEntity.
 Teigha.BoundaryRepresentation.Node
 Имя
 Описание
 Node Свойства
 Ниже перечислены свойства класса Node.
 Ссылки
 Node Свойства, Методы, Топики, MeshEntity Методы, MeshEntity Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!