Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Point3d.-
 Послать отзыв
 Оператор вычитания класса Point3d. Реализует вычитание из координат точки a координат точки b.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d operator - ( Point3d a, Point3d b );
Копировать Код
Public Operator - ( a As Point3d, b As Point3d )
 Параметры
 Параметры
 Описание
 a
 Левый операнд. Тип Point3d.
 b
 Правый операнд. Тип Point3d.
 Возвращает
 Возвращает 3D-вектор, компоненты которого определяются разностями соответствующих координат точек a и b. Тип Vector3d.
 Описание
 Оператор вычитания класса Point3d. Реализует вычитание из координат точки a координат точки b. Результатом является 3D-вектор, компоненты которого определяются разностями соответствующих координат точек a и b.
 Ссылки
 Teigha.Geometry.Point3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!