Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Scale3d.ExtractScale
 Послать отзыв
 Метод предоставляет вектор масштабирования, который соответствует длинам вектор-столбцов матрицы геометрического преобразования.
 Синтаксис
C#
Visual Basic
Копировать Код
public static Scale3d ExtractScale( Matrix3d mat );
Копировать Код
Public Shared Function ExtractScale( mat As Matrix3d ) As Scale3d
 Параметры
 Параметры
 Описание
 mat
 Входная матрица геометрического преобразования. Тип Matrix3d.
 Возвращает
 Возвращает вектор масштабирования, представленный преобразованием mat. Тип Scale3d.
 Описание
 Метод предоставляет вектор масштабирования, который соответствует длинам вектор-столбцов матрицы геометрического преобразования mat.
 Ссылки
 Teigha.Geometry.Scale3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!