Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FieldUpdateResult
 Послать отзыв
 Структура FieldUpdateResult представляет результаты вычисления полей.
 Иерархия классов
Teigha::DatabaseServices::FieldUpdateResult
 Синтаксис
C#
Visual Basic
Копировать Код
public struct FieldUpdateResult
Копировать Код
Public Structure FieldUpdateResult
 Описание
 Структура FieldUpdateResult используется для сохранения результатов вычисления полей.
 Топики
 Имя
 Описание
 FieldUpdateResult Данные
 Ниже перечислены данные класса FieldUpdateResult.
 Ссылки
 FieldUpdateResult Данные, Топики, FieldUpdateResult Данные
 Ваши комментарии по поводу этого топика: Послать отзыв!