Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FitData.EndTangent
 Послать отзыв
 Свойство возвращает направление касательной на конце сплайна.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d EndTangent;
Копировать Код
Public ReadOnly Property EndTangent As Vector3d
 Возвращает
 Возвращает направление касательной. Тип Vector3d.
 Описание
 Свойство возвращает направление касательной на конце сплайна.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.FitData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!