Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SectionState
 Послать отзыв
 Данное перечисление определяет типы секущей плоскости.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum SectionState { Plane = 1, Boundary = 2, Volume = 4 }
Копировать Код
Public Enum SectionState Plane = 1 Boundary = 2 Volume = 4 End Enum
 Члены
 Члены
 Описание
 Plane
 Значение: 1. Плоскость, неограниченная во всех направлениях.
 Boundary
 Значение: 2. Секущая плоскость ограничена линией сечения, двумя боковыми линиями и задней линией. Тем не менее, она простирается бесконечно вверх и вниз.
 Volume
 Значение: 4. Секущая плоскость ограничена передней, задней, верхней, нижней и боковыми линиями.
 Описание
 Данное перечисление определяет типы секущей плоскости (плоскость, граница или объем).
 Ваши комментарии по поводу этого топика: Послать отзыв!