Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.Dimpost
 Послать отзыв
 Свойство задает или возвращает префикс и/или суффикс размерного текста при использовании основных единиц измерения.
 Синтаксис
C#
Visual Basic
Копировать Код
public String Dimpost;
Копировать Код
Public Property Dimpost As String
 Возвращает
 Возвращает префикс и/или суффикс размерного текста. Тип String.
 Описание
 Свойство задает или возвращает префикс и/или суффикс размерного текста при использовании основных единиц измерения.
 Dimpost имеет вид prefix<>suffix. Пустые угловые скобки '<>' в Dimpost заменяются размерным текстом в основных единицах измерения.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!