Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.EllipticalArc3d.EndPoint
 Послать отзыв
 Свойство EndPoint представляет конечную точку данной эллиптической дуги.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d EndPoint;
Копировать Код
Public ReadOnly Property EndPoint As Point3d
 Возвращает
 Возвращает конечную точку эллиптической дуги. Тип Point3d.
 Описание
 Свойство EndPoint представляет конечную точку данной эллиптической дуги.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.EllipticalArc3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!