Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LayerStateRenameEventArgs
 Послать отзыв
 Класс LayerStateRenameEventArgs представляет данные для события LayerStateRename базы данных.
 Иерархия классов
Teigha::DatabaseServices::LayerStateRenameEventArgs
 Синтаксис
C#
Visual Basic
Копировать Код
public class LayerStateRenameEventArgs : EventArgs
Копировать Код
Public Class LayerStateRenameEventArgs Inherits EventArgs
 Описание
 Класс LayerStateRenameEventArgs представляет данные для события LayerStateRename базы данных.
 Топики
 Имя
 Описание
 LayerStateRenameEventArgs Свойства
 Ниже перечислены свойства класса LayerStateRenameEventArgs.
 Ссылки
 LayerStateRenameEventArgs Свойства, Топики, LayerStateRenameEventArgs Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!