Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Point3dCollection.IndexOf
 Послать отзыв
 Метод определяет индекс элемента коллекции, соответствующего указанной точке.
 Синтаксис
C#
Visual Basic
Копировать Код
public int IndexOf( Point3d p );
Копировать Код
Public Function IndexOf( p As Point3d ) As Integer
 Параметры
 Параметры
 Описание
 p
 Точка, для которой требуется определить индекс в коллекции. Тип Point3d.
 Возвращает
 Возвращает отсчитываемый от нуля индекс элемента коллекции, соответствующего точке p.
 Описание
 Метод определяет индекс элемента коллекции, соответствующего указанной точке p. Индекс отсчитывается от нуля.
 Ссылки
 Teigha.Geometry.Point3dCollection, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!