Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocArrayParameters.Owner
 Послать отзыв
 Свойство обеспечивает доступ к владельцу данного объекта AssocArrayParameters (т.е. к объекту AssocArray).
 Синтаксис
C#
Visual Basic
Копировать Код
public AssocArray Owner;
Копировать Код
Public Property Owner() As AssocArray
 Возвращает
 Возвращает объект AssocArray.
 Описание
 Свойство обеспечивает доступ к владельцу данного объекта AssocArrayParameters (т.е. к объекту AssocArray).
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.AssocArrayParameters, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!