Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CellBorder.Overrides
 Послать отзыв
 Свойство Overrides представляет переопределения свойств границы ячейки.
 Синтаксис
C#
Visual Basic
Копировать Код
public GridProperties? Overrides;
Копировать Код
Public Property [Overrides] As GridProperties?
 Возвращает
 Возвращает переопределения свойств границы ячейки. Перечисление GridProperties?.
 Описание
 Свойство Overrides представляет переопределения свойств границы ячейки.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.CellBorder, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!