Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Point2d.GetVectorTo
 Послать отзыв
 Метод строит вектор от данной точки до указанной.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector2d GetVectorTo( Point2d point );
Копировать Код
Public Function GetVectorTo( point As Point2d ) As Vector2d
 Параметры
 Параметры
 Описание
 point
 2D-точка, до которой требуется построить вектор. Тип Point2d.
 Возвращает
 Возвращает двумерный вектор, соединяющий данную точку с точкой point. Тип Vector2d.
 Описание
 Метод создает вектор, началом которого служит данная точка, а концом - входная точка point.
 Ссылки
 Teigha.Geometry.Point2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!