Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Luprec
 Послать отзыв
 Синтаксис
C#
Visual Basic
public int Luprec;
Public Property Luprec() As Integer
 Описание
 Возвращает или устанавливает текущее значение LUPREC для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!