Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector3d.Coordinate
 Послать отзыв
 Свойство предоставляет доступ к координате данного вектора, заданной её индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public double this[int index];
Копировать Код
Default Public ReadOnly Property Coordinate( index As Integer ) As Double
 Параметры
 Параметры
 Описание
 index
 Индекс координаты; тип int. 0 – координата X, 1 – координата Y, 2 - координата Z.
 Возвращает
 Возвращает значение координаты. Тип double
 Описание
 Свойство предоставляет доступ к координате данного вектора, заданной индексом index.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.Vector3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!