Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotStyle
 Послать отзыв
 Класс PlotStyle представляет стили печати.
 Иерархия классов
Teigha::DatabaseServices::PlotStyle
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdPsPlotStyleData")] public class PlotStyle : RXObject
Копировать Код
<Wrapper("OdPsPlotStyleData")> Public Class PlotStyle Inherits RXObject
 Описание
 Класс PlotStyle представляет стили печати.
 Топики
 Имя
 Описание
 PlotStyle Свойства
 Ниже перечислены свойства класса PlotStyle.
 Ссылки
 PlotStyle Свойства, Топики, PlotStyle Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!