Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Handle.GetHashCode
 Послать отзыв
 Возвращает хэш-код для данного объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public Int32 GetHashCode();
Копировать Код
Public Function GetHashCode() As Int32
 Возвращает
 Возвращает хэш-код для данного объекта, тип Int32.
 Описание
 Возвращает хэш-код для данного объекта. Подробности см. в документации Microsoft по .NET API.
 Ссылки
 Teigha.DatabaseServices.Handle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!