Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство DBText.IsDefaultAlignment
 Послать отзыв
 Синтаксис
C#
Visual Basic
public bool IsDefaultAlignment;
Public Property IsDefaultAlignment() As bool
 Описание
 Возвращает true, если текст выравнен по умолчанию.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.DBText, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!