Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AttributeDefinition.LockPositionInBlock
 Послать отзыв
 Свойство позволяет получить или задать флаг фиксации относительного положения объекта AttributeDefinition в блоке.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool LockPositionInBlock;
Копировать Код
Public Property LockPositionInBlock() As Boolean
 Возвращает
 Возвращает true, если определение атрибута не может смещаться относительно геометрии. В противном случае возвращает false.
 Описание
 Свойство позволяет получить или задать флаг фиксации относительного положения объекта AttributeDefinition в блоке. Если true, то определение атрибута не может смещаться относительно геометрии.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.AttributeDefinition, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!