Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.LinearEntity2d.Overlap
 Послать отзыв
 Метод позволяет определить область перекрытия данного объекта и указанного линейного объекта, вычисленную с некоторой заданной точностью.
 Синтаксис
C#
Visual Basic
Копировать Код
public LinearEntity2d Overlap( ref LinearEntity2d line, Tolerance tolerance );
Копировать Код
Public Function Overlap( ByRef line As LinearEntity2d, tolerance As Tolerance ) As LinearEntity2d
 Параметры
 Параметры
 Описание
 line
 Проверяемый линейный объект. Тип LinearEntity2d.
 tolerance
 Заданная геометрическая точность. Тип Tolerance.
 Возвращает
 Возвращает объект, который представляет область перекрытия. Тип LinearEntity2d.
 Описание
 Метод позволяет определить с некоторой заданной точностью, перекрывается ли данный объект с указанным линейным объектом, и если да, возвращает линейный объект, который представляет область их перекрытия. Возвращаемый объект может быть объектом любого производного класса LinearEntity2d, в зависимости от типов сравниваемых линий.
 Ссылки
 Teigha.Geometry.LinearEntity2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!