Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Leader.GetDimstyleData
 Послать отзыв
 Синтаксис
C#
Visual Basic
public DimStyleTableRecord GetDimstyleData();
Public Function GetDimstyleData() As DimStyleTableRecord
 Описание
 Метод возвращает информацию размерного стиля из записи DimStyleTableRecord, на которую ссылается данный объект в DimStyleTableRecord.
 Ссылки
 Teigha.DatabaseServices.Leader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!