Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotStyleData.AdaptiveLinetype
 Послать отзыв
 Свойство AdaptiveLinetype позволяет определить, является ли тип линии адаптивным в данном объекте.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool AdaptiveLinetype;
Копировать Код
Public Property AdaptiveLinetype As Boolean
 Возвращает
 Возвращает true только в том случае, если тип линии LineType является адаптивным. В противном случае возвращает false.
 Описание
 Свойство AdaptiveLinetype позволяет определить, является ли тип линии LineType адаптивным для данного объекта PlotStyleData.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.PlotStyleData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!