Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Database.GetDimstyleData
 Послать отзыв
 Синтаксис
C#
Visual Basic
public DimStyleTableRecord GetDimstyleData();
Public Function GetDimstyleData() As DimStyleTableRecord
 Описание
 Эта функция копирует значение переменной размера в DimStyleTableRecord.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!