Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DwgFiler.WriteBinaryChunk
 Послать отзыв
 Метод предназначен для записи заданного двоичного фрагмента в этот объект Filer.
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract void WriteBinaryChunk( ref unsigned char[] chunk );
Копировать Код
Public MustOverride Sub WriteBinaryChunk( ByRef chunk() As unsigned char )
 Параметры
 Параметры
 Описание
 chunk
 Двоичный фрагмент, который требуется записать в Filer. Тип unsigned char[].
 Описание
 Метод предназначен для записи заданного двоичного фрагмента chunk в этот объект Filer.
 Ссылки
 Teigha.DatabaseServices.DwgFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!