Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.BulgeVertexCollection.IndexOf
 Послать отзыв
 Метод возвращает индекс элемента данной коллекции, соответствующий указанному объекту BulgeVertex.
 Синтаксис
C#
Visual Basic
Копировать Код
public int IndexOf( ref BulgeVertex value );
Копировать Код
Public Function IndexOf( ByRef value As BulgeVertex ) As Integer
 Параметры
 Параметры
 Описание
 value
 Искомый объект типа BulgeVertex.
 Возвращает
 Возвращает индекс элемента данной коллекции, который соответствует аргументу value. Если элемент отсутствует, возвращает -1.
 Описание
 Метод возвращает индекс элемента данной коллекции, соответствующий указанному объекту BulgeVertex.
 Ссылки
 Teigha.DatabaseServices.BulgeVertexCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!