Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Matrix2d.IsScaledOrtho
 Послать отзыв
 Метод позволяет проверить, являются ли векторы в линейной части данной матрицы ортогональными друг другу в пределах точности по умолчанию.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsScaledOrtho();
Копировать Код
Public Function IsScaledOrtho() As Boolean
 Возвращает
 Возвращает true, если с указанной точностью векторы в линейной части данной матрицы можно считать ортогональными друг другу. В противном случае возвращает false.
 Описание
 Метод позволяет проверить, являются ли векторы в линейной части данной матрицы ортогональными друг другу. Используется вызов метода Matrix2d.IsScaledOrtho(Tolerance tolerance) с точностью по умолчанию, которая равна Tolerance.Global.
 Ссылки
 Teigha.Geometry.Matrix2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!