Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.ByBlockLinetype
 Послать отзыв
 Синтаксис
C#
Visual Basic
public DatabaseServices::ObjectId ByBlockLinetype;
Public Property ByBlockLinetype() As DatabaseServices.ObjectId
 Описание
 Возвращает Id объекта LinetypeTableRecord базы данных (BYBLOCK).
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!