Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SymbolUtilityServices.LinetypeContinuousName
 Послать отзыв
 Свойство LinetypeContinuousName представляет предопределенную запись символа для имени типа линий "Continuous".
 Синтаксис
C#
Visual Basic
Копировать Код
public static String LinetypeContinuousName;
Копировать Код
Public Shared ReadOnly Property LinetypeContinuousName As String
 Возвращает
 Возвращает предопределенное имя типа линий "Continuous". Тип String.
 Описание
 Свойство LinetypeContinuousName представляет предопределенную запись символа для имени типа линий "Continuous". Не может быть ни NULL, ни пустой строкой.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.SymbolUtilityServices, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!