Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CircularArc3d.IntersectWith
 Послать отзыв
 Метод позволяет найти с заданной точностью точки пересечения данной дуги с другой 3D-дугой.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d[] IntersectWith( ref CircularArc3d arc, Tolerance tolerance );
Копировать Код
Public Function IntersectWith( ByRef arc As CircularArc3d, tolerance As Tolerance ) As Point3d()
 Параметры
 Параметры
 Описание
 arc
 Входная дуга, точки пересечения с которой требуется найти. Тип CircularArc3d.
 tolerance
 Заданная точность вычислений. Тип Tolerance.
 Возвращает
 Возвращает массив точек пересечения двух дуг. Тип Point3d[].
 Описание
 Метод позволяет найти с заданной точностью точки пересечения данной дуги с другой 3D-дугой.
 Ссылки
 Teigha.Geometry.CircularArc3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!