Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocArray.GetParameters
 Послать отзыв
 Метод позволяет получить объект параметров данного ассоциативного массива.
 Синтаксис
C#
Visual Basic
Копировать Код
public AssocArrayParameters GetParameters();
Копировать Код
Public Function GetParameters() As AssocArrayParameters
 Возвращает
 Возвращает параметры ассоциативного массива. Тип AssocArrayParameters.
 Описание
 Метод позволяет получить объект параметров AssocArrayParameters данного ассоциативного массива.
 Ссылки
 Teigha.DatabaseServices.AssocArray, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!