Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Entity.FaceStyleId
 Послать отзыв
 Свойство предназначено для получения или установки идентификатора визуального стиля, применяемого к поверхностям (граням) трехмерного геометрического объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectId FaceStyleId;
Копировать Код
Public Property FaceStyleId() As ObjectId
 Возвращает
 Возвращает значение типа ObjectId, представляющее собой ссылку на объект стиля поверхности (FaceStyle), который определяет параметры отображения граней объекта, такие как цвет, текстура, освещение и затенение.
 Описание
 Свойство обеспечивает доступ к идентификатору визуального стиля только для поверхности объекта.
 Ссылки
 Teigha.DatabaseServices.Entity, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!