Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство RasterImageDef.IsLoaded
 Послать отзыв
 Синтаксис
C#
Visual Basic
public bool IsLoaded;
Public Property IsLoaded() As bool
 Описание
 Возвращает true, если изображение загружено. Заметим, что при "ленивой" загрузке изображение физически может и не находиться в памяти, даже хотя данное свойство возвращает true.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.RasterImageDef, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!