Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.HyperLinkCollection.Insert
 Послать отзыв
 Метод позволяет вставить указанную гиперссылку HyperLink в эту коллекцию по указанному индексу.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Insert( int index, ref HyperLink value );
Копировать Код
Public Sub Insert( index As Integer, ByRef value As HyperLink )
 Параметры
 Параметры
 Описание
 index
 Индекс в коллекции, по которому выполняется вставка нового элемента. Тип int.
 value
 Вставляемый элемент. Тип HyperLink.
 Описание
 Метод позволяет вставить указанную гиперссылку HyperLink в эту коллекцию в позицию с индексом index.
 Ссылки
 Teigha.DatabaseServices.HyperLinkCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!