Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Spline.EndFitTangent
 Послать отзыв
 Свойство EndFitTangent представляет касательный вектор в конечной определяющей точке.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d EndFitTangent;
Копировать Код
Public ReadOnly Property EndFitTangent As Vector3d
 Возвращает
 Возвращает касательный вектор. Тип Vector3d.
 Описание
 Свойство EndFitTangent представляет касательный вектор в конечной определяющей точке.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Spline, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!