Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocManager.AuditAssociativeData
 Послать отзыв
 Метод проверяет ассоциативные данные в базе данных и пытается устранить ошибки в случае их обнаружения. Не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public void AuditAssociativeData( ref Teigha.DatabaseServices.Database database, bool traverseWholeDatabase );
Копировать Код
Public Sub AuditAssociativeData( ByRef database As Teigha.DatabaseServices.Database, traverseWholeDatabase As Boolean )
 Параметры
 Параметры
 Описание
 database
 База данных, в которой необходимо проверять ассоциативные данные. Тип Teigha.DatabaseServices.Database.
 traverseWholeDatabase
 Если принимает значение true, то будут загружаться в память и проверяться все объекты в базе данных. Тип bool.
 Описание
 Метод проверяет ассоциативные данные в базе данных и пытается устранить ошибки в случае их обнаружения. Дополнительно логическим аргументом traverseWholeDatabase в метод можно передать указание проверять все объекты в базе данных и, следовательно, загружать их в память. На данный момент не реализован.
 Ссылки
 Teigha.DatabaseServices.AssocManager, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!