Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LoftOptions
 Послать отзыв
 Класс представляет параметры лофта - операции вытягивания поверхности по сечениям, используемые для создания как поверхностных, так и твердых тел. Параметры лофта используются для управления геометрией получаемой поверхности.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::DatabaseServices::LoftOptions
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdDbLoftOptions")] public class LoftOptions : DisposableWrapper, ICloneable;
Копировать Код
<Wrapper("OdDbLoftOptions")> Public Class LoftOptions Inherits DisposableWrapper Inherits ICloneable
 Описание
 Класс представляет параметры лофта - операции вытягивания поверхности по сечениям, используемые для создания как поверхностных, так и твердых тел. Параметры лофта используются для управления геометрией получаемой поверхности.
 Методы
 Конструкторы
 Teigha.DatabaseServices.LoftOptions
 Имя
 Описание
 LoftOptions
 Это обзор перегрузок LoftOptions.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.DatabaseServices.LoftOptions
 Имя
 Описание
 LoftOptions Методы
 Ниже перечислены методы класса LoftOptions.
 LoftOptions Свойства
 Ниже перечислены свойства класса LoftOptions.
 Ссылки
 LoftOptions Конструктор, LoftOptions Методы, LoftOptions Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!