Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.Dimscale
 Послать отзыв
 Свойство используется для управления общим масштабом размеров.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Dimscale;
Копировать Код
Public Property Dimscale As Double
 Возвращает
 Возвращает общий коэффициент масштабирования размеров. Тип double.
 Описание
 Свойство задает или возвращает общий коэффициент масштабирования, применяемый ко всем размерным переменным, которые регулируют размеры, отступы и расстояния.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!