Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbCurve2d.SetFitData
 Послать отзыв
 Метод перевычисляет сплайн, используя заданные определяющие точки, степень сплайна и точность интерполяции.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetFitData( int degree, ref Point2dCollection fitPoints, Tolerance fitTolerance );
Копировать Код
Public Sub SetFitData( degree As Integer, ByRef fitPoints As Point2dCollection, fitTolerance As Tolerance )
 Параметры
 Параметры
 Описание
 degree
 Степень сплайна. Тип int.
 fitPoints
 Массив определяющих точек сплайна. Тип Point2dCollection.
 fitTolerance
 Геометрическая точность. Тип Tolerance.
 Описание
 Метод перевычисляет сплайн, используя заданные определяющие точки fitPoints, степень сплайна degree и точность интерполяции fitTolerance.
 Замечания
 Если аргумент fitTolerance не равен 0, то построенный сплайн может не проходить через определяющие точки. Но максимальное отклонение построенного сплайна от любой определяющей точки не будет превышать fitTolerance.
 Чем выше степень, тем более гибким получается сплайн. Степень 1 определяет полилинии, а степень 2 определяет NURBS окружности и дуги и т.д.
 Ссылки
 Teigha.Geometry.NurbCurve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!