Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MText.TextStyleName
 Послать отзыв
 Свойство представляет имя текстового стиля, используемого данным объектом MText.
 Синтаксис
C#
Visual Basic
Копировать Код
public String TextStyleName;
Копировать Код
Public ReadOnly Property TextStyleName As String
 Возвращает
 Возвращает имя текстового стиля. Тип String.
 Описание
 Свойство представляет имя текстового стиля, используемого данным объектом MText
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.MText, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!