Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MTextFragment.Italic
 Послать отзыв
 Свойство позволяет проверить, представлен ли текст наклонным шрифтом.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool Italic;
Копировать Код
Public ReadOnly Property Italic As Boolean
 Возвращает
 Возвращает true, если текст представлен наклонным шрифтом. В противном случае возвращает false.
 Описание
 Свойство позволяет проверить, представлен ли текст наклонным шрифтом (italic).
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.MTextFragment, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!