Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SweepOptionsBuilder.SetSweepEntityTransform
 Послать отзыв
 Метод позволяет задать систему координат для вытягиваемого объекта в начале/конце траектории.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetSweepEntityTransform( ref Entity[] sweepEntities, bool displayErrorMessages );
Копировать Код
Public Sub SetSweepEntityTransform( ByRef sweepEntities() As Entity, displayErrorMessages As Boolean )
 Параметры
 Параметры
 Описание
 sweepEntities
 Массив объектов, которые используются операцией вытягивания по траектории. Тип Entity[].
 displayErrorMessages
 Флаг, определяющий, следует ли выводить сообщения об ошибках. Тип bool.
 Описание
 Метод позволяет задать систему координат для вытягиваемого объекта в начале/конце траектории.
 Ссылки
 Teigha.DatabaseServices.SweepOptionsBuilder, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!