Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.RowsCollection
 Послать отзыв
 Класс RowsCollection представляет коллекцию строк таблицы.
 Иерархия классов
Teigha::DatabaseServices::RowsCollection
 Синтаксис
C#
Visual Basic
Копировать Код
[DefaultMember("Item")] public sealed class RowsCollection : IEnumerable<Row>
Копировать Код
<DefaultMember("Item")> Public NotInheritable Class RowsCollection Implements IEnumerable(Of Row)
 Описание
 Класс RowsCollection представляет коллекцию строк таблицы.
 Топики
 Имя
 Описание
 RowsCollection Методы
 Ниже перечислены методы класса RowsCollection.
 RowsCollection Свойства
 Ниже перечислены свойства класса RowsCollection.
 Ссылки
 RowsCollection Методы, RowsCollection Свойства, Топики, RowsCollection Методы, RowsCollection Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!