Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SubentityOverrule.GetGripPointsAtSubentPath
 Послать отзыв
 Данный метод переопределяет метод Entity.GetGripPointsAtSubentityPath() и вызывает его при реализации по умолчанию.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void GetGripPointsAtSubentPath( ref Entity entity, FullSubentityPath subPath, ref GripDataCollection grips, double curViewUnitSize, int gripSize, Vector3d curViewDir, GetGripPointsFlags bitFlags );
Копировать Код
Public virtual Sub GetGripPointsAtSubentPath( ByRef entity As Entity, subPath As FullSubentityPath, ByRef grips As GripDataCollection, curViewUnitSize As double, gripSize As Integer, curViewDir As Vector3d, bitFlags As GetGripPointsFlags )
 Параметры
 Параметры
 Описание
 entity
 Объект чертежа, тип Entity.
 subPath
 Полный путь к подобъекту, идентифицирующий подобъект. Тип FullSubentityPath.
 grips
 Ручки объекта, тип GripDataCollection.
 curViewUnitSize
 Размер в пикселях единицы измерения чертежа в текущем видовом экране, тип double.
 gripSize
 Размер ручки (в пикселях), тип int.
 curViewDir
 Вектор, задающий направление вида (view direction) в текущем видовом экране. Тип Vector3d.
 bitFlags
 Маска для одного или нескольких флагов, заданных перечислением GetGripPointsFlags.
 Описание
 Данный метод переопределяет метод Entity.GetGripPointsAtSubentityPath() и вызывает его при реализации по умолчанию. Метод Entity.GetGripPointsAtSubentityPath() в реализации по умолчанию возвращает коллекцию ручек интересующего подобъекта. С помощью метода GetGripPointsAtSubentPath() настоящего класса можно переопределить механизм работы этого метода.
 Ссылки
 Teigha.DatabaseServices.SubentityOverrule, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!