Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LoftOptions.CheckLoftCurves
 Послать отзыв
 Метод позволяет проверить, допустимо ли сочетание указанных поперечных сечений с траекторией вытягивания, либо массивом направляющих, для успешного выполнения операции лофта.
 Синтаксис
C#
Visual Basic
Копировать Код
public LoftOptionsCheckCurvesOut CheckLoftCurves( ref Entity[] crossSectionCurves, ref Entity[] guideCurves, ref Entity pPathCurve, bool displayErrorMessages );
Копировать Код
Public Function CheckLoftCurves( ByRef crossSectionCurves() As Entity, ByRef guideCurves() As Entity, ByRef pPathCurve As Entity, displayErrorMessages As Boolean ) As LoftOptionsCheckCurvesOut
 Параметры
 Параметры
 Описание
 crossSectionCurves
 Массив кривых поперечных сечений. Тип Entity[].
 guideCurves
 Массив направляющих. Тип Entity[].
 pPathCurve
 Траектория вытягивания. Тип Entity.
 displayErrorMessages
 Флаг, определяющий, требуется ли отображать сообщения об ошибках. Тип bool. Значение по умолчанию - false.
 Возвращает
 Возвращает объект типа LoftOptionsCheckCurvesOut, свойства которого предоставляют следующие данные:
Если свойство AllOpen равно true, то все поперечные сечения являются разомкнутыми.
Если свойство AllClosed равно true, то все поперечные сечения являются замкнутыми.
Если свойство AllPlanar равно true, то все поперечные сечения являются плоскими.
 Описание
 Метод позволяет проверить, допустимо ли сочетание указанных поперечных сечений с траекторией вытягивания, либо массивом направляющих, для успешного выполнения операции лофта. Метод выбрасывает исключение eInvalidInput, если кривые недопустимы.
 Ссылки
 Teigha.DatabaseServices.LoftOptions, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!