Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AbstractViewportData.IsUcsFollowModeOn
 Послать отзыв
 Свойство IsUcsFollowModeOn позволяет определить, включен ли в видовом экране переход к отображению в плане при переключении с одной UCS (ПСК) на другую.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsUcsFollowModeOn;
Копировать Код
Public Property IsUcsFollowModeOn As Boolean
 Возвращает
 Возвращает true, если при каждой смене ПСК включен переход к отображению в плане. В противном случае возвращает false.
 Описание
 Свойство UcsFollowModeOn позволяет определить, включен ли в видовом экране переход к отображению в плане при переключении с одной пользовательской системы координат (ПСК, UCS) на другую. Когда этот режим включен, при каждом изменении ПСК в видовом экране происходит переключение на обновленный вид в плане.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.AbstractViewportData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!