Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocArrayCommonParameters.GetLevelSpacing
 Послать отзыв
 Метод предоставляет расстояние между уровнями в данном массиве.
 Синтаксис
C#
Visual Basic
public double GetLevelSpacing(ref [Out] String expression, ref [Out] String evaluatorId);
Копировать Код
Public Function GetLevelSpacing( ByRef expression As out String, ByRef evaluatorId As out String ) As Double
 Параметры
 Параметры
 Описание
 expression
 Выражение для параметра. Тип String.
 evaluatorId
 Полученный идентификатор вычислителя в строковом представлении. Тип String.
 Возвращает
 Возвращает расстояние между уровнями. Тип double.
 Описание
 Метод предоставляет расстояние между уровнями в данном массиве. Если для параметра выражение отсутствует, то после выполнения метода строки expression и evaluatorId остаются пустыми.
 1C# Syntax
 Копировать Код
public double GetLevelSpacing( out String expression, out String evaluatorId );
 Ссылки
 Teigha.DatabaseServices.AssocArrayCommonParameters, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!