Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbCurve3d.GetParametersOfG1Discontinuity
 Послать отзыв
 Метод предоставляет значения параметра всех точек сплайна с нарушенной G1 непрерывностью (неколлинеарность касательных векторов слева и справа от точки).
 Синтаксис
C#
Visual Basic
Копировать Код
public DoubleCollection GetParametersOfG1Discontinuity();
Копировать Код
Public Function GetParametersOfG1Discontinuity() As DoubleCollection
 Возвращает
 Возвращает массив значений параметра в точках с нарушенной G1 непрерывностью. Тип DoubleCollection.
 Описание
 Метод предоставляет значения параметра всех точек сплайна с нарушенной G1 непрерывностью. В таких точках касательные векторы слева и справа от точки не коллинеарны.
 Используется вызов метода NurbCurve3d.GetParametersOfG1Discontinuity(Tolerance tolerance) с точностью, равной Tolerance.Global.
 Ссылки
 Teigha.Geometry.NurbCurve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!