Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CubicSplineCurve3d.SetFirstDerivativeAt
 Послать отзыв
 Метод позволяет переопределить вектор первой производной в определяющей точке с указанным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetFirstDerivativeAt( int i, Vector3d derivative );
Копировать Код
Public Sub SetFirstDerivativeAt( i As Integer, derivative As Vector3d )
 Параметры
 Параметры
 Описание
 i
 Индекс определяющей точки. Тип int.
 derivative
 Новый вектор первой производной в указанной определяющей точке. Тип Vector3d.
 Описание
 Метод позволяет переопределить вектор первой производной в определяющей точке с указанным индексом.
 Ссылки
 Teigha.Geometry.CubicSplineCurve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!