Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbCurve2dFitData.==
 Послать отзыв
 Оператор равенства структуры NurbCurve2dFitData.
 Синтаксис
C#
Visual Basic
Копировать Код
public static bool operator ==( NurbCurve2dFitData a, NurbCurve2dFitData b );
Копировать Код
Public Shared Operator =( a As NurbCurve2dFitData, b As NurbCurve2dFitData ) As Boolean
 Параметры
 Параметры
 Описание
 a
 Левый операнд. Тип NurbCurve2dFitData.
 b
 Правый операнд. Тип NurbCurve2dFitData.
 Возвращает
 Возвращает true, если операнды равны друг другу. В противном случае возвращает false.
 Описание
 Оператор равенства структуры NurbCurve2dFitData.
 Замечания
 Два объекта типа NurbCurve2dFitData считаются равными, если одновременно выполняются следующие условия:
Определяющие точки совпадают;
Степени кривых равны;
Данные о касательных присутствуют или отсутствуют одновременно для обеих кривых;
Начальные векторы касательных равны;
Конечные векторы касательных равны.
 Ссылки
 Teigha.Geometry.NurbCurve2dFitData, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!