Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocDependency.GetDependenciesOnObject
 Послать отзыв
 Метод позволяет получить все зависимости, связанные с указанным объектом базы данных.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectIdCollection GetDependenciesOnObject( ref DBObject dbObj, bool readDependenciesWanted, bool writeDependenciesWanted );
Копировать Код
Public Function GetDependenciesOnObject( ByRef dbObj As DBObject, readDependenciesWanted As Boolean, writeDependenciesWanted As Boolean ) As ObjectIdCollection
 Параметры
 Параметры
 Описание
 dbObj
 Идентификатор объекта, из которого извлекаются зависимости. Тип DBObject.
 readDependenciesWanted
 Флаг, указывающий, следует ли извлекать зависимости чтения ("read-dependency"). Тип bool.
 writeDependenciesWanted
 Флаг, указывающий, следует ли извлекать зависимости записи ("write-dependency"). Тип bool.
 Возвращает
 Возвращает коллекцию ObjectId объектов, которые имеют зависимости чтения и/или записи от указанного объекта. Тип ObjectIdCollection.
 Описание
 Метод позволяет получить все зависимости, связанные с указанным объектом DBObject базы данных.
 Зависимости прикрепляются к объектам DBObject в виде постоянных реакторов, упорядочение зависимостей на каждом объекте определяется на основе значений свойства Order. Возвращаемая коллекция отражает корректную последовательность зависимостей.
 Ссылки
 Teigha.DatabaseServices.AssocDependency, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!