Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.EllipticalCone.Apex
 Послать отзыв
 Свойство Apex представляет положение вершины данного эллиптического конуса.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d Apex;
Копировать Код
Public ReadOnly Property Apex As Point3d
 Возвращает
 Возвращает точку в вершине данного эллиптического конуса. Тип Point3d.
 Описание
 Свойство Apex представляет положение вершины данного эллиптического конуса.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.EllipticalCone, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!