Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MText.TextStyleId
 Послать отзыв
 Свойство представляет идентификатор объекта стиля текста, используемого данным объектом MText.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.ObjectId TextStyleId;
Копировать Код
Public Property TextStyleId As DatabaseServices.ObjectId
 Возвращает
 Возвращает идентификатор объекта текстового стиля. Тип DatabaseServices.ObjectId.
 Описание
 Свойство представляет идентификатор объекта стиля текста, используемого данным объектом MText.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MText, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!