Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AttributeDefinition.Constant
 Послать отзыв
 Свойство получает или задает значение флага, определяющего, является ли данный объект AttributeDefinition постоянным.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool Constant;
Копировать Код
Public Property Constant() As Boolean
 Возвращает
 Возвращает true, если данный объект AttributeDefinition является постоянным. В противном случае возвращает false.
 Описание
 Свойство получает или задает значение флага, определяющего, является ли данный объект AttributeDefinition постоянным для всех вхождений блока (BlockReference). В таком случае атрибут не создается, а все вхождения блока BlockReferences ссылаются на определение AttributeDefinition в таблице блоков BlockTableRecord.
 Замечания
 Этот флаг отражает настройку бита 2 группового кода DXF 70. Если бит 2 установлен, то во время вставки блока с таким определением AttributeDefinition, атрибут создаваться не будет, а вхождения блока будут использовать определение атрибута из BlockTableRecord.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.AttributeDefinition, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!