Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FieldEngine.RegisterEvaluatorLoader
 Послать отзыв
 Метод регистрирует загрузчик вычислителя полей в движке FieldEngine.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void RegisterEvaluatorLoader( ref FieldEvaluatorLoader pLoader );
Копировать Код
Public Overridable Sub RegisterEvaluatorLoader( ByRef pLoader As FieldEvaluatorLoader )
 Параметры
 Параметры
 Описание
 pLoader
 Загрузчик вычислителя, который требуется зарегистрировать. Тип FieldEvaluatorLoader.
 Описание
 Метод выполняет регистрацию загрузчика вычислителя полей в движке FieldEngine.
 Замечания
 Вычислители полей должны регистрировать свой загрузчик в этом движке на этапе старта приложения. Движок предоставляет подходящий вычислитель полей, просматривая список зарегистрированных загрузчиков вычислителей.
 Ссылки
 Teigha.DatabaseServices.FieldEngine, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!