Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SubDMesh.GetCrease
 Послать отзыв
 Метод предназначен для получения величины сгиба для подобъекта сети, заданного идентификатором SubentityId.
 Синтаксис
C#
Visual Basic
Копировать Код
public double GetCrease( SubentityId id );
Копировать Код
Public Function GetCrease( id As SubentityId ) As double
 Параметры
 Параметры
 Описание
 id
 Идентификатор подобъекта. Тип SubentityId.
 Возвращает
 Возвращает величину сгиба, тип double.
 Описание
 Метод предназначен для получения величины сгиба для подобъекта сети, заданного идентификатором SubentityId.
 Ссылки
 Teigha.DatabaseServices.SubDMesh, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!