Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Событие Database.BeginWblockObjects
 Послать отзыв
 Синтаксис
C#
Visual Basic
public event BeginWblockObjectsEventHandler BeginWblockObjects;
Public Event BeginWblockObjects As BeginWblockObjectsEventHandler
 Описание
 Событие происходит один раз для базы данных во время выполнения каждого wblock клонирования.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!