Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CurveCurveIntersector3d.Set
 Послать отзыв
 Метод позволяет переопределить обе кривые в данном объекте. Точки пересечения вычисляются в пределах указанной точности.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Set( ref Curve3d curve1, ref Curve3d curve2, Vector3d planeNormal, Geometry.Tolerance tolerance );
Копировать Код
Public Sub Set( ByRef curve1 As Curve3d, ByRef curve2 As Curve3d, planeNormal As Vector3d, tolerance As Geometry.Tolerance )
 Параметры
 Параметры
 Описание
 curve1
 Первая входная кривая. Тип Curve3d.
 curve2
 Вторая входная кривая. Тип Curve3d.
 planeNormal
 Опциональный вектор нормали плоскости. Тип Vector3d.
 tolerance
 Заданная точность геометрических вычислений. Тип Geometry.Tolerance.
 Описание
 Метод позволяет переопределить обе кривые в данном объекте. Точки пересечения вычисляются в пределах указанной точности.
 Ссылки
 Teigha.Geometry.CurveCurveIntersector3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!