Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DatabaseSummaryInfoBuilder.ToDatabaseSummaryInfo
 Послать отзыв
 Метод предназначен для получения объекта DatabaseSummaryInfo, содержащий все подготовленные для него данные.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseSummaryInfo ToDatabaseSummaryInfo();
Копировать Код
Public Function ToDatabaseSummaryInfo() As DatabaseSummaryInfo
 Возвращает
 Возвращает объект DatabaseSummaryInfo.
 Описание
 Метод предназначен для получения объекта DatabaseSummaryInfo, содержащий все подготовленные для него данные.
 Ссылки
 Teigha.DatabaseServices.DatabaseSummaryInfoBuilder, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!