Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.RadialDimension.LeaderLength
 Послать отзыв
 Свойство LeaderLength представляет длину линии выноски данного размера.
 Синтаксис
C#
Visual Basic
Копировать Код
public double LeaderLength;
Копировать Код
Public Property LeaderLength As Double
 Возвращает
 Возвращает длину линии выноски. Тип double.
 Описание
 Свойство LeaderLength представляет длину линии выноски данного размера. Это расстояние от точки хорды ChordPoint до начала линии полки.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.RadialDimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!