Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DatabaseSummaryInfoBuilder.CustomProperties
 Послать отзыв
 Свойство обеспечивает доступ к объекту CustomProperties. Устарело, используйте свойство CustomPropertyTable.
 Синтаксис
C#
Visual Basic
Копировать Код
[Obsolete("Use CustomPropertyTable instead")] public StringDictionary CustomProperties;
Копировать Код
[Obsolete("Use CustomPropertyTable instead")] Public Property CustomProperties() As StringDictionary
 Возвращает
 Возвращает словарь StringDictionary.
 Описание
 Свойство обеспечивает доступ к объекту CustomProperties. Устарело, используйте свойство CustomPropertyTable.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.DatabaseSummaryInfoBuilder, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!