Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CubicSplineCurve3d.FirstDerivativeAt
 Послать отзыв
 Метод позволяет получить вектор первой производной в определяющей точке с заданным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d FirstDerivativeAt( int i );
Копировать Код
Public Function FirstDerivativeAt( i As Integer ) As Vector3d
 Параметры
 Параметры
 Описание
 i
 Индекс определяющей точки, в которой требуется вычислить вектор первой производной. Тип int.
 Возвращает
 Возвращает вектор первой производной в указанной определяющей точке сплайна. Тип Vector3d.
 Описание
 Метод позволяет получить вектор первой производной в определяющей точке с заданным индексом.
 Ссылки
 Teigha.Geometry.CubicSplineCurve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!