Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Spline.IsPlanar
 Послать отзыв
 Свойство IsPlanar позволяет проверить, что данный сплайн является плоским.
 Синтаксис
C#
Visual Basic
Копировать Код
public override bool IsPlanar;
Копировать Код
Public Overrides ReadOnly Property IsPlanar As Boolean
 Возвращает
 Возвращает true, если сплайн является плоским. В противном случае возвращает false.
 Описание
 Свойство IsPlanar позволяет проверить, что данный сплайн является плоским.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Spline, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!