Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PolygonMesh.SurfaceFit
 Послать отзыв
 Метод аппроксимирует гладкой поверхностью сеть контрольных точек, определяемую вершинами этой полигональной сети. Результат эквивалентен команде PEDIT с опцией "Smooth surface".
 Синтаксис
C#
Visual Basic
Копировать Код
public SurfaceFit( PolyMeshType surfType, int surfU, int surfV );
Копировать Код
Public Sub SurfaceFit( surfType As PolyMeshType, surfU As Integer, surfV As Integer )
 Параметры
 Параметры
 Описание
 surfType
 Тип поверхности из перечисления PolyMeshType (переопределяет системную переменную SURFTYPE).
 surfU
 Поверхностная плотность M (переопределяет системную переменную SURFU), тип int.
 surfV
 Поверхностная плотность N (переопределяет системную переменную SURFV), тип int.
 Описание
 Метод аппроксимирует гладкой поверхностью сеть контрольных точек, определяемую вершинами этой полигональной сети. Эта операция обеспечивает те же изменения, что и команда PEDIT с опцией "Smooth surface".
 Ссылки
 Teigha.DatabaseServices.PolygonMesh, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!