Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PropertiesOverrule.SetExtensionDictionaryEntryFilter
 Послать отзыв
 Метод включает предварительный поиск в словаре расширений для установления применимости объектного переопределения.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetExtensionDictionaryEntryFilter( ref String entryName );
Копировать Код
Public Sub SetExtensionDictionaryEntryFilter( ByRef entryName As String )
 Параметры
 Параметры
 Описание
 entryName
 Имя записи, тип String.
 Описание
 Метод включает предварительный поиск в словаре расширений для установления применимости объектного переопределения.
 Используйте этот метод, если требуется, чтобы перед вызовом любого из ваших переопределений nanoCAD искал в словаре расширений запись с именем entryName. Переопределения не будут вызываться, если запись с entryName не будет найдена в словаре расширений.
 Ссылки
 Teigha.DatabaseServices.PropertiesOverrule, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!