Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SectionSettings.HatchVisibility
 Послать отзыв
 Метод позволяет определить, отображается ли штриховка для геометрии указанного типа.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool HatchVisibility( SectionType nSecType, SectionGeometry nGeometry );
Копировать Код
Public Function HatchVisibility( nSecType As SectionType, nGeometry As SectionGeometry ) As Boolean
 Параметры
 Параметры
 Описание
 nSecType
 Тип сечения. Перечисление SectionType.
 nGeometry
 Типы элементов геометрии сечения. Перечисление SectionGeometry.
 Возвращает
 Возвращает true, если штриховка отображается. В противном случае возвращает false.
 Описание
 Метод позволяет определить, отображается ли штриховка для геометрии указанного типа.
 Ссылки
 Teigha.DatabaseServices.SectionSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!