Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Helix.Turns
 Послать отзыв
 Свойство обеспечивает доступ к количеству витков спирали.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Turns;
Копировать Код
Public Property Turns As Double
 Возвращает
 Возвращает текущее количество витков спирали. Тип double.
 Описание
 Свойство обеспечивает доступ к количеству витков спирали.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Helix, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!