Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve2d.GetArea
 Послать отзыв
 Метод вычисляет площадь под кривой на указанном параметрическом интервале.
 Синтаксис
C#
Visual Basic
Копировать Код
public double GetArea( double startParameter, double endParameter );
Копировать Код
Public Function GetArea( startParameter As Double, endParameter As Double ) As Double
 Параметры
 Параметры
 Описание
 startParameter
 Входное значение параметра для начала интервала. Тип double.
 endParameter
 Входное значение параметра для конца интервала. Должно превышать значение startParameter. Тип double. +
 Возвращает
 Возвращает значение площади под кривой на указанном параметрическом интервале. Тип double.
 Описание
 Метод предназначен для вычисления площади под кривой на параметрическом интервале, который определяется указанными значениями параметра. Используется вызов метода Curve2d.GetArea(Double startParameter, Double endParameter, Tolerance tolerance) с точностью Tolerance.Global.
 Ссылки
 Teigha.Geometry.Curve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!