Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DxfFiler.WriteByte
 Послать отзыв
 Метод записывает в данный объект Filer указанное байтовое значение.
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract void WriteByte( DxfCode opCode, unsigned char value );
Копировать Код
Public MustOverride Sub WriteByte( opCode As DxfCode, value As unsigned char )
 Параметры
 Параметры
 Описание
 opCode
 Групповой код DXF. Тип DxfCode.
 value
 Значение, которое следует записать. Тип unsigned char.
 Описание
 Метод записывает в данный объект Filer групповой код DXF и указанное байтовое значение.
 Ссылки
 Teigha.DatabaseServices.DxfFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!