Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObject.GetObjectSaveVersion(DxfFiler)
 Послать отзыв
 Метод позволяет получить номер версии чертежа и технического обновления.
 Синтаксис
C#
Visual Basic
Копировать Код
public FullDwgVersion GetObjectSaveVersion(DxfFiler filer);
Копировать Код
Public Function GetObjectSaveVersion(filer As DxfFiler) As FullDwgVersion
 Параметры
 Параметры
 Описание
 filer
 Набор данных, используемый для операции с dxf-файлом. Тип DxfFiler
 Возвращает
 Возвращает версию чертежа и технического обновления, в которой должен быть сохранен этот объект. Тип FullDxfVersion Реализация этого метода по умолчанию возвращает DxfFiler->DxfVersion.
 Предупреждение Не следует использовать Dwg(Dxf)Filer->Dwg(Dxf)Version() в ваших методах dwg(In/Out) и dxf(In/Out) — это не работает в экземплярах, производных от вашего класса. Вместо этого используйте GetObjectSaveVersion().
 Описание
 Чтобы определить, какую версию данного объекта сохранить, необходимо переопределить этот метод. Это не требует обращения к данному методу родительского класса.
 Ссылки
 Teigha.DatabaseServices.DBObject, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!