Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Point2dCollection.Count
 Послать отзыв
 Свойство Count представляет текущее количество элементов в данной коллекции.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual Int32 Count;
Копировать Код
Public Overridable ReadOnly Property Count As Int32
 Возвращает
 Возвращает текущее количество элементов в коллекции. Тип Int32.
 Описание
 Свойство Count представляет количество элементов, фактически содержащихся в данной коллекции.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.Point2dCollection, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!