Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DwgFiler.ReadSoftOwnershipId
 Послать отзыв
 Метод предназначен для получения идентификатора мягкой ссылки владения объектом (SoftOwnershipId) из текущего элемента данного объекта Filer.
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract ObjectId ReadSoftOwnershipId();
Копировать Код
Public MustOverride Function ReadSoftOwnershipId() As ObjectId
 Возвращает
 Возвращает идентификатор мягкой ссылки владения объектом. Тип ObjectId.
 Описание
 Метод предназначен для получения идентификатора мягкой ссылки владения объектом (SoftOwnershipId) из текущего элемента данного объекта Filer.
 Ссылки
 Teigha.DatabaseServices.DwgFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!