Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SubentityType
 Послать отзыв
 Перечисление SubentityType определяет типы подобъектов для объектов SubentityId.
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdDb.SubentType")] public enum SubentityType { Null = 0, Face = 1, Edge = 2, Vertex = 3, MlineCache = 4, Class = 5 }
Копировать Код
<Wrapper("OdDb.SubentType")> Public Enum SubentityType Null = 0 Face = 1 Edge = 2 Vertex = 3 MlineCache = 4 Class = 5 End Enum
 Члены
 Члены
 Описание
 Null
 Значение: 0. Подобъект отсутствует.
 Face
 Значение: 1. Подобъект представляет грань.
 Edge
 Значение: 2. Подобъект представляет ребро - графический объект типа линии, дуги и т.п.
 Vertex
 Значение: 3. Подобъект представляет вершину, связанную с объектом-точкой Point3d.
 MlineCache
 Значение: 4. Подобъект является элементом кеша мультилинии.
 Class
 Значение: 5. Свойство SubentId.TypeClass() не равно NULL и указывает на класс подобъекта.
 Описание
 Перечисление SubentityType определяет типы подобъектов для объектов Teigha.DatabaseServices.SubentityId.
 Замечания
 Объект чертежа может состоять из множества графических подобъектов, таких как дуги, линии, текст, вершины, ребра, грани и т.д. Идентификатор подобъекта формируется на основе типа подобъекта SubentityType и индекса подобъекта, который является маркером графической системы для подобъекта (обычно это указатель).
 Ваши комментарии по поводу этого топика: Послать отзыв!