Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve3d.GetDistanceTo
 Послать отзыв
 Метод вычисляет с заданной точностью минимальное расстояние между указанной точкой и данной кривой.
 Синтаксис
C#
Visual Basic
Копировать Код
public double GetDistanceTo( Point3d point, Tolerance tolerance );
Копировать Код
Public Function GetDistanceTo( point As Point3d, tolerance As Tolerance ) As Double
 Параметры
 Параметры
 Описание
 point
 Точка, до которой вычисляется расстояние. Тип Point3d.
 tolerance
 Геометрический допуск, определяющий точность вычислений. Тип Tolerance.
 Возвращает
 Возвращает минимальное расстояние от кривой до точки. Тип double.
 Описание
 Метод вычисляет с заданной точностью минимальное расстояние между указанной точкой и данной кривой.
 Ссылки
 Teigha.Geometry.Curve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!