Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FaceRecord.FaceRecord
 Послать отзыв
 Конструктор класса FaceRecord, создающий экземпляр класса с указанными вершинами в угловых точках грани.
 Синтаксис
C#
Visual Basic
Копировать Код
public FaceRecord( short vertex0, short vertex1, short vertex2, short vertex3 );
Копировать Код
Public Sub New( vertex0 As Short, vertex1 As Short, vertex2 As Short, vertex3 As Short )
 Параметры
 Параметры
 Описание
 vertex0
 Индекс первой вершины грани. Тип short.
 vertex1
 Индекс второй вершины грани. Тип short.
 vertex2
 Индекс третьей вершины грани. Тип short.
 vertex3
 Индекс четвертой вершины грани. Тип short.
 Описание
 Конструктор класса FaceRecord. Создает запись FaceRecord, используя переданные в аргументах вершины в качестве четырех угловых точек грани.
 Ссылки
 Teigha.DatabaseServices.FaceRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!