Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ObjectIdCollection.Remove
 Послать отзыв
 Метод удаляет из коллекции элемент, соответствующий аргументу.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Remove( ObjectId value );
Копировать Код
Public Sub Remove( value As ObjectId )
 Параметры
 Параметры
 Описание
 value
 Идентификатор объекта, который следует удалить из коллекции. Тип ObjectId.
 Описание
 Метод удаляет из коллекции элемент, соответствующий аргументу.
 Ссылки
 Teigha.DatabaseServices.ObjectIdCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!