Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 ViewportTableRecord.FastZoomsEnabled
 Послать отзыв
 Устаревшее свойство, всегда возвращает true.
 Синтаксис
C#
Visual Basic
public bool FastZoomsEnabled;
Public Property FastZoomsEnabled() As bool
 Возвращает
 Возвращает тип данных bool.
 Условия
 Чтение и запись.
 Ссылки
 ViewportTableRecord Класс, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!