Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.SetBlockRotation
 Послать отзыв
 Метод позволяет задать угол поворота вхождения блока в указанной ячейке таблицы.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetBlockRotation( int row, int col, double rotationalAngle );
Копировать Код
Public virtual Sub SetBlockRotation( row As Integer, col As Integer, rotationalAngle As double )
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 col
 Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
 rotationalAngle
 Угол поворота вхождения блока в радианах, тип double.
 Описание
 Метод позволяет задать угол поворота вхождения блока в указанной ячейке таблицы.
 Замечания
 Для получения того же результата предпочтительнее использовать Table.Cells[row,column].Contents[i].Rotation.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!