Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PolygonMesh.MakeNOpen
 Послать отзыв
 Метод делает сеть PolygonMesh незамкнутой в направлении N.
 Синтаксис
C#
Visual Basic
Копировать Код
public void MakeNOpen();
Копировать Код
Public Sub MakeNOpen()
 Описание
 Метод делает сеть PolygonMesh незамкнутой в направлении N. Это означает, что сеть будет иметь разрыв между последним и первым столбцами.
 Ссылки
 Teigha.DatabaseServices.PolygonMesh, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!