Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AbstractViewportData.GsView
 Послать отзыв
 Свойство GsView предоставляет доступ к объекту GraphicsSystem.View, который связан с видовым экраном.
 Синтаксис
C#
Visual Basic
Копировать Код
public GraphicsSystem.View GsView;
Копировать Код
Public Property GsView As GraphicsSystem.View
 Возвращает
 Возвращает объект GraphicsSystem.View, связанный с видовым экраном.
 Описание
 Свойство GsView предоставляет доступ к объекту GraphicsSystem.View, который связан с видовым экраном.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.AbstractViewportData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!