Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MlineStyleElementCollectionEnumerator.Reset
 Послать отзыв
 Метод реинициализирует перечислитель, устанавливая его индекс в значение -1.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Reset();
Копировать Код
Public Sub Reset()
 Описание
 Метод реинициализирует перечислитель, устанавливая его индекс в значение -1.
 Ссылки
 Teigha.DatabaseServices.MlineStyleElementCollectionEnumerator, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!