Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.RadialDimensionLarge.OverrideCenter
 Послать отзыв
 Свойство OverrideCenter представляет точку переопределенного центра, из которой строится размерная линия.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d OverrideCenter;
Копировать Код
Public Property OverrideCenter As Point3d
 Возвращает
 Возвращает точку переопределенного центра размера (в мировой системе координат, WCS). Тип Point3d.
 Описание
 Свойство OverrideCenter представляет точку переопределенного центра, из которой строится размерная линия.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.RadialDimensionLarge, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!