Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Entity.Normal
 Послать отзыв
 Свойство предназначено для получения или установки вектора нормали точки в мировых координатах (WCS), который определяет направление вытеснения и плоскость отображения при ненулевой толщине или изменённом режиме PDMODE.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d Normal;
Копировать Код
Public Property Normal() As Vector3d
 Возвращает
 Возвращает значение типа Vector3d, представляющее вектор нормали, заданный в мировой системе координат.
 Описание
 Задает или возвращает вектор нормали для точки в WCS координатах. Вектор нормали используется для определения направления "вытеснения", когда точка имеет ненулевую ширину. Вектор нормали также определяет плоскость, на которой отображается изображение точек, если системная переменная PDMODE установлена так, чтобы отображать точку иначе чем ".".
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.DBPoint, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!