Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeader.GetLeaderLineTypeId
 Послать отзыв
 Метод возвращает идентификатор объекта типа линии для выноски с указанным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.ObjectId GetLeaderLineTypeId( int leaderLineIndex );
Копировать Код
Public Function GetLeaderLineTypeId( leaderLineIndex As Integer ) As DatabaseServices.ObjectId
 Параметры
 Параметры
 Описание
 leaderLineIndex
 Индекс линии выноски. Тип int.
 Возвращает
 Возвращает идентификатор объекта типа линии для выноски. Тип DatabaseServices.ObjectId.
 Описание
 Метод возвращает идентификатор объекта типа линии для выноски с указанным индексом.
 Ссылки
 Teigha.DatabaseServices.MLeader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!