Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Hatch.AppendLoop (HatchLoopTypes, ObjectIdCollection^)
 Послать отзыв
 Синтаксис
C#
Visual Basic
public void AppendLoop(HatchLoopTypes loopType, ref ObjectIdCollection dbObjIds);
Public Sub AppendLoop(loopType As HatchLoopTypes, ByRef dbObjIds As ObjectIdCollection)
 Параметры
 Параметры
 Описание
 loopType
 Тип замкнутой линии
 dbObjIds
 Множество Id объектов
 Описание
 Метод добавляет новую петлю контура (путь или полилинию) к объекту заливки. Параметр loopType определяет тип для контура, который должен быть в перечислении Default или External. Параметр dbObjIds определяет множество Id объектов, из которых состоит петля границы. Id объектов будут поддерживаться, если объект заливки является ассоциированным.
 Ссылки
 Teigha.DatabaseServices.Hatch, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!