Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CompoundObjectId.TopId
 Послать отзыв
 Свойство предоставляет первый ObjectId в цепочке из вхождений блоков BlockReference или ObjectId конечного узла, если путь отсутствует.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectId TopId;
Копировать Код
Public Property TopId() As ObjectId
 Возвращает
 Возвращает идентификатор первого элемента. Тип ObjectId.
 Описание
 Свойство предоставляет первый ObjectId в последовательности вхождений блоков BlockReference или ObjectId конечного узла, если путь отсутствует.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.CompoundObjectId, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!