Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 LayerTableRecord.IsOff
 Послать отзыв
 Свойство предназначено для настройки видимости слоя.
 Синтаксис
C#
Visual Basic
public bool IsOff;
Public Property IsOff() As bool
 Возвращает
 Возвращает тип данных bool:
true – слой виден;
false – слой не виден.
 Описание
 С помощью свойства можно получить информацию о том, виден слой на чертеже или нет в виде типа данных bool и изменить его видимость. Объекты невидимого слоя не видны ни в пространстве модели, ни в пространстве листа и не выводятся на печать.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.LayerTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!