Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FieldResult.SetFieldValue
 Послать отзыв
 Метод задает результат вычисления поля.
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract void SetFieldValue( ref Object pValue );
Копировать Код
Public MustOverride Sub SetFieldValue( ByRef pValue As Object )
 Параметры
 Параметры
 Описание
 pValue
 Входное значения поля, которое требуется задать. Тип Object.
 Описание
 Метод задает результат вычисления поля.
 Ссылки
 Teigha.DatabaseServices.FieldResult, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!