Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CurveCurveIntersector3d.IsTangential
 Послать отзыв
 Метод позволяет проверить, являются ли кривые касательными друг к другу в указанной точке пересечения.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsTangential( int intersection );
Копировать Код
Public Function IsTangential( intersection As Integer ) As Boolean
 Параметры
 Параметры
 Описание
 intersection
 Входной индекс точки пересечения кривых. Тип int.
 Возвращает
 Возвращает true, если в указанной точке пересечения кривые являются касательными. В противном случае возвращает false.
 Описание
 Метод позволяет проверить, являются ли кривые касательными друг к другу в указанной точке пересечения.
 Ссылки
 Teigha.Geometry.CurveCurveIntersector3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!