Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Torus.MajorRadius
 Послать отзыв
 Свойство MajorRadius возвращает значение большого радиуса данного тора.
 Синтаксис
C#
Visual Basic
Копировать Код
public double MajorRadius;
Копировать Код
Public Property MajorRadius As Double
 Возвращает
 Возвращает большой радиус данного тора. Тип double.
 Описание
 Свойство MajorRadius возвращает значение большого радиуса данного тора.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.Geometry.Torus, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!