Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Plane.IntersectWith
 Послать отзыв
 Метод вычисляет линейный сегмент, который представляет линию пересечения данной плоскости с указанной ограниченной плоскостью. Используется предписанная точность.
 Синтаксис
C#
Visual Basic
Копировать Код
public LineSegment3d IntersectWith( ref BoundedPlane boundPlane, Tolerance tolerance );
Копировать Код
Public Function IntersectWith( ByRef boundPlane As BoundedPlane, tolerance As Tolerance ) As LineSegment3d
 Параметры
 Параметры
 Описание
 boundPlane
 Входная ограниченная плоскость. Тип BoundedPlane.
 tolerance
 Заданная геометрическая точность. Тип Tolerance.
 Возвращает
 Возвращает линейный сегмент, который представляет линию пересечения. Тип LineSegment3d.
 Описание
 Метод вычисляет линейный сегмент, который представляет линию пересечения данной плоскости с указанной ограниченной плоскостью. Используется точность tolerance.
 Ссылки
 Teigha.Geometry.Plane, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!