Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObject.Cancel()
 Послать отзыв
 Метод завершает текущую открытую операцию. В настоящее время не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
[Obsolete( "Use Transaction instead" )] public void Cancel();
Копировать Код
<Obsolete( "Use Transaction instead" )> Public Sub Cancel()
 Описание
 Прекращает текущую открытую операцию.
 Ссылки
 Teigha.DatabaseServices.DBObject, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!