Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.UcsTableRecord.Origin
 Послать отзыв
 Свойство Origin представляет 3D-точку начала пользовательской системы координат для данной записи UCS.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d Origin;
Копировать Код
Public Property Origin As Point3d
 Возвращает
 Возвращает точку начала пользовательской системы координат. Тип Point3d.
 Описание
 Свойство Origin представляет трехмерную точку начала пользовательской системы координат (UCS, ПСК) для данной записи UCS. Точка представлена в мировой системе координат.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.UcsTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!