Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MentalRayRenderSettings.MentalRayRenderSettings
 Послать отзыв
 Конструктор по умолчанию класса MentalRayRenderSettings.
 Синтаксис
C#
Visual Basic
Копировать Код
public MentalRayRenderSettings();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса MentalRayRenderSettings.
 Ссылки
 Teigha.DatabaseServices.MentalRayRenderSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!