Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Shape.Shape
 Послать отзыв
 Конструктор класса Shape. Создает экземпляр класса с указанными параметрами.
 Синтаксис
C#
Visual Basic
Копировать Код
public Shape( Point3d position, double size, double rotation, double widthFactor );
Копировать Код
Public Sub New( position As Point3d, size As Double, rotation As Double, widthFactor As Double )
 Параметры
 Параметры
 Описание
 position
 Координатная точка привязки данного объекта Shape. Тип Point3d.
 size
 Высота объекта Shape. Тип double.
 rotation
 Угол поворота объекта Shape (в радианах). Тип double.
 widthFactor
 Относительный коэффициент ширины объекта Shape. Тип double.
 Описание
 Конструктор класса Shape. Создает экземпляр класса с указанными параметрами.
 Ссылки
 Teigha.DatabaseServices.Shape, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!