Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Row
 Послать отзыв
 Класс Row представляет строку ячеек таблицы.
 Иерархия классов
Teigha::DatabaseServices::CellRange Teigha::DatabaseServices::Row
 Синтаксис
C#
Visual Basic
Копировать Код
public sealed class Row : CellRange
Копировать Код
Public NotInheritable Class Row Inherits CellRange
 Описание
 Класс Row представляет строку ячеек таблицы.
 Топики
 Имя
 Описание
 CellRange Методы
 Ниже перечислены методы класса CellRange.
 CellRange Операторы
 Ниже перечислены операторы класса CellRange.
 CellRange Свойства
 Ниже перечислены свойства класса CellRange.
 Teigha.DatabaseServices.Row
 Имя
 Описание
 Row Свойства
 Ниже перечислены свойства класса Row.
 Ссылки
 Row Свойства, Топики, CellRange Методы, CellRange Операторы, CellRange Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!