Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Extents2d.!=
 Послать отзыв
 Оператор неравенства класса Extents2d.
 Синтаксис
C#
Visual Basic
Копировать Код
public static bool operator !=( Extents2d a, Extents2d b );
Копировать Код
Public Shared Operator <>( a As Extents2d, b As Extents2d ) As Boolean
 Параметры
 Параметры
 Описание
 a
 Левый операнд. Тип Extents2d.
 b
 Правый операнд. Тип Extents2d.
 Возвращает
 Возвращает true, если у операндов не совпадают минимальные и/или максимальные точки. В противном случае возвращает false.
 Описание
 Оператор неравенства класса Extents2d.
 Ссылки
 Teigha.DatabaseServices.Extents2d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!