Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SectionSettings.SetPlotStyleName
 Послать отзыв
 Метод позволяет задать имя стиля печати для вывода на печать геометрии указанного типа.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetPlotStyleName( SectionType nSecType, SectionGeometry nGeometry, ref String pszPlotStyleName );
Копировать Код
Public Sub SetPlotStyleName( nSecType As SectionType, nGeometry As SectionGeometry, ByRef pszPlotStyleName As String )
 Параметры
 Параметры
 Описание
 nSecType
 Тип сечения. Перечисление SectionType.
 nGeometry
 Типы элементов геометрии сечения. Перечисление SectionGeometry.
 pszPlotStyleName
 Имя стиля печати. Тип String.
 Описание
 Метод позволяет задать имя стиля печати, используемого при выводе на печать геометрии указанного типа.
 Ссылки
 Teigha.DatabaseServices.SectionSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!