Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Scale2d.PreMultiplyBy
 Послать отзыв
 Метод реализует векторное произведение указанного вектора масштабирования на данный объект (leftSide) * (данный вектор).
 Синтаксис
C#
Visual Basic
Копировать Код
public Scale2d PreMultiplyBy( Scale2d leftSide );
Копировать Код
Public Function PreMultiplyBy( leftSide As Scale2d ) As Scale2d
 Параметры
 Параметры
 Описание
 leftSide
 Входной вектор масштабирования, используемый в качестве множителя. Тип Scale2d.
 Возвращает
 Возвращает результат векторного умножения. Тип Scale2d.
 Описание
 Метод сохраняет в данном объекте результат векторного произведения данного объекта на указанный вектор масштабирования (leftSide) * (данный вектор).
 Замечания
 Умножение векторов масштабирования является коммутативным.
 Ссылки
 Teigha.Geometry.Scale2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!