Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Matrix2d.ToString
 Послать отзыв
 Метод позволяет получить эквивалентное строковое представление данной матрицы в заданном формате и с учетом указанных языковых и региональных настроек.
 Синтаксис
C#
Visual Basic
Копировать Код
public String ToString( ref String format, ref IFormatProvider provider );
Копировать Код
Public Function ToString( ByRef format As String, ByRef provider As IFormatProvider ) As String
 Параметры
 Параметры
 Описание
 format
 Предписанный формат строкового представления. Тип String.
 provider
 Входной провайдер языковых и региональных настроек. Тип IFormatProvider.
 Возвращает
 Возвращает эквивалентное строковое представление данной матрицы, которое учитывает заданный формат и предписанные языковые и региональные настройки. Тип String.
 Описание
 Метод позволяет получить эквивалентное строковое представление данной матрицы в заданном формате и с учетом указанных языковых и региональных настроек.
 Ссылки
 Teigha.Geometry.Matrix2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!