Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.BlockInsertionPointsEventArgs.BlockInsertionPointsEventArgs
 Послать отзыв
 Конструктор класса BlockInsertionPointsEventArgs.
 Синтаксис
C#
Visual Basic
Копировать Код
public BlockInsertionPointsEventArgs( ref BlockTableRecord blockTableRecord, ref Point3dCollection points, ref Vector3dCollection alignmentVectors );
Копировать Код
Public Sub New( ByRef blockTableRecord As BlockTableRecord, ByRef points As Point3dCollection, ByRef alignmentVectors As Vector3dCollection )
 Параметры
 Параметры
 Описание
 blockTableRecord
 Запись в таблице блоков. Тип BlockTableRecord.
 points
 Коллекция точек вставки. Тип Point3dCollection.
 alignmentVectors
 Коллекция векторов выравнивания. Тип Vector3dCollection.
 Описание
 Конструктор класса BlockInsertionPointsEventArgs.
 Ссылки
 Teigha.DatabaseServices.BlockInsertionPointsEventArgs, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!