Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.XrefOperation
 Послать отзыв
 Перечисление XrefOperation определяет подкоманды внешних ссылок.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum XrefOperation { XrefAttachOperation = 0, XrefBindOperation = 1, XrefXBindOperation = 1, XrefDetachOperation = 2, XrefOverlayOperation = 3, XrefPathOperation = 4, XrefReloadOperation = 5, XrefResolveOperation = 6, XrefUnloadOperation = 7 }
Копировать Код
Public Enum XrefOperation XrefAttachOperation = 0 XrefBindOperation = 1 XrefXBindOperation = 1 XrefDetachOperation = 2 XrefOverlayOperation = 3 XrefPathOperation = 4 XrefReloadOperation = 5 XrefResolveOperation = 6 XrefUnloadOperation = 7 End Enum
 Члены
 Члены
 Описание
 XrefAttachOperation
 Значение: 0. Прикрепляет файл внешней ссылки к базе данных, указанной в базе данных HostDb, или к текущему документу в редакторе, если HostDb имеет значение null.
 XrefBindOperation
 Значение: 1.
 XrefDetachOperation
 Значение: 2. Отключает заданный по имени блок внешней ссылки. Предполагается, что валидный блок внешней ссылки с этим именем существует в базе данных, указанной в базе HostDb (или в текущем документе, если HostDb имеет значение null).
 XrefOverlayOperation
 Значение: 3. Выполняется наложение файла внешней ссылки на базу данных, которая указана в HostDb (или текущем документе, если HostDb имеет значение null).
 XrefPathOperation
 Значение: 4. Операция задаёт путь к прикрепляемой внешней ссылке XREF.
 XrefReloadOperation
 Значение: 5. Операция перезагружает заданный по имени блок внешней ссылки. При этом предполагается, что в базе данных, указанной в HostDb (или в текущем документе, если HostDb имеет значение null), существует валидный блок внешней ссылки с заданным именем.
 XrefResolveOperation
 Значение: 6. Операция разрешает существующие внешние ссылки в HostDb. HostDb не должна указывать на базу данных, которая является основной базой данных для документа в nanoCAD (т.е. она не должна указывать на базу данных, загруженную в редакторе nanoCAD).
 XrefUnloadOperation
 Значение: 7. Выгружает заданный по имени блок внешней ссылки. Предполагается, что в базе данных, указанной в HostDb (или в текущем документе, если HostDb имеет значение null), существует валидный блок внешней ссылки с заданным именем.
 XrefXBindOperation
 Значение: 1. Операция обеспечивает связывание записей таблицы внешних ссылок, идентификаторы объектов которых находятся в списке symbolIds. Аналогична команде XBIND nanoCAD.
 Описание
 Перечисление XrefOperation определяет подкоманды внешних ссылок.
 Ваши комментарии по поводу этого топика: Послать отзыв!