Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.KnotCollection.Insert
 Послать отзыв
 Метод вставляет в данную коллекцию указанное значение в позицию с заданным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Insert( int index, double value );
Копировать Код
Public Sub Insert( index As Integer, value As Double )
 Параметры
 Параметры
 Описание
 index
 Индекс позиции в коллекции. Тип int.
 value
 Вставляемое в коллекцию значение. Тип double.
 Описание
 Метод вставляет в коллекцию значение value в позицию с индексом index .
 Ссылки
 Teigha.Geometry.KnotCollection, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!