Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GripData.GetHotGripDimensionData
 Послать отзыв
 Метод позволяет получить данные размера с активной ручкой.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual DynamicDimensionDataCollection GetHotGripDimensionData( double dimScale );
Копировать Код
Public Overridable Function GetHotGripDimensionData( dimScale As Double ) As DynamicDimensionDataCollection
 Параметры
 Параметры
 Описание
 dimScale
 Масштаб размера. Тип double.
 Возвращает
 Возвращает данные размера. Тип DynamicDimensionDataCollection.
 Описание
 Метод позволяет получить данные размера с активной ручкой.
 Ссылки
 Teigha.DatabaseServices.GripData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!