Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.UnitType
 Послать отзыв
 Метод предназначен для получения типа единиц измерения (длины, площади, объема и т.п.) содержимого в указанной ячейке.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual DatabaseService.UnitType UnitType( int row, int col );
Копировать Код
Public virtual Function UnitType( row As Integer, col As Integer ) As DatabaseServices.UnitType
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 col
 Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
 Возвращает
 Возвращает тип единиц измерения как значение из перечисления DatabaseServices.UnitType.
 Описание
 Метод предназначен для получения типа единиц измерения содержимого в указанной ячейке. Типы единиц определяются перечислением DatabaseServices.UnitType (безразмерная величина, длина, площадь, объем, углы и т.п.).
 Замечания
 Для получения того же результата предпочтительнее использовать Table.Cells[row,column].DataType.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!