Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DxfFiler.ReadUInt16
 Послать отзыв
 Метод возвращает 16-разрядное целое число без знака (ushort) из текущего элемента этого объекта Filer.
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract ushort ReadUInt16();
Копировать Код
Public MustOverride Function ReadUInt16() As UShort
 Возвращает
 Возвращает 16-разрядное целое число без знака. Тип ushort.
 Описание
 Метод возвращает 16-разрядное целое число без знака (ushort) из текущего элемента этого объекта Filer.
 Ссылки
 Teigha.DatabaseServices.DxfFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!