Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Matrix2dInfo.Reflex
 Послать отзыв
 Свойство Reflex представляет направление оси зеркального отражения в матрице.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector2d Reflex;
Копировать Код
Public ReadOnly Property Reflex As Vector2d
 Возвращает
 Возвращает направление оси зеркального отражения. Тип Vector2d.
 Описание
 Свойство Reflex представляет направление оси зеркального отражения в матрице.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.Matrix2dInfo, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!