Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DynamicDimensionDataCollection.RemoveAt
 Послать отзыв
 Метод RemoveAt() позволяет удалить из коллекции элемент с указанным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public void RemoveAt( int i );
Копировать Код
Public Sub RemoveAt( i As Integer )
 Параметры
 Параметры
 Описание
 i
 Индекс удаляемого элемента коллекции. Тип int.
 Описание
 Метод RemoveAt() позволяет удалить из коллекции элемент с указанным индексом.
 Ссылки
 Teigha.DatabaseServices.DynamicDimensionDataCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!