Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CircularArc3d.IntersectWith
 Послать отзыв
 Метод позволяет с заданной точностью найти точки пересечения этой дуги с указанной плоскостью.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d[] IntersectWith( ref PlanarEntity plane, Tolerance tolerance );
Копировать Код
Public Function IntersectWith( ByRef plane As PlanarEntity, tolerance As Tolerance ) As Point3d()
 Параметры
 Параметры
 Описание
 plane
 Входная плоскость, точки пересечения с которой требуется найти. Тип PlanarEntity.
 tolerance
 Заданная точность вычислений. Тип Tolerance.
 Возвращает
 Возвращает массив точек пересечения дуги с плоскостью. Тип Point3d[].
 Описание
 Метод позволяет с заданной точностью tolerance найти точки пересечения этой дуги с указанной плоскостью plane.
 Ссылки
 Teigha.Geometry.CircularArc3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!