Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbSurfaceDefinition.IsEqualTo
 Послать отзыв
 Метод проверяет, совпадают ли данные этого определения NURBS поверхности с данными другого определения NurbSurfaceDefinition.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsEqualTo( NurbSurfaceDefinition a );
Копировать Код
Public Function IsEqualTo( a As NurbSurfaceDefinition ) As Boolean
 Параметры
 Параметры
 Описание
 a
 Проверяемые данные определения NURBS поверхности. Тип NurbSurfaceDefinition.
 Возвращает
 Возвращает true, если сравниваемые объекты можно считать равными. В противном случае возвращает false.
 Описание
 Метод проверяет, совпадают ли данные этого определения NURBS поверхности с данными другого определения NurbSurfaceDefinition.
 Замечания
 Два определения NURBS поверхностей считаются равными, если совместно соблюдаются все перечисленные ниже условия:
У обоих сплайнов совпадают степени как в направлении U, так и в направлении V.
У обоих сплайнов совпадают свойства как в направлении U, так и в направлении V.
У обоих сплайнов совпадает количество управляющих вершин как в направлении U, так и в направлении V.
У обоих сплайнов совпадают управляющие вершины.
Значения весов равны.
У обоих сплайнов совпадают узлы как в направлении U, так и в направлении V.
 Ссылки
 Teigha.Geometry.NurbSurfaceDefinition, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!