Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocDependency.DependencyBody
 Послать отзыв
 Свойство обеспечивает доступ к ObjectId тела зависимости, которое принадлежит данной зависимости и представлено классом, производным от AssocDependencyBody.
 Синтаксис
C#
Visual Basic
Копировать Код
public Teigha.DatabaseServices.ObjectId DependencyBody;
Копировать Код
Public Property DependencyBody() As Teigha.DatabaseServices.ObjectId
 Возвращает
 Возвращает идентификатор тела пользовательской зависимости. Тип Teigha.DatabaseServices.ObjectId.
 Описание
 Свойство обеспечивает доступ к ObjectId тела зависимости, которое принадлежит данной зависимости и представлено классом, производным от AssocDependencyBody. Если объект тела зависимости не задан, свойство возвращает нулевой идентификатор.
 См. также комментарии к классу AssocDependencyBody.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.AssocDependency, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!