Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CompoundObjectId.==
 Послать отзыв
 Оператор равенства для объектов CompoundObjectId. Позволяет установить, что входной объект совпадает с данным.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool operator ==( ref CompoundObjectId A_0 );
Копировать Код
Public Operator ==( ByRef A_0 As CompoundObjectId )
 Параметры
 Параметры
 Описание
 A_0
 Проверяемый входной объект. Тип CompoundObjectId.
 Возвращает
 Возвращает true, если объекты совпадают и ни один из них не является нулевым. В противном случае возвращает false.
 Описание
 Оператор равенства для объектов CompoundObjectId. Позволяет установить, что входной объект совпадает с данным.
 Ссылки
 Teigha.DatabaseServices.CompoundObjectId, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!