Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.ExternalCurve2d.ExternalCurve2d
 Послать отзыв
 Конструктор по умолчанию класса ExternalCurve2d.
 Синтаксис
C#
Visual Basic
Копировать Код
public ExternalCurve2d();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса ExternalCurve2d. Создает пустой экземпляр по умолчанию с нулевым указателем на определение кривой, неопределенным типом кривой (другими словами, нет информации о системе, в которой была создана внешняя кривая) и опцией предотвращения копирования внешней кривой.
 Ссылки
 Teigha.Geometry.ExternalCurve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!