Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.HostApplicationServices.LoadApplication
 Послать отзыв
 Метод позволяет загрузить приложение. В текущей версии не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void LoadApplication( ref String appName, ApplicationLoadReasons why, bool printIt, bool asCmd );
Копировать Код
Public Overridable Sub LoadApplication( ByRef appName As String, why As ApplicationLoadReasons, printIt As Boolean, asCmd As Boolean )
 Параметры
 Параметры
 Описание
 appName
 Нуль-терминированная строка, представляющая имя загружаемого приложения. Тип String.
 why
 Причина загрузки приложения. Перечисление ApplicationLoadReasons.
 printIt
 Флаг, определяющий, печатать ли сообщение о состоянии загрузки. Тип bool.
 asCmd
 Флаг, определяющий, следует ли загружать приложение, как это происходит по команде пользователя. Тип bool.
 Описание
 Метод позволяет загрузить приложение. В текущей версии не реализован.
 Ссылки
 Teigha.DatabaseServices.HostApplicationServices, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!