Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AbstractViewTableRecord.Target
 Послать отзыв
 Свойство Target предоставляет доступ к точке цели вида в координатах WCS.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d Target;
Копировать Код
Public Property Target As Point3d
 Возвращает
 Возвращает точку цели вида. Тип Point3d.
 Описание
 Свойство Target предоставляет доступ к точке цели вида в мировой системе координат (WCS).
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.AbstractViewTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!