Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Extents2d.MinPoint
 Послать отзыв
 Свойство обеспечивает доступ к минимальной точке данного объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point2d MinPoint;
Копировать Код
Public ReadOnly Property MinPoint As Point2d
 Возвращает
 Возвращает минимальную точку данного объекта. Тип Point2d.
 Описание
 Свойство обеспечивает доступ к минимальной точке данного объекта.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Extents2d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!