Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Leader.TextStyleId
 Послать отзыв
 This is TextStyleId, a member of class Leader.
 Синтаксис
C#
Visual Basic
public DatabaseServices::ObjectId TextStyleId;
Public Property TextStyleId() As DatabaseServices.ObjectId
 Ссылки
 Teigha.DatabaseServices.Leader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!