Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocArray.getItems
 Послать отзыв
 Метод извлекает в массив локаторы элементов данного ассоциативного массива.
 Синтаксис
C#
Visual Basic
Копировать Код
public ItemLocator[] getItems( bool skipErased );
Копировать Код
Public Function getItems( skipErased As Boolean ) As ItemLocator()
 Параметры
 Параметры
 Описание
 skipErased
 Данный флаг определяет, следует ли пропускать удаленные элементы массива. Тип bool.
 Возвращает
 Возвращает массив локаторов для элементов данного ассоциативного массива. Тип ItemLocator[].
 Описание
 Метод позволяет сформировать массив локаторов элементов данного ассоциативного массива.
 Ссылки
 Teigha.DatabaseServices.AssocArray, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!