Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 DimStyleTableRecord.Dimtfillclr
 Послать отзыв
 Свойство отвечает за цвет заливки фона размерного текста при Dimtfill = 2 ("By DIMTFILLCLR").
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual Color Dimtfillclr { get; set; }
Копировать Код
Public Overridable Property Dimtfillclr As Color
 Возвращает
 Возвращает тип данных Teigha.Colors.Color.
 Описание
 В свойстве хранится цвет заливки фона размерного текста в виде типа данных Teigha.Colors.Color. Значение свойства учитывается, когда свойство Dimtfill равно 2 («By DIMTFILLCLR»).
 Соответствия значений свойства Dimtfillclr в пользовательском интерфейсе и при работе с ним через .NET API:
 Наименование цвета в UI
 Наименование цвета при считывании через API
 Как изменить через API
 «По блоку»
 BYBLOCK
 Teigha.Colors.Color.FromColorIndex(Teigha.Colors.ColorMethod.ByBlock, 0)
 «По слою»
 BYLAYER
 Teigha.Colors.Color.FromColorIndex(Teigha.Colors.ColorMethod.ByLayer, 256)
 красный
 red
 Teigha.Colors.Color.FromColorIndex(Teigha.Colors.ColorMethod.ByColor, 1)
 желтый
 yellow
 Teigha.Colors.Color.FromColorIndex(Teigha.Colors.ColorMethod.ByColor, 2)
 зеленый
 green
 Teigha.Colors.Color.FromColorIndex(Teigha.Colors.ColorMethod.ByColor, 3)
 голубой
 cyan
 Teigha.Colors.Color.FromColorIndex(Teigha.Colors.ColorMethod.ByColor, 4)
 синий
 blue
 Teigha.Colors.Color.FromColorIndex(Teigha.Colors.ColorMethod.ByColor, 5)
 фиолетовый
 magenta
 Teigha.Colors.Color.FromColorIndex(Teigha.Colors.ColorMethod.ByColor, 6)
 белый
 white
 Teigha.Colors.Color.FromColorIndex(Teigha.Colors.ColorMethod.ByColor, 7)
 В таблице приведены стандартные цвета. При необходимости, можно создать цвет, не включенный в таблицу, используя RGB-модель и изменить цвет заливки текста на этот цвет. Значение Dimtfillclr по умолчанию – «По блоку».
 Свойство Dimtfillclr также доступно через системную переменную DIMTFILLCLR и пользовательское меню в окне изменения/создания размерного стиля:
  При изменении системной переменной DIMTFILLCLR будет создан новый размерный стиль под названием <переопределение> на основе текущего с новым значением DIMTFILLCLR.
 Условия
 Чтение и запись.
 Пример
 Пример изменения цвета заливки фона размерного текста (значения свойства Dimtfillclr) в размерном стиле Standard:
C#
 Копировать Код
public partial class Commands { [Teigha.Runtime.CommandMethod("DimtfillclrChange")] public void DimtfillclrStandardDimStyle() { // Получение ссылки на активный документ HostMgd.ApplicationServices.Document doc = HostMgd.ApplicationServices.Application.DocumentManager.MdiActiveDocument; // Получение ссылки на редактор документа HostMgd.EditorInput.Editor ed = doc.Editor; // Получение ссылки на базу данных документа Teigha.DatabaseServices.Database db = doc.Database; // Начало транзакции с базой данных документа using (Teigha.DatabaseServices.Transaction trans = db.TransactionManager.StartTransaction()) { // Открываем таблицу размерных стилей для чтения Teigha.DatabaseServices.DimStyleTable dimStyleTable = trans.GetObject(db.DimStyleTableId, Teigha.DatabaseServices.OpenMode.ForRead) as Teigha.DatabaseServices.DimStyleTable; // Находим в таблице размерных стилей ObjectId нужного стиля по его названию Teigha.DatabaseServices.ObjectId styleId = dimStyleTable["Standard"]; // Открываем таблицу размерного стиля для изменений Teigha.DatabaseServices.DimStyleTableRecord obj = trans.GetObject(styleId, Teigha.DatabaseServices.OpenMode.ForWrite) as Teigha.DatabaseServices.DimStyleTableRecord; ed.WriteMessage($"nDimtfillclr before: {obj.Dimtfillclr}"); // Изменяем цвет заливки размерного текста на синий obj.Dimtfill = 2; obj.Dimtfillclr = Teigha.Colors.Color.FromColorIndex(Teigha.Colors.ColorMethod.ByColor, 5); ed.WriteMessage($"nDimtfillclr after: {obj.Dimtfillclr}"); trans.Commit(); } } }
 Результат работы команды DimtfillclrChange:
 Было:
 Стало:
 Ссылки
 Teigha.DatabaseServices.DimStyleTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!