Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.SurfaceSurfaceIntersectorType
 Послать отзыв
 Данное перечисление представляет компонент пересечения поверхностей.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum SurfaceSurfaceIntersectorType { Transverse = 0, Tangent = 1, AntiTangent = 2 }
Копировать Код
Public Enum SurfaceSurfaceIntersectorType Transverse = 0 Tangent = 1 AntiTangent = 2 End Enum
 Члены
 Члены
 Описание
 Transverse
 Значение: 0. Некасательное пересечение поверхностей.
 Tangent
 Значение: 1. Касательное пересечение с сонаправленными нормалями двух поверхностей в любой точке в пределах компонента.
 AntiTangent
 Значение: 2. Касательное пересечение с противонаправленными нормалями двух поверхностей в любой точке в пределах компонента.
 Описание
 Данное перечисление представляет компонент пересечения поверхностей.
 Ваши комментарии по поводу этого топика: Послать отзыв!