Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Dimldrblk
 Послать отзыв
 Синтаксис
C#
Visual Basic
public DatabaseServices::ObjectId Dimldrblk;
Public Property Dimldrblk() As DatabaseServices.ObjectId
 Описание
 Возвращает или устанавливает Id ссылки на блок, определенной текущим значением DIMLDRBLK для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!