Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.BitmapDeviceFlags
 Послать отзыв
 Перечисление BitmapDeviceFlags определяет флаги для растровых устройств.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum BitmapDeviceFlags { UseSoftwareHLR = 1, For2dExportRender = 2, For2dExportRenderHLR = 4, ForThumbnail = 8 }
Копировать Код
Public Enum BitmapDeviceFlags UseSoftwareHLR = 1 For2dExportRender = 2 For2dExportRenderHLR = 4 ForThumbnail = 8 End Enum
 Члены
 Члены
 Описание
 UseSoftwareHLR
 Значение: 1. На устройстве включено использование SoftwareHLR.
 For2dExportRender
 Значение: 2. Устройство используется для экспорта тонированного видового экрана.
 For2dExportRenderHLR
 Значение: 4. Устройство используется для экспорта видового экрана в режиме HiddenLine.
 ForThumbnail
 Значение: 8. Устройство используется для генерации изображений миниатюр (thumbnail image).
 Описание
 Перечисление BitmapDeviceFlags определяет флаги для растровых устройств.
 Ваши комментарии по поводу этого топика: Послать отзыв!