Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocArrayPolarParameters.GetStartAngle
 Послать отзыв
 Метод позволяет получить начальный угол кругового массива.
 Синтаксис
C#
Visual Basic
Копировать Код
public double GetStartAngle( out String expression, out String evaluatorId );
Копировать Код
Public Function GetStartAngle( ByRef expression As String, ByRef evaluatorId As String ) As Double
 Параметры
 Параметры
 Описание
 expression
 Выражение для параметра. Тип String. Строка может быть пустой.
 evaluatorId
 Строковое представление идентификатора вычислителя. Тип String. Строка может быть пустой
 Возвращает
 Возвращает начальный угол кругового массива (в радианах). Тип double.
 Описание
 Метод позволяет получить начальный угол кругового массива. Угол измеряется в радианах.
 Если для параметра выражение отсутствует, то после выполнения метода строки expression и evaluatorId остаются пустыми.
 Ссылки
 Teigha.DatabaseServices.AssocArrayPolarParameters, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!