Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.SurfaceSurfaceIntersector
 Послать отзыв
 Класс SurfaceSurfaceIntersector представляет данные пересечения двух поверхностей.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Geometry::Entity3d Teigha::Geometry::SurfaceSurfaceIntersector
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("ODGeSurfSurfInt")] public class SurfaceSurfaceIntersector : Entity3d
Копировать Код
<Wrapper("ODGeSurfSurfInt")> Public Class SurfaceSurfaceIntersector Inherits Entity3d
 Описание
 Класс SurfaceSurfaceIntersector представляет данные пересечения двух поверхностей.
 Замечания
 Создание объектов этого класса сопровождается указанием двух поверхностей, пересечения которых требуется вычислить. Объект лишь хранит дескрипторы ассоциированных объектов поверхностей, но не владеет ими.
 Геометрия пересечения поверхностей вычисляется в рамках поддерживаемых классом запросов. Любая выходная геометрия, получаемая объектом SurfaceSurfaceIntersector, принадлежит вызывающему объекту.
 В случае изменения (или удаления) одной из связанных поверхностей внутренние результаты пересечения помечаются как недействительные и должны быть перевычислены.
 Если одна из поверхностей равна NULL, выбрасывается исключение kXXUnknown и возвращается значение non-valid.
 Методы
 Конструкторы
 Teigha.Geometry.SurfaceSurfaceIntersector
 Имя
 Описание
 SurfaceSurfaceIntersector
 Это обзор перегрузок SurfaceSurfaceIntersector.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Geometry.Entity3d
 Имя
 Описание
 Entity3d Методы
 Ниже перечислены методы класса Entity3d.
 Teigha.Geometry.SurfaceSurfaceIntersector
 Имя
 Описание
 SurfaceSurfaceIntersector Методы
 Ниже перечислены методы класса SurfaceSurfaceIntersector.
 SurfaceSurfaceIntersector Свойства
 Ниже перечислены свойства класса SurfaceSurfaceIntersector.
 Ссылки
 SurfaceSurfaceIntersector Конструктор, SurfaceSurfaceIntersector Методы, SurfaceSurfaceIntersector Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!