Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Entity.Material
 Послать отзыв
 Свойство предназначено для получения или установки имени материала, назначенного геометрическому объекту, что влияет на его внешний вид при визуализации.
 Синтаксис
C#
Visual Basic
Копировать Код
public String Material;
Копировать Код
Public Property Material() As String
 Возвращает
 Возвращает строковое значение (String), представляющее имя текущего материала, применённого к объекту. Это значение может быть изменено для назначения другого материала.
 Описание
 Свойство предназначено для получения или установки имени материала, назначенного геометрическому объекту, что влияет на его внешний вид при визуализации.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Entity, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!