Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DgnUnderlayItem.UseMasterUnits
 Послать отзыв
 Свойство предоставляет доступ на изменение к флагу, который определяет, использует ли подложка основные единицы измерения из файла DGN при преобразовании файла DGN в формат DWG. Если основные единицы измерения не используются, используются вспомогательные.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool UseMasterUnits;
Копировать Код
Public Property UseMasterUnits() As Boolean
 Возвращает
 Возвращает true, если подложка использует основные единицы измерения из файла DGN. В противном случае возвращает false.
 Описание
 Свойство предоставляет доступ на изменение к флагу, который определяет, использует ли подложка основные единицы измерения из файла DGN при преобразовании файла DGN в формат DWG. Если основные единицы измерения не используются, используются вспомогательные.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.DgnUnderlayItem, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!