Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Plinewid
 Послать отзыв
 Синтаксис
C#
Visual Basic
public double Plinewid;
Public Property Plinewid() As Double
 Описание
 Возвращает или устанавливает текущее значение PLINEWID для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!