Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Dimtxsty
 Послать отзыв
 Синтаксис
C#
Visual Basic
public DatabaseServices::ObjectId Dimtxsty;
Public Property Dimtxsty() As DatabaseServices.ObjectId
 Описание
 Возвращает или устанавливает Id текстового стиля, определенного в текущем значении DIMTXSTY для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!