Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Transaction.GetObject
 Послать отзыв
 Этот метод вызывает метод Open() верхней транзакции. Аргументы метода позволяют задать режим открытия объектов, а также включить доступ к удаленным объектам.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual DBObject GetObject( ObjectId id, OpenMode mode, bool openErased );
Копировать Код
Public virtual Function GetObject( id As ObjectId, mode As OpenMode, openErased As Boolean ) As DBObject
 Параметры
 Параметры
 Описание
 id
 Идентификатор объекта, тип ObjectId.
 mode
 Режим доступа к объекту из перечисления OpenMode.
 openErased
 Флаг, указывающий, следует ли получать удаленные объекты. Значение true позволяет открыть удаленный объект.
 Возвращает
 Возвращает объект DBObject.
 Описание
 Для доступа к объектам этот метод вызывает метод Open() верхней транзакции с передачей ему всех полученных аргументов.
 Поскольку объекты могут быть получены только в рамках верхней транзакции, данный метод избавляет от необходимости как-то сохранять указатель на эту транзакцию, либо использовать для его получения свойство TransactionManager.TopTransaction.
 Если логическое значение openErased равно true, то может быть получен даже удаленный объект. Если openErased имеет значение false, то попытка получить удаленный объект приводит к ошибке.
 Ссылки
 Teigha.DatabaseServices.Transaction, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!