Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.SurfaceSurfaceIntersectorConfigurations.Surface2Right
 Послать отзыв
 Свойство Surface2Right представляет конфигурацию второй поверхности справа от кривой пересечения.
 Синтаксис
C#
Visual Basic
Копировать Код
public SurfaceSurfaceIntersectorConfiguration Surface2Right;
Копировать Код
Public ReadOnly Property Surface2Right As SurfaceSurfaceIntersectorConfiguration
 Возвращает
 Возвращает конфигурацию второй поверхности справа от кривой пересечения. Тип SurfaceSurfaceIntersectorConfiguration.
 Описание
 Свойство Surface2Right представляет конфигурацию второй поверхности справа от кривой пересечения.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.SurfaceSurfaceIntersectorConfigurations, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!