Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.EllipticalCone.MinorAxis
 Послать отзыв
 Свойство MinorAxis представляет направление малой оси данного эллиптического конуса.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d MinorAxis;
Копировать Код
Public ReadOnly Property MinorAxis As Vector3d
 Возвращает
 Возвращает направляющий вектор малой оси эллиптического конуса. Тип Vector3d.
 Описание
 Свойство MinorAxis представляет направление малой оси данного эллиптического конуса.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.EllipticalCone, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!