Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FieldEvaluator.Initialize
 Послать отзыв
 Метод инициализирует новое поле.
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract void Initialize( ref Field pField );
Копировать Код
Public MustOverride Sub Initialize( ByRef pField As Field )
 Параметры
 Параметры
 Описание
 pField
 Инициализируемое поле. Тип Field.
 Описание
 Метод предназначен для инициализации нового поля. Вызывается фреймворком поля после задания в поле кода поля и перед вызовом метода Compile().
 Замечания
 Вычислитель может изменить параметры по умолчанию, которые устанавливаются в поле при его создании. Для каждого поля этот метод вызывается только один раз.
 Ссылки
 Teigha.DatabaseServices.FieldEvaluator, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!