Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Useri1
 Послать отзыв
 Синтаксис
C#
Visual Basic
public int Useri1;
Public Property Useri1() As Integer
 Описание
 Обеспечивает доступ к текущему значению USERI1 для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!