Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Database.ReloadXrefs
 Послать отзыв
 Синтаксис
C#
Visual Basic
public void ReloadXrefs(ref ObjectIdCollection xrefIds);
Public Sub ReloadXrefs(ByRef xrefIds As ObjectIdCollection)
 Параметры
 Параметры
 Описание
 xrefIds
 Входная коллекция Id объектов для таблиц блоков записей внешних ссылок, которые должны быть заново загружены
 Описание
 Этот метод перезагружает файлы внешних ссылок, Id записей таблицы блоков которых есть в xrefIds. Id объектов из xrefIds должны быть из данной базы данных.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!