Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Interval.IsBoundedBelow
 Послать отзыв
 Свойство IsBoundedBelow позволяет проверить, является ли данный интервал ограниченным снизу.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsBoundedBelow;
Копировать Код
Public ReadOnly Property IsBoundedBelow As Boolean
 Возвращает
 Возвращает true, если данный интервал является ограниченным снизу. В противном случае возвращает false.
 Описание
 Свойство IsBoundedBelow позволяет проверить, является ли данный интервал ограниченным снизу.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.Interval, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!