Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Делегат Teigha.DatabaseServices.BeginWblockEntireDatabaseEventHandler
 Послать отзыв
 This is type Teigha::DatabaseServices::BeginWblockEntireDatabaseEventHandler.
 Синтаксис
C#
Visual Basic
public delegate BeginWblockEntireDatabaseEventHandler();
Public Delegate Sub BeginWblockEntireDatabaseEventHandler()
 Ваши комментарии по поводу этого топика: Послать отзыв!