Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MText.ColorChange
 Послать отзыв
 Свойство возвращает строку изменения цвета "C".
 Синтаксис
C#
Visual Basic
Копировать Код
public static String ColorChange;
Копировать Код
Public Shared ReadOnly Property ColorChange As String
 Возвращает
 Возвращает строку изменения цвета. Тип String.
 Описание
 Свойство возвращает строку изменения цвета "C". Может использоваться вместо строковой константы "C", чтобы сделать код более понятным. При использовании в строке, возвращаемой свойством MText.Contents, строка "C" указывает на изменение цвета.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.MText, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!