Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Group.SetLinetypeScale
 Послать отзыв
 Метод позволяет задать масштаб типа линий для всех объектов в данной группе.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetLinetypeScale( double value );
Копировать Код
Public Sub SetLinetypeScale( value As Double )
 Параметры
 Параметры
 Описание
 value
 Масштаб типа линий. Тип double.
 Описание
 Метод позволяет задать масштаб типа линий для всех объектов в данной группе.
 Ссылки
 Teigha.DatabaseServices.Group, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!