Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MText.Contents
 Послать отзыв
 Свойство представляет копию символьного содержимого данного объекта MText. Коды форматирования, используемые для управления переносом, удаляются перед копированием строки.
 Синтаксис
C#
Visual Basic
Копировать Код
public String Contents;
Копировать Код
Public Property Contents As String
 Возвращает
 Возвращает копию символьного содержимого данного объекта. Тип String.
 Описание
 Свойство представляет копию символьного содержимого данного объекта MText. Коды форматирования, используемые для управления переносом, удаляются перед копированием строки.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MText, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!