Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.ExternalCurve3d.IsLine
 Послать отзыв
 Свойство IsLine позволяет проверить, представляет ли данный объект прямую линию.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsLine;
Копировать Код
Public ReadOnly Property IsLine As Boolean
 Возвращает
 Возвращает true, если данный объект представляет прямую линию. В противном случае возвращает false.
 Описание
 Свойство IsLine позволяет проверить, представляет ли данный объект прямую линию.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.ExternalCurve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!