Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Database.CloseInput
 Послать отзыв
 Синтаксис
C#
Visual Basic
public void CloseInput(bool closeFile);
Public Sub CloseInput(closeFile As bool)
 Параметры
 Параметры
 Описание
 closeFile
 Признак закрытия файла после чтения
 Описание
 Если файл чертежа ассоциирован с базой данных, то вызов этой функции приводит к немедленному чтению всей необходимой информации из файла в базу данных. Если параметр closeFile установлен в true, то файл чертежа после завершения чтения будет закрыт.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!