Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Point2dCollection.IsSynchronized
 Послать отзыв
 Свойство IsSynchronized позволяет проверить, является ли доступ к коллекции синхронизированным (потокобезопасным).
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual bool IsSynchronized;
Копировать Код
Public Overridable ReadOnly Property IsSynchronized As Boolean
 Возвращает
 Возвращает true, если доступ к данной коллекции является синхронизированным. В противном случае возвращает false.
 Описание
 Свойство IsSynchronized позволяет проверить, является ли доступ к данной коллекции синхронизированным (потокобезопасным).
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.Point2dCollection, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!