Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AuditInfo.ErrorsFound
 Послать отзыв
 Метод увеличивает счетчик обнаруженных ошибок, которые следует интерпретировать как пропущенные.
 Синтаксис
C#
Visual Basic
Копировать Код
public void ErrorsFound( int count );
Копировать Код
Public Sub ErrorsFound( count As Integer )
 Параметры
 Параметры
 Описание
 count
 Входное количество пропущенных ошибок. Тип int.
 Описание
 Метод увеличивает счетчик обнаруженных ошибок, которые следует интерпретировать как пропущенные.
 Ссылки
 Teigha.DatabaseServices.AuditInfo, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!