Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DataCell.Value
 Послать отзыв
 Свойство возвращает значение, установленное для этой ячейки.
 Синтаксис
C#
Visual Basic
Копировать Код
public Object Value;
Копировать Код
Public Property Value() As Object
 Возвращает
 Возвращает значение в ячейке. Тип Object.
 Описание
 Свойство возвращает значение, установленное для этой ячейки.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.DataCell, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!