Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Entity.GetStretchPointse(Point3dCollection)
 Послать отзыв
 Метод предназначен для добавления в указанный массив stretchPoints координат точек растягивания геометрического объекта, используемых при выполнении команды растяжения в nanoCAD. Метод учитывает, что массив может содержать точки других объектов, поэтому новые точки должны добавляться, а не заменять существующие.
 Синтаксис
C#
Visual Basic
Копировать Код
public void GetStretchPoints(Point3dCollection stretchPoints);
Копировать Код
Public Sub GetStretchPoints(stretchPoints As Point3dCollection)
 Параметры
 Параметры
 Описание
 stretchPoints
 Заранее созданный массив для добавления точек растягивания. После завершения метода в него добавляются точки растягивания геометрического объекта. Тип Point3dCollection
 Описание
 Использование метода
 Разработка метода в производных классах
 Этот метод должен добавить к массиву stretchPoints любые точки, которые определены как точки растягивания для геометрического объекта.
 Точки растягивания используются командой растягивания nanoCAD. Любые точки растягивания, которые находятся в пределах выбранного пересечения с окном, будут передвинуты на ту величину, на которую пользователь решил "растянуть" выбранные геометрические объекты. Любые точки растягивания, которые не попадают в выбранное пересечение с окном, останутся, как они есть. Эта комбинация из нескольких двигающихся точек растягивания, пока остальные остаются на месте и есть то, что "растягивает" геометрический объект. Если все точки растягивания находятся внутри (с учетом пересечений) окна, то геометрический объект передвигается вместо того, чтобы быть растянутым.
 Массив stretchPoints последовательно передается во все геометрические объекты, участвующие в операции растягивания, и массив уже может содержать точки растягивания от других объектов. Поэтом очень важным является, чтобы новые точки добавлялись, а не связывались с уже существующими в массиве элементами.
 Выполнение по умолчанию
 Вызывается метод Entity.GetGripPoints(). Поэтому, до тех пока геометрическому объекту не требуются точки растягивания, отличные от точек переноса, переопределять метод не нужно.
 Ссылки
 Teigha.DatabaseServices.Entity, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!