Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Scale2d.RemoveScale
 Послать отзыв
 Метод вычисляет вектор масштабирования, который соответствует указанной матрице преобразования, после чего исключает из этой матрицы компоненту масштабирования.
 Синтаксис
C#
Visual Basic
Копировать Код
public static Scale2d RemoveScale( Matrix2d mat );
Копировать Код
Public Shared Function RemoveScale( mat As Matrix2d ) As Scale2d
 Параметры
 Параметры
 Описание
 mat
 Входная матрица преобразования. Тип Matrix2d.
 Возвращает
 Возвращает вектор масштабирования в матрице mat в ее исходном состоянии. Тип Scale2d.
 Описание
 Метод извлекает вектор масштабирования из указанной матрицы преобразования, после чего исключает из этой матрицы компоненту масштабирования, приводя ее вектор-столбцы к единичной длине.
 Ссылки
 Teigha.Geometry.Scale2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!