Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.EllipticalCone.EllipticalCone
 Послать отзыв
 Конструктор класса EllipticalCone. Создает экземпляр класса с указанными косинусом и синусом половинного угла, положением начала координат, малым и большим радиусами, направляющим вектором оси конуса, интервалом высоты, а также начальным и конечным углами.
 Синтаксис
C#
Visual Basic
Копировать Код
public EllipticalCone( double cosineAngle, double sineAngle, Point3d baseOrigin, double minorRadius, double majorRadius, Vector3d axisOfSymmetry, Vector3d referenceAxis, ref Interval height, double startAngle, double endAngle );
Копировать Код
Public Sub New( cosineAngle As Double, sineAngle As Double, baseOrigin As Point3d, minorRadius As Double, majorRadius As Double, axisOfSymmetry As Vector3d, referenceAxis As Vector3d, ByRef height As Interval, startAngle As Double, endAngle As Double )
 Параметры
 Параметры
 Описание
 cosineAngle
 Косинус половинного угла. Тип double.
 sineAngle
 Синус половинного угла. Тип double.
 baseOrigin
 Начало координат в основании конуса. Тип Point3d.
 minorRadius
 Малый радиус эллиптического конуса. Тип double.
 majorRadius
 Большой радиус эллиптического конуса. Тип double.
 axisOfSymmetry
 Направляющий вектор оси (симметрии) конуса. Тип Vector3d.
 height
 Интервал высоты конуса. Тип Interval.
 startAngle
 Начальный угол конуса. Тип double.
 endAngle
 Конечный угол конуса. Тип double.
 referenceAxis
 Направляющий вектор большой оси эллиптического конуса. Тип Vector3d.
 Описание
 Конструктор класса EllipticalCone. Создает экземпляр класса с указанными косинусом и синусом половинного угла, точкой начала координат, малым и большим радиусами, направляющим вектором оси (симметрии) конуса, интервалом высоты, а также начальным и конечным углами.
 Ссылки
 Teigha.Geometry.EllipticalCone, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!