Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Filters.LayerFilter.LayerFilter
 Послать отзыв
 Конструктор класса LayerFilter по умолчанию.
 Синтаксис
C#
Visual Basic
Копировать Код
public LayerFilter();
Копировать Код
Public Sub New()
 Описание
 Конструктор класса LayerFilter по умолчанию.
 Ссылки
 Teigha.DatabaseServices.Filters.LayerFilter, Teigha.DatabaseServices.Filters
 Ваши комментарии по поводу этого топика: Послать отзыв!