Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.HpOrigin
 Послать отзыв
 Синтаксис
C#
Visual Basic
public Point2d HpOrigin;
Public Property HpOrigin() As Point2d
 Описание
 Возвращает или устанавливает 2D точку, которая представляет текущее значение HPORIGIN для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!