Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LayerStateManager.GetLayerStateMask
 Послать отзыв
 Возвращает маску для именованного состояния слоя.
 Синтаксис
C#
Visual Basic
Копировать Код
public LayerStateMasks GetLayerStateMask( ref String name );
Копировать Код
Public Function GetLayerStateMask( ByRef name As String ) As LayerStateMasks
 Параметры
 Параметры
 Описание
 name
 Имя состояния слоя, тип String.
 Возвращает
 Возвращаемый тип - LayerStateMasks.
 Описание
 Возвращает маску для именованного состояния слоя.
 Ссылки
 Teigha.DatabaseServices.LayerStateManager, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!