Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство RasterImage.Width
 Послать отзыв
 Синтаксис
C#
Visual Basic
public double Width;
Public Property Width() As Double
 Описание
 Возвращает ширину растрового изображения.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.RasterImage, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!