Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SectionSettings.HatchAngle
 Послать отзыв
 Метод позволяет получить значение угла наклона штриховки геометрии указанного типа.
 Синтаксис
C#
Visual Basic
Копировать Код
public double HatchAngle( SectionType nSecType, SectionGeometry nGeometry );
Копировать Код
Public Function HatchAngle( nSecType As SectionType, nGeometry As SectionGeometry ) As Double
 Параметры
 Параметры
 Описание
 nSecType
 Тип сечения. Перечисление SectionType.
 nGeometry
 Типы элементов геометрии сечения. Перечисление SectionGeometry.
 Возвращает
 Возвращает угол наклона штриховки в радианах. Тип double.
 Описание
 Метод позволяет получить значение угла наклона штриховки геометрии указанного типа.
 Ссылки
 Teigha.DatabaseServices.SectionSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!