Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObject.GetTransientReactors()
 Послать отзыв
 Метод предназначен для получения коллекции указателей на временные реакторы объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public Generic.List<RXObject> GetTransientReactors();
Копировать Код
Public Function GetTransientReactors() As Generic.List<RXObject>
 Возвращает
 Метод возвращает коллекцию указателей на временные реакторы объекта. Тип Generic.List<RXObject>
 Описание
 Метод предоставляет доступ к временным реакторам данного объекта.
 Ссылки
 Teigha.DatabaseServices.DBObject, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!