Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.RotatedDimension.Oblique
 Послать отзыв
 Свойство предоставляет доступ к углу наклона выносной линии (в радианах) данного размера.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Oblique;
Копировать Код
Public Property Oblique() As double
 Возвращает
 Возвращает или задает угол наклона выносных линий в радианах, тип double.
 Описание
 Свойство предоставляет доступ к углу наклона выносной линии (в радианах) для данного размера.
 Этот угол относится к значению RotatedDimension.Rotation. Положительным направлением отсчета углов является направление против часовой стрелки, если смотреть против оси Z системы координат размера (OCS) в направлении начала координат.
 Линия, которой принадлежат две начальные точки выносных линий, делит плоскость, содержащую размер, на две полуплоскости. Выносные линии могут находиться дишь в полуплоскости, содержащей точку определения размерной линии (dimension line definition point).
 Таким образом, угол наклона является периодическим с периодом от 0 до pi. Углы наклона, большие, чем pi, просто приводится к эквивалентному углу в первом периоде.
 Отрицательные углы являются периодическими с интервалом от 0 до -pi и приводят к тому же наклону, что и положительный угол, который получается, если число pi добавить к их значению в первом периоде (например, -pi/4 совпадает с 3 х pi/4).
 Особым случаем является нулевой угол. Он интерпретируется как указание "использовать значение по умолчанию", что означает угол наклона, равный pi/2 (90 градусов).
 Замечания
 Положительное направление отсчета углов - против часовой стрелки, если смотреть в сторону начала вектора нормали плоскости размера.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.RotatedDimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!