Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.ExternalCurve2d.IsDefined
 Послать отзыв
 Свойство IsDefined позволяет проверить, является ли данный объект определенным, т.е. сформировано ли определение данной кривой.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsDefined;
Копировать Код
Public ReadOnly Property IsDefined As Boolean
 Возвращает
 Возвращает true, если данный объект имеет определение кривой. В противном случае возвращает false.
 Описание
 Свойство IsDefined позволяет проверить, является ли данный объект определенным, т.е. сформировано ли определение данной кривой.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.ExternalCurve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!