Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AbstractViewTableRecord.Ucs
 Послать отзыв
 Свойство Ucs представляет пользовательскую систему координат для записи в таблице видовых экранов.
 Синтаксис
C#
Visual Basic
Копировать Код
public Geometry.CoordinateSystem3d Ucs;
Копировать Код
Public ReadOnly Property Ucs As Geometry.CoordinateSystem3d
 Возвращает
 Возвращает пользовательскую систему координат для TableRecord. Тип Geometry.CoordinateSystem3d.
 Описание
 Свойство Ucs представляет пользовательскую систему координат (ПСК, UCS), связанную с объектом TableRecord.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.AbstractViewTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!