Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SectionSettings.LineWeight
 Послать отзыв
 Метод позволяет получить вес линий, используемых для построения геометрии указанного типа.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.LineWeight LineWeight( SectionType nSecType, SectionGeometry nGeometry );
Копировать Код
Public Function LineWeight( nSecType As SectionType, nGeometry As SectionGeometry ) As DatabaseServices.LineWeight
 Параметры
 Параметры
 Описание
 nSecType
 Тип сечения. Перечисление SectionType.
 nGeometry
 Типы элементов геометрии сечения. Перечисление SectionGeometry.
 Возвращает
 Возвращает вес (толщину) линий как значение из перечисления DatabaseServices.LineWeight.
 Описание
 Метод позволяет получить вес линий, используемых для построения геометрии указанного типа. Вес линий может определяться настройками слоя или блока, весом линий по умолчанию или же задаваться конкретным числовым значением из перечисления DatabaseServices.LineWeight.
 Ссылки
 Teigha.DatabaseServices.SectionSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!