Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Событие Database.XrefBeginAttached
 Послать отзыв
 Синтаксис
C#
Visual Basic
public event XrefBeginOperationEventHandler XrefBeginAttached;
Public Event XrefBeginAttached As XrefBeginOperationEventHandler
 Описание
 Событие показывает, что внешняя ссылка присоединена в базу данных.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!