Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FieldFilingOptions
 Послать отзыв
 Данное перечисление определяет вариант сохранения, задаваемый вычислителями полей.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum FieldFilingOptions { SkipFilingResult = 1 }
Копировать Код
Public Enum FieldFilingOptions SkipFilingResult = 1 End Enum
 Члены
 Члены
 Описание
 SkipFilingResult
 Значение: 1. Не сохранять вместе с полем кэшированный результат его вычисления.
 Описание
 Данное перечисление определяет вариант сохранения, задаваемый вычислителями полей.
 Ваши комментарии по поводу этого топика: Послать отзыв!