Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObject.SetPaperOrientation(bool)
 Послать отзыв
 Метод задает свойство ориентации бумаги для указанного объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetPaperOrientation(bool bPaperOrientation);
Копировать Код
Public Sub SetPaperOrientation(bPaperOrientation As bool)
 Параметры
 Параметры
 Описание
 bPaperOrientation
 Новое значение свойства ориентации листа. Тип bool
 Описание
 Устанавливает текущее значение свойства ориентации листа в аннотационном объекте.
 Ссылки
 Teigha.DatabaseServices.DBObject, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!