Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.UnderlayLayerCollection.GetEnumerator
 Послать отзыв
 Метод предоставляет перечислитель для данной коллекции.
 Синтаксис
C#
Visual Basic
Копировать Код
public Collections.IEnumerator GetEnumerator();
Копировать Код
Public Function GetEnumerator() As Collections.IEnumerator
 Возвращает
 Возвращает перечислитель для данной коллекции. Тип Collections.IEnumerator.
 Описание
 Метод предоставляет перечислитель для данной коллекции.
 Ссылки
 Teigha.DatabaseServices.UnderlayLayerCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!