Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Spline.SetFitPointAt
 Послать отзыв
 Метод позволяет изменить координаты определяющей точки данного сплайна с заданным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetFitPointAt( int index, Point3d point );
Копировать Код
Public Sub SetFitPointAt( index As Integer, point As Point3d )
 Параметры
 Параметры
 Описание
 index
 Индекс определяющей точки. Тип int.
 point
 Новое положение определяющей точки в мировой системе координат (WCS). Тип Point3d.
 Описание
 Метод позволяет изменить координаты определяющей точки данного сплайна с заданным индексом.
 Ссылки
 Teigha.DatabaseServices.Spline, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!