Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.HostApplicationServices.recoverFile
 Послать отзыв
 Метод предназначен для восстановления файла в указанном файловом буфере.
 Синтаксис
C#
Visual Basic
Копировать Код
public Database recoverFile( ref StreamBuf fileBuff, ref AuditInfo auditInfo, ref String password );
Копировать Код
Public Function recoverFile( ByRef fileBuff As StreamBuf, ByRef auditInfo As AuditInfo, ByRef password As String ) As Database
 Параметры
 Параметры
 Описание
 fileBuff
 Файловый буфер с данными для восстановления. Тип StreamBuf.
 auditInfo
 Объект AuditInfo для данных аудита процесса восстановления файла.
 password
 Пароль для доступа к файлу. Тип String.
 Возвращает
 Возвращает дескриптор базы данных восстановленного файла. Тип Database.
 Описание
 Метод предназначен для восстановления файла в указанном файловом буфере.
 Ссылки
 Teigha.DatabaseServices.HostApplicationServices, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!