Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CircularArc3d.CircularArc3d
 Послать отзыв
 Конструктор класса CircularArc3d. Создает окружность с заданными центром, радиусом и вектором нормали плоскости дуги.
 Синтаксис
C#
Visual Basic
Копировать Код
public CircularArc3d( Point3d center, Vector3d normal, double radius );
Копировать Код
Public Sub New( center As Point3d, normal As Vector3d, radius As Double )
 Параметры
 Параметры
 Описание
 center
 Центр 3D-окружности. Тип Point3d.
 normal
 Вектор нормали плоскости, в которой создается 3D-окружность. Тип Vector3d.
 radius
 Радиус 3D-окружности. Тип double. Радиус не может равняться 0.
 Описание
 Конструктор класса CircularArc3d. Создает окружность с заданными центром, радиусом и вектором нормали плоскости дуги. Созданная 3D-окружность ориентирована против часовой стрелки вокруг вектора нормали.
 Ссылки
 Teigha.Geometry.CircularArc3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!