Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DbHomeView.DbHomeView
 Послать отзыв
 Конструктор класса DbHomeView.
 Синтаксис
C#
Visual Basic
Копировать Код
public DbHomeView( IntPtr unmanagedPointer, bool autoDelete );
Копировать Код
Public Sub New( unmanagedPointer As IntPtr, autoDelete As Boolean )
 Параметры
 Параметры
 Описание
 unmanagedPointer
 Неуправляемый указатель на исходный объект. Тип IntPtr.
 autoDelete
 Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.
 Описание
 Конструктор класса DbHomeView.
 Ссылки
 Teigha.DatabaseServices.DbHomeView, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!