Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство SymbolTableRecord.IsDependent
 Послать отзыв
 Синтаксис
C#
Visual Basic
public bool IsDependent;
Public Property IsDependent() As bool
 Описание
 Возвращает true, если запись таблицы символов является зависимой (т.е. частью присоединенной внешней ссылки чертежа), в противном случае возвращает false.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.SymbolTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!