Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SubentRef.CreateEntity
 Послать отзыв
 Метод создает новый объект чертежа на основе данной ссылки на подобъект.
 Синтаксис
C#
Visual Basic
Копировать Код
public Teigha.DatabaseServices.Entity CreateEntity();
Копировать Код
Public Function CreateEntity() As Teigha.DatabaseServices.Entity
 Возвращает
 Возвращает новый объект чертежа. Тип Teigha.DatabaseServices.Entity.
 Описание
 Метод создает новый объект чертежа на основе данной ссылки на подобъект.
 Ссылки
 Teigha.DatabaseServices.SubentRef, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!