Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MlineStyleElementCollectionEnumerator
 Послать отзыв
 Данный класс представляет перечислитель для коллекции объектов MlineStyleElement.
 Иерархия классов
Teigha::DatabaseServices::MlineStyleElementCollectionEnumerator
 Синтаксис
C#
Visual Basic
Копировать Код
public sealed class MlineStyleElementCollectionEnumerator : IEnumerator
Копировать Код
Public NotInheritable Class MlineStyleElementCollectionEnumerator Implements IEnumerator
 Описание
 Данный класс представляет перечислитель для коллекции объектов MlineStyleElement.
 Методы
 Конструкторы
 Имя
 Описание
 MlineStyleElementCollectionEnumerator
 Конструктор класса MlineStyleElementCollectionEnumerator. Создает перечислитель для указанной коллекции объектов MlineStyleElement.
 Топики
 Имя
 Описание
 MlineStyleElementCollectionEnumerator Методы
 Ниже перечислены методы класса MlineStyleElementCollectionEnumerator.
 MlineStyleElementCollectionEnumerator Свойства
 Ниже перечислены свойства класса MlineStyleElementCollectionEnumerator.
 Ссылки
 MlineStyleElementCollectionEnumerator Методы, MlineStyleElementCollectionEnumerator Свойства, Методы, Топики, MlineStyleElementCollectionEnumerator Методы, MlineStyleElementCollectionEnumerator Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!