Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.PointOnSurface.GetInverseTangentVector
 Послать отзыв
 Метод проецирует указанный 3D-вектор на касательную плоскость в указанной точке и возвращает вектор в 2D-пространстве параметров, который соответствует полученному вектору-проекции.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector2d GetInverseTangentVector( Vector3d vector, Point2d point );
Копировать Код
Public Function GetInverseTangentVector( vector As Vector3d, point As Point2d ) As Vector2d
 Параметры
 Параметры
 Описание
 vector
 Входной вектор, который проецируется на касательную плоскость в точке point. Тип Vector3d.
 point
 Входная точка на поверхности. Тип Point2d.
 Возвращает
 Возвращает 2D-вектор в пространстве параметров, который отображается на проекцию вектора vector. Тип Vector2d.
 Описание
 Метод проецирует 3D-вектор vector на касательную плоскость в точке point и возвращает вектор в 2D-пространстве параметров, который соответствует полученному вектору-проекции.
 Ссылки
 Teigha.Geometry.PointOnSurface, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!