Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocAction.AreDependenciesEqual
 Послать отзыв
 Метод реализует проверку равенства ассоциативных зависимостей. Решение принимается на уровне действия, являющегося владельцем зависимости.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool AreDependenciesEqual( ref AssocDependency dependency1, ref AssocDependency dependency2 );
Копировать Код
Public Function AreDependenciesEqual( ByRef dependency1 As AssocDependency, ByRef dependency2 As AssocDependency ) As Boolean
 Параметры
 Параметры
 Описание
 dependency1
 Первая ассоциативная зависимость. Тип AssocDependency.
 dependency2
 Вторая ассоциативная зависимость. Тип AssocDependency.
 Возвращает
 Возвращает true в случае равенства зависимостей. В противном случае возвращает false.
 Описание
 Метод реализует проверку равенства ассоциативных зависимостей.
 Метод делегирован из принадлежащего зависимости предиката AssocDependency.IsEqualTo(). Это позволяет владеющему действию, а не самой зависимости, решать, равны ли две зависимости. Реализация по умолчанию просто возвращает false.
 Если действие владеет объектом AssocActionBody, который переопределяет предикат areDependencyEqualOveride(), то вызывается этот предикат (а не просто возвращается false).
 Ссылки
 Teigha.DatabaseServices.AssocAction, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!