Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Solid3dMassProperties.PrincipalMoments
 Послать отзыв
 Свойство PrincipalMoments представляет главные моменты инерции твердого тела относительно осей X, Y и Z.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d PrincipalMoments;
Копировать Код
Public ReadOnly Property PrincipalMoments As Vector3d
 Возвращает
 Возвращает главные моменты инерции. Тип Vector3d.
 Описание
 Свойство PrincipalMoments представляет главные моменты инерции твердого тела относительно осей X, Y и Z.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Solid3dMassProperties, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!