Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LoftOptions.DraftStart
 Послать отзыв
 Свойство возвращает угол в радианах, под которым результирующая поверхность вытягивается из первого поперечного сечения (start draft angle, угол выхода поверхности из сечения).
 Синтаксис
C#
Visual Basic
Копировать Код
public double DraftStart;
Копировать Код
Public ReadOnly Property DraftStart As Double
 Возвращает
 Возвращает угол сопряжения поверхности с первым поперечным сечением (в радианах). Тип double.
 Описание
 Свойство возвращает угол в радианах, под которым результирующая поверхность вытягивается из первого поперечного сечения (start draft angle, угол выхода поверхности из сечения). Значение по умолчанию — 0, что означает, что конкретное значение угла не задано, и система автоматически вычислит оптимальный угол для первого поперечного сечения.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.LoftOptions, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!