Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Viewport.PlotAsRaster
 Послать отзыв
 Свойство PlotAsRaster позволяет определить, выводится ли данный видовой экран на печать в растровом режиме с использованием своих текущих настроек тонирования.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool PlotAsRaster;
Копировать Код
Public ReadOnly Property PlotAsRaster As Boolean
 Возвращает
 Возвращает true, если видовой экран выводится на печать в растровом режиме с использованием своих настроек тонирования. В противном случае возвращает false.
 Описание
 Свойство PlotAsRaster позволяет определить, выводится ли данный видовой экран на печать в растровом режиме с использованием своих текущих настроек тонирования.
 Это свойство будет иметь значение true, если отключены все перечисленные ниже параметры:
Режим рендеринга — Wireframe или Optimized2D;
Тип визуального стиля — Wireframe2D или Wireframe3D;
Визуальный стиль использует модель освещения FaceStyle.LightingModel = LightingModel.Invisible для граней и модель EdgeStyle.EdgeModel = EdgeModel.Isolines для рёбер.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Viewport, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!