Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.TransactionManager.AddNewlyCreatedDBObject
 Послать отзыв
 Данный метод добавляет в транзакцию вновь созданную запись DBObject в базе данных.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void AddNewlyCreatedDBObject( ref DBObject obj, bool add );
Копировать Код
Public virtual Sub AddNewlyCreatedDBObject( ByRef obj As DBObject, add As Boolean )
 Параметры
 Параметры
 Описание
 obj
 Объект DBObject.
 add
 Если add == true, объект, на который указывает obj, добавляется к верхней транзакции. Если add == false, то объект удаляется.
 Описание
 Метод добавляет в транзакцию вновь созданную запись DBObject в базе данных.
 Аргумент obj должен указывать на только что созданный объект, т.е. такой объект, который уже находится в базе данных и имееет ObjectId, но еще ни разу не закрывался.
 Замечания
 Операции добавления и удаления выполняются в объекте верхней транзакции в стеке транзакций (т.е. в последнем созданном объекте Transaction).
 Ссылки
 Teigha.DatabaseServices.TransactionManager, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!