Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.BoundaryRepresentation.Mesh
 Послать отзыв
 Класс Mesh реализует базовый интерфейс сети.
 Иерархия классов
Teigha::BoundaryRepresentation::MeshEntity Teigha::BoundaryRepresentation::Mesh
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("AcBrMesh")] public class Mesh : MeshEntity;
Копировать Код
<Wrapper("AcBrMesh")> Public Class Mesh Inherits MeshEntity
 Описание
 Класс Mesh реализует базовый интерфейс сети.
 Сеть представляет собой сеть узлов, аппроксимирующих кривые, поверхности или объемы в объекте или подобъекте BREP и, таким образом, имеет связанную геометрию. Этот класс определяет функционал, общий для сетей всех размерностей и используемый через дочерние классы. Сети каждой поддерживаемой размерности соответствует собственный класс. В узлах и элементах сети сохраняются ссылки как на геометрию, так и на соответствующую исходную топологию BREP. Фасетирование общего вида представлено подклассом Mesh2d.
 Топики
 Имя
 Описание
 MeshEntity Методы
 Ниже перечислены методы класса MeshEntity.
 MeshEntity Свойства
 Ниже перечислены свойства класса MeshEntity.
 Ссылки
 Топики, MeshEntity Методы, MeshEntity Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!