Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ObjectContextCollectionEnumerator
 Послать отзыв
 Этот класс представляет перечислитель для коллекции объектов ObjectContext.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::DatabaseServices::ObjectContextCollectionEnumerator
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdDbObjectContextCollectionIterator")] public class ObjectContextCollectionEnumerator : RXObject, IEnumerator
Копировать Код
<Wrapper("OdDbObjectContextCollectionIterator")> Public Class ObjectContextCollectionEnumerator Inherits RXObject Implements IEnumerator
 Описание
 Этот класс представляет перечислитель для коллекции объектов ObjectContext.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.DatabaseServices.ObjectContextCollectionEnumerator
 Имя
 Описание
 ObjectContextCollectionEnumerator Методы
 Ниже перечислены методы класса ObjectContextCollectionEnumerator.
 ObjectContextCollectionEnumerator Свойства
 Ниже перечислены свойства класса ObjectContextCollectionEnumerator.
 Ссылки
 ObjectContextCollectionEnumerator Методы, ObjectContextCollectionEnumerator Свойства, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!