Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObject.WblockClone(RXObject
 Послать отзыв
 Метод выполняет неглубокое клонирование этого объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public DBObject WblockClone(RXObject ownerPointer, IdMapping idMap, bool isPrimary);
Копировать Код
Public Function WblockClone(ownerPointer As RXObject, idMap As IdMapping, isPrimary As bool) As DBObject
 Параметры
 Параметры
 Описание
 ownerPointer
 Входной объект, который клонируется. Тип RxObject
 idMap
 Карта преобразований Id текущего объекта. Тип IdMapping
 isPrimary
 Признак, является ли объект первичным или имеет владельца. Тип bool
 Возвращает
 Возвращает созданной клон. Тип DBObject Если операция клонирования завершается ошибкой, возвращается значение null.
 Описание
 Этот метод практически идентичен методу DBObject.DeepClone(), за исключением того, что использование WblockCloneFiler не должно выходить за границы базы данных. Субклонирование базируется на жестком задании владельца и жестком указании на связи.
 Ссылки
 Teigha.DatabaseServices.DBObject, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!