Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObjectCollection.Count
 Послать отзыв
 В свойстве хранится количество элементов в коллекции.
 Синтаксис
C#
Visual Basic
Копировать Код
public int Count;
Копировать Код
Public Property Count() As Integer
 Возвращает
 Возвращает количество элементов в коллекции (int).
 Описание
 В свойстве хранится количество элементов в коллекции.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.DBObjectCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!