Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Ole2Frame.HimetricWidth
 Послать отзыв
 Свойство представляет ширину окна в единицах измерения, не зависящих от разрешения устройства вывода. Не используется и в будущих релизах будет удалено или переименовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public short HimetricWidth;
Копировать Код
Public ReadOnly Property HimetricWidth As Short
 Возвращает
 Возвращает ширину окна. Тип short.
 Описание
 Свойство представляет ширину окна в единицах измерения, не зависящих от разрешения устройства вывода. Не используется и в будущих релизах будет удалено или переименовано.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Ole2Frame, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!