Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MText.Normal
 Послать отзыв
 Свойство представляет нормаль плоскости (WCS), в которой располагается данный объект MText.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d Normal;
Копировать Код
Public Property Normal As Vector3d
 Возвращает
 Возвращает нормаль плоскости в мировой системе координат (WCS). Тип Vector3d.
 Описание
 Свойство представляет нормаль плоскости (WCS), в которой располагается данный объект MText.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MText, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!