Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LayerStateManager.LayerStateRenamed
 Послать отзыв
 Событие завершения переименования состояния слоя.
 Синтаксис
C#
Visual Basic
Копировать Код
public event LayerStateRenameEventHandler LayerStateRenamed;
Копировать Код
Public Event LayerStateRenamed As LayerStateRenameEventHandler
 Описание
 Событие завершения переименования состояния слоя.
 Ссылки
 Teigha.DatabaseServices.LayerStateManager, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!