Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CoordinateSystem2d.IsEqualTo
 Послать отзыв
 Метод позволяет проверить, совпадает ли переданная в метод координатная система CoordinateSystem2d с данным объектом в пределах заданной точности.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsEqualTo( CoordinateSystem2d a, Tolerance tolerance );
Копировать Код
Public Function IsEqualTo( a As CoordinateSystem2d, tolerance As Tolerance ) As Boolean
 Параметры
 Параметры
 Описание
 a
 Проверяемая система координат. Тип CoordinateSystem2d.
 tolerance
 Заданная точность вычислений. Тип Tolerance.
 Возвращает
 Возвращает true, если переданная система координат a не является нулевой и имеет те же начальную точку и направляющие векторы осей X и Y. В противном случае возвращает false.
 Описание
 Метод позволяет проверить, совпадает ли переданная в метод координатная система CoordinateSystem2d с данным объектом в пределах заданной точности.
 Ссылки
 Teigha.Geometry.CoordinateSystem2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!