Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DatabaseSummaryInfo.LastSavedBy
 Послать отзыв
 Свойство предоставляет доступ к данным о пользователе, который внёс в этот объект наиболее поздние изменения.
 Синтаксис
C#
Visual Basic
Копировать Код
public String LastSavedBy;
Копировать Код
Public Property LastSavedBy() As String
 Возвращает
 Возвращает значение поля LastSavedBy. Тип String.
 Описание
 Свойство предоставляет доступ к данным о пользователе, который внёс в этот объект наиболее поздние изменения.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.DatabaseSummaryInfo, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!