Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MentalRayRenderSettings.GISampleCount
 Послать отзыв
 Свойство GISampleCount представляет максимальное количество фотонов в области точки выборки рендеринга, которые используются при расчете глобального освещения.
 Синтаксис
C#
Visual Basic
Копировать Код
public int GISampleCount;
Копировать Код
Public Property GISampleCount As Integer
 Возвращает
 Возвращает максимальное количество фотонов в области точки выборки рендеринга. Тип int.
 Описание
 Свойство GISampleCount представляет максимальное количество фотонов в области точки выборки рендеринга, которые используются при расчете глобального освещения.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MentalRayRenderSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!