Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.NurbsData.IsEqualTo
 Послать отзыв
 Метод позволяет проверить, что данный объект идентичен другому объекту NurbsData в пределах указанного допуска.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsEqualTo( NurbsData other, Tolerance tolerance );
Копировать Код
Public Function IsEqualTo( other As NurbsData, tolerance As Tolerance ) As Boolean
 Параметры
 Параметры
 Описание
 other
 Другой объект, с которым проверяется равенство. Тип NurbsData.
 tolerance
 Допуск для сравнения на равенство. Тип Tolerance.
 Возвращает
 Возвращает true, если данный объект идентичен объекту other в пределах указанного допуска. В противном случае возвращает false.
 Описание
 Метод позволяет проверить, что в пределах указанного допуска данный объект идентичен другому объекту NurbsData.
 Идентичность означает одновременное выполнение следующих условий (в пределах указанного допуска):
Совпадают управляющие вершины.
Совпадают узловые точки.
Совпадают степени сплайнов.
Оба сплайна являются рациональными, либо оба являются нерациональными.
Оба сплайна являются замкнутыми, либо оба являются незамкнутыми.
Оба сплайна являются периодическими, либо оба являются непериодическими.
 Ссылки
 Teigha.DatabaseServices.NurbsData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!