Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Material.FinalGather
 Послать отзыв
 Свойство представляет режим финальной сборки для данного материала.
 Синтаксис
C#
Visual Basic
Копировать Код
public GraphicsInterface.FinalGatherMode FinalGather;
Копировать Код
Public Property FinalGather As GraphicsInterface.FinalGatherMode
 Возвращает
 Возвращает текущий режим финальной сборки. Перечисление GraphicsInterface.FinalGatherMode.
 Описание
 Свойство представляет режим финальной сборки для данного материала. Используется при расчете общего освещения.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Material, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!