Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DimAssoc.AddToDimensionReactor
 Послать отзыв
 Метод добавляет или удаляет реактор между размером и объектом DimAssoc.
 Синтаксис
C#
Visual Basic
Копировать Код
public void AddToDimensionReactor( bool isAdd );
Копировать Код
Public Sub AddToDimensionReactor( isAdd As Boolean )
 Параметры
 Параметры
 Описание
 isAdd
 Флаг, который определяет, следует ли добавить или удалить реактор. Тип bool. Если передается значение false, реактор удаляется.
 Описание
 Метод позволяет добавить или удалить реактор между размером и объектом DimAssoc. Выбор между этими действиями определяет входной логический аргумент isAdd.
 Ссылки
 Teigha.DatabaseServices.DimAssoc, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!