Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DxfFiler.WriteVector2d
 Послать отзыв
 Метод записывает в данный объект Filer указанный 2D-вектор и точность представления координат вектора.
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract void WriteVector2d( DxfCode opCode, Vector2d value, int precision );
Копировать Код
Public MustOverride Sub WriteVector2d( opCode As DxfCode, value As Vector2d, precision As Integer )
 Параметры
 Параметры
 Описание
 opCode
 Групповой код DXF. Тип DxfCode.
 value
 Значение, которое следует записать. Тип Vector2d.
 precision
 Количество цифр после запятой в интервале от 0 до 16. Тип int.
 Описание
 Метод записывает в данный объект Filer указанные групповой код DXF, 2D-вектор и точность представления координат вектора.
 Ссылки
 Teigha.DatabaseServices.DxfFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!