Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.Dimldrblks
 Послать отзыв
 Свойство задает или возвращает имя блока стрелок на концах линий выноски.
 Синтаксис
C#
Visual Basic
Копировать Код
public String Dimldrblks;
Копировать Код
Public Property Dimldrblks As String
 Возвращает
 Возвращает имя блока стрелок. Тип String.
 Описание
 Свойство задает или возвращает имя блока стрелок на концах линий выноски. Допустимы следующие имена блоков:
 Значение
 Описание
 "None"
 Отсутствует.
 "Closed"
 Закрытая.
 "Dot"
 Точка.
 "ClosedBlank"
 Контурная замкнутая.
 "Oblique"
 Засечка.
 "ArchTick"
 Двойная засечка.
 "Open"
 Разомкнутая.
 "Origin"
 Указатель исходной точки.
 "Origin2"
 Указатель исходной точки 2.
 "Open90"
 Разомкнутая 90 градусов (прямой угол).
 "Open30"
 Разомкнутая 30 градусов.
 "DotBlank"
 Контурная точка.
 "DotSmall"
 Малая точка.
 "BoxFilled"
 Заполненный прямоугольник.
 "BoxBlank"
 Прямоугольник.
 "DatumFilled"
 Заполненный треугольник базы отсчета.
 "DatumBlank"
 Треугольник базы отсчета.
 "Integral"
 Интеграл.
 "Small"
 Контурная малая точка.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!