Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Group.Transfer
 Послать отзыв
 Этот метод предоставляет возможность изменять порядок следования элементов внутри группы целыми диапазонами индексов.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Transfer( int fromIndex, int toIndex, int numItems );
Копировать Код
Public Sub Transfer( fromIndex As Integer, toIndex As Integer, numItems As Integer )
 Параметры
 Параметры
 Описание
 fromIndex
 Индекс первого перемещаемого объекта. Тип int.
 toIndex
 Новый индекс первого перемещаемого объекта. Тип int.
 numItems
 Количество перемещаемых объектов группы. Тип int.
 Описание
 Этот метод предоставляет возможность изменять порядок следования элементов внутри группы целыми диапазонами индексов.
 Ссылки
 Teigha.DatabaseServices.Group, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!