Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PropertiesOverrule.SetIdFilter
 Послать отзыв
 Метод включает предварительную фильтрацию объектов по их ObjectId прежде чем применять к ним объектное переопределение. Переопределения будут вызываться только для объектов, чей ObjectId присутствует в заданном массиве идентификаторов.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetIdFilter( ref ObjectId[] ids );
Копировать Код
Public Sub SetIdFilter( ByRef ids As ObjectId[] )
 Параметры
 Параметры
 Описание
 ids
 Массив идентификаторов объектов. Тип ObjectId[].
 Описание
 Метод включает предварительную фильтрацию объектов по их ObjectId прежде чем применять к ним объектное переопределение.
 Переопределения будут вызываться только для объектов, чей ObjectId присутствует в заданном массиве идентификаторов.
 Ссылки
 Teigha.DatabaseServices.PropertiesOverrule, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!