Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Matrix3d.GetHashCode
 Послать отзыв
 Метод предоставляет хеш-код для данной матрицы.
 Синтаксис
C#
Visual Basic
Копировать Код
public int GetHashCode();
Копировать Код
Public Function GetHashCode() As Integer
 Возвращает
 Возвращает хеш-код объекта. Тип int.
 Описание
 Метод предоставляет хеш-код для данной матрицы.
 Ссылки
 Teigha.Geometry.Matrix3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!