Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Hatch.IsSolidFill
 Послать отзыв
 Синтаксис
C#
Visual Basic
public bool IsSolidFill;
Public Property IsSolidFill() As bool
 Описание
 Возвращает признак того, что объект заливки сконфигурирован для сплошной заливки.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.Hatch, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!