Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.OpenMode
 Послать отзыв
 Этот перечислимый тип предоставляет режимы доступа к открываемым резидентным объектам базы данных.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum OpenMode { ForRead = 0, ForWrite = 1, ForNotify = 2 }
Копировать Код
Public Enum OpenMode ForRead = 0 ForWrite = 1 ForNotify = 2 End Enum
 Члены
 Члены
 Описание
 ForRead
 Значение: 0. Доступ к объекту только на чтение.
 ForWrite
 Значение: 1. Доступ к объекту на изменение.
 ForNotify
 Значение: 2. Доступ к объекту для уведомления.
 Описание
 Этот перечислимый тип предоставляет режимы доступа к открываемым резидентным объектам базы данных.
 Ваши комментарии по поводу этого топика: Послать отзыв!