Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.GraphicsInterface.Drawable
 Послать отзыв
 Класс представляет графические объекты, как временные, так и постоянные, которые реализуют интерфейс графического отображения.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::GraphicsInterface::Drawable
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("AcGiDrawable")] public class Drawable : RXObject;
Копировать Код
<Wrapper("AcGiDrawable")> Public Class Drawable Inherits RXObject
 Описание
 Все графические объекты, как временные, так и постоянные, реализуют интерфейс графического отображения. Благодаря этому интерфейсу объекты способны отрисовать себя, используя Draw API.
 Все отображаемые объекты являются производными от класса Drawable. Этот класс реализует протокол, с помощью которого графическая система (GS) может запрашивать объекты об их геометрии, атрибутах, указателях кэша и идентификаторах в базе данных.
 Объекты класса Drawable не обязаны непременно иметь графическое представление. Некоторые объекты Drawable влияют только на атрибуты, геометрические преобразования или области обрезки; другие служат контейнерами для других объектов Drawable, не имея собственной геометрии или атрибутов. Подобными примерами являются классы LayerTableRecord и BlockTableRecord.
 Объект класса Drawable не обязан быть объектом базы данных. Двумя примерами непостоянных объектов Drawable являются значок ПСК и сетка (Grid). Это визуальные элементы редактора nanoCAD, не принадлежащие базе данных.
 Методы
 Конструкторы
 Teigha.GraphicsInterface.Drawable
 Имя
 Описание
 Drawable
 Конструктор класса Teigha.GraphicsInterface.Drawable.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.GraphicsInterface.Drawable
 Имя
 Описание
 Drawable Методы
 Ниже перечислены методы класса Drawable.
 Drawable Свойства
 Ниже перечислены свойства класса Drawable.
 Ссылки
 Drawable Методы, Drawable Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!