Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.AugmentedPolylineCurve3d.D2Vectors
 Послать отзыв
 Свойство D2Vectors предоставляет доступ к коллекции векторов второй производной в вершинах полилинии.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3dCollection D2Vectors;
Копировать Код
Public ReadOnly Property D2Vectors As Vector3dCollection
 Возвращает
 Возвращает коллекцию векторов второй производной в вершинах полилинии. Тип Vector3dCollection.
 Описание
 Свойство D2Vectors предоставляет доступ к коллекции векторов второй производной в вершинах полилинии.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.AugmentedPolylineCurve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!