Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.RadialDimension.RadialDimension
 Послать отзыв
 Конструктор по умолчанию класса RadialDimension.
 Синтаксис
C#
Visual Basic
Копировать Код
public RadialDimension();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса RadialDimension. Создает объект радиального размера с координатами центра и концов хорды (0, 0, 0) и нулевой длиной выноски.
 Ссылки
 Teigha.DatabaseServices.RadialDimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!