Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство RasterImageDef.IsEmbedded
 Послать отзыв
 Синтаксис
C#
Visual Basic
public bool IsEmbedded;
Public Property IsEmbedded() As bool
 Описание
 Возвращает true, если изображение встроено в файл чертежа.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.RasterImageDef, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!