Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotSettings.PlotWindowArea
 Послать отзыв
 Свойство PlotWindowArea представляет углы прямоугольной рамки окна печати для этого объекта PlotSettings.
 Синтаксис
C#
Visual Basic
Копировать Код
public Extents2d PlotWindowArea;
Копировать Код
Public ReadOnly Property PlotWindowArea As Extents2d
 Возвращает
 Возвращает углы прямоугольной рамки окна печати. Тип Extents2d.
 Описание
 Свойство PlotWindowArea представляет углы прямоугольной рамки окна печати для этого объекта PlotSettings. Границы рамки учитываются только при условии, что тип печати принимает значение PlotType.Window.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.PlotSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!