Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Filters.Index.RebuildFull
 Послать отзыв
 Метод позволяет полностью перестроить данный объект Index с использованием объектов чертежа из записи таблицы блоков.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void RebuildFull( ref IndexUpdateData indexData );
Копировать Код
Public Overridable Sub RebuildFull( ByRef indexData As IndexUpdateData )
 Параметры
 Параметры
 Описание
 indexData
 Входной объект IndexUpdateData, который будет использоваться при перестроении индекса.
 Описание
 Метод позволяет полностью перестроить данный объект Index с использованием объектов чертежа из записи таблицы блоков.
 Ссылки
 Teigha.DatabaseServices.Filters.Index, Teigha.DatabaseServices.Filters
 Ваши комментарии по поводу этого топика: Послать отзыв!