Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство TableRegion.LastColumn
 Послать отзыв
 This is LastColumn, a member of class TableRegion.
 Синтаксис
C#
Visual Basic
public int LastColumn;
Public Property LastColumn() As Integer
 Ссылки
 TableRegion Класс, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!