Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CircularArc3d.ClosestPointToPlane
 Послать отзыв
 Метод позволяет найти на данной дуге точку, ближайшую к указанной плоскости.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d[] ClosestPointToPlane( ref PlanarEntity plane );
Копировать Код
Public Function ClosestPointToPlane( ByRef plane As PlanarEntity ) As Point3d()
 Параметры
 Параметры
 Описание
 plane
 Входная плоскость, для которой требуется найти ближайшую точку на дуге. Тип PlanarEntity.
 Возвращает
 Возвращает массив из двух ближайших точек, соответственно, на дуге и на плоскости. Тип Point3d[].
 Описание
 Метод позволяет найти точку на данной дуге, которая находится ближе всего к заданной плоскости plane. Используется вызов метода CircularArc3d.ClosestPointToPlane(PlanarEntity plane, Tolerance tolerance) со значением точности, равным Tolerance.Global. Результатом является массив из двух точек, в котором нулевой элемент соответствует ближайшей точке на дуге, а первый элемент - ближайшей точке на плоскости plane.
 Ссылки
 Teigha.Geometry.CircularArc3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!