Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.EllipticalCylinder.Height
 Послать отзыв
 Свойство Height представляет интервал значений высоты данного цилиндра.
 Синтаксис
C#
Visual Basic
Копировать Код
public Interval Height;
Копировать Код
Public Property Height As Interval
 Возвращает
 Возвращает интервал высоты данного цилиндра. Тип Interval.
 Описание
 Свойство Height представляет интервал значений высоты данного цилиндра.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.Geometry.EllipticalCylinder, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!