Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.PaperSpaceVportId
 Послать отзыв
 Синтаксис
C#
Visual Basic
public ObjectId PaperSpaceVportId;
Public Property PaperSpaceVportId() As ObjectId
 Описание
 Обеспечивает доступ к Id видового экрана пространства листа для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!