Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MText.SetAttachmentMovingLocation
 Послать отзыв
 Метод позволяет задать тип точки присоединения данного объекта MText.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetAttachmentMovingLocation( AttachmentPoint value );
Копировать Код
Public Sub SetAttachmentMovingLocation( value As AttachmentPoint )
 Параметры
 Параметры
 Описание
 value
 Тип точки присоединения текста. Перечисление AttachmentPoint.
 Описание
 Метод позволяет задать тип точки присоединения данного объекта MText.
 Допускаются следующие типы точек присоединения:
 Наименование
 Значение
 TopLeft
 1
 TopCenter
 2
 TopRight
 3
 MiddleLeft
 4
 MiddleCenter
 5
 MiddleRight
 6
 BottomLeft
 7
 BottomCenter
 8
 BottomRight
 9
 Ссылки
 Teigha.DatabaseServices.MText, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!