Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbSurface.UKnots
 Послать отзыв
 Свойство UKnots представляет узловой вектор в направлении U для данной поверхности.
 Синтаксис
C#
Visual Basic
Копировать Код
public KnotCollection UKnots;
Копировать Код
Public ReadOnly Property UKnots As KnotCollection
 Возвращает
 Возвращает узловой вектор в направлении U. Тип KnotCollection.
 Описание
 Свойство UKnots представляет узловой вектор в направлении U для данной поверхности.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.NurbSurface, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!