Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 DimStyleTableRecord.Dimrnd
 Послать отзыв
 Свойство отвечает за настройку округления измерений в размерах.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual double Dimrnd { get; set; }
Копировать Код
Public Overridable Property Dimrnd As Double
 Возвращает
 Возвращает тип данных double.
 Описание
 В свойстве хранится настройка измерений в размерах. Свойство принимает в качестве значения положительное число. Значение по умолчанию 0.0.
 Свойство также доступно через системную переменную DIMRND и пользовательское меню в окне изменения/создания размерного стиля:
  При изменении системной переменной DIMRND будет создан новый размерный стиль под названием <переопределение> на основе текущего с новым значением DIMRND.
 Условия
 Чтение и запись.
 Пример
 Пример изменения настройки округления измерений в размерах (значения свойства Dimrnd) в размерном стиле Standard:
C#
 Копировать Код
public partial class Commands { [Teigha.Runtime.CommandMethod("DimrndChange")] public void DimrndStandardDimStyle() { // Получение ссылки на активный документ HostMgd.ApplicationServices.Document doc = HostMgd.ApplicationServices.Application.DocumentManager.MdiActiveDocument; // Получение ссылки на редактор документа HostMgd.EditorInput.Editor ed = doc.Editor; // Получение ссылки на базу данных документа Teigha.DatabaseServices.Database db = doc.Database; // Начало транзакции с базой данных документа using (Teigha.DatabaseServices.Transaction trans = db.TransactionManager.StartTransaction()) { // Открываем таблицу размерных стилей для чтения Teigha.DatabaseServices.DimStyleTable dimStyleTable = trans.GetObject(db.DimStyleTableId, Teigha.DatabaseServices.OpenMode.ForRead) as Teigha.DatabaseServices.DimStyleTable; // Находим в таблице размерных стилей ObjectId нужного стиля по его названию Teigha.DatabaseServices.ObjectId styleId = dimStyleTable["Standard"]; // Открываем таблицу размерного стиля для изменений Teigha.DatabaseServices.DimStyleTableRecord obj = trans.GetObject(styleId, Teigha.DatabaseServices.OpenMode.ForWrite) as Teigha.DatabaseServices.DimStyleTableRecord; ed.WriteMessage($"nDimrnd before: {obj.Dimrnd}"); // Изменяем настройку округления основных размеров obj.Dimrnd = 10; ed.WriteMessage($"nDimrnd after: {obj.Dimrnd}"); trans.Commit(); } } }
 Результат работы команды DimrndChange:
 Было:
 Стало:
 Ссылки
 Teigha.DatabaseServices.DimStyleTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!