Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Hatch.HatchStyle
 Послать отзыв
 Синтаксис
C#
Visual Basic
public DatabaseServices::HatchStyle HatchStyle;
Public Property HatchStyle() As DatabaseServices.HatchStyle
 Описание
 Обеспечивает доступ к стилю заливки объекта заливки.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Hatch, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!