Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBVisualStyle.GetTraitFlag
 Послать отзыв
 Метод проверяет, установлен ли указанный флаг для указанного свойства визуального стиля.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool GetTraitFlag( VisualStyleProperty vsProp, unsigned long flagValue );
Копировать Код
Public Function GetTraitFlag( vsProp As VisualStyleProperty, flagValue As unsigned long ) As Boolean
 Параметры
 Параметры
 Описание
 vsProp
 Запрашиваемое свойство визуального стиля. Значение из перечисления VisualStyleProperty.
 flagValue
 Проверяемый флаг. Тип unsigned long.
 Возвращает
 Возвращает true, если указанный флаг в этом свойстве выставлен. В противном случае возвращает false.
 Описание
 Метод позволяет проверить, установлен ли указанный флаг для указанного свойства визуального стиля. Применяется для свойств, которые являются перечислениями битовых полей.
 Ссылки
 Teigha.DatabaseServices.DBVisualStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!