Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Point2d.*
 Послать отзыв
 Оператор умножения класса Point2d. Реализует умножение координат точки на вещественный множитель.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point2d operator * ( double value, Point2d a );
Копировать Код
Public Operator * ( value As Double, a As Point2d )
 Параметры
 Параметры
 Описание
 value
 Левый операнд. Тип double.
 a
 Правый операнд. Тип Point2d.
 Возвращает
 Возвращает точку Point2d в новых координатах.
 Описание
 Оператор умножения класса Point2d. Реализует умножение координат точки a на вещественный множитель value.
 Ссылки
 Teigha.Geometry.Point2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!