Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 DimStyleTableRecord.Dimtzin
 Послать отзыв
 Свойство предназначено для настройки подавления нулей в значениях допуска линейных размеров.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual int Dimtzin { get; set; }
Копировать Код
Public Overridable Property Dimtzin As Integer
 Возвращает
 Возвращает тип данных int.
 Описание
 В свойстве хранится настройка подавления нулей в линейных размерах. В качестве значений свойства доступны следующие целые числа:
0 – подавление ноль футов и ровно ноль дюймов, ведущие и конечные десятичные нули не подавляются (значение по умолчанию);
1 – включение ноль футов и ровно ноль дюймов, ведущие и конечные десятичные нули не подавляются;
2 – включение ноль футов и подавление ровно ноль дюймов, ведущие и конечные десятичные нули не подавляются;
3 – подавление ноль футов и включение ровно ноль дюймов, ведущие и конечные десятичные нули не подавляются;
4 – подавление ведущих десятичных нулей;
8 – подавление конечных десятичных нулей;
12 – подавление начальных и конечных десятичных нулей.
 Первые три значения свойства влияют только если в чертеже установлены измерения в дюймах, последние три – если в чертеже установлены измерения в миллиметрах.
 Примеры:
«Подавление ведущих десятичных нулей»: было без подавления 0,005 – стало ,005;
«Подавление конечных десятичных нулей»: было без подавления 0,5000 – стало 0,5;
«Подавление начальных и конечных десятичных нулей»: было без подавления 0,5000 – стало ,5.
 Свойство также доступно через системную переменную DIMTZIN и пользовательское меню в окне изменения/создания размерного стиля:
  При изменении системной переменной DIMTZIN будет создан новый размерный стиль под названием <переопределение> на основе текущего с новым значением DIMTZIN.
 Условия
 Чтение и запись.
 Пример
 В качестве примера работы со свойством Dimaltz можно рассмотреть пример, приведенный в описании свойства Dimzin, заменив в нем Dimzin на Dimtzin и добавив проверку, включено ли отображение допусков (для этого нужно проверить значение свойства Dimtol/Dimlim с изменением его на true (включить отображение), если оно равно false).
 Ссылки
 Teigha.DatabaseServices.DimStyleTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!