Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Section.CreateJog
 Послать отзыв
 Метод позволяет создать излом в указанной точке на линии сечения.
 Синтаксис
C#
Visual Basic
Копировать Код
public void CreateJog( Point3d ptOnSection );
Копировать Код
Public Sub CreateJog( ptOnSection As Point3d )
 Параметры
 Параметры
 Описание
 ptOnSection
 Координаты точки на линии сечения. Тип Point3d.
 Описание
 Метод позволяет создать излом в указанной точке на линии сечения.
 Ссылки
 Teigha.DatabaseServices.Section, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!