Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DataTable.NumColumns
 Послать отзыв
 Свойство предоставляет доступ к текущему количеству столбцов в таблице.
 Синтаксис
C#
Visual Basic
Копировать Код
public int NumColumns;
Копировать Код
Public Property NumColumns() As Integer
 Возвращает
 Возвращает текущее количество столбцов в таблице. Тип int.
 Описание
 Свойство предоставляет доступ к текущему количеству столбцов в таблице.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.DataTable, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!