Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbCurve3dFitData.GetHashCode
 Послать отзыв
 Метод предоставляет хеш-код данного объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual sealed override int GetHashCode();
Копировать Код
Public NotOverridable Overrides Function GetHashCode() As Integer
 Возвращает
 Возвращает хеш-код объекта. Тип int.
 Описание
 Метод предоставляет хеш-код данного объекта.
 Замечания
 Переопределение методов Equals и GetHashCode должно выполняться согласованно с сохранением общей логики. Если Equals возвращает true, хеш-коды сравниваемых объектов обязаны совпадать. Обратное не гарантируется - совпадение хеш-кодов не всегда означает совпадение объектов вследствие возможных коллизий. Хэш-коды должны формироваться с использованием полей, на которых основано равенство объектов.
 Иногда используется метод Equals() из объекта C++, но поскольку сравниваются указатели, вы по-прежнему можете использовать NurbCurve3dFitData.GetHashCode(), в то время как метод Equals() может быть переопределен в производном классе.
 Ссылки
 Teigha.Geometry.NurbCurve3dFitData, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!