Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObject.DwgIn(DwgFiler)
 Послать отзыв
 Метод считывает данные этого объекта из файла формата dwg.
 Синтаксис
C#
Visual Basic
Копировать Код
public void DwgIn(DwgFiler filer);
Копировать Код
Public Sub DwgIn(filer As DwgFiler)
 Параметры
 Параметры
 Описание
 filer
 Набор данных, которые необходимо считать из dwg-файла. Тип DwgFiler
 Описание
 Этот метод выполняет несколько внутренних учетных действий, и затем читает любые xdata, присоединенные к объекту.
 Ссылки
 Teigha.DatabaseServices.DBObject, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!