Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.UnderlayDefinition.Unload
 Послать отзыв
 Метод позволяет выгрузить файл подложки.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Unload();
Копировать Код
Public Sub Unload()
 Описание
 Метод позволяет выгрузить файл подложки.
 Ссылки
 Teigha.DatabaseServices.UnderlayDefinition, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!