Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.RenderSettings.DiagnosticBackgroundEnabled
 Послать отзыв
 Свойство DiagnosticBackgroundEnabled позволяет определить, используется ли для рендеринга диагностический (проверочный) фон.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool DiagnosticBackgroundEnabled;
Копировать Код
Public Property DiagnosticBackgroundEnabled As Boolean
 Возвращает
 Возвращает true, если диагностический фон используется. В противном случае возвращает false.
 Описание
 Свойство DiagnosticBackgroundEnabled позволяет определить, используется ли для рендеринга диагностический (проверочный) фон.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.RenderSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!