Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AbstractViewTableRecord.BackClipDistance
 Послать отзыв
 Свойство BackClipDistance предоставляет доступ к положению задней плоскости отсечения для TableRecord.
 Синтаксис
C#
Visual Basic
Копировать Код
public double BackClipDistance;
Копировать Код
Public Property BackClipDistance As Double
 Возвращает
 Возвращает расстояние от точки цели до задней плоскости отсечения. Тип double.
 Описание
 Свойство BackClipDistance предоставляет доступ к расстоянию от точки цели до задней плоскости отсечения для TableRecord.
 Замечания
 Положительные значения указывают, что плоскость отсечения находится перед точкой цели (то есть между целью и камерой). Отрицательные значения указывают, что плоскость отсечения находится позади точки цели.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.AbstractViewTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!