Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SubentityId.SubentityId
 Послать отзыв
 Конструктор структуры SubentityId. Создает экземпляр структуры для указанного класса подобъекта и указателя в качестве индекса.
 Синтаксис
C#
Visual Basic
Копировать Код
public SubentityId( ref RXClass classType, IntPtr i );
Копировать Код
Public Sub New( ByRef classType As RXClass, i As IntPtr )
 Параметры
 Параметры
 Описание
 classType
 Класс подобъекта. Тип RXClass.
 i
 Индекс подобъекта. Тип IntPtr.
 Описание
 Конструктор структуры SubentityId. Создает экземпляр структуры для указанного класса подобъекта и указателя в качестве индекса.
 Ссылки
 Teigha.DatabaseServices.SubentityId, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!