Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.UnderlayReference.FadeLowerLimit
 Послать отзыв
 Свойство FadeLowerLimit представляет нижнюю границу возможных значений затухания.
 Синтаксис
C#
Visual Basic
Копировать Код
public static int FadeLowerLimit;
Копировать Код
Public Shared ReadOnly Property FadeLowerLimit As Integer
 Возвращает
 Возвращает нижнюю границу возможных значений затухания. Тип int.
 Описание
 Свойство FadeLowerLimit представляет нижнюю границу возможных значений затухания.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.UnderlayReference, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!