Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.RowsCollection.GetEnumerator
 Послать отзыв
 Метод предоставляет перечислитель для данной коллекции.
 Синтаксис
C#
Visual Basic
Копировать Код
public System.Collections.Generic.IEnumerator<Row> GetEnumerator();
Копировать Код
Public Function GetEnumerator() As System.Collections.Generic.IEnumerator<Row>
 Возвращает
 Возвращает перечислитель для коллекции строк таблицы. Тип System.Collections.Generic.IEnumerator.
 Описание
 Метод предоставляет перечислитель для коллекции строк таблицы.
 Ссылки
 Teigha.DatabaseServices.RowsCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!