Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Point3d.*
 Послать отзыв
 Оператор умножения класса Point3d. Реализует умножение координат точки на вещественный множитель.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d operator * ( double value, Point3d a );
Копировать Код
Public Operator * ( value As Double, a As Point3d )
 Параметры
 Параметры
 Описание
 value
 Левый операнд. Тип double.
 a
 Правый операнд. Тип Point3d.
 Возвращает
 Возвращает точку Point3d в новых координатах.
 Описание
 Оператор умножения класса Point3d. Реализует умножение координат точки a на вещественный множитель value.
 Ссылки
 Teigha.Geometry.Point3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!