Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.CanInsertColumn
 Послать отзыв
 Данный метод проверяет, возможно ли вставить новый столбец по указанному индексу.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual bool CanInsertColumn( int index );
Копировать Код
Public virtual Function CanInsertColumn( index As Integer ) As Boolean
 Параметры
 Параметры
 Описание
 index
 Значение индекса, для которого проверяется возможность вставки нового столбца. Тип int.
 Возвращает
 Возвращает true, если вставка возможна, и false в противном случае.
 Описание
 Данный метод проверяет, возможно ли вставить новый столбец по указанному индексу.
 Замечания
 Для получения того же результата предпочтительнее использовать Table.Columns[column].CanInsertColumn.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!