Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Torus.MinorRadius
 Послать отзыв
 Свойство MinorRadius возвращает значение малого радиуса данного тора.
 Синтаксис
C#
Visual Basic
Копировать Код
public double MinorRadius;
Копировать Код
Public Property MinorRadius As Double
 Возвращает
 Возвращает малый радиус данного тора. Тип double.
 Описание
 Свойство MinorRadius возвращает значение малого радиуса данного тора.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.Geometry.Torus, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!