Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.OsnapPointRef.XrefIntHandles
 Послать отзыв
 Свойство XrefIntHandles представляет массив дескрипторов для вторичного геометрического объекта внешней ссылки.
 Синтаксис
C#
Visual Basic
Копировать Код
public Handle[] XrefIntHandles;
Копировать Код
Public Property XrefIntHandles As Handle()
 Возвращает
 Возвращает массив дескрипторов для вторичного геометрического объекта внешней ссылки. Тип Handle[].
 Описание
 Свойство XrefIntHandles представляет массив дескрипторов для вторичного геометрического объекта внешней ссылки.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.OsnapPointRef, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!