Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve2d.EndPoint
 Послать отзыв
 Свойство EndPoint представляет конечную точку данной кривой.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point2d EndPoint;
Копировать Код
Public ReadOnly Property EndPoint As Point2d
 Возвращает
 Возвращает конечную точку данной кривой. Тип Point2d.
 Описание
 Свойство EndPoint представляет конечную точку данной кривой.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.Curve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!