Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AbstractViewPE.SetView
 Послать отзыв
 Метод переопределяет параметры связанного видового экрана согласно переданным аргументам.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetView( Point3d target, Vector3d direction, Vector3d upVector, double fieldWidth, double fieldHeight, bool isPerspective, Vector2d viewOffset );
Копировать Код
Public Sub SetView( target As Point3d, direction As Vector3d, upVector As Vector3d, fieldWidth As Double, fieldHeight As Double, isPerspective As Boolean, viewOffset As Vector2d )
 Параметры
 Параметры
 Описание
 target
 Точка цели камеры вида в мировой системе координат (WCS). Тип Point3d.
 direction
 Направление взгляда в мировой системе координат (WCS). Тип Vector3d.
 upVector
 Направление вверх камеры вида в мировой системе координат (WCS). Тип Vector3d.
 fieldWidth
 Ширина поля камеры вида в системе координат дисплея (DCS). Тип double.
 fieldHeight
 Высота поля камеры вида в системе координат дисплея (DCS). Тип double.
 isPerspective
 Флаг, указывающий, используется ли режим перспективного проецирования. Тип bool. Если false, то используется параллельное проецирование.
 viewOffset
 Вектор смещения вида. Тип Vector2d.
 Описание
 Метод переопределяет параметры связанного видового экрана согласно переданным аргументам.
 Ссылки
 Teigha.DatabaseServices.AbstractViewPE, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!