Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeaderStyle.DrawMLeaderOrderType
 Послать отзыв
 Свойство представляет порядок отрисовки содержимого объектов MLeader, предумотренный данным стилем.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.DrawMLeaderOrderType DrawMLeaderOrderType;
Копировать Код
Public Property DrawMLeaderOrderType As DatabaseServices.DrawMLeaderOrderType
 Возвращает
 Возвращает порядок отрисовки содержимого мультивыноски. Перечисление DatabaseServices.DrawMLeaderOrderType.
 Описание
 Свойство представляет порядок отрисовки содержимого объектов MLeader, предумотренный данным стилем.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MLeaderStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!