Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Database
 Послать отзыв
 Класс Database представляет файл чертежа nanoCAD.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::DatabaseServices::Database
 Синтаксис
C#
Visual Basic
[Wrapper("OdDbDatabase")] public class Database : RXObject;
<Wrapper("OdDbDatabase")> Public Class Database Inherits RXObject
 Описание
 Каждый объект типа Database содержит различные переменные заголовка, таблицы символов, записи таблицы, геометрические объекты и объекты, которые составляют чертеж.
 Класс Database содержит функции, позволяющие получить доступ к таблице символов, осуществлять чтение и запись файлов формата .dwg, задавать и получать значения по умолчанию, выполнять различные операции уровня базы данных, такие как Wblock и DeepCloneObjects, получать или устанавливать переменные заголовка.
 Методы
 Конструкторы
 Teigha.DatabaseServices.Database
 Имя
 Описание
 Database
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.DatabaseServices.Database
 Имя
 Описание
 Database Методы
 Ниже перечислены методы класса Database.
 Database Свойства
 Ниже перечислены свойства класса Database.
 Database События
 Ниже перечислены события класса Database.
 Ссылки
 Database Методы, Database Свойства, Database События, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства, Database События
 Ваши комментарии по поводу этого топика: Послать отзыв!