Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Field.EvaluationOption
 Послать отзыв
 Свойство EvaluationOption представляет доступ к опциям вычисления данного поля.
 Синтаксис
C#
Visual Basic
Копировать Код
public FieldEvaluationOptions EvaluationOption;
Копировать Код
Public Property EvaluationOption As FieldEvaluationOptions
 Возвращает
 Возвращает опции вычисления данного поля как значение из перечисления FieldEvaluationOptions.
 Описание
 Свойство EvaluationOption представляет доступ к опциям вычисления данного поля.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Field, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!