Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MeasurementValue
 Послать отзыв
 Перечисление MeasurementValue определяет используемую систему единиц измерения.
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdDb.MeasurementValue")] public enum MeasurementValue { English = 0, Metric = 1 }
Копировать Код
<Wrapper("OdDb.MeasurementValue")> Public Enum MeasurementValue English = 0 Metric = 1 End Enum
 Члены
 Члены
 Описание
 English
 Значение: 0. Английская система единиц измерения.
 Metric
 Значение: 1. Метрическая система единиц измерения.
 Описание
 Перечисление MeasurementValue определяет используемую систему единиц измерения.
 Ваши комментарии по поводу этого топика: Послать отзыв!