Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ObjectContextCollection.AddContext
 Послать отзыв
 Метод добавляет в коллекцию копию указанного контекста. Добавленный контекст получает новый уникальный идентификатор.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void AddContext( ref ObjectContext ctx );
Копировать Код
Public Overridable Sub AddContext( ByRef ctx As ObjectContext )
 Параметры
 Параметры
 Описание
 ctx
 Контекст, копия которого добавляется в коллекцию, получив новый уникальный идентификатор. Тип ObjectContext.
 Описание
 Метод добавляет в коллекцию копию указанного контекста. Добавленный контекст получает новый уникальный идентификатор. В общем случае этот идентификатор отличается от идентификатора исходного контекста.
 Ссылки
 Teigha.DatabaseServices.ObjectContextCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!