Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SubDMesh.EdgeArray
 Послать отзыв
 Свойство предоставляет доступ к массиву индексов ребер базового уровня сети.
 Синтаксис
C#
Visual Basic
Копировать Код
public Int32Collection EdgeArray;
Копировать Код
Public Property EdgeArray() As Int32Collection
 Возвращает
 Возвращает массив индексов ребер, тип Int32Collection.
 Описание
 Свойство предоставляет доступ к массиву индексов ребер базового уровня сети.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.SubDMesh, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!