Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Solid.GetPointAt
 Послать отзыв
 Метод предоставляет точку данного тела с указанным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d GetPointAt( short index );
Копировать Код
Public Function GetPointAt( index As Short ) As Point3d
 Параметры
 Параметры
 Описание
 index
 Индекс точки данного объекта. Тип short. Может принимать значения 0, 1, 2 или 3.
 Возвращает
 Возвращает координаты точки с индексом index (в мировой системе координат, WCS). Тип Point3d.
 Описание
 Метод предоставляет точку данного тела с указанным индексом.
 Индексация углов тела начинается с нуля. Индекс может принимать значения 0, 1, 2 или 3. В случае треугольного тела точки с индексами 2 и 3 будут совпадать. Координаты точки возвращаются в мировой системе координат (WCS).
 Ссылки
 Teigha.DatabaseServices.Solid, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!