Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Point2d.Mirror
 Послать отзыв
 Метод создает новую 2D-точку как зеркальное отражение данной точки относительно указанной оси, располагающейся в той же плоскости.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point2d Mirror( ref Line2d line );
Копировать Код
Public Function Mirror( ByRef line As Line2d ) As Point2d
 Параметры
 Параметры
 Описание
 line
 Входная ось симметрии. Тип Line2d.
 Возвращает
 Возвращает 2D-точку, которая является результатом зеркального отражения этой точки относительно линии line. Тип Point2d.
 Описание
 Метод возвращает 2D-точку, которая является результатом зеркального отражения данной точки относительно линии line, располагающейся в той же плоскости.
 Ссылки
 Teigha.Geometry.Point2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!