Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SecurityParameters.KeyLength
 Послать отзыв
 Свойство KeyLength представляет длину ключа шифра.
 Синтаксис
C#
Visual Basic
Копировать Код
public int KeyLength;
Копировать Код
Public Property KeyLength As Integer
 Возвращает
 Возвращает длину ключа шифра. Тип int.
 Описание
 Свойство KeyLength представляет длину ключа шифра.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.SecurityParameters, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!