Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector3d.Vector3d
 Послать отзыв
 Этот конструктор создает трехмерный вектор, определяемый заданным двумерным вектором в системе координат заданного плоского объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d( ref PlanarEntity plane, Vector2d vector2d );
Копировать Код
Public Sub New( ByRef plane As PlanarEntity, vector2d As Vector2d )
 Параметры
 Параметры
 Описание
 plane
 Входной плоский объект. Тип PlanarEntity.
 vector2d
 Входной двумерный вектор. Тип Vector2d.
 Описание
 Этот конструктор создает трехмерный вектор, определяемый двумерным вектором vector2d в системе координат плоского объекта plane.
 Ссылки
 Teigha.Geometry.Vector3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!