Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ResultBuffer.ToString
 Послать отзыв
 Метод предназначен для получения эквивалентного строкового представления этого объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public String ToString();
Копировать Код
Public Function ToString() As String
 Возвращает
 Возвращает эквивалентное строковое представление этого объекта, тип String.
 Описание
 Метод предназначен для получения эквивалентного строкового представления этого объекта.
 Подробнее см. в документации Microsoft .NET API.
 Ссылки
 Teigha.DatabaseServices.ResultBuffer, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!