Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.BulgeVertexCollection
 Послать отзыв
 Класс представляет коллекцию объектов BulgeVertex.
 Иерархия классов
Teigha::DatabaseServices::BulgeVertexCollection
 Синтаксис
C#
Visual Basic
Копировать Код
[DefaultMember("Item")] public class BulgeVertexCollection : System.Collections.CollectionBase;
Копировать Код
<DefaultMember("Item")> Public Class BulgeVertexCollection Inherits System.Collections.CollectionBase
 Описание
 Класс представляет коллекцию объектов BulgeVertex.
 Методы
 Конструкторы
 Имя
 Описание
 BulgeVertexCollection
 Констрктор по умолчанию класса BulgeVertexCollection.
 Топики
 Имя
 Описание
 BulgeVertexCollection Методы
 Ниже перечислены методы класса BulgeVertexCollection.
 BulgeVertexCollection Свойства
 Ниже перечислены свойства класса BulgeVertexCollection.
 Ссылки
 BulgeVertexCollection Методы, BulgeVertexCollection Свойства, Методы, Топики, BulgeVertexCollection Методы, BulgeVertexCollection Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!