Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Database.LoadLineTypeFile
 Послать отзыв
 Синтаксис
C#
Visual Basic
public void LoadLineTypeFile(ref String lineTypeName, ref String filename);
Public Sub LoadLineTypeFile(ByRef lineTypeName As String, ByRef filename As String)
 Параметры
 Параметры
 Описание
 lineTypeName
 Строка имени типа линии (может содержать маску на символы имени)
 filename
 Путь/имя файла или URL, откуда должен быть загружен файл (путь не является обязательным)
 Описание
 Эта функция загружает тип линии, определенный lineTypeName из файла, определенного параметром filename и сохраняет его в базе данных, из которой данный метод был вызван.
 Параметр lineTypeName может содержать маску на символы имени (например, символ *). В этом случае будут загружены все типы линий, удовлетворяющих заданному имени.
 Если параметр filename не является URL и не содержит полный путь, то путь к файлу ищется в путях поиска nanoCAD.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!