Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор RasterImage.RasterImage ()
 Послать отзыв
 Синтаксис
C#
Visual Basic
public RasterImage(IntPtr unmanagedObjPtr, bool autoDelete); public RasterImage();
Public Sub New(unmanagedObjPtr As IntPtr, autoDelete As bool) Public Sub New()
 Описание
 Конструктор данного класса объявлен как protected, поэтому он не может быть непосредственно вызван из других приложений.
 Ссылки
 Teigha.DatabaseServices.RasterImage, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!