Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Tolerance.EqualPoint
 Послать отзыв
 Свойство EqualPoint представляет точность (допуск) для оценки равенства двух точек.
 Синтаксис
C#
Visual Basic
Копировать Код
public double EqualPoint;
Копировать Код
Public ReadOnly Property EqualPoint As Double
 Возвращает
 Возвращает точность (допуск) для оценки равенства двух точек. Тип double.
 Описание
 Свойство EqualPoint представляет точность (допуск) для оценки равенства двух точек.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.Tolerance, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!