Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GripData.ChangeGripStatus
 Послать отзыв
 Метод предназначен для изменения статуса этой ручки.
 Синтаксис
C#
Visual Basic
Копировать Код
public void ChangeGripStatus( ObjectId entityId, Status newStatus );
Копировать Код
Public Sub ChangeGripStatus( entityId As ObjectId, newStatus As Status )
 Параметры
 Параметры
 Описание
 entityId
 Идентификатор объекта чертежа. Тип ObjectId.
 newStatus
 Новый статус ручки. Перечисление GripData.Status.
 Описание
 Метод предназначен для изменения статуса этой ручки.
 Ссылки
 Teigha.DatabaseServices.GripData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!