Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Transaction.Commit
 Послать отзыв
 Этот метод фиксирует изменения, внесенные во все открытые во время транзакции объекты DBObjects, а затем закрывает эти объекты.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void Commit();
Копировать Код
Public virtual Sub Commit()
 Описание
 Этот метод фиксирует изменения, внесенные во все открытые во время транзакции объекты DBObjects, а затем закрывает эти объекты.
 Ссылки
 Teigha.DatabaseServices.Transaction, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!