Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MentalRayRenderSettings.FGSampleRadius
 Послать отзыв
 Свойство FGSampleRadius представляет минимальный и максимальный радиусы выборки финальной сборки.
 Синтаксис
C#
Visual Basic
Копировать Код
public MentalRayRenderSettingsTraitsDoubleRangeParameter FGSampleRadius;
Копировать Код
Public Property FGSampleRadius As MentalRayRenderSettingsTraitsDoubleRangeParameter
 Возвращает
 Возвращает минимальный и максимальный радиусы выборки финальной сборки. Тип MentalRayRenderSettingsTraitsDoubleRangeParameter.
 Описание
 Свойство FGSampleRadius представляет минимальный и максимальный радиусы выборки финальной сборки.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MentalRayRenderSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!