Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbSurface.Set
 Послать отзыв
 Метод позволяет переопределить указанные параметры данной NURBS поверхности, используя геометрическую точность по умолчанию.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Set( int degreeU, int degreeV, int propsInU, int propsInV, int numControlPointsInU, int numControlPointsInV, ref Point3dCollection controlPoints, ref DoubleCollection weights, ref KnotCollection knotsInU, ref KnotCollection knotsInV );
Копировать Код
Public Sub [Set]( degreeU As Integer, degreeV As Integer, propsInU As Integer, propsInV As Integer, numControlPointsInU As Integer, numControlPointsInV As Integer, ByRef controlPoints As Point3dCollection, ByRef weights As DoubleCollection, ByRef knotsInU As KnotCollection, ByRef knotsInV As KnotCollection )
 Параметры
 Параметры
 Описание
 degreeU
 Степень сплайна в направлении U. Тип int.
 degreeV
 Степень сплайна в направлении V. Тип int.
 propsInU
 Свойства поверхности в направлении U (используются значения NurbSurfaceProperties). Тип int.
 propsInV
 Свойства поверхности в направлении V (используются значения NurbSurfaceProperties). Тип int.
 numControlPointsInU
 Количество управляющих вершин в направлении U. Тип int.
 numControlPointsInV
 Количество управляющих вершин в направлении V. Тип int.
 controlPoints
 Массив управляющих вершин. Тип Point3dCollection.
 weights
 Массив весов. Тип DoubleCollection.
 knotsInU
 Узловой вектор в направлении U. Тип KnotCollection.
 knotsInV
 Узловой вектор в направлении V. Тип KnotCollection.
 Описание
 Метод позволяет переопределить указанные параметры данной NURBS поверхности. Используется вызов метода Set(int degreeU, int degreeV, int propsInU, int propsInV, int numControlPointsInU, int numControlPointsInV, ref Point3dCollection controlPoints, ref DoubleCollection weights, ref KnotCollection knotsInU, ref KnotCollection knotsInV, Tolerance tolerance) с точностью по умолчанию, равной Tolerance.Global.
 Ссылки
 Teigha.Geometry.NurbSurface, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!