Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Viewport.GetUcs
 Послать отзыв
 Метод позволяет получить начало, ось X и ось Y пользовательской системы координат (UCS) данного видового экрана.
 Синтаксис
C#
Visual Basic
Копировать Код
public void GetUcs( ref Point3d origin, ref Vector3d x, ref Vector3d y );
Копировать Код
Public Sub GetUcs( ByRef origin As Point3d, ByRef x As Vector3d, ByRef y As Vector3d )
 Параметры
 Параметры
 Описание
 origin
 Принимает точку начала ПСК (UCS). Тип Point3d.
 x
 Принимает направление оси X ПСК (UCS). Тип Vector3d.
 y
 Принимает направление оси Y ПСК (UCS). Тип Vector3d.
 Описание
 Метод позволяет получить начало, ось X и ось Y пользовательской системы координат (UCS) данного видового экрана.
 Ссылки
 Teigha.DatabaseServices.Viewport, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!