Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeader.TextAttachmentDirection
 Послать отзыв
 Свойство представляет направление полки линий выноски данного объекта MLeader.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.TextAttachmentDirection TextAttachmentDirection;
Копировать Код
Public Property TextAttachmentDirection As DatabaseServices.TextAttachmentDirection
 Возвращает
 Возвращает ориентацию полки выносной линии. Значение из перечисления DatabaseServices.TextAttachmentDirection.
 Описание
 Свойство представляет направление полки линий выноски данного объекта MLeader.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MLeader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!