Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 DimStyleTableRecord.Dimtdec
 Послать отзыв
 Свойство предназначено для настройки количества десятичных знаков в значениях допуска основных единиц измерения.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual int Dimtdec { get; set; }
Копировать Код
Public Overridable Property Dimtdec As Integer
 Возвращает
 Возвращает тип данных int.
 Описание
 В свойстве хранится настройка количества десятичных знаков в значениях допуска основных единиц измерения в виде целого числа. Возможны значения в диапазоне от 0 до 8.
 Свойство также доступно через системную переменную DIMTDEC и пользовательское меню в окне изменения/создания размерного стиля:
  При изменении системной переменной DIMTDEC будет создан новый размерный стиль под названием <переопределение> на основе текущего с новым значением DIMTDEC.
 Условия
 Чтение и запись.
 Пример
 В качестве примера работы со свойством Dimtdec можно рассмотреть пример, приведенный в описании свойства Dimdec. В примере нужно заменить Dimdec на Dimtdec и убедиться, что включено отображение допусков в размерах, добавив проверку значения свойства Dimtol(отображение симметричных допусков) или Dimlim (отображение максимального и мнимального допуска) с изменением его на true, если оно равно false.
 Ссылки
 Teigha.DatabaseServices.DimStyleTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!