Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.TextAttachmentDirection
 Послать отзыв
 Данное перечисление определяет варианты ориентации полки выносной линии.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum TextAttachmentDirection { AttachmentHorizontal = 0, AttachmentVertical = 1 }
Копировать Код
Public Enum TextAttachmentDirection AttachmentHorizontal = 0 AttachmentVertical = 1 End Enum
 Члены
 Члены
 Описание
 AttachmentHorizontal
 Значение: 0. Горизонтальное прикрепление.
 AttachmentVertical
 Значение: 1. Вертикальное прикрепление.
 Описание
 Данное перечисление определяет варианты ориентации полки выносной линии.
 Ваши комментарии по поводу этого топика: Послать отзыв!