Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Group.Group
 Послать отзыв
 Конструктор класса Group. Создает экземпляр класса с указанным именем группы и предписанным режимом выделения (групповое / индивидуальное).
 Синтаксис
C#
Visual Basic
Копировать Код
public Group( ref String description, bool selectable );
Копировать Код
Public Sub New( ByRef description As String, selectable As Boolean )
 Параметры
 Параметры
 Описание
 description
 Описание группы. Тип String. Описание не должно быть пустым.
 selectable
 Флаг, определяющий характер выделения группы. Тип bool. Если флаг принимает значение true, то при выборе любого объекта в группе выделяются все объекты этой группы. В противном случае объекты-члены группы в процессе выделения рассматриваются индивидуально.
 Описание
 Конструктор класса Group. Создает экземпляр класса с указанным именем группы и предписанным режимом выделения (групповое / индивидуальное).
 Ссылки
 Teigha.DatabaseServices.Group, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!