Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Material.IlluminationModel
 Послать отзыв
 Свойство представляет модель освещения, которая используется для этого материала в расширенном процессе рендеринга.
 Синтаксис
C#
Visual Basic
Копировать Код
public GraphicsInterface.IlluminationModel IlluminationModel;
Копировать Код
Public Property IlluminationModel As GraphicsInterface.IlluminationModel
 Возвращает
 Возвращает модель освещения материала. Перечисление GraphicsInterface.IlluminationModel.
 Описание
 Свойство представляет модель освещения, которая используется для этого материала в расширенном процессе рендеринга.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Material, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!