Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DimAssoc
 Послать отзыв
 Класс DimAssoc используется для создания ассоциативных размеров, которые обеспечивают ассоциативную связь объекта размера с соответствующей геометрией чертежа.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::GraphicsInterface::Drawable Teigha::DatabaseServices::DBObject Teigha::DatabaseServices::DimAssoc
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("AcDbDimAssoc")] public sealed class DimAssoc : DBObject
Копировать Код
<Wrapper("AcDbDimAssoc")> Public NotInheritable Class DimAssoc Inherits DBObject
 Описание
 Класс DimAssoc используется для создания ассоциативных размеров, которые обеспечивают ассоциативную связь объекта размера с соответствующей геометрией чертежа.
 Методы
 Конструкторы
 Teigha.GraphicsInterface.Drawable
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 Drawable
 Конструктор класса Teigha.GraphicsInterface.Drawable. (Унаследован от Drawable)
 Teigha.DatabaseServices.DBObject
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 DBObject
 Конструктор. (Унаследован от DBObject)
 Teigha.DatabaseServices.DimAssoc
 Имя
 Описание
 DimAssoc
 Это обзор перегрузок DimAssoc.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.GraphicsInterface.Drawable
 Имя
 Описание
 Drawable Методы
 Ниже перечислены методы класса Drawable.
 Drawable Свойства
 Ниже перечислены свойства класса Drawable.
 Teigha.DatabaseServices.DBObject
 Имя
 Описание
 DBObject Методы
 Ниже перечислены методы класса DBObject.
 DBObject Свойства
 Ниже перечислены свойства класса DBObject.
 DBObject События
 Ниже перечислены события класса DBObject.
 Teigha.DatabaseServices.DimAssoc
 Имя
 Описание
 DimAssoc Методы
 Ниже перечислены методы класса DimAssoc.
 DimAssoc Свойства
 Ниже перечислены свойства класса DimAssoc.
 Ссылки
 DimAssoc Конструктор, DimAssoc Методы, DimAssoc Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства, DBObject События
 Ваши комментарии по поводу этого топика: Послать отзыв!