Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbCurve3d.NurbCurve3d
 Послать отзыв
 Конструктор по умолчанию класса NurbCurve3d. Создаваемые им объекты не содержат никаких данных.
 Синтаксис
C#
Visual Basic
Копировать Код
public NurbCurve3d();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса NurbCurve3d. Создаваемые им объекты не содержат никаких данных.
 Ссылки
 Teigha.Geometry.NurbCurve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!