Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SectionSettings.FaceTransparency
 Послать отзыв
 Метод предоставляет значение прозрачности граней геометрии указанного типа.
 Синтаксис
C#
Visual Basic
Копировать Код
public int FaceTransparency( SectionType nSecType, SectionGeometry nGeometry );
Копировать Код
Public Function FaceTransparency( nSecType As SectionType, nGeometry As SectionGeometry ) As Integer
 Параметры
 Параметры
 Описание
 nSecType
 Тип сечения. Перечисление SectionType.
 nGeometry
 Типы элементов геометрии сечения. Перечисление SectionGeometry.
 Возвращает
 Возвращает прозрачность граней геометрии указанного типа. Тип int.
 Описание
 Метод предоставляет значение прозрачности граней геометрии указанного типа.
 Ссылки
 Teigha.DatabaseServices.SectionSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!