Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Matrix3d.Rotation
 Послать отзыв
 Возвращает матрицу поворота на заданный угол вокруг заданной оси.
 Синтаксис
C#
Visual Basic
Копировать Код
public Matrix3d Rotation( double angle, Vector3d axis, Point3d center );
Копировать Код
Public Function Rotation( angle As Double, axis As Vector3d, center As Point3d ) As Matrix3d
 Параметры
 Параметры
 Описание
 angle
 Угол поворота (рад). Тип double.
 axis
 Ось вращения. Тип Vector3d.
 center
 Центр вращения. Тип Point3d.
 Возвращает
 Возвращает матрицу Matrix3d, которая обеспечивает заданное вращение.
 Описание
 Возвращает матрицу поворота на угол angle вокруг оси axis, заданной вектором и проходящей через указанную точку center. Направление вращения определяется правилом правой руки.
 Ссылки
 Teigha.Geometry.Matrix3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!