Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PolyFaceMeshVertex.PolyFaceMeshVertex
 Послать отзыв
 Конструктор по умолчанию класса PolyFaceMeshVertex.
 Синтаксис
C#
Visual Basic
Копировать Код
public PolyFaceMeshVertex();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса PolyFaceMeshVertex.
 Ссылки
 Teigha.DatabaseServices.PolyFaceMeshVertex, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!