Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve3d.GetClosestPointTo
 Послать отзыв
 Метод находит точку на данной кривой, ближайшую к указанной точке в пределах указанного допуска.
 Синтаксис
C#
Visual Basic
Копировать Код
public PointOnCurve3d GetClosestPointTo( Point3d point, Tolerance tolerance );
Копировать Код
Public Function GetClosestPointTo( point As Point3d, tolerance As Tolerance ) As PointOnCurve3d
 Параметры
 Параметры
 Описание
 point
 Входная точка, для которой ищется ближайшая к ней точка на кривой. Тип Point3d.
 tolerance
 Допуск, определяющий точность геометрических построений. Тип Tolerance.
 Возвращает
 Возвращает точку на кривой. Тип PointOnCurve3d.
 Описание
 Метод находит точку на данной кривой, ближайшую к указанной точке в пределах указанного допуска.
 Ссылки
 Teigha.Geometry.Curve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!