Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SubDMesh.SubdRefine
 Послать отзыв
 Данный метод применяет текущую степень сглаженности сети к подобъектам SubDMesh. Степень сглаженности устанавливается равной 0.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SubdRefine();
Копировать Код
Public Sub SubdRefine()
 Описание
 Данный метод применяет текущую степень сглаженности сети к подобъектам SubDMesh. Степень сглаженности устанавливается равной 0.
 Ссылки
 Teigha.DatabaseServices.SubDMesh, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!