Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DynamicDimensionDataCollection.GetEnumerator
 Послать отзыв
 Метод GetEnumerator() позволяет получить перечислитель для этой коллекции.
 Синтаксис
C#
Visual Basic
Копировать Код
public System.Collections.IEnumerator GetEnumerator();
Копировать Код
Public Function GetEnumerator() As System.Collections.IEnumerator
 Возвращает
 Возвращает перечислитель. Тип System.Collections.IEnumerator.
 Описание
 Метод GetEnumerator() позволяет получить перечислитель для этой коллекции.
 Ссылки
 Teigha.DatabaseServices.DynamicDimensionDataCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!