Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MTextFragment.TrueTypeFont
 Послать отзыв
 Свойство представляет имя шрифта TrueType.
 Синтаксис
C#
Visual Basic
Копировать Код
public String TrueTypeFont;
Копировать Код
Public ReadOnly Property TrueTypeFont As String
 Возвращает
 Возвращает имя шрифта TrueType. Тип String.
 Описание
 Свойство представляет имя шрифта TrueType.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.MTextFragment, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!