Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CompoundObjectId.SetFullPath
 Послать отзыв
 Метод позволяет задать данный объект CompoundObjectId на базе объекта, который хранит путь вхождений блоков.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetFullPath( ref ObjectIdCollection fullPath, ref Database hostDatabase );
Копировать Код
Public Sub SetFullPath( ByRef fullPath As ObjectIdCollection, ByRef hostDatabase As Database )
 Параметры
 Параметры
 Описание
 fullPath
 Путь вхождений блоков с объектом конечного уровня в конце пути. Тип ObjectIdCollection.
 hostDatabase
 Главная база данных. Тип Database.
 Описание
 Метод позволяет задать данный объект CompoundObjectId на базе объекта, который хранит путь вхождений блоков.
 Ссылки
 Teigha.DatabaseServices.CompoundObjectId, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!