Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MInsertBlock.ColumnSpacing
 Послать отзыв
 Свойство представляет расстояние между столбцами изображения BlockTableRecord, отображаемого данным объектом.
 Синтаксис
C#
Visual Basic
Копировать Код
public double ColumnSpacing;
Копировать Код
Public Property ColumnSpacing As Double
 Возвращает
 Возвращает расстояние между столбцами. Тип double.
 Описание
 Свойство представляет расстояние между столбцами изображения BlockTableRecord, отображаемого данным объектом.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MInsertBlock, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!