Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PolyFaceMesh.AppendVertex
 Послать отзыв
 Этот метод добавляет вершину PolyFaceMeshVertex, указанную в аргументе vertexToAppend, в конец списка вершин PolyFaceMesh, определяет PolyFaceMesh владельцем вершины и добавляет эту вершину в базу данных, содержащую PolyFaceMesh.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.ObjectId AppendVertex( ref PolyFaceMeshVertex toAppend );
Копировать Код
Public Function AppendVertex( ByRef toAppend As PolyFaceMeshVertex ) As DatabaseServices.ObjectId
 Параметры
 Параметры
 Описание
 vertexToAppend
 Добавляемая в сеть вершина PolyFaceMeshVertex.
 Возвращает
 Возвращает ObjectId.
 Описание
 Этот метод добавляет вершину PolyFaceMeshVertex, указанную в аргументе vertexToAppend, в конец списка вершин PolyFaceMesh, определяет PolyFaceMesh владельцем вершины и добавляет эту вершину в базу данных, содержащую PolyFaceMesh. Для успешной работы метода сеть PolyFaceMesh должна быть резидентной в базе данных.
 Добавленная вершина должна быть явно закрыта вызывающим приложением после возврата из метода AppendVertex().
 Предупреждение
 Все вершины должны быть добавлены прежде, чем будут добавлены какие-либо записи FaceRecord. После добавления хотя бы одного FaceRecord методы AppendVertex() перестают работать.
 Ссылки
 Teigha.DatabaseServices.PolyFaceMesh, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!