Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AbstractViewTableRecord.FrontClipEnabled
 Послать отзыв
 Свойство FrontClipEnabled позволяет определить, включен ли режим переднего отсечения для TableRecord.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool FrontClipEnabled;
Копировать Код
Public Property FrontClipEnabled As Boolean
 Возвращает
 Возвращает true, если режим переднего отсечения для данного вида включен. В противном случае возвращает false.
 Описание
 Свойство FrontClipEnabled позволяет определить, включен ли режим переднего отсечения для TableRecord.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.AbstractViewTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!