Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FeatureControlFrame.DimensionStyleName
 Послать отзыв
 Свойство DimensionStyleName возвращает имя размерного стиля данного объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public String DimensionStyleName;
Копировать Код
Public Property DimensionStyleName As String
 Возвращает
 Возвращает имя размерного стиля данного. Тип String.
 Описание
 Свойство DimensionStyleName возвращает имя размерного стиля данного объекта.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.FeatureControlFrame, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!