Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ObjectClosedEventArgs.Id
 Послать отзыв
 Свойство Id представляет изменённый объект.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectId Id;
Копировать Код
Public ReadOnly Property Id As ObjectId
 Возвращает
 Возвращает идентификатор изменённого объекта. Тип ObjectId.
 Описание
 Свойство Id представляет изменённый объект.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.ObjectClosedEventArgs, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!