Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbCurve2d.NurbCurve2d
 Послать отзыв
 Конструктор класса NurbCurve2d. Создает двумерную полиномиальную кривую, которая интерполирует заданный массив двумерных определяющих точек.
 Синтаксис
C#
Visual Basic
Копировать Код
public NurbCurve2d( ref Point2dCollection fitPoints, ref Vector2dCollection fitTangents, bool periodic );
Копировать Код
Public Sub New( ByRef fitPoints As Point2dCollection, ByRef fitTangents As Vector2dCollection, periodic As Boolean )
 Параметры
 Параметры
 Описание
 fitPoints
 Массив определяющих двумерных точек, которые подлежат интерполяции. Тип Point2dCollection.
 fitTangents
 Векторы, интерполирующие производные кривой в определяющих точках. Тип Vector2dCollection.
 periodic
 Флаг, определяющий, должна ли создаваемая кривая быть периодической (замкнутой). Тип bool.
 Описание
 Конструктор класса NurbCurve2d. Создает двумерную полиномиальную кривую, которая интерполирует заданный массив двумерных определяющих точек.
 Замечания
 Если флаг periodic равен true, должны совпадать первая и последняя определяющие точки в коллекции fitPoints, а также первый и последний векторы производных в коллекции fitTangents.
 Ссылки
 Teigha.Geometry.NurbCurve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!