Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CurveCurveIntersector2d.GetOverlapRanges
 Послать отзыв
 Метод позволяет вычислить для обеих кривых параметрические интервалы, которые соответствуют указанному по индексу участку перекрытия (совпадения) кривых.
 Синтаксис
C#
Visual Basic
Копировать Код
public Interval[] GetOverlapRanges( int overlapNumber );
Копировать Код
Public Function GetOverlapRanges( overlapNumber As Integer ) As Interval()
 Параметры
 Параметры
 Описание
 overlapNumber
 Индекс участка перекрытия (совпадения) кривых. Тип int. Значение overlapNumber должно быть неотрицательным и быть меньше количества перекрытий, возвращаемого свойством OverlapCount.
 Возвращает
 Возвращает массив из двух элементов, которые представляют параметрические интервалы для первой и второй кривой, соответственно. Тип Interval[].
 Описание
 Метод позволяет вычислить для обеих кривых параметрические интервалы, которые соответствуют указанному по индексу участку перекрытия (совпадения) кривых.
 Ссылки
 Teigha.Geometry.CurveCurveIntersector2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!