Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocArrayCommonParameters.RowCount
 Послать отзыв
 Свойство обеспечивает доступ к количеству рядов (строк) в массиве.
 Синтаксис
C#
Visual Basic
Копировать Код
public int RowCount;
Копировать Код
Public Property RowCount() As Integer
 Возвращает
 Возвращает количество рядов. Тип int.
 Описание
 Свойство обеспечивает доступ к количеству рядов (строк) в массиве.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.AssocArrayCommonParameters, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!