Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.NurbsData.Periodic
 Послать отзыв
 Свойство позволяет проверить, является ли сплайн периодическим.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool Periodic;
Копировать Код
Public ReadOnly Property Periodic As Boolean
 Возвращает
 Возвращает true, если сплайн является периодическим. В противном случае возвращает false.
 Описание
 Свойство позволяет проверить, является ли сплайн периодическим. У периодического сплайна с периодом T точки, соответствующие значениям параметра t и (t + T), совпадают.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.NurbsData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!