Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.TableStyle.SetDataType
 Послать отзыв
 Метод позволяет задать тип данных и тип единиц измерения в строках заданного типа.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetDataType( DatabaseServices.DataType nDataType, DatabaseServices.UnitType nUnitType, RowType rowTypes );
Копировать Код
Public Overridable Sub SetDataType( nDataType As DatabaseServices.DataType, nUnitType As DatabaseServices.UnitType, rowTypes As RowType )
 Параметры
 Параметры
 Описание
 nDataType
 Входной тип данных. Тип DatabaseServices.DataType.
 nUnitType
 Входной тип единиц изверения. Тип DatabaseServices.UnitType.
 rowTypes
 Один или комбинация нескольких типов строк таблицы. Тип int. См. перечисление RowType.
 Описание
 Метод позволяет задать тип данных и тип единиц измерения в строках заданного типа.
 Ссылки
 Teigha.DatabaseServices.TableStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!