Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MText.GetBoundingPoints
 Послать отзыв
 Метод возвращает граничные угловые точки WCS области текста данного объекта MText.
 Синтаксис
C#
Visual Basic
Копировать Код
public Geometry.Point3dCollection GetBoundingPoints();
Копировать Код
Public Function GetBoundingPoints() As Geometry.Point3dCollection
 Возвращает
 Возвращает коллекцию граничных угловых точек области текста данного объекта. Тип Geometry.Point3dCollection.
 Описание
 Метод возвращает граничные угловые точки WCS области текста данного объекта MText.
 Последовательность точек в возвращаемой коллекции имеет следующий вид.
 Индекс точки
 Угол
 0
 Левый верхний угол.
 1
 Правый верхний угол.
 2
 Нижний левый угол.
 3
 Нижний правый угол.
 Ссылки
 Teigha.DatabaseServices.MText, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!