Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.OsnapPointRef.MainEntity
 Послать отзыв
 Метод предоставляет полный путь XrefFullSubentityPath для подобъекта внешней ссылки, который является основным для данной точки привязки.
 Синтаксис
C#
Visual Basic
Копировать Код
public XrefFullSubentityPath MainEntity();
Копировать Код
Public Function MainEntity() As XrefFullSubentityPath
 Возвращает
 Возвращает полный путь для подобъекта внешней ссылки. Тип XrefFullSubentityPath.
 Описание
 Метод предоставляет полный путь XrefFullSubentityPath для подобъекта внешней ссылки, который является основным для данной точки привязки.
 Ссылки
 Teigha.DatabaseServices.OsnapPointRef, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!