Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CellContentTypes
 Послать отзыв
 Данное перечисление определяет типы содержимого ячеек таблицы.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum CellContentTypes { Block = 4, Field = 2, Unknown = 0, Value = 1 }
Копировать Код
Public Enum CellContentTypes Block = 4 Field = 2 Unknown = 0 Value = 1 End Enum
 Члены
 Члены
 Описание
 Unknown
 Значение: 0. Неизвестный или недопустимый контент.
 Value
 Значение: 1. Допустим любой тип данных, включая текст.
 Field
 Значение: 2. Содержимое является полем.
 Block
 Значение: 4. Содержимое является блоком.
 Описание
 Данное перечисление определяет типы содержимого ячеек таблицы.
 Ваши комментарии по поводу этого топика: Послать отзыв!