Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObject.DowngradeOpen()
 Послать отзыв
 Метод уровень доступа к этому объекту с ForWrite до ForRead.
 Синтаксис
C#
Visual Basic
Копировать Код
public void DowngradeOpen();
Копировать Код
Public Sub DowngradeOpen()
 Описание
 Переводит объект, открытый в режиме OpenMode.ForWrite, в режим OpenMode.ForRead. Все изменения, сделанные с момента открытия на запись, записываются в базу данных и возникают все соответствующие события. Note Эта функция не требует, чтобы она предшествовала вызову upgradeOpen() — она только требует, чтобы при ее вызове объект был открыт на запись.
 Ссылки
 Teigha.DatabaseServices.DBObject, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!