Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocArrayPathParameters.GetItemSpacing
 Послать отзыв
 Метод получает расстояние между элементами в массиве по траектории.
 Синтаксис
C#
Visual Basic
Копировать Код
public double GetItemSpacing( out String expression, out String evaluatorId );
Копировать Код
Public Function GetItemSpacing( ByRef expression As String, ByRef evaluatorId As String ) As Double
 Параметры
 Параметры
 Описание
 expression
 Выражение для параметра. Тип String. Строка может быть пустой.
 evaluatorId
 Строковое представление идентификатора вычислителя. Тип String. Строка может быть пустой.
 Возвращает
 Возвращает расстояние между элементами в массиве по траектории. Тип double.
 Описание
 Метод получает расстояние между элементами в массиве по траектории. Если для параметра выражение отсутствует, то после выполнения метода строки expression и evaluatorId остаются пустыми.
 Ссылки
 Teigha.DatabaseServices.AssocArrayPathParameters, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!