Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Entity.BlockId
 Послать отзыв
 Свойство предназначено для получения идентификатора владельца геометрического объекта, которым должен быть объект типа BlockTableRecord.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectId BlockId;
Копировать Код
Public Property BlockId() As ObjectId
 Возвращает
 Возвращает значение типа ObjectId, представляющее собой ссылку на блок (запись таблицы блоков), которому принадлежит данный геометрический объект.
 Описание
 Свойство предназначено для получения идентификатора владельца геометрического объекта, которым должен быть объект типа BlockTableRecord.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.Entity, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!