Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.NurbSurface.IsPlanar
 Послать отзыв
 Метод позволяет проверить, является ли данная поверхность плоской. Если поверхность представляет собой плоскость, метод дополнительно возвращает информацию о плоскости и ее нормали.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsPlanar( out Point3d ptOnSurface, out Vector3d normal );
Копировать Код
Public Function IsPlanar( ptOnSurface As out Point3d, normal As out Vector3d ) As Boolean
 Параметры
 Параметры
 Описание
 ptOnSurface
 Если поверхность является плоской, возвращает точку на этой плоскости. Тип Point3d.
 normal
 Если поверхность является плоской, возвращает нормаль этой плоскости. Тип Point3d.
 Возвращает
 Возвращает true, если поверхность представляет собой плоскость. В противном случае возвращает false.
 Описание
 Метод позволяет проверить, является ли данная поверхность плоской. Если поверхность плоская, метод дополнительно возвращает информацию о плоскости и ее нормали.
 Если поверхность не содержит никакой NURBS информации, метод выбрасывает исключение eFail.
 Ссылки
 Teigha.DatabaseServices.NurbSurface, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!