Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MTextFragment.ObliqueAngle
 Послать отзыв
 Свойство возвращает угол наклона текста.
 Синтаксис
C#
Visual Basic
Копировать Код
public double ObliqueAngle;
Копировать Код
Public ReadOnly Property ObliqueAngle As Double
 Возвращает
 Возвращает угол наклона текста (в радианах). Тип double.
 Описание
 Свойство возвращает угол наклона текста.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.MTextFragment, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!