Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LampColorPreset
 Послать отзыв
 Данное перечисление определяет предустановленные цвета лампы.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum LampColorPreset { CoolWhite = 2, Custom = 14, D65White = 0, DaylightFluorescent = 4, Fluorescent = 1, Halogen = 7, HighPressureSodium = 12, Incandescent = 5, LowPressureSodium = 13, Mercury = 10, MetalHalide = 9, PhosphorMercury = 11, Quartz = 8, WhiteFluorescent = 3, Xenon = 6 }
Копировать Код
Public Enum LampColorPreset CoolWhite = 2 Custom = 14 D65White = 0 DaylightFluorescent = 4 Fluorescent = 1 Halogen = 7 HighPressureSodium = 12 Incandescent = 5 LowPressureSodium = 13 Mercury = 10 MetalHalide = 9 PhosphorMercury = 11 Quartz = 8 WhiteFluorescent = 3 Xenon = 6 End Enum
 Члены
 Члены
 Описание
 D65White
 Значение: 0. Стандартный источник дневного света D65.
 Fluorescent
 Значение: 1. Цвет флуоресцентной лампы.
 CoolWhite
 Значение: 2. Холодный белый цвет лампы.
 WhiteFluorescent
 Значение: 3. Белый цвет флуоресцентной лампы дневного света.
 DaylightFluorescent
 Значение: 4. Цвет флуоресцентной лампы дневного света.
 Incandescent
 Значение: 5. Цвет лампы накаливания.
 Xenon
 Значение: 6. Цвет ксеноновой лампы.
 Halogen
 Значение: 7. Цвет галогенной лампы.
 Quartz
 Значение: 8. Цвет кварцевой лампы.
 MetalHalide
 Значение: 9. Цвет металлогалогенной лампы.
 Mercury
 Значение: 10. Цвет ртутной лампы.
 PhosphorMercury
 Значение: 11. Цвет люминофорной ртутной лампы.
 HighPressureSodium
 Значение: 12. Цвет натриевой лампы высокого давления.
 LowPressureSodium
 Значение: 13. Цвет натриевой лампы низкого давления.
 Custom
 Значение: 14. Пользовательский цвет лампы.
 Описание
 Данное перечисление определяет предустановленные цвета лампы.
 Ваши комментарии по поводу этого топика: Послать отзыв!