Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.RevolveOptions
 Послать отзыв
 Вспомогательный класс RevolveOptions представляет настраиваемые опции операции создания тел и поверхностей вращения.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::DatabaseServices::RevolveOptions
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdDbRevolveOptions")] public class RevolveOptions : DisposableWrapper, ICloneable
Копировать Код
<Wrapper("OdDbRevolveOptions")> Public Class RevolveOptions Inherits DisposableWrapper Implements ICloneable
 Описание
 Вспомогательный класс RevolveOptions представляет настраиваемые опции операции создания тел и поверхностей вращения. Эти опции позволяют управлять формой получаемой геометрии.
 Методы
 Конструкторы
 Teigha.DatabaseServices.RevolveOptions
 Имя
 Описание
 RevolveOptions
 Это обзор перегрузок RevolveOptions.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.DatabaseServices.RevolveOptions
 Имя
 Описание
 RevolveOptions Методы
 Ниже перечислены методы класса RevolveOptions.
 RevolveOptions Свойства
 Ниже перечислены свойства класса RevolveOptions.
 Ссылки
 RevolveOptions Конструктор, RevolveOptions Методы, RevolveOptions Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!