Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LinkedTableData.SetBlockAttributeValue
 Послать отзыв
 Метод позволяет задать значение атрибуту блока в ячейке, если первый элемент содержимого ячейки представляет собой блок с атрибутами.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetBlockAttributeValue( int row, int column, DatabaseServices.ObjectId attributeDefinitionId, ref String value );
Копировать Код
Public Overridable Sub SetBlockAttributeValue( row As Integer, column As Integer, attributeDefinitionId As DatabaseServices.ObjectId, ByRef value As String )
 Параметры
 Параметры
 Описание
 row
 Индекс строки. Тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 column
 Индекс столбца. Тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице.
 attributeDefinitionId
 Идентификатор объекта определения атрибута. Тип DatabaseServices.ObjectId.
 value
 Новое значение атрибута. Тип String.
 Описание
 Метод позволяет задать значение атрибуту блока в ячейке, если первый элемент содержимого ячейки представляет собой блок с атрибутами. Атрибут специфицируется идентификатором объекта определения атрибута.
 Замечания
 Метод выбрасывает исключение eInvalidInput, если индексы строки и/или столбца выходят за допустимые пределы. Если содержимое ячейки недоступно для редактирования, метод выбрасывает исключение eIsWriteProtected.
 Ссылки
 Teigha.DatabaseServices.LinkedTableData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!