Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FeatureControlFrame.Text
 Послать отзыв
 Свойство Text представляет текстовую строку, которая используется данным объектом.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual String Text;
Копировать Код
Public Overridable Property Text As String
 Возвращает
 Возвращает текстовую строку данного объекта. Тип String.
 Описание
 Свойство Text представляет текстовую строку, которая используется данным объектом.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.FeatureControlFrame, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!