Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Mline.NumberOfVertices
 Послать отзыв
 Свойство представляет текущее количество вершин данной мультилинии.
 Синтаксис
C#
Visual Basic
Копировать Код
public int NumberOfVertices;
Копировать Код
Public ReadOnly Property NumberOfVertices As Integer
 Возвращает
 Возвращает количество вершин. Тип int.
 Описание
 Свойство представляет текущее количество вершин данной мультилинии.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Mline, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!