Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Filters.SpatialFilterDefinition.BackClip
 Послать отзыв
 Свойство возвращает расстояние задней плоскости отсечения в отрицательном направлении выдавливания.
 Синтаксис
C#
Visual Basic
Копировать Код
public double BackClip;
Копировать Код
Public ReadOnly Property BackClip As Double
 Возвращает
 Возвращает расстояние до задней плоскости отсечения. Тип double.
 Описание
 Свойство возвращает расстояние до задней плоскости отсечения в отрицательном направлении выдавливания.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Filters.SpatialFilterDefinition, Teigha.DatabaseServices.Filters
 Ваши комментарии по поводу этого топика: Послать отзыв!