Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CompoundObjectId.CompoundObjectId
 Послать отзыв
 Конструктор класса CompoundObjectId, предназначенный для создания идентификатора составного объекта на основе переданного идентификатора объекта ObjectId и пути вхождений блоков BlockReference в указанной базе данных.
 Синтаксис
C#
Visual Basic
Копировать Код
public CompoundObjectId( ObjectId id, ref ObjectIdCollection path, ref Database hostDatabase );
Копировать Код
Public Sub New( id As ObjectId, ByRef path As ObjectIdCollection, ByRef hostDatabase As Database )
 Параметры
 Параметры
 Описание
 id
 Входной идентификатор объекта. Тип ObjectId.
 path
 Путь вхождений BlockReference, ведущий к указанному объекту. Тип ObjectIdCollection. Первый BlockReference в пути принадлежит базе данных хоста, второй BlockReference определяется из BlockTableRecord, на которую ссылается первый BlockReference, третий BlockReference — из BlockTableRecord, на которую ссылается второй BlockReference, и т.д.
 hostDatabase
 Входная база данных, которой принадлежит входной объект. Тип Database.
 Описание
 Конструктор класса CompoundObjectId, предназначенный для создания идентификатора составного объекта на основе переданного идентификатора объекта ObjectId и пути вхождений BlockReference в указанной базе данных. В случае нулевого аргумента hostDatabase ссылка на базу данных извлекается из первого идентификатора в пути.
 Ссылки
 Teigha.DatabaseServices.CompoundObjectId, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!