Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.RenderGlobal.ProcedureAndDestinationParameter.ProcedureAndDestinationParameter
 Послать отзыв
 Конструктор структуры ProcedureAndDestinationParameter. Создает экземпляр структуры с указанными параметрами.
 Синтаксис
C#
Visual Basic
Копировать Код
public ProcedureAndDestinationParameter( Procedure p, Destination d );
Копировать Код
Public Sub New( p As Procedure, d As Destination )
 Параметры
 Параметры
 Описание
 p
 Процедура рендеринга (тип визуального контента). Значение из перечисления Procedure.
 d
 Направление вывода рендеринга. Значение из перечисления Destination.
 Описание
 Конструктор структуры ProcedureAndDestinationParameter. Создает экземпляр структуры с указанными параметрами.
 Ссылки
 Teigha.DatabaseServices.RenderGlobal.ProcedureAndDestinationParameter, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!