Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DataCell.SetHardPointerId
 Послать отзыв
 Метод устанавливает для этой ячейки идентификатор жесткой ссылки на указатель.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetHardPointerId( DatabaseServices.ObjectId value );
Копировать Код
Public Sub SetHardPointerId( value As DatabaseServices.ObjectId )
 Параметры
 Параметры
 Описание
 value
 Входное значение для ячейки. Тип DatabaseServices.ObjectId.
 Описание
 Метод устанавливает для этой ячейки идентификатор жесткой ссылки на указатель, заданный входным аргументом value.
 Ссылки
 Teigha.DatabaseServices.DataCell, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!