Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.RevolveOptions.TwistAngle
 Послать отзыв
 Свойство TwistAngle представляет угол закручивания при вращении.
 Синтаксис
C#
Visual Basic
Копировать Код
public double TwistAngle;
Копировать Код
Public ReadOnly Property TwistAngle As Double
 Возвращает
 Возвращает угол закручивания в радианах. Тип double.
 Описание
 Свойство TwistAngle представляет угол закручивания в радианах. Это угол, на который профиль закручивается при вращении вокруг оси вращения.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.RevolveOptions, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!