Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Extents2d.Extents2d
 Послать отзыв
 Конструктор класса Extents2d. Создает двумерный ограничивающий бокс, заданный парой двумерных точек Point2d в качестве вершин главной диагонали.
 Синтаксис
C#
Visual Basic
Копировать Код
public Extents2d( Point2d minimum, Point2d maximum );
Копировать Код
Public Sub New( minimum As Point2d, maximum As Point2d )
 Параметры
 Параметры
 Описание
 minimum
 Минимальная точка. Тип Point2d.
 maximum
 Максимальная точка. Тип Point2d.
 Описание
 Конструктор класса Extents2d. Создает двумерный ограничивающий бокс, заданный парой двумерных точек Point2d в качестве вершин главной диагонали.
 Ссылки
 Teigha.DatabaseServices.Extents2d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!