Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.ExternalBoundedSurface.IsEllipCylinder
 Послать отзыв
 Свойство IsEllipCylinder позволяет проверить, является ли неограниченная базовая поверхность данного объекта эллиптическим цилиндром.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsEllipCylinder;
Копировать Код
Public ReadOnly Property IsEllipCylinder As Boolean
 Возвращает
 Возвращает true, если неограниченная базовая поверхность данного объекта является эллиптическим цилиндром. В противном случае возвращает false.
 Описание
 Свойство IsEllipCylinder определяет тип неограниченной базовой поверхности данного объекта и возвращает true, если она является эллиптическим цилиндром.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.ExternalBoundedSurface, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!