Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.SetBlockScale
 Послать отзыв
 Метод позволяет задать коэффициент масштабирования вхождения блока в указанной ячейке таблицы.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetBlockScale( int row, int col, double scale );
Копировать Код
Public virtual Sub SetBlockScale( row As Integer, col As Integer, scale As double )
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 col
 Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
 scale
 Коэффициент масштабирования вхождения блока. Тип double.
 Описание
 Метод позволяет задать коэффициент масштабирования вхождения блока в указанной ячейке таблицы.
 Замечания
 Для получения того же результата предпочтительнее использовать Table.Cells[row,column].Contents[i].Scale.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!