Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotSettingsValidator.SetUseStandardScale
 Послать отзыв
 Метод позволяет контролировать использование стандартного масштаба для указанного объекта PlotSettings.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetUseStandardScale( ref PlotSettings plotSet, bool useStandard );
Копировать Код
Public Sub SetUseStandardScale( ByRef plotSet As PlotSettings, useStandard As Boolean )
 Параметры
 Параметры
 Описание
 plotSet
 Входной объект PlotSettings с настройками печати.
 useStandard
 Входной флаг, определяющий, должен ли использоваться стандартный масштаб. Тип bool.
 Описание
 Метод позволяет назначать и отменять использование стандартного масштаба для указанного объекта PlotSettings.
 Ссылки
 Teigha.DatabaseServices.PlotSettingsValidator, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!