Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.HatchLoop.Curves
 Послать отзыв
 Свойство возвращает коллекцию кривых, составляющих данный контур штриховки.
 Синтаксис
C#
Visual Basic
Копировать Код
public Curve2dCollection Curves;
Копировать Код
Public ReadOnly Property Curves As Curve2dCollection
 Возвращает
 Возвращает коллекцию кривых, составляющих данный контур штриховки. Тип Curve2dCollection.
 Описание
 Свойство возвращает коллекцию кривых, составляющих данный контур штриховки.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.HatchLoop, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!