Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MentalRayRenderSettings.GlobalIlluminationEnabled
 Послать отзыв
 Свойство GlobalIlluminationEnabled позволяет определить, следует ли включать расчет глобального освещения.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool GlobalIlluminationEnabled;
Копировать Код
Public Property GlobalIlluminationEnabled As Boolean
 Возвращает
 Возвращает true, если режим расчета глобального освещения включен. В противном случае возвращает false.
 Описание
 Свойство GlobalIlluminationEnabled позволяет определить, следует ли включать расчет эффектов глобального освещения (например, цветовое смешение).
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MentalRayRenderSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!