Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.AugmentedPolylineCurve3d.AugmentedPolylineCurve3d
 Послать отзыв
 Конструктор класса AugmentedPolylineCurve3d. Создает полилинию, которая аппроксимирует переданную кривую в указанном параметрическом диапазоне с заданной точностью.
 Синтаксис
C#
Visual Basic
Копировать Код
public AugmentedPolylineCurve3d( ref Curve3d curve, double fromParameter, double toParameter, double eps );
Копировать Код
Public Sub New( ByRef curve As Curve3d, fromParameter As Double, toParameter As Double, eps As Double )
 Параметры
 Параметры
 Описание
 curve
 Входная 3D-кривая. Тип Curve3d.
 fromParameter
 Входная начальная точка параметрического диапазона, на котором выполняется аппроксимация кривой. Тип double.
 toParameter
 Входная конечная точка параметрического диапазона, на котором выполняется аппроксимация кривой. Тип double.
 eps
 Заданная точность аппроксимации кривой. Тип double.
 Описание
 Конструктор класса AugmentedPolylineCurve3d. Создает полилинию, которая аппроксимирует переданную кривую с заданной точностью в указанном параметрическом диапазоне.
 Все вершины полилинии лежат на входной кривой curve. Максимальное отклонение входной кривой на любом сегменте полилинии не превышает заданную точность eps.
 Ссылки
 Teigha.Geometry.AugmentedPolylineCurve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!