Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MInsertBlock.Rows
 Послать отзыв
 Свойство представляет количество строк изображения BlockTableRecord для отображения данным объектом.
 Синтаксис
C#
Visual Basic
Копировать Код
public short Rows;
Копировать Код
Public Property Rows As Short
 Возвращает
 Возвращает количество строк. Тип short.
 Описание
 Свойство представляет количество строк изображения BlockTableRecord для отображения данным объектом.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MInsertBlock, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!