Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SymbolUtilityServices.GetSymbolNameFromPathName
 Послать отзыв
 Метод извлекает подходящее имя символа из имени пути.
 Синтаксис
C#
Visual Basic
Копировать Код
public static String GetSymbolNameFromPathName( ref String pathName, ref String extensions );
Копировать Код
Public Shared Function GetSymbolNameFromPathName( ByRef pathName As String, ByRef extensions As String ) As String
 Параметры
 Параметры
 Описание
 pathName
 Имя блока, из которого требуется получить путь. Тип String.
 extensions
 Список расширений, для которых ищутся имена символов. Тип String.
 Возвращает
 Возвращает имя блока. Тип String.
 Описание
 Метод извлекает подходящее имя символа из имени пути. Имя символа является частью пути, который представляет имя файла.
 Любое из указанных расширений файлов будет удалено. В случае недопустимого имени пути pathName, имя символа также может быть недопустимым. Список расширений должен использовать точку с запятой в качестве разделителя. Расширения не должны иметь точек перед именами расширений, например: "dwg;dxf".
 Ссылки
 Teigha.DatabaseServices.SymbolUtilityServices, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!