Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Database.RestoreOriginalXrefSymbols
 Послать отзыв
 Синтаксис
C#
Visual Basic
public void RestoreOriginalXrefSymbols();
Public Sub RestoreOriginalXrefSymbols()
 Описание
 Этот метод должен использоваться вместе с RestoreForwardingXrefSymbols(), и должен окружать код, в котором планируется редактировать и/или сохранить внешние ссылки базы данных.
 Метод RestoreOriginalXrefSymbols() отменяет все изменения, сделанные в процессе разрешения внешних ссылок, так что база данных имеет то же самое состояние, которое она имела после первого чтения с диска.
 Символы, на которые оказывается воздействие — это таблицы и записи для блоков, слоев, типов линий, стилей текстов, стилей размеров, зарегистрированных приложений, стилей печати, также как изменения любых пользовательских объектов, сделанные во время и между событиями XrefBeginAttached и XrefBeginOtherAttached.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!