Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Trace.Trace
 Послать отзыв
 Конструктор класса Trace. Создает новую полосу с указанными вершинами.
 Синтаксис
C#
Visual Basic
Копировать Код
public Trace( Point3d pointer1, Point3d pointer2, Point3d pointer3, Point3d pointer4 );
Копировать Код
Public Sub New( pointer1 As Point3d, pointer2 As Point3d, pointer3 As Point3d, pointer4 As Point3d )
 Параметры
 Параметры
 Описание
 pointer1
 Первая вершина полосы. Тип Point3d.
 pointer2
 Вторая вершина полосы. Тип Point3d.
 pointer3
 Третья вершина полосы. Тип Point3d.
 pointer4
 Четвертая вершина полосы. Тип Point3d.
 Описание
 Конструктор класса Trace. Создает новую полосу с указанными вершинами.
 Замечания
 Координаты вершин задаются в мировой системе координат (WCS).
 Ссылки
 Teigha.DatabaseServices.Trace, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!