Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.RevolveOptions.DraftAngle
 Послать отзыв
 Свойство DraftAngle представляет угол сужения при вращении.
 Синтаксис
C#
Visual Basic
Копировать Код
public double DraftAngle;
Копировать Код
Public ReadOnly Property DraftAngle As Double
 Возвращает
 Возвращает угол сужения в радианах. Тип double.
 Описание
 Свойство DraftAngle представляет угол сужения вращаемого профиля с увеличением угла поворота. Измеряется в радианах. Значение по умолчанию 0.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.RevolveOptions, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!