Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MeshDataCollection.ColorArray
 Послать отзыв
 Свойство представляет коллекцию цветов граней сети.
 Синтаксис
C#
Visual Basic
Копировать Код
public EntityColorCollection ColorArray;
Копировать Код
Public Property ColorArray As EntityColorCollection
 Возвращает
 Возвращает массив цветов граней. Тип EntityColorCollection.
 Описание
 Свойство представляет коллекцию цветов граней сети.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MeshDataCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!