Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Circle.Diameter
 Послать отзыв
 Синтаксис
C#
Visual Basic
public double Diameter;
Public Property Diameter() As Double
 Описание
 Задает или возвращает диаметр окружности.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Circle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!