Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.GetDataLink
 Послать отзыв
 Метод позволяет получить коллекцию ссылок на данные, связанные по ссылкам с указанным диапазоном ячеек.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual ObjectIdCollection GetDataLink( ref CellRange range );
Копировать Код
Public virtual Function GetDataLink( ByRef range As CellRange ) As ObjectIdCollection
 Параметры
 Параметры
 Описание
 range
 Диапазон ячеек. Тип CellRange. Если передать NULL, метод вернет все ссылки в данной таблице.
 Возвращает
 Возвращает коллекцию типа ObjectIdCollection.
 Описание
 Метод позволяет получить коллекцию ссылок на данные, связанные по ссылкам с указанным диапазоном ячеек.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!