Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DxfFiler.HaltAtClassBoundaries
 Послать отзыв
 Метод определяет, следует ли файлеру прекратить работу в случае выхода за границу класса.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void HaltAtClassBoundaries(bool value);
Копировать Код
Public Overridable Sub HaltAtClassBoundaries(value As Boolean)
 Параметры
 Параметры
 Описание
 value
 Входное логическое значение, указывающее, следует ли прекращать работу на определенных ключевых маркерах в файле. Тип bool.
 Описание
 Метод определяет, следует ли файлеру прекратить работу в случае выхода за границу класса.
 Если в метод передано значение true, файлер должен в такой ситуации прекратить работу приложения. В случае значения false файлер должен читать все входные данные без сброса состояния ErrorStatus, если только не произойдет ошибка ввода-вывода. Реализация этого метода по умолчанию сводится к завершению работы nanoCAD.
 Ссылки
 Teigha.DatabaseServices.DxfFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!