Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector2d.IsUnitLength
 Послать отзыв
 Метод проверяет, является ли данный вектор единичным в пределах указанной точности.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsUnitLength( Tolerance tolerance );
Копировать Код
Public Function IsUnitLength( tolerance As Tolerance ) As Boolean
 Параметры
 Параметры
 Описание
 tolerance
 Заданная геометрическая точность. Тип Tolerance.
 Возвращает
 Возвращает true, если в пределах точности tolerance данный вектор можно считать единичным. В противном случае возвращает false.
 Описание
 Метод проверяет, является ли данный вектор единичным в пределах указанной точности tolerance.
 Ссылки
 Teigha.Geometry.Vector2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!