Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeader.GetBlockAttribute
 Послать отзыв
 Метод позволяет получить атрибут блока данной мультивыноски с указанным определением атрибута.
 Синтаксис
C#
Visual Basic
Копировать Код
public AttributeReference GetBlockAttribute( DatabaseServices.ObjectId attDefId );
Копировать Код
Public Function GetBlockAttribute( attDefId As DatabaseServices.ObjectId ) As AttributeReference
 Параметры
 Параметры
 Описание
 attDefId
 Идентификатор определения атрибута блока. Тип DatabaseServices.ObjectId.
 Возвращает
 Возвращает атрибут блока. Тип AttributeReference.
 Описание
 Метод позволяет получить атрибут блока данной мультивыноски с указанным определением атрибута.
 Ссылки
 Teigha.DatabaseServices.MLeader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!