Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Entity.GetObjectSnapPoints(ObjectSnapModes
 Послать отзыв
 Метод вычисляет точки объектной привязки (например, конечные, средние, центральные и другие характерные точки) геометрического объекта в соответствии с заданным режимом привязки и параметрами текущего вида. Полученные точки добавляются в существующий массив snapPoints, чтобы обеспечить корректное взаимодействие с пользователем при черчении или редактировании объектов.
 Синтаксис
C#
Visual Basic
Копировать Код
public void GetObjectSnapPoints(ObjectSnapModes snapMode, int gsSelectionMark, Point3d pickPoint, Point3d lastPoint, Matrix3d viewTransform, Point3dCollection snapPoints, IntegerCollection geometryIds);
Копировать Код
Public Sub GetObjectSnapPoints(snapMode As ObjectSnapModes, gsSelectionMark As Integer, pickPoint As Point3d, lastPoint As Point3d, viewTransform As Matrix3d, snapPoints As Point3dCollection, geometryIds As IntegerCollection)
 Параметры
 Параметры
 Описание
 snapMode
 Требуемый режим объектной привязки. Тип ObjectSnapModes
 gsSelectionMark
 GS маркер геометрического подобъекта, участвующего в операции объектной привязки. Тип int
 pickPoint
 Точка указания (в WCS координатах) во время операции объектной привязки. Тип Point3d
 lastPoint
 Точка (в WCS координатах), выбранная перед pickPoint. Тип Point3d
 viewTransform
 Матрица преобразования из WCS в DCS. Тип Matrix3d
 snapPoints
 Заранее созданный массив для добавления точек объектной привязки (может уже содержать точки), на выходе метода добавляет точки привязки объекта. Тип Point3dCollection
 geometryIds
 Не используется
 Описание
 Этот метод использует сведения из параметров snapMode, gsSelectionMark, pickPoint, lastPoint и viewTransform для определения точек объектной привязки геометрического объекта. Метод должен затем добавить эти точки к массиву snapPoints.
 Массив snapPoints передается для всех геометрических объектов, вовлеченных в операцию объектной привязки, поэтому возможно, что массив уже содержит данные о геометрических объектах. По этой причине, очень важно, чтобы точки добавлялись в массив, а не связывались с у же существующими в массиве элементами.
 Параметр snapMode указывает, какой режим объектной привязки используется в операции. Не все режимы применимы ко всем типам геометрических объектов (например, режим ObjectSnapModes.ModeIns не применим к линиям). Возможные значения этого параметра:
 ObjectSnapModes.ModeEnd
 Нахождение конечной точки геометрического объекта, ближайшей к точке указания
 ObjectSnapModes.ModeM
 Нахождение средней точки (любой линии, дуги или иного подобъекта) геометрического объекта, ближайшей к точке указания
 ObjectSnapModes.ModeCenter
 Нахождение средней точки (любой окружности или дуги) геометрического объекта, ближайшей к точке указания
 ObjectSnapModes.ModeNode
 Нахождение точки узла (характерной точки объекта, например, точки указания размера), ближайшей к точке указания
 ObjectSnapModes.ModeQuad
 Нахождение точки квадранта (традиционно, одна из четырех точек лежащих на пересечении окружности или дуги с горизонталью или вертикалью, проходящей через центр), ближайшей к точке указания
 ObjectSnapModes.ModeIns
 Нахождение точки пересечения геометрического объекта и прямой, перпендикулярной геометрическому объекту и проходящей через lastPoint
 ObjectSnapModes.ModePerpindicular
 Нахождение точки пересечения геометрического объекта и прямой, перпендикулярной геометрическому объекту и проходящей через lastPoint
 ObjectSnapModes.ModeTangent
 Нахождение точки пересечения геометрического объекта и касательной к нему, проведенной из точки lastPoint
 ObjectSnapModes.ModeNear
 Нахождение точки геометрического объекта, ближайшей к точке указания. Вы решаете, что значит "ближайшая" точка
 Аргумент gsSelectionMark содержит GS маркер геометрического подобъекта, который вовлечен в операцию объектной привязки. Если у геометрического объекта не установлен никакой GS маркер, то должно быть задано значение GS маркера по умолчанию, равное 0. GS маркер позволяет при желании обеспечить сужение поиска точек объектной привязки.
 Параметр pickPoint предоставляет точку (в мировых WCS координатах), с которой начинается операция объектной привязки.
 Параметр lastPoint предоставляет точку, выбранную как предшествующую точке pickPoint. Эта точка используется при определении значений для объектной привязки по перпендикуляру или касательной.
 Параметр viewTransform предоставляет матрицу преобразования из мировой системы координат (WCS) в отображаемую систему координат (DCS).
 Отображаемая система координат ориентирована так, что положительное направление оси Z направлено из монитора по направлению к пользователю, положительное направление оси X направлено по горизонтали слева направо в экране, и положительное направление оси Y направлено вертикально вверх экрана.
 Так, если текущий видовой экран в точке (1,0,0) (просмотр всегда от точки (0,0,0)), то матрица преобразования viewTransform должна быть
 0 1 0 0
 0 0 1 0
 1 0 0 0
 0 0 0 1
 В этой матрице последняя строка и последний столбец не используются. Заметим также, что третья строка задает ось Z DCS в WCS координатах (который представляет WCS версию системной переменной nanoCAD VIEWPOINT).
 Эта матрица трансформации позволяет вам определить позицию различных точек в текущем просмотре. Она наиболее полезна в режиме ObjectSnapModes.ModeNear, где "ближайшая" (точка) может зависеть от видового экрана.
 Параметр snapPoints представляет массив, куда добавляются результирующие точки объектной привязки. Вы можете добавить 0 или некоторое количество точек в массив.
 Один и тот же массив передается во все геометрические объекты, участвующие в операции. Когда все объекты будут обойдены, nanoCAD определяет, какая точка массива наиболее соответствует желаемому режиму объектной привязки. Поэтому, этот метод не нуждается до сужения поиска до одной точки.
 Ссылки
 Teigha.DatabaseServices.Entity, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!