Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SweptSurface.SweptSurface
 Послать отзыв
 Конструктор по умолчанию класса SweptSurface.
 Синтаксис
C#
Visual Basic
Копировать Код
public SweptSurface();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса SweptSurface.
 Ссылки
 Teigha.DatabaseServices.SweptSurface, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!