Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Torus.IsDoughnut
 Послать отзыв
 Свойство IsDoughnut позволяет проверить, имеет ли данный тор форму тора-бублика с отверстием посередине.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsDoughnut;
Копировать Код
Public ReadOnly Property IsDoughnut As Boolean
 Возвращает
 Возвращает true, если данный тор имеет форму "бублика" с отверстием посередине. В противном случае возвращает false.
 Описание
 Свойство IsDoughnut позволяет проверить, имеет ли данный тор форму тора-бублика с отверстием посередине. Тор приобретает форму "бублика", когда большой радиус становится больше малого радиуса.
 Замечания
 Только одно из свойств IsLemon, IsApple, IsVortex и IsDoughnut всякого конкретного тора может возвращать значение true.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.Torus, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!