Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Surftab2
 Послать отзыв
 Синтаксис
C#
Visual Basic
public int Surftab2;
Public Property Surftab2() As Integer
 Описание
 Обеспечивает доступ к текущему значению SURFTAB2 для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!