Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Section.Vertices
 Послать отзыв
 Свойство Vertices представляет коллекцию вершин данной секущей плоскости.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3dCollection Vertices;
Копировать Код
Public WriteOnly Property Vertices As Point3dCollection
 Возвращает
 Возвращает коллекцию вершин секущей плоскости. Тип Point3dCollection.
 Описание
 Свойство Vertices представляет коллекцию вершин данной секущей плоскости.
 Условия
 Только запись.
 Ссылки
 Teigha.DatabaseServices.Section, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!