Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.GeoDataLonLatAltInfo
 Послать отзыв
 Структура GeoDataLonLatAltInfo представляет географические координаты точки, включающие долготу, широту и высоту.
 Иерархия классов
Teigha::Geometry::GeoDataLonLatAltInfo
 Синтаксис
C#
Visual Basic
Копировать Код
public struct GeoDataLonLatAltInfo
Копировать Код
Public Structure GeoDataLonLatAltInfo
 Описание
 Структура GeoDataLonLatAltInfo представляет географические координаты точки, включающие долготу, широту и высоту.
 Методы
 Конструкторы
 Имя
 Описание
 GeoDataLonLatAltInfo
 Конструктор структуры GeoDataLonLatAltInfo. Создает новый экземпляр структуры с указанными значениями долготы, широты и высоты.
 Топики
 Имя
 Описание
 GeoDataLonLatAltInfo Свойства
 Ниже перечислены свойства класса GeoDataLonLatAltInfo.
 Ссылки
 GeoDataLonLatAltInfo Свойства, Методы, Топики, GeoDataLonLatAltInfo Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!