Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve3d.GetInterval
 Послать отзыв
 Метод позволяет определить параметрический интервал данной кривой.
 Синтаксис
C#
Visual Basic
Копировать Код
public Interval GetInterval();
Копировать Код
Public Function GetInterval() As Interval
 Возвращает
 Возвращает параметрический интервал данной кривой. Тип Interval.
 Описание
 Метод позволяет определить параметрический интервал данной кривой. Метод Curve3d.EvaluatePoint(double) гарантированно возвращает точку на этой кривой при вызове со значением в пределах возвращаемого интервала.
 Ссылки
 Teigha.Geometry.Curve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!