Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Interval.Element
 Послать отзыв
 Свойство Element представляет границу данного интервала.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Element;
Копировать Код
Public ReadOnly Property Element As Double
 Возвращает
 Возвращает границу данного интервала. Тип double.
 Описание
 Свойство Element
возвращает верхнюю границу, если этот интервал ограничен сверху;
возвращает нижнюю границу, если этот интервал не ограничен сверху, но ограничен снизу;
возвращает 0.0, если этот интервал не ограничен в обоих направлениях.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.Interval, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!