Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CubicSplineCurve2d.CubicSplineCurve2d
 Послать отзыв
 Конструктор класса CubicSplineCurve2d. Создает экземпляр класса с указанными определяющими точками, узловым вектором и первыми производными в определяющих точках.
 Синтаксис
C#
Visual Basic
Копировать Код
public CubicSplineCurve2d( ref KnotCollection knots, ref Point2dCollection fitPoints, ref Vector2dCollection firstDerivatives, bool periodic );
Копировать Код
Public Sub New( ByRef knots As KnotCollection, ByRef fitPoints As Point2dCollection, ByRef firstDerivatives As Vector2dCollection, periodic As Boolean )
 Параметры
 Параметры
 Описание
 knots
 Входной узловой вектор. Тип KnotCollection.
 fitPoints
 Входная коллекция определяющих точек. Тип Point2dCollection.
 firstDerivatives
 Входная коллекция векторов первых производных. Тип Vector2dCollection.
 periodic
 Флаг, указывающий, что сплайн должен быть периодическим (замкнутым). Тип bool.
 Описание
 Конструктор класса CubicSplineCurve2d. Создает экземпляр класса с заданными определяющими точками, первыми производными в них и узловым вектором. Дополнительно можно потребовать построение периодического (замкнутого) сплайна.
 Ссылки
 Teigha.Geometry.CubicSplineCurve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!