Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SubDMesh.GetVertexAt
 Послать отзыв
 Метод определяет точку Point3d вершины в заданной индексом позиции в сети.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d GetVertexAt( int index );
Копировать Код
Public Function GetVertexAt( index As Integer ) As Point3d
 Параметры
 Параметры
 Описание
 index
 Индекс вершины. Тип int.
 Возвращает
 Возвращает точку Point3d для вершины с заданным индексом.
 Описание
 Метод определяет точку Point3d вершины в заданной индексом позиции в сети.
 Ссылки
 Teigha.DatabaseServices.SubDMesh, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!