Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector3d.TransformBy
 Послать отзыв
 Метод реализует геометрическое преобразование данного вектора, которое определено входной матрицей Matrix3d.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d TransformBy( Matrix3d leftSide );
Копировать Код
Public Function TransformBy( leftSide As Matrix3d ) As Vector3d
 Параметры
 Параметры
 Описание
 leftSide
 Входная матрица геометрического пребразования. Тип Matrix3d.
 Возвращает
 Возвращает результат геометрического преобразования данного вектора. Тип Vector3d.
 Описание
 Метод применяет к данному вектору геометрическое преобразование, заданное матрицей leftSide, и возвращает результирующий вектор.
 Ссылки
 Teigha.Geometry.Vector3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!