Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.OsnapPointRef.IntIdPath
 Послать отзыв
 Свойство IntIdPath представляет полный путь подобъекта вторичной геометрии, связанной с данной точкой привязки.
 Синтаксис
C#
Visual Basic
Копировать Код
public FullSubentityPath IntIdPath;
Копировать Код
Public Property IntIdPath As FullSubentityPath
 Возвращает
 Возвращает полный путь подобъекта вторичной геометрии для данной точки привязки. Тип FullSubentityPath.
 Описание
 Свойство IntIdPath представляет полный путь подобъекта вторичной геометрии, связанной с данным объектом OsnapPointRef.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.OsnapPointRef, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!