Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Interval.Unbounded
 Послать отзыв
 Свойство Unbounded возвращает интервал, неограниченный с какой-либо одной стороны.
 Синтаксис
C#
Visual Basic
Копировать Код
public static Interval Unbounded;
Копировать Код
Public Shared ReadOnly Property Unbounded As Interval
 Возвращает
 Возвращает интервал, неограниченный с какой-либо одной стороны. Тип Interval.
 Описание
 Свойство Unbounded возвращает интервал, неограниченный с какой-либо одной стороны.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.Interval, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!