Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MentalRayRenderSettings.FGRayCount
 Послать отзыв
 Свойство FGRayCount представляет количество лучей, испускаемых из каждой точки в режиме финальной сборки.
 Синтаксис
C#
Visual Basic
Копировать Код
public int FGRayCount;
Копировать Код
Public Property FGRayCount As Integer
 Возвращает
 Возвращает количество лучей, испускаемых из каждой точки в режиме финальной сборки. Тип int.
 Описание
 Свойство FGRayCount представляет количество лучей, испускаемых из каждой точки в режиме финальной сборки (final gather).
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MentalRayRenderSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!