Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve3d
 Послать отзыв
 Этот абстрактный класс является базовым классом для всех трехмерных кривых.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Geometry::Entity3d Teigha::Geometry::Curve3d
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdGeCurve3d")] public abstract class Curve3d : Entity3d;
Копировать Код
<Wrapper("OdGeCurve3d")> Public abstract Class Curve3d Inherits Entity3d
 Описание
 Этот абстрактный класс является базовым классом для всех трехмерных кривых. Любой производный класс представляет трехмерную кривую.
 У класса есть следующие производные классы:
Teigha.Geometry.ElipticalArc3d,
Teigha.Geometry.ExternalCurve3d,
Teigha.Geometry.LinearEntity3d,
Teigha.Geometry.OffsetCurve3d,
Teigha.Geometry.SplineEntity3d,
Teigha.Geometry.SurfaceCurve2dTo3d.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Geometry.Entity3d
 Имя
 Описание
 Entity3d Методы
 Ниже перечислены методы класса Entity3d.
 Teigha.Geometry.Curve3d
 Имя
 Описание
 Curve3d Методы
 Ниже перечислены методы класса Curve3d.
 Curve3d Свойства
 Ниже перечислены свойства класса Curve3d.
 Ссылки
 Curve3d Методы, Curve3d Свойства, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!