Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 LayerTableRecord.Color
 Послать отзыв
 В свойстве хранится цвет слоя.
 Синтаксис
C#
Visual Basic
Копировать Код
public Color Color { get; set; }
Копировать Код
Public Property Color As Color
 Возвращает
 Возвращает тип данных Color.
 Описание
 В свойстве хранятся цвет слоя в виде типа данных Color. С помощью свойства можно получить текущий цвет, установленный в слое и изменить его.
 Цвет, установленный в слое, будет у всех объектов чертежа, расположенных на этом слое, если цвет этих объектов имеет значение «По слою».
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.LayerTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!