Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MentalRayRenderSettings.DiagnosticGridMode
 Послать отзыв
 Свойство DiagnosticGridMode представляет параметры диагностической сетки.
 Синтаксис
C#
Visual Basic
Копировать Код
public MentalRayRenderSettingsTraitsDiagnosticGridModeParameter DiagnosticGridMode;
Копировать Код
Public Property DiagnosticGridMode As MentalRayRenderSettingsTraitsDiagnosticGridModeParameter
 Возвращает
 Возвращает параметры диагностической сетки. Тип MentalRayRenderSettingsTraitsDiagnosticGridModeParameter.
 Описание
 Свойство DiagnosticGridMode представляет параметры диагностической сетки.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MentalRayRenderSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!