Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FitData.FitTolerance
 Послать отзыв
 Свойство возвращает допуск аппроксимации сплайна.
 Синтаксис
C#
Visual Basic
Копировать Код
public double FitTolerance;
Копировать Код
Public ReadOnly Property FitTolerance As Double
 Возвращает
 Возвращает допуск аппроксимации сплайна. Тип double.
 Описание
 Свойство возвращает допуск аппроксимации сплайна.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.FitData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!