Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.TypeOfCoordinates
 Послать отзыв
 Данное перечисление определяет типы координатных систем.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum TypeOfCoordinates { CoordinateTypeGeographic = 3, CoordinateTypeGrid = 2, CoordinateTypeLocal = 1, CoordinateTypeUnknown = 0 }
Копировать Код
Public Enum TypeOfCoordinates CoordinateTypeGeographic = 3 CoordinateTypeGrid = 2 CoordinateTypeLocal = 1 CoordinateTypeUnknown = 0 End Enum
 Члены
 Члены
 Описание
 CoordinateTypeGeographic
 Значение: 3. Географическая система координат.
 CoordinateTypeGrid
 Значение: 2. Плоская прямоугольная (прямолинейная) система координат.
 CoordinateTypeLocal
 Значение: 1. Локальная система координат.
 CoordinateTypeUnknown
 Значение: 0. Неизвестная система координат.
 Описание
 Данное перечисление определяет типы координатных систем.
 Ваши комментарии по поводу этого топика: Послать отзыв!