Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve3d.GetLength
 Послать отзыв
 Метод определяет длину вдоль кривой между двумя точками кривой, заданными параметрически.
 Синтаксис
C#
Visual Basic
Копировать Код
public double GetLength( double fromParameter, double toParameter, double tolerance );
Копировать Код
Public Function GetLength( fromParameter As Double, toParameter As Double, tolerance As Double ) As Double
 Параметры
 Параметры
 Описание
 fromParameter
 Начальный параметр. Тип double.
 toParameter
 Конечный параметр. Тип double.
 tolerance
 Точность вычислений. Тип double.
 Возвращает
 Возвращает длину вдоль кривой. Тип double.
 Описание
 Метод определяет длину вдоль кривой между двумя точками кривой, заданными параметрически.
 Ссылки
 Teigha.Geometry.Curve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!