Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор BlockReference.BlockReference (Point3d, DatabaseServices::ObjectId)
 Послать отзыв
 Синтаксис
C#
Visual Basic
public BlockReference(Point3d position, DatabaseServices::ObjectId blockTableRecord);
Public Sub New(position As Point3d, blockTableRecord As DatabaseServices.ObjectId)
 Параметры
 Параметры
 Описание
 position
 Позиция точки
 blockTableRecord
 Id BlockTableRecord для ссылки
 Описание
 Этот конструктор инициализирует ссылку на блок с использованием значением параметра position (в WCS) как позицию точки, blockTableRecord как ID записи таблицы блоков, масштабы по X, Y и Z равными 1.0, угол поворота, равным 0.0 и вектор нормали, равный (0,0,1).
 Ссылки
 Teigha.DatabaseServices.BlockReference, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!