Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Filters.LayerFilter.LayerCount
 Послать отзыв
 Свойство LayerCount возвращает количество слоев, зарегистрированных в данном фильтре.
 Синтаксис
C#
Visual Basic
Копировать Код
public int LayerCount;
Копировать Код
Public ReadOnly Property LayerCount As Integer
 Возвращает
 Возвращает количество слоев в данном фильтре. Тип int.
 Описание
 Свойство LayerCount возвращает количество слоев, зарегистрированных в данном фильтре.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Filters.LayerFilter, Teigha.DatabaseServices.Filters
 Ваши комментарии по поводу этого топика: Послать отзыв!