Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Spline.IsNull
 Послать отзыв
 Свойство IsNull позволяет проверить, что у данного сплайна нет управляющих вершин.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsNull;
Копировать Код
Public ReadOnly Property IsNull As Boolean
 Возвращает
 Возвращает true, если у данного сплайна нет управляющих вершин. В противном случае возвращает false.
 Описание
 Свойство IsNull позволяет проверить, что у данного сплайна нет управляющих вершин.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Spline, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!