Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector2d.IsEqualTo
 Послать отзыв
 Метод позволяет проверить, совпадает ли входной вектор с данным вектором.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsEqualTo( Vector2d vector );
Копировать Код
Public Function IsEqualTo( vector As Vector2d ) As Boolean
 Параметры
 Параметры
 Описание
 vector
 Проверяемый вектор. Тип Vector2d.
 Возвращает
 Возвращает true, если в пределах используемой точности совпадают все соответствующие координаты обоих векторов. В противном случае возвращает false.
 Описание
 Метод позволяет проверить, совпадает ли входной вектор с данным вектором. Реализация использует вызов Vector2d.IsEqualTo(Vector2d vector, Tolerance tolerance) с точностью по умолчанию Tolerance.EqualVector.
 Замечания
 Векторы считаются равными, если совпадают все соответствующие координаты обоих векторов.
 Ссылки
 Teigha.Geometry.Vector2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!