Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Viewport.GridSubdivisionRestricted
 Послать отзыв
 Свойство GridSubdivisionRestricted позволяет определить, запрещено ли дробление сетки мельче шага вспомогательных линий сетки в данном видовом экране.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool GridSubdivisionRestricted;
Копировать Код
Public Property GridSubdivisionRestricted As Boolean
 Возвращает
 Возвращает true, если дробление сетки мельче шага вспомогательных линий не допускается. В противном случае возвращает false.
 Описание
 Свойство GridSubdivisionRestricted позволяет определить, запрещено ли дробление сетки мельче шага вспомогательных линий сетки в данном видовом экране.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Viewport, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!