Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeaderStyle.DoglegLength
 Послать отзыв
 Свойство представляет длину полки мультивыноски, предусмотренную данным стилем.
 Синтаксис
C#
Visual Basic
Копировать Код
public double DoglegLength;
Копировать Код
Public Property DoglegLength As Double
 Возвращает
 Возвращает длину полки. Тип double.
 Описание
 Свойство представляет длину полки мультивыноски, предусмотренную данным стилем.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MLeaderStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!