Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CellContentsCollection.RemoveAt
 Послать отзыв
 Метод удаляет элемент коллекции с указанным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public void RemoveAt( int index );
Копировать Код
Public Sub RemoveAt( index As Integer )
 Параметры
 Параметры
 Описание
 index
 Индекс удаляемого элемента коллекции. Тип int.
 Описание
 Метод удаляет элемент коллекции с указанным индексом.
 Замечания
 Если переданный в метод индекс оказывается недействительным, выбрасывается исключение ArgumentOutOfRangeException.
 Ссылки
 Teigha.DatabaseServices.CellContentsCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!