Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MeshDataCollection
 Послать отзыв
 Структура MeshDataCollection предназначена для хранения результатов метода Teigha.DatabaseServices.SubDMesh.GetObjectMesh().
 Иерархия классов
Teigha::DatabaseServices::MeshDataCollection
 Синтаксис
C#
Visual Basic
Копировать Код
public struct MeshDataCollection
Копировать Код
Public Structure MeshDataCollection
 Описание
 Структура MeshDataCollection предназначена для хранения результатов метода Teigha.DatabaseServices.SubDMesh.GetObjectMesh(). Это представление сети содержит массивы вершин, граней, цветов граней и материалов.
 Методы
 Конструкторы
 Имя
 Описание
 MeshDataCollection
 Конструктор структуры MeshDataCollection.
 Топики
 Имя
 Описание
 MeshDataCollection Свойства
 Ниже перечислены свойства класса MeshDataCollection.
 Ссылки
 MeshDataCollection Свойства, Методы, Топики, MeshDataCollection Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!