Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.DimAssoc
 Послать отзыв
 Синтаксис
C#
Visual Basic
public int DimAssoc;
Public Property DimAssoc() As Integer
 Описание
 Возвращает или устанавливает текущее значение DIMASSOC для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!