Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MText.TrackChange
 Послать отзыв
 Свойство возвращает строку изменения трекинга "T", т.е. переход к другому межбуквенному расстоянию.
 Синтаксис
C#
Visual Basic
Копировать Код
public static String TrackChange;
Копировать Код
Public Shared ReadOnly Property TrackChange As String
 Возвращает
 Возвращает строку изменения трекинга. Тип String.
 Описание
 Свойство возвращает строку изменения трекинга "T", т.е. переход к другому межбуквенному расстоянию. Может использоваться вместо строковой константы "T", чтобы сделать код более понятным. При использовании в строке, возвращаемой свойством MText.Contents, "T" означает изменение межбуквенного расстояния.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.MText, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!