Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 ViewportTableRecord.SnapBase
 Послать отзыв
 Свойство предназначено для управления положением начальной точки сетки и привязки для текущего видового экрана и текущей ПСК.
 Синтаксис
C#
Visual Basic
public Point2d SnapBase;
Public Property SnapBase() As Point2d
 Возвращает
 Возвращает тип данных Point2d.
 Описание
 Свойство предназначено для управления положением начальной точки сетки и привязки для текущего видового экрана и текущей ПСК.
 Условия
 Чтение и запись.
 Ссылки
 ViewportTableRecord Класс, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!