Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Ole2Frame.getCompoundDocument
 Послать отзыв
 Метод выполняет запись данных составного документа в указанный поток.
 Синтаксис
C#
Visual Basic
Копировать Код
public void getCompoundDocument( ref Runtime.StreamBuf streamBuf );
Копировать Код
Public Sub getCompoundDocument( ByRef streamBuf As Runtime.StreamBuf )
 Параметры
 Параметры
 Описание
 streamBuf
 Буфер потока, в который выполняется запись данных. Тип Runtime.StreamBuf.
 Описание
 Метод выполняет запись данных составного документа в указанный поток.
 Ссылки
 Teigha.DatabaseServices.Ole2Frame, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!