Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Polyline2d.NonDBAppendVertex
 Послать отзыв
 Метод добавляет объект Vertex2d в список вершин полилинии и делает полилинию владельцем вершины. Полилиния не должна быть резидентной в базе данных.
 Синтаксис
C#
Visual Basic
Копировать Код
public NonDBAppendVertex( ref Vertex2d vertexToAppend );
Копировать Код
Public Sub NonDBAppendVertex( ByRef vertexToAppend As Vertex2d )
 Параметры
 Параметры
 Описание
 vertexToAppend
 Добавляемая в полилинию вершина, тип Vertex2d.
 Описание
 Метод добавляет объект Vertex2d в список вершин полилинии и делает полилинию владельцем вершины. Полилиния не должна быть резидентной в базе данных.
 Ссылки
 Teigha.DatabaseServices.Polyline2d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!