Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.Height
 Послать отзыв
 Данное свойство представляет полную высоту данной таблицы.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual double Height;
Копировать Код
Public virtual Property Height() As double
 Возвращает
 Возвращает или задает полную высоту данной таблицы, тип double.
 Описание
 Данное свойство представляет полную высоту данной таблицы.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!