Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DxfFiler.AtEndOfObject
 Послать отзыв
 Свойство позволяет определить, находится ли этот объект Filer в конце данных объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract bool AtEndOfObject;
Копировать Код
Public MustOverride ReadOnly Property AtEndOfObject As Boolean
 Возвращает
 Возвращает true, если указатель объекта Filer находится в конце данных объекта. В противном случае возвращает false.
 Описание
 Свойство позволяет определить, находится ли этот объект Filer в конце данных объекта.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.DxfFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!