Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Sun.SunDirection
 Послать отзыв
 Свойство SunDirection представляет направление от солнца к модели.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d SunDirection;
Копировать Код
Public Property SunDirection As Vector3d
 Возвращает
 Возвращает направление от солнца к модели. Тип Vector3d.
 Описание
 Свойство SunDirection представляет направление от солнца к модели.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Sun, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!