Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocArrayPathParameters.ItemSpacing
 Послать отзыв
 Свойство обеспечивает доступ к расстоянию между элементами массива.
 Синтаксис
C#
Visual Basic
Копировать Код
public double ItemSpacing;
Копировать Код
Public Property ItemSpacing() As Double
 Возвращает
 Возвращает расстояние между элементами массива. Тип double.
 Описание
 Свойство обеспечивает доступ к расстоянию между элементами массива.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.AssocArrayPathParameters, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!