Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.TransactionManager
 Послать отзыв
 Данный класс представляет системный менеджер транзакций.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::DatabaseServices::TransactionManager
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdDbTransactionManager")] public class TransactionManager : RXObject;
Копировать Код
<Wrapper("OdDbTransactionManager")> Public Class TransactionManager Inherits RXObject
 Описание
 При старте nanoCAD система NRX создает единственный объект класса TransactionManager. Этот менеджер транзакций как объект глобально доступен всем приложениям NRX.
 Системный менеджер транзакций - объект TransactionManager - используется для старта, завершения или прерывания транзакций. Кроме того, он предоставляет функционал для управления транзакциями и объектами в пределах транзакций.
 Методы
 Конструкторы
 Teigha.DatabaseServices.TransactionManager
 Имя
 Описание
 TransactionManager
 Конструктор.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.DatabaseServices.TransactionManager
 Имя
 Описание
 TransactionManager Методы
 Ниже перечислены методы класса TransactionManager.
 TransactionManager Свойства
 Ниже перечислены свойства класса TransactionManager.
 Ссылки
 TransactionManager Методы, TransactionManager Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!