Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MText.BackgroundFillColor
 Послать отзыв
 Свойство представляет цвет фоновой заливки данного объекта MText.
 Синтаксис
C#
Visual Basic
Копировать Код
public Teigha.Colors.Color BackgroundFillColor;
Копировать Код
Public Property BackgroundFillColor As Teigha.Colors.Color
 Возвращает
 Возвращает цвет фоновой заливки. Тип Teigha.Colors.Color.
 Описание
 Свойство представляет цвет фоновой заливки данного объекта MText.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MText, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!