Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.UnderlayReference.Height
 Послать отзыв
 Свойство Height представляет высоту данной подложки на чертеже.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Height;
Копировать Код
Public Property Height As Double
 Возвращает
 Возвращает высоту данной ссылки на подложку. Тип double.
 Описание
 Свойство Height представляет высоту данной подложки на чертеже.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.UnderlayReference, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!