Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Filters.LayerFilter
 Послать отзыв
 Класс реализует объекты LayerFilter в экземпляре базы данных Database.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::GraphicsInterface::Drawable Teigha::DatabaseServices::DBObject Teigha::DatabaseServices::Filters::Filter Teigha::DatabaseServices::Filters::LayerFilter
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("AcDbLayerFilter")] public class LayerFilter : Filter;
Копировать Код
<Wrapper("AcDbLayerFilter")> Public Class LayerFilter Inherits Filter
 Описание
 Класс предназначен для реализации объектов LayerFilter в экземпляре базы данных Database.
 LayerFilter представляет собой список слоев, объекты которых просматриваются во время обхода фильтруемого блока. Объекты LayerFilter могут дополнительно сохраняться в базе данных чертежа для эффективной загрузки по требованию внешних ссылок.
 Методы
 Конструкторы
 Teigha.GraphicsInterface.Drawable
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 Drawable
 Конструктор класса Teigha.GraphicsInterface.Drawable. (Унаследован от Drawable)
 Teigha.DatabaseServices.DBObject
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 DBObject
 Конструктор. (Унаследован от DBObject)
 Teigha.DatabaseServices.Filters.Filter
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 Filter
 Конструктор класса Filter. (Унаследован от Filter)
 Teigha.DatabaseServices.Filters.LayerFilter
 Имя
 Описание
 LayerFilter
 Конструктор класса LayerFilter по умолчанию.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.GraphicsInterface.Drawable
 Имя
 Описание
 Drawable Методы
 Ниже перечислены методы класса Drawable.
 Drawable Свойства
 Ниже перечислены свойства класса Drawable.
 Teigha.DatabaseServices.DBObject
 Имя
 Описание
 DBObject Методы
 Ниже перечислены методы класса DBObject.
 DBObject Свойства
 Ниже перечислены свойства класса DBObject.
 DBObject События
 Ниже перечислены события класса DBObject.
 Teigha.DatabaseServices.Filters.Filter
 Имя
 Описание
 Filter Свойства
 Ниже перечислены свойства класса Filter.
 Teigha.DatabaseServices.Filters.LayerFilter
 Имя
 Описание
 LayerFilter Методы
 Ниже перечислены методы класса LayerFilter.
 LayerFilter Свойства
 Ниже перечислены свойства класса LayerFilter.
 Ссылки
 LayerFilter Методы, LayerFilter Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства, DBObject События
 Ваши комментарии по поводу этого топика: Послать отзыв!