Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.RevolvedSurface.RevolveEntity
 Послать отзыв
 Свойство RevolveEntity представляет геометрию образующей данной поверхности вращения.
 Синтаксис
C#
Visual Basic
Копировать Код
public Entity RevolveEntity;
Копировать Код
Public ReadOnly Property RevolveEntity As Entity
 Возвращает
 Возвращает объект чертежа. Тип Entity.
 Описание
 Свойство RevolveEntity представляет геометрию образующей данной поверхности вращения. В этом качестве допускается использовать плоские кривые, области или плоские поверхности.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.RevolvedSurface, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!