Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DxfFiler.DxfFiler
 Послать отзыв
 Конструктор класса DxfFiler.
 Синтаксис
C#
Visual Basic
Копировать Код
public DxfFiler( IntPtr unmanagedObjPtr, bool autoDelete );
Копировать Код
Public Sub New( unmanagedObjPtr As IntPtr, autoDelete As Boolean )
 Параметры
 Параметры
 Описание
 autoDelete
 Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.
 unmanagedObjPtr
 Неуправляемый указатель на исходный объект. Тип IntPtr.
 Описание
 Конструктор класса DxfFiler.
 Ссылки
 Teigha.DatabaseServices.DxfFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!