Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbSurfaceDefinition.VKnots
 Послать отзыв
 Свойство VKnots представляет узловой вектор поверхности в направлении V.
 Синтаксис
C#
Visual Basic
Копировать Код
public KnotCollection VKnots;
Копировать Код
Public ReadOnly Property VKnots As KnotCollection
 Возвращает
 Возвращает узловой вектор в направлении V. Тип KnotCollection.
 Описание
 Свойство VKnots представляет узловой вектор поверхности в направлении V.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.NurbSurfaceDefinition, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!