Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Light.Shadow
 Послать отзыв
 Свойство представляет параметры тени для данного источника света.
 Синтаксис
C#
Visual Basic
Копировать Код
public ShadowParameters Shadow;
Копировать Код
Public Property Shadow As ShadowParameters
 Возвращает
 Возвращает параметры тени для источника света. Тип ShadowParameters.
 Описание
 Свойство представляет параметры тени для данного источника света.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Light, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!