Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Dimpost
 Послать отзыв
 Синтаксис
C#
Visual Basic
public String Dimpost;
Public Property Dimpost() As String
 Описание
 Возвращает или устанавливает текущее значение DIMPOST для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!