Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LineAngularDimension2.xLine2Start
 Послать отзыв
 Свойство представляет начальную точку второй опорной линии данного размера.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d xLine2Start;
Копировать Код
Public Property xLine2Start As Point3d
 Возвращает
 Возвращает начальную точку второй опорной линии размера. Тип Point3d.
 Описание
 Свойство представляет начальную точку второй опорной линии данного размера.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.LineAngularDimension2, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!