Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GeoLocationData.SetMeshPointMaps
 Послать отзыв
 Метод позволяет задать для сети GeoMesh новые коллекции исходных точек и точек назначения.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetMeshPointMaps( ref Point2dCollection sourcePts, ref Point2dCollection destPts );
Копировать Код
Public Sub SetMeshPointMaps( ByRef sourcePts As Point2dCollection, ByRef destPts As Point2dCollection )
 Параметры
 Параметры
 Описание
 sourcePts
 Входная коллекция исходных точек. Тип Point2dCollection.
 destPts
 Входная коллекция точек назначения. Тип Point2dCollection.
 Описание
 Метод позволяет задать для сети GeoMesh новые коллекции исходных точек и точек назначения.
 Ссылки
 Teigha.DatabaseServices.GeoLocationData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!