Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SubentityId.SubentityId
 Послать отзыв
 Конструктор структуры SubentityId. Создает экземпляр структуры с указанным классом подобъекта и целочисленным индексом подобъекта.
 Синтаксис
C#
Visual Basic
Копировать Код
[Obsolete("Use the overload taking IntPtr.")] public SubentityId( ref RXClass classType, long long i );
Копировать Код
<Obsolete("Use the overload taking IntPtr.")> Public Sub New( ByRef classType As RXClass, i As long long )
 Параметры
 Параметры
 Описание
 classType
 Класс подобъекта. Тип RXClass.
 i
 Индекс подобъекта. Тип long long.
 Описание
 Конструктор структуры SubentityId. Создает экземпляр структуры с указанным классом подобъекта и целочисленным индексом подобъекта.
 Замечания
 Устарел. Рекомендуется использовать перегрузку Teigha.DatabaseServices.SubentityId.SubentityId(RXClass, IntPtr).
 Ссылки
 Teigha.DatabaseServices.SubentityId, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!