Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DynamicDimensionData
 Послать отзыв
 Класс DynamicDimensionData поддерживает динамические размеры для производных от Entity объектов.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::DatabaseServices::DynamicDimensionData
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdDbDimData")] public class DynamicDimensionData : DisposableWrapper;
Копировать Код
<Wrapper("OdDbDimData")> Public Class DynamicDimensionData Inherits DisposableWrapper
 Описание
 Класс DynamicDimensionData поддерживает динамические размеры для производных от Entity объектов.
 Динамические размеры — это временные объекты размеров, которые можно вызывать и отображать при создании новых объектов базы данных или резидентных объектов базы данных с функционалом редактирования посредством ручек.
 Методы
 Конструкторы
 Teigha.DatabaseServices.DynamicDimensionData
 Имя
 Описание
 DynamicDimensionData
 Это обзор перегрузок DynamicDimensionData.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.DatabaseServices.DynamicDimensionData
 Имя
 Описание
 DynamicDimensionData Методы
 Ниже перечислены методы класса DynamicDimensionData.
 DynamicDimensionData Свойства
 Ниже перечислены свойства класса DynamicDimensionData.
 Ссылки
 DynamicDimensionData Конструктор, DynamicDimensionData Методы, DynamicDimensionData Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!