Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeader.EnableAnnotationScale
 Послать отзыв
 Свойство позволяет проверить, включено ли масштабирование аннотаций для данной мультивыноски.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool EnableAnnotationScale;
Копировать Код
Public Property EnableAnnotationScale As Boolean
 Возвращает
 Возвращает true, если масштабирование аннотаций включено. В противном случае возвращает false.
 Описание
 Свойство позволяет проверить, включено ли масштабирование аннотаций для данной мультивыноски.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MLeader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!