Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Material.Reflectivity
 Послать отзыв
 Свойство представляет степень отражающей способности этого материала.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual double Reflectivity;
Копировать Код
Public Overridable Property Reflectivity As Double
 Возвращает
 Возвращает отражающую способность материала. Тип double.
 Описание
 Свойство представляет степень отражающей способности этого материала. Более высокие значения характерны для материалов с более высокой отражающей способностью.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Material, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!