Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.TableTemplate.TableTemplate
 Послать отзыв
 Конструктор класса TableTemplate. Создает экземпляр класса с указанными параметрами.
 Синтаксис
C#
Visual Basic
Копировать Код
public TableTemplate( ref Table table, TableCopyOptions copyOption );
Копировать Код
Public Sub New( ByRef table As Table, copyOption As TableCopyOptions )
 Параметры
 Параметры
 Описание
 table
 Таблица, на основе которой создается шаблон. Тип Table.
 copyOption
 Опции копирования, определяющие, что именно требуется захватывать из шаблона. Перечисление TableCopyOptions.
 Описание
 Конструктор класса TableTemplate. Создает экземпляр класса с указанными параметрами.
 Ссылки
 Teigha.DatabaseServices.TableTemplate, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!