Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeader.GetLeaderIndex
 Послать отзыв
 Метод предоставляет возможность получить индекс кластера, в котором содержится линия выноски с указанным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public int GetLeaderIndex( int leaderLineIndex );
Копировать Код
Public Function GetLeaderIndex( leaderLineIndex As Integer ) As Integer
 Параметры
 Параметры
 Описание
 leaderLineIndex
 Индекс линии выноски. Тип int.
 Возвращает
 Возвращает индекс кластера с искомой выносной линией. Тип int.
 Описание
 Метод позволяет получить индекс кластера, в котором содержится линия выноски с указанным индексом.
 Ссылки
 Teigha.DatabaseServices.MLeader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!