Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.EllipticalCone.HalfAngle
 Послать отзыв
 Свойство HalfAngle представляет текущее значение половинного угла данного конуса.
 Синтаксис
C#
Visual Basic
Копировать Код
public double HalfAngle;
Копировать Код
Public ReadOnly Property HalfAngle As Double
 Возвращает
 Возвращает значение половинного угла данного эллиптического конуса. Тип double.
 Описание
 Свойство HalfAngle представляет текущее значение половинного угла данного эллиптического конуса.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.EllipticalCone, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!