Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Hatch.IsGradient
 Послать отзыв
 Синтаксис
C#
Visual Basic
public bool IsGradient;
Public Property IsGradient() As bool
 Описание
 Возвращает признак того, что объект имеет градиент.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.Hatch, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!