Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.GetScale
 Послать отзыв
 Метод позволяет определить масштаб указанного элемента содержимого ячейки.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual double GetScale( int row, int column, int contentIndex );
Копировать Код
Public virtual Function GetScale( row As Integer, column As Integer, contentIndex As Integer ) As double
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 contentIndex
 Индекс элемента содержимого ячейки, тип int. Индекс должен быть больше или равен нулю и меньше количества элементов содержимого в ячейке.
 col
 Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
 Возвращает
 Возвращает масштаб, тип double.
 Описание
 Метод позволяет определить масштаб указанного элемента содержимого ячейки. Элемент задается его индексом в коллекции содержимого ячейки.
 Замечания
 Для получения того же результата предпочтительнее использовать свойство Table.Cells[row,column].Contents[i].Scale.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!