Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LayoutManager
 Послать отзыв
 Этот интерфейсный класс обслуживает специфичные для базы данных процедуры, которые управляют объектами листа и предоставляют к ним доступ.
 Иерархия классов
Teigha::DatabaseServices::LayoutManager
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdDbLayoutManager")] public class LayoutManager : RXObject;
Копировать Код
<Wrapper("OdDbLayoutManager")> Public Class LayoutManager Inherits RXObject
 Описание
 Этот интерфейсный класс обслуживает специфичные для базы данных процедуры, которые управляют объектами листа и предоставляют к ним доступ.
 Топики
 Имя
 Описание
 LayoutManager Методы
 Ниже перечислены методы класса LayoutManager.
 LayoutManager Свойства
 Ниже перечислены свойства класса LayoutManager.
 LayoutManager События
 Ниже перечислены события класса LayoutManager.
 Ссылки
 LayoutManager Методы, LayoutManager Свойства, LayoutManager События, Топики, LayoutManager Методы, LayoutManager Свойства, LayoutManager События
 Ваши комментарии по поводу этого топика: Послать отзыв!