Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Делегат Teigha.DatabaseServices.BeginWblockBlockEventHandler
 Послать отзыв
 This is type Teigha::DatabaseServices::BeginWblockBlockEventHandler.
 Синтаксис
C#
Visual Basic
public delegate BeginWblockBlockEventHandler();
Public Delegate Sub BeginWblockBlockEventHandler()
 Ваши комментарии по поводу этого топика: Послать отзыв!