Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Класс Teigha.DatabaseServices.ViewportTableRecord
 Послать отзыв
 Класс предназначен для хранения определения видового экрана в таблице видовых экранов пространства модели ViewportTable.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::GraphicsInterface::Drawable Teigha::DatabaseServices::DBObject Teigha::DatabaseServices::SymbolTableRecord Teigha::DatabaseServices::AbstractViewTableRecord Teigha::DatabaseServices::ViewportTableRecord
 Синтаксис
C#
Visual Basic
[Wrapper("AcDbViewportTableRecord")] public class ViewportTableRecord : AbstractViewTableRecord;
<Wrapper("AcDbViewportTableRecord")> Public Class ViewportTableRecord Inherits AbstractViewTableRecord
 Описание
 Класс предназначен для хранения определения видового экрана в таблице видовых экранов ViewportTable. Определение видового экрана представляет из себя набор его настроек. В пространстве модели может быть несколько видовых экранов одновременно. Видовые экраны пространства модели всегда квадратные или прямоугольные и заполняют собой всё пространство модели. Каждый видовой экран пространства модели может иметь свои настройки отображения модели: система координат, направление взгляда, стиль отображения и пр. Управление настройками видового экрана возможно как через API, так и через пользовательский интерфейс. Все настройки, доступные через пользовательский интерфейс, также доступны и через API.
 Пример
 В качестве примера приведена команда ADDHORIZONTALVP_MS, которая делит активный видовой экран пространства модели на два горизонтальных.
C#
 Копировать Код
public partial class Commands { [Teigha.Runtime.CommandMethod("AddHorizontalVP_MS")] public void AddRemoveViewport_MS() { // Получение ссылки на активный документ HostMgd.ApplicationServices.Document doc = HostMgd.ApplicationServices.Application.DocumentManager.MdiActiveDocument; // Получение ссылки на редактор докумена HostMgd.EditorInput.Editor ed = doc.Editor; // Получение ссылки на базу данных документа Teigha.DatabaseServices.Database db = doc.Database; Teigha.DatabaseServices.Viewport viewport = new Teigha.DatabaseServices.Viewport(); // Начало транзакции с базой данных документа using (Teigha.DatabaseServices.Transaction trans = db.TransactionManager.StartTransaction()) { // Открываем таблицу видовых экранов для чтения Teigha.DatabaseServices.ViewportTable VPTable = trans.GetObject(db.ViewportTableId, Teigha.DatabaseServices.OpenMode.ForWrite) as Teigha.DatabaseServices.ViewportTable; // Открываем активный видовой экран для записи, чтобы разделить его на два горизонтальных видовых экрана ViewportTableRecord activeVP = trans.GetObject(db.CurrentViewportTableRecordId, OpenMode.ForWrite) as ViewportTableRecord; ed.WriteMessage($"Active VP name {activeVP.Name}, UpperRightCorner ({activeVP.UpperRightCorner.X},{activeVP.UpperRightCorner.Y}), LowerLeftCorner ({activeVP.LowerLeftCorner.X},{activeVP.LowerLeftCorner.Y})"); // Создаем новый видовой экран, копируем в него настройки из активного видового экрана Teigha.DatabaseServices.ViewportTableRecord VPTableRecord = new Teigha.DatabaseServices.ViewportTableRecord(); VPTableRecord.CopyFrom(activeVP); // Теперь нужно изменить координаты верхнего правого и нижнего левого углов у нового видового экрана VPTableRecord.UpperRightCorner = new Teigha.Geometry.Point2d(activeVP.UpperRightCorner.X, (activeVP.LowerLeftCorner.Y+activeVP.UpperRightCorner.Y)/2); VPTableRecord.LowerLeftCorner = activeVP.LowerLeftCorner; // И уменьшить активный видовой экран, так как мы поделили его пополам, изменив координаты его нижнего левого угла activeVP.LowerLeftCorner = new Teigha.Geometry.Point2d(activeVP.LowerLeftCorner.X, (activeVP.UpperRightCorner.Y + activeVP.LowerLeftCorner.Y) / 2); // Добавляем новый видовой экран в таблице видовых экранов VPTable.Add(VPTableRecord); // Завершаем транзакцию trans.Commit(); } // Принудительно обновляем сетку видовых экранов ed.UpdateTiledViewportsFromDatabase(); } }
 Пусть до вызова команды в пространстве модели был один видовой экран:
 После вызова команды ADDHORIZONTALVP_MS видовой экран будет разбит на два горизонтальных экрана:
 Если вызвать команду ADDHORIZONTALVP_MS ещё раз, то активный видовой экран будет разбит на два горизонтальных видовых экрана:
 Методы
 Конструкторы
 Teigha.GraphicsInterface.Drawable
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 Drawable
 Конструктор класса Teigha.GraphicsInterface.Drawable. (Унаследован от Drawable)
 Teigha.DatabaseServices.DBObject
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 DBObject
 Конструктор. (Унаследован от DBObject)
 Teigha.DatabaseServices.SymbolTableRecord
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 SymbolTableRecord
 This is SymbolTableRecord, a member of class SymbolTableRecord. (Унаследован от SymbolTableRecord)
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.GraphicsInterface.Drawable
 Имя
 Описание
 Drawable Методы
 Ниже перечислены методы класса Drawable.
 Drawable Свойства
 Ниже перечислены свойства класса Drawable.
 Teigha.DatabaseServices.DBObject
 Имя
 Описание
 DBObject Методы
 Ниже перечислены методы класса DBObject.
 DBObject Свойства
 Ниже перечислены свойства класса DBObject.
 DBObject События
 Ниже перечислены события класса DBObject.
 Teigha.DatabaseServices.SymbolTableRecord
 Имя
 Описание
 SymbolTableRecord Свойства
 Ниже перечислены свойства класса SymbolTableRecord.
 Teigha.DatabaseServices.AbstractViewTableRecord
 Имя
 Описание
 AbstractViewTableRecord Методы
 Ниже перечислены методы класса AbstractViewTableRecord.
 AbstractViewTableRecord Свойства
 Ниже перечислены свойства класса AbstractViewTableRecord.
 Класс Teigha.DatabaseServices.ViewportTableRecord
 Имя
 Описание
 ViewportTableRecord Методы
 Ниже перечислены методы класса ViewportTableRecord.
 ViewportTableRecord Свойства
 Ниже перечислены свойства класса ViewportTableRecord.
 Ссылки
 ViewportTableRecord Методы, ViewportTableRecord Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства, DBObject События
 Ваши комментарии по поводу этого топика: Послать отзыв!