Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.SetCellStyle
 Послать отзыв
 Метод позволяет задать стиль ячейки для конкретной ячейки, целой строки или всего столбца.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetCellStyle( int row, int column, ref String styleName );
Копировать Код
Public virtual Sub SetCellStyle( row As Integer, column As Integer, ByRef styleName As String )
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс может равняться -1.
 styleName
 Имя стиля ячейки, тип String. Этот стиль должен существовать в наборе табличных стилей таблицы.
 col
 Индекс столбца, тип int. Индекс может равняться -1.
 Описание
 Метод позволяет задать стиль ячейки для конкретной ячейки, целой строки или всего столбца.
 Замечания
 Чтобы указать ячейку, следует задать допустимые индексы строки и столбца. Чтобы указать строку, следует задать допустимый индекс строки и -1 в качестве индекса столбца. Чтобы указать столбец, следует задать допустимый индекс столбца и -1 в качестве индекса строки.
 Для получения того же результата предпочтительнее использовать Table.Cells[row,column].Style.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!