Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Database.GetHostDwgXrefGraph
 Послать отзыв
 Синтаксис
C#
Visual Basic
public XrefGraph GetHostDwgXrefGraph(bool includeGhosts);
Public Function GetHostDwgXrefGraph(includeGhosts As bool) As XrefGraph
 Параметры
 Параметры
 Описание
 includeGhosts
 Признак разрешения повторных вершин (если он установлен в true)
 Описание
 Возвращает вершину, ассоциированную с узлом чертежа.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!