Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Ellipse.MinorAxis
 Послать отзыв
 Свойство MinorAxis возвращает направление малой оси эллипса или эллиптической дуги.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d MinorAxis;
Копировать Код
Public ReadOnly Property MinorAxis As Vector3d
 Возвращает
 Возвращает направление малой оси эллипса. Тип Vector3d.
 Описание
 Свойство MinorAxis возвращает направление малой оси эллипса или эллиптической дуги.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Ellipse, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!