Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Matrix2d
 Послать отзыв
 Структура Matrix2d представляет двумерное афинное геометрическое преобразование (перемещение, вращение, масштабирование).
 Иерархия классов
Teigha::Geometry::Matrix2d
 Синтаксис
C#
Visual Basic
Копировать Код
[DefaultMember("ElementAt")] [Wrapper("OdGeMatrix2d")] public struct Matrix2d : IFormattable
Копировать Код
<DefaultMember("ElementAt")> <Wrapper("OdGeMatrix2d")> Public Structure Matrix2d Implements IFormattable
 Описание
 Структура Matrix2d представляет двумерное афинное геометрическое преобразование (перемещение, вращение, масштабирование).
 Объекты Matrix2d можно рассматривать как двумерные массивы размерности 3х3.
 Матрица преобразования M имеет вид
a00 a01 t0 a10 a11 t1 0 0 1
 Так называемую линейную часть матрицы M составляют элементы
a00 a01 a10 a11
 Трансляционную часть матрицы M образует столбец
t0 t1
 Нижняя строка матрицы не используется.
 Преобразование двумерной точки P описывается матричным произведением M x P, где точка P представлена столбцом (p.x, p.y, 1.0)^T. Преобразование 2D-вектора V описывается матричным произведением M x V, где вектор V представлен столбцом (v.x, v.y, 0.0)^T.
 Всякую матрицу M можно использовать для описания системы координат. Такая система координат имеет начало в точке (t0, t1) и орты (a00, a10) и (a01, a11). Матрица описывает преобразование координат из стандартной системы координат с началом (0, 0) и осями (1, 0) и (0, 1).
 Методы
 Конструкторы
 Имя
 Описание
 Matrix2d
 Конструктор структуры Matrix2d. Создает матрицу, элементы которой сформированы на основе данных из переданного массива.
 Топики
 Имя
 Описание
 Matrix2d Методы
 Ниже перечислены методы класса Matrix2d.
 Matrix2d Операторы
 Ниже перечислены операторы класса Matrix2d.
 Matrix2d Свойства
 Ниже перечислены свойства класса Matrix2d.
 Ссылки
 Matrix2d Методы, Matrix2d Операторы, Matrix2d Свойства, Методы, Топики, Matrix2d Методы, Matrix2d Операторы, Matrix2d Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!