Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Cone.Apex
 Послать отзыв
 Свойство Apex представляет вершину данного конуса.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d Apex;
Копировать Код
Public ReadOnly Property Apex As Point3d
 Возвращает
 Возвращает вершину данного конуса. Тип Point3d.
 Описание
 Свойство Apex представляет вершину данного конуса.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.Cone, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!