Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Graph.ClearAll
 Послать отзыв
 Метод предназначен для очистки битовых флагов во всех узлах графа.
 Синтаксис
C#
Visual Basic
Копировать Код
public void ClearAll( unsigned char flags );
Копировать Код
Public Sub ClearAll( flags As unsigned char )
 Параметры
 Параметры
 Описание
 flags
 Входные битовые флаги, которые следует очистить во всех узлах графа. Тип unsigned char.
 Описание
 Метод предназначен для очистки битовых флагов во всех узлах графа. Аргумент flags должен представлять собой комбинацию следующих битовых флагов:
 Имя бита
 Значение Описание
 _____________
 _________ ____________________________________________________
 kNone
 0x00 Значение не задано.
 kVisited
 0x01 Используется внутренним механизмом метода FindCycles() и в процессе обхода циклического графа.
 kOutsideRefed
 0x02 Используется в процессе отключения внешних ссылок Xref.
 kSelected
 0x04 Выделение пользователем. Устанавливается в методе GetOutgoing().
 kInList
 0x08 Присутствует в списке. Устанавливается в методе GetOutgoing().
 kListAll
 0x0E Используется для очистки флагов Selected, InList, OutsideRefed.
 kFirstLevel
 0x10 Узел первого уровня, связан с корневым узлом графа. Только для чтения.
 kUnresTree
 0x20 Дерево не разрешимо.
 kAll
 0x2F Используется для очистки всех флагов, кроме FirstLevel.
 Ссылки
 Teigha.DatabaseServices.Graph, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!