Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotSettingsValidator.SetPlotWindowArea
 Послать отзыв
 Метод задает углы рамки, определяющей печатаемую область чертежа для указанного объекта PlotSettings.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetPlotWindowArea( ref PlotSettings plotSet, Extents2d windowArea );
Копировать Код
Public Sub SetPlotWindowArea( ByRef plotSet As PlotSettings, windowArea As Extents2d )
 Параметры
 Параметры
 Описание
 plotSet
 Входной объект PlotSettings с настройками печати.
 windowArea
 Границы рамки. Тип Extents2d.
 Описание
 Метод задает углы рамки, определяющей печатаемую область чертежа для указанного объекта PlotSettings.
 Замечания
 Границы рамки учитываются и используются только тогда, когда тип печати принимает значение PlotType.Window.
 Ссылки
 Teigha.DatabaseServices.PlotSettingsValidator, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!