Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Делегат Teigha.DatabaseServices.ObjectErasedEventHandler
 Послать отзыв
 This is type Teigha::DatabaseServices::ObjectErasedEventHandler.
 Синтаксис
C#
Visual Basic
public delegate ObjectErasedEventHandler();
Public Delegate Sub ObjectErasedEventHandler()
 Ваши комментарии по поводу этого топика: Послать отзыв!