Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DbDictionaryEnumerator.MoveNext
 Послать отзыв
 Метод выполняет переход перечислителя к следующей записи в коллекции, в случае успеха возвращает true.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool MoveNext();
Копировать Код
Public Function MoveNext() As Boolean
 Возвращает
 Возвращает true, если запись найдена. В противном случае возвращает false.
 Описание
 Метод пытается осуществить переход перечислителя к следующей записи в коллекции. Возвращает логическое значение в зависимости от успеха этой операции.
 Ссылки
 Teigha.DatabaseServices.DbDictionaryEnumerator, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!