Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CellRange.Create
 Послать отзыв
 Метод создает диапазон ячеек, заключенный между двумя строками и двумя столбцами таблицы.
 Синтаксис
C#
Visual Basic
Копировать Код
public CellRange Create( ref Table table, int topRow, int leftColumn, int bottomRow, int rightColumn );
Копировать Код
Public Function Create( ByRef table As Table, topRow As Integer, leftColumn As Integer, bottomRow As Integer, rightColumn As Integer ) As CellRange
 Параметры
 Параметры
 Описание
 table
 Таблица, содержащая ячейки, из которых следует сформировать диапазон ячеек. Тип Table.
 topRow
 Индекс верхней строки диапазона ячеек. Тип int.
 leftColumn
 Индекс левого столбца диапазона ячеек. Тип int.
 bottomRow
 Индекс нижней строки диапазона ячеек. Тип int.
 rightColumn
 Индекс правого столбца диапазона ячеек. Тип int.
 Возвращает
 Возвращает диапазон ячеек таблицы в указанных границах. Тип CellRange.
 Описание
 Метод создает диапазон ячеек, заключенный между двумя строками и двумя столбцами таблицы.
 Ссылки
 Teigha.DatabaseServices.CellRange, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!