Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CurveBoundary.CurveBoundary
 Послать отзыв
 Конструктор класса CurveBoundary. Создает экземпляр класса с указанными параметрами.
 Синтаксис
C#
Visual Basic
Копировать Код
public CurveBoundary( int numberOfCurves, ref Curve3d[] curve3d, ref Curve2d[] curve2d, bool orientation3d, bool orientation2d );
Копировать Код
Public Sub New( numberOfCurves As Integer, ByRef curve3d() As Curve3d, ByRef curve2d() As Curve2d, orientation3d As Boolean, orientation2d As Boolean )
 Параметры
 Параметры
 Описание
 numberOfCurves
 Количество кривых в данной криволинейной границе. Тип int.
 curve3d
 Массив 3D-кривых каждого элемента в криволинейной границе. Тип Curve3d[].
 curve2d
 Массив 2D-кривых каждого элемента в криволинейной границе. Тип Curve2d[].
 orientation3d
 Флаг ориентации для каждого элемента 3D-кривой (обычная или обратная). Имеет смысл только если аргумент curve3d не равен NULL. Тип bool.
 orientation2d
 Флаг ориентации для каждого элемента 2D-кривой (обычная или обратная). Имеет смысл только если аргумент curve2d не равен NULL. Тип bool.
 Описание
 Конструктор класса CurveBoundary. Создает экземпляр класса с указанными параметрами.
 Ссылки
 Teigha.Geometry.CurveBoundary, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!