Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SymbolTableEnumerator.Current
 Послать отзыв
 Свойство Current представляет текущую запись перечислителя в таблице символов.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual ObjectId Current;
Копировать Код
Public Overridable ReadOnly Property Current As ObjectId
 Возвращает
 Возвращает идентификатор текущей записи в таблице символов. Тип ObjectId.
 Описание
 Свойство Current представляет текущую запись перечислителя в таблице символов.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.SymbolTableEnumerator, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!