Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.DimensionStyle
 Послать отзыв
 Свойство задает или возвращает ObjectId для объекта DimStyleTableRecord, который связан с данным объектом Dimension.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.ObjectId DimensionStyle;
Копировать Код
Public Property DimensionStyle As DatabaseServices.ObjectId
 Возвращает
 Возвращает идентификатор записи в таблице размерных стилей. Тип DatabaseServices.ObjectId.
 Описание
 Свойство задает или возвращает идентификатор ObjectId для объекта DimStyleTableRecord, который связан с данным объектом Dimension.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!