Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DataLinkManager.GetDataLink
 Послать отзыв
 Метод позволяет получить идентификатор объекта ObjectId внешней ссылки с указанным именем.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectId GetDataLink( ref String name );
Копировать Код
Public Function GetDataLink( ByRef name As String ) As ObjectId
 Параметры
 Параметры
 Описание
 name
 Имя внешней ссылки. Тип String.
 Возвращает
 Возвращает идентификатор объекта внешней ссылки. Тип ObjectId.
 Описание
 Метод позволяет получить идентификатор объекта ObjectId внешней ссылки с указанным именем.
 Ссылки
 Teigha.DatabaseServices.DataLinkManager, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!