Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObject.DBObject(IntPtr,bool)
 Послать отзыв
 Конструктор.
 Синтаксис
C#
Visual Basic
Копировать Код
public DBObject( IntPtr unmanagedObjPtr, bool autoDelete );
Копировать Код
Public Sub New( unmanagedObjPtr As IntPtr, autoDelete As Boolean )
 Параметры
 Параметры
 Описание
 autoDelete
 Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.
 unmanagedPointer
 Указатель на объект; тип IntPtr.
 Описание
 Конструктор.
 Ссылки
 Teigha.DatabaseServices.DBObject, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!