Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GroundPlaneBackground.ColorSkyZenith
 Послать отзыв
 Свойство предоставляет доступ к цвету неба в зените.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual EntityColor ColorSkyZenith;
Копировать Код
Public Overridable Property ColorSkyZenith As EntityColor
 Возвращает
 Возвращает цвет объекта. Тип EntityColor.
 Описание
 Свойство предоставляет доступ к цвету неба в зените (над наблюдателем).
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.GroundPlaneBackground, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!