Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Оператор TableRegion.!=
 Послать отзыв
 This is !=, a member of class TableRegion.
 Синтаксис
C#
Visual Basic
public bool operator !=(TableRegion t1, TableRegion t2);
Public Operator !=(t1 As TableRegion, t2 As TableRegion)
 Ссылки
 TableRegion Класс, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!