Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Viewport.FreezeLayersInViewport
 Послать отзыв
 Метод позволяет заморозить указанные слои в данном видовом экране.
 Синтаксис
C#
Visual Basic
Копировать Код
public void FreezeLayersInViewport( ref System.Collections.IEnumerator layerIds );
Копировать Код
Public Sub FreezeLayersInViewport( ByRef layerIds As System.Collections.IEnumerator )
 Параметры
 Параметры
 Описание
 layerIds
 Список идентификаторов слоёв, которые должны быть заморожены. Тип System.Collections.IEnumerator.
 Описание
 Метод позволяет заморозить указанные слои в данном видовом экране.
 Замечания
 На другие видовые экраны данный метод влияние не оказывает.
 Ссылки
 Teigha.DatabaseServices.Viewport, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!