Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.SurfaceSurfaceIntersector.GetDimension
 Послать отзыв
 Метод предоставляет геометрическую размерность (точка или кривая) пересечения с указанным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public int GetDimension( int number );
Копировать Код
Public Function GetDimension( number As Integer ) As Integer
 Параметры
 Параметры
 Описание
 number
 Индекс пересечения. Индексация начинается с нуля. Тип int.
 Возвращает
 Возвращает 0, если пересечение представлено точкой, и 1, если пересечением является кривая. Тип int.
 Описание
 Метод предоставляет геометрическую размерность (точка или кривая) пересечения с указанным индексом.
 Замечания
 Метод выбрасывает исключения kXXUnknown, если данный объект пересечения еще не был инициализирован, и kXXIndexOutOfRange, если указанный методу индекс является недействительным.
 Ссылки
 Teigha.Geometry.SurfaceSurfaceIntersector, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!