Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 DimStyleTableRecord.Dimjust
 Послать отзыв
 Свойство отвечает за горизонтальную позицию размерного текста.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual int Dimjust { get; set; }
Копировать Код
Public Overridable Property Dimjust As Integer
 Возвращает
 Возвращает тип данных int.
 Возвращаемые значения
 Возвращаемые значения
 Описание
 0
 размещение размерного текста по горизонтали - по центру над размерной линией (по умолчанию);
 1
 размещение размерного текста по горизонтали - у 1-й выносной линии;
 2
 размещение размерного текста по горизонтали - у 2-й выносной линии;
 3
 размещение размерного текста по горизонтали - над 1-й выносной линией;
 4
 размещение размерного текста по горизонтали - над 2-й выносной линией.
 Описание
 В свойстве хранится настройка размещения размерного текста по горизонтали в виде числа int. Возможны следующие значения:
0 – по центру над размерной линией (по умолчанию);
1 – у 1-й выносной линии;
2 – у 2-й выносной линии;
3 – над 1-й выносной линией;
4 – над 2-й выносной линией.
 Свойство также доступно через системную переменную DIMJUST и пользовательское меню в окне изменения/создания размерного стиля:
  При изменении системной переменной DIMJUST будет создан новый размерный стиль под названием <переопределение> на основе текущего с новым значением DIMJUST.
 Условия
 Чтение и запись.
 Пример
 Пример изменения горизонтальной позиции размерного текста (значения свойства Dimjust) в размерном стиле Standard:
C#
 Копировать Код
public partial class Commands { [Teigha.Runtime.CommandMethod("DimjustChange")] public void DimjustStandardDimStyle() { // Получение ссылки на активный документ HostMgd.ApplicationServices.Document doc = HostMgd.ApplicationServices.Application.DocumentManager.MdiActiveDocument; // Получение ссылки на редактор документа HostMgd.EditorInput.Editor ed = doc.Editor; // Получение ссылки на базу данных документа Teigha.DatabaseServices.Database db = doc.Database; // Начало транзакции с базой данных документа using (Teigha.DatabaseServices.Transaction trans = db.TransactionManager.StartTransaction()) { // Открываем таблицу размерных стилей для чтения Teigha.DatabaseServices.DimStyleTable dimStyleTable = trans.GetObject(db.DimStyleTableId, Teigha.DatabaseServices.OpenMode.ForRead) as Teigha.DatabaseServices.DimStyleTable; // Находим в таблице размерных стилей ObjectId нужного стиля по его названию Teigha.DatabaseServices.ObjectId styleId = dimStyleTable["Standard"]; // Открываем таблицу размерного стиля для изменений Teigha.DatabaseServices.DimStyleTableRecord obj = trans.GetObject(styleId, Teigha.DatabaseServices.OpenMode.ForWrite) as Teigha.DatabaseServices.DimStyleTableRecord; ed.WriteMessage($"nDimjust before: {obj.Dimjust}"); // Изменяем положение размерного текста по горизонтали obj.Dimjust = 3; ed.WriteMessage($"nDimjust after: {obj.Dimjust}"); trans.Commit(); } } }
 Результат работы команды DimjustChange:
 Было:
 Стало:
 Ссылки
 Teigha.DatabaseServices.DimStyleTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!