Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MText.OverlineOff
 Послать отзыв
 Свойство возвращает строку перехода к незачёркнутому тексту "o".
 Синтаксис
C#
Visual Basic
Копировать Код
public static String OverlineOff;
Копировать Код
Public Shared ReadOnly Property OverlineOff As String
 Возвращает
 Возвращает строку перехода к незачёркнутому тексту. Тип String.
 Описание
 Свойство возвращает строку перехода к незачёркнутому тексту "o". Может использоваться вместо строковой константы "o", чтобы сделать код более понятным. При использовании в строке, возвращаемой свойством MText.Contents, "o" означает переход к незачёркнутому тексту.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.MText, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!