Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CircularArc3d.Set
 Послать отзыв
 Метод позволяет переопределить данную дугу так, чтобы она была касательной к трем указанным 3D-кривым.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Set( ref Curve3d curve1, ref Curve3d curve2, ref Curve3d curve3, double param1, double param2, double param3 );
Копировать Код
Public Sub Set( ByRef curve1 As Curve3d, ByRef curve2 As Curve3d, ByRef curve3 As Curve3d, param1 As Double, param2 As Double, param3 As Double )
 Параметры
 Параметры
 Описание
 curve1
 Первая 3D-кривая, задающая условие касательности дуги. Тип Curve3d.
 curve2
 Вторая 3D-кривая, задающая условие касательности дуги. Тип Curve3d.
 curve3
 Третья 3D-кривая, задающая условие касательности дуги. Тип Curve3d.
 param1
 Возвращает параметр, соответствующий точке касания на кривой curve1. Тип double.
 param2
 Возвращает параметр, соответствующий точке касания на кривой curve2. Тип double.
 param3
 Возвращает параметр, соответствующий точке касания на кривой curve3. Тип double.
 Описание
 Метод позволяет переопределить данную дугу так, чтобы она была касательной к трем указанным 3D-кривым.
 Замечания
 Если круглую дугу с указанными требованиями построить не удаётся, то данная дуга будет оставлена без изменений.
 Ссылки
 Teigha.Geometry.CircularArc3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!