Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Polyline.HasBulges
 Послать отзыв
 Синтаксис
C#
Visual Basic
public bool HasBulges;
Public Property HasBulges() As bool
 Описание
 Возвращает признак того, что установлен коэффициент выпуклости для любого из сегментов полиллинии. Этот коэффициент требуется для сегментов дуг полилинии.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.Polyline, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!