Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.EdgeRef.Curve
 Послать отзыв
 Свойство Curve задает или возвращает кривую Curve3d, на основе которой была создана данная ссылка на ребро.
 Синтаксис
C#
Visual Basic
Копировать Код
public Curve3d Curve;
Копировать Код
Public Property Curve As Curve3d
 Возвращает
 Возвращает кривую, на основе которой была создана данная ссылка на ребро. Тип Curve3d.
 Описание
 Свойство Curve задает или возвращает кривую Curve3d, на основе которой была создана данная ссылка на ребро.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.EdgeRef, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!