Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор TableRegion.TableRegion
 Послать отзыв
 This is TableRegion, a member of class TableRegion.
 Синтаксис
C#
Visual Basic
public TableRegion(int firstRow, int firstColumn, int lastRow, int lastColumn);
Public Sub New(firstRow As Integer, firstColumn As Integer, lastRow As Integer, lastColumn As Integer)
 Ссылки
 TableRegion Класс, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!