Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PolygonMeshVertex.VertexType
 Послать отзыв
 Свойство VertexType представляет тип данной вершины.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vertex3dType VertexType;
Копировать Код
Public ReadOnly Property VertexType As Vertex3dType
 Возвращает
 Возвращает тип вершины как значение из перечисления Vertex3dType.
 Описание
 Свойство VertexType представляет тип данной вершины.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.PolygonMeshVertex, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!