Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DxfFiler.PushBackItem
 Послать отзыв
 Метод возвращает этот объект Filer на позицию, где он был до прочтения последнего элемента.
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract void PushBackItem();
Копировать Код
Public MustOverride Sub PushBackItem()
 Описание
 Метод возвращает этот объект Filer на позицию, где он был до прочтения последнего элемента.
 Ссылки
 Teigha.DatabaseServices.DxfFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!