Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LinkedTableData.DeleteContent
 Послать отзыв
 Метод позволяет удалить все содержимое из ячейки, заданной индексами строки и столбца.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void DeleteContent( int row, int column );
Копировать Код
Public Overridable Sub DeleteContent( row As Integer, column As Integer )
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 column
 Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице.
 Описание
 Метод позволяет удалить все содержимое из ячейки, заданной индексами строки и столбца.
 Замечания
 Метод выбрасывает исключение eInvalidInput, если индекс строки и/или индекс столбца меньше 0 или больше соответствующего размера таблицы. Если содержимое указанной ячейки недоступно для редактирования, этот метод выбрасывает исключение eIsWriteProtected.
 Ссылки
 Teigha.DatabaseServices.LinkedTableData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!