Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GeoLocationData.TransformToLonLatAlt
 Послать отзыв
 Метод предназначен для преобразования заданных долготы, широты и высоты точки географического пространства в соответствующие координаты точки DWG.
 Синтаксис
C#
Visual Basic
Копировать Код
public GeoDataLonLatAltInfo TransformToLonLatAlt( double x, double y, double z );
Копировать Код
Public Function TransformToLonLatAlt( x As Double, y As Double, z As Double ) As GeoDataLonLatAltInfo
 Параметры
 Параметры
 Описание
 x
 Долгота исходной геоточки DWG. Тип double.
 y
 Широта исходной геоточки DWG. Тип double.
 z
 Высота исходной геоточки DWG. Тип double.
 Возвращает
 Возвращает объект GeoDataLonLatAltInfo, представляющий значения долготы, широты и высоты соответствующей геоточки в координатах ГИС.
 Описание
 Метод предназначен для преобразования заданных долготы, широты и высоты точки географического пространства в соответствующие координаты точки DWG.
 Ссылки
 Teigha.DatabaseServices.GeoLocationData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!