Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.LinearEntity3d.IsPerpendicularTo
 Послать отзыв
 Метод позволяет проверить перпендикулярность данного объекта и указанного линейного объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsPerpendicularTo( ref LinearEntity3d line );
Копировать Код
Public Function IsPerpendicularTo( ByRef line As LinearEntity3d ) As Boolean
 Параметры
 Параметры
 Описание
 line
 Входной линейный объект. Тип LinearEntity3d.
 Возвращает
 Возвращает true, если линейные объекты перпендикулярны друг другу. В противном случае возвращает false.
 Описание
 Метод позволяет проверить перпендикулярность данного объекта и указанного линейного объекта. Используется вызов метода LinearEntity3d.IsPerpendicularTo(LinearEntity3d line, Tolerance tolerance) с точностью, равной Tolerance.Global.
 Ссылки
 Teigha.Geometry.LinearEntity3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!