Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Dimlwd
 Послать отзыв
 Синтаксис
C#
Visual Basic
public DatabaseServices::LineWeight Dimlwd;
Public Property Dimlwd() As DatabaseServices.LineWeight
 Описание
 Возвращает или устанавливает текущее значение DIMLWD для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!