Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Entity.Draw()
 Послать отзыв
 Метод предназначен для постановки в очередь перерисовки графики объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Draw();
Копировать Код
Public Sub Draw()
 Описание
 Этот метод ставит в очередь перерисовку графики объекта, требуя осуществить перерисовку данного графического объекта и всего того, что есть в очереди для рисования и перерисования на экране.
 Ссылки
 Teigha.DatabaseServices.Entity, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!