Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Runtime.Interop.CheckAdsForCancel
 Послать отзыв
 Метод проверяет значение параметра returnValue на равенство значениям HostMgd.EditorInput.PromptStatus.OK (5100), HostMgd.EditorInput.PromptStatus.None (5000) и HostMgd.EditorInput.PromptStatus.Cancel (-5002).
 Синтаксис
C#
Visual Basic
Копировать Код
public static bool CheckAdsForCancel( int returnValue );
Копировать Код
Public Shared Function CheckAdsForCancel( returnValue As Integer ) As Boolean
 Параметры
 Параметры
 Описание
 returnValue
 Входное значение. Тип int.
 Возвращает
 Метод вернет false, если параметр равен HostMgd.EditorInput.PromptStatus.Cancel. Если параметр не равен HostMgd.EditorInput.PromptStatus.OK или HostMgd.EditorInput.PromptStatus.None, метод выбросит исключение Teigha.Runtime.ErrorStatus.InvalidInput. Во всех остальных случаях метод возвращает true.
 Описание
 Метод проверяет значение параметра returnValue на равенство значениям HostMgd.EditorInput.PromptStatus.OK (5100), HostMgd.EditorInput.PromptStatus.None (5000) и HostMgd.EditorInput.PromptStatus.Cancel (-5002).
 Ссылки
 Teigha.Runtime.Interop, Teigha.Runtime
 Ваши комментарии по поводу этого топика: Послать отзыв!