Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector3d.IsPerpendicularTo
 Послать отзыв
 Метод проверяет перпендикулярность данного вектора входному вектору в пределах заданной точности tolerance.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsPerpendicularTo( Vector3d vector, Tolerance tolerance );
Копировать Код
Public Function IsPerpendicularTo( vector As Vector3d, tolerance As Tolerance ) As Boolean
 Параметры
 Параметры
 Описание
 vector
 Входной вектор для сравнения. Тип Vector3d.
 tolerance
 Входная точность для сравнения. Тип Tolerance.
 Возвращает
 В случае перпендикулярности векторов возвращает true. В противном случае возвращает false.
 Описание
 Метод позволяет проверить перпендикулярность данного вектора входному вектору vector в пределах заданной точности tolerance.
 Реализация приводит оба вектора к единичной длине и вычисляет их скалярное произведение. Если полученное значение укладывается в пределы заданного допуска Tolerance.EqualVector(), метод возвращает true. В противном случае возвращает false.
 Ссылки
 Teigha.Geometry.Vector3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!