Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Solid3d.CreateExtrudedSolid
 Послать отзыв
 Метод предназначен для создания твердого тела выдавливанием плоской кривой, области или плоской поверхности, направление и длина которого задана входным вектором.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void CreateExtrudedSolid( ref Entity sweepEntity, Vector3d directionVector, ref SweepOptions sweepOptions );
Копировать Код
Public Overridable Sub CreateExtrudedSolid( ByRef sweepEntity As Entity, directionVector As Vector3d, ByRef sweepOptions As SweepOptions )
 Параметры
 Параметры
 Описание
 sweepEntity
 Выдавливаемый объект. Тип Entity.
 directionVector
 Вектор, определяющий направление и величину выдавливания. Тип Vector3d.
 sweepOptions
 Опции операции выдавливания. Тип SweepOptions.
 Описание
 Метод предназначен для создания твердого тела выдавливанием плоской кривой, области или плоской поверхности, направление и длина которого задана входным вектором. Реализован только в среде пространственного моделирования.
 Ссылки
 Teigha.DatabaseServices.Solid3d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!