Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AuditInfo.NumFixes
 Послать отзыв
 Свойство возвращает количество ошибок, отмеченных в данном экземпляре AuditInfo как исправленные.
 Синтаксис
C#
Visual Basic
Копировать Код
public int NumFixes;
Копировать Код
Public Property NumFixes() As Integer
 Возвращает
 Возвращает количество исправленных ошибок. Тип int.
 Описание
 Свойство возвращает количество ошибок, отмеченных в данном экземпляре AuditInfo как исправленные.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.AuditInfo, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!