Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AbstractViewTableRecord.UcsName
 Послать отзыв
 Свойство UcsName представляет идентификатор объекта пользовательской системы координат, связанной с видовым экраном.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.ObjectId UcsName;
Копировать Код
Public ReadOnly Property UcsName As DatabaseServices.ObjectId
 Возвращает
 Возвращает идентификатор объекта UCS. Тип DatabaseServices.ObjectId.
 Описание
 Свойство UcsName представляет идентификатор объекта пользовательской системы координат (ПСК, UCS), связанной с видовым экраном (DXF 345).
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.AbstractViewTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!