Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeader.TextAngleType
 Послать отзыв
 Свойство представляет выбор угла для размещения многострочного текста относительно последнего сегмента линии выноски.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.TextAngleType TextAngleType;
Копировать Код
Public Property TextAngleType As DatabaseServices.TextAngleType
 Возвращает
 Возвращает выбор угла для размещения текста. Значение из перечисления DatabaseServices.TextAngleType.
 Описание
 Свойство представляет выбор угла для размещения многострочного текста относительно последнего сегмента линии выноски.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MLeader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!