Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Sphere.Sphere
 Послать отзыв
 Конструктор класса Sphere. Создает сферу с указанными центром и радиусом.
 Синтаксис
C#
Visual Basic
Копировать Код
public Sphere( double radius, Point3d center );
Копировать Код
Public Sub New( radius As Double, center As Point3d )
 Параметры
 Параметры
 Описание
 radius
 Радиус сферы. Тип double.
 center
 Точка центра сферы. Тип Point3d.
 Описание
 Конструктор класса Sphere. Создает сферу с указанными центром и радиусом.
 Ссылки
 Teigha.Geometry.Sphere, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!