Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Group.InsertAt
 Послать отзыв
 Метод позволяет вставить указанную коллекцию объектов в данный объект Group по указанному индексу.
 Синтаксис
C#
Visual Basic
Копировать Код
public void InsertAt( int index, ref ObjectIdCollection ids );
Копировать Код
Public Sub InsertAt( index As Integer, ByRef ids As ObjectIdCollection )
 Параметры
 Параметры
 Описание
 index
 Индекс в группе, по которому вставляются объекты из коллекции. Тип int.
 ids
 Коллекция идентификаторов вставляемых в группу объектов чертежа. Тип ObjectIdCollection.
 Описание
 Метод позволяет вставить в данную группу объекты, чьи идентификаторы ObjectId представлены в коллекции ids, непосредственно после члена группы с индексом index. Нумерация членов группы начинается с нуля.
 Ссылки
 Teigha.DatabaseServices.Group, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!