Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.BoundBlock3d.Contains
 Послать отзыв
 Метод позволяет проверить, содержит ли данная граничная рамка указанную точку.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool Contains( Point3d pointToTest );
Копировать Код
Public Function Contains( pointToTest As Point3d ) As Boolean
 Параметры
 Параметры
 Описание
 pointToTest
 Входная 3D-точка. Тип Point3d.
 Возвращает
 Возвращает true, если и только если указанная точка находится в пределах данной граничной рамки. В противном случае возвращает false.
 Описание
 Метод позволяет проверить, содержит ли данная граничная рамка указанную точку.
 Ссылки
 Teigha.Geometry.BoundBlock3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!