Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.HideText
 Послать отзыв
 Синтаксис
C#
Visual Basic
public int HideText;
Public Property HideText() As Integer
 Описание
 Возвращает или устанавливает текущее значение HIDETEXT для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!