Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.OsnapPointRef.IdPath
 Послать отзыв
 Свойство IdPath представляет полный путь подобъекта основной геометрии, связанной с данной точки привязки.
 Синтаксис
C#
Visual Basic
Копировать Код
public FullSubentityPath IdPath;
Копировать Код
Public Property IdPath As FullSubentityPath
 Возвращает
 Возвращает полный путь подобъекта основной геометрии. Тип FullSubentityPath.
 Описание
 Свойство IdPath представляет полный путь подобъекта основной геометрии, связанной с данной точки привязки.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.OsnapPointRef, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!