Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CurveCurveIntersector3d.GetIntersectionPoint
 Послать отзыв
 Метод предоставляет 3D-точку пересечения с указанным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d GetIntersectionPoint( int intersection );
Копировать Код
Public Function GetIntersectionPoint( intersection As Integer ) As Point3d
 Параметры
 Параметры
 Описание
 intersection
 Порядковый индекс искомой точки пересечения. Тип int.
 Возвращает
 Возвращает 3D-точку пересечения с индексом intersection. Тип Point3d.
 Описание
 Метод предоставляет 3D-точку пересечения с указанным индексом.
 Ссылки
 Teigha.Geometry.CurveCurveIntersector3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!