Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeader.GetPlane
 Послать отзыв
 Метод возвращает плоскость, в которой располагается данный объект MLeader.
 Синтаксис
C#
Visual Basic
Копировать Код
public override Plane GetPlane();
Копировать Код
Public Overrides Function GetPlane() As Plane
 Возвращает
 Возвращает плоскость в мировой системе координат (WCS). Тип Plane.
 Описание
 Метод возвращает плоскость в мировой системе координат (WCS), в которой располагается данный объект MLeader.
 Ссылки
 Teigha.DatabaseServices.MLeader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!