Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Extents3d.Set
 Послать отзыв
 Метод позволяет переопределить минимальную и максимальную точки данного ограничивающего бокса Extents3d.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Set( Point3d min, Point3d max );
Копировать Код
Public Sub [Set]( min As Point3d, max As Point3d )
 Параметры
 Параметры
 Описание
 min
 Новая минимальная точка. Тип Point3d.
 max
 Новая максимальная точка. Тип Point3d.
 Описание
 Метод позволяет переопределить минимальную и максимальную точки данного ограничивающего бокса Extents3d.
 Ссылки
 Teigha.DatabaseServices.Extents3d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!