Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeader.RemoveFirstVertex
 Послать отзыв
 Метод позволяет удалить первую вершину из указанной линии выноски.
 Синтаксис
C#
Visual Basic
Копировать Код
public void RemoveFirstVertex( int leaderLineIndex );
Копировать Код
Public Sub RemoveFirstVertex( leaderLineIndex As Integer )
 Параметры
 Параметры
 Описание
 leaderLineIndex
 Индекс линии выноски, у которой удаляется вершина. Тип int.
 Описание
 Метод позволяет удалить первую вершину из линии выноски с указанным индексом.
 Ссылки
 Teigha.DatabaseServices.MLeader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!