Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DgnDefinition.DgnDefinition
 Послать отзыв
 Конструктор класса DgnDefinition.
 Синтаксис
C#
Visual Basic
Копировать Код
public DgnDefinition( IntPtr unmanagedObjPtr, bool autoDelete );
Копировать Код
Public Sub New( unmanagedObjPtr As IntPtr, autoDelete As Boolean )
 Параметры
 Параметры
 Описание
 unmanagedObjPtr
 Неуправляемый указатель на исходный объект. Тип IntPtr.
 autoDelete
 Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.
 Описание
 Конструктор класса DgnDefinition.
 Ссылки
 Teigha.DatabaseServices.DgnDefinition, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!