Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.HyperLink
 Послать отзыв
 Класс HyperLink служит базовым классом для объектов гиперссылок.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::DatabaseServices::HyperLink
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdDbHyperlink")] public sealed class HyperLink : DisposableWrapper;
Копировать Код
<Wrapper("OdDbHyperlink")> Public NotInheritable Class HyperLink Inherits DisposableWrapper
 Описание
 Класс HyperLink служит базовым классом для объектов гиперссылок. Он включает следующие данные:
 Наименование
 Описание
 Name
 Имя файла или URL.
 SubLocation
 Вложенная именованная позиция (именованный вид, диапазон ячеек и т.п.).
 Description
 Отображаемый пользователю текст гиперссылки.
 Методы
 Конструкторы
 Teigha.DatabaseServices.HyperLink
 Имя
 Описание
 HyperLink
 Конструктор по умолчанию класса HyperLink.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.DatabaseServices.HyperLink
 Имя
 Описание
 HyperLink Методы
 Ниже перечислены методы класса HyperLink.
 HyperLink Свойства
 Ниже перечислены свойства класса HyperLink.
 Ссылки
 HyperLink Методы, HyperLink Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!