Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FileDependencyInfo.FingerprintGuid
 Послать отзыв
 Свойство FingerprintGuid представляет уникальный GUID файла.
 Синтаксис
C#
Visual Basic
Копировать Код
public String FingerprintGuid;
Копировать Код
Public ReadOnly Property FingerprintGuid As String
 Возвращает
 Возвращает GUID файла. Тип String.
 Описание
 Свойство FingerprintGuid представляет уникальный GUID файла.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.FileDependencyInfo, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!