Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbCurve3dData.ControlPoints
 Послать отзыв
 Свойство ControlPoints представляет коллекцию управляющих вершин NURBS кривой.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3dCollection ControlPoints;
Копировать Код
Public ReadOnly Property ControlPoints As Point3dCollection
 Возвращает
 Возвращает коллекцию управляющих вершин. Тип Point3dCollection.
 Описание
 Свойство ControlPoints представляет коллекцию управляющих вершин NURBS кривой.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.NurbCurve3dData, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!