Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Ray2d.Ray2d
 Послать отзыв
 Конструктор по умолчанию класса Ray2d. Создает луч с началом в точке (0,0) и направляющим вектором (1,0).
 Синтаксис
C#
Visual Basic
Копировать Код
public Ray2d();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса Ray2d. Создает луч с началом в точке (0,0) и направляющим вектором (1,0), т.е. вдоль положительного направления оси X.
 Ссылки
 Teigha.Geometry.Ray2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!