Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CoordinateSystem3d.Zaxis
 Послать отзыв
 Свойство Zaxis представляет направляющий вектор оси Z данной системы координат.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d Zaxis;
Копировать Код
Public ReadOnly Property Zaxis As Vector3d
 Возвращает
 Возвращает направляющий вектор оси Z данной системы координат. Тип Vector3d.
 Описание
 Свойство Zaxis представляет направляющий вектор оси Z данной системы координат.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.CoordinateSystem3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!