Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Dimexo
 Послать отзыв
 Синтаксис
C#
Visual Basic
public double Dimexo;
Public Property Dimexo() As Double
 Описание
 Возвращает или устанавливает текущее значение DIMEXO для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!