Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Filters.IndexUpdateData.AddId
 Послать отзыв
 Метод добавляет к данному объекту IndexUpdateData указанный идентификатор объекта ObjectId.
 Синтаксис
C#
Visual Basic
Копировать Код
public void AddId( ObjectId id );
Копировать Код
Public Sub AddId( id As ObjectId )
 Параметры
 Параметры
 Описание
 id
 Добавляемый идентификатор объекта. Тип ObjectId.
 Описание
 Метод добавляет к данному объекту IndexUpdateData указанный идентификатор объекта ObjectId.
 Ссылки
 Teigha.DatabaseServices.Filters.IndexUpdateData, Teigha.DatabaseServices.Filters
 Ваши комментарии по поводу этого топика: Послать отзыв!