Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 DimStyleTableRecord.Dimsd2
 Послать отзыв
 Свойство предназначено для контроля подавления второй размерной линии и окончания правой стрелки в размерах.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual bool Dimsd2 { get; set; }
Копировать Код
Public Overridable Property Dimsd2 As Boolean
 Возвращает
 Возвращает тип данных bool.
 Описание
 В свойстве хранится настройка подавления второй размерной линии и окончания правой стрелки в размерах. Свойство принимает в качестве значения тип данных bool:
false – не подавляется (по умолчанию);
true – подавляется.
 Свойство также доступно через системную переменную DIMSD2 и пользовательское меню в окне изменения/создания размерного стиля:
  При изменении системной переменной DIMSD2 будет создан новый размерный стиль под названием <переопределение> на основе текущего с новым значением DIMSD2.
 Условия
 Чтение и запись.
 Пример
 Пример изменения настройки подавления второй размерной линии и окончания правой стрелки в размерах (значения свойства Dimsd2) в размерном стиле Standard:
C#
 Копировать Код
public partial class Commands { [Teigha.Runtime.CommandMethod("Dimsd2Change")] public void Dimsd2StandardDimStyle() { // Получение ссылки на активный документ HostMgd.ApplicationServices.Document doc = HostMgd.ApplicationServices.Application.DocumentManager.MdiActiveDocument; // Получение ссылки на редактор документа HostMgd.EditorInput.Editor ed = doc.Editor; // Получение ссылки на базу данных документа Teigha.DatabaseServices.Database db = doc.Database; // Начало транзакции с базой данных документа using (Teigha.DatabaseServices.Transaction trans = db.TransactionManager.StartTransaction()) { // Открываем таблицу размерных стилей для чтения Teigha.DatabaseServices.DimStyleTable dimStyleTable = trans.GetObject(db.DimStyleTableId, Teigha.DatabaseServices.OpenMode.ForRead) as Teigha.DatabaseServices.DimStyleTable; // Находим в таблице размерных стилей ObjectId нужного стиля по его названию Teigha.DatabaseServices.ObjectId styleId = dimStyleTable["Standard"]; // Открываем таблицу размерного стиля для изменений Teigha.DatabaseServices.DimStyleTableRecord obj = trans.GetObject(styleId, Teigha.DatabaseServices.OpenMode.ForWrite) as Teigha.DatabaseServices.DimStyleTableRecord; ed.WriteMessage($"nDimsd2 before: {obj.Dimsd2}"); // Изменяем признак подавления второй размерной линии и ее окончания obj.Dimsd2 = true; ed.WriteMessage($"nDimsd2 after: {obj.Dimsd2}"); trans.Commit(); } } }
 Результат работы команды Dimsd2Change:
 Было:
 Стало:
 Ссылки
 Teigha.DatabaseServices.DimStyleTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!