Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Extents3d.AddExtents
 Послать отзыв
 Метод позволяет расширить данный объект Extents3d так, чтобы включить в свой объем указанный ограничивающий бокс.
 Синтаксис
C#
Visual Basic
Копировать Код
public void AddExtents( Extents3d source );
Копировать Код
Public Sub AddExtents( source As Extents3d )
 Параметры
 Параметры
 Описание
 source
 Ограничивающий бокс, который следует включить в данный объект. Тип Extents3d.
 Описание
 Метод позволяет расширить данный объект Extents3d так, чтобы включить в свой объем указанный ограничивающий бокс.
 Ссылки
 Teigha.DatabaseServices.Extents3d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!