Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CellBorders.Vertical
 Послать отзыв
 Свойство возвращает границу ячейки на всех вертикальных линиях сетки таблицы, кроме крайней левой и крайней правой.
 Синтаксис
C#
Visual Basic
Копировать Код
public CellBorder Vertical;
Копировать Код
Public Property Vertical() As CellBorder
 Возвращает
 Возвращает границу ячейки. Тип CellBorder.
 Описание
 Свойство возвращает границу ячейки на всех вертикальных линиях сетки таблицы, кроме крайней левой и крайней правой.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.CellBorders, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!