Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector2dCollection.AddRange
 Послать отзыв
 Метод добавляет в коллекцию массив объектов Vector2d.
 Синтаксис
C#
Visual Basic
Копировать Код
public void AddRange( ref Vector2d[] range );
Копировать Код
Public Sub AddRange( ByRef range() As Vector2d )
 Параметры
 Параметры
 Описание
 range
 Входной массив объектов, которые добавляются в данную коллекцию. Тип Vector2d[].
 Описание
 Метод добавляет в коллекцию массив объектов Vector2d.
 Ссылки
 Teigha.Geometry.Vector2dCollection, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!