Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GridPropertyParameter.DoubleLineSpacing
 Послать отзыв
 Свойство представляет расстояние между двойными линиями, используемое в стиле двойной линии сетки.
 Синтаксис
C#
Visual Basic
Копировать Код
public double DoubleLineSpacing;
Копировать Код
Public DoubleLineSpacing As Double
 Возвращает
 Возвращает расстояние между двойными линиями. Тип double.
 Описание
 Свойство представляет расстояние между двойными линиями, используемое в стиле двойной линии сетки.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.GridPropertyParameter, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!