Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Light.LampColorRGB
 Послать отзыв
 Свойство представляет значение RGB цвета лампы данного источника света.
 Синтаксис
C#
Visual Basic
Копировать Код
public ColorRGB LampColorRGB;
Копировать Код
Public Property LampColorRGB As ColorRGB
 Возвращает
 Возвращает значение RGB цвета лампы. Тип ColorRGB.
 Описание
 Свойство представляет значение RGB цвета лампы данного источника света.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Light, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!