Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.TableStyle.IsTitleSuppressed
 Послать отзыв
 Свойство IsTitleSuppressed представляет состояние флага подавления наименования таблицы.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual bool IsTitleSuppressed;
Копировать Код
Public Overridable Property IsTitleSuppressed As Boolean
 Возвращает
 Возвращает true, если строка наименования таблицы подавлена. В противном случае возвращает false.
 Описание
 Свойство IsTitleSuppressed представляет состояние флага подавления наименования таблицы.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.TableStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!