Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SectionHitTestInfo
 Послать отзыв
 Эта структура служит контейнером для результатов проверки попадания в индикатор секущей плоскости, возвращаемых методом DatabaseServices.Section.HitTest().
 Иерархия классов
Teigha::DatabaseServices::SectionHitTestInfo
 Синтаксис
C#
Visual Basic
Копировать Код
public struct SectionHitTestInfo
Копировать Код
Public Structure SectionHitTestInfo
 Описание
 Эта структура служит контейнером для результатов проверки попадания в индикатор секущей плоскости, возвращаемых методом DatabaseServices.Section.HitTest().
 Топики
 Имя
 Описание
 SectionHitTestInfo Свойства
 Ниже перечислены свойства класса SectionHitTestInfo.
 Ссылки
 SectionHitTestInfo Свойства, Топики, SectionHitTestInfo Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!