Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.EllipticalCylinder.GetHeightAt
 Послать отзыв
 Метод предоставляет высоту данного эллиптического цилиндра, соответствующую указанному значению параметра U.
 Синтаксис
C#
Visual Basic
Копировать Код
public double GetHeightAt( double parameter );
Копировать Код
Public Function GetHeightAt( parameter As Double ) As Double
 Параметры
 Параметры
 Описание
 parameter
 Входное значение параметра U эллиптического цилиндра. Тип double.
 Возвращает
 Возвращает высоту эллиптического цилиндра для переданного в метод значения параметра U. Тип double.
 Описание
 Метод предоставляет высоту данного эллиптического цилиндра, соответствующую указанному значению параметра U (указанному положению на параметрической оси U цилиндра).
 Ссылки
 Teigha.Geometry.EllipticalCylinder, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!