Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.ExternalBoundedSurface.IsDefined
 Послать отзыв
 Свойство IsDefined позволяет проверить, является ли данный объект определенным.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsDefined;
Копировать Код
Public ReadOnly Property IsDefined As Boolean
 Возвращает
 Возвращает true, если данный объект имеет определение поверхности. В противном случае возвращает false.
 Описание
 Свойство IsDefined позволяет проверить, является ли данный объект определенным, т.е. сформировано ли определение поверхности.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.ExternalBoundedSurface, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!