Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve2d.GetReverseParameterCurve
 Послать отзыв
 Метод изменяет направление параметра для данной кривой на противоположное.
 Синтаксис
C#
Visual Basic
Копировать Код
public Curve2d GetReverseParameterCurve();
Копировать Код
Public Function GetReverseParameterCurve() As Curve2d
 Возвращает
 Возвращает кривую с инвертированным параметрическим интервалом. Тип Curve2d.
 Описание
 Метод предназначен для изменения направления параметра для данной кривой на противоположное. Множество точек данной кривой сохраняется без изменений.
 Ссылки
 Teigha.Geometry.Curve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!