Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AbstractViewTableRecord.FrontClipDistance
 Послать отзыв
 Свойство FrontClipDistance предоставляет доступ к положению передней плоскости отсечения видового экрана.
 Синтаксис
C#
Visual Basic
Копировать Код
public double FrontClipDistance;
Копировать Код
Public Property FrontClipDistance As Double
 Возвращает
 Возвращает расстояние от точки цели до передней плоскости отсечения. Тип double.
 Описание
 Свойство FrontClipDistance предоставляет доступ к положению передней плоскости отсечения видового экрана.
 Замечания
 Положение передней плоскости отсечения измеряется от точки цели до плоскости отсечения вдоль линии камера - цель. Положительные значения указывают, что плоскость отсечения находится перед целью (то есть между целью и камерой). Отрицательные значения указывают, что плоскость отсечения находится позади цели.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.AbstractViewTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!