Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.BoundaryRepresentation.MassProperties
 Послать отзыв
 Класс MassProperties представляет массо-центровочные характеристики объекта BREP - объем, масса, центр тяжести, радиусы инерции, моменты инерции твердого тела, центробежные моменты инерции, главные моменты и главные оси объекта BREP.
 Иерархия классов
Teigha::BoundaryRepresentation::MassProperties
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("AcBrMassProps")] public class MassProperties;
Копировать Код
<Wrapper("AcBrMassProps")> Public Class MassProperties
 Описание
 Класс MassProperties представляет массо-центровочные характеристики объекта BREP:
Объем объекта;
Масса (численно равна объему, если не указана плотность, отличающаяся от единицы);
Центр тяжести;
Радиусы инерции;
Моменты инерции;
Центробежные моменты инерции;
Главные моменты;
Главные оси.
 Замечания
 Массо-центровочные характеристики определены лишь для тех объектов BREP, для которых определено свойство объема.
 Топики
 Имя
 Описание
 MassProperties Свойства
 Ниже перечислены свойства класса MassProperties.
 Ссылки
 MassProperties Свойства, Топики, MassProperties Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!