Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Region.CreateFromCurves
 Послать отзыв
 Метод предназначен для создания новых областей из замкнутых контуров, образованных указанными сегментами кривой.
 Синтаксис
C#
Visual Basic
Копировать Код
public static DBObjectCollection CreateFromCurves( ref DBObjectCollection curveSegments );
Копировать Код
Public Shared Function CreateFromCurves( ByRef curveSegments As DBObjectCollection ) As DBObjectCollection
 Параметры
 Параметры
 Описание
 curveSegments
 Массив сегментов кривой. Тип DBObjectCollection.
 Возвращает
 Возвращает коллекцию созданных областей. Тип DBObjectCollection.
 Описание
 Метод предназначен для создания новых областей из замкнутых контуров, образованных указанными сегментами кривой.
 Каждый сегмент кривой должен быть представлен одним из следующих типов графических примитивов: 3dPolyline, Arc, Circle, Ellipse, Line, Polyline или Spline.
 Замечания
 Вновь созданные области не являются резидентными объектами базы данных. Вызывающее приложение может либо добавить их в базу данных, либо их удалить.
 Ссылки
 Teigha.DatabaseServices.Region, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!