Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObject.DeepClone(DBObject,IdMapping,bool)
 Послать отзыв
 Метод выполняет глубокое клонирование этого объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public DBObject DeepClone(DBObject ownerPointer, IdMapping idMap, bool isPrimary);
Копировать Код
Public Function DeepClone(ownerPointer As DBObject, idMap As IdMapping, isPrimary As bool) As DBObject
 Параметры
 Параметры
 Описание
 ownerPointer
 Объект, к которому добавляются клонируемые объекты
 idMap
 Текущий Id карты объекта
 isPrimary
 Признак, определяющий, является ли объект первичным, или имеет владельца
 Описание
 Этот метод позволяет контролировать операции полного клонирования объекта. При реализации по умолчанию, объект клонируется и добавляется к объекту-владельцу (ownerPointer). Клонирование выполняется с учетом DeepCloneFiler. Также добавляется запись в idMap. Затем, используя фильтр, все объекты, имеющие владельца, клонируются, с установкой isPrimary в false.
 Ссылки
 Teigha.DatabaseServices.DBObject, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!