Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Cone.IsClosed
 Послать отзыв
 Метод позволяет проверить, является ли основание данного конуса полным кругом.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsClosed();
Копировать Код
Public Function IsClosed() As Boolean
 Возвращает
 Возвращает true тогда и только тогда, когда основание этого конуса является полным кругом. В противном случае возвращает false.
 Описание
 Метод позволяет проверить, является ли основание данного конуса полным кругом. Используется вызов метода Cone.IsClosed(Tolerance tolerance) с точностью, равной Tolerance.Global.
 Ссылки
 Teigha.Geometry.Cone, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!