Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Database.SetTimeZoneAsUtcOffset
 Послать отзыв
 Синтаксис
C#
Visual Basic
public DatabaseServices::TimeZone SetTimeZoneAsUtcOffset(double offset);
Public Function SetTimeZoneAsUtcOffset(offset As Double) As DatabaseServices.TimeZone
 Параметры
 Параметры
 Описание
 offset
 Смещение, в часах
 Описание
 Устанавливает текущую часовую зону, используя смещение относительно мирового времени/гринвичского меридиана (UTC/GMT).
 Возвращает часовую зону, выбранную и установленную в соответствии со значением offset. Если есть несколько зон с одним и тем же смещением, будет возвращена первая найденная часовая зона. Note Допустимые значения параметра offset от -12.0 до 13.0, при этом параметр должен указывать на известную часовую зону (определенную в перечислении TimeZone).
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!