Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Ole2Frame.LinkName
 Послать отзыв
 Свойство представляет имя файла и элемент, с которым связан данный объект Ole2Frame.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual String LinkName;
Копировать Код
Public Overridable ReadOnly Property LinkName As String
 Возвращает
 Возвращает строку, содержащую имя файла и элемент в файле, с которым связан OLE-объект. Тип String.
 Описание
 Свойство представляет имя файла и элемент, с которым связан данный объект Ole2Frame. Пример: D:/My Documents/My Workbook.xls!Sheet2!R1C1:R10C10
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Ole2Frame, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!