Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeaderStyle.TextAlignmentType
 Послать отзыв
 Свойство представляет тип выравнивания многострочного текста мультивыноски, предусмотренный данным стилем.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.TextAlignmentType TextAlignmentType;
Копировать Код
Public Property TextAlignmentType As DatabaseServices.TextAlignmentType
 Возвращает
 Возвращает тип выравнивания многострочного текста. Значение из перечисления DatabaseServices.TextAlignmentType.
 Описание
 Свойство представляет тип выравнивания многострочного текста мультивыноски, предусмотренный данным стилем.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MLeaderStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!