Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Делегат Teigha.DatabaseServices.WblockNoticeEventHandler
 Послать отзыв
 This is type Teigha::DatabaseServices::WblockNoticeEventHandler.
 Синтаксис
C#
Visual Basic
public delegate WblockNoticeEventHandler();
Public Delegate Sub WblockNoticeEventHandler()
 Ваши комментарии по поводу этого топика: Послать отзыв!