Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SecurityParameters.TimeServer
 Послать отзыв
 Свойство TimeServer представляет имя сервера времени, используемого для установления временных меток.
 Синтаксис
C#
Visual Basic
Копировать Код
public String TimeServer;
Копировать Код
Public Property TimeServer As String
 Возвращает
 Возвращает имя сервера времени. Тип String.
 Описание
 Свойство TimeServer представляет имя сервера времени, используемого для установления временных меток.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.SecurityParameters, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!