Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Interval.Interval
 Послать отзыв
 Конструктор класса Interval. Создает бесконечный (в обоих направлениях) интервал и определяет точность для задания границ.
 Синтаксис
C#
Visual Basic
Копировать Код
public Interval( double tolerance );
Копировать Код
Public Sub New( tolerance As Double )
 Параметры
 Параметры
 Описание
 tolerance
 Входная точность определения границ интервала. Тип double.
 Описание
 Конструктор класса Interval. Создает бесконечный (в обоих направлениях) интервал и определяет точность для задания границ.
 Ссылки
 Teigha.Geometry.Interval, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!