Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SweptSurface.PathLength
 Послать отзыв
 Свойство PathLength представляет длину траектории, вытягиванием по которой получен данный объект.
 Синтаксис
C#
Visual Basic
Копировать Код
public double PathLength;
Копировать Код
Public ReadOnly Property PathLength As Double
 Возвращает
 Возвращает длину траектории. Тип double.
 Описание
 Свойство PathLength представляет длину траектории, вытягиванием по которой получен данный объект.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.SweptSurface, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!