Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Line2d.Line2d
 Послать отзыв
 Конструктор класса Line2d. Создает бесконечную линию, которая проходит через заданную точку и имеет указанный направляющий вектор.
 Синтаксис
C#
Visual Basic
Копировать Код
public Line2d( Point2d point, Vector2d vector );
Копировать Код
Public Sub New( point As Point2d, vector As Vector2d )
 Параметры
 Параметры
 Описание
 point
 Входная точка. Тип Point2d.
 vector
 Входной направляющий вектор. Тип Vector2d. Должен иметь ненулевую длину.
 Описание
 Конструктор класса Line2d. Создает бесконечную линию, которая проходит через заданную точку и имеет указанный направляющий вектор.
 Ссылки
 Teigha.Geometry.Line2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!