Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Solid3d.IsNull
 Послать отзыв
 Свойство IsNull позволяет проверить, существует ли модель ACIS, связанная с этим объектом.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual bool IsNull;
Копировать Код
Public Overridable ReadOnly Property IsNull As Boolean
 Возвращает
 Возвращает true, если модель ACIS для данного объекта не существует. В противном случае возвращает false.
 Описание
 Свойство IsNull позволяет проверить, существует ли модель ACIS, связанная с этим объектом.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Solid3d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!