Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.EllipticalArc2d.Center
 Послать отзыв
 Свойство Center предоставляет доступ к точке центра данной эллиптической дуги.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point2d Center;
Копировать Код
Public Property Center As Point2d
 Возвращает
 Возвращает точку центра дуги. Тип Point2d.
 Описание
 Свойство Center предоставляет доступ к точке центра данной эллиптической дуги.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.Geometry.EllipticalArc2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!