Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeaderStyle.TextStyleId
 Послать отзыв
 Свойство представляет идентификатор ObjectId текстового стиля, который должен применяться к многострочному тексту мультивыноски.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.ObjectId TextStyleId;
Копировать Код
Public Property TextStyleId As DatabaseServices.ObjectId
 Возвращает
 Возвращает идентификатор текстового стиля. Тип DatabaseServices.ObjectId.
 Описание
 Свойство представляет идентификатор ObjectId текстового стиля, который должен применяться к многострочному тексту мультивыноски.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MLeaderStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!