Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DatabaseSummaryInfo.HyperlinkBase
 Послать отзыв
 Свойство обеспечивает доступ к базовому URL данного объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public String HyperlinkBase;
Копировать Код
Public Property HyperlinkBase() As String
 Возвращает
 Возвращает значение поля HyperlinkBase. Тип String.
 Описание
 Свойство обеспечивает доступ к базовому URL данного объекта.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.DatabaseSummaryInfo, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!