Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GripOverrule.MoveStretchPointsAt
 Послать отзыв
 Метод растягивает объект чертежа, используя заданные ручки.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void MoveStretchPointsAt( ref Entity entity, ref IntegerCollection indices, Vector3d offset );
Копировать Код
Public virtual Sub MoveStretchPointsAt( ByRef entity As Entity, ByRef indices As IntegerCollection, offset As Vector3d )
 Параметры
 Параметры
 Описание
 entity
 Объект, тип Entity,
 indices
 Коллекция индексов ручек, тип IntegerCollection,
 offset
 Вектор смещения ручек, тип Vector3d.
 Описание
 Метод растягивает объект чертежа, используя заданные ручки. Вектор перемещения задается в мировой системе координат. Ручки задаются массивом соответствующих им индексов в коллекции, которую формирует метод GetStretchPoints.
 Ссылки
 Teigha.DatabaseServices.GripOverrule, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!