Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.BoundBlock3d.GetMinimumPoint
 Послать отзыв
 Метод предоставляет минимальную точку данной граничной рамки.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d GetMinimumPoint();
Копировать Код
Public Function GetMinimumPoint() As Point3d
 Возвращает
 Возвращает экземпляр класса Point3d, который представляет минимальную точку граничной рамки.
 Описание
 Метод предоставляет минимальную точку данной граничной рамки.
 Ссылки
 Teigha.Geometry.BoundBlock3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!