Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GripData.CallViewportDraw
 Послать отзыв
 Метод предназначен для отрисовки графики пользовательского глифа ручки, которая зависит от видового экрана.
 Синтаксис
C#
Visual Basic
Копировать Код
public void CallViewportDraw( ref GraphicsInterface.ViewportDraw worldDraw, ObjectId entityId, DrawType t, Point3d? imageGripPoint, int gripSizeInPixels );
Копировать Код
Public Sub CallViewportDraw( ByRef worldDraw As GraphicsInterface.ViewportDraw, entityId As ObjectId, t As DrawType, imageGripPoint As Point3d?, gripSizeInPixels As Integer )
 Параметры
 Параметры
 Описание
 worldDraw
 Входной интерфейс Teigha.GraphicsInterface.ViewportDraw.
 entityId
 Идентификатор объекта чертежа. Тип ObjectId.
 t
 Тип отображения ручки. Перечисление GripData.DrawType.
 imageGripPoint
 Базовая точка изображения ручки. Тип Point3d?.
 gripSizeInPixels
 Размер ручки в пикселях. Тип int.
 Описание
 Метод предназначен для отрисовки графики пользовательского глифа ручки, которая зависит от видового экрана.
 Ссылки
 Teigha.DatabaseServices.GripData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!