Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Extents2d.ToString
 Послать отзыв
 Метод позволяет получить эквивалентное строковое представление данного объекта с учетом заданных языковых и региональных настроек.
 Синтаксис
C#
Visual Basic
Копировать Код
public String ToString( ref IFormatProvider provider );
Копировать Код
Public Function ToString( ByRef provider As IFormatProvider ) As String
 Параметры
 Параметры
 Описание
 provider
 Провайдер языковых и региональных настроек. Тип IFormatProvider.
 Возвращает
 Возвращает представление данного объекта в виде строки. Тип String.
 Описание
 Метод позволяет получить эквивалентное строковое представление данного объекта с учетом заданных языковых и региональных настроек.
 Ссылки
 Teigha.DatabaseServices.Extents2d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!