Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Database.GetDimRecentStyleList
 Послать отзыв
 Синтаксис
C#
Visual Basic
public ObjectIdCollection GetDimRecentStyleList();
Public Function GetDimRecentStyleList() As ObjectIdCollection
 Описание
 Эта функция позволяет получить Id геометрических объектов последних используемых размерных стилей (до 6) для поддержки списка наиболее часто используемых размерных стилей. Последние используемые размерные стили отслеживаются с помощью определения последних шести объектов размерных стилей, которые были текущими в базе данных.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!