Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.LightingUnits
 Послать отзыв
 Синтаксис
C#
Visual Basic
public unsigned char LightingUnits;
Public Property LightingUnits() As unsigned char
 Описание
 Устанавливает или возвращает единицы света для чертежа, где 0 - Общие, 1 - Международные, 2 - Американские.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!