Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.XrefFullSubentityPath.AppendObjectId
 Послать отзыв
 Метод добавляет идентификатор объекта в массив идентификаторов объектов, связанных с данным объектом XrefFullSubentityPath.
 Синтаксис
C#
Visual Basic
Копировать Код
public void AppendObjectId( ObjectId objId );
Копировать Код
Public Sub AppendObjectId( objId As ObjectId )
 Параметры
 Параметры
 Описание
 objId
 Идентификатор добавляемого в массив объекта. Тип ObjectId.
 Описание
 Метод добавляет идентификатор объекта в массив идентификаторов объектов, связанных с данным объектом XrefFullSubentityPath.
 Ссылки
 Teigha.DatabaseServices.XrefFullSubentityPath, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!