Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор LinkedTableEnumerator.LinkedTableEnumerator
 Послать отзыв
 This is LinkedTableEnumerator, a member of class LinkedTableEnumerator.
 Синтаксис
C#
Visual Basic
public LinkedTableEnumerator(ref LinkedTableData tab, TableEnumeratorOption eOpt);
Public Sub New(ByRef tab As LinkedTableData, eOpt As TableEnumeratorOption)
 Ссылки
 LinkedTableEnumerator Класс, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!