Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.RenderSettings
 Послать отзыв
 Класс RenderSettings служит контейнером для свойств, общих для всех инструментов высококачественного рендеринга.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::GraphicsInterface::Drawable Teigha::DatabaseServices::DBObject Teigha::DatabaseServices::RenderSettings
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("AcDbRenderSettings")] public class RenderSettings : DBObject
Копировать Код
<Wrapper("AcDbRenderSettings")> Public Class RenderSettings Inherits DBObject
 Описание
 Класс RenderSettings служит контейнером для свойств, общих для всех инструментов высококачественного рендеринга.
 В базе данных резидентные объекты RenderSettings хранятся в словаре именованных объектов NamedObjectsDictionary в разделе ACAD_RENDER_SETTINGS. Объекты настройки индексируются по именам. Кроме того, активные параметры RenderSettings хранятся в NamedObjectsDictionary в разделе ACAD_RENDER_ACTIVE_SETTINGS.
 Замечания
 В пользовательском интерфейсе содержимое ACAD_RENDER_SETTINGS соответствует пользовательским настройкам рендеринга (а не предопределенным системным настройкам).
 Методы
 Конструкторы
 Teigha.GraphicsInterface.Drawable
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 Drawable
 Конструктор класса Teigha.GraphicsInterface.Drawable. (Унаследован от Drawable)
 Teigha.DatabaseServices.DBObject
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 DBObject
 Конструктор. (Унаследован от DBObject)
 Teigha.DatabaseServices.RenderSettings
 Имя
 Описание
 RenderSettings
 Конструктор по умолчанию класса RenderSettings.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.GraphicsInterface.Drawable
 Имя
 Описание
 Drawable Методы
 Ниже перечислены методы класса Drawable.
 Drawable Свойства
 Ниже перечислены свойства класса Drawable.
 Teigha.DatabaseServices.DBObject
 Имя
 Описание
 DBObject Методы
 Ниже перечислены методы класса DBObject.
 DBObject Свойства
 Ниже перечислены свойства класса DBObject.
 DBObject События
 Ниже перечислены события класса DBObject.
 Teigha.DatabaseServices.RenderSettings
 Имя
 Описание
 RenderSettings Свойства
 Ниже перечислены свойства класса RenderSettings.
 Ссылки
 RenderSettings Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства, DBObject События
 Ваши комментарии по поводу этого топика: Послать отзыв!