Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Hatch.GetPatternDefinitionAt
 Послать отзыв
 Синтаксис
C#
Visual Basic
public PatternDefinition GetPatternDefinitionAt(int index);
Public Function GetPatternDefinitionAt(index As Integer) As PatternDefinition
 Параметры
 Параметры
 Описание
 index
 Индекс образца
 Описание
 Метод возвращает определение линий образца для рисовки объекта заливки по заданному индексу образца.
 Ссылки
 Teigha.DatabaseServices.Hatch, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!