Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Solid3d.Slice
 Послать отзыв
 Метод разрезает твердое тело указанной поверхностью и преобразует исходное твердое тело в часть, оставшуюся со стороны от режущей поверхности с положительным направлением нормали.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void Slice( ref DatabaseServices.Surface surface );
Копировать Код
Public Overridable Sub Slice( ByRef surface As DatabaseServices.Surface )
 Параметры
 Параметры
 Описание
 surface
 Режущая поверхность. Тип DatabaseServices.Surface.
 Описание
 Метод позволяет разрезать твердое тело указанной поверхностью. Исходное твердое тело преобразуется в ту часть, которая осталась с "положительной" стороны режущей поверхности (с положительным направлением нормали).
 Этот метод реализован только в среде пространственного моделирования.
 Ссылки
 Teigha.DatabaseServices.Solid3d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!