Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DxfFiler.ReadHandle
 Послать отзыв
 Метод возвращает дескриптор Handle из текущего элемента этого объекта Filer.
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract Handle ReadHandle();
Копировать Код
Public MustOverride Function ReadHandle() As Handle
 Возвращает
 Возвращает дескриптор объекта. Тип Handle.
 Описание
 Метод возвращает дескриптор Handle из текущего элемента этого объекта Filer.
 Ссылки
 Teigha.DatabaseServices.DxfFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!