Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeader.SetLeaderLineColor
 Послать отзыв
 Метод позволяет задать цвет линии выноски с указанным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetLeaderLineColor( int leaderLineIndex, ref Teigha.Colors.Color leaderLineTypeId );
Копировать Код
Public Sub SetLeaderLineColor( leaderLineIndex As Integer, ByRef leaderLineTypeId As Teigha.Colors.Color )
 Параметры
 Параметры
 Описание
 leaderLineIndex
 Индекс линии выноски. Тип int.
 leaderLineTypeId
 Новый цвет линии выноски. Тип Teigha.Colors.Color.
 Описание
 Метод позволяет задать цвет линии выноски с указанным индексом.
 Ссылки
 Teigha.DatabaseServices.MLeader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!