Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Viewport.ShadePlot
 Послать отзыв
 Свойство ShadePlot представляет текущий режим отображения теней в данном видовом экране.
 Синтаксис
C#
Visual Basic
Копировать Код
public ShadePlotType ShadePlot;
Копировать Код
Public Property ShadePlot As ShadePlotType
 Возвращает
 Возвращает текущий режим отображения теней. Тип ShadePlotType.
 Описание
 Свойство ShadePlot представляет текущий режим отображения теней в данном видовом экране.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Viewport, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!