Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Делегат Teigha.DatabaseServices.XrefPreXrefLockFileEventHandler
 Послать отзыв
 This is type Teigha::DatabaseServices::XrefPreXrefLockFileEventHandler.
 Синтаксис
C#
Visual Basic
public delegate XrefPreXrefLockFileEventHandler();
Public Delegate Sub XrefPreXrefLockFileEventHandler()
 Ваши комментарии по поводу этого топика: Послать отзыв!