Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Polyline3d.InsertVertexAt
 Послать отзыв
 Этот метод вставляет объект PolylineVertex3d, заданный аргументом newVertex, в список вершин полилинии непосредственно после вершины PolylineVertex3d, заданной ее идентификатором ObjectId.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.ObjectId InsertVertexAt( DatabaseServices.ObjectId indexVertexId, ref PolylineVertex3d newVertex );
Копировать Код
Public Function InsertVertexAt( indexVertexId As DatabaseServices.ObjectId, ByRef newVertex As PolylineVertex3d ) As DatabaseServices.ObjectId
 Параметры
 Параметры
 Описание
 indexVertexId
 Идентификатор ObjectId вершины полилинии, после которой должна быть вставлена новая вершина. Чтобы вставить вершину в начало полилинии, в аргументе indexVertexId следует передать Null.
 newVertex
 указатель на добавляемую вершину, тип PolylineVertex3d.
 Возвращает
 Возвращает ObjectId новой вершины полилинии.
 Описание
 Этот метод вставляет объект PolylineVertex3d, заданный аргументом newVertex, в список вершин полилинии непосредственно после вершины PolylineVertex3d, у которой ObjectId равен indexVertexId, а также делает полилинию владельцем вершины. Кроме того, если полилиния является резидентной в базе данных, то в ту же базу данных будет добавлена и вершина.
 Чтобы вставить вершину в начало полилинии, в аргументе indexVertexId следует передать NULL.
 Если полилиния является резидентной в базе данных, то вставленная вершина должна быть явно закрыта вызывающим приложением после возврата из метода InsertVertexAt().
 Ссылки
 Teigha.DatabaseServices.Polyline3d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!