Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Matrix3d.IsSingular
 Послать отзыв
 Метод позволяет проверить, является ли данная матрица сингулярной в пределах заданной точности.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsSingular( Tolerance tolerance );
Копировать Код
Public Function IsSingular( tolerance As Tolerance ) As Boolean
 Параметры
 Параметры
 Описание
 tolerance
 Используемый допуск. Тип Tolerance.
 Возвращает
 Возвращает true, если данная матрица является сингулярной, иначе - false.
 Описание
 Метод позволяет проверить, является ли данная матрица сингулярной в пределах заданной точности tolerance.
 Замечания
Матрица сингулярна тогда и только тогда, когда ее определитель равен нулю. Такое возможно, например, если какие-либо векторы-столбцы линейной части данной матрицы имеют нулевую длину или оказываются параллельными.
Сингулярная матрица не может быть инвертирована.
 Ссылки
 Teigha.Geometry.Matrix3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!