Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство RasterImage.ShowImage
 Послать отзыв
 Синтаксис
C#
Visual Basic
public bool ShowImage;
Public Property ShowImage() As bool
 Описание
 Возвращает доступ к признаку "показать" в параметрах отображения.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.RasterImage, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!