Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MlineStyleElementCollection.CopyTo
 Послать отзыв
 Метод копирует элементы данной коллекции в указанный массив, начиная с заданной индексом позиции.
 Синтаксис
C#
Visual Basic
Копировать Код
public void CopyTo( ref MlineStyleElement[] arr, int index );
Копировать Код
Public Sub CopyTo( ByRef arr() As MlineStyleElement, index As Integer )
 Параметры
 Параметры
 Описание
 arr
 Целевой массив. Тип MlineStyleElement[].
 index
 Индекс в массиве, начиная с которого в массив копируются элементы коллекции. Тип int.
 Описание
 Метод копирует элементы данной коллекции в указанный массив, начиная с заданной индексом позиции.
 Ссылки
 Teigha.DatabaseServices.MlineStyleElementCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!