Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve3d.GetOrthoBoundBlockOf
 Послать отзыв
 Метод позволяет определить граничный бокс для участка кривой на заданном параметрическом подынтервале. Ребра возвращаемого бокса ориентированы по осям системы координат.
 Синтаксис
C#
Visual Basic
Копировать Код
public BoundBlock3d GetOrthoBoundBlockOf( ref Interval range );
Копировать Код
Public Function GetOrthoBoundBlockOf( ByRef range As Interval ) As BoundBlock3d
 Параметры
 Параметры
 Описание
 range
 Параметрический подынтервал участка кривой, для которого строится ограничивающий бокс. Тип Interval.
 Возвращает
 Возвращает ограничивающий бокс. Тип BoundBlock3d.
 Описание
 Метод позволяет определить граничный бокс для участка кривой на заданном параметрическом подынтервале. Ребра возвращаемого бокса ориентированы по осям системы координат.
 Замечания
 Граничный бокс представляет собой прямоугольный параллелепипед минимального объема, ребра которого параллельны координатным осям и в котором целиком помещается целевой геометрический объект. Ориентация граничного бокса не зависит от пространственной ориентации геометрического объекта.
 Ссылки
 Teigha.Geometry.Curve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!