Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LayerViewportProperties.RemoveOverrides
 Послать отзыв
 Метод предназначен для удаления всех переопределений, связанных со слоем и видовым экраном.
 Синтаксис
C#
Visual Basic
Копировать Код
public void RemoveOverrides();
Копировать Код
Public Sub RemoveOverrides()
 Описание
 Метод предназначен для удаления всех переопределений, связанных со слоем и видовым экраном.
 Ссылки
 Teigha.DatabaseServices.LayerViewportProperties, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!