Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeader.GetLeaderLineWeight
 Послать отзыв
 Метод возвращает толщину (вес) линии выноски с указанным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.LineWeight GetLeaderLineWeight( int leaderLineIndex );
Копировать Код
Public Function GetLeaderLineWeight( leaderLineIndex As Integer ) As DatabaseServices.LineWeight
 Параметры
 Параметры
 Описание
 leaderLineIndex
 Индекс линии выноски. Тип int.
 Возвращает
 Возвращает толщину (вес) линии выноски. Перечисление DatabaseServices.LineWeight.
 Описание
 Метод возвращает толщину (вес) линии выноски с указанным индексом.
 Ссылки
 Teigha.DatabaseServices.MLeader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!