Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.NurbSurface.Evaluate
 Послать отзыв
 Метод предназначен для вычисления 3D-точки на NURBS поверхности для заданных значений параметров (dU, dV).
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d Evaluate( double dU, double dV );
Копировать Код
Public Function Evaluate( dU As Double, dV As Double ) As Point3d
 Параметры
 Параметры
 Описание
 dU
 Параметр в направлении U. Тип double.
 dV
 Параметр в направлении V. Тип double.
 Возвращает
 Возвращает 3D-точку на NURBS поверхности. Тип Point3d.
 Описание
 Метод предназначен для вычисления 3D-точки на NURBS поверхности для заданных значений параметров (dU, dV).
 Замечания
 Если поверхность не содержит никакой NURBS информации, выбрасывается исключение eFail. Если любое из значений dU или dV выходит за пределы допустимого диапазона, генерируется исключение eOutOfRange. Если этот метод в конкретном моделере не реализован, выбрасывается исключение eNotImplementedYet.
 Ссылки
 Teigha.DatabaseServices.NurbSurface, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!