Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Событие Database.PartialOpenNotice
 Послать отзыв
 Синтаксис
C#
Visual Basic
public event EventHandler PartialOpenNotice;
Public Event PartialOpenNotice As EventHandler
 Описание
 Событие возникает сразу перед попыткой частично открыть базу данных.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!