Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.IsLinked
 Послать отзыв
 Метод позволяет определить, связана ли ячейка с источником данных.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual bool IsLinked( int row, int column );
Копировать Код
Public virtual Function IsLinked( row As Integer, column As Integer ) As Boolean
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 col
 Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
 Возвращает
 Возвращает true, если ячейка связана, и false, если нет.
 Описание
 Метод позволяет определить, связана ли ячейка с источником данных.
 Замечания
 Для получения того же результата предпочтительнее использовать Table.Cells[row,column].IsLinked.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!