Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Перечисление Teigha.DatabaseServices.EvalFields
 Послать отзыв
 This is record Teigha::DatabaseServices::EvalFields.
 Синтаксис
C#
Visual Basic
[Flags] public enum EvalFields { NoFlags = 0, Recursive = 1 }
<Flags> Public Enum EvalFields NoFlags = 0 Recursive = 1 End Enum
 Ваши комментарии по поводу этого топика: Послать отзыв!