Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.PointOnCurve3d.GetPointAtParameter
 Послать отзыв
 Метод восстанавливает параметрическое представление кривой и возвращает 3D-точку, координаты которой соответствуют указанному значению параметра.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d GetPointAtParameter( double parameter );
Копировать Код
Public Function GetPointAtParameter( parameter As Double ) As Point3d
 Параметры
 Параметры
 Описание
 parameter
 Входное значение параметра. Тип double.
 Возвращает
 Возвращает 3D-точку, положение которой определяется точкой на кривой с указанным значением параметра. Тип Point3d.
 Описание
 Метод восстанавливает параметрическое представление кривой и возвращает 3D-точку, координаты которой соответствуют указанному значению параметра.
 Ссылки
 Teigha.Geometry.PointOnCurve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!