Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Matrix3d.==
 Послать отзыв
 Оператор равенства для класса Matrix3d.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool operator == ( Matrix3d a, Matrix3d b );
Копировать Код
Public Operator == ( a As Matrix3d, b As Matrix3d )
 Параметры
 Параметры
 Описание
 a
 Левый операнд. Тип Matrix3d.
 b
 Правый операнд. Тип Matrix3d.
 Возвращает
 Возвращает true, если совпадают значения у каждой пары соответствующих элементов двух матриц, иначе - false.
 Описание
 Оператор == позволяет проверить совпадение двух указанных матриц на основе их поэлементного сравнения. Возвращает true в случае совпадения матриц.
 Ссылки
 Teigha.Geometry.Matrix3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!