Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SectionSettings.SetEdgeTransparency
 Послать отзыв
 Метод позволяет задать значение прозрачности рёбер геометрии указанного типа.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetEdgeTransparency( SectionType nSecType, SectionGeometry nGeometry, int nTransparency );
Копировать Код
Public Sub SetEdgeTransparency( nSecType As SectionType, nGeometry As SectionGeometry, nTransparency As Integer )
 Параметры
 Параметры
 Описание
 nSecType
 Тип сечения. Перечисление SectionType.
 nGeometry
 Типы элементов геометрии сечения. Перечисление SectionGeometry.
 nTransparency
 Значение прозрачности рёбер геометрии указанного типа. Тип int.
 Описание
 Метод позволяет задать значение прозрачности рёбер геометрии указанного типа.
 Ссылки
 Teigha.DatabaseServices.SectionSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!