Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Viewport.SetSun
 Послать отзыв
 Метод позволяет задать солнечное освещение (бесконечно удаленный источник света) для данного видового экрана.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.ObjectId SetSun( ref DBObject sun );
Копировать Код
Public Function SetSun( ByRef sun As DBObject ) As DatabaseServices.ObjectId
 Параметры
 Параметры
 Описание
 sun
 Объект Солнца. Тип DBObject.
 Возвращает
 Возвращает идентификатор установленного источника солнечного освещения в базе данных. Тип DatabaseServices.ObjectId.
 Описание
 Метод позволяет задать солнечное освещение (бесконечно удаленный источник света) для данного видового экрана.
 Ссылки
 Teigha.DatabaseServices.Viewport, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!