Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Point3d.OrthoProject
 Послать отзыв
 Метод создает точку, которая является ортогональной проекцией данной точки на указанную плоскость.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d OrthoProject( ref Plane plane );
Копировать Код
Public Function OrthoProject( ByRef plane As Plane ) As Point3d
 Параметры
 Параметры
 Описание
 plane
 Плоскость проецирования. Тип Plane.
 Возвращает
 Возвращает точку Point3d, которая является ортогональной проекцией данной точки на плоскость plane.
 Описание
 Метод создает точку, которая является ортогональной проекцией данной точки на указанную плоскость plane. Направление проецирования определяется нормалью к этой плоскости.
 Ссылки
 Teigha.Geometry.Point3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!