Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ObjectId.OriginalDatabase
 Послать отзыв
 Если этот ObjectId находится в базе данных внешних ссылок (xref database), и связанный с ним объект был перенаправлен в главную базу данных, то данное свойство возвращает указатель на базу данных внешних ссылок. Если связанный с этим ObjectId объект не из базы данных внешних ссылок или не был перенаправлен, то значение этого свойства совпадает с ObjectId.Database.
 Синтаксис
C#
Visual Basic
Копировать Код
public Database OriginalDatabase;
Копировать Код
Public Property OriginalDatabase() As Database
 Возвращает
 Возвращает объект типа DatabaseServices.Database.
 Описание
 Если этот ObjectId находится в базе данных внешних ссылок (xref database), и связанный с ним объект был перенаправлен в главную базу данных, то данное свойство возвращает указатель на базу данных внешних ссылок. Если связанный с этим ObjectId объект не из базы данных внешних ссылок или не был перенаправлен, то значение этого свойства совпадает с ObjectId.Database.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.ObjectId, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!