Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.GraphicsInterface.Drawable.SubWorldDraw
 Послать отзыв
 Метод создает независимое от видовых представлений геометрическое представление этого объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool SubWorldDraw( ref GraphicsInterface.WorldDraw wd );
Копировать Код
Public Function SubWorldDraw( ByRef wd As GraphicsInterface.WorldDraw ) As Boolean
 Параметры
 Параметры
 Описание
 wd
 Входной интерфейс WorldDraw. Тип GraphicsInterface.WorldDraw.
 Возвращает
 Возвращает true, только если геометрическое представление объекта не зависит от видового экрана. Возвращаемое значение false указывает, что какая-то часть графики объекта зависит от видового представления, поэтому 3D GS должна вызвать ViewportDraw(), чтобы для такого объекта получить законченную геометрию и полный набор атрибутов.
 Описание
 Метод создает независимое от видовых представлений геометрическое представление этого объекта. Ничего не делает в текущей реализации. Эту функцию можно переопределить в пользовательских классах.
 Ссылки
 Teigha.DatabaseServices.DBObject, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!