Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 ViewportTableRecord.SetPreviousBackground(ObjectId, DrawableType)
 Послать отзыв
 Метод не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetPreviousBackground(ObjectId value, DrawableType type)
Копировать Код
Public Sub SetPreviousBackground(value As ObjectId, type As DrawableType)
 Ссылки
 ViewportTableRecord Класс, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!