Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AbstractViewPE.GetViewExtents
 Послать отзыв
 Метод предоставляет границы в системе координат глаза связанного видового экрана.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool GetViewExtents( ref BoundBlock3d extents );
Копировать Код
Public Function GetViewExtents( ByRef extents As BoundBlock3d ) As Boolean
 Параметры
 Параметры
 Описание
 extents
 Выходные границы. Тип BoundBlock3d.
 Возвращает
 Возвращает true в случае успешного завершения метода. В противном случае возвращает false.
 Описание
 Метод предоставляет границы в системе координат глаза связанного видового экрана.
 Ссылки
 Teigha.DatabaseServices.AbstractViewPE, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!