Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ConstrainType
 Послать отзыв
 Данное перечисление определяет допустимые варианты ограничения геометрии спирали.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum ConstrainType { TurnHeight = 0, Turns = 1, Height = 2 }
Копировать Код
Public Enum ConstrainType TurnHeight = 0 Turns = 1 Height = 2 End Enum
 Члены
 Члены
 Описание
 TurnHeight
 Значение: 0. Ограничивается высота витка спирали.
 Turns
 Значение: 1. Ограничивается количество витков спирали.
 Height
 Значение: 2. Ограничивается высота спирали.
 Описание
 Данное перечисление определяет допустимые варианты ограничения геометрии спирали.
 Ограничения используются для того, чтобы сделать переменный параметр геометрической модели равным некоторой наперёд заданной величине. Например, если установить ограничение высоты спирали, изменения любых других ее параметров на высоту спирали уже не влияют.
 При использовании ограничения становится существенным порядок, в котором вы задаёте свойства спирали. Скажем, чтобы ограничить количество витков в спирали, следует задать количество витков ДО указания высоты спирали или высоты витка.
 Ваши комментарии по поводу этого топика: Послать отзыв!