Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.EllipticalCylinder.Set
 Послать отзыв
 Метод позволяет переопределить у данного объекта точку начала координат, малый и большой радиусы, направляющие векторы оси симметрии цилиндра и его большой оси, интервал высоты, а также начальный и конечный углы.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Set( double minorRadius, double majorRadius, Point3d origin, Vector3d axisOfSymmetry, Vector3d referenceAxis, ref Interval height, double startAngle, double endAngle );
Копировать Код
Public Sub [Set]( minorRadius As Double, majorRadius As Double, origin As Point3d, axisOfSymmetry As Vector3d, referenceAxis As Vector3d, ByRef height As Interval, startAngle As Double, endAngle As Double )
 Параметры
 Параметры
 Описание
 minorRadius
 Малый радиус эллиптического цилиндра. Тип double.
 majorRadius
 Большой радиус эллиптического цилиндра. Тип double.
 origin
 Начало координат эллиптического цилиндра. Тип Point3d.
 axisOfSymmetry
 Направляющий вектор оси симметрии цилиндра. Тип Vector3d.
 height
 Интервал высоты эллиптического цилиндра. Тип Interval.
 startAngle
 Начальный угол цилиндра. Тип double.
 endAngle
 Конечный угол цилиндра. Тип double.
 referenceAxis
 Направляющий вектор большой оси эллиптического цилиндра. Тип Vector3d.
 Описание
 Метод позволяет переопределить у данного объекта точку начала координат, малый и большой радиусы, направляющие векторы оси симметрии цилиндра и его большой оси, интервал высоты, а также начальный и конечный углы.
 Ссылки
 Teigha.Geometry.EllipticalCylinder, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!