Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObject.RemoveField(ObjectId)
 Послать отзыв
 Метод предназначен для удаления поля с указанным идентификатором.
 Синтаксис
C#
Visual Basic
Копировать Код
public void RemoveField(ObjectId id);
Копировать Код
Public Sub RemoveField(id As ObjectId)
 Параметры
 Параметры
 Описание
 id
 Идентификатор удаляемого из объекта поля. Тип ObjectId
 Возвращает
 Возвращает идентификатор удалённого объекта. Тип ObjectId
 Описание
 Метод удаляет поле с указанным ObjectId.
 Ссылки
 Teigha.DatabaseServices.DBObject, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!