Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObject.IsNotifying
 Послать отзыв
 Свойство предоставляет информацию, отправляет ли в данный момент объект уведомление о событии.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsNotifying;
Копировать Код
Public Property IsNotifying() As bool
 Возвращает
 Возвращает тип данных bool.
 Описание
 Возвращает true, если объект находится в процессе посылки уведомления о событии.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.DBObject, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!