Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 ViewportTableRecord.GridEnabled
 Послать отзыв
 Свойство предназначено для включения/отключения отображения сетки в пространстве модели.
 Синтаксис
C#
Visual Basic
public bool GridEnabled;
Public Property GridEnabled() As bool
 Возвращает
 Возвращает тип данных bool:
true – отображение сетки включено;
false – отображение сетки выключено.
 Описание
 Свойство позволяет включать/отключать отображение сетки в пространстве модели.
 В интерфейсе свойство настраивается через диалоговое окно «Режимы черчения» для каждого видового экрана отдельно. Окно «Режимы черчения» можно открыть либо командой DDRMODES, DDSETTINGS, либо через меню Сервис -> Режимы черчения…
 Условия
 Чтение и запись.
 Ссылки
 ViewportTableRecord Класс, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!