Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Sphere.Set
 Послать отзыв
 Метод позволяет переопределить все параметры данной сферической поверхности.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Set( double radius, Point3d center, Vector3d northAxis, Vector3d referenceAxis, double startAngleU, double endAngleU, double startAngleV, double endAngleV );
Копировать Код
Public Sub Set( radius As Double, center As Point3d, northAxis As Vector3d, referenceAxis As Vector3d, startAngleU As Double, endAngleU As Double, startAngleV As Double, endAngleV As Double )
 Параметры
 Параметры
 Описание
 radius
 Радиус сферы. Тип double.
 center
 Точка центра сферы. Тип Point3d.
 northAxis
 Направление на северный полюс из центра сферы. Тип Vector3d.
 referenceAxis
 Направление, определяющее положение нулевого меридиана. Тип Vector3d.
 startAngleU
 Начальная долгота, определяемая параметром U. Тип double. В случае полной (замкнутой) сферы угол должен быть равен -PI/2 .
 endAngleU
 Конечная долгота, определяемая параметром U. Тип double. В случае полной (замкнутой) сферы угол должен быть равен +PI/2 .
 startAngleV
 Начальная широта, определяемая параметром V. Тип double. В случае полной (замкнутой) сферы угол должен быть равен -PI.
 endAngleV
 Конечная широта, определяемая параметром V. Тип double. В случае полной (замкнутой) сферы угол должен быть равен +PI.
 Описание
 Метод позволяет переопределить все параметры данной сферической поверхности, задав новые центр и радиус, направления на северный полюс и нулевой меридиан, а также новые пределы изменения параметров по широте и долготе.
 Ссылки
 Teigha.Geometry.Sphere, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!