Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.SetTextRotation
 Послать отзыв
 Метод задает угол поворота текста в указанной ячейке. Допустимые углы кратны углу 90 градусов.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetTextRotation( int row, int col, RotationAngle rot );
Копировать Код
Public virtual Sub SetTextRotation( row As Integer, col As Integer, rot As RotationAngle )
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 col
 Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
 rot
 Угол поворота текста из перечисления RotationAngle.
 Описание
 Метод задает угол поворота текста в указанной ячейке. Метод принимает следующие значения угла поворота из перечисления RotationAngle: Degrees000, Degrees090, Degrees180, and Degrees270.
 Замечания
 Для получения того же результата предпочтительнее использовать Table.Cells[row,column].Contents[i].Rotation.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!