Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.ExternalCurve3d
 Послать отзыв
 Класс ExternalCurve3d представляет 3D-кривые, определения которых являются внешними по отношению к геометрической библиотеке nanoCAD.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Geometry::Entity3d Teigha::Geometry::Curve3d Teigha::Geometry::ExternalCurve3d
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdGeExternalCurve3d")] public sealed class ExternalCurve3d : Curve3d
Копировать Код
<Wrapper("OdGeExternalCurve3d")> Public NotInheritable Class ExternalCurve3d Inherits Curve3d
 Описание
 Класс ExternalCurve3d представляет 3D-кривые, определения которых являются внешними по отношению к геометрической библиотеке nanoCAD.
 С экземплярами ExternalCurve2d можно работать как с любыми объектами Curve3d. Доступ к ExternalCurve3d можно получить так же, как к кривой Curve3d, если она существует. Кроме того, возможно получить доступ к внешним данным в их нативной форме (что может оказаться более эффективным). Одним из примеров использования ExternalCurve3d является доступ к кривым ACIS.
 Следует, однако, иметь ввиду, что определения внешних кривых отличаются от соответствующих определений в геометрической библиотеке nanoCAD. Например, могут отличаться способы параметризации кривых.
 Методы
 Конструкторы
 Teigha.Geometry.ExternalCurve3d
 Имя
 Описание
 ExternalCurve3d
 Конструктор по умолчанию класса ExternalCurve3d.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Geometry.Entity3d
 Имя
 Описание
 Entity3d Методы
 Ниже перечислены методы класса Entity3d.
 Teigha.Geometry.Curve3d
 Имя
 Описание
 Curve3d Методы
 Ниже перечислены методы класса Curve3d.
 Curve3d Свойства
 Ниже перечислены свойства класса Curve3d.
 Teigha.Geometry.ExternalCurve3d
 Имя
 Описание
 ExternalCurve3d Методы
 Ниже перечислены методы класса ExternalCurve3d.
 ExternalCurve3d Свойства
 Ниже перечислены свойства класса ExternalCurve3d.
 Ссылки
 ExternalCurve3d Методы, ExternalCurve3d Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!