Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AbstractViewportData.IsUcsIconAtOrigin
 Послать отзыв
 Свойство IsUcsIconAtOrigin позволяет определить, отображается ли в видовом экране значок UCS (ПСК) в начале пользовательской системы координат.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsUcsIconAtOrigin;
Копировать Код
Public Property IsUcsIconAtOrigin As Boolean
 Возвращает
 Возвращает true, если экране значок UCS (ПСК) отображается в начале пользовательской системы координат. В противном случае возвращает false.
 Описание
 Свойство IsUcsIconAtOrigin позволяет определить, отображается ли в видовом экране значок UCS (ПСК) в начале пользовательской системы координат.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.AbstractViewportData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!