Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GeomRef
 Послать отзыв
 Класс GeomRef является базовым для конкретных производных классов, таких как EdgeRef, FaceRef и VertexRef. Эти простые классы, которые хранят ссылку на подобъект объекта чертежа и используются главным образом не для хранения, а для передачи информации о геометрии подобъекта.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::DatabaseServices::GeomRef
 Синтаксис
C#
Visual Basic
Копировать Код
[Teigha.Runtime.Wrapper("AcDbGeomRef"), TypeDescriptionProvider("Teigha.ComponentModel.TypeDescriptionProvider`1[[Teigha.DatabaseServices.GeomRef, TD_MgdDbConstraints]], TD_MgdDbConstraints")] public class GeomRef : Teigha.Runtime.RXObject;
Копировать Код
<Teigha.Runtime.Wrapper("AcDbGeomRef"), TypeDescriptionProvider("Teigha.ComponentModel.TypeDescriptionProvider`1[[Teigha.DatabaseServices.GeomRef, TD_MgdDbConstraints]], TD_MgdDbConstraints")> Public Class GeomRef Inherits Teigha.Runtime.RXObject
 Описание
 Класс GeomRef является базовым для конкретных производных классов, таких как EdgeRef, FaceRef и VertexRef. Эти простые классы, которые хранят ссылку на подобъект объекта чертежа и используются главным образом не для хранения, а для передачи информации о геометрии подобъекта.
 Ссылки на подобъекты не являются постоянными. При всяком изменении или перевычислении родительского объекта ссылка на его подобъект становится недействительной.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.DatabaseServices.GeomRef
 Имя
 Описание
 GeomRef Методы
 Ниже перечислены методы класса GeomRef.
 GeomRef Свойства
 Ниже перечислены свойства класса GeomRef.
 Ссылки
 GeomRef Методы, GeomRef Свойства, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!