Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Solid3d.ExtrudeFaces
 Послать отзыв
 Метод позволяет выдавить массив граней твердого тела на указанную длину с заданным углом наклона.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void ExtrudeFaces( ref SubentityId[] subentityIds, double height, double taper );
Копировать Код
Public Overridable Sub ExtrudeFaces( ByRef subentityIds() As SubentityId, height As Double, taper As Double )
 Параметры
 Параметры
 Описание
 subentityIds
 Массив идентификаторов подобъекта для выдавливаемых граней. Тип SubentityId[].
 height
 Высота выдавливания. Тип double.
 taper
 Угол наклона при выдавливании (в радианах). Тип double. Диапазон допустимых значений [-PI/2..PI/2].
 Описание
 Метод позволяет выдавить массив граней твердого тела на указанную длину с заданным углом наклона.
 Длина выдавливания определяется параметром height и углом taper.
 Выдавливание каждой из граней выполняется вдоль нормали к ее плоскости, а направление определяется знаком заданной высоты height:
Если высота положительна, направление совпадает с вектором нормали (выдавливание граней наружу из твердого тела).
Если высота отрицательна, направление противоположно нормали (выдавливание граней внутрь твердого тела).
 Ссылки
 Teigha.DatabaseServices.Solid3d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!