Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Ellipse.StartAngle
 Послать отзыв
 Свойство StartAngle возвращает значение начального угла данного эллипса или эллиптической дуги.
 Синтаксис
C#
Visual Basic
Копировать Код
public double StartAngle;
Копировать Код
Public Property StartAngle As Double
 Возвращает
 Возвращает значение начального угла эллипса или эллиптической дуги. Тип double.
 Описание
 Свойство StartAngle возвращает значение начального угла данного эллипса или эллиптической дуги.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Ellipse, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!