Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.TableStyle.SetAlignment
 Послать отзыв
 Метод позволяет задать выравнивание в ячейках строк указанных типов.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetAlignment( CellAlignment alignment, int rowTypes );
Копировать Код
Public Overridable Sub SetAlignment( alignment As CellAlignment, rowTypes As Integer )
 Параметры
 Параметры
 Описание
 alignment
 Выравнивание в ячейках строки. Перечисление CellAlignment.
 rowTypes
 Один или комбинация типов строк таблицы, для которых задается выравнивание. Тип int. См. перечисление RowType.
 Описание
 Метод позволяет задать выравнивание в ячейках строк указанных типов.
 Ссылки
 Teigha.DatabaseServices.TableStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!