Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.LinearEntity3d.IsParallelTo
 Послать отзыв
 Метод позволяет с некоторой заданной точностью проверить параллельность данного объекта и указанного линейного объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsParallelTo( ref LinearEntity3d line, Tolerance tolerance );
Копировать Код
Public Function IsParallelTo( ByRef line As LinearEntity3d, tolerance As Tolerance ) As Boolean
 Параметры
 Параметры
 Описание
 line
 Входной линейный объект. Тип LinearEntity3d.
 tolerance
 Входная геометрическая точность. Тип Tolerance.
 Возвращает
 Возвращает true, если в пределах точности tolerance данный объект и объект line можно считать параллельными. В противном случае возвращает false.
 Описание
 Метод позволяет проверить с указанной точностью параллельность данного объекта и указанного линейного объекта.
 Ссылки
 Teigha.Geometry.LinearEntity3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!