Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.NurbSurface.PeriodInV
 Послать отзыв
 Свойство представляет значение периода в направлении v, если данная поверхность является периодической в направлении v.
 Синтаксис
C#
Visual Basic
Копировать Код
public double PeriodInV;
Копировать Код
Public ReadOnly Property PeriodInV As Double
 Возвращает
 Возвращает значение периода в указанном направлении. Тип double.
 Описание
 Свойство представляет значение периода в направлении v для данной поверхности. Это свойство действительно только тогда, когда поверхность периодична в направлении v.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.NurbSurface, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!