Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Surface.CreateInterferenceObjects
 Послать отзыв
 Метод позволяет создать новые объекты, которые представляют собой результат пересечения между данной поверхностью и указанным объектом чертежа.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual Entity[] CreateInterferenceObjects( ref Entity ent, int flags );
Копировать Код
Public Overridable Function CreateInterferenceObjects( ByRef ent As Entity, flags As Integer ) As Entity()
 Параметры
 Параметры
 Описание
 ent
 Объект чертежа, который анализируется на предмет пересечений с данной поверхностью. Тип Entity.
 flags
 Флаги пересечений. Тип int. Используется значение 0x00 - коллизии по умолчанию.
Возвращает массив объектов, явившихся результатом пересечений данной поверхности с объектом ent. Тип Entity[].
 Описание
 Метод позволяет создать новые объекты, которые представляют собой результат пересечения (коллизий) между данной поверхностью и указанным объектом чертежа.
 Если объекты пересечений поверхности и объекта ent не созданы, метод выбрасывает исключение eNoIntersection. Метод выбрасывает исключение eInvalidInput, если в качестве значения ent указан неподдерживаемый объект или NULL.
 Замечания
 Этот метод реализован только в среде пространственного моделирования Spatial Modeler.
 Ссылки
 Teigha.DatabaseServices.Surface, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!