Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MentalRayRenderSettings.Sampling
 Послать отзыв
 Свойство Sampling представляет минимальный и максимальный размеры выборки для оценки затенения пикселей при рендеринге.
 Синтаксис
C#
Visual Basic
Копировать Код
public MentalRayRenderSettingsTraitsIntegerRangeParameter Sampling;
Копировать Код
Public Property Sampling As MentalRayRenderSettingsTraitsIntegerRangeParameter
 Возвращает
 Возвращает минимальный и максимальный размеры выборки для оценки затенения пикселей. Тип MentalRayRenderSettingsTraitsIntegerRangeParameter.
 Описание
 Свойство Sampling представляет минимальный и максимальный размеры выборки для оценки затенения пикселей при рендеринге.
 Параметр MentalRayRenderSettingsTraitsIntegerRangeParameter представляет значения в диапазоне [-3..5]. Значение -3 соответствует размеру выборки 1 на каждые 64 пикселя (1/64), а значение 5 соответствует размеру выборки 1024 на один пиксель.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MentalRayRenderSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!