Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Arc.Center
 Послать отзыв
 Свойство предназначено для хранения координат центральной точки дуги.
 Синтаксис
C#
Visual Basic
public Point3d Center;
Public Property Center() As Point3d
 Возвращает
 Возвращает тип данных Point3d.
 Описание
 Возвращает или устанавливает центральную точку дуги. Она должна быть в WCS координатах.
 Замечания
 Значение центральной точки является эквивалентом DXF группового кода 10.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Arc, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!