Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DimAssoc.Erased
 Послать отзыв
 Метод уведомления, который вызывается в случае удаления или восстановления указанного объекта в базе данных.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Erased( ref DBObject pObj, bool erasing );
Копировать Код
Public Sub Erased( ByRef pObj As DBObject, erasing As Boolean )
 Параметры
 Параметры
 Описание
 pObj
 Указатель на объект, который должен быть стёрт или восстановлен. Тип DBObject.
 erasing
 Флаг, определяющий тип операции с объектом pObj - удаление (значение true) или восстановление (значение false). Тип bool.
 Описание
 Метод уведомления, который вызывается в случае удаления или восстановления указанного объекта в базе данных. Вид операции определяется входным флагом erasing.
 Ссылки
 Teigha.DatabaseServices.DimAssoc, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!