Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Aunits
 Послать отзыв
 Синтаксис
C#
Visual Basic
public int Aunits;
Public Property Aunits() As Integer
 Описание
 Возвращает или устанавливает текущее значение AUNITS для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!