Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DynamicDimensionData.Focal
 Послать отзыв
 Свойство Focal позволяет определить, находится ли в фокусе данный динамический размер.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool Focal;
Копировать Код
Public Property Focal As Boolean
 Возвращает
 Возвращает true, если этот динамический размер в фокусе. В противном случае возвращает false.
 Описание
 Свойство Focal позволяет определить, находится ли в фокусе данный динамический размер.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.DynamicDimensionData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!