Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Событие Database.DwgFileOpened
 Послать отзыв
 Синтаксис
C#
Visual Basic
public event DatabaseIOEventHandler DwgFileOpened;
Public Event DwgFileOpened As DatabaseIOEventHandler
 Описание
 Событие показывает, что файл чертежа начал считываться и размещаться в базе данных чертежа.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!