Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve2dCollection.Contains
 Послать отзыв
 Метод позволяет проверить, содержится ли в коллекции указанная кривая.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool Contains( ref Curve2d value );
Копировать Код
Public Function Contains( ByRef value As Curve2d ) As Boolean
 Параметры
 Параметры
 Описание
 value
 Проверяемая кривая. Тип Curve2d.
 Возвращает
 Возвращает true, если кривая value содержится в коллекции. В противном случае возвращает false.
 Описание
 Метод позволяет проверить, содержится ли в коллекции указанная кривая.
 Ссылки
 Teigha.Geometry.Curve2dCollection, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!