Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Matrix3d.GetScale
 Послать отзыв
 Метод предоставляет масштабный коэффициент этой матрицы.
 Синтаксис
C#
Visual Basic
Копировать Код
public double GetScale();
Копировать Код
Public Function GetScale() As Double
 Возвращает
 Возвращает масштабный коэффициент матрицы. Тип double.
 Описание
 Метод предоставляет масштабный коэффициент этой матрицы. Масштабный коэффициент равен квадратному корню из самого длинного вектора-столбца линейной части матрицы.
 Ссылки
 Teigha.Geometry.Matrix3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!