Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Light.EndLimitOffset
 Послать отзыв
 Свойство представляет конечный предел затухания источника света.
 Синтаксис
C#
Visual Basic
Копировать Код
public double EndLimitOffset;
Копировать Код
Public Property EndLimitOffset As Double
 Возвращает
 Возвращает удаление плоскости отсечения конечного предела затухания источника света. Тип double.
 Описание
 Свойство представляет конечный предел затухания источника света. В областях за этим пределом уровни освещенности считаются пренебрежимо малыми и не вычисляются.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Light, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!