Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.PsolWidth
 Послать отзыв
 Синтаксис
C#
Visual Basic
public double PsolWidth;
Public Property PsolWidth() As Double
 Описание
 Возвращает или устанавливает текущее значение PSOLWIDTH для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!