Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.RevolveOptionsCheckRevolveCurveOut.Closed
 Послать отзыв
 Свойство Closed позволяет определить, является ли объект профиля замкнутой областью.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool Closed;
Копировать Код
Public ReadOnly Property Closed As Boolean
 Возвращает
 Возвращает true, если объект является замкнутым. В противном случае возвращает false.
 Описание
 Свойство Closed позволяет определить, является ли объект профиля замкнутой областью.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.RevolveOptionsCheckRevolveCurveOut, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!