Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ImageBackground.Scale
 Послать отзыв
 Свойство предоставляет доступ к масштабу исходного изображения в данном объекте.
 Синтаксис
C#
Visual Basic
Копировать Код
public Scale2d Scale;
Копировать Код
Public Property Scale As Scale2d
 Возвращает
 Возвращает масштаб исходного изображения. Тип Scale2d.
 Описание
 Свойство предоставляет доступ к масштабу исходного изображения в данном объекте.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.ImageBackground, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!