Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.ExternalSurface.IsNativeSurface
 Послать отзыв
 Свойство IsNativeSurface позволяет проверить, поддерживает ли геометрическая библиотека платформы нативное представление данной внешней поверхности.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsNativeSurface;
Копировать Код
Public ReadOnly Property IsNativeSurface As Boolean
 Возвращает
 Возвращает true, если геометрическая библиотека платформы поддерживает нативное представление данной внешней поверхности. В противном случае возвращает false.
 Описание
 Свойство IsNativeSurface позволяет проверить, поддерживает ли геометрическая библиотека платформы нативное представление данной внешней поверхности.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.ExternalSurface, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!