Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocDependency.NotifyDependenciesOnObject
 Послать отзыв
 Метод уведомляет все ассоциативные зависимости указанного объекта DBObject о новом статусе.
 Синтаксис
C#
Visual Basic
Копировать Код
public void NotifyDependenciesOnObject( ref DBObject dbObj, AssocStatus newStatus );
Копировать Код
Public Sub NotifyDependenciesOnObject( ByRef dbObj As DBObject, newStatus As AssocStatus )
 Параметры
 Параметры
 Описание
 dbObj
 Объект базы данных DBObject, зависимости которого подлежат уведомлению о новом статусе. Тип DBObject.
 newStatus
 Новый статус в уведомлении. Значение из перечисления AssocStatus.
 Описание
 Метод получает все зависимости от данного DBObject и уведомляет их об изменении, устанавливая их статус.
 Уведомлению подлежат как первичные зависимости от объекта (когда идентификатор объекта возвращается свойством DependentOnObject зависимости), так и вторичные зависимости (когда объект оказывается одним из составных объектов в CompoundObjectId зависимости).
 Ссылки
 Teigha.DatabaseServices.AssocDependency, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!