Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotStyleTable.PlotStyleAt
 Послать отзыв
 Метод предоставляет стиль печати с указанным индексом в данной таблице PlotStyleTable.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual PlotStyle PlotStyleAt( int index );
Копировать Код
Public Overridable Function PlotStyleAt( index As Integer ) As PlotStyle
 Параметры
 Параметры
 Описание
 index
 Входной индекс стиля печати. Тип int.
 Возвращает
 Возвращает найденный стиль печати. Тип PlotStyle.
 Описание
 Метод предоставляет стиль печати с указанным индексом в данной таблице PlotStyleTable.
 Ссылки
 Teigha.DatabaseServices.PlotStyleTable, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!