Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PasswordOptions
 Послать отзыв
 Данное перечисление определяет опции запроса пароля.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum PasswordOptions { Default = 0, IsExternalReference = 2, UpperCase = 1 }
Копировать Код
Public Enum PasswordOptions Default = 0 IsExternalReference = 2 UpperCase = 1 End Enum
 Члены
 Члены
 Описание
 Default
 Значение: 0. Нет пользовательских опций.
 UpperCase
 Значение: 1. Пароль должен быть получен в верхнем регистре.
 IsExternalReference
 Значение: 2. Запрашивается доступ к внешней ссылке.
 Описание
 Данное перечисление определяет опции запроса пароля.
 Ваши комментарии по поводу этого топика: Послать отзыв!