Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DxfFiler.Position
 Послать отзыв
 Свойство обеспечивает доступ к позиции указателя ввода-вывода данного объекта DxfFiler.
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract long Position;
Копировать Код
Public MustOverride ReadOnly Property Position As Long
 Возвращает
 Возвращает позицию указателя ввода-вывода данного объекта DxfFiler. Тип long.
 Описание
 Свойство обеспечивает доступ к позиции указателя ввода-вывода данного объекта DxfFiler.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.DxfFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!