Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.HighlightOverrule.SetXDataFilter
 Послать отзыв
 Метод включает предварительную фильтрацию объектов по расширенным данным (xdata) прежде чем применить переопределения.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetXDataFilter( ref String registeredApplicationName );
Копировать Код
Public Sub SetXDataFilter( ByRef registeredApplicationName As String )
 Параметры
 Параметры
 Описание
 registeredApplicationName
 Имя зарегистрированного приложения, тип String.
 Описание
 Метод включает предварительную фильтрацию объектов по расширенным данным (xdata) прежде чем применить переопределения.
 Используйте этот метод, когда требуется, чтобы nanoCAD выполнял поиск xdata с registeredApplicationName в переопределяемом объекте перед вызовом любого из ваших переопределений.
 Ссылки
 Teigha.DatabaseServices.HighlightOverrule, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!