Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AttributeReference.FieldLength
 Послать отзыв
 Свойство позволяет получить или задать длину поля данного объекта AttributeReference.
 Синтаксис
C#
Visual Basic
Копировать Код
public int FieldLength;
Копировать Код
Public Property FieldLength() As Integer
 Возвращает
 Возвращает длину поля атрибута. Тип int.
 Описание
 Свойство позволяет получить или задать длину поля данного объекта AttributeReference.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.AttributeReference, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!