Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.KnotCollection.Item
 Послать отзыв
 Свойство Item представляет элемент коллекции с указанным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public double this[int A_0];
Копировать Код
Default Public Property Item( A_0 As Integer ) As Double
 Параметры
 Параметры
 Описание
 A_0
 Входной индекс элемента коллекции. Тип int.
 Возвращает
 Возвращает элемент коллекции с указанным индексом. Тип double.
 Описание
 Свойство Item представляет элемент коллекции с указанным индексом.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.Geometry.KnotCollection, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!