Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbCurve3d.SetFitData
 Послать отзыв
 Метод задает новые определяющие данные в этом объекте и перевычисляет сплайн.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetFitData( ref Point3dCollection fitPoints, Vector3d startTangent, Vector3d endTangent, KnotParameterizationEnum knotParam, Tolerance fitTolerance );
Копировать Код
Public Sub SetFitData( ByRef fitPoints As Point3dCollection, startTangent As Vector3d, endTangent As Vector3d, knotParam As KnotParameterizationEnum, fitTolerance As Tolerance )
 Параметры
 Параметры
 Описание
 fitPoints
 Определяющие точки. Тип Point3dCollection.
 startTangent
 Вектор касательной в начальной точке. Тип Vector3d.
 endTangent
 Вектор касательной в конечной точке. Тип Vector3d.
 knotParam
 Метод узловой параметризации сплайна. Тип KnotParameterizationEnum.
 fitTolerance
 Геометрическая точность интерполяции. Тип Tolerance.
 Описание
 Метод заменяет все существующие данные сплайна (определяющие данные или данные NURBS) новыми определяющими точками, векторами касательных на концах, включая метод узловой параметризации и точность интерполяции.
 Если аргумент fitTolerance не равен 0, то построенный сплайн может не проходить точно через определяющие точки, но максимальное отклонение построенного сплайна от любой определяющей точки не будет превышать fitTolerance.
 Ссылки
 Teigha.Geometry.NurbCurve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!