Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LineAngularDimension2.arcPoint
 Послать отзыв
 Свойство представляет 3D-точку, определяющую положение размерной дуги данного размера.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d arcPoint;
Копировать Код
Public Property arcPoint As Point3d
 Возвращает
 Возвращает точку на размерной дуге (в мировой системе координат, WCS). Тип Point3d.
 Описание
 Свойство представляет 3D-точку, определяющую положение размерной дуги данного размера.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.LineAngularDimension2, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!