Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotSettings
 Послать отзыв
 Этот класс представляет настройки печати в экземпляре базы данных.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::GraphicsInterface::Drawable Teigha::DatabaseServices::DBObject Teigha::DatabaseServices::PlotSettings
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("AcDbPlotSettings")] public class PlotSettings : DBObject
Копировать Код
<Wrapper("AcDbPlotSettings")> Public Class PlotSettings Inherits DBObject
 Описание
 Этот класс представляет настройки печати в виде именованного описания в экземпляре базы данных. Объекты настроек PlotSettings сохраняются в словаре PlotSettingsDictionary.
 Методы
 Конструкторы
 Teigha.GraphicsInterface.Drawable
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 Drawable
 Конструктор класса Teigha.GraphicsInterface.Drawable. (Унаследован от Drawable)
 Teigha.DatabaseServices.DBObject
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 DBObject
 Конструктор. (Унаследован от DBObject)
 Teigha.DatabaseServices.PlotSettings
 Имя
 Описание
 PlotSettings
 Конструктор класса PlotSettings. Создает экземпляр настроек печати на выбор для пространства модели, либо для пространства листа.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.GraphicsInterface.Drawable
 Имя
 Описание
 Drawable Методы
 Ниже перечислены методы класса Drawable.
 Drawable Свойства
 Ниже перечислены свойства класса Drawable.
 Teigha.DatabaseServices.DBObject
 Имя
 Описание
 DBObject Методы
 Ниже перечислены методы класса DBObject.
 DBObject Свойства
 Ниже перечислены свойства класса DBObject.
 DBObject События
 Ниже перечислены события класса DBObject.
 Teigha.DatabaseServices.PlotSettings
 Имя
 Описание
 PlotSettings Методы
 Ниже перечислены методы класса PlotSettings.
 PlotSettings Свойства
 Ниже перечислены свойства класса PlotSettings.
 Ссылки
 PlotSettings Методы, PlotSettings Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства, DBObject События
 Ваши комментарии по поводу этого топика: Послать отзыв!