Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeader.SetTextAttachmentType
 Послать отзыв
 Метод позволяет задать вариант расположения точки прикрепления выносной линии к многострочному тексту данного объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetTextAttachmentType( TextAttachmentType textAttachmentType, LeaderDirectionType leaderDirection );
Копировать Код
Public Sub SetTextAttachmentType( textAttachmentType As TextAttachmentType, leaderDirection As LeaderDirectionType )
 Параметры
 Параметры
 Описание
 textAttachmentType
 Тип прикрепления выносной линии к многострочному тексту из перечисления TextAttachmentType.
 leaderDirection
 Вариант ориентации полки из перечисления LeaderDirectionType.
 Описание
 Метод позволяет задать вариант расположения точки прикрепления выносной линии к многострочному тексту данного объекта.
 Ссылки
 Teigha.DatabaseServices.MLeader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!