Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DictionaryWithDefaultDictionary.DictionaryWithDefaultDictionary
 Послать отзыв
 Конструктор по умолчанию.
 Синтаксис
C#
Visual Basic
Копировать Код
public DictionaryWithDefaultDictionary();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию.
 Ссылки
 Teigha.DatabaseServices.DictionaryWithDefaultDictionary, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!