Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.ByLayerLinetype
 Послать отзыв
 Синтаксис
C#
Visual Basic
public DatabaseServices::ObjectId ByLayerLinetype;
Public Property ByLayerLinetype() As DatabaseServices.ObjectId
 Описание
 Возвращает Id объекта LinetypeTableRecord базы данных (BYLAYER).
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!