Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CellRange.GetDataLink
 Послать отзыв
 Метод позволяет получить коллекцию внешних ссылок в этом диапазоне ячеек.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectIdCollection GetDataLink();
Копировать Код
Public Function GetDataLink() As ObjectIdCollection
 Возвращает
 Возвращает коллекцию идентификаторов внешних ссылок. Тип ObjectIdCollection.
 Описание
 Метод позволяет получить коллекцию внешних ссылок в этом диапазоне ячеек.
 Ссылки
 Teigha.DatabaseServices.CellRange, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!