Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.HpInherit
 Послать отзыв
 Синтаксис
C#
Visual Basic
public bool HpInherit;
Public Property HpInherit() As bool
 Описание
 Возвращает или устанавливает логический признак, определенный значением HPINHERIT для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!