Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CellAlignment
 Послать отзыв
 Данное перечисление определяет варианты выравнивания текста в ячейке таблицы, которые доступны только для горизонтально ориентированного текста.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum CellAlignment { BottomCenter = 8, BottomLeft = 7, BottomRight = 9, MiddleCenter = 5, MiddleLeft = 4, MiddleRight = 6, TopCenter = 2, TopLeft = 1, TopRight = 3 }
Копировать Код
Public Enum CellAlignment BottomCenter = 8 BottomLeft = 7 BottomRight = 9 MiddleCenter = 5 MiddleLeft = 4 MiddleRight = 6 TopCenter = 2 TopLeft = 1 TopRight = 3 End Enum
 Члены
 Члены
 Описание
 TopLeft
 Значение: 1. Выравнивание текста по вертикали по верхней границе ячейки, по горизонтали - по левой границе ячейки.
 TopCenter
 Значение: 2. Выравнивание текста по вертикали по верхней границе ячейки, по горизонтали - по центру ячейки.
 TopRight
 Значение: 3. Выравнивание текста по вертикали по верхней границе ячейки, по горизонтали - по правой границе ячейки.
 MiddleLeft
 Значение: 4. Выравнивание текста по вертикали по центру ячейки, по горизонтали - по левой границе ячейки.
 MiddleCenter
 Значение: 5. Выравнивание текста по вертикали по центру ячейки, по горизонтали - по центру ячейки.
 MiddleRight
 Значение: 6. Выравнивание текста по вертикали по центру ячейки, по горизонтали - по правой границе ячейки.
 BottomCenter
 Значение: 8. Выравнивание текста по вертикали по нижней границе ячейки, по горизонтали - по центру ячейки.
 BottomLeft
 Значение: 7. Выравнивание текста по вертикали по нижней границе ячейки, по горизонтали - по левой границе ячейки.
 BottomRight
 Значение: 9. Выравнивание текста по вертикали по нижней границе ячейки, по горизонтали - по правой границе ячейки.
 Описание
 Данное перечисление определяет варианты выравнивания текста в ячейке таблицы, которые доступны только для горизонтально ориентированного текста.
 Ваши комментарии по поводу этого топика: Послать отзыв!