Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CircularArc3d.Set
 Послать отзыв
 Метод позволяет переопределить данную дугу по трем заданным точкам.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Set( Point3d startPoint, Point3d pointOnArc, Point3d endPoint );
Копировать Код
Public Sub Set( startPoint As Point3d, pointOnArc As Point3d, endPoint As Point3d )
 Параметры
 Параметры
 Описание
 startPoint
 Начальная точка дуги. Тип Point3d.
 pointOnArc
 Точка на дуге. Тип Point3d.
 endPoint
 Конечная точка дуги. Тип Point3d.
 Описание
 Метод позволяет переопределить данную дугу по трем заданным точкам.
 Замечания
 Входные точки не должны лежать на одной прямой.
 Ссылки
 Teigha.Geometry.CircularArc3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!