Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Line2dCollection.Contains
 Послать отзыв
 Метод позволяет проверить, содержится ли указанная линия в данной коллекции.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool Contains( ref Line2d value );
Копировать Код
Public Function Contains( ByRef value As Line2d ) As Boolean
 Параметры
 Параметры
 Описание
 value
 Проверяемая линия. Тип Line2d.
 Возвращает
 Возвращает true, если проверяемая линия присутствует в данной коллекции. В противном случае возвращает false.
 Описание
 Метод позволяет проверить, содержится ли указанная линия в данной коллекции.
 Ссылки
 Teigha.Geometry.Line2dCollection, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!