Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.TransactionManager
 Послать отзыв
 Синтаксис
C#
Visual Basic
public DatabaseServices::TransactionManager TransactionManager;
Public Property TransactionManager() As DatabaseServices.TransactionManager
 Описание
 Обеспечивает доступ к менеджеру транзакций базы данных.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!