Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocAction.ObjectThatOwnsNetworkInstance
 Послать отзыв
 Метод позволяет найти объект, владеющий сетью AssocNetwork, которой принадлежит данное действие AssocAction.
 Синтаксис
C#
Visual Basic
Копировать Код
public Teigha.DatabaseServices.ObjectId ObjectThatOwnsNetworkInstance();
Копировать Код
Public Function ObjectThatOwnsNetworkInstance() As Teigha.DatabaseServices.ObjectId
 Возвращает
 Возвращает ObjectId объекта DBObject, владеющего сетью AssocNetwork, которой принадлежит данное действие AssocAction. Тип DatabaseServices.ObjectId.
 Описание
 Метод позволяет найти ObjectId объекта DBObject, владеющего сетью AssocNetwork, которой принадлежит данное действие AssocAction.
 Начиная с данного действия AssocAction, этот метод проверяет как само это действие, так и его владельцев (в смысле "физической" принадлежности объектов в базе данных nanoCAD) до тех пор, пока не будет найдена сеть AssocNetwork, владельцем которой в "базе данных" не является другая сеть AssocNetwork. Затем решается обратная задача по отношению к методу AssocNetwork.GetInstanceFromObject(), т.е. находится такой объект DBObject, для которого метод GetInstanceFromObject() возвращает сеть AssocNetwork.
 Ссылки
 Teigha.DatabaseServices.AssocAction, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!