Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DataCellCollection.Insert
 Послать отзыв
 Метод позволяет вставить указанный объект DataCell в эту коллекцию по заданному индексу.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Insert( int index, ref DataCell value );
Копировать Код
Public Sub Insert( index As Integer, ByRef value As DataCell )
 Параметры
 Параметры
 Описание
 index
 Индекс, по которому вставляется объект value. Тип int.
 value
 Вставляемый в коллекцию объект. Тип DataCell.
 Описание
 Метод позволяет вставить указанный объект DataCell в эту коллекцию по заданному индексу. Если предоставленный индекс недействителен, метод выбрасывает исключение ArgumentOutOfRangeException.
 Ссылки
 Teigha.DatabaseServices.DataCellCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!