Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LayoutRenamedEventArgs.NewName
 Послать отзыв
 Свойство представляет новое имя измененного листа.
 Синтаксис
C#
Visual Basic
Копировать Код
public String NewName;
Копировать Код
Public ReadOnly Property NewName As String
 Возвращает
 Возвращает новое имя измененного листа. Тип String.
 Описание
 Свойство представляет новое имя измененного листа.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.LayoutRenamedEventArgs, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!