Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Cylinder.AxisOfSymmetry
 Послать отзыв
 Свойство AxisOfSymmetry представляет направление оси цилиндра.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d AxisOfSymmetry;
Копировать Код
Public ReadOnly Property AxisOfSymmetry As Vector3d
 Возвращает
 Возвращает направление оси цилиндра. Тип Vector3d.
 Описание
 Свойство AxisOfSymmetry представляет направление оси цилиндра.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.Cylinder, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!