Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeader.LeaderLineCount
 Послать отзыв
 Свойство представляет количество выносных линий у данного объекта MLeader. В текущей версии не реализовано. Используйте метод GetLeaderLineIndexes.
 Синтаксис
C#
Visual Basic
Копировать Код
public int LeaderLineCount;
Копировать Код
Public ReadOnly Property LeaderLineCount As Integer
 Возвращает
 Возвращает количество выносных линий. Тип int.
 Описание
 Свойство представляет количество выносных линий у данного объекта MLeader. В текущей версии не реализовано. Используйте метод GetLeaderLineIndexes.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.MLeader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!