Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Делегат Teigha.DatabaseServices.LayerStateDeletedEventHandler
 Послать отзыв
 This is type Teigha::DatabaseServices::LayerStateDeletedEventHandler.
 Синтаксис
C#
Visual Basic
public delegate LayerStateDeletedEventHandler();
Public Delegate Sub LayerStateDeletedEventHandler()
 Ваши комментарии по поводу этого топика: Послать отзыв!