Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector2d.Coordinate
 Послать отзыв
 Свойство Coordinate предоставляет доступ к координате данного вектора с указанным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public double this[int index];
Копировать Код
Default Public ReadOnly Property Coordinate( index As Integer ) As Double
 Параметры
 Параметры
 Описание
 index
 Индекс координаты. Тип int. 0 соответствует координате X, 1 – координате Y.
 Возвращает
 Возвращает значение координаты с индексом index. Тип double.
 Описание
 Свойство Coordinate предоставляет доступ к координате данного вектора с индексом index.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.Vector2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!