Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LoftOptions.DraftEndMag
 Послать отзыв
 Свойство возвращает величину вытягивания для поверхности у последнего поперечного сечения (end draft magnitude).
 Синтаксис
C#
Visual Basic
Копировать Код
public double DraftEndMag;
Копировать Код
Public ReadOnly Property DraftEndMag As Double
 Возвращает
 Возвращает величину вытягивания. Тип double.
 Описание
 Свойство возвращает величину вытягивания для поверхности у последнего поперечного сечения (end draft magnitude). Параметр управляет модулем вектора касательной к поверхности в последнем поперечном сечении. Значение по умолчанию — 0, т.е. на последнем поперечном сечении рассчитывается оптимальная величина.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.LoftOptions, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!