Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Torus.IsVortex
 Послать отзыв
 Свойство IsVortex позволяет проверить, равен ли большой радиус данного тора его малому радиусу.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsVortex;
Копировать Код
Public ReadOnly Property IsVortex As Boolean
 Возвращает
 Возвращает true, если большой радиус данного тора равен его малому радиусу. В противном случае возвращает false.
 Описание
 Свойство IsVortex позволяет проверить, равен ли большой радиус данного тора его малому радиусу.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.Torus, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!