Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.AltSuppressZeroFeet
 Послать отзыв
 Свойство позволяет управлять подавлением отображения нулевого значения целых футов в размере формата футы-дюймы для альтернативных единиц измерения.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool AltSuppressZeroFeet;
Копировать Код
Public Property AltSuppressZeroFeet As Boolean
 Возвращает
 Возвращает true, если подавление включено. В противном случае возвращает false.
 Описание
 Свойство позволяет включить или отменить подавление отображения нулевого значения футов в размере формата футы-дюймы, если значение размера меньше одного фута. Этот функционал работает только в случае, если для свойства Dimalt установлено значение true.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!