Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DxfFiler.ReadAngle
 Послать отзыв
 Метод возвращает значение угла из текущего элемента этого объекта Filer.
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract double ReadAngle();
Копировать Код
Public MustOverride Function ReadAngle() As Double
 Возвращает
 Возвращает значение угла. Тип double.
 Описание
 Метод возвращает значение угла из текущего элемента этого объекта Filer.
 Ссылки
 Teigha.DatabaseServices.DxfFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!