Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.EllipticalArc3d.IntersectWith
 Послать отзыв
 Метод вычисляет точки пересечения данной дуги с указанным плоским объектом, используя заданную геометрическую точность.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d[] IntersectWith( ref PlanarEntity plane, Tolerance tolerance );
Копировать Код
Public Function IntersectWith( ByRef plane As PlanarEntity, tolerance As Tolerance ) As Point3d()
 Параметры
 Параметры
 Описание
 plane
 Плоский объект, точки пересечения с которым требуется вычислить. Тип PlanarEntity.
 tolerance
 Заданная геометрическая точность. Тип Tolerance.
 Возвращает
 Возвращает массив из двух элементов. Тип Point3d[]. Первый элемент соответствует первой точке пересечения, а второй элемент соответствует второй точке пересечения (если она существует).
 Описание
 Метод вычисляет точки пересечения данной дуги с указанным плоским объектом с использованием заданной геометрической точности. Результатом является массив точек пересечения (если они существуют).
 Замечания
 В случае отсутствия точек пересечения метод возвращает null.
 Ссылки
 Teigha.Geometry.EllipticalArc3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!