Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MText.Text
 Послать отзыв
 Свойство представляет текстовое содержимое многострочного текста, очищенное от кодов форматирования.
 Синтаксис
C#
Visual Basic
Копировать Код
public String Text;
Копировать Код
Public ReadOnly Property Text As String
 Возвращает
 Возвращает очищенный от кодов форматирования текст данного объекта. Тип String.
 Описание
 Свойство представляет текстовое содержимое многострочного текста, очищенное от кодов форматирования.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.MText, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!