Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve3d.EvaluatePoint
 Послать отзыв
 Метод позволяет получить точку на кривой, которая соответствует указанному значению параметра.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d EvaluatePoint( double value );
Копировать Код
Public Function EvaluatePoint( value As Double ) As Point3d
 Параметры
 Параметры
 Описание
 value
 Входное значение параметра, которое соответствует искомой точке. Тип double.
 Возвращает
 Возвращает точку Point3d, которая соответствует значению параметра value.
 Описание
 Метод позволяет получить точку на кривой, которая соответствует указанному значению параметра.
 Ссылки
 Teigha.Geometry.Curve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!