Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.SetTextString
 Послать отзыв
 Метод позволяет задать текст как значение в указанной ячейке.
 Синтаксис
C#
Visual Basic
Копировать Код
public SetTextString( int row, int col, ref String value );
Копировать Код
Public Sub SetTextString( row As Integer, col As Integer, ByRef value As String )
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 col
 Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
 text
 Нуль-терминированная текстовая строка, тип String.
 Описание
 Метод позволяет задать текст как значение в ячейке, указанной индексами строки и столбца.
 Замечания
 Для получения того же результата предпочтительнее использовать Table.Cells[row,column].TextString.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!