Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.FieldToMText
 Послать отзыв
 Метод копирует текстовое поле из данного размера, если он содержит такое поле, и добавляет его копию к указанному объекту MText.
 Синтаксис
C#
Visual Basic
Копировать Код
public void FieldToMText( ref MText dimMText );
Копировать Код
Public Sub FieldToMText( ByRef dimMText As MText )
 Параметры
 Параметры
 Описание
 dimMText
 Входной объект, в который копируется поле. Тип MText.
 Описание
 Метод копирует текстовое поле из данного размера, если он содержит такое поле, и добавляет его копию к указанному объекту MText.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!