Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Entity.IsContentSnappable()
 Послать отзыв
 Метод проверяет, должен ли блок-контейнер участвовать в поиске точек объектной привязки (osnaps).
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsContentSnappable();
Копировать Код
Public Function IsContentSnappable() As bool
 Возвращает
 Возвращает тип данных bool: *true - если блок должен участвовать в поиске точек osnaps; *false - если блок должен быть проигнорирован.
 Описание
 Данный метод определяет, будет ли выполняться поиск точек объектной привязки (osnaps) внутри содержащего блока. Если метод возвращает true, это означает, что система должна исследовать блок на наличие точек привязки. Если возвращается false, блок игнорируется при выполнении операций, связанных с объектной привязкой.
 Ссылки
 Teigha.DatabaseServices.Entity, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!