Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocArrayPolarParameters.SetRadius
 Послать отзыв
 Метод позволяет установить новый радиус кругового массива.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetRadius( double val, ref String expression, ref String evaluatorId );
Копировать Код
Public Sub SetRadius( val As Double, ByRef expression As String, ByRef evaluatorId As String )
 Параметры
 Параметры
 Описание
 val
 Новое значение радиуса кругового массива. Тип double.
 expression
 Выражение для параметра. Тип String. Строка может быть пустой.
 evaluatorId
 Строковое представление идентификатора вычислителя. Тип String. Строка может быть пустой.
 Описание
 Метод позволяет установить новый радиус кругового массива.
 Если для параметра выражение отсутствует, строки expression и evaluatorId должны быть пустыми.
 Ссылки
 Teigha.DatabaseServices.AssocArrayPolarParameters, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!