Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PolylineVertex3d.VertexType
 Послать отзыв
 Свойство предоставляет доступ к типу вершины из перечисления Vertex3dType.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vertex3dType VertexType;
Копировать Код
Public Property VertexType() As Vertex3dType
 Возвращает
 Возвращает тип вершины из перечисления Vertex3dType.
 Описание
 Свойство предоставляет доступ к типу вершины из перечисления Vertex3dType.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.PolylineVertex3d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!