Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.HyperLink.Name
 Послать отзыв
 Свойство обеспечивает доступ к имени, которое связано с данным объектом HyperLink.
 Синтаксис
C#
Visual Basic
Копировать Код
public String Name;
Копировать Код
Public Property Name As String
 Возвращает
 Возвращает имя, связанное с данным объектом. Тип String.
 Описание
 Свойство обеспечивает доступ к имени, которое связано с данным объектом HyperLink.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.HyperLink, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!