Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Solid3d.CreateRevolvedSolid
 Послать отзыв
 Метод создает трехмерное твердое тело вращением указанной кривой, области или плоской поверхности вокруг заданной оси вращения.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void CreateRevolvedSolid( ref Entity profileEntity, Point3d axisPoint, Vector3d axisDir, double angleOfRevolution, double startAngle, ref RevolveOptions revolveOptions );
Копировать Код
Public Overridable Sub CreateRevolvedSolid( ByRef profileEntity As Entity, axisPoint As Point3d, axisDir As Vector3d, angleOfRevolution As Double, startAngle As Double, ByRef revolveOptions As RevolveOptions )
 Параметры
 Параметры
 Описание
 profileEntity
 Профиль в виде кривой, области или плоской поверхности, используемый для получения 3D-тела операцией вращения. Тип Entity.
 axisPoint
 Точка на оси вращения. Тип Point3d.
 axisDir
 Направляющий вектор оси вращения. Тип Vector3d.
 angleOfRevolution
 Угол поворота профиля в операции вращения (в радианах). Тип double.
 startAngle
 Начальный угол поворота (в радианах). Тип double. Если равен нулю, вращение начинается с текущей позиции объекта profileEntity.
 revolveOptions
 Опции операции вращения. Тип RevolveOptions.
 Описание
 Метод создает трехмерное твердое тело вращением объекта profileEntity (кривая, область или плоская поверхность) вокруг заданной оси вращения.
 Ось вращения определяется точкой (axisPoint) и вектором (axisDir). Вращение объекта ProfileEntity задается начальным углом startAngle и углом поворота angleOfRevolution против часовой стрелки вокруг направления axisDir.
 Этот метод реализован только в среде пространственного моделирования.
 Ссылки
 Teigha.DatabaseServices.Solid3d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!