Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector3d.IsCodirectionalTo
 Послать отзыв
 Метод позволяет проверить, является ли данный вектор сонаправленным входному вектору в пределах заданной точности.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsCodirectionalTo( Vector3d vector, Tolerance tolerance );
Копировать Код
Public Function IsCodirectionalTo( vector As Vector3d, tolerance As Tolerance ) As Boolean
 Параметры
 Параметры
 Описание
 vector
 Входной вектор для сравнения на сонаправленность. Тип Vector3d.
 tolerance
 Входная точность для сравнения векторов. Тип Tolerance.
 Возвращает
 Возвращает true, если в пределах заданной точности оба вектора можно считать сонаправленными. В противном случае возвращает false.
 Описание
 Метод позволяет проверить, является ли данный вектор сонаправленным входному вектору. Реализация приводит оба вектора к единичной длине, а затем проверяет их совпадение в пределах заданного допуска Tolerance.EqualVector(). Метод возвращает true, если это условие выполнено, и false в противном случае.
 Ссылки
 Teigha.Geometry.Vector3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!