Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Torus.Torus
 Послать отзыв
 Конструктор класса Torus. Создает экземпляр класса с указанными центром, осью симметрии и двумя радиусами.
 Синтаксис
C#
Visual Basic
Копировать Код
public Torus( double majorRadius, double minorRadius, Point3d origin, Vector3d axisOfSymmetry );
Копировать Код
Public Sub New( majorRadius As Double, minorRadius As Double, origin As Point3d, axisOfSymmetry As Vector3d )
 Параметры
 Параметры
 Описание
 majorRadius
 Большой радиус тора (радиус направляющей окружности тора). Тип double.
 minorRadius
 Малый радиус тора (радиус образующей окружности тора). Тип double.
 origin
 Точка центра тора (начало координат тора). Тип Point3d.
 axisOfSymmetry
 Ось симметрии тора (ось вращения тора). Тип Vector3d.
 Описание
 Конструктор класса Torus. Создает экземпляр класса с указанными центром, осью симметрии и двумя радиусами.
 Ссылки
 Teigha.Geometry.Torus, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!