Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.Dimrnd
 Послать отзыв
 Свойство задает или возвращает действительное число, используемое для округления линейных размеров в основных единицах измерения (но не значений допусков/отклонений).
 Синтаксис
C#
Visual Basic
Копировать Код
public double Dimrnd;
Копировать Код
Public Property Dimrnd As Double
 Возвращает
 Возвращает действительное число, используемое для округления линейных размеров. Тип double.
 Описание
 Свойство задает или возвращает действительное число, используемое для округления линейных размеров в основных единицах измерения (но не значений допусков/отклонений).
 Например, если для округления установлено значение 0,04, значение будет округлено до ближайшей единицы 0,04. Таким образом, 1,912 становится 1,92, 1,935 становится 1,92, 1,945 становится 1,96, а 1,972 становится 1,96. Если для округления установлено значение 1,0, значение будет округлено до ближайшего целого значения.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!