Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Ucsxdir
 Послать отзыв
 Синтаксис
C#
Visual Basic
public Vector3d Ucsxdir;
Public Property Ucsxdir() As Vector3d
 Описание
 Обеспечивает доступ к текущему значению UCSXDIR для базы данных.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!