Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Cone.IsClosed
 Послать отзыв
 Метод позволяет проверить с указанной точностью, является ли основание данного конуса полным кругом.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsClosed( Tolerance tolerance );
Копировать Код
Public Function IsClosed( tolerance As Tolerance ) As Boolean
 Параметры
 Параметры
 Описание
 tolerance
 Заданная точность вычислений. Тип Tolerance.
 Возвращает
 Возвращает true тогда и только тогда, когда основание этого конуса является полным кругом. В противном случае возвращает false.
 Описание
 Метод позволяет проверить с указанной точностью, является ли основание данного конуса полным кругом.
 Ссылки
 Teigha.Geometry.Cone, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!