Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ClipBoundaryType
 Послать отзыв
 Перечисление ClipBoundaryType определяет типы границ обрезки растровых изображений.
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdDbRasterImage.ClipBoundaryType")] public enum ClipBoundaryType { Invalid = 0, Rectangle = 1, Poly = 2 }
Копировать Код
<Wrapper("OdDbRasterImage.ClipBoundaryType")> Public Enum ClipBoundaryType Invalid = 0 Rectangle = 1 Poly = 2 End Enum
 Члены
 Члены
 Описание
 Invalid
 Значение: 0. Недействительная граница обрезки.
 Rectangle
 Значение: 1. Граница обрезки в виде прямоугольника, выровненного по осям пиксельной системы координат изображения.
 Poly
 Значение: 2. Граница обрезки в виде многоугольника, все вершины которого расположены в пределах границ изображения.
 Описание
 Перечисление ClipBoundaryType определяет типы границ обрезки растровых изображений.
 Ваши комментарии по поводу этого топика: Послать отзыв!