Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ResultBuffer.Create
 Послать отзыв
 Этот метод создает управляемый объект ResultBuffer на основе объекта, переданного неуправляемым указателем buffer.
 Синтаксис
C#
Visual Basic
Копировать Код
public ResultBuffer Create( IntPtr buffer, bool autoDelete );
Копировать Код
Public Function Create( buffer As IntPtr, autoDelete As Boolean ) As ResultBuffer
 Параметры
 Параметры
 Описание
 buffer
 Указатель типа IntPtr.
 autoDelete
 Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.
 Возвращает
 Возвращает экземпляр ResultBuffer.
 Описание
 Этот метод создает управляемый объект ResultBuffer на основе объекта, переданного неуправляемым указателем buffer.
 Ссылки
 Teigha.DatabaseServices.ResultBuffer, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!