Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FeatureControlFrame.FeatureControlFrame
 Послать отзыв
 Конструктор по умолчанию класса FeatureControlFrame.
 Синтаксис
C#
Visual Basic
Копировать Код
public FeatureControlFrame();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса FeatureControlFrame.
 Ссылки
 Teigha.DatabaseServices.FeatureControlFrame, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!