Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbCurve2d.FitKnotParameterization
 Послать отзыв
 Свойство FitKnotParameterization представляет метод узловой параметризации данного сплайна.
 Синтаксис
C#
Visual Basic
Копировать Код
public KnotParameterizationEnum FitKnotParameterization;
Копировать Код
Public Property FitKnotParameterization As KnotParameterizationEnum
 Возвращает
 Возвращает метод узловой параметризации сплайна. Перечисление KnotParameterizationEnum.
 Описание
 Свойство FitKnotParameterization представляет метод узловой параметризации данного сплайна.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.Geometry.NurbCurve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!