Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeaderStyle
 Послать отзыв
 Данный класс представляет объекты MLeaderStyle в базе данных.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::GraphicsInterface::Drawable Teigha::DatabaseServices::DBObject Teigha::DatabaseServices::MLeaderStyle
 Синтаксис
C#
Visual Basic
Копировать Код
[TypeDescriptionProvider("Teigha.ComponentModel.TypeDescriptionProvider`1[[Teigha.DatabaseServices.MLeaderStyle, TD_Mgd]], TD_Mgd")] [Wrapper("AcDbMLeaderStyle")] public class MLeaderStyle : DBObject
Копировать Код
<TypeDescriptionProvider("Teigha.ComponentModel.TypeDescriptionProvider`1[[Teigha.DatabaseServices.MLeaderStyle, TD_Mgd]], TD_Mgd")> <Wrapper("AcDbMLeaderStyle")> Public Class MLeaderStyle Inherits DBObject
 Описание
 Данный класс представляет объекты MLeaderStyle в базе данных.
 Методы
 Конструкторы
 Teigha.GraphicsInterface.Drawable
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 Drawable
 Конструктор класса Teigha.GraphicsInterface.Drawable. (Унаследован от Drawable)
 Teigha.DatabaseServices.DBObject
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 DBObject
 Конструктор. (Унаследован от DBObject)
 Teigha.DatabaseServices.MLeaderStyle
 Имя
 Описание
 MLeaderStyle
 Это обзор перегрузок MLeaderStyle.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.GraphicsInterface.Drawable
 Имя
 Описание
 Drawable Методы
 Ниже перечислены методы класса Drawable.
 Drawable Свойства
 Ниже перечислены свойства класса Drawable.
 Teigha.DatabaseServices.DBObject
 Имя
 Описание
 DBObject Методы
 Ниже перечислены методы класса DBObject.
 DBObject Свойства
 Ниже перечислены свойства класса DBObject.
 DBObject События
 Ниже перечислены события класса DBObject.
 Teigha.DatabaseServices.MLeaderStyle
 Имя
 Описание
 MLeaderStyle Методы
 Ниже перечислены методы класса MLeaderStyle.
 MLeaderStyle Свойства
 Ниже перечислены свойства класса MLeaderStyle.
 Ссылки
 MLeaderStyle Конструктор, MLeaderStyle Методы, MLeaderStyle Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства, DBObject События
 Ваши комментарии по поводу этого топика: Послать отзыв!