Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SweepOptionsBuilder.Align
 Послать отзыв
 Свойство Align представляет настройку выравнивания вытягиваемого объекта относительно траектории.
 Синтаксис
C#
Visual Basic
Копировать Код
public SweepOptionsAlignOption Align;
Копировать Код
Public Property Align As SweepOptionsAlignOption
 Возвращает
 Возвращает предписанный вариант выравнивания относительно траектории. Тип SweepOptionsAlignOption.
 Описание
 Свойство Align представляет настройку выравнивания вытягиваемого объекта относительно траектории.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.SweepOptionsBuilder, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!