Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Dimstyle
 Послать отзыв
 Синтаксис
C#
Visual Basic
public DatabaseServices::ObjectId Dimstyle;
Public Property Dimstyle() As DatabaseServices.ObjectId
 Описание
 Возвращает или устанавливает Id размерного стиля, определенного текущим значением DIMSTYLE для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!