Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Dimapost
 Послать отзыв
 Синтаксис
C#
Visual Basic
public String Dimapost;
Public Property Dimapost() As String
 Описание
 Возвращает или устанавливает текущее значение DIMAPOST для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!