Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbCurve3dData.Rational
 Послать отзыв
 Свойство Rational позволяет проверить, является ли данная NURBS кривая рациональной.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool Rational;
Копировать Код
Public ReadOnly Property Rational As Boolean
 Возвращает
 Возвращает true, если кривая является рациональной. В противном случае возвращает false.
 Описание
 Свойство Rational позволяет проверить, является ли данная NURBS кривая рациональной.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.NurbCurve3dData, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!