Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство DBText.IsMirroredInY
 Послать отзыв
 Синтаксис
C#
Visual Basic
public bool IsMirroredInY;
Public Property IsMirroredInY() As bool
 Описание
 Обеспечивает доступ к признаку того, что текст отображается зеркально по направлению оси Y (т.е. отображается снизу вверх в вертикальном направлении). False означает, что текст отображается сверху вниз.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.DBText, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!