Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ArcDimension.ArcEndParam
 Послать отзыв
 Свойство предоставляет доступ к параметру конечной точки дуги размера.
 Синтаксис
C#
Visual Basic
Копировать Код
public double ArcEndParam;
Копировать Код
Public Property ArcEndParam() As Double
 Возвращает
 Возвращает значение параметра. Тип double.
 Описание
 Свойство предоставляет доступ к параметру конечной точки дуги размера.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.ArcDimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!