Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SubDMesh.SubdDivideUp
 Послать отзыв
 Метод увеличивает степень сглаженности сети на единицу.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SubdDivideUp();
Копировать Код
Public Sub SubdDivideUp()
 Описание
 Метод увеличивает степень сглаженности сети на единицу.
 Ссылки
 Teigha.DatabaseServices.SubDMesh, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!