Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Событие Database.SystemVariableChanged
 Послать отзыв
 Синтаксис
C#
Visual Basic
public event SystemVariableChangedEventHandler SystemVariableChanged;
Public Event SystemVariableChanged As SystemVariableChangedEventHandler
 Описание
 Событие показывает, что была попытка изменить "имя" системной переменной.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!