Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SweepOptions.ScaleFactor
 Послать отзыв
 Свойство ScaleFactor представляет масштабный коэффициент.
 Синтаксис
C#
Visual Basic
Копировать Код
public double ScaleFactor;
Копировать Код
Public ReadOnly Property ScaleFactor As Double
 Возвращает
 Возвращает масштабный коэффициент. Тип double.
 Описание
 Свойство ScaleFactor представляет масштабный коэффициент.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.SweepOptions, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!