Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Viewport.FastZoomOn
 Послать отзыв
 Свойство FastZoomOn позволяет определить, включен ли в данном видовом экране режим быстрого масштабирования.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool FastZoomOn;
Копировать Код
Public Property FastZoomOn As Boolean
 Возвращает
 Возвращает true, если режим быстрого масштабирования включен. В противном случае возвращает false.
 Описание
 Свойство FastZoomOn позволяет определить, включен ли в данном видовом экране режим быстрого масштабирования.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Viewport, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!