Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Layout
 Послать отзыв
 Объект Layout хранит характеристики каждого листа. Объекты Layout хранятся в объекте Dictionary с ключом ACAD_LAYOUT, что облегчает их перебор и индексирование.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::GraphicsInterface::Drawable Teigha::DatabaseServices::DBObject Teigha::DatabaseServices::PlotSettings Teigha::DatabaseServices::Layout
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("AcDbLayout")] public class Layout : PlotSettings;
Копировать Код
<Wrapper("AcDbLayout")> Public Class Layout Inherits PlotSettings
 Описание
 Объект Layout хранит характеристики каждого листа.
 Объекты Layout хранятся в объекте Dictionary с ключом ACAD_LAYOUT, что облегчает их перебор и индексирование.
 Методы
 Конструкторы
 Teigha.GraphicsInterface.Drawable
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 Drawable
 Конструктор класса Teigha.GraphicsInterface.Drawable. (Унаследован от Drawable)
 Teigha.DatabaseServices.DBObject
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 DBObject
 Конструктор. (Унаследован от DBObject)
 Teigha.DatabaseServices.PlotSettings
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 PlotSettings
 Конструктор класса PlotSettings. Создает экземпляр настроек печати на выбор для пространства модели, либо для пространства листа. (Унаследован от PlotSettings)
 Teigha.DatabaseServices.Layout
 Имя
 Описание
 Layout
 Это обзор перегрузок Layout.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.GraphicsInterface.Drawable
 Имя
 Описание
 Drawable Методы
 Ниже перечислены методы класса Drawable.
 Drawable Свойства
 Ниже перечислены свойства класса Drawable.
 Teigha.DatabaseServices.DBObject
 Имя
 Описание
 DBObject Методы
 Ниже перечислены методы класса DBObject.
 DBObject Свойства
 Ниже перечислены свойства класса DBObject.
 DBObject События
 Ниже перечислены события класса DBObject.
 Teigha.DatabaseServices.PlotSettings
 Имя
 Описание
 PlotSettings Методы
 Ниже перечислены методы класса PlotSettings.
 PlotSettings Свойства
 Ниже перечислены свойства класса PlotSettings.
 Teigha.DatabaseServices.Layout
 Имя
 Описание
 Layout Методы
 Ниже перечислены методы класса Layout.
 Layout Свойства
 Ниже перечислены свойства класса Layout.
 Ссылки
 Layout Конструктор, Layout Методы, Layout Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства, DBObject События
 Ваши комментарии по поводу этого топика: Послать отзыв!