Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.SplineEntity3d.ControlPointAt
 Послать отзыв
 Метод находит в массиве управляющих вершин конкретную вершину с указанным индексом. В текущей версии не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d ControlPointAt( int i );
Копировать Код
Public Function ControlPointAt( i As Integer ) As Point3d
 Параметры
 Параметры
 Описание
 i
 Индекс управляющей вершины сплайна. Тип int.
 Возвращает
 Возвращает положение управляющей вершины с индексом i. Тип Point3d.
 Описание
 Метод находит в массиве управляющих вершин конкретную вершину с указанным индексом.
 Замечания
 В текущей версии этот метод не реализован.
 Ссылки
 Teigha.Geometry.SplineEntity3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!