Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AbstractViewPE.BackClipDistance
 Послать отзыв
 Свойство BackClipDistance представляет положение задней плоскости отсечения.
 Синтаксис
C#
Visual Basic
Копировать Код
public double BackClipDistance;
Копировать Код
Public Property BackClipDistance As Double
 Возвращает
 Возвращает положение задней плоскости отсечения. Тип double.
 Описание
 Свойство BackClipDistance представляет положение задней плоскости отсечения.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.AbstractViewPE, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!