Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CircularArc3d.GetTangent
 Послать отзыв
 Метод позволяет найти линию касательной в заданной точке дуги.
 Синтаксис
C#
Visual Basic
Копировать Код
public Line3d GetTangent( Point3d pointValue );
Копировать Код
Public Function GetTangent( pointValue As Point3d ) As Line3d
 Параметры
 Параметры
 Описание
 pointValue
 Входная точка на дуге, в которой требуется вычислить линию касательной. Тип Point3d.
 Возвращает
 Возвращает 3D-линию касательной к дуге в заданной точке дуги. Тип Line3d.
 Описание
 Метод позволяет найти трехмерную линию касательной в заданной точке этой дуги. Используется вызов метода CircularArc3d.GetTangent(Point3d pointValue, Tolerance tolerance) со значением точности, равным Tolerance.Global.
 Ссылки
 Teigha.Geometry.CircularArc3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!