Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DynamicDimensionData.DynamicDimensionData
 Послать отзыв
 Конструктор класса DynamicDimensionData. Создает динамический размер на основе данных указанного объекта Dimension. Дополнительный аргумент позволяет включить или отключить возможность редактирования динамического размера.
 Синтаксис
C#
Visual Basic
Копировать Код
public DynamicDimensionData( ref Dimension dimension, bool editable );
Копировать Код
Public Sub New( ByRef dimension As Dimension, editable As Boolean )
 Параметры
 Параметры
 Описание
 dimension
 Входной размер, на основе которого создается динамический размер. Тип Dimension.
 editable
 Флаг, который определяет, является ли создаваемый динамический размер редактируемым. Тип bool.
 Описание
 Конструктор класса DynamicDimensionData. Создает динамический размер на основе данных указанного объекта Dimension. Дополнительный аргумент позволяет включить или отключить возможность редактирования динамического размера..
 Ссылки
 Teigha.DatabaseServices.DynamicDimensionData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!