Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocAction.SetStatus
 Послать отзыв
 Метод устанавливает для данного действия требуемый статус из перечисления AssocStatus.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetStatus( AssocStatus newStatus, bool notifyOwningNetwork, bool setInOwnedActions );
Копировать Код
Public Sub SetStatus( newStatus As AssocStatus, notifyOwningNetwork As Boolean, setInOwnedActions As Boolean )
 Параметры
 Параметры
 Описание
 newStatus
 Новый статус действия из перечисления AssocStatus.
 notifyOwningNetwork
 Если задано true, и переданный статус newStatus указывает, что действие необходимо вычислить, статус сети AssocNetwork, владельца этой зависимости, устанавливается в тот же статус (если только статус вычисления сети уже не является более высоким, чем новый). Тип bool.
 setInOwnedActions
 Флаг настройки статусов в принадлежащих действиях. Тип bool. Если задано true, и этому действию принадлежат некоторые другие действия, статус устанавливается и во всех действиях, принадлежащих данному действию как напрямую, так и рекурсивно.
 Описание
 Метод устанавливает для данного действия статус newStatus из перечисления AssocStatus.
 Если новый статус таков, что предикат IsEvaluationRequest() возвращает для него значение true, т.е. действие нуждается в вычислении, но текущий статус действия перевычисления не предполагает, метод распространяет новый статус до сети-владельца AssocNetwork и по цепочке владения до всех вышестоящих сетей в сетевой иерархии с тем, чтобы все сети-владельцы знали, что они содержат действие, которое требует вычисления.
 Если новый статус требует перевычисления (т.е. IsEvaluationRequest() возвращает true), а метод EvaluationRequestSeverityLevel() для нового статуса дает уровень ниже текущей оценки необходимости перевычисления действия, то текущий более высокий статус действия сохраняется без изменений и не заменяется более низким новым статусом. Кроме того, если текущий статус действия IsToBeSkipped(), он не перезаписывается никаким новым статусом IsEvaluationRequest(). Чтобы в такой ситуации изменить статус действия, статус следует сначала изменить на IsUpToDateAssocStatus, а уже после этого изменить на статус IsEvaluationRequest().
 Ссылки
 Teigha.DatabaseServices.AssocAction, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!