Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve2d.GetTrimmedOffset
 Послать отзыв
 Метод предоставляет массив кривых, полученных в результате операции смещения данной кривой на заданное расстояние.
 Синтаксис
C#
Visual Basic
Копировать Код
public Curve2d[] GetTrimmedOffset( double distance, OffsetCurveExtensionType extensionType );
Копировать Код
Public Function GetTrimmedOffset( distance As Double, extensionType As OffsetCurveExtensionType ) As Curve2d()
 Параметры
 Параметры
 Описание
 distance
 Величина смещения. Тип double.
 extensionType
 Вариант сопряжения смещаемых сегментов кривой. Тип OffsetCurveExtensionType.
 Возвращает
 Возвращает массив кривых, полученных в результате операции смещения данной кривой. Тип Curve2d[].
 Описание
 Метод предоставляет массив кривых, полученных в результате операции смещения данной кривой на заданное расстояние.
 Положительное направление смещения определяется правилом правой руки с учетом направления касательной к кривой. Если при смещении сегментов исходной кривой образуются разрывы, используется вариант сопряжения смещенных сегментов, заданный аргументом extensionType.
 Используется вызов метода Curve2d.GetTrimmedOffset(Double distance, OffsetCurveExtensionType extensionType, Tolerance tolerance) с точностью tolerance, равной Tolerance.Global.
 Ссылки
 Teigha.Geometry.Curve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!