Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocArrayPathParameters.Path
 Послать отзыв
 Свойство обеспечивает доступ к траектории массива.
 Синтаксис
C#
Visual Basic
Копировать Код
public EdgeRef Path;
Копировать Код
Public Property Path() As EdgeRef
 Возвращает
 Возвращает траекторию массива. Тип EdgeRef.
 Описание
 Свойство обеспечивает доступ к траектории массива.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.AssocArrayPathParameters, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!