Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SubDMesh.GetSubentMaterialMapper
 Послать отзыв
 Метод предназначен для извлечения сопоставителя (мэппера) заданного подобъекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public Mapper GetSubentMaterialMapper( SubentityId subentId );
Копировать Код
Public Function GetSubentMaterialMapper( subentId As SubentityId ) As Mapper
 Параметры
 Параметры
 Описание
 subentId
 Идентификатор подобъекта. Тип SubentityId.
 Возвращает
 Возвращает сопоставитель (мэппер) подобъекта. Тип Mapper.
 Описание
 Метод предназначен для извлечения сопоставителя (мэппера) заданного подобъекта.
 Ссылки
 Teigha.DatabaseServices.SubDMesh, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!