Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotSettingsValidator.SetPlotRotation
 Послать отзыв
 Метод задает поворот при печати в настройках этого объекта PlotSettings.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetPlotRotation( ref PlotSettings plotSet, PlotRotation rotationType );
Копировать Код
Public Sub SetPlotRotation( ByRef plotSet As PlotSettings, rotationType As PlotRotation )
 Параметры
 Параметры
 Описание
 plotSet
 Входной объект PlotSettings с настройками печати.
 rotationType
 Тип поворота чертежа при печати. Значение из перечисления PlotRotation.
 Описание
 Метод задает поворот при печати в настройках этого объекта PlotSettings.
 Ссылки
 Teigha.DatabaseServices.PlotSettingsValidator, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!