Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.TableContent.GetColumnWidth
 Послать отзыв
 Метод позволяет получить ширину столбца с указанным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual double GetColumnWidth( int column );
Копировать Код
Public Overridable Function GetColumnWidth( column As Integer ) As Double
 Параметры
 Параметры
 Описание
 column
 Индекс столбца таблицы. Тип int.
 Возвращает
 Возвращает ширину столбца. Тип double.
 Описание
 Метод позволяет получить ширину столбца с указанным индексом.
 Ссылки
 Teigha.DatabaseServices.TableContent, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!