Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve3d.GetNormalPoint
 Послать отзыв
 Метод позволяет найти точку на кривой, в которой нормаль к кривой проходит через указанную точку.
 Синтаксис
C#
Visual Basic
Копировать Код
public PointOnCurve3d GetNormalPoint( Point3d point );
Копировать Код
Public Function GetNormalPoint( point As Point3d ) As PointOnCurve3d
 Параметры
 Параметры
 Описание
 point
 Точка, через которую требуется провести нормаль к кривой. Тип Point3d.
 Возвращает
 Возвращает точку на кривой. Тип PointOnCurve3d.
 Описание
 Метод позволяет найти точку на кривой, в которой нормаль к кривой проходит через указанную точку. Вызывает метод Curve3d.GetNormalPoint(Point3d point, Tolerance tolerance) с точностью, равной Tolerance.Global.
 Ссылки
 Teigha.Geometry.Curve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!