Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.DataType
 Послать отзыв
 Метод предназначен для получения типа данных, хранящихся в строках заданного в аргументе типа.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual DatabaseServices.DataType DataType( RowType type );
Копировать Код
Public virtual Function DataType( type As RowType ) As DatabaseServices.DataType
 Параметры
 Параметры
 Описание
 type
 Тип строки из перечисления RowType.
 Возвращает
 Возвращает тип данных из перечисления Teigha.DatabaseServices.DataType.
 Описание
 Метод предназначен для получения типа данных, хранящихся в строках заданного в аргументе типа.
 Замечания
 Для получения того же результата предпочтительнее использовать Table.Cells[row,column].DataType
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!