Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.SplineEntity3d.Degree
 Послать отзыв
 Свойство Degree представляет степень данного сплайна. Не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public int Degree;
Копировать Код
Public ReadOnly Property Degree As Integer
 Возвращает
 Возвращает степень данного сплайна. Тип int.
 Описание
 Свойство Degree представляет степень данного сплайна. Не реализовано.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.SplineEntity3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!