Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocDependency.Evaluate
 Послать отзыв
 Метод обновляет зависимости ассоциативного действия, которые нуждаются в перевычислении.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Evaluate();
Копировать Код
Public Sub Evaluate()
 Описание
 Метод обновляет зависимости ассоциативного действия, которые нуждаются в перевычислении. Вызывается методом AssocAction.EvaluateDependencies().
 Для выполнения реальной работы метод Evaluate() вызывает метод AssocDependencyBody.EvaluateOverride(). Если у зависимости отсутствует собственный объект тела AssocDependencyBody, реализация по умолчанию вызывает метод AssocAction.EvaluateDependency(), т.е. делегирует работу действию-владельцу зависимости.
 Реализация по умолчанию метода AssocAction.EvaluateDependency() просто устанавливает статус зависимости IsUpToDateAssocStatus из перечисления AssocStatus. Это делегирование можно отключить, используя вызов IsDelegatingToOwningAction(false).
 Пользовательские классы зависимостей могут реализовывать кэширование релевантных данных для фильтрации ненужных уведомлений или выполнения какой-либо иной работы.
 Ссылки
 Teigha.DatabaseServices.AssocDependency, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!