Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DrawOrderTable.GetSortHandle
 Послать отзыв
 Метод предназначен для получения дескриптора, определяющего порядок отрисовки объекта с указанным идентификатором.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.Handle GetSortHandle( DatabaseServices.ObjectId id );
Копировать Код
Public Function GetSortHandle( id As DatabaseServices.ObjectId ) As DatabaseServices.Handle
 Параметры
 Параметры
 Описание
 id
 Идентификатор объекта, для которого требуется получить дескриптор. Тип DatabaseServices.ObjectId.
 Возвращает
 Возвращает дескриптор указанного объекта. Тип DatabaseServices.Handle.
 Описание
 Метод предназначен для получения дескриптора, определяющего порядок отрисовки объекта с указанным идентификатором.
 Объекты с меньшими значениями дескрипторов отображаются раньше объектов с более высокими значениями дескрипторов. Этот дескриптор фактически играет роль ключа сортировки и не имеет ничего общего с идентификатором объекта в базе данных. В DrawOrderTable используется лишь его числовое значения.
 Ссылки
 Teigha.DatabaseServices.DrawOrderTable, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!