Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Face.SetVertexAt
 Послать отзыв
 Метод предоставляет возможность изменять положение в пространстве вершины с указанным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetVertexAt( short vertexIndex, Point3d vertexPosition );
Копировать Код
Public Sub SetVertexAt( vertexIndex As Short, vertexPosition As Point3d )
 Параметры
 Параметры
 Описание
 vertexIndex
 Индекс вершины грани (0, 1, 2 или 3). Тип short.
 vertexPosition
 Новое положение вершины. Тип Point3d.
 Описание
 Метод предоставляет возможность изменять положение в пространстве вершины с указанным индексом. Используется мировая система координат WCS.
 Ссылки
 Teigha.DatabaseServices.Face, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!