Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод LinetypeTableRecord.SetShapeRotationAt
 Послать отзыв
 Синтаксис
C#
Visual Basic
public void SetShapeRotationAt(int index, double rotation);
Public Sub SetShapeRotationAt(index As Integer, rotation As Double)
 Параметры
 Параметры
 Описание
 index
 Индекс (начинающийся с 0) строки, содержащей форму (текстовую строку), для которой производится установка значения угла
 rotation
 Угол поворота для формы (текстовой строки)
 Описание
 Этот метод устанавливает для строки LinetypeTableRecord со значением индекса index значение угла поворота формы (текстовой строки). Если бит isUcsOriented установлен в inetypeTableRecord, то угол относится к текущему UCS. В противном случае он отсчитывается от линии направления. Положительный угол считается против часовой стрелки при взгляде сверху вниз по нормали к плоскости, содержащей текст (или нормали UCS, если isUcsOriented установлен в 1).
 Значение index должно быть больше или равно 0, но меньше чем значение, возвращаемое LinetypeTableRecord.NumDashes. index представляет собой индекс, начинающийся с нуля (формы и текстовые строки имеют тот же самый индекс, как и штриховка, предшествующая им в определении типа линии) с первым элементом типа линии, соответствующим индексу, равному 0.
 Для получения дополнительной информации об определении типа линии и длины штриховки, смотри раздел "Типы линий" в Инструкции пользователя по nanoCAD.
 Ссылки
 Teigha.DatabaseServices.LinetypeTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!