Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.NurbsData.GetKnots
 Послать отзыв
 Метод возвращает узловой вектор данного объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public DoubleCollection GetKnots();
Копировать Код
Public Function GetKnots() As DoubleCollection
 Возвращает
 Возвращает узловой вектор данного объекта. Тип DoubleCollection.
 Описание
 Метод возвращает узловой вектор данного объекта как коллекцию узлов.
 Узловой вектор задает последовательность значений параметров, определяющих, где и как управляющие вершины влияют на кривую. Узловой вектор делит параметрическое пространство на интервалы, обычно называемые интервалами узлового вектора. Узловой вектор должен быть неубывающим. Например, вектор (0, 0, 0, 1, 2, 3, 3, 3) может быть действительным, в то время как вектор (0, 0, 2, 0, 3, 1, 3, 3) действительным быть не может.
 Ссылки
 Teigha.DatabaseServices.NurbsData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!