Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SectionGeneration
 Послать отзыв
 Перечисление SectionGeneration определяет флаги, используемые для настройки процесса генерации сечения.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum SectionGeneration { SourceAllObjects = 1, SourceSelectedObjects = 2, DestinationNewBlock = 16, DestinationReplaceBlock = 32, DestinationFile = 64 }
Копировать Код
Public Enum SectionGeneration SourceAllObjects = 1 SourceSelectedObjects = 2 DestinationNewBlock = 16 DestinationReplaceBlock = 32 DestinationFile = 64 End Enum
 Члены
 Члены
 Описание
 SourceAllObjects
 Значение: 1. Операция сечения применяется ко всем объектам чертежа.
 SourceSelectedObjects
 Значение: 2. Операция сечения применяется только к группе выбранных объектов.
 DestinationNewBlock
 Значение: 16 = 0x10. Операция сечения создает геометрию сечения как новый блок.
 DestinationReplaceBlock
 Значение: 32 = 0x20. Операция сечения заменяет существующий блок при создании сечения.
 DestinationFile
 Значение: 64 = 0x40. Созданная геометрия сечения сохраняется во внешнем файле.
 Описание
 Перечисление SectionGeneration определяет флаги генерации сечения, используемые для настройки этого процесса.
 Существует две группы флагов: флаги для источников создаваемого сечения и флаги целевых объектов. Опции генерации формируются как логическое объединение (OR) заданных значений в каждой из групп.
 Флаги SourceAllObjects и SourceSelectedObjects используются для указания источника. Флаги DestinationNewBlock, DestinationReplaceBlock и DestinationFile определяют группу целевых объектов для генерируемой геометрии.
 Ваши комментарии по поводу этого топика: Послать отзыв!