Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotSettingsValidator.SetPlotViewName
 Послать отзыв
 Метод задает именованный вид, определяющий печатаемый контент для указанного объекта PlotSettings.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetPlotViewName( ref PlotSettings plotSet, ref String viewName );
Копировать Код
Public Sub SetPlotViewName( ByRef plotSet As PlotSettings, ByRef viewName As String )
 Параметры
 Параметры
 Описание
 plotSet
 Входной объект PlotSettings с настройками печати.
 viewName
 Имя вида. Тип String.
 Описание
 Метод задает именованный вид, который определяет, какая часть листа должна выводиться на печать.
 Замечания
 Указанный именованный вид выводится на печать тогда и только тогда, когда тип печати чертежа принимает значение PlotType.View.
 Ссылки
 Teigha.DatabaseServices.PlotSettingsValidator, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!