Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.SectionManagerId
 Послать отзыв
 Синтаксис
C#
Visual Basic
public DatabaseServices::ObjectId SectionManagerId;
Public Property SectionManagerId() As DatabaseServices.ObjectId
 Описание
 Возвращает Id менеджера сечений, связанного с базой данных.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!