Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AbstractViewPE.SetUcsFromView
 Послать отзыв
 Метод определяет UCS для соответствующего видового экрана.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetUcsFromView( ref RXObject pSourceView );
Копировать Код
Public Sub SetUcsFromView( ByRef pSourceView As RXObject )
 Параметры
 Параметры
 Описание
 pSourceView
 Идентификатор объекта ПСК. Тип RXObject.
 Описание
 Метод определяет пользовательскую систему координат (ПСК, UCS) для связанного видового экрана.
 Ссылки
 Teigha.DatabaseServices.AbstractViewPE, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!