Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Matrix2dBuilder.Matrix2dBuilder
 Послать отзыв
 Конструктор класса Matrix2dBuilder. Создает новый экземпляр класса на основе указанной матрицы.
 Синтаксис
C#
Visual Basic
Копировать Код
public Matrix2dBuilder( Matrix2d value );
Копировать Код
Public Sub New( value As Matrix2d )
 Параметры
 Параметры
 Описание
 value
 Входная матрица, на основе которой создается новый экземпляр класса. Тип Matrix2d.
 Описание
 Конструктор класса Matrix2dBuilder. Создает новый экземпляр класса на основе указанной матрицы.
 Ссылки
 Teigha.Geometry.Matrix2dBuilder, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!