Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AbstractViewTableRecord.AmbientLightColor
 Послать отзыв
 Свойство AmbientLightColor предоставляет доступ к цвету объекта при рассеянном освещении в видовом экране.
 Синтаксис
C#
Visual Basic
Копировать Код
public Colors.Color AmbientLightColor;
Копировать Код
Public Property AmbientLightColor As Colors.ColorColor
 Возвращает
 Возвращает цвет объекта при рассеянном освещении. Тип Colors.Color.
 Описание
 Свойство AmbientLightColor предоставляет доступ к цвету объекта при рассеянном освещении в видовом экране.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.AbstractViewTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!