Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Tdusrtimer
 Послать отзыв
 Синтаксис
C#
Visual Basic
public TimeSpan Tdusrtimer;
Public Property Tdusrtimer() As TimeSpan
 Описание
 Обеспечивает доступ к текущему значению TDUSRTIMER для базы данных.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!