Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeader.GetLeaderLineColor
 Послать отзыв
 Метод предоставляет цвет линии выноски с указанным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public Colors.Color GetLeaderLineColor( int leaderLineIndex );
Копировать Код
Public Function GetLeaderLineColor( leaderLineIndex As Integer ) As Colors.Color
 Параметры
 Параметры
 Описание
 leaderLineIndex
 Индекс линии выноски. Тип int.
 Возвращает
 Возвращает цвет линии выноски. Тип Colors.Color.
 Описание
 Метод предоставляет цвет линии выноски с указанным индексом.
 Ссылки
 Teigha.DatabaseServices.MLeader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!