Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.CellStyleOverrides
 Послать отзыв
 Данный метод позволяет получить массив переопределений для указанной ячейки.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual TableStyleOverride[] CellStyleOverrides( int row, int col );
Копировать Код
Public virtual Function CellStyleOverrides( row As Integer, col As Integer ) As TableStyleOverride()
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int.
 col
 Индекс столбца, тип int.
 Возвращает
 Возвращает массив переопределений. Тип TableStyleOverride[].
 Описание
 Данный метод позволяет получить массив переопределений для указанной ячейки.
 Замечания
 Для получения того же результата предпочтительнее использовать Table.Cells[row,column].StyleOverrides .
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!