Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MText.LineSpacingFactor
 Послать отзыв
 Свойство представляет коэффициент межстрочного интервала в диапазоне [0,25 .. 4,0].
 Синтаксис
C#
Visual Basic
Копировать Код
public double LineSpacingFactor;
Копировать Код
Public Property LineSpacingFactor As Double
 Возвращает
 Возвращает коэффициент межстрочного интервала. Тип double.
 Описание
 Свойство представляет коэффициент межстрочного интервала в диапазоне [0,25 .. 4,0].
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MText, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!