Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MeshPointMaps
 Послать отзыв
 Структура MeshPointMaps хранит данные, возвращаемые методом Teigha.DatabaseServices.GeoLocationData.GetMeshPointMaps().
 Иерархия классов
Teigha::DatabaseServices::MeshPointMaps
 Синтаксис
C#
Visual Basic
Копировать Код
public struct MeshPointMaps
Копировать Код
Public Structure MeshPointMaps
 Описание
 Структура MeshPointMaps хранит данные, возвращаемые методом Teigha.DatabaseServices.GeoLocationData.GetMeshPointMaps().
 Методы
 Конструкторы
 Имя
 Описание
 MeshPointMaps
 Конструктор структуры MeshPointMaps.
 Топики
 Имя
 Описание
 MeshPointMaps Свойства
 Ниже перечислены свойства класса MeshPointMaps.
 Ссылки
 MeshPointMaps Свойства, Методы, Топики, MeshPointMaps Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!