Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeaderStyle.BlockScale
 Послать отзыв
 Свойство представляет масштаб отображения блока, на который ссылается данный стиль.
 Синтаксис
C#
Visual Basic
Копировать Код
public Scale3d BlockScale;
Копировать Код
Public Property BlockScale As Scale3d
 Возвращает
 Возвращает масштаб отображения блока. Тип Scale3d.
 Описание
 Свойство представляет масштаб отображения блока, на который ссылается данный стиль.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MLeaderStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!