Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.RowsCollection.Item
 Послать отзыв
 Свойство Item предоставляет доступ к элементу коллекции с указанным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public Row this[int index];
Копировать Код
Default Public ReadOnly Property Item( index As Integer ) As Row
 Параметры
 Параметры
 Описание
 index
 Входной индекс элемента коллекции. Тип int.
 Возвращает
 Возвращает строку таблицы, которая является элементом коллекции с индексом index. Тип Row.
 Описание
 Свойство Item предоставляет доступ к элементу коллекции с указанным индексом.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.RowsCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!