Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CellBorder.Linetype
 Послать отзыв
 Свойство Linetype представляет тип линии, используемый объектом границы ячейки.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.ObjectId? Linetype;
Копировать Код
Public Property Linetype As DatabaseServices.ObjectId?
 Возвращает
 Возвращает идентификатор объекта типа линии для границы ячейки. Тип DatabaseServices.ObjectId?.
 Описание
 Свойство Linetype представляет тип линии, используемый объектом границы ячейки.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.CellBorder, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!