Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Curve.Extend
 Послать отзыв
 Метод Extend достраивает кривую до заданной точки.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void Extend( bool extendStart, Point3d toPoint );
Копировать Код
Public virtual Function Extend( extendStart As Boolean, toPoint As Point3d )
 Параметры
 Параметры
 Описание
 extendStart
 Если аргумент принимает значение true, то до точки toPoint достраивается начало кривой. В противном случае до точки toPoint дотягивается конец кривой.
 toPoint
 Аргумент определяет новую начальную или конечную точку кривой.
 Описание
 Этот метод достраивает кривую до заданной точки toPoint, которая становится новой начальной или конечной точкой кривой.
 Ссылки
 Teigha.DatabaseServices.Curve, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!