Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Cylinder.Set
 Послать отзыв
 Метод позволяет переопределить данный объект, используя новые ось цилиндра, начало координат, радиус, высоту, направление отсчета углов, а также начальный и конечный углы.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Set( double radius, Point3d origin, Vector3d axisOfSymmetry, Vector3d referenceAxis, ref Interval height, double startAngle, double endAngle );
Копировать Код
Public Sub Set( radius As Double, origin As Point3d, axisOfSymmetry As Vector3d, referenceAxis As Vector3d, ByRef height As Interval, startAngle As Double, endAngle As Double )
 Параметры
 Параметры
 Описание
 radius
 Радиус цилиндра. Тип double.
 origin
 Точка на оси цилиндра в качестве начала координат. Тип Point3d.
 axisOfSymmetry
 Ось цилиндра. Тип Vector3d.
 referenceAxis
 Направление отсчета углов. Тип Vector3d.
 height
 Высота цилиндра. Тип Interval.
 startAngle
 Начальный угол. Тип double.
 endAngle
 Конечный угол. Тип double.
 Описание
 Метод позволяет переопределить данный объект, используя новые ось цилиндра, начало координат, радиус, высоту, направление отсчета углов, а также начальный и конечный углы.
 Ссылки
 Teigha.Geometry.Cylinder, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!