Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.BoundedPlane.Set
 Послать отзыв
 Метод позволяет переопределить данный объект, используя новые координаты начала и две точки в этой плоскости.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Set( Point3d p1, Point3d origin, Point3d p2 );
Копировать Код
Public Sub Set( p1 As Point3d, origin As Point3d, p2 As Point3d )
 Параметры
 Параметры
 Описание
 p1
 Новое положение первой точки. Тип Point3d.
 origin
 Новое положение точки начала. Тип Point3d.
 p2
 Новое положение второй точки. Тип Point3d.
 Описание
 Метод позволяет переопределить данный объект, используя новые координаты начала и две точки в этой плоскости.
 Ссылки
 Teigha.Geometry.BoundedPlane, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!