Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ObjectId.==
 Послать отзыв
 Возвращает true, если a равно b.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool operator ==( ObjectId a, ObjectId b );
Копировать Код
Public Operator ==( a As ObjectId, b As ObjectId )
 Параметры
 Параметры
 Описание
 a
 Левый операнд, тип ObjectId.
 b
 Правый операнд, тип ObjectId.
 Возвращает
 Возвращает true, если a равно b, иначе - false.
 Описание
 Возвращает true, если a равно b.
 Ссылки
 Teigha.DatabaseServices.ObjectId, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!