Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CircularArc2d.CircularArc2d
 Послать отзыв
 Конструктор класса CircularArc2d. Создает круглую дугу по трем точкам.
 Синтаксис
C#
Visual Basic
Копировать Код
public CircularArc2d( Point2d startPoint, Point2d point, Point2d endPoint );
Копировать Код
Public Sub New( startPoint As Point2d, point As Point2d, endPoint As Point2d )
 Параметры
 Параметры
 Описание
 startPoint
 Начальная точка дуги. Тип Point2d.
 point
 Точка на дуге. Тип Point2d.
 endPoint
 Конечная точка дуги. Тип Point2d.
 Описание
 Конструктор класса CircularArc2d. Создает круглую дугу по трем точкам. Никакие две точки из этих трех не должны совпадать, и все три не должны лежать на одной прямой. Данный конструктор всегда строит ограниченную дугу и не может использоваться для построения полной окружности.
 Ссылки
 Teigha.Geometry.CircularArc2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!