Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeaderStyle.Scale
 Послать отзыв
 Свойство представляет масштабный множитель для данного стиля.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Scale;
Копировать Код
Public Property Scale As Double
 Возвращает
 Возвращает масштабный множитель. Тип double.
 Описание
 Свойство представляет масштабный множитель для данного стиля.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MLeaderStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!