Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbCurve2d.NurbCurve2d
 Послать отзыв
 Конструктор класса NurbCurve2d. Создает NURBS кривую заданной степени, которая интерполирует вершины указанной полилинии и опционально может быть замкнутой.
 Синтаксис
C#
Visual Basic
Копировать Код
public NurbCurve2d( int degree, ref PolylineCurve2d fitPolyline, bool periodic );
Копировать Код
Public Sub New( degree As Integer, ByRef fitPolyline As PolylineCurve2d, periodic As Boolean )
 Параметры
 Параметры
 Описание
 degree
 Входная степень NURBS кривой. Тип int.
 fitPolyline
 2D-полилиния, вершины которой используются как определяющие точки для NURBS кривой. Тип PolylineCurve2d.
 periodic
 Флаг, указывающий, что требуется получить замкнутую (соответственно, периодическую) NURBS кривую. Тип bool.
 Описание
 Конструктор класса NurbCurve2d. Создает NURBS кривую заданной степени, которая интерполирует вершины указанной полилинии и опционально может быть замкнутой.
 Замечания
 Более высокие значения степени делают кривую более гибкой. Например, степень 1 используется для определения полилинии, степень 2 используется для определения NURBS окружностей и круглых дуг и т.д.
 Ссылки
 Teigha.Geometry.NurbCurve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!