Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.LinearEntity3d
 Послать отзыв
 Класс LinearEntity3d является абстрактным базовым классом для всех классов трехмерных линейных объектов.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Geometry::Entity3d Teigha::Geometry::Curve3d Teigha::Geometry::LinearEntity3d
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdGeLinearEnt3d")] public abstract class LinearEntity3d : Curve3d
Копировать Код
<Wrapper("OdGeLinearEnt3d")> Public MustInherit Class LinearEntity3d Inherits Curve3d
 Описание
 Класс LinearEntity3d является абстрактным базовым классом для всех классов трехмерных линейных объектов.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Geometry.Entity3d
 Имя
 Описание
 Entity3d Методы
 Ниже перечислены методы класса Entity3d.
 Teigha.Geometry.Curve3d
 Имя
 Описание
 Curve3d Методы
 Ниже перечислены методы класса Curve3d.
 Curve3d Свойства
 Ниже перечислены свойства класса Curve3d.
 Teigha.Geometry.LinearEntity3d
 Имя
 Описание
 LinearEntity3d Методы
 Ниже перечислены методы класса LinearEntity3d.
 LinearEntity3d Свойства
 Ниже перечислены свойства класса LinearEntity3d.
 Ссылки
 LinearEntity3d Методы, LinearEntity3d Свойства, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!