Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector2d.IsCodirectionalTo
 Послать отзыв
 Метод позволяет проверить, является ли данный вектор сонаправленным входному вектору в пределах точности по умолчанию.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsCodirectionalTo( Vector2d vector );
Копировать Код
Public Function IsCodirectionalTo( vector As Vector2d ) As Boolean
 Параметры
 Параметры
 Описание
 vector
 Входной вектор, сравниваемый на сонаправленность с данным вектором. Тип Vector2d.
 Возвращает
 Возвращает true, если в пределах точности по умолчанию векторы можно считать сонаправленными. В противном случае возвращает false.
 Описание
 Метод позволяет проверить, является ли данный вектор сонаправленным входному вектору vector. Используется вызов метода Vector2d.IsCodirectionalTo(Vector2d vector, Tolerance tolerance) с точностью по умолчанию Tolerance.EqualVector.
 Ссылки
 Teigha.Geometry.Vector2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!