Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.UnderlayItem
 Послать отзыв
 Класс UnderlayItem реализуется хост-приложениями, которым требуется поддержка подложек.
 Иерархия классов
Teigha::DatabaseServices::UnderlayItem
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdDbUnderlayItem")] public class UnderlayItem : DisposableWrapper
Копировать Код
<Wrapper("OdDbUnderlayItem")> Public Class UnderlayItem Inherits DisposableWrapper
 Описание
 Класс UnderlayItem реализуется хост-приложениями, которым требуется поддержка подложек. Используется объектами UnderlayDefinition и UnderlayReference для корректной работы.
 Топики
 Имя
 Описание
 UnderlayItem Свойства
 Ниже перечислены свойства класса UnderlayItem.
 Ссылки
 UnderlayItem Свойства, Топики, UnderlayItem Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!