Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocDependency.IsRelevantChange
 Послать отзыв
 Свойство позволяет проверить, действительно ли изменение связанного объекта релевантно и меняет состояние данной зависимости.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsRelevantChange;
Копировать Код
Public Property IsRelevantChange() As Boolean
 Возвращает
 Возвращает true, если изменение связанного объекта меняет состояние данной зависимости. В противном случае возвращает false.
 Описание
 Свойство позволяет проверить, действительно ли изменение связанного объекта релевантно и меняет состояние данной зависимости. Например, если зависимость завязана на подобъект геометрического объекта, она должна проверить, действительно ли изменилась геометрия этого подобъекта (например, путем сравнения ее с кэшированной геометрией).
 Использование этого свойства позволяет отфильтровывать уведомления о ложных или нерелевантных изменениях и, таким образом, избегать ненужного перевычисления действий. Если это свойство имеет значение false, уведомление об изменении от зависимого объекта игнорируется, а состояние данной зависимости не изменяется.
 Реализация по умолчанию данного свойства делегирует принятие решения действию-владельцу, вызывая его метод AssocAction.IsRelevantDependencyChange(). Делегирование можно отключить, если свойству IsDelegatingToOwningAction задать значение false. Реализация по умолчанию AssocAction.IsRelevantDependencyChange() возвращает true.
 Если зависимость владеет объектом AssocDependencyBody, который переопределяет свойство IsRelevantChangeOverride(), вызов переопределения заменяет реализацию по умолчанию.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.AssocDependency, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!