Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.PointOnSurface.PointOnSurface
 Послать отзыв
 Конструктор класса PointOnSurface. Создает на указанной поверхности точку с заданными параметрическими координатами.
 Синтаксис
C#
Visual Basic
Копировать Код
public PointOnSurface( ref Surface surf, Point2d point );
Копировать Код
Public Sub New( ByRef surf As Surface, point As Point2d )
 Параметры
 Параметры
 Описание
 surf
 Входная поверхность, на которой лежит данная точка. Тип Surface.
 point
 Значения параметра для этой точки. Тип Point2d. Координата point.x определяет значение параметра по оси u, а координата point.y - значение параметра по оси v.
 Описание
 Конструктор класса PointOnSurface. Создает на поверхности surf точку с заданными значениями параметра для осей u и v.
 Ссылки
 Teigha.Geometry.PointOnSurface, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!