Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Solid3d.SetSubentityMaterial
 Послать отзыв
 Метод позволяет назначить указанному подобъекту данного 3D-тела новый материал.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetSubentityMaterial( SubentityId subEntityId, DatabaseServices.ObjectId materialId );
Копировать Код
Public Overridable Sub SetSubentityMaterial( subEntityId As SubentityId, materialId As DatabaseServices.ObjectId )
 Параметры
 Параметры
 Описание
 subEntityId
 Идентификатор подобъекта. Тип SubentityId.
 materialId
 Идентификатор объекта материала. Тип DatabaseServices.ObjectId.
 Описание
 Метод позволяет назначить указанному подобъекту данного 3D-тела новый материал.
 Ссылки
 Teigha.DatabaseServices.Solid3d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!