Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocArrayPolarParameters.AssocArrayPolarParameters
 Послать отзыв
 Конструктор класса AssocArrayPolarParameters для создания нового объекта с указанными параметрами.
 Синтаксис
C#
Visual Basic
Копировать Код
public AssocArrayPolarParameters( double angle, double rowSpacing, double levelSpacing, int itemCount, int rowCount, int levelCount, double rowElevation );
Копировать Код
Public Sub New( angle As Double, rowSpacing As Double, levelSpacing As Double, itemCount As Integer, rowCount As Integer, levelCount As Integer, rowElevation As Double )
 Параметры
 Параметры
 Описание
 angle
 Угол, образуемый двумя соседними элементами из центра кругового массива. Значение указывается в радианах и может варьироваться от 0 до 2PI. Тип double.
 rowSpacing
 Шаг между рядами кругового массива. Тип double.
 levelSpacing
 Расстояние между уровнями кругового массива. Тип double.
 itemCount
 Количество элементов в массиве. Тип int.
 rowCount
 Количество рядов в массиве. Тип int.
 levelCount
 Количество уровней в массиве. Тип int.
 rowElevation
 Приращение отметок между соседними рядами массива. Тип double.
 Описание
 Конструктор. Создает новый объект класса AssocArrayPathParameters с указанными параметрами.
 Ссылки
 Teigha.DatabaseServices.AssocArrayPolarParameters, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!