Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LinkedTableData.LinkedTableData
 Послать отзыв
 Конструктор по умолчанию класса LinkedTableData.
 Синтаксис
C#
Visual Basic
Копировать Код
public LinkedTableData();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса LinkedTableData.
 Ссылки
 Teigha.DatabaseServices.LinkedTableData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!