Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Curve.SetFromGeCurve
 Послать отзыв
 Метод копирует в текущую кривую Curve в заданной плоскости параметры заданной кривой Curve3d с указанной точностью Tolerance.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetFromGeCurve( ref Curve3d geCurve, Vector3d vec, Tolerance tolerance );
Копировать Код
Public Function SetFromGeCurve( ByRef geCurve As Curve3d, vec As Vector3d, tolerance As Tolerance )
 Параметры
 Параметры
 Описание
 geCurve
 Исходная кривая типа Curve3d.
 vec
 Аргумент типа Vector3d, определяющий плоскость построения.
 tolerance
 Предписанная точность геометрических построений, экземпляр класса Tolerance.
 Описание
 Метод копирует в текущую кривую Curve в заданной плоскости параметры заданной кривой Curve3d с указанной точностью Tolerance.
 Ссылки
 Teigha.DatabaseServices.Curve, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!