Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FeatureControlFrame.Direction
 Послать отзыв
 Свойство Direction представляет направляющий вектор оси X данного объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual Vector3d Direction;
Копировать Код
Public Overridable ReadOnly Property Direction As Vector3d
 Возвращает
 Возвращает направляющий вектор оси X. Тип Vector3d.
 Описание
 Свойство Direction представляет направляющий вектор оси X данного объекта. Вектор задается в мировой системе координат WCS.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.FeatureControlFrame, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!