Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Point3dCollection.Point3dCollection
 Послать отзыв
 Конструктор по умолчанию для класса Point3dCollection. Создает пустую коллекцию 3D-точек.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3dCollection();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию для класса Point3dCollection. Создает пустую коллекцию 3D-точек.
 Ссылки
 Teigha.Geometry.Point3dCollection, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!