Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DgnDefinition.ShowRasterRef
 Послать отзыв
 Свойство возвращает значение логического флага, который определяет, следует ли отображать растровые изображения в файлах DGN, на которые имеются ссылки (xref).
 Синтаксис
C#
Visual Basic
Копировать Код
public bool ShowRasterRef;
Копировать Код
Public Property ShowRasterRef() As Boolean
 Возвращает
 Возвращает true, если растровые изображения отображаются. В противном случае возвращает false.
 Описание
 Свойство возвращает значение логического флага, который определяет, следует ли отображать растровые изображения в файлах DGN, на которые имеются ссылки (xref).
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.DgnDefinition, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!