Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Класс Teigha.DatabaseServices.ViewportTable
 Послать отзыв
 Класс предназначен для хранения определений видовых экранов пространства модели в базе данных чертежа.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::GraphicsInterface::Drawable Teigha::DatabaseServices::DBObject Teigha::DatabaseServices::SymbolTable Teigha::DatabaseServices::ViewportTable
 Синтаксис
C#
Visual Basic
[Wrapper("AcDbViewportTable")] public class ViewportTable : SymbolTable;
<Wrapper("AcDbViewportTable")> Public Class ViewportTable Inherits SymbolTable
 Описание
 Класс предназначен для хранения определений видовых экранов пространства модели в базе данных чертежа, то есть является коллекцией/таблицей, в которой каждая запись – это определение видового экрана, предназначенного для пространства модели.
 Таблица уникальна тем, что может содержать записи с одинаковыми именами. Записи с одинаковыми именами означают конфигурацию видовых экранов, которые будут находиться в пространстве модели одновременно.
 Сколько видовых экранов в конфигурации – столько же и записей в таблице видовых экранов с одинаковым именем. Определение видового экрана – это набор данных, определяющий его характеристики: название, яркость, ракурс, номер, фон и пр. Видовые экраны создаются для компоновки различных фрагментов или видов чертежа. По умолчанию, в чертеже всегда есть стандартные конфигурации видовых экранов, которыми можно воспользоваться либо с помощью меню/ленты (Вид -> Видовые экраны/ Вид -> Видовые экраны модели -> Конфигурация), либо при помощи команд:
 Стандартные конфигурации видовых экранов пространства модели в таблице видовых экранов не хранятся. В таблицу входят только конфигурации, созданные пользователем, и видовые экраны, которые в настоящее время видны на экране. В интерфейсе nanoCAD каждое определение конфигурации видовых экранов (запись в таблице конфигураций видовых экранов) является конфигурацией в перечне сохраненных(именованных) конфигураций. Сам перечень именованных конфигураций отражает всё содержимое таблицы:
 Такой перечень можно увидеть несколькими способами:
Через меню: Вид -> Видовые экраны -> Именованные ВЭ.
Через ленту: Вид -> Видовые экраны модели -> Кнопка «Видовые экраны»
Через команду VIEWPORTS или VPORTS, также есть локализованной вариант
 ВИДОВЫЕЭКРАНЫ или ВЭКРАН -> Вкладка «Именованные ВЭкраны».
 Для определения видового экрана пространства модели используется класс ViewportTableRecord. Соответственно, все записи таблицы видовых экранов имеют тип данных ViewportTableRecord. Итератор таблицы устроен так, что при переборе строк таблицы перебираются ObjectId каждого элемента, а не сами записи таблицы. По ObjectId можно открыть каждую запись и получить подробные данные о видовом экране, либо изменить их. Для определения видовых экранов пространства листа используется класс Viewport. Информация о всех видовых экранах пространства листа хранится в определении листа (класс Layout).
 Пример
 В качестве примера приведена команда VIEWPORTTABLEREADING, считывающая содержимое таблицы видовых экранов. Считанная информация выводится в командную строку nanoCAD.
C#
 Копировать Код
public partial class Commands { [Teigha.Runtime.CommandMethod("ViewportTableReading")] public void ViewportTableReading() { // Получение ссылки на активный документ HostMgd.ApplicationServices.Document doc = HostMgd.ApplicationServices.Application.DocumentManager.MdiActiveDocument; // Получение ссылки на редактор докумена HostMgd.EditorInput.Editor ed = doc.Editor; // Получение ссылки на базу данных документа Teigha.DatabaseServices.Database db = doc.Database; // Начало транзакции с базой данных документа using (Teigha.DatabaseServices.Transaction trans = db.TransactionManager.StartTransaction()) { // Открываем таблицу блоков для чтения Teigha.DatabaseServices.ViewportTable VPTable = trans.GetObject(db.ViewportTableId, Teigha.DatabaseServices.OpenMode.ForRead) as Teigha.DatabaseServices.ViewportTable; // Перебираем таблицу блоков в цикле foreach (Teigha.DatabaseServices.ObjectId btr in VPTable) { // Открываем каждую запись таблицы Teigha.DatabaseServices.ViewportTableRecord obj = trans.GetObject(btr, Teigha.DatabaseServices.OpenMode.ForRead) as Teigha.DatabaseServices.ViewportTableRecord; // Выводим в командную строку ed.WriteMessage($"vViewports table record {obj.Name}, Id {obj.Id}: " + $"ntCenterPoint {obj.CenterPoint}" + $"ntLowerLeftCorner ({obj.LowerLeftCorner.X},{obj.LowerLeftCorner.Y})" + $"ntUpperRightCorner ({obj.UpperRightCorner.X},{obj.UpperRightCorner.Y})"); } trans.Abort(); } } }
 Результат работы команды в новом документе, где нет сохраненных конфигураций видовых экранов и пространство модели не разбито на несколько видовых экранов:
 Если разбить пространство модели на несколько видовых экранов:
 Пространство модели разбито на 4 видовых экрана – в таблице 4 записи, у всех название *Active, но разные ObjectId и координаты нижнего левого и верхнего правого углов. Теперь сохраним конфигурацию видовых экранов с названием newVPConfig в документе и заново вызовем команду VIEWPORTTABLEREADING:
 В таблице видовых экранов стало в 2 раза больше записей: 4 записи каждого из видовых экранов, входящих в сохраненную конфигурацию newVPConfig и 4 записи видовых экранов, на которые в данный момент разбито пространство модели. Если вернуть пространство модели к одному видовому экрану, то в таблице видовых экранов станет 5 записей: 4 из сохраненной конфигурации и 1 – видовой экран, который в данный момент установлен в пространстве модели:
 Методы
 Конструкторы
 Teigha.GraphicsInterface.Drawable
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 Drawable
 Конструктор класса Teigha.GraphicsInterface.Drawable. (Унаследован от Drawable)
 Teigha.DatabaseServices.DBObject
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 DBObject
 Конструктор. (Унаследован от DBObject)
 Teigha.DatabaseServices.SymbolTable
 ПоказатьPrivateУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 SymbolTable
 This is SymbolTable, a member of class SymbolTable. (Унаследован от SymbolTable)
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.GraphicsInterface.Drawable
 Имя
 Описание
 Drawable Методы
 Ниже перечислены методы класса Drawable.
 Drawable Свойства
 Ниже перечислены свойства класса Drawable.
 Teigha.DatabaseServices.DBObject
 Имя
 Описание
 DBObject Методы
 Ниже перечислены методы класса DBObject.
 DBObject Свойства
 Ниже перечислены свойства класса DBObject.
 DBObject События
 Ниже перечислены события класса DBObject.
 Teigha.DatabaseServices.SymbolTable
 Имя
 Описание
 SymbolTable Методы
 Ниже перечислены методы класса SymbolTable.
 SymbolTable Свойства
 Ниже перечислены свойства класса SymbolTable.
 Ссылки
 Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства, DBObject События
 Ваши комментарии по поводу этого топика: Послать отзыв!