Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Filters.FilteredBlockIterator.EstimatedHitFraction
 Послать отзыв
 Свойство EstimatedHitFraction используется для определения приоритета, согласно которому объекты FilteredBlockIterator будут использоваться в процессе обхода блоков.
 Синтаксис
C#
Visual Basic
Копировать Код
public double EstimatedHitFraction;
Копировать Код
Public ReadOnly Property EstimatedHitFraction As Double
 Возвращает
 Возвращает предполагаемую долю в интервале [0.0 .. 1.0] объема содержимого индекса, который будет обработан на основе запроса фильтра. Тип double.
 Описание
 Свойство EstimatedHitFraction используется для определения приоритета, согласно которому объекты FilteredBlockIterator будут использоваться в процессе обхода блоков. Свойство возвращает предполагаемую долю в интервале [0.0 .. 1.0] объема содержимого индекса, который будет обработан на основе запроса фильтра.
0.0 означает, что итератор должен быть первым, используемым для обхода.
1.0 означает, что итератор должен быть последним использованным итератором.
 Замечания
 Если конкретная реализация не может оценить приоритет, она должна вернуть значение 1.0.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Filters.FilteredBlockIterator, Teigha.DatabaseServices.Filters
 Ваши комментарии по поводу этого топика: Послать отзыв!