Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.TextAttachment
 Послать отзыв
 Свойство задает или возвращает режим выравнивания размерного текста в пределах текстового поля.
 Синтаксис
C#
Visual Basic
Копировать Код
public AttachmentPoint TextAttachment;
Копировать Код
Public Property TextAttachment As AttachmentPoint
 Возвращает
 Возвращает режим выравнивания размерного текста. Значение из перечисления AttachmentPoint.
 Описание
 Свойство задает или возвращает режим выравнивания размерного текста в пределах текстового поля.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!