Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Polyline2d
 Послать отзыв
 Класс Polyline2d представляет объект 2D-полилинии в nanoCAD.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::GraphicsInterface::Drawable Teigha::DatabaseServices::DBObject Teigha::DatabaseServices::Entity Teigha::DatabaseServices::Curve Teigha::DatabaseServices::Polyline2d
 Синтаксис
C#
Visual Basic
Копировать Код
public class Polyline2d : Curve, System.Collections.IEnumerable;
Копировать Код
Public Class Polyline2d Inherits Curve Inherits System.Collections.IEnumerable
 Описание
 Класс Polyline2d представляет объект 2D-полилинии в nanoCAD.
 Методы
 Конструкторы
 Teigha.GraphicsInterface.Drawable
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 Drawable
 Конструктор класса Teigha.GraphicsInterface.Drawable. (Унаследован от Drawable)
 Teigha.DatabaseServices.DBObject
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 DBObject
 Конструктор. (Унаследован от DBObject)
 Teigha.DatabaseServices.Polyline2d
 Имя
 Описание
 Polyline2d
 Это обзор перегрузок Polyline2d.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.GraphicsInterface.Drawable
 Имя
 Описание
 Drawable Методы
 Ниже перечислены методы класса Drawable.
 Drawable Свойства
 Ниже перечислены свойства класса Drawable.
 Teigha.DatabaseServices.DBObject
 Имя
 Описание
 DBObject Методы
 Ниже перечислены методы класса DBObject.
 DBObject Свойства
 Ниже перечислены свойства класса DBObject.
 DBObject События
 Ниже перечислены события класса DBObject.
 Teigha.DatabaseServices.Entity
 Имя
 Описание
 Entity Методы
 Ниже перечислены методы класса Entity.
 Entity Свойства
 Ниже перечислены свойства класса Entity.
 Teigha.DatabaseServices.Curve
 Имя
 Описание
 Curve Методы
 Ниже перечислены методы класса Curve.
 Curve Свойства
 Ниже перечислены свойства класса Curve.
 Teigha.DatabaseServices.Polyline2d
 Имя
 Описание
 Polyline2d Методы
 Ниже перечислены методы класса Polyline2d.
 Polyline2d Свойства
 Ниже перечислены свойства класса Polyline2d.
 Ссылки
 Polyline2d Конструктор, Polyline2d Методы, Polyline2d Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства, DBObject События
 Ваши комментарии по поводу этого топика: Послать отзыв!