Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.ApproxNumObjects
 Послать отзыв
 Синтаксис
C#
Visual Basic
public int ApproxNumObjects;
Public Property ApproxNumObjects() As Integer
 Описание
 Возвращает значение, которое по крайней мере так же велико, как количество объектов в базе данных.
 Назначение этой функции заключается в определении, какое максимальное значение элементов ObjectIdCollection потребуется, чтобы хранить все объекты базы данных. Тогда этот массив может быть создан сразу необходимого размера вместо того, чтобы увеличивать размер пассива при присоединении объектов. Для больших массивов, это может привести к заметному увеличению производительности и уменьшению фрагментации памяти.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!