Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.OffsetCurve3d.Normal
 Послать отзыв
 Свойство Normal представляет направление нормали плоскости базовой кривой.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d Normal;
Копировать Код
Public Property Normal As Vector3d
 Возвращает
 Возвращает нормаль плоскости базовой кривой. Тип Vector3d.
 Описание
 Свойство Normal представляет направление нормали плоскости базовой кривой.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.Geometry.OffsetCurve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!