Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.PointOnCurve2d.PointOnCurve2d
 Послать отзыв
 Конструктор класса PointOnCurve2d. Создает на указанной кривой точку с нулевым значением параметра.
 Синтаксис
C#
Visual Basic
Копировать Код
public PointOnCurve2d( ref Curve2d curve );
Копировать Код
Public Sub New( ByRef curve As Curve2d )
 Параметры
 Параметры
 Описание
 curve
 Входная кривая. Тип Curve2d.
 Описание
 Конструктор класса PointOnCurve2d. Создает на указанной кривой точку с нулевым значением параметра.
 Ссылки
 Teigha.Geometry.PointOnCurve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!