Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.XrefGraph
 Послать отзыв
 Класс XrefGraph представляет дерево внешних ссылок базы данных.
 Иерархия классов
Teigha::DatabaseServices::Graph Teigha::DatabaseServices::XrefGraph
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdDbXrefGraph")] public class XrefGraph : Graph
Копировать Код
<Wrapper("OdDbXrefGraph")> Public Class XrefGraph Inherits Graph
 Описание
 Класс XrefGraph является производным от класса Graph и представляет дерево внешних ссылок базы данных.
 Объект XrefGraph описывает связи между главным чертежом и чертежами, на которые в нем имеются внешние ссылки, а также любыми чертежами по вложенным внешним ссылкам.
 Каждая ссылка (между базами данных) представлена в графе ребром. Узлами графа являются объекты XrefGraphNode, которые представляют записи базы данных или таблицы блоков, на которые имеются внешние ссылки. Запросы к узлам графа позволяют получать входящие и исходящие ссылки этих узлов. Корневым узлом графа внешних ссылок всегда является главный чертеж.
 Методы
 Конструкторы
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 Graph
 Конструктор класса Graph. Создает новый объект Graph с указанным корневым узлом. (Унаследован от Graph)
 Топики
 Имя
 Описание
 Graph Методы
 Ниже перечислены методы класса Graph.
 Graph Свойства
 Ниже перечислены свойства класса Graph.
 Teigha.DatabaseServices.XrefGraph
 Имя
 Описание
 XrefGraph Методы
 Ниже перечислены методы класса XrefGraph.
 XrefGraph Свойства
 Ниже перечислены свойства класса XrefGraph.
 Ссылки
 XrefGraph Методы, XrefGraph Свойства, Методы, Топики, Graph Методы, Graph Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!