Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.BoundaryRepresentation.MeshControl
 Послать отзыв
 Класс MeshControl является базовым интерфейсным классом для элементов управления 2D-сетью.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::BoundaryRepresentation::MeshControl
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("AcBrMeshControl")] public class MeshControl : DisposableWrapper;
Копировать Код
<Wrapper("AcBrMeshControl")> Public Class MeshControl Inherits DisposableWrapper
 Описание
 Класс MeshControl является базовым интерфейсным классом для элементов управления 2D-сетью. Он определяет конкретный функционал, используемый при настройке элементов управления для создания 2D-сетей.
 Замечания
 Этот класс реализован только для среды пространственного моделирования.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.BoundaryRepresentation.MeshControl
 Имя
 Описание
 MeshControl Методы
 Ниже перечислены методы класса MeshControl.
 MeshControl Свойства
 Ниже перечислены свойства класса MeshControl.
 Ссылки
 MeshControl Методы, MeshControl Свойства, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!