Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve3d.HasStartPoint
 Послать отзыв
 Свойство позволяет установить, имеет ли данная кривая начальную точку.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool HasStartPoint;
Копировать Код
Public Property HasStartPoint() As Boolean
 Возвращает
 Возвращает true, если кривая имеет начальную точку. Возвращает false, если параметрический интервал кривой снизу не ограничен.
 Описание
 Свойство позволяет установить, имеет ли данная кривая начальную точку. Возвращаемое значение false означает, что параметрический интервал кривой нижней границы не имеет.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.Curve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!