Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FaceRecord.SetVertexAt
 Послать отзыв
 Метод ставит в соответствие указанный угол данного объекта FaceRecord указанному индексу родительской вершины сети PolyFaceMesh.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetVertexAt( short faceIndex, short vertexIndex );
Копировать Код
Public Sub SetVertexAt( faceIndex As Short, vertexIndex As Short )
 Параметры
 Параметры
 Описание
 faceIndex
 Индекс угловой точки грани (0, 1, 2 или 3). Тип short.
 vertexIndex
 Индекс вершины. Тип short.
 Описание
 Метод ставит в соответствие указанный угол данного объекта FaceRecord указанному индексу родительской вершины сети PolyFaceMesh.
 Индексы вершин PolyFaceMesh начинаются с 1. Отрицательное значение индекса означает, что исходящее из этой вершины ребро является невидимым. Нулевое значение для vertexIndex, когда faceIndex == 3 определяет треугольную грань.
 Ссылки
 Teigha.DatabaseServices.FaceRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!