Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.PointOnCurve2d.GetDerivative
 Послать отзыв
 Метод вычисляет производную первого или второго порядка в данной точке на кривой.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector2d GetDerivative( int order );
Копировать Код
Public Function GetDerivative( order As Integer ) As Vector2d
 Параметры
 Параметры
 Описание
 order
 Входной порядок производной. Тип int. Может принимать значения 1 или 2.
 Возвращает
 Возвращает вектор производной порядка order в данной точке на кривой. Тип Vector2d.
 Описание
 Метод вычисляет производную первого или второго порядка в данной точке на кривой.
 Ссылки
 Teigha.Geometry.PointOnCurve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!