Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocAction.DragStatus
 Послать отзыв
 Метод вызывается для уведомления действия о выполнении операции перетаскивания, в которой задействованы некоторые объекты, от которых прямо или косвенно зависит данное действие.
 Синтаксис
C#
Visual Basic
Копировать Код
public void DragStatus( DragStatus status );
Копировать Код
Public Sub DragStatus( status As DragStatus )
 Параметры
 Параметры
 Описание
 status
 Статус операции перетаскивания. Член перечисления DragStatus.
 Описание
 Метод вызывается для уведомления действия о выполнении операции перетаскивания, в которой задействованы некоторые объекты, от которых прямо или косвенно зависит данное действие.
 Ссылки
 Teigha.DatabaseServices.AssocAction, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!