Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector2d.TransformBy
 Послать отзыв
 Метод применяет к данному вектору указанное геометрическое преобразование.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector2d TransformBy( Matrix2d leftSide );
Копировать Код
Public Function TransformBy( leftSide As Matrix2d ) As Vector2d
 Параметры
 Параметры
 Описание
 leftSide
 Входное геометрическое преобразование. Тип Matrix2d.
 Возвращает
 Возвращает результат геометрического преобразования данного вектора leftSide х vector^T. Тип Vector2d.
 Описание
 Метод применяет к данному вектору указанное геометрическое преобразование leftSide.
 Ссылки
 Teigha.Geometry.Vector2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!