Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ObjectContextCollectionEnumerator.Reset
 Послать отзыв
 Метод обеспечивает переход перечислителя в начало коллекции.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void Reset();
Копировать Код
Public Overridable Sub Reset()
 Описание
 Метод обеспечивает переход перечислителя в начало коллекции.
 Ссылки
 Teigha.DatabaseServices.ObjectContextCollectionEnumerator, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!