Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Dimadec
 Послать отзыв
 Синтаксис
C#
Visual Basic
public int Dimadec;
Public Property Dimadec() As Integer
 Описание
 Возвращает или устанавливает текущее значение DIMADEC для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!