Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Torus.IntersectWith
 Послать отзыв
 Метод вычисляет точки пересечения данного тора с указанным линейным объектом с использованием точности по умолчанию.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d[] IntersectWith( ref LinearEntity3d linearEntity );
Копировать Код
Public Function IntersectWith( ByRef linearEntity As LinearEntity3d ) As Point3d()
 Параметры
 Параметры
 Описание
 linearEntity
 Линейный объект, точки пересечения с которым требуется вычислить. Тип LinearEntity3d.
 Возвращает
 Возвращает массив точек пересечения данного тора с линейным объектом linearEntity. Тип Point3d[]. Если метод не смог найти точки пересечения или точек пересечения не существует, этот метод возвращает null.
 Описание
 Метод вычисляет точки пересечения данного тора с указанным линейным объектом. Используется вызов метода Torus.IntersectWith(LinearEntity3d linearEntity, Tolerance tolerance) с точностью по умолчанию Tolerance.Global.
 Замечания
 Возвращаемый массив может состоять из четырех элементов. Индексы возвращаемого массива:
0 — Первая точка пересечения (если существует).
1 — Вторая точка пересечения (если существует).
2 — Третья точка пересечения (если существует).
3 — Четвертая точка пересечения (если существует).
 Ссылки
 Teigha.Geometry.Torus, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!