Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocArrayCommonParameters.SetRowSpacing
 Послать отзыв
 Метод позволяет задать расстояние между рядами в массиве.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetRowElevation( double value, ref String expression, ref String evaluatorId );
Копировать Код
Public Sub SetRowElevation( value As Double, ByRef expression As String, ByRef evaluatorId As String )
 Параметры
 Параметры
 Описание
 expression
 Выражение для параметра. Тип String. Строка может быть пустой.
 evaluatorId
 Строковое представление идентификатора вычислителя. Тип String. Строка может быть пустой.
 value
 Расстояние между рядами в массиве. Тип double.
 Описание
 Метод позволяет задать расстояние между рядами в массиве. Если для параметра выражение отсутствует, строки expression и evaluatorId должны быть пустыми.
 Ссылки
 Teigha.DatabaseServices.AssocArrayCommonParameters, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!