Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.BreakEnabled
 Послать отзыв
 Данное свойство хранит информацию о режиме разбиения.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool BreakEnabled;
Копировать Код
Public Property BreakEnabled() As Boolean
 Возвращает
 Возвращает true, если в таблице включен режим разбиения. В противном случае возвращает false.
 Описание
 Данное свойство хранит информацию о режиме разбиения.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!