Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Column.Width
 Послать отзыв
 Свойство Width представляет текущую ширину столбца ячеек.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Width;
Копировать Код
Public Property Width As Double
 Возвращает
 Возвращает ширину столбца ячеек. Тип double.
 Описание
 Свойство Width представляет текущую ширину столбца ячеек.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Column, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!