Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector3dCollection.Insert
 Послать отзыв
 Метод вставляет в коллекцию заданный объект Vector3d по указанному индексу.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Insert( int index, Vector3d value );
Копировать Код
Public Sub Insert( index As Integer, value As Vector3d )
 Параметры
 Параметры
 Описание
 index
 Входной индекс вставленного в коллекцию элемента. Тип int.
 value
 Входной объект, вставляемый в коллекцию. Тип Vector3d.
 Описание
 Метод вставляет в коллекцию заданный объект Vector3d по указанному индексу. Индекс должен иметь допустимое значение.
 Ссылки
 Teigha.Geometry.Vector3dCollection, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!