Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DecomposeForSaveReplacementRecord.ExchangeXData
 Послать отзыв
 Свойство ExchangeXData позволяет проверить, передаются ли XData замещающему объекту.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool ExchangeXData;
Копировать Код
Public ReadOnly Property ExchangeXData As Boolean
 Возвращает
 Возвращает true, если расширенные данные XData передаются замещающему объекту. В противном случае возвращает false.
 Описание
 Свойство ExchangeXData позволяет проверить, передаются ли расширенные данные XData замещающему объекту.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.DecomposeForSaveReplacementRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!