Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Celweight
 Послать отзыв
 Синтаксис
C#
Visual Basic
public DatabaseServices::LineWeight Celweight;
Public Property Celweight() As DatabaseServices.LineWeight
 Описание
 Возвращает или устанавливает значение LineWeight, определяющее текущее значение ширины линии для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!