Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector3dCollection.ToArray
 Послать отзыв
 Метод создает массив объектов Vector3d, содержащий копии всех элементов данной коллекции.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d[] ToArray();
Копировать Код
Public Function ToArray() As Vector3d()
 Возвращает
 Возвращает массив, содержащий копии всех элементов данной коллекции. Тип Vector3d[].
 Описание
 Метод создает массив объектов Vector3d, содержащий копии всех элементов данной коллекции.
 Ссылки
 Teigha.Geometry.Vector3dCollection, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!