Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBDictionaryEntry.ToString
 Послать отзыв
 Возвращает строковое представление данного объекта в виде экземпляра String. Подробности см. в документации Microsoft .NET API.
 Синтаксис
C#
Visual Basic
Копировать Код
public String ToString();
Копировать Код
Public Function ToString() As String
 Описание
 Возвращает строковое представление данного объекта в виде экземпляра String. Подробности см. в документации Microsoft .NET API.
 Ссылки
 Teigha.DatabaseServices.DBDictionaryEntry, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!