Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DataColumn.DataColumn
 Послать отзыв
 Конструктор класса DataColumn. Создает столбец с заданным именем и указанным типом данных в его ячейках.
 Синтаксис
C#
Visual Basic
Копировать Код
public DataColumn( CellType type, ref String columnName );
Копировать Код
Public Sub New( type As CellType, ByRef columnName As String )
 Параметры
 Параметры
 Описание
 type
 Тип данных в ячейках данного столбца. Тип CellType.
 columnName
 Имя столбца. Тип String.
 Описание
 Конструктор класса DataColumn. Создает столбец с заданным именем и указанным типом данных в его ячейках.
 Ссылки
 Teigha.DatabaseServices.DataColumn, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!