Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.Width
 Послать отзыв
 Свойство предоставляет доступ к общей ширине данной таблицы.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual double Width;
Копировать Код
Public virtual Property Width() As double
 Возвращает
 Возвращает общую ширину таблицы, double.
 Описание
 Свойство предоставляет доступ к общей ширине данной таблицы
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!