Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.BlockInsertionPointsEventArgs.AlignmentVectors
 Послать отзыв
 Свойство предоставляет доступ к коллекции векторов выравнивания.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3dCollection AlignmentVectors;
Копировать Код
Public Property AlignmentVectors() As Vector3dCollection
 Возвращает
 Возвращает коллекцию векторов выравнивания. Тип Vector3dCollection
 Описание
 Свойство предоставляет доступ к коллекции векторов выравнивания.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.BlockInsertionPointsEventArgs, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!