Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LineWeight
 Послать отзыв
 Данное перечисление определяет толщины линий (веса линий), используемые при отображении линий и выводе их на печать.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum LineWeight { ByBlock = -2, ByLayer = -1, ByLineWeightDefault = -3, LineWeight000 = 0, LineWeight005 = 5, LineWeight009 = 9, LineWeight013 = 13, LineWeight015 = 15, LineWeight018 = 18, LineWeight020 = 20, LineWeight025 = 25, LineWeight030 = 30, LineWeight035 = 35, LineWeight040 = 40, LineWeight050 = 50, LineWeight053 = 53, LineWeight060 = 60, LineWeight070 = 70, LineWeight080 = 80, LineWeight090 = 90, LineWeight100 = 100, LineWeight106 = 106, LineWeight120 = 120, LineWeight140 = 140, LineWeight158 = 158, LineWeight200 = 200, LineWeight211 = 211 }
Копировать Код
Public Enum LineWeight ByBlock = -2 ByLayer = -1 ByLineWeightDefault = -3 LineWeight000 = 0 LineWeight005 = 5 LineWeight009 = 9 LineWeight013 = 13 LineWeight015 = 15 LineWeight018 = 18 LineWeight020 = 20 LineWeight025 = 25 LineWeight030 = 30 LineWeight035 = 35 LineWeight040 = 40 LineWeight050 = 50 LineWeight053 = 53 LineWeight060 = 60 LineWeight070 = 70 LineWeight080 = 80 LineWeight090 = 90 LineWeight100 = 100 LineWeight106 = 106 LineWeight120 = 120 LineWeight140 = 140 LineWeight158 = 158 LineWeight200 = 200 LineWeight211 = 211 End Enum
 Члены
 Члены
 Описание
 ByBlock
 Значение: -2. Толщина линии определяется настройками блока.
 ByLayer
 Значение: -1. Толщина линии определяется настройками слоя.
 ByLineWeightDefault
 Значение: -3. Толщина линии о умолчанию.
 LineWeight000
 Значение: 0. Толщина 0 мм.
 LineWeight005
 Значение: 5. Толщина 0.05 мм.
 LineWeight009
 Значение: 9. Толщина 0.09 мм.
 LineWeight013
 Значение: 13. Толщина 0.13 мм.
 LineWeight015
 Значение: 15. Толщина 0.15 мм.
 LineWeight018
 Значение: 18. Толщина 0.18 мм.
 LineWeight020
 Значение: 20. Толщина 0.20 мм.
 LineWeight025
 Значение: 25. Толщина 0.25 мм.
 LineWeight030
 Значение: 30. Толщина 0.30 мм.
 LineWeight035
 Значение: 35. Толщина 0.35 мм.
 LineWeight040
 Значение: 40. Толщина 0.40 мм.
 LineWeight050
 Значение: 50. Толщина 0.50 мм.
 LineWeight053
 Значение: 53. Толщина 0.53 мм.
 LineWeight060
 Значение: 60. Толщина 0.60 мм.
 LineWeight070
 Значение: 70. Толщина 0.70 мм.
 LineWeight080
 Значение: 80. Толщина 0.80 мм.
 LineWeight090
 Значение: 90. Толщина 0.90 мм.
 LineWeight100
 Значение: 100. Толщина 1.00 мм.
 LineWeight106
 Значение: 106. Толщина 1.06 мм.
 LineWeight120
 Значение: 120. Толщина 1.20 мм.
 LineWeight140
 Значение: 140. Толщина 1.40 мм.
 LineWeight158
 Значение: 158. Толщина 1.58 мм.
 LineWeight200
 Значение: 200. Толщина 2.00 мм.
 LineWeight211
 Значение: 211. Толщина 2.11 мм.
 Описание
 Данное перечисление определяет толщины линий (веса линий), используемые при отображении линий и выводе их на печать.
 Толщина линий указывается в сотых долях миллиметра, за исключением отрицательных значений. Отрицательные значения обозначают значения по умолчанию, отраженные в наименовании константы.
 Ваши комментарии по поводу этого топика: Послать отзыв!