Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод RasterImageDef.LocateActivePath
 Послать отзыв
 Синтаксис
C#
Visual Basic
public String LocateActivePath();
Public Function LocateActivePath() As String
 Описание
 Возвращает имя пути к реальному файлу, который используется для определения изображения. Требуется, чтобы объект RasterImageDef был открыт на чтение.
 Ссылки
 Teigha.DatabaseServices.RasterImageDef, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!