Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Matrix3d.Transpose
 Послать отзыв
 Метод формирует матрицу, являющуюся результатом транспонирования данной матрицы.
 Синтаксис
C#
Visual Basic
Копировать Код
public Matrix3d Transpose();
Копировать Код
Public Function Transpose() As Matrix3d
 Возвращает
 Возвращает транспонированную матрицу. Тип Matrix3d.
 Описание
 Метод формирует матрицу, являющуюся результатом транспонирования данной матрицы.
 Ссылки
 Teigha.Geometry.Matrix3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!