Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Entity.DBPoint(Point3d)
 Послать отзыв
 Конструктор класса DBPoint. Создаёт геометрический объект "точка" с заданным положением в трёхмерном пространстве.
 Синтаксис
C#
Visual Basic
Копировать Код
public DBPoint(Point3d position);
Копировать Код
Public Sub New(position As Point3d)
 Параметры
 Параметры
 Описание
 position
 Позиция точки (в WCS координатах)
 Описание
 Создает точку, которая использует значение параметра position для получения положения создаваемой точки. Вектор нормали инициализируется как (0,0,1) (в WCS координатах), угол поворота в OSC, равный 0, и толщина, равная 0.
 Ссылки
 Teigha.DatabaseServices.DBPoint, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!