Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.CopyFrom
 Послать отзыв
 Метод предназначен для копирования данных и формата из заданной таблицы. Аргументы метода позволяют дополнительно задать параметры копирования, исходный и целевой диапазоны копируемых ячеек.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual CellRange CopyFrom( ref Table source, TableCopyOptions options, CellRange sourceRange, CellRange targetRange );
Копировать Код
Public virtual Function CopyFrom( ByRef source As Table, options As TableCopyOptions, sourceRange As CellRange, targetRange As CellRange ) As CellRange
 Параметры
 Параметры
 Описание
 source
 Исходная таблица. Тип Table.
 options
 Параметры копирования. Тип TableCopyOptions.
 sourceRange
 Исходный диапазон ячеек. Тип CellRange.
 targetRange
 Целевой диапазон ячеек. Тип CellRange.
 Возвращает
 Возвращает диапазон скопированных ячеек, тип CellRange.
 Описание
 Метод предназначен для копирования данных и формата из заданной таблицы. Параметры копирования задаются объектом TableCopyOptions. Метод позволяет задать исходный и целевой диапазоны копируемых ячеек. Если эти диапазоны не совпадают, данные копируются в новый диапазон с учетом заданных параметров копирования.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!