Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MInsertBlock
 Послать отзыв
 Класс MInsertBlock представляет в базе данных массивы вхождений блоков (MInserts).
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::GraphicsInterface::Drawable Teigha::DatabaseServices::DBObject Teigha::DatabaseServices::Entity Teigha::DatabaseServices::BlockReference Teigha::DatabaseServices::MInsertBlock
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("AcDbMInsertBlock")] public class MInsertBlock : BlockReference
Копировать Код
<Wrapper("AcDbMInsertBlock")> Public Class MInsertBlock Inherits BlockReference
 Описание
 Класс MInsertBlock представляет в базе данных массивы вхождений блоков (MInserts).
 По сути, это специальный вид объекта INSERT, который отображает массив повторяющихся изображений объектов в указанной BlockTableRecord. Попытка создать экземпляр MInsertBlock с определением, в котором всего одна строка и один столбец, вместо этого создаст просто вхождение блока BlockReference.
 Методы
 Конструкторы
 Teigha.GraphicsInterface.Drawable
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 Drawable
 Конструктор класса Teigha.GraphicsInterface.Drawable. (Унаследован от Drawable)
 Teigha.DatabaseServices.DBObject
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 DBObject
 Конструктор. (Унаследован от DBObject)
 Teigha.DatabaseServices.BlockReference
 Имя
 Описание
 BlockReference
 Это обзор перегрузок BlockReference.
 Teigha.DatabaseServices.MInsertBlock
 Имя
 Описание
 MInsertBlock
 Это обзор перегрузок MInsertBlock.
 Деструкторы
 Teigha.DatabaseServices.BlockReference
 ПоказатьProtectedУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 ~BlockReference
 This is ~BlockReference, a member of class BlockReference. (Унаследован от BlockReference)
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.GraphicsInterface.Drawable
 Имя
 Описание
 Drawable Методы
 Ниже перечислены методы класса Drawable.
 Drawable Свойства
 Ниже перечислены свойства класса Drawable.
 Teigha.DatabaseServices.DBObject
 Имя
 Описание
 DBObject Методы
 Ниже перечислены методы класса DBObject.
 DBObject Свойства
 Ниже перечислены свойства класса DBObject.
 DBObject События
 Ниже перечислены события класса DBObject.
 Teigha.DatabaseServices.Entity
 Имя
 Описание
 Entity Методы
 Ниже перечислены методы класса Entity.
 Entity Свойства
 Ниже перечислены свойства класса Entity.
 Teigha.DatabaseServices.BlockReference
 Имя
 Описание
 BlockReference Данные
 Ниже перечислены данные класса BlockReference.
 BlockReference Методы
 Ниже перечислены методы класса BlockReference.
 BlockReference Свойства
 Ниже перечислены свойства класса BlockReference.
 Teigha.DatabaseServices.MInsertBlock
 Имя
 Описание
 MInsertBlock Свойства
 Ниже перечислены свойства класса MInsertBlock.
 Ссылки
 MInsertBlock Конструктор, MInsertBlock Свойства, Методы, Топики, BlockReference Данные, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства, DBObject События
 Ваши комментарии по поводу этого топика: Послать отзыв!