Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Point2d.IsEqualTo
 Послать отзыв
 Метод проверяет совпадение точек в пределах указанного допуска.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsEqualTo( Point2d a, Tolerance tolerance );
Копировать Код
Public Function IsEqualTo( a As Point2d, tolerance As Tolerance ) As Boolean
 Параметры
 Параметры
 Описание
 a
 Точка, с которой проверяется совпадение. Тип Point2d.
 tolerance
 Допуск. Тип Tolerance.
 Возвращает
 Возвращает true, если расстояние между точками не превышает величину Tolerance.EqualPoint(). В противном случае возвращает false.
 Описание
 Метод позволяет установить, что расстояние между точкой a и данной точкой не превышает значение Tolerance.EqualPoint(). Возвращает true, если условие выполнено. В противном случае возвращает false.
 Ссылки
 Teigha.Geometry.Point2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!