Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.ExternalCurve3d.ExternalCurve3d
 Послать отзыв
 Конструктор по умолчанию класса ExternalCurve3d.
 Синтаксис
C#
Visual Basic
Копировать Код
public ExternalCurve3d();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса ExternalCurve3d. Создает пустой экземпляр по умолчанию с нулевым указателем на определение кривой, неопределенным типом кривой (другими словами, нет информации о системе, в которой была создана внешняя кривая) и опцией предотвращения копирования внешней кривой.
 Ссылки
 Teigha.Geometry.ExternalCurve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!