Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SubDMesh.SubDividedVertices
 Послать отзыв
 Свойство предоставляет доступ к массиву вершин сглаженной сети.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3dCollection SubDividedVertices;
Копировать Код
Public Property SubDividedVertices() As Point3dCollection
 Возвращает
 Возвращает массив вершин Point3dCollection.
 Описание
 Свойство предоставляет доступ к массиву вершин сглаженной сети.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.SubDMesh, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!