Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LayoutEventArgs.Id
 Послать отзыв
 Свойство представляет идентификатор объекта измененного листа.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectId Id;
Копировать Код
Public ReadOnly Property Id As ObjectId
 Возвращает
 Возвращает идентификатор объекта измененного листа. Тип ObjectId.
 Описание
 Свойство представляет идентификатор объекта измененного листа.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.LayoutEventArgs, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!