Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.KnotCollection.IsSynchronized
 Послать отзыв
 Свойство IsSynchronized позволяет проверить, является ли доступ к этой коллекции потокобезопасным.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual bool IsSynchronized;
Копировать Код
Public Overridable ReadOnly Property IsSynchronized As Boolean
 Возвращает
 Возвращает true, если доступ к этой коллекции является потокобезопасным. В противном случае возвращает false.
 Описание
 Свойство IsSynchronized позволяет проверить, является ли доступ к этой коллекции потокобезопасным.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.KnotCollection, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!