Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocArrayCommonParameters.SetRowCount
 Послать отзыв
 Метод позволяет задать количество рядов (строк) в массиве.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetRowCount( int count, ref String expression, ref String evaluatorId );
Копировать Код
Public Sub SetRowCount( count As Integer, ByRef expression As String, ByRef evaluatorId As String )
 Параметры
 Параметры
 Описание
 count
 Входное количество рядов в массиве. Тип int.
 expression
 Выражение для параметра. Тип String. Строка может быть пустой.
 evaluatorId
 Строковое представление идентификатора вычислителя. Тип String. Строка может быть пустой.
 Описание
 Метод позволяет задать количество рядов (строк) в массиве. Если для параметра выражение отсутствует, строки expression и evaluatorId должны быть пустыми.
 Ссылки
 Teigha.DatabaseServices.AssocArrayCommonParameters, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!