Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SubDMesh.ConvertToSurface
 Послать отзыв
 Метод предназначен для создания нового объекта Surface из фрагмента этой сети.
 Синтаксис
C#
Visual Basic
Копировать Код
public Surface ConvertToSurface( bool convertAsSmooth, bool optimize );
Копировать Код
Public Function ConvertToSurface( convertAsSmooth As Boolean, optimize As Boolean ) As Surface
 Параметры
 Параметры
 Описание
 convertAsSmooth
 Флаг, определяющий, следует ли выполнять преобразование в гладкую поверхность. Тип bool. Если задано false, то будет выполнено преобразование в граненую поверхность (faceted surface).
 optimize
 Флаг, определяющий, следует ли выполнить преобразование в оптимизированную поверхность. Тип bool.
 Возвращает
 Возвращает объект Surface, преобразованный из этого SubDMesh.
 Описание
 Метод предназначен для создания нового объекта Surface из фрагмента этой сети.
 Ссылки
 Teigha.DatabaseServices.SubDMesh, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!