Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Filters.SpatialFilterDefinition.Enabled
 Послать отзыв
 Свойство Enabled позволяет определить, используется ли для фильтрации объектов чертежа граничная область фильтра или же всё трехмерное пространство.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool Enabled;
Копировать Код
Public ReadOnly Property Enabled As Boolean
 Возвращает
 Возвращает true, если для фильтрации объектов чертежа используется граничная область фильтра. Если область отключена (значение false), то зоной действия фильтра становится все 3D-пространство.
 Описание
 Свойство Enabled возвращает статус граничной области фильтра. Если область отключена (значение false), то зоной действия фильтра становится всё 3D-пространство.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Filters.SpatialFilterDefinition, Teigha.DatabaseServices.Filters
 Ваши комментарии по поводу этого топика: Послать отзыв!