Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.EllipticalCylinder.IsClosed
 Послать отзыв
 Метод позволяет проверить, является ли основание этого эллиптического цилиндра полным эллипсом.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsClosed();
Копировать Код
Public Function IsClosed() As Boolean
 Возвращает
 Возвращает true, если основание эллиптического цилиндра представляет собой полный эллипс. В противном случае возвращает false.
 Описание
 Метод позволяет проверить, является ли основание этого эллиптического цилиндра полным эллипсом.
 Замечания
 Используется вызов метода EllipticalCylinder.IsClosed(Tolerance) с точностью, равной Tolerance.Global.
 Ссылки
 Teigha.Geometry.EllipticalCylinder, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!