Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.TableStyle.Margin
 Послать отзыв
 Метод позволяет получить величину поля указанного типа в заданном стиле ячейки.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual double Margin( CellMargins cellMargin, ref String styleName );
Копировать Код
Public Overridable Function Margin( cellMargin As CellMargins, ByRef styleName As String ) As Double
 Параметры
 Параметры
 Описание
 cellMargin
 Тип поля ячейки. Перечисление CellMargins.
 styleName
 Имя стиля ячейки таблицы. Тип String.
 Возвращает
 Возвращает величину поля. Тип double.
 Описание
 Метод позволяет получить величину поля указанного типа в заданном стиле ячейки.
 Ссылки
 Teigha.DatabaseServices.TableStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!