Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.TextRotation
 Послать отзыв
 Свойство управляет углом поворота поля размерного текста в радианах.
 Синтаксис
C#
Visual Basic
Копировать Код
public double TextRotation;
Копировать Код
Public Property TextRotation As Double
 Возвращает
 Возвращает угол поворота размерного текста. Тип double.
 Описание
 Свойство задает или возвращает угол поворота поля размерного текста.
 Угол задается в радианах. Направление поворота определяется знаком угла. Отрицательные значения угла означают поворот по часовой стрелке (вправо). Положительные значения - против часовой стрелки (влево).
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!