Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CellContent.BlockTableRecordId
 Послать отзыв
 Свойство BlockTableRecordId предоставляет доступ к идентификатору ObjectId записи в таблице блоков для содержимого ячейки.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectId BlockTableRecordId;
Копировать Код
Public Property BlockTableRecordId As ObjectId
 Возвращает
 Возвращает идентификатор ObjectId записи в таблице блоков.
 Описание
 Свойство BlockTableRecordId предоставляет доступ к идентификатору ObjectId записи в таблице блоков для содержимого ячейки.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.CellContent, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!