Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Hatch.ShadeTintValue
 Послать отзыв
 Синтаксис
C#
Visual Basic
public float ShadeTintValue;
Public Property ShadeTintValue() As float
 Описание
 Обеспечивает доступ к значению яркости одноцветного градиента.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Hatch, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!