Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DynamicDimensionData.DynamicDimensionData
 Послать отзыв
 Конструктор класса DynamicDimensionData. Создает динамический размер на основе данных указанного объекта Dimension. Дополнительные аргументы позволяют настроить возможность редактирования и видимость динамического размера.
 Синтаксис
C#
Visual Basic
Копировать Код
public DynamicDimensionData( ref Dimension dimension, bool editable, bool hideIfValueIsZero );
Копировать Код
Public Sub New( ByRef dimension As Dimension, editable As Boolean, hideIfValueIsZero As Boolean )
 Параметры
 Параметры
 Описание
 dimension
 Входной размер, на основе которого создается динамический размер. Тип Dimension.
 editable
 Флаг, который определяет, является ли создаваемый динамический размер редактируемым. Тип bool.
 hideIfValueIsZero
 Флаг, который определяет, следует ли скрывать создаваемый динамический размер в случае нулевого значения. Тип bool.
 Описание
 Конструктор класса DynamicDimensionData. Создает динамический размер на основе данных указанного объекта Dimension. Дополнительные аргументы позволяют настроить возможность редактирования и видимость динамического размера.
 Ссылки
 Teigha.DatabaseServices.DynamicDimensionData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!