Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.XrefPreXrefLockFileEventArgs
 Послать отзыв
 Класс XrefPreXrefLockFileEventArgs представляет данные для события XrefPreXrefLockFile в базе данных.
 Иерархия классов
Teigha::DatabaseServices::XrefPreXrefLockFileEventArgs
 Синтаксис
C#
Visual Basic
Копировать Код
public sealed class XrefPreXrefLockFileEventArgs : EventArgs
Копировать Код
Public NotInheritable Class XrefPreXrefLockFileEventArgs Inherits EventArgs
 Описание
 Класс XrefPreXrefLockFileEventArgs представляет данные для события XrefPreXrefLockFile в базе данных.
 Топики
 Имя
 Описание
 XrefPreXrefLockFileEventArgs Свойства
 Ниже перечислены свойства класса XrefPreXrefLockFileEventArgs.
 Ссылки
 XrefPreXrefLockFileEventArgs Свойства, Топики, XrefPreXrefLockFileEventArgs Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!