Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MInsertBlock.Columns
 Послать отзыв
 Свойство представляет количество столбцов изображения BlockTableRecord для отображения данным объектом.
 Синтаксис
C#
Visual Basic
Копировать Код
public short Columns;
Копировать Код
Public Property Columns As Short
 Возвращает
 Возвращает количество столбцов. Тип short.
 Описание
 Свойство представляет количество столбцов изображения BlockTableRecord для отображения данным объектом.т
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MInsertBlock, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!