Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Событие Database.XrefRedirected
 Послать отзыв
 Синтаксис
C#
Visual Basic
public event XrefRedirectedEventHandler XrefRedirected;
Public Event XrefRedirected As XrefRedirectedEventHandler
 Описание
 Событие показывает, что objectId переадресован, т.е. objectId в ссылке чертежа изменен, чтобы указывать на ассоциированный объект в основном чертеже.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!