Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LinkedTableData.GetToolTip
 Послать отзыв
 Метод позволяет получить подсказку для указанной ячейки таблицы.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual String GetToolTip( int row, int column );
Копировать Код
Public Overridable Function GetToolTip( row As Integer, column As Integer ) As String
 Параметры
 Параметры
 Описание
 row
 Индекс строки. Тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 column
 Индекс столбца. Тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице.
 Возвращает
 Возвращает подсказку для указанной ячейки. Тип String.
 Описание
 Метод позволяет получить подсказку для указанной ячейки таблицы.
 Ссылки
 Teigha.DatabaseServices.LinkedTableData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!