Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Hatch.RemoveAssociatedObjectIds
 Послать отзыв
 Синтаксис
C#
Visual Basic
public void RemoveAssociatedObjectIds();
Public Sub RemoveAssociatedObjectIds()
 Описание
 Метод удаляет все Id объектов, исходной геометрии контура, ассоциированных с объектом заливки.
 Ссылки
 Teigha.DatabaseServices.Hatch, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!