Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Viewport.ViewDirection
 Послать отзыв
 Свойство ViewDirection представляет направление вида в данном видовом экране (в мировой системе координат).
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d ViewDirection;
Копировать Код
Public Property ViewDirection As Vector3d
 Возвращает
 Возвращает направление вида (в мировой системе координат, WCS ). Тип Vector3d.
 Описание
 Свойство ViewDirection представляет направление вида в данном видовом экране (в мировой системе координат, WCS ).
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Viewport, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!