Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Entity.GetSubentityPathsAtGraphicsMarker(SubentityType
 Послать отзыв
 Метод предназначен для получения путей к геометрическим подобъектам по связанному с ними графическому маркеру (GS-маркеру), что позволяет определить, какой именно элемент сложного объекта был выбран пользователем. Он учитывает тип подобъекта, точку выбора, преобразование вида и стек вложенных объектов.
 Синтаксис
C#
Visual Basic
Копировать Код
public FullSubentityPath[] GetSubentityPathsAtGraphicsMarker(SubentityType type, IntPtr gsMark, Point3d pickPoint, Matrix3d viewTransform, ObjectId[] entityAndInsertStack);
Копировать Код
Public Function GetSubentityPathsAtGraphicsMarker(type As SubentityType, gsMark As IntPtr, pickPoint As Point3d, viewTransform As Matrix3d, entityAndInsertStack As ObjectId[]) As FullSubentityPath[]
 Параметры
 Параметры
 Описание
 type
 Тип запрашиваемого подобъекта (например, ребро, грань и т.д.). Тип SubentityType
 gsMark
 Графический маркер (GS-маркер) — целочисленный идентификатор, связанный с подобъектом или группой графических примитивов во время отрисовки. Тип IntPtr
 pickPoint
 Точка выбора в мировых координатах (WCS), указывающая место, где пользователь выбрал объект на экране. Тип Point3d
 viewTransform
 Матрица преобразования из системы координат мира (WCS) в систему координат устройства (DCS), используемая для корректного определения положения подобъекта в текущем виде. Тип Matrix3d
 entityAndInsertStack
 Массив идентификаторов объектов, представляющих вложенные контейнеры подобъекта (например, вставки блоков), необходимый для точного определения пути к выбранному элементу в составных объектах. Тип ObjectId[]
 numInserts
 Количество идентификаторов объектов в массиве entityAndInsertStack, относящихся к вставкам блоков. В настоящее время не используется. Тип int
 Возвращает
 Метод возвращает массив объектов типа FullSubentityPath, представляющих полные пути к подобъектам, связанным с указанным графическим маркером (gsMark). Каждый путь однозначно идентифицирует подобъект внутри сложной структуры геометрического объекта, учитывая вложенные контейнеры и иерархию блоков.
 Если подходящих подобъектов не найдено, возвращается пустой массив.
 Описание
 Метод предоставляет доступ к массиву путей к геометрическим подобъектам (FullSubentityPath), связанным с указанным графическим маркером (gsMark). Используется для сложных объектов, которые во время отрисовки могут ассоциировать целочисленные идентификаторы (GS-маркеры) с отдельными графическими примитивами или их группами.
 Метод учитывает тип подобъекта, точку выбора в мировых координатах (pickPoint), матрицу преобразования из WCS в DCS (viewTransform), а также стек вложенных контейнеров (entityAndInsertStack), позволяя точно определить, какой именно подобъект был выбран пользователем.
 Ссылки
 Teigha.DatabaseServices.Entity, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!