Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Solid3d.MassProperties
 Послать отзыв
 Свойство MassProperties представляет массо-центровочные характеристики данного твердого тела.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual Solid3dMassProperties MassProperties;
Копировать Код
Public Overridable ReadOnly Property MassProperties As Solid3dMassProperties
 Возвращает
 Возвращает массо-центровочные характеристики данного объекта. Тип Solid3dMassProperties.
 Описание
 Свойство MassProperties представляет массо-центровочные характеристики данного твердого тела.
 Они включают в себя следующую информацию.
Объем твердого тела.
Координаты центра тяжести твердого тела.
Моменты инерции твердого тела.
Центробежные моменты инерции твердого тела.
Главные моменты твердого тела.
Главные оси твердого тела.
Радиусы инерции твердого тела.
Габаритная рамка твердого тела.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Solid3d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!