Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Database.DisablePartialOpen
 Послать отзыв
 Синтаксис
C#
Visual Basic
public void DisablePartialOpen();
Public Sub DisablePartialOpen()
 Описание
 При вызове события частичного открытия базы, эта функция ветирует операцию частичного открытия и приводит к загрузке чертежа целиком.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!