Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.IdMapping.Item
 Послать отзыв
 Свойство предоставляет доступ к объекту IdPair по его ключу.
 Синтаксис
C#
Visual Basic
Копировать Код
public IdPair this[ObjectId key];
Копировать Код
Default Public Property Item( key As ObjectId ) As IdPair
 Параметры
 Параметры
 Описание
 key
 Ключ объекта IdPair. Тип ObjectId.
 Возвращает
 Возвращает объект IdPair ключом key.
 Описание
 Свойство предоставляет доступ к объекту IdPair по его ключу.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.IdMapping, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!