Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector2d.IsPerpendicularTo
 Послать отзыв
 Метод проверяет перпендикулярность входного вектора данному вектору.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsPerpendicularTo( Vector2d vector );
Копировать Код
Public Function IsPerpendicularTo( vector As Vector2d ) As Boolean
 Параметры
 Параметры
 Описание
 vector
 Проверяемый вектор. Тип Vector2d.
 Возвращает
 Возвращает true, если в пределах используемой точности векторы можно считать перпендикулярными. В противном случае возвращает false.
 Описание
 Метод проверяет перпендикулярность входного вектора vector данному вектору.
 Реализация использует вызов метода Vector2d.IsPerpendicularTo(Vector2d vector, Tolerance tolerance) с точностью по умолчанию Tolerance.EqualVector.
 Ссылки
 Teigha.Geometry.Vector2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!