Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство RasterImage.Name
 Послать отзыв
 Синтаксис
C#
Visual Basic
public String Name;
Public Property Name() As String
 Описание
 Обеспечивает доступ к имени изображения.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.RasterImage, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!