Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Background
 Послать отзыв
 Класс Background является базовым классом для всех объектов, представляющих фон видового экрана.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::GraphicsInterface::Drawable Teigha::DatabaseServices::DBObject Teigha::DatabaseServices::Background
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("AcDbBackground")] public class Background : DBObject;
Копировать Код
<Wrapper("AcDbBackground")> Public Class Background Inherits DBObject
 Описание
 Класс Background является базовым классом для всех фоновых объектов, представляющих фон видового экрана. Существуют три конкретных типа фона, которые реализуются производными классами SolidBackground, GradientBackground и ImageBackground. Видовые экраны с настроенным фоном должны ссылаться на один из этих классов. Каждый резидентный фоновый объект должен находиться в словаре ACAD_BACKGROUND.
 Приложение, задающее фон видового экрана, ответственно за то, чтобы создать новый фон, присвоить ему уникальное имя, задать соответствующие свойства и добавить фон в словарь ACAD_BACKGROUND, а также удалить из словаря предыдущий фоновый объект (если приложению он больше не требуется).
 Замечания
 Фоновый объект не должен совместно использоваться несколькими видовыми экранами. Удаление видового экрана сопровождается удалением связанного с ним фона.
 Методы
 Конструкторы
 Teigha.GraphicsInterface.Drawable
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 Drawable
 Конструктор класса Teigha.GraphicsInterface.Drawable. (Унаследован от Drawable)
 Teigha.DatabaseServices.DBObject
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 DBObject
 Конструктор. (Унаследован от DBObject)
 Teigha.DatabaseServices.Background
 Имя
 Описание
 Background
 Конструктор класса Background.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.GraphicsInterface.Drawable
 Имя
 Описание
 Drawable Методы
 Ниже перечислены методы класса Drawable.
 Drawable Свойства
 Ниже перечислены свойства класса Drawable.
 Teigha.DatabaseServices.DBObject
 Имя
 Описание
 DBObject Методы
 Ниже перечислены методы класса DBObject.
 DBObject Свойства
 Ниже перечислены свойства класса DBObject.
 DBObject События
 Ниже перечислены события класса DBObject.
 Teigha.DatabaseServices.Background
 Имя
 Описание
 Background Методы
 Ниже перечислены методы класса Background.
 Ссылки
 Background Методы, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства, DBObject События
 Ваши комментарии по поводу этого топика: Послать отзыв!