Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.SetDataType
 Послать отзыв
 Метод позволяет задать в ячейке тип данных и тип единицы измерения.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetDataType( int row, int col, DatabaseServices.DataType nDataType, UnitType nUnitType );
Копировать Код
Public virtual Sub SetDataType( row As Integer, col As Integer, nDataType As DatabaseServices.DataType, nUnitType As UnitType )
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 col
 Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
 nDataType
 Тип данных. Тип DatabaseServices.DataType.
 nUnitType
 Тип единицы измерения данных. Тип UnitType.
 Описание
 Метод позволяет задать в ячейке тип данных и тип единицы измерения.
 Замечания
 Для получения того же результата предпочтительнее использовать Table.Cells[row,column].DataType.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!