Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DxfFiler.ErrorMessage
 Послать отзыв
 Свойство обеспечивает доступ к сообщению об ошибке, которое в данный момент настроено в объекте DxfFiler для отображения в случае возникновения ошибки. Не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual String ErrorMessage;
Копировать Код
Public Overridable ReadOnly Property ErrorMessage As String
 Возвращает
 Возвращает строку с сообщением об ошибке. Тип String.
 Описание
 Свойство обеспечивает доступ к сообщению об ошибке, которое в данный момент настроено в объекте DxfFiler для отображения в случае возникновения ошибки.
 Не реализовано.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.DxfFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!