Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotStyleTable.DelPlotStyle
 Послать отзыв
 Метод удаляет из данной таблицы указанный стиль печати.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual PlotStyle DelPlotStyle( ref PlotStyle pPsPtr );
Копировать Код
Public Overridable Function DelPlotStyle( ByRef pPsPtr As PlotStyle ) As PlotStyle
 Параметры
 Параметры
 Описание
 pPsPtr
 Удаляемый стиль печати. Тип PlotStyle.
 Возвращает
 Возвращает ссылку на удаленный стиль печати. Тип PlotStyle.
 Описание
 Метод удаляет из данной таблицы стиль печати pPsPtr.
 Ссылки
 Teigha.DatabaseServices.PlotStyleTable, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!