Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DatabaseSummaryInfo.Comments
 Послать отзыв
 Свойство предоставляет доступ к комментарию в данном объекте DatabaseSummaryInfo.
 Синтаксис
C#
Visual Basic
Копировать Код
public String Comments;
Копировать Код
Public Property Comments() As String
 Возвращает
 Возвращает комментарий. Тип String.
 Описание
 Свойство предоставляет доступ к комментарию в данном объекте DatabaseSummaryInfo.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.DatabaseSummaryInfo, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!