Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MentalRayRenderSettings.LightLuminanceScale
 Послать отзыв
 Свойство LightLuminanceScale представляет физическую яркость света с интенсивностью 1.0 (в канделах). Не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public double LightLuminanceScale;
Копировать Код
Public Property LightLuminanceScale As Double
 Возвращает
 Возвращает физическую яркость света с единичной интенсивностью в канделах. Тип double.
 Описание
 Свойство LightLuminanceScale представляет физическую яркость света с интенсивностью 1.0 (в канделах). В текущей версии это свойство не реализовано.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MentalRayRenderSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!