Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector3d.CrossProduct
 Послать отзыв
 Метод реализует векторное произведение данного вектора и входного 3D-вектора.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d CrossProduct( Vector3d vector );
Копировать Код
Public Function CrossProduct( vector As Vector3d ) As Vector3d
 Параметры
 Параметры
 Описание
 vector
 Входной 3D-вектор. Тип Vector3d.
 Возвращает
 Возвращает результат векторного произведения в виде объекта Vector3d.
 Описание
 Метод реализует векторное произведение данного вектора и входного 3D-вектора vector.
 Ссылки
 Teigha.Geometry.Vector3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!