Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Group.Reverse
 Послать отзыв
 Этот метод меняет на обратный порядок индексирования объектов в этой группе.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Reverse();
Копировать Код
Public Sub Reverse()
 Описание
 Этот метод меняет на обратный порядок индексирования объектов в этой группе. Изменяются только индексы объектов. Первый объект в группе становится последним объектом в группе, а последний - первым.
 Ссылки
 Teigha.DatabaseServices.Group, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!