Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MlineStyleElement.MlineStyleElement
 Послать отзыв
 Конструктор класса MlineStyleElement. Создает элемент стиля с указанным смещением, цветом и идентификатором типа линии.
 Синтаксис
C#
Visual Basic
Копировать Код
public MlineStyleElement( double offset, ref Color color, ObjectId linetypeId );
Копировать Код
Public Sub New( offset As Double, ByRef color As Color, linetypeId As ObjectId )
 Параметры
 Параметры
 Описание
 offset
 Смещение элемента. Тип double.
 color
 Цвет элемента. Тип Color.
 linetypeId
 Идентификатор типа линии. Тип ObjectId.
 Описание
 Конструктор класса MlineStyleElement. Создает элемент стиля с указанным смещением, цветом и идентификатором типа линии.
 Ссылки
 Teigha.DatabaseServices.MlineStyleElement, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!