Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ObjectIdCollection.ObjectIdCollection
 Послать отзыв
 Конструктор по умолчанию класса ObjectIdCollection.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectIdCollection();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса ObjectIdCollection.
 Ссылки
 Teigha.DatabaseServices.ObjectIdCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!