Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство BlockReference.Position
 Послать отзыв
 Синтаксис
C#
Visual Basic
public Point3d Position;
Public Property Position() As Point3d
 Описание
 Обеспечивает доступ к значению расположения (часто называемую точкой вставки), в мировых координатах. Note Значение расположения — это эквивалент (в мировых координатах) DXF группового кода 10.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.BlockReference, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!