Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Leader.SetVertexAt
 Послать отзыв
 Синтаксис
C#
Visual Basic
public bool SetVertexAt(int index, Point3d pointValue);
Public Function SetVertexAt(index As Integer, pointValue As Point3d) As bool
 Параметры
 Параметры
 Описание
 index
 Индекс вершины (начинающийся с 0), которая должна быть изменена
 pointValue
 Значение новой точки (в WCS координатах)
 Описание
 Переустанавливает вершину с индексом index в точку pointValue, проецированную (вдоль вектора нормали плоскости) на плоскость, содержащую выноску. Метод не переустанавливает вершину, если один из сегментов объекта станет слишком маленьким (меньше 1e-10).
 Возвращает true, если новая вершина успешно задана. В противном случае возвращает false.
 Ссылки
 Teigha.DatabaseServices.Leader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!