Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Filters.SpatialFilter.GetVolume
 Послать отзыв
 Этот метод позволяет получить описание объема данного пространственного фильтра в виде объекта SpatialFilterVolume.
 Синтаксис
C#
Visual Basic
Копировать Код
public SpatialFilterVolume GetVolume();
Копировать Код
Public Function GetVolume() As SpatialFilterVolume
 Возвращает
 Возвращает объем данного пространственного фильтра. Тип SpatialFilterVolume.
 Описание
 Этот метод позволяет получить описание объема данного пространственного фильтра в виде объекта SpatialFilterVolume.
 Ссылки
 Teigha.DatabaseServices.Filters.SpatialFilter, Teigha.DatabaseServices.Filters
 Ваши комментарии по поводу этого топика: Послать отзыв!