Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.BlockTableRecordId
 Послать отзыв
 Данный метод предназначен для определения идентификатора ObjectId записи в таблице блоков для указанной ячейки таблицы.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual DatabaseServices.ObjectId BlockTableRecordId( int row, int col );
Копировать Код
Public virtual Function BlockTableRecordId( row As Integer, col As Integer ) As DatabaseServices.ObjectId
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int.
 col
 Индекс столбца, тип int.
 Возвращает
 Возвращает ObjectId записи в таблице блоков. Тип DatabaseServices.ObjectId.
 Описание
 Данный метод предназначен для определения идентификатора ObjectId записи в таблице блоков для ячейки, заданной индексами строки и столбца.
 Замечания
 Для получения того же результата предпочтительнее использовать Table.Cells[row,column].Contents[i].BlockTableRecordId.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!