Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Событие Database.BeginInsert
 Послать отзыв
 Синтаксис
C#
Visual Basic
public event BeginInsertEventHandler BeginInsert;
Public Event BeginInsert As BeginInsertEventHandler
 Описание
 Событие показывает, что база данных чертежа начинает выполнять операцию добавления в базу данных чертежа.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!