Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObject.ResetScaleDependentProperties()
 Послать отзыв
 Метод возвращает свойства объекта, зависящие от масштаба, к значениям по умолчанию.
 Синтаксис
C#
Visual Basic
Копировать Код
public void ResetScaleDependentProperties();
Копировать Код
Public Sub ResetScaleDependentProperties()
 Описание
 Переустанавливает все зависимые от масштаба свойства объекта на их значения по умолчанию.
 Объект реализует эту функцию для поддержки команды ANNORESET. Объект может реализовывать свойства, которые являются зависимыми от масштаба, например, положение или поворот объекта. Объект, который хочет поддерживать команду ANNORESET, должен обеспечивать реализацию этого метода, который установит все зависящие от масштаба свойства, чтобы соответствовать свойствам в текущем масштабе (или в масштабе по умолчанию, определенному для объекта, если объект не поддерживает текущий масштаб).
 Ссылки
 Teigha.DatabaseServices.DBObject, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!