Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CurveBoundary.NumElements
 Послать отзыв
 Свойство NumElements представляет количество элементов в данной границе.
 Синтаксис
C#
Visual Basic
Копировать Код
public int NumElements;
Копировать Код
Public ReadOnly Property NumElements As Integer
 Возвращает
 Возвращает количество элементов в данной границе. Тип int.
 Описание
 Свойство NumElements представляет количество элементов в данной границе.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.CurveBoundary, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!