Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.GetFormula
 Послать отзыв
 Метод позволяет получить формулу, если она имеется в указанном элементе содержимого ячейки.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual String GetFormula( int row, int column, int contentIndex );
Копировать Код
Public virtual Function GetFormula( row As Integer, column As Integer, contentIndex As Integer ) As String
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 contentIndex
 Индекс элемента содержимого ячейки, тип int. Индекс должен быть больше или равен нулю и меньше количества элементов содержимого в ячейке.
 col
 Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
 Возвращает
 Возвращает формулу в виде экземпляра класса String.
 Описание
 Метод позволяет получить формулу, если она имеется в указанном индексом элементе содержимого ячейки. В случае отсутствия формулы метод возвращает пустую строку. Ячейка задается индексами строки и столбца.
 Замечания
 Для получения того же результата предпочтительнее использовать Table.Cells[row,column].Contents[i].Formula.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!