Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CircularArc3d.SetAxes
 Послать отзыв
 Метод позволяет переопределить вектор нормали и опорный вектор дуги.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetAxes( Vector3d normal, Vector3d referenceVector );
Копировать Код
Public Sub SetAxes( normal As Vector3d, referenceVector As Vector3d )
 Параметры
 Параметры
 Описание
 normal
 Вектор нормали плоскости, в которой располагается дуга. Тип Vector3d.
 referenceVector
 Опорный вектор, определяющий направление начала отсчета углов дуги (направление нулевого угла). Тип Vector3d.
 Описание
 Метод позволяет переопределить вектор нормали и опорный вектор дуги. Векторы normal и referenceVector должны быть перпендикулярны друг другу.
 Ссылки
 Teigha.Geometry.CircularArc3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!