Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.SurfaceSurfaceIntersectorConfigurations.Surface2Left
 Послать отзыв
 Свойство Surface2Left представляет конфигурацию второй поверхности слева от кривой пересечения.
 Синтаксис
C#
Visual Basic
Копировать Код
public SurfaceSurfaceIntersectorConfiguration Surface2Left;
Копировать Код
Public ReadOnly Property Surface2Left As SurfaceSurfaceIntersectorConfiguration
 Возвращает
 Возвращает конфигурацию второй поверхности слева от кривой пересечения. Тип SurfaceSurfaceIntersectorConfiguration.
 Описание
 Свойство Surface2Left представляет конфигурацию второй поверхности слева от кривой пересечения.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.SurfaceSurfaceIntersectorConfigurations, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!