Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LoftOptionsCheckCurvesOut.AllPlanar
 Послать отзыв
 Свойство позволяет проверить, все ли поперечные сечения являются плоскими.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool AllPlanar;
Копировать Код
Public ReadOnly Property AllPlanar As Boolean
 Возвращает
 Возвращает true, если все поперечные сечения являются плоскими. В противном случае возвращает false.
 Описание
 Свойство позволяет проверить, все ли поперечные сечения являются плоскими.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.LoftOptionsCheckCurvesOut, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!