Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Group.SetLinetype
 Послать отзыв
 Метод позволяет задать всем объектам этой группы тип линий с указанным именем.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetLinetype( ref String value );
Копировать Код
Public Sub SetLinetype( ByRef value As String )
 Параметры
 Параметры
 Описание
 value
 Имя типа линий. Тип String.
 Описание
 Метод позволяет задать всем объектам этой группы тип линий, указанный по имени. Тип линий должен быть загружен до вызова метода.
 Ссылки
 Teigha.DatabaseServices.Group, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!