Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Filters.LayerFilter.Remove
 Послать отзыв
 Метод предназначен для удаления указанного слоя из данного объекта LayerFilter.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Remove( ref String layer );
Копировать Код
Public Sub Remove( ByRef layer As String )
 Параметры
 Параметры
 Описание
 layer
 Имя удаляемого из фильтра слоя. Тип String.
 Описание
 Метод предназначен для удаления указанного слоя из данного объекта LayerFilter.
 Ссылки
 Teigha.DatabaseServices.Filters.LayerFilter, Teigha.DatabaseServices.Filters
 Ваши комментарии по поводу этого топика: Послать отзыв!