Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.SurfaceSurfaceIntersectorConfigurations.Surface1Left
 Послать отзыв
 Свойство Surface1Left представляет конфигурацию первой поверхности слева от кривой пересечения.
 Синтаксис
C#
Visual Basic
Копировать Код
public SurfaceSurfaceIntersectorConfiguration Surface1Left;
Копировать Код
Public ReadOnly Property Surface1Left As SurfaceSurfaceIntersectorConfiguration
 Возвращает
 Возвращает конфигурацию первой поверхности слева от кривой пересечения. Тип SurfaceSurfaceIntersectorConfiguration.
 Описание
 Свойство Surface1Left представляет конфигурацию первой поверхности слева от кривой пересечения.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.SurfaceSurfaceIntersectorConfigurations, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!