Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Scale3d.Scale3d
 Послать отзыв
 Конструктор структуры Scale3d. Создает экземпляр структуры, который представляет преобразование масштаба с указанными масштабными коэффициентами вдоль осей X, Y и Z.
 Синтаксис
C#
Visual Basic
Копировать Код
public Scale3d( double x, double y, double z );
Копировать Код
Public Sub New( x As Double, y As Double, z As Double )
 Параметры
 Параметры
 Описание
 x
 Масштабный коэффициент для оси X. Тип double.
 y
 Масштабный коэффициент для оси Y. Тип double.
 z
 Масштабный коэффициент для оси Z. Тип double.
 Описание
 Конструктор структуры Scale3d. Создает экземпляр структуры, который представляет преобразование масштаба с указанными масштабными коэффициентами вдоль осей X, Y и Z.
 Ссылки
 Teigha.Geometry.Scale3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!