Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SymbolUtilityServices.IsLinetypeByBlockName
 Послать отзыв
 Метод позволяет проверить, соответствует ли входная строка имени типа линии "ByBlock".
 Синтаксис
C#
Visual Basic
Копировать Код
public static bool IsLinetypeByBlockName( ref String name );
Копировать Код
Public Shared Function IsLinetypeByBlockName( ByRef name As String ) As Boolean
 Параметры
 Параметры
 Описание
 name
 Проверяемое имя. Тип String.
 Возвращает
 Возвращает true, если строка name соответствует имени типа линии "ByBlock". В противном случае возвращает false.
 Описание
 Метод позволяет проверить, соответствует ли входная строка имени типа линии "ByBlock".
 Ссылки
 Teigha.DatabaseServices.SymbolUtilityServices, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!