Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CompositeCurve2d.SetCurves
 Послать отзыв
 Метод позволяет переопределить массив подкривых, которые образуют данную составную кривую.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetCurves( ref Curve2d[] curves );
Копировать Код
Public Sub SetCurves( ByRef curves() As Curve2d )
 Параметры
 Параметры
 Описание
 curves
 Входной массив новых составляющих подкривых. Тип Curve2d[].
 Описание
 Метод позволяет переопределить массив подкривых, которые образуют данную составную кривую.
 Замечания
 Кривые из массива curves при удалении составной кривой не удаляются.
 Ссылки
 Teigha.Geometry.CompositeCurve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!