Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.Dimtoh
 Послать отзыв
 Свойство управляет расположением размерного текста за пределами выносных линий или измеряемого объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool Dimtoh;
Копировать Код
Public Property Dimtoh As Boolean
 Возвращает
 Возвращает true в случае выравнивания текста по горизонтали и false в случае выравнивания вдоль размерной линии или линии выноски.
 Описание
 Свойство управляет расположением размерного текста за пределами выносных линий или измеряемого объекта.
 Свойство принимает следующие значения:
 Значение
 Описание
 true
 Текст выравнивается по горизонтали.
 false
 Ориентация текста определяется ориентацией размерной линии или линии выноски.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!