Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeader.GetArrowSymbolId
 Послать отзыв
 Метод предоставляет идентификатор объекта символа стрелки для указанной линии выноски.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.ObjectId GetArrowSymbolId( int leaderLineIndex );
Копировать Код
Public Function GetArrowSymbolId( leaderLineIndex As Integer ) As DatabaseServices.ObjectId
 Параметры
 Параметры
 Описание
 leaderLineIndex
 Индекс линии выноски. Тип int.
 Возвращает
 Возвращает идентификатор объекта символа стрелки. Тип DatabaseServices.ObjectId.
 Описание
 Метод предоставляет идентификатор объекта символа стрелки для линии выноски с указанным индексом.
 Ссылки
 Teigha.DatabaseServices.MLeader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!