Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Matrix3d.ToArray
 Послать отзыв
 Метод формирует одномерный массив, содержащий все элементы данной матрицы.
 Синтаксис
C#
Visual Basic
Копировать Код
public double[] ToArray();
Копировать Код
Public Function ToArray() As Double()
 Возвращает
 Возвращает представление данной матрицы в виде одномерного массива. Тип double[].
 Описание
 Метод формирует одномерный массив, содержащий все 16 элементов данной матрицы. Запись элементов двумерной матрицы в одномерный массив выполняется построчно (4 элемента первой строки, 4 элемента второй строки и т.д.).
 Ссылки
 Teigha.Geometry.Matrix3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!