Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 DimStyleTableRecord.Dimtofl
 Послать отзыв
 Свойство отвечает за настройку отрисовки размерных линий между выносными, когда размерный текст находится за пределами выносных линий.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual bool Dimtofl { get; set; }
Копировать Код
Public Overridable Property Dimtofl As Boolean
 Возвращает
 Возвращает тип данных bool.
 Описание
 В свойстве хранится текущая настройка отрисовки размерных линий между выносными, когда размерный текст находится за пределами выносных линий. В качестве значения свойства доступны следующие:
false – не отображать размерную линию между выносными, когда размерный текст расположен за пределами выносных линий (по умолчанию);
true – отображать размерную линию между выносными, когда размерный текст расположен за пределами выносных линий.
 Свойство также доступно через системную переменную DIMTOFL и пользовательское меню в окне изменения/создания размерного стиля:
  При изменении системной переменной DIMTOFL будет создан новый размерный стиль под названием <переопределение> на основе текущего с новым значением DIMTOFL.
 Условия
 Чтение и запись.
 Пример
 Пример изменения настройки отрисовки размерных линий между выносными, когда размерный текст находится за пределами выносных линий (значения свойства Dimtofl) в размерном стиле Standard:
C#
 Копировать Код
public partial class Commands { [Teigha.Runtime.CommandMethod("DimtoflChange")] public void DimtoflStandardDimStyle() { // Получение ссылки на активный документ HostMgd.ApplicationServices.Document doc = HostMgd.ApplicationServices.Application.DocumentManager.MdiActiveDocument; // Получение ссылки на редактор документа HostMgd.EditorInput.Editor ed = doc.Editor; // Получение ссылки на базу данных документа Teigha.DatabaseServices.Database db = doc.Database; // Начало транзакции с базой данных документа using (Teigha.DatabaseServices.Transaction trans = db.TransactionManager.StartTransaction()) { // Открываем таблицу размерных стилей для чтения Teigha.DatabaseServices.DimStyleTable dimStyleTable = trans.GetObject(db.DimStyleTableId, Teigha.DatabaseServices.OpenMode.ForRead) as Teigha.DatabaseServices.DimStyleTable; // Находим в таблице размерных стилей ObjectId нужного стиля по его названию Teigha.DatabaseServices.ObjectId styleId = dimStyleTable["Standard"]; // Открываем таблицу размерного стиля для изменений Teigha.DatabaseServices.DimStyleTableRecord obj = trans.GetObject(styleId, Teigha.DatabaseServices.OpenMode.ForWrite) as Teigha.DatabaseServices.DimStyleTableRecord; ed.WriteMessage($"nDimtofl before: {obj.Dimtofl}"); // Изменяем настройку отрисовки размерных линий // когда текст находится за пределами выносных линий obj.Dimtofl = true; ed.WriteMessage($"nDimtofl after: {obj.Dimtofl}"); trans.Commit(); } } }
 Ссылки
 Teigha.DatabaseServices.DimStyleTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!