Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Ellipse.Set
 Послать отзыв
 Метод позволяет задать параметрам этого эллипса указанные значения.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Set( Point3d center, Vector3d unitNormal, Vector3d majorAxis, double radiusRatio, double startAngle, double endAngle );
Копировать Код
Public Sub [Set]( center As Point3d, unitNormal As Vector3d, majorAxis As Vector3d, radiusRatio As Double, startAngle As Double, endAngle As Double )
 Параметры
 Параметры
 Описание
 center
 Центр эллипса в мировой системе координат (WCS). Тип Point3d.
 unitNormal
 Единичный вектор нормали плоскости, в которой располагается эллипс. Задается в WCS. Тип Vector3d.
 majorAxis
 Направление большой оси эллипса в WCS. Тип Vector3d. По модулю составляет половину главной оси эллипса.
 radiusRatio
 Отношение малого радиуса эллипса к большому. Тип double. Для получения действительного эллипса этот параметр не должен быть меньше 1E-6 или больше 1.0.
 startAngle
 Начальный угол эллиптической дуги в радианах. Тип double.
 endAngle
 Конечный угол эллиптической дуги в радианах. Тип double.
 Описание
 Метод позволяет задать параметрам этого эллипса указанные значения.
 Условиями построения замкнутого эллипса являются (startAngle = 0), (endAngle = 2PI) и (endAngle - startAngle) > 1e-6. Отношение полуосей radiusRatio должно находиться в диапазоне [1e-6 to 1.0]. Направления majorAxis и unitNormal должны быть перпендикулярными в пределах допуска 1E-6.
 Ссылки
 Teigha.DatabaseServices.Ellipse, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!