Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Hatch.GradientOneColorMode
 Послать отзыв
 Синтаксис
C#
Visual Basic
public bool GradientOneColorMode;
Public Property GradientOneColorMode() As bool
 Описание
 Обеспечивает доступ к признаку, является ли градиент переходящим от исходного к конечному цвету (двухцветный), или от цвета к яркому варианту того же цвета (одноцветный). В последнем случае, вариант с полной яркостью является "окрашенным", а с нулевой яркостью — "затемненным".
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Hatch, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!