Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Database.IsObjectNonPersistent
 Послать отзыв
 Синтаксис
C#
Visual Basic
public bool IsObjectNonPersistent(ObjectId id);
Public Function IsObjectNonPersistent(id As ObjectId) As bool
 Параметры
 Параметры
 Описание
 id
 Id опрашиваемого объекта
 Описание
 Возвращает true, если объект обозначен как не постоянный.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!