Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CircularArc3d.StartAngle
 Послать отзыв
 Свойство StartAngle представляет угол начальной точки дуги.
 Синтаксис
C#
Visual Basic
Копировать Код
public double StartAngle;
Копировать Код
Public ReadOnly Property StartAngle As Double
 Возвращает
 Возвращает угол начальной точки дуги. Тип double.
 Описание
 Свойство StartAngle представляет угол начальной точки дуги.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.CircularArc3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!