Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Transaction.AddNewlyCreatedDBObject
 Послать отзыв
 Метод добавляет в транзакцию объект из вновь созданной записи в базе данных.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void AddNewlyCreatedDBObject( ref DBObject obj, bool add );
Копировать Код
Public virtual Sub AddNewlyCreatedDBObject( ByRef obj As DBObject, add As Boolean )
 Параметры
 Параметры
 Описание
 obj
 Добавляемый или удаляемый объект. Тип DBObject.
 add
 Флаг, указывающий, следует ли добавлять (значение true) или же удалять (значение false) объект.
 Описание
 Метод добавляет в транзакцию объект из вновь созданной записи в базе данных.
 Объект должен быть резидентным в базе данных (другими словами, он уже добавлен в базу данных и получил идентификатор ObjectId). Операции добавления и удаления объектов выполняются в верхней транзакции.
 Замечания
 Аргумент obj должен соответствовать вновь созданному объекту, который еще ни разу не был закрыт.
 Ссылки
 Teigha.DatabaseServices.Transaction, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!