Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Matrix3d.ElementAt
 Послать отзыв
 Свойство предоставляет доступ к элементу матрицы с указанными индексами строки и столбца.
 Синтаксис
C#
Visual Basic
Копировать Код
public double this[int i, int j]
Копировать Код
Default Public ReadOnly Property ElementAt( i As Integer, j As Integer ) As Double
 Параметры
 Параметры
 Описание
 i
 Номер строки матрицы, тип int.
 j
 Номер столбца матрицы, тип int.
 Возвращает
 Возвращает значение элемента матрицы с указанными индексами строки и столбца. Тип double.
 Описание
 Свойство предоставляет доступ к элементу матрицы с указанными индексами строки и столбца.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.Matrix3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!