Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.TableContent.GetRowHeight
 Послать отзыв
 Метод позволяет получить высоту строки с указанным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual double GetRowHeight( int row );
Копировать Код
Public Overridable Function GetRowHeight( row As Integer ) As Double
 Параметры
 Параметры
 Описание
 row
 Индекс строки таблицы. Тип int.
 Возвращает
 Возвращает высоту строки. Тип double.
 Описание
 Метод позволяет получить высоту строки с указанным индексом.
 Ссылки
 Teigha.DatabaseServices.TableContent, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!