Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Body.IsNull
 Послать отзыв
 Свойство позволяет установить, имеется ли в данном теле объект ShapeManager.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsNull;
Копировать Код
Public Property IsNull() As Boolean
 Возвращает
 Возвращает true, если в данном теле нет объекта ShapeManager.
 Описание
 Свойство позволяет установить, имеется ли в данном теле объект ShapeManager.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Body, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!