Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.Dimaltd
 Послать отзыв
 Свойство позволяет задать или получить количество десятичных знаков после запятой в значениях размеров, выраженных в альтернативных единицах измерения.
 Синтаксис
C#
Visual Basic
Копировать Код
public int Dimaltd;
Копировать Код
Public Property Dimaltd As Integer
 Возвращает
 Возвращает количество десятичных знаков после запятой в значениях размеров. Тип int.
 Описание
 Свойство позволяет задать или получить количество десятичных знаков после запятой в значениях размеров, выраженных в альтернативных единицах измерения. Это свойство действует только в том случае, если для свойства Dimalt установлено значение true.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!