Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Matrix3d.PostMultiplyBy
 Послать отзыв
 Метод выполняет матричное умножение данной матрицы на заданную матрицу.
 Синтаксис
C#
Visual Basic
Копировать Код
public Matrix3d PostMultiplyBy( Matrix3d rightSide );
Копировать Код
Public Function PostMultiplyBy( rightSide As Matrix3d ) As Matrix3d
 Параметры
 Параметры
 Описание
 rightSide
 Матрица, которая выступает в матричном произведении правым сомножителем. Тип Matrix3d.
 Возвращает
 Возвращает результирующую матрицу. Тип Matrix3d.
 Описание
 Метод выполняет матричное умножение данной матрицы на заданную матрицу rightSide и возвращает результирующую матрицу.
 Ссылки
 Teigha.Geometry.Matrix3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!