Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство DBText.AlignmentPoint
 Послать отзыв
 Синтаксис
C#
Visual Basic
public Point3d AlignmentPoint;
Public Property AlignmentPoint() As Point3d
 Описание
 Обеспечивает доступ к точке выравнивания текста.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.DBText, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!