Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.ResetValue
 Послать отзыв
 Сбрасывает значение в заданной ячейке.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void ResetValue( int row, int col );
Копировать Код
Public virtual Sub ResetValue( row As Integer, col As Integer )
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 col
 Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
 Описание
 Сбрасывает значение в заданной ячейке.
 Замечания
 Для получения того же результата предпочтительнее использовать Table.Cells[row,column].Contents(i).ResetValue
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!