Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CoordinateSystem2d.ToString
 Послать отзыв
 Метод позволяет получить эквивалентное строковое представление данного объекта с учетом региональных и языковых настроек.
 Синтаксис
C#
Visual Basic
Копировать Код
public String ToString( ref IFormatProvider provider );
Копировать Код
Public Function ToString( ByRef provider As IFormatProvider ) As String
 Параметры
 Параметры
 Описание
 provider
 Заданный провайдер региональных и языковых настроек. Тип IFormatProvider.
 Возвращает
 Возвращает строковое представление данного объекта. Тип String.
 Описание
 Метод позволяет получить эквивалентное строковое представление данного объекта с учетом региональных и языковых настроек. Возвращаемая строка включает начало этой системы координат и направления её осей X и Y.
 Ссылки
 Teigha.Geometry.CoordinateSystem2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!