Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FileDependencyInfo.FileName
 Послать отзыв
 Свойство FileName представляет собственное имя файла.
 Синтаксис
C#
Visual Basic
Копировать Код
public String FileName;
Копировать Код
Public ReadOnly Property FileName As String
 Возвращает
 Возвращает собственное имя файла. Тип String.
 Описание
 Свойство FileName представляет собственное имя файла.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.FileDependencyInfo, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!