Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.SetGridLineWeight
 Послать отзыв
 Метод позволяет задать толщину линии сетки с указанной стороны ячейки.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetGridLineWeight( int row, int col, short edges, DatabaseServices::LineWeight value );
Копировать Код
Public virtual Sub SetGridLineWeight( row As Integer, col As Integer, edges As short, value As DatabaseServices.LineWeight )
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 col
 Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
 edges
 Индекс стороны ячейки, тип short. См.перечисление CellEdgeMasks.
 lineWeight
 Толщина линии из перечисления DatabaseServices.LineWeight.
 Описание
 Метод позволяет задать толщину линии сетки с указанной стороны ячейки.
 Замечания
 Для получения того же результата предпочтительнее использовать Table.Cells[row,column].{Top,Bottom,Left,Right}Edge.LineWeight.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!