Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MText.BlockBegin
 Послать отзыв
 Свойство представляет строку начала блока "{".
 Синтаксис
C#
Visual Basic
Копировать Код
public static String BlockBegin;
Копировать Код
Public Shared ReadOnly Property BlockBegin As String
 Возвращает
 Возвращает строку начала блока. Тип String.
 Описание
 Свойство представляет строку начала блока "{". Может использоваться вместо строковой константы "{", чтобы сделать код более понятным. При использовании в строке, возвращаемой из MText.Contents, "{" указывает на начало блока.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.MText, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!