Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AlignedDimension.Oblique
 Послать отзыв
 Свойство предоставляет доступ на изменение к углу наклона этого размера (в радианах).
 Синтаксис
C#
Visual Basic
Копировать Код
public double Oblique;
Копировать Код
Public Property Oblique() As Double
 Возвращает
 Возвращает угол наклона данного размера в радианах.
 Описание
 Свойство предоставляет доступ на изменение к углу наклона данного размера (в радианах).
 Этот угол относится к линии, проходящей через начальные точки обеих выносных линий (xLine1Point и xLine2Point). Положительным направлением отсчета углов является направление против часовой стрелки, если смотреть вдоль оси Z системы координат размера (OCS) в сторону начала координат.
 Линия, соединяющая обе начальных точки выносных линий, делит плоскость, которой принадлежит размер, на две полуплоскости. Выносные линии размера могут находиться только в той полуплоскости, в которой содержится точка определения размерной линии (см. свойство dimLinePoint).
 Таким образом, угол наклона является периодическим с периодом от 0 до pi. Углы наклона, превышающие число pi, приводятся к эквивалентным углам в первом периоде. Отрицательные углы являются периодическими в пределах от 0 до -pi и дают тот же наклон, что и положительные углы, которые получаются при добавлении числа pi к отрицательному значению в первом периоде (например, -pi/4 дает 3*(pi/4).
 Нулевой угол представляет собой особый случай, который интерпретируется как «использовать значение по умолчанию» и соответствует углу наклона pi/2 (90 градусов).
 Замечания
 Угол наклона соответствует группе DXF с кодом 52.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.AlignedDimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!