Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve2d.StartPoint
 Послать отзыв
 Свойство StartPoint представляет начальную точку данной кривой.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point2d StartPoint;
Копировать Код
Public ReadOnly Property StartPoint As Point2d
 Возвращает
 Возвращает начальную точку кривой. Тип Point2d.
 Описание
 Свойство StartPoint представляет начальную точку данной кривой.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.Curve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!