Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.TypedValue.TypeCode
 Послать отзыв
 Свойство предназначено для хранения кода типа объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public short TypeCode;
Копировать Код
Public Property TypeCode() As short
 Возвращает
 Возвращает код типа объекта. Тип short.
 Описание
 Свойство предназначено для хранения кода типа объекта.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.TypedValue, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!