Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.LineSegment2d.StartPoint
 Послать отзыв
 Свойство StartPoint представляет начальную точку данного линейного сегмента.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point2d StartPoint;
Копировать Код
Public ReadOnly Property StartPoint As Point2d
 Возвращает
 Возвращает начальную точку линейного сегмента. Тип Point2d.
 Описание
 Свойство StartPoint представляет начальную точку данного линейного сегмента.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.LineSegment2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!