Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CellContent.SetValue
 Послать отзыв
 Метод позволяет переопределить значение содержимого ячейки.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetValue( ref Object value, ParseOption parseOption );
Копировать Код
Public Sub SetValue( ByRef value As Object, parseOption As ParseOption )
 Параметры
 Параметры
 Описание
 value
 Новое значение содержимого ячейки. Тип Object.
 parseOption
 Опции парсинга значения. Перечисление ParseOption.
 Описание
 Метод позволяет переопределить значение содержимого ячейки.
 Ссылки
 Teigha.DatabaseServices.CellContent, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!