Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CubicSplineCurve3d.CubicSplineCurve3d
 Послать отзыв
 Конструктор класса CubicSplineCurve3d. Создает интерполяционный кубический сплайн, с заданной точностью проходящий через указанные определяющие точки.
 Синтаксис
C#
Visual Basic
Копировать Код
public CubicSplineCurve3d( ref Point3dCollection points, Tolerance tolerance );
Копировать Код
Public Sub New( ByRef points As Point3dCollection, tolerance As Tolerance )
 Параметры
 Параметры
 Описание
 points
 Входной массив определяющих точек сплайна. Тип Point3dCollection.
 tolerance
 Заданная точность интерполяции. Тип Tolerance.
 Описание
 Конструктор класса CubicSplineCurve3d. Создает интерполяционный кубический сплайн, с заданной точностью проходящий через указанные определяющие точки.
 Ссылки
 Teigha.Geometry.CubicSplineCurve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!