Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Viewport.PlotWireframe
 Послать отзыв
 Свойство PlotWireframe позволяет определить, отображается ли векторная графика в данном видовом экране с использованием текущих настроек отображения теней при выводе на печать.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool PlotWireframe;
Копировать Код
Public ReadOnly Property PlotWireframe As Boolean
 Возвращает
 Возвращает true, если используются текущие настройки тонирования. В противном случае возвращает false.
 Описание
 Свойство PlotWireframe позволяет определить, отображается ли векторная графика в данном видовом экране с использованием текущих настроек отображения теней при выводе на печать.
 Это свойство будет иметь значение true, если включены все следующие настройки:
Режим рендеринга — Wireframe или Optimized2D.
Тип визуального стиля — Wireframe2D или Wireframe3D.
Визуальный стиль использует для граней модель освещения FaceStyle.LightingModel = LightingModel.Invisible, а для рёбер - модель EdgeStyle.EdgeModel = EdgeModel.Isolines.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Viewport, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!