Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Extents3d
 Послать отзыв
 Класс Extents3d представляет трехмерный ограничивающий прямоугольный параллелепипед (бокс) минимального размера, в который вписан тот или иной геометрический объект.
 Иерархия классов
Teigha::DatabaseServices::Extents3d
 Синтаксис
C#
Visual Basic
Копировать Код
[StructLayout(LayoutKind.Sequential),Wrapper("OdGeExtents3d")] public class Extents3d;
Копировать Код
<StructLayout(LayoutKind.Sequential),Wrapper("OdGeExtents3d")> Public Class Extents3d
 Описание
 Класс Extents3d представляет трехмерный ограничивающий прямоугольный параллелепипед (бокс) минимального размера, в который вписан тот или иной геометрический объект. Такой прямоугольный параллелепипед ориентирован по осям системы координат. Бокс определяется двумя вершинами главной диагонали прямоугольного параллелепипеда - его минимальной (MinPoint) и максимальной (MaxPoint) точками
 Методы
 Конструкторы
 Имя
 Описание
 Extents3d
 Конструктор класса Extents3d. Создает ограничивающий бокс по двум точкам Point3d.
 Топики
 Имя
 Описание
 Extents3d Методы
 Ниже перечислены методы класса Extents3d.
 Extents3d Операторы
 Ниже перечислены операторы класса Extents3d.
 Extents3d Свойства
 Ниже перечислены свойства класса Extents3d.
 Ссылки
 Extents3d Методы, Extents3d Операторы, Extents3d Свойства, Методы, Топики, Extents3d Методы, Extents3d Операторы, Extents3d Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!