Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SubentityId.IndexPtr
 Послать отзыв
 Свойство IndexPtr представляет индекс подобъекта в виде указателя IntPtr.
 Синтаксис
C#
Visual Basic
Копировать Код
public IntPtr IndexPtr;
Копировать Код
Public ReadOnly Property IndexPtr As IntPtr
 Возвращает
 Возвращает индекс подобъекта. Тип IntPtr.
 Описание
 Свойство IndexPtr представляет индекс подобъекта в виде указателя IntPtr.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.SubentityId, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!