Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.Dimupt
 Послать отзыв
 Свойство управляет режимом перемещения текста, позиционирование которого определено пользователем, при перемещении размерной линии.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool Dimupt;
Копировать Код
Public Property Dimupt As Boolean
 Возвращает
 Возвращает true, если перемещается размерная линия и текст, и false, если перемещается только размерная линия.
 Описание
 Свойство управляет режимом перемещения текста, позиционирование которого определено пользователем, при перемещении размерной линии.
 Значение
 Описание
 false
 Перемещается только размерная линия.
 true
 Перемещается и размерная линия, и текст.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!