Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.RadialDimensionLarge.Center
 Послать отзыв
 Свойство Center представляет центр измеряемой окружности или дуги.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d Center;
Копировать Код
Public Property Center As Point3d
 Возвращает
 Возвращает точку центра окружности или дуги. Тип Point3d.
 Описание
 Свойство Center представляет центр измеряемой окружности или дуги. Координаты центра приводятся в мировой системе координат (WCS).
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.RadialDimensionLarge, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!