Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DbDictionaryEnumerator
 Послать отзыв
 Класс DbDictionaryEnumerator представляет перечислитель для коллекции объектов DBDictionaryEntry.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::DatabaseServices::DbDictionaryEnumerator
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdDbDictionaryIterator")] public class DbDictionaryEnumerator : Runtime::RXObject, IDictionaryEnumerator;
Копировать Код
<Wrapper("OdDbDictionaryIterator")> Public Class DbDictionaryEnumerator Inherits Runtime.RXObject Inherits IDictionaryEnumerator
 Описание
 Класс DbDictionaryEnumerator представляет перечислитель для коллекции объектов DBDictionaryEntry.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.DatabaseServices.DbDictionaryEnumerator
 Имя
 Описание
 DbDictionaryEnumerator Методы
 Ниже перечислены методы класса DbDictionaryEnumerator.
 DbDictionaryEnumerator Свойства
 Ниже перечислены свойства класса DbDictionaryEnumerator.
 Ссылки
 DbDictionaryEnumerator Методы, DbDictionaryEnumerator Свойства, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!