Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.XrefRedirectedEventArgs.OldId
 Послать отзыв
 Свойство OldId представляет идентификатор объекта записи таблицы символов внешней ссылки, к которой в данный момент применяется перенаправление.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectId OldId;
Копировать Код
Public ReadOnly Property OldId As ObjectId
 Возвращает
 Возвращает идентификатор объекта записи таблицы символов. Тип ObjectId.
 Описание
 Свойство OldId представляет идентификатор объекта записи таблицы символов внешней ссылки, к которой в данный момент применяется перенаправление.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.XrefRedirectedEventArgs, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!