Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObject.HasContext(ObjectContext)
 Послать отзыв
 Метод предназначен для проверки, существует ли указанный контекст в коллекции.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool HasContext(ObjectContext context);
Копировать Код
Public Function HasContext(context As ObjectContext) As bool
 Параметры
 Параметры
 Описание
 context
 Контекст для поиска. Тип ObjectContext
 Возвращает
 Возвращает тип данных bool. true если этот объект имеет указанный контекст, false в противном случае.
 Описание
 Метод определяет, есть ли указанный контекст в коллекции.
 Ссылки
 Teigha.DatabaseServices.DBObject, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!