Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 BlockTableRecord.IsAnonymous
 Послать отзыв
 Свойство предназначено для определения, является ли данное определение блока анонимным.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsAnonymous { get; }
Копировать Код
Public ReadOnly Property IsAnonymous As Boolean
 Возвращает
 Возвращает тип данных bool:
true - блок является анонимным.
false - не анонимный.
 Описание
 Свойство показывает, является ли данное определение блока анонимным, то есть блоком без "действительного" имени. Анонимные блоки создаются автоматически для поддержки динамических блоков, таблиц, образцов штриховки и ассоциативных размеров.
 Иногда анонимный блок является вложенным блоком, который отображается либо в редакторе блоков, либо путем расчленения блока.
 Значение свойства используется для первого бита в коде группы DXF 70.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.BlockTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!