Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MText.BackgroundFill
 Послать отзыв
 Свойство позволяет включить или отключить фоновую заливку для данного объекта MText.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool BackgroundFill;
Копировать Код
Public Property BackgroundFill As Boolean
 Возвращает
 Возвращает true, если фоновая заливка включена. В противном случае возвращает false.
 Описание
 Свойство позволяет включить или отключить фоновую заливку для данного объекта MText.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MText, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!