Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MText.ActualHeight
 Послать отзыв
 Свойство возвращает фактическую высоту данного объекта MText (зависит от содержимого).
 Синтаксис
C#
Visual Basic
Копировать Код
public double ActualHeight;
Копировать Код
Public ReadOnly Property ActualHeight As Double
 Возвращает
 Возвращает фактическую высоту многострочного текста. Тип double.
 Описание
 Свойство возвращает фактическую высоту данного объекта MText (зависит от содержимого).
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.MText, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!