Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Intersect
 Послать отзыв
 Перечисление Intersect определяет действия, выполняемые с граничными рамками геометрических объектов при вычислении пересечений между этими объектами.
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdDb.Intersect")] public enum Intersect { OnBothOperands = 0, ExtendThis = 1, ExtendArgument = 2, ExtendBoth = 3 }
Копировать Код
<Wrapper("OdDb.Intersect")> Public Enum Intersect OnBothOperands = 0 ExtendThis = 1 ExtendArgument = 2 ExtendBoth = 3 End Enum
 Члены
 Члены
 Описание
 OnBothOperands
 Значение: 0. Не продлевать ребра граничной рамки для обоих пересекающихся объектов. Пересечение вычисляется только в местах фактического пересечения граничных рамок.
 ExtendThis
 Значение: 1. При вычислении пересечения продлеваются ребра граничной рамки данного объекта, если это необходимо. Граничная рамка второго объекта (передается как аргумент) остаётся без изменений.
 ExtendArgument
 Значение: 2. При вычислении пересечения, если это необходимо, продлеваются ребра граничной рамки второго объекта (передается как аргумент). Граничная рамка данного объекта остаётся без изменений.
 ExtendBoth
 Значение: 3. При вычислении пересечения, если это необходимо, продлеваются ребра граничных рамок обоих объектов.
 Описание
 Перечисление Intersect определяет действия, выполняемые с граничными рамками геометрических объектов при вычислении пересечений между этими объектами.
 Ваши комментарии по поводу этого топика: Послать отзыв!