Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LinkedTableData.SetFieldId
 Послать отзыв
 Метод позволяет задать идентификатор поля в первом элементе содержимого указанной ячейки таблицы.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetFieldId( int row, int column, DatabaseServices.ObjectId value );
Копировать Код
Public Overridable Sub SetFieldId( row As Integer, column As Integer, value As DatabaseServices.ObjectId )
 Параметры
 Параметры
 Описание
 row
 Индекс строки. Тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 column
 Индекс столбца. Тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице.
 value
 Идентификатор объекта поля. Тип DatabaseServices.ObjectId.
 Описание
 Метод позволяет задать идентификатор поля в первом элементе содержимого указанной ячейки таблицы.
 Замечания
 Метод выбрасывает исключение eInvalidInput, если индексы строки и/или столбца выходят за допустимые пределы. Если содержимое ячейки недоступно для редактирования, метод выбрасывает исключение eIsWriteProtected.
 Ссылки
 Teigha.DatabaseServices.LinkedTableData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!