Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CellRange.Parent
 Послать отзыв
 Свойство обеспечивает доступ к родительскому объекту данного диапазона ячеек.
 Синтаксис
C#
Visual Basic
Копировать Код
public Object Parent;
Копировать Код
Public Property Parent As Object
 Возвращает
 Возвращает родительский объект диапазона. Тип Object.
 Описание
 Свойство обеспечивает доступ к родительскому объекту данного диапазона ячеек.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.CellRange, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!