Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SweptSurface.SweepOptions
 Послать отзыв
 Свойство SweepOptions представляет комплекс настроек операции вытягивания по траектории.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.SweepOptions SweepOptions;
Копировать Код
Public Property SweepOptions As DatabaseServices.SweepOptions
 Возвращает
 Возвращает настройки операции вытягивания по траектории. Тип DatabaseServices.SweepOptions.
 Описание
 Свойство SweepOptions представляет комплекс настроек операции вытягивания по траектории.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.SweptSurface, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!