Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ObjectContextManager.GetContextCollection
 Послать отзыв
 Метод предоставляет коллекцию контекстов, зарегистрированную в данном менеджере контекстов под указанным именем.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectContextCollection GetContextCollection( ref String collectionName );
Копировать Код
Public Function GetContextCollection( ByRef collectionName As String ) As ObjectContextCollection
 Параметры
 Параметры
 Описание
 collectionName
 Имя контекста. Тип String.
 Возвращает
 Возвращает зарегистрированную коллекцию контекстов. Тип ObjectContextCollection. В случае отсутствия такой коллекции, возвращает нулевой указатель.
 Описание
 Метод предоставляет коллекцию контекстов, зарегистрированную в данном менеджере контекстов под указанным именем.
 Ссылки
 Teigha.DatabaseServices.ObjectContextManager, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!