Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CellRange.GetHashCode
 Послать отзыв
 Метод предоставляет хеш-код для данного диапазона ячеек.
 Синтаксис
C#
Visual Basic
Копировать Код
public override int GetHashCode();
Копировать Код
Public Overrides Function GetHashCode() As Integer
 Возвращает
 Возвращает уникальный для каждого экземпляра класса целочисленный идентификатор. Тип int.
 Описание
 Метод предоставляет хеш-код для данного диапазона ячеек.
 Замечания
 Переопределение методов Equals и GetHashCode должно выполняться совместно, чтобы не нарушать логику - если Equals возвращает true, хеш-коды сравниваемых объектов должны совпадать. Обратное не гарантируется - совпадение хеш-кодов не всегда означает совпадение объектов вследствие возможных коллизий. Хеш-коды следует формировать для полей, на которых основано равенство. Иногда используется метод Equals() из объекта C++, но поскольку сравниваются указатели, вы по-прежнему можете использовать этот GetHashCode(), в то время как метод Equals() может быть переопределен в производном классе.
 Ссылки
 Teigha.DatabaseServices.CellRange, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!