Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.SolidHist
 Послать отзыв
 Синтаксис
C#
Visual Basic
public int SolidHist;
Public Property SolidHist() As Integer
 Описание
 Обеспечивает доступ к текущему значению SOLIDHIST для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!