Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBDictionary
 Послать отзыв
 DBDictionary — это объектный словарь, хранящийся в базе данных и поддерживающий соответствие (мэппинг) текстовых строк и объектов базы данных.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::GraphicsInterface::Drawable Teigha::DatabaseServices::DBObject Teigha::DatabaseServices::DBDictionary
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("AcDbDictionary"),DefaultMember("Item")] public class DBDictionary : DBObject, System.Collections.IDictionary;
Копировать Код
<Wrapper("AcDbDictionary"),DefaultMember("Item")> Public Class DBDictionary Inherits DBObject Inherits System.Collections.IDictionary
 Описание
 DBDictionary — это объектный словарь, хранящийся в базе данных и поддерживающий соответствие (мэппинг) текстовых строк и объектов базы данных.
 Экземпляр этого класса представляет единственный объект, например, таблицу Drawing Symbol Table, в которой можно считывать, добавлять или удалять объекты-наследники класса DBObject. Записи в DBDictionary должны быть уникальными. Каждая запись состоит из уникального объекта DBObject и строки с именем ключа записи. Ключ может быть либо обычной нуль-терминированной строкой, либо строкой со звездочкой ('*') в первом символе для обозначения анонимной записи. Ключ анонимной записи формируется из звездочки в первой позиции строки, за которой далее идут символ 'A' и уникальное целочисленное значение; например, '*A13'.
 В случае добавления в словарь объекта этот словарь становится владельцем объекта, строка ключа ставится в соответствие идентификатору ObjectID объекта, а сам словарь связывается с объектом как постоянный (persistent) реактор, так что в случае удаления объекта словарь получит соответствующее уведомление.
 Замечания
 Имена в словаре должны соответствовать ряду общих правил:
Имена могут быть произвольной длины.
Имена могут содержать дополнительные символы, такие как пробел, апостроф (') и т.п.
Имена обрабатываются без учета регистра символов.
Не допускается использование в именах следующих символов:
вертикальная черта ('|'),
звездочка ('*'), за исключением случаев, указанных выше,
обратная косая черта (''),
двоеточие (':'),
точка с запятой (';'),
угловые скобки ('>', '<'),
вопросительный знак ('?'),
двойная кавычка ('"'),
запятая (','),
знак равенства ('='),
гравис ('`').
 Не рекомендуется жестко привязываться к какой-либо конкретной длине имен записей словаря, если он создан не вами или у кого-то ещё есть возможность изменять имена записей. При извлечении имён ключей из "чужого" словаря, который может быть обновлен nanoCAD или другими приложениями, следует предусмотреть поддержку имен произвольной длины.
 Указатели объектов, извлекаемые из базы данных, представляют собой отдельные объекты, которые в данный момент открыты в указанном режиме доступа. Статус возврата отражает состояние открываемой записи. Если объект с заданным идентификатором по какой-либо причине не найден в базе данных, возвращается нулевой указатель (NULL).
 При удалении словаря стираются все содержащиеся в нём записи. В случае отмены удаления словаря восстанавливается и всё его содержимое.
 Методы
 Конструкторы
 Teigha.GraphicsInterface.Drawable
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 Drawable
 Конструктор класса Teigha.GraphicsInterface.Drawable. (Унаследован от Drawable)
 Teigha.DatabaseServices.DBObject
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 DBObject
 Конструктор. (Унаследован от DBObject)
 Teigha.DatabaseServices.DBDictionary
 Имя
 Описание
 DBDictionary
 Конструктор по умолчанию.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.GraphicsInterface.Drawable
 Имя
 Описание
 Drawable Методы
 Ниже перечислены методы класса Drawable.
 Drawable Свойства
 Ниже перечислены свойства класса Drawable.
 Teigha.DatabaseServices.DBObject
 Имя
 Описание
 DBObject Методы
 Ниже перечислены методы класса DBObject.
 DBObject Свойства
 Ниже перечислены свойства класса DBObject.
 DBObject События
 Ниже перечислены события класса DBObject.
 Teigha.DatabaseServices.DBDictionary
 Имя
 Описание
 DBDictionary Методы
 Ниже перечислены методы класса DBDictionary.
 DBDictionary Свойства
 Ниже перечислены свойства класса DBDictionary.
 Ссылки
 DBDictionary Методы, DBDictionary Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства, DBObject События
 Ваши комментарии по поводу этого топика: Послать отзыв!