Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.TransactionManager.GetObject
 Послать отзыв
 Этот метод вызывает метод GetObject() верхней транзакции с передачей ему всех полученных аргументов. С помощью логического аргумента openErased можно получить доступ к удаленному объекту.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual DBObject GetObject( ObjectId id, OpenMode mode, bool openErased );
Копировать Код
Public virtual Function GetObject( id As ObjectId, mode As OpenMode, openErased As Boolean ) As DBObject
 Параметры
 Параметры
 Описание
 id
 Идентификатор ObjectId получаемого объекта.
 mode
 Режим доступа к объекту из перечисления OpenMode.
 openErased
 Если передать значение true, можно получить удаленный объект. Если задать false, то попытка получить удаленный объект вернет ошибку.
 Возвращает
 Возвращает объект DBObject.
 Описание
 Этот метод вызывает метод GetObject() верхней транзакции с передачей ему всех полученных аргументов.
 Объекты могут быть получены только в верхней транзакции, поэтому этот метод избавляет от необходимости как-то сохранять указатель на верхнюю транзакцию или использовать свойство TransactionManager.TopTransaction для его получения.
 Если логический аргумент openErased == true, то возможно получить даже удаленный объект. Если openErased == false, то попытка получить удаленный объект вернет ошибку.
 Ссылки
 Teigha.DatabaseServices.TransactionManager, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!