Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ObjectId.ConvertToRedirectedId
 Послать отзыв
 Метод преобразует ObjectId данного объекта, если он был перенаправлен из другой базы данных, в действительный идентификатор объекта в другой базе данных.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectId ConvertToRedirectedId();
Копировать Код
Public Function ConvertToRedirectedId() As ObjectId
 Возвращает
 Возвращает ObjectId.
 Описание
 Метод принимает ObjectId данного объекта, если он был перенаправлен из другой базы данных, и преобразует его в действительный идентификатор объекта в другой базе данных (например: идентификатор объекта е базе данных внешних ссылок). Если этот ID объекта не перенаправлен или имеет значение Null, функция не делает ничего.
 Ссылки
 Teigha.DatabaseServices.ObjectId, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!