Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Ray.SecondPoint
 Послать отзыв
 Свойство SecondPoint представляет вторую точку, которая в совокупности с базовой точкой определяет направление данного луча.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d SecondPoint;
Копировать Код
Public Property SecondPoint As Point3d
 Возвращает
 Возвращает трехмерную точку. Тип Point3d.
 Описание
 Свойство SecondPoint представляет вторую точку, которая в совокупности с базовой точкой определяет направление данного луча.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Ray, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!