Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 DimStyleTableRecord.Dimupt
 Послать отзыв
 Свойство отвечает за настройку перемещения размерного текста при перемещении размерных линий.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual bool Dimupt { get; set; }
Копировать Код
Public Overridable Property Dimupt As Boolean
 Возвращает
 Возвращает тип данных bool.
 Описание
 В свойстве хранится текущая настройка перемещения размерного текста при перемещении размерных линий. В качестве значения свойства доступны следующие:
false – только размерная линия (по умолчанию);
true – размерная линия и текст.
 Свойство также доступно через системную переменную DIMUPT и пользовательское меню в окне изменения/создания размерного стиля:
  При изменении системной переменной DIMUPT будет создан новый размерный стиль под названием <переопределение> на основе текущего с новым значением DIMUPT.
 Условия
 Чтение и запись.
 Пример
 Пример изменения настройки перемещения размерного текста при перемещении размерных линий (значения свойства Dimupt) в размерном стиле Standard:
C#
 Копировать Код
public partial class Commands { [Teigha.Runtime.CommandMethod("DimuptChange")] public void DimuptStandardDimStyle() { // Получение ссылки на активный документ HostMgd.ApplicationServices.Document doc = HostMgd.ApplicationServices.Application.DocumentManager.MdiActiveDocument; // Получение ссылки на редактор документа HostMgd.EditorInput.Editor ed = doc.Editor; // Получение ссылки на базу данных документа Teigha.DatabaseServices.Database db = doc.Database; // Начало транзакции с базой данных документа using (Teigha.DatabaseServices.Transaction trans = db.TransactionManager.StartTransaction()) { // Открываем таблицу размерных стилей для чтения Teigha.DatabaseServices.DimStyleTable dimStyleTable = trans.GetObject(db.DimStyleTableId, Teigha.DatabaseServices.OpenMode.ForRead) as Teigha.DatabaseServices.DimStyleTable; // Находим в таблице размерных стилей ObjectId нужного стиля по его названию Teigha.DatabaseServices.ObjectId styleId = dimStyleTable["Standard"]; // Открываем таблицу размерного стиля для изменений Teigha.DatabaseServices.DimStyleTableRecord obj = trans.GetObject(styleId, Teigha.DatabaseServices.OpenMode.ForWrite) as Teigha.DatabaseServices.DimStyleTableRecord; ed.WriteMessage($"nDimupt before: {obj.Dimupt}"); // Изменяем настройку перемещения размерного текста при перемещении // размерных линий obj.Dimupt = true; ed.WriteMessage($"nDimupt after: {obj.Dimupt}"); trans.Commit(); } } }
 Ссылки
 Teigha.DatabaseServices.DimStyleTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!