Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FieldEngine.EvaluatorLoaderCount
 Послать отзыв
 Свойство EvaluatorLoaderCount возвращает количество зарегистрированных загрузчиков вычислителей полей.
 Синтаксис
C#
Visual Basic
Копировать Код
public int EvaluatorLoaderCount;
Копировать Код
Public ReadOnly Property EvaluatorLoaderCount As Integer
 Возвращает
 Возвращает количество зарегистрированных загрузчиков вычислителей. Тип int.
 Описание
 Свойство EvaluatorLoaderCount возвращает количество зарегистрированных загрузчиков вычислителей полей.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.FieldEngine, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!