Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Делегат Teigha.DatabaseServices.DatabaseIOEventHandler
 Послать отзыв
 This is type Teigha::DatabaseServices::DatabaseIOEventHandler.
 Синтаксис
C#
Visual Basic
public delegate DatabaseIOEventHandler();
Public Delegate Sub DatabaseIOEventHandler()
 Ваши комментарии по поводу этого топика: Послать отзыв!