Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LayerViewportProperties.IsLinetypeOverridden
 Послать отзыв
 Свойство позволяет проверить, переопределен ли тип линий для связанного слоя и видового экрана.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsLinetypeOverridden;
Копировать Код
Public Property IsLinetypeOverridden As Boolean
 Возвращает
 Возвращает true, если тип линий переопределен. В противном случае возвращает false.
 Описание
 Свойство позволяет проверить, переопределен ли тип линий для связанного слоя и видового экрана.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.LayerViewportProperties, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!