Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LayerStateManager.LayerStateCreated
 Послать отзыв
 Событие успешного завершения процедуры создания состояния слоя.
 Синтаксис
C#
Visual Basic
Копировать Код
public event LayerStateEventHandler LayerStateCreated;
Копировать Код
Public Event LayerStateCreated As LayerStateEventHandler
 Описание
 Событие успешного завершения процедуры создания состояния слоя.
 Ссылки
 Teigha.DatabaseServices.LayerStateManager, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!