Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Pelevation
 Послать отзыв
 Синтаксис
C#
Visual Basic
public double Pelevation;
Public Property Pelevation() As Double
 Описание
 Возвращает или устанавливает текущее значение ELEVATION для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!