Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.TableStyle.SetBackgroundColor
 Послать отзыв
 Метод позволяет задать цвет фона в ячейках строк указанного типа.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetBackgroundColor( ref Teigha.Colors.Color color, int rowTypes );
Копировать Код
Public Overridable Sub SetBackgroundColor( ByRef color As Teigha.Colors.Color, rowTypes As Integer )
 Параметры
 Параметры
 Описание
 color
 Цвет фона. Тип Teigha.Colors.Color.
 rowTypes
 Один или комбинация нескольких типов строк таблицы, для которых задается выравнивание. Тип int. См. перечисление RowType.
 Описание
 Метод позволяет задать цвет фона в ячейках строк указанного типа.
 Ссылки
 Teigha.DatabaseServices.TableStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!