Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Filters.LayerIndex.Compute
 Послать отзыв
 Метод предназначен для вычисления данного фильтра, используя указанные таблицу слоев и запись таблицы блоков.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Compute( ref LayerTable pLT, ref BlockTableRecord record );
Копировать Код
Public Sub Compute( ByRef pLT As LayerTable, ByRef record As BlockTableRecord )
 Параметры
 Параметры
 Описание
 pLT
 Входная таблица слоев в объекте Database. Тип LayerTable.
 record
 Входная запись таблицы блоков, для которой должен быть вычислен фильтр. Тип BlockTableRecord.
 Описание
 Метод предназначен для вычисления данного фильтра, используя переданные в метод таблицу слоев и запись таблицы блоков.
 Ссылки
 Teigha.DatabaseServices.Filters.LayerIndex, Teigha.DatabaseServices.Filters
 Ваши комментарии по поводу этого топика: Послать отзыв!