Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Point3dCollection.RemoveAt
 Послать отзыв
 Метод удаляет из коллекции точку, заданную по ее индексу в коллекции.
 Синтаксис
C#
Visual Basic
Копировать Код
public void RemoveAt( int index );
Копировать Код
Public Sub RemoveAt( index As Integer )
 Параметры
 Параметры
 Описание
 index
 Индекс удаляемой точки. Тип int.
 Описание
 Метод удаляет из коллекции точку, индекс которой равен index.
 Ссылки
 Teigha.Geometry.Point3dCollection, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!