Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.LoftNormals
 Послать отзыв
 Синтаксис
C#
Visual Basic
public int LoftNormals;
Public Property LoftNormals() As Integer
 Описание
 Возвращает или устанавливает текущее значение LOFTNORMALS для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!