Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector2dCollection.Capacity
 Послать отзыв
 Свойство Capacity представляет текущую ёмкость данной коллекции.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual int Capacity;
Копировать Код
Public Overridable Property Capacity As Integer
 Возвращает
 Возвращает текущее значение ёмкости данной коллекции. Тип int.
 Описание
 Свойство Capacity управляет ёмкостью коллекции, т.е. количеством элементов, которые может содержать данная коллекция.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.Geometry.Vector2dCollection, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!