Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DataCell.SetVector
 Послать отзыв
 Метод устанавливает для этой ячейки значение типа Vector3d.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetVector( Vector3d value );
Копировать Код
Public Sub SetVector( value As Vector3d )
 Параметры
 Параметры
 Описание
 value
 Входное значение для ячейки. Тип Vector3d.
 Описание
 Метод устанавливает для этой ячейки значение типа Vector3d, заданное входным аргументом value.
 Ссылки
 Teigha.DatabaseServices.DataCell, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!