Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.TableStyle.SetBackgroundColorNone
 Послать отзыв
 Метод позволяет задать режим отображения цвета фона в строках указанного типа.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetBackgroundColorNone( bool value, int rowTypes );
Копировать Код
Public Overridable Sub SetBackgroundColorNone( value As Boolean, rowTypes As Integer )
 Параметры
 Параметры
 Описание
 value
 Флаг отключения отображения фонового цвета. Тип bool. Если принимает значение true, цвет фона подавляется и наоборот.
 rowTypes
 Один или комбинация нескольких типов строк таблицы. Тип int. См. перечисление RowType.
 Описание
 Метод позволяет отключить или включить режим отображения цвета фона в строках указанного типа.
 Ссылки
 Teigha.DatabaseServices.TableStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!