Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AttributeDefinition.UpdateMTextAttributeDefinition
 Послать отзыв
 Метод позволяет обновить внутренний объект MText, который в базовых свойствах AttributeDefinition представляет определение многострочного атрибута.
 Синтаксис
C#
Visual Basic
Копировать Код
public void UpdateMTextAttributeDefinition();
Копировать Код
Public Sub UpdateMTextAttributeDefinition()
 Описание
 Метод позволяет обновить внутренний объект MText, который в базовых свойствах AttributeDefinition представляет определение многострочного атрибута.
 Ссылки
 Teigha.DatabaseServices.AttributeDefinition, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!