Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeader.SetLeaderLineType
 Послать отзыв
 Метод позволяет задать тип линии выноски с указанным индексом (прямая, сплайн, невидимая).
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetLeaderLineType( int leaderLineIndex, DatabaseServices.LeaderType leaderLineType );
Копировать Код
Public Sub SetLeaderLineType( leaderLineIndex As Integer, leaderLineType As DatabaseServices.LeaderType )
 Параметры
 Параметры
 Описание
 leaderLineIndex
 Индекс линии выноски. Тип int.
 leaderLineType
 Тип линии выноски из перечисления DatabaseServices.LeaderType.
 Описание
 Метод позволяет задать тип линии выноски с указанным индексом (прямая, сплайн, невидимая).
 Ссылки
 Teigha.DatabaseServices.MLeader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!