Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.GetBreakOffset
 Послать отзыв
 Метод предназначен для получения смещения разрыва таблицы.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual Vector3d GetBreakOffset( int index );
Копировать Код
Public virtual Function GetBreakOffset( index As Integer ) As Vector3d
 Параметры
 Параметры
 Описание
 index
 Индекс фрагмента таблицы, тип int. Индекс должен быть больше или равен нулю и меньше количества табличных фрагментов, на которые разбита таблица.
 Возвращает
 Возвращает смещение разрыва таблицы. Тип Vector3d.
 Описание
 Метод предназначен для получения смещения разрыва таблицы.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!