Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SubDMesh.GetSubDividedVertexAt
 Послать отзыв
 Метод предназначен для извлечения вершины гладкой сети, используя заданный индекс.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d GetSubDividedVertexAt( int index );
Копировать Код
Public Function GetSubDividedVertexAt( index As Integer ) As Point3d
 Параметры
 Параметры
 Описание
 index
 Индекс вершины. Тип int.
 Возвращает
 Возвращает координатную точку вершины с заданным индексом.
 Описание
 Метод предназначен для извлечения вершины гладкой сети, используя заданный индекс.
 Ссылки
 Teigha.DatabaseServices.SubDMesh, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!