Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Arc.Normal
 Послать отзыв
 Свойство предназначено для хранения вектора нормали к плоскости, содержащей дугу.
 Синтаксис
C#
Visual Basic
public Vector3d Normal;
Public Property Normal() As Vector3d
 Возвращает
 Тип данных Vector3d. Note Значение нормали используется для группового кода 210 DXF.
 Описание
 Возвращает или устанавливает вектор нормали к плоскости, содержащей дугу. Нормаль должна быть в WCS координатах и должна быть ненулевой длины.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Arc, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!