Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.BeginWblockSelectedObjectsEventArgs
 Послать отзыв
 Класс представляет данные для события BeginWblockSelectedObjects базы данных.
 Иерархия классов
Teigha::DatabaseServices::BeginWblockSelectedObjectsEventArgs
 Синтаксис
C#
Visual Basic
Копировать Код
public class BeginWblockSelectedObjectsEventArgs : System.EventArgs;
Копировать Код
Public Class BeginWblockSelectedObjectsEventArgs Inherits System.EventArgs
 Описание
 Класс представляет данные для события BeginWblockSelectedObjects базы данных.
 Методы
 Конструкторы
 ПоказатьInternal
 Нет совпадений по текущему фильтру
 Имя
 Описание
 BeginWblockSelectedObjectsEventArgs
 This is BeginWblockSelectedObjectsEventArgs, a member of class BeginWblockSelectedObjectsEventArgs.
 Топики
 Имя
 Описание
 BeginWblockSelectedObjectsEventArgs Свойства
 Ниже перечислены свойства класса BeginWblockSelectedObjectsEventArgs.
 Ссылки
 BeginWblockSelectedObjectsEventArgs Свойства, Методы, Топики, BeginWblockSelectedObjectsEventArgs Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!