Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.RadialDimensionLarge
 Послать отзыв
 Класс RadialDimensionLarge представляет радиальный размер с изломом.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::GraphicsInterface::Drawable Teigha::DatabaseServices::DBObject Teigha::DatabaseServices::Entity Teigha::DatabaseServices::Dimension Teigha::DatabaseServices::RadialDimensionLarge
 Синтаксис
C#
Visual Basic
Копировать Код
[TypeDescriptionProvider("Teigha.ComponentModel.TypeDescriptionProvider`1[[Teigha.DatabaseServices.RadialDimensionLarge, TD_Mgd]], TD_Mgd")] [Wrapper("AcDbRadialDimensionLarge")] public class RadialDimensionLarge : Dimension
Копировать Код
<TypeDescriptionProvider("Teigha.ComponentModel.TypeDescriptionProvider`1[[Teigha.DatabaseServices.RadialDimensionLarge, TD_Mgd]], TD_Mgd")> <Wrapper("AcDbRadialDimensionLarge")> Public Class RadialDimensionLarge Inherits Dimension
 Описание
 Класс RadialDimensionLarge представляет радиальный размер с изломом.
 Методы
 Конструкторы
 Teigha.GraphicsInterface.Drawable
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 Drawable
 Конструктор класса Teigha.GraphicsInterface.Drawable. (Унаследован от Drawable)
 Teigha.DatabaseServices.DBObject
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 DBObject
 Конструктор. (Унаследован от DBObject)
 Teigha.DatabaseServices.RadialDimensionLarge
 Имя
 Описание
 RadialDimensionLarge
 Это обзор перегрузок RadialDimensionLarge.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.GraphicsInterface.Drawable
 Имя
 Описание
 Drawable Методы
 Ниже перечислены методы класса Drawable.
 Drawable Свойства
 Ниже перечислены свойства класса Drawable.
 Teigha.DatabaseServices.DBObject
 Имя
 Описание
 DBObject Методы
 Ниже перечислены методы класса DBObject.
 DBObject Свойства
 Ниже перечислены свойства класса DBObject.
 DBObject События
 Ниже перечислены события класса DBObject.
 Teigha.DatabaseServices.Entity
 Имя
 Описание
 Entity Методы
 Ниже перечислены методы класса Entity.
 Entity Свойства
 Ниже перечислены свойства класса Entity.
 Teigha.DatabaseServices.Dimension
 Имя
 Описание
 Dimension Методы
 Ниже перечислены методы класса Dimension.
 Dimension Свойства
 Ниже перечислены свойства класса Dimension.
 Teigha.DatabaseServices.RadialDimensionLarge
 Имя
 Описание
 RadialDimensionLarge Свойства
 Ниже перечислены свойства класса RadialDimensionLarge.
 Ссылки
 RadialDimensionLarge Конструктор, RadialDimensionLarge Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства, DBObject События
 Ваши комментарии по поводу этого топика: Послать отзыв!