Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.UnderlayReference.Normal
 Послать отзыв
 Свойство Normal представляет вектор нормали плоскости данной подложки.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d Normal;
Копировать Код
Public Property Normal As Vector3d
 Возвращает
 Возвращает нормаль плоскости данного объекта. Тип Vector3d.
 Описание
 Свойство Normal представляет вектор нормали плоскости данной подложки.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.UnderlayReference, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!