Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Leader.Dimclrd
 Послать отзыв
 Синтаксис
C#
Visual Basic
public Colors::Color Dimclrd;
Public Property Dimclrd() As Colors.Color
 Описание
 Возвращает или устанавливает текущее значение DIMCLRD для выноски. Если значение переопределено для объекта, то это переопределенное значение возвращается. В противном случае возвращается значение из размерности размерного стиля. Для получения дополнительной информации о DIMCLRD смотрите секцию "Системные переменные" Руководства по командам nanoCAD.
 Note Вы можете использовать метод Color.ColorIndex() для получения индекса цвета nanoCAD из возвращенного объекта Color.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Leader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!