Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.EllipticalArc3d.ClosestPointToPlane
 Послать отзыв
 Метод вычисляет точку на эллиптической дуге, которая находится ближе всего к указанной плоскости, и точку на этой плоскости, которая находится ближе всего к эллиптической дуге. Геометрические вычисления выполняются с точностью по умолчанию.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d[] ClosestPointToPlane( ref PlanarEntity plane );
Копировать Код
Public Function ClosestPointToPlane( ByRef plane As PlanarEntity ) As Point3d()
 Параметры
 Параметры
 Описание
 plane
 Плоский объект, по отношению к которому вычисляется ближайшая точка на данной эллиптической дуге. Тип PlanarEntity.
 Возвращает
 Возвращает массив из двух элементов. Тип Point3d[]. Первый элемент представляет точку на плоскости plane, а второй — ближайшую к ней точку на данной эллиптической дуге.
 Описание
 Метод вычисляет точку на эллиптической дуге, которая находится ближе всего к указанной плоскости, и точку на этой плоскости, которая находится ближе всего к эллиптической дуге. Результат представляется в виде массива из двух точек. Используется вызов метода EllipticalArc3d.ClosestPointToPlane(PlanarEntity plane, Tolerance tolerance) со значением точности, равным Tolerance.Global.
 Ссылки
 Teigha.Geometry.EllipticalArc3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!