Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.UnderlayReference.ContrastUpperLimit
 Послать отзыв
 Свойство ContrastUpperLimit представляет верхний предел возможных значений контраста.
 Синтаксис
C#
Visual Basic
Копировать Код
public static int ContrastUpperLimit;
Копировать Код
Public Shared ReadOnly Property ContrastUpperLimit As Integer
 Возвращает
 Возвращает максимально возможное значение контраста. Тип int.
 Описание
 Свойство ContrastUpperLimit представляет верхний предел возможных значений контраста.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.UnderlayReference, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!