Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.HostApplicationServices
 Послать отзыв
 Класс HostApplicationServices предоставляет хост-приложениям различные сервисы времени выполнения. Сами сервисы определяются в приложении-клиенте.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::DatabaseServices::HostApplicationServices
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdDbHostAppServices")] public class HostApplicationServices : RXObject;
Копировать Код
<Wrapper("OdDbHostAppServices")> Public Class HostApplicationServices Inherits RXObject
 Описание
 Класс HostApplicationServices предоставляет хост-приложениям различные сервисы времени выполнения. Сами сервисы определяются в приложении-клиенте.
 Хост-приложение должно предоставлять класс, производный от HostApplicationServices. Сервис по умолчанию не предусмотрен.
 Методы контроллера и транзакции этого класса определяют контроллер отмены и менеджер транзакций, которые будет использовать ваше приложение. Переопределять или вызывать эти методы не требуется. Методы Internet позволяют вашему приложению использовать URL (Uniform Resource Locators) непосредственно в коде или через браузер. Методы в группе системных функций в классе служб хост-приложений обычно переопределять не требуется. Эти методы задаются в конструкторе класса HostApplicationServices и в изменении не нуждаются.
 Методы
 Конструкторы
 Teigha.DatabaseServices.HostApplicationServices
 Имя
 Описание
 HostApplicationServices
 Это обзор перегрузок HostApplicationServices.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.DatabaseServices.HostApplicationServices
 Имя
 Описание
 HostApplicationServices Методы
 Ниже перечислены методы класса HostApplicationServices.
 HostApplicationServices Свойства
 Ниже перечислены свойства класса HostApplicationServices.
 Ссылки
 HostApplicationServices Конструктор, HostApplicationServices Методы, HostApplicationServices Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!