Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ObjectId.=
 Послать отзыв
 Оператор присвоения для объекта CompoundObjectId. Входной объект имеет тип ObjectId.
 Синтаксис
C#
Visual Basic
Копировать Код
public CompoundObjectId operator =( ObjectId A_0 );
Копировать Код
Public Operator =( A_0 As ObjectId )
 Параметры
 Параметры
 Описание
 A_0
 Входной объект. Тип ObjectId.
 Описание
 Оператор присвоения для объекта CompoundObjectId. Входной объект имеет тип ObjectId.
 Ссылки
 Teigha.DatabaseServices.CompoundObjectId, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!