Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.EllipticalArc2d.Create
 Послать отзыв
 Метод создает эллипс или эллиптическую дугу на основе переданного неуправляемого указателя.
 Синтаксис
C#
Visual Basic
Копировать Код
public static EllipticalArc2d Create( IntPtr unmanagedPointer, bool autoDelete );
Копировать Код
Public Shared Function Create( unmanagedPointer As IntPtr, autoDelete As Boolean ) As EllipticalArc2d
 Параметры
 Параметры
 Описание
 unmanagedPointer
 Входной неуправляемый указатель на исходный объект. Тип IntPtr.
 autoDelete
 Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.
 Возвращает
 Возвращает созданный объект. Тип EllipticalArc2d.
 Описание
 Метод создает эллипс или эллиптическую дугу на основе переданного неуправляемого указателя.
 Ссылки
 Teigha.Geometry.EllipticalArc2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!