Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.HatchPatternType
 Послать отзыв
 Перечисление HatchPatternType определяет доступные типы образцов штриховки.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum HatchPatternType { UserDefined = 0, PreDefined = 1, CustomDefined = 2 }
Копировать Код
Public Enum HatchPatternType UserDefined = 0 PreDefined = 1 CustomDefined = 2 End Enum
 Члены
 Члены
 Описание
 UserDefined
 Значение: 0. Образец штриховки, созданный пользователем из линий. Определяется с использованием типа линий с указанными интервалом, углом наклона, цветом и прочими свойствами.
 PreDefined
 Значение: 1. Предопределённый образец штриховки, предлагаемый одним из действующих стандартов (ГОСТ, ISO, ANSI и др.).
 CustomDefined
 Значение: 2. Пользовательские образцы штриховки. Пользовательские файлы с расширением *.pat размещаются в той же папке, в которой находятся образцы штриховки из комплекта поставки: C:\ProgramData\Nanosoft\nanoCAD X.X\SHX.
 Описание
 Перечисление HatchPatternType определяет доступные типы образцов штриховки - стандартный (PreDefined), из линий (UserDefined), пользовательский (CustomDefined).
 Ваши комментарии по поводу этого топика: Послать отзыв!