Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Dimrnd
 Послать отзыв
 Синтаксис
C#
Visual Basic
public double Dimrnd;
Public Property Dimrnd() As Double
 Описание
 Возвращает или устанавливает текущее значение DIMRND для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!