Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Ole2Frame.Position2d
 Послать отзыв
 Свойство представляет координаты четырех угловых точек OLE-объекта в координатах GDI текущего видового экрана.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual System.Drawing.Rectangle Position2d;
Копировать Код
Public Overridable Property Position2d As System.Drawing.Rectangle
 Возвращает
 Возвращает четыре угловые точки OLE-объекта в виде объекта System.Drawing.Rectangle.
 Описание
 Свойство представляет координаты четырех угловых точек OLE-объекта в координатах GDI текущего видового экрана.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Ole2Frame, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!