Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AlignedDimension.XLine2Point
 Послать отзыв
 Свойство предоставляет доступ на изменение к начальной точке второй выносной линии размера (в координатах WCS).
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d XLine2Point;
Копировать Код
Public Property XLine2Point() As Point3d
 Возвращает
 Возвращает начальную точку второй выносной линии размера (в координатах WCS). Тип Point3d.
 Описание
 Свойство предоставляет доступ на изменение к начальной точке второй выносной линии размера (в координатах WCS).
 Замечания
 Характер отображения выносной линии относительно этой точки определяет системная переменная DIMEXO. Начальная точка первой выносной линии соответствует группе DXF с кодом 14.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.AlignedDimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!