Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Helix.TurnHeight
 Послать отзыв
 Свойство обеспечивает доступ к значению высоты витка спирали.
 Синтаксис
C#
Visual Basic
Копировать Код
public double TurnHeight;
Копировать Код
Public Property TurnHeight As Double
 Возвращает
 Возвращает высоту витка спирали. Тип double.
 Описание
 Свойство обеспечивает доступ к значению высоты витка спирали.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Helix, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!