Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MeshFaceterData.FaceterMinVGrid
 Послать отзыв
 Свойство представляет минимальное значение параметра V для линий сети.
 Синтаксис
C#
Visual Basic
Копировать Код
public unsigned short FaceterMinVGrid;
Копировать Код
Public Property FaceterMinVGrid As unsigned short
 Возвращает
 Возвращает минимальное значение параметра V. Тип short.
 Описание
 Свойство представляет минимальное значение параметра V для линий сети.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MeshFaceterData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!