Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.OffsetSurface.IsCone
 Послать отзыв
 Свойство IsCone позволяет определить, является ли поверхность смещения конусом.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsCone;
Копировать Код
Public ReadOnly Property IsCone As Boolean
 Возвращает
 Возвращает true, если поверхность смещения представлена конусом. В противном случае возвращает false.
 Описание
 Свойство IsCone позволяет определить, является ли поверхность смещения конусом.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.OffsetSurface, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!