Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.ExternalBoundedSurface.IsCylinder
 Послать отзыв
 Свойство IsCylinder позволяет проверить, является ли неограниченная базовая поверхность данного объекта цилиндром.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsCylinder;
Копировать Код
Public ReadOnly Property IsCylinder As Boolean
 Возвращает
 Возвращает true, если неограниченная базовая поверхность является цилиндром. В противном случае возвращает false.
 Описание
 Свойство IsCylinder определяет тип неограниченной базовой поверхности данного объекта и возвращает true, если она является цилиндром.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.ExternalBoundedSurface, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!