Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GeoLocationData.GetMeshPointMaps
 Послать отзыв
 Метод позволяет получить коллекцию исходных точек сети GeoMesh и коллекцию точек назначения в виде объекта MeshPointMaps.
 Синтаксис
C#
Visual Basic
Копировать Код
public MeshPointMaps GetMeshPointMaps();
Копировать Код
Public Function GetMeshPointMaps() As MeshPointMaps
 Возвращает
 Возвращает коллекции исходных точек и точек назначения в виде объекта MeshPointMaps.
 Описание
 Метод позволяет получить коллекцию исходных точек сети GeoMesh и коллекцию точек назначения в виде объекта MeshPointMaps.
 Ссылки
 Teigha.DatabaseServices.GeoLocationData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!