Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotStyleDescriptor.Id
 Послать отзыв
 Свойство предоставляет доступ к ObjectId листа печати.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectId Id;
Копировать Код
Public Property Id() As ObjectId
 Возвращает
 Возвращает ObjectId листа печати.
 Описание
 Свойство предоставляет доступ к ObjectId листа печати.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.PlotStyleDescriptor, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!