Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Ray3d.Ray3d
 Послать отзыв
 Конструктор по умолчанию класса Ray3d. Создает луч с началом в точке (0,0,0) и направляющим вектором (1,0,0).
 Синтаксис
C#
Visual Basic
Копировать Код
public Ray3d();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса Ray3d. Создает луч с началом в точке (0,0,0) и направляющим вектором (1,0,0) (т.е. вдоль положительного направления оси X).
 Ссылки
 Teigha.Geometry.Ray3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!