Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ObjectId.Compare
 Послать отзыв
 Метод сравнивает идентификатор данного объекта с указанным ObjectId и возвращает true, если они совпадают.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool Compare( ObjectId value1 );
Копировать Код
Public Function Compare( value1 As ObjectId ) As Boolean
 Параметры
 Параметры
 Описание
 value1
 ObjectId, с которым выполняется сравнение.
 Возвращает
 Возвращает true в случае совпадения идентификаторов, и false в противном случае.
 Описание
 Метод сравнивает идентификатор данного объекта с указанным ObjectId и возвращает true, если они совпадают.
 Ссылки
 Teigha.DatabaseServices.ObjectId, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!