Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocDependency.PrevDependencyOnObject
 Послать отзыв
 Свойство возвращает зависимость, которая предшествует данной в списке зависимостей связанного объекта DBObject.
 Синтаксис
C#
Visual Basic
Копировать Код
public Teigha.DatabaseServices.ObjectId PrevDependencyOnObject;
Копировать Код
Public Property PrevDependencyOnObject() As Teigha.DatabaseServices.ObjectId
 Возвращает
 Возвращает идентификатор зависимости. Тип Teigha.DatabaseServices.ObjectId.
 Описание
 Свойство возвращает зависимость, которая предшествует данной в списке зависимостей связанного объекта DBObject. Для первой в списке зависимости возвращает ObjectId.Null.
 Все зависимости, связанные с одним и тем же оъектом DBObject, хранятся в двусвязном списке. Порядок следования зависимостей в списке определяется свойством Order этих зависимостей.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.AssocDependency, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!