Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 ViewportTableRecord.UcsSavedWithViewport
 Послать отзыв
 Свойство предназначено для управления взаимосвязью ПСК текущего видового экрана с ПСК остальных видовых экранов пространства модели.
 Синтаксис
C#
Visual Basic
public bool UcsSavedWithViewport;
Public Property UcsSavedWithViewport() As bool
 Возвращает
 Возвращает тип данных bool:
true – ПСК, сохраненная с этим видовым экраном, становится активной во всех видовых экранах пространства модели каждый раз, когда этот видовой экран становится активным;
false – ПСК, сохраненная в этом видовом экране, активна только в нём.
 Описание
 Свойство предназначено для управления значением системной переменной UCSVP видового экрана. Если эта функция возвращает значение true, то ucs, сохраненный с этим видовым экраном, станет активным всякий раз, когда видовой экран становится активным.
 Условия
 Чтение и запись.
 Ссылки
 ViewportTableRecord Класс, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!