Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.TableStyle.SetFormat
 Послать отзыв
 Метод позволяет задать формат в ячейках строк заданного типа. В текущей версии не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetFormat( ref String pFormat, RowType rowTypes );
Копировать Код
Public Overridable Sub SetFormat( ByRef pFormat As String, rowTypes As RowType )
 Параметры
 Параметры
 Описание
 pFormat
 Задаваемый формат ячеек. Тип String.
 rowTypes
 Один или комбинация нескольких типов строк таблицы. Тип int. См. перечисление RowType.
 Описание
 Метод позволяет задать формат в ячейках строк заданного типа. В текущей версии не реализован.
 Ссылки
 Teigha.DatabaseServices.TableStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!