Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Curve.GetOffsetCurves
 Послать отзыв
 Метод создает коллекцию кривых, полученных со смещением (offset) в заданной плоскости.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual DBObjectCollection GetOffsetCurvesGivenPlaneNormal( Vector3d normal, double offsetDist );
Копировать Код
Public virtual Function GetOffsetCurvesGivenPlaneNormal( normal As Vector3d, offsetDist As double ) As DBObjectCollection
 Параметры
 Параметры
 Описание
 normal
 Вектор нормали (тип Vector3d) к плоскости, в которой нужно построить кривые со смещением.
 offsetDist
 Величина смещения, тип double.
 Возвращает
 Возвращает коллекцию типа DBObjectCollection, в которой содержатся построенные кривые.
 Описание
 Метод создает коллекцию кривых, полученных со смещением (offset) в заданной плоскости.
 Ссылки
 Teigha.DatabaseServices.Curve, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!