Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.OsnapOverrule
 Послать отзыв
 Этот класс переопределяет подмножество операций объектной привязки, которые специфичны для объекта чертежа.
 Иерархия классов
Teigha::DatabaseServices::OsnapOverrule
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdDbOsnapOverrule")] public class OsnapOverrule : Overrule;
Копировать Код
<Wrapper("OdDbOsnapOverrule")> Public Class OsnapOverrule Inherits Overrule
 Описание
 Этот класс переопределяет подмножество операций, связанных с объектной привязкой, которые специфичны для данного объекта чертежа.
 Класс используется в качестве базового для настройки поведения производных классов этого объекта чертежа. Всякая реализация по умолчанию вызывает соответствующий метод целевого класса.
 Топики
 Имя
 Описание
 OsnapOverrule Методы
 Ниже перечислены методы класса OsnapOverrule.
 Ссылки
 OsnapOverrule Методы, Топики, OsnapOverrule Методы
 Ваши комментарии по поводу этого топика: Послать отзыв!