Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Mline.Scale
 Послать отзыв
 Свойство представляет масштаб, заданный для данной мультилинии.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Scale;
Копировать Код
Public Property Scale As Double
 Возвращает
 Возвращает текущее значение масштаба. Тип double.
 Описание
 Свойство представляет масштаб, заданный для данной мультилинии.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Mline, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!