Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.XrefBeginOperationEventArgs
 Послать отзыв
 Класс XrefBeginOperationEventArgs представляет данные для событий базы данных XrefBeginRestore, XrefBeginAttached и XrefBeginOtherAttached.
 Иерархия классов
Teigha::DatabaseServices::XrefBeginOperationEventArgs
 Синтаксис
C#
Visual Basic
Копировать Код
public sealed class XrefBeginOperationEventArgs : System.EventArgs;
Копировать Код
Public NotInheritable Class XrefBeginOperationEventArgs Inherits System.EventArgs
 Описание
 Класс XrefBeginOperationEventArgs представляет данные для событий базы данных XrefBeginRestore, XrefBeginAttached и XrefBeginOtherAttached.
 Топики
 Имя
 Описание
 XrefBeginOperationEventArgs Свойства
 Ниже перечислены свойства класса XrefBeginOperationEventArgs.
 Ссылки
 XrefBeginOperationEventArgs Свойства, Топики, XrefBeginOperationEventArgs Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!