Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LoftOptions.DraftEnd
 Послать отзыв
 Свойство возвращает угол в радианах, под которым результирующая поверхность входит в последнее поперечное сечение (end draft angle, угол входа поверхности в сечение).
 Синтаксис
C#
Visual Basic
Копировать Код
public double DraftEnd;
Копировать Код
Public ReadOnly Property DraftEnd As Double
 Возвращает
 Возвращает угол сопряжения поверхности с последним поперечным сечением (в радианах). Тип double.
 Описание
 Свойство возвращает угол в радианах, под которым результирующая поверхность входит в последнее поперечное сечение (end draft angle, угол входа поверхности в сечение). Значение по умолчанию — 0, что означает, что конкретное значение угла не задано, и система автоматически вычислит оптимальный угол для последнего поперечного сечения.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.LoftOptions, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!