Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AbstractViewportData.SnapIsoPair
 Послать отзыв
 Свойство SnapIsoPair представляет плоскость изометрии для видового экрана.
 Синтаксис
C#
Visual Basic
Копировать Код
public UInt16 SnapIsoPair;
Копировать Код
Public Property SnapIsoPair As UInt16
 Возвращает
 Возвращает код плоскости изометрии. Тип UInt16.
 Описание
 Свойство SnapIsoPair представляет плоскость изометрии для видового экрана. Допустимые значения:
 Значение
 Описание
 0
 Левая изоплоскость.
 1
 Верхняя изоплоскость.
 2
 Правая изоплоскость.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.AbstractViewportData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!