Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.Rows
 Послать отзыв
 Данное свойство предоставляет доступ к коллекции строк объекта Table.
 Синтаксис
C#
Visual Basic
Копировать Код
public RowsCollection Rows;
Копировать Код
Public Property Rows() As RowsCollection
 Возвращает
 Возвращает коллекцию строк объекта Table. Тип RowsCollection.
 Описание
 Данное свойство предоставляет доступ к коллекции строк объекта Table.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!