Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.EllipticalArc3d.GetPlane
 Послать отзыв
 Метод позволяет получить бесконечную плоскость, в которой располагается данная эллиптическая дуга (или эллипс).
 Синтаксис
C#
Visual Basic
Копировать Код
public Plane GetPlane();
Копировать Код
Public Function GetPlane() As Plane
 Возвращает
 Возвращает 3D-плоскость, в которой располагается данный объект. Тип Plane.
 Описание
 Метод позволяет получить бесконечную плоскость, в которой располагается данная эллиптическая дуга (или эллипс).
 Ссылки
 Teigha.Geometry.EllipticalArc3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!