Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор DatabaseSummaryInfo.DatabaseSummaryInfo
 Послать отзыв
 This is DatabaseSummaryInfo, a member of class DatabaseSummaryInfo.
 Синтаксис
C#
Visual Basic
internal DatabaseSummaryInfo(IntPtr unmanagedPointer);
Friend Sub New(unmanagedPointer As IntPtr)
 Ссылки
 Teigha.DatabaseServices.DatabaseSummaryInfo, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!