Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.RetainOriginalThumbnailBitmap
 Послать отзыв
 Синтаксис
C#
Visual Basic
public bool RetainOriginalThumbnailBitmap;
Public Property RetainOriginalThumbnailBitmap() As bool
 Описание
 Возвращает или устанавливает состояние переключателя растрового изображения. По умолчанию установлено в false. Если переключатель установлен в true, база данных всегда пытается сохранять оригинальное изображение независимо от того, что указывают другие действия.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!