Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ObjectId.Open
 Послать отзыв
 Метод открывает объект, связанный с данным ObjectId, в указанном режиме доступа.
 Синтаксис
C#
Visual Basic
Копировать Код
public DBObject Open( OpenMode mode, bool openErased );
Копировать Код
Public Function Open( mode As OpenMode, openErased As Boolean ) As DBObject
 Параметры
 Параметры
 Описание
 mode
 Режим обращения к объекту из перечисления Teigha.DatabaseServices.OpenMode.
 openErased
 Задать true, если следует открывать удаленный объект. Тип bool.
 Возвращает
 Возвращает экземпляр класса DBObject
 Описание
 Метод открывает объект, связанный с данным ObjectId, в указанном режиме доступа.
 Ссылки
 Teigha.DatabaseServices.ObjectId, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!