Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LayerStateManager.LayerStatesDictionaryId
 Послать отзыв
 Возвращает ObjectId словаря расширения состояний слоя (в словаре расширения таблицы слоев) или ObjectId (NULL).
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectId LayerStatesDictionaryId( bool createIfNotPresent );
Копировать Код
Public Function LayerStatesDictionaryId( createIfNotPresent As Boolean ) As ObjectId
 Параметры
 Параметры
 Описание
 createIfNotPresent
 Логический флаг, управляющий созданием словаря, тип bool.
 Возвращает
 Возвращает ObjectId словаря расширения состояний слоя (в словаре расширения таблицы слоев) или нулевой ObjectId (NULL).
 Описание
 Возвращает ObjectId словаря расширения состояний слоя (в словаре расширения таблицы слоев) или ObjectId (NULL), если реализуется какая-либо из следующих ситуаций:
база данных имеет значение Null, или
таблица символов имеет значение Null, или
словарь расширения таблицы слоев или словарь расширения состояний слоев имеет значение Null (а аргумент createIfNotPresent имеет значение false), или
словарь расширения таблицы слоев или словарь расширения состояний слоев не может быть создан (а аргумент createIfNotPresent имеет значение true), или
словарь расширения таблицы слоев не может быть открыт на чтение.
 Ссылки
 Teigha.DatabaseServices.LayerStateManager, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!