Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Limmax
 Послать отзыв
 Синтаксис
C#
Visual Basic
public Point2d Limmax;
Public Property Limmax() As Point2d
 Описание
 Возвращает или устанавливает текущее значение LIMMAX пространства модели для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!