Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector3d.Mirror
 Послать отзыв
 Метод позволяет получить 3D-вектор, который является результатом зеркального отражения данного вектора относительно заданной плоскости.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d Mirror( Vector3d normalToPlane );
Копировать Код
Public Function Mirror( normalToPlane As Vector3d ) As Vector3d
 Параметры
 Параметры
 Описание
 normalToPlane
 Входной вектор нормали плоскости зеркального отражения. Тип Vector3d.
 Возвращает
 Возвращает вектор, являющийся зеркальным отражением данного вектора. Тип Vector3d.
 Описание
 Метод позволяет получить трехмерный вектор как результат зеркального отражения данного вектора относительно плоскости, которая имеет нормаль NormalToPlane и проходит через начало системы координат.
 Ссылки
 Teigha.Geometry.Vector3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!