Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.TextStyleId
 Послать отзыв
 Свойство задает или возвращает текстовый стиль, используемый для размерного текста в данном объекте.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.ObjectId TextStyleId;
Копировать Код
Public Property TextStyleId As DatabaseServices.ObjectId
 Возвращает
 Возвращает идентификатор текстового стиля размерного текста. Тип DatabaseServices.ObjectId.
 Описание
 Свойство задает или возвращает текстовый стиль, используемый для размерного текста в данном объекте.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!