Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Interval.GetBounds
 Послать отзыв
 Метод предоставляет границы данного интервала.
 Синтаксис
C#
Visual Basic
Копировать Код
public double[] GetBounds();
Копировать Код
Public Function GetBounds() As Double()
 Возвращает
 Возвращает массив из двух элементов. Тип double[]. Элемент с нулевым индексом определяет нижнюю границу, а следующий элемент определяет верхнюю.
 Описание
 Метод предоставляет границы данного интервала в виде массива из двух элементов (для нижней и верхней границ, соответственно). Возвращаемые значения имеют смысл, только если интервал является ограниченным в соответствующем направлении.
 Ссылки
 Teigha.Geometry.Interval, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!