Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.UcsTableRecord.YAxis
 Послать отзыв
 Свойство YAxis представляет 3D-вектор в мировой системе координат, который определяет направление оси Y пользовательской системы координат для данного объекта UcsTableRecord.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d YAxis;
Копировать Код
Public Property YAxis As Vector3d
 Возвращает
 Возвращает направление оси Y пользовательской системы координат. Тип Vector3d. Задан в мировой системе координат.
 Описание
 Свойство YAxis представляет 3D-вектор в мировой системе координат (WCS, МСК), который определяет направление оси Y пользовательской системы координат (UCS, ПСК) для данного объекта UcsTableRecord.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.UcsTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!