Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DiametricDimension.ChordPoint
 Послать отзыв
 Свойство позволяет получить или задать первую точку диаметра на измеряемой окружности или дуге.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d ChordPoint;
Копировать Код
Public Property ChordPoint() As Point3d
 Возвращает
 Возвращает первую точку диаметра. Тип Point3d.
 Описание
 Свойство позволяет получить или задать первую точку диаметра на измеряемой окружности или дуге. Точка хорды — это точка, в которой размерная линия для этого размерного объекта пересекает кривую, для которой проставляется размер, и выходит за ее пределы (если текст аннотации находится за пределами кривой).
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.DiametricDimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!