Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Trace.Trace
 Послать отзыв
 Конструктор по умолчанию класса Trace.
 Синтаксис
C#
Visual Basic
Копировать Код
public Trace();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса Trace.
 Ссылки
 Teigha.DatabaseServices.Trace, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!