Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Entity.LineWeight
 Послать отзыв
 Свойство предназначено для получения или установки толщины линии (ширины) геометрического объекта, которая определяет её отображение на экране и при печати.
 Синтаксис
C#
Visual Basic
Копировать Код
public LineWeight LineWeight;
Копировать Код
Public Property LineWeight() As LineWeight
 Возвращает
 Возвращает значение перечисления LineWeight, представляющее текущую установленную ширину линии объекта. Доступные значения соответствуют стандартным размерам толщины линий в системе nanoCAD.
 Описание
 Свойство обеспечивает доступ к значению ширины линии геометрического объекта.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Entity, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!