Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.NurbsData.==
 Послать отзыв
 Оператор равенства для класса NurbsData.
 Синтаксис
C#
Visual Basic
Копировать Код
public static bool operator ==( NurbsData a, NurbsData b );
Копировать Код
Public Shared Operator =( a As NurbsData, b As NurbsData ) As Boolean
 Параметры
 Параметры
 Описание
 a
 Левый операнд. Тип NurbsData.
 b
 Правый операнд. Тип NurbsData.
 Возвращает
 Возвращает true, если выполнены одновременно все условия равенства сравниваемых объектов. В противном случае возвращает false.
 Описание
 Оператор равенства для класса NurbsData.
 Равенство означает одновременное выполнение следующих условий:
Совпадают управляющие вершины.
Совпадают узловые точки.
Совпадают степени сплайнов.
Оба сплайна являются рациональными, либо оба являются нерациональными.
Оба сплайна являются замкнутыми, либо оба являются незамкнутыми.
Оба сплайна являются периодическими, либо оба являются непериодическими.
 Ссылки
 Teigha.DatabaseServices.NurbsData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!