Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Viewport.SnapIsometric
 Послать отзыв
 Свойство SnapIsometric позволяет определить, является ли изометрическая привязка текущим типом шаговой привязки.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool SnapIsometric;
Копировать Код
Public Property SnapIsometric As Boolean
 Возвращает
 Возвращает true, если текущим типом шаговой привязки является изометрическая привязка. В противном случае возвращает false.
 Описание
 Свойство SnapIsometric позволяет определить, является ли изометрическая привязка текущим типом шаговой привязки.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Viewport, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!