Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ObjectIdCollection.Contains
 Послать отзыв
 Метод позволяет проверить, содержит ли данная коллекция указанный объект ObjectId.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool Contains( ObjectId value );
Копировать Код
Public Function Contains( value As ObjectId ) As Boolean
 Параметры
 Параметры
 Описание
 value
 Проверяемый идентификатор объекта. Тип ObjectId.
 Возвращает
 Возвращает true, если идентификатор value в коллекции присутствует. В противном случае возвращает false.
 Описание
 Метод позволяет проверить, содержит ли данная коллекция указанный объект ObjectId.
 Ссылки
 Teigha.DatabaseServices.ObjectIdCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!