Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.NurbsData.Equals
 Послать отзыв
 Метод предназначен для проверки идентичности двух объектов.
 Синтаксис
C#
Visual Basic
Копировать Код
public sealed override bool Equals( ref Object obj );
Копировать Код
Public NotOverridable Overrides Function Equals( ByRef obj As Object ) As Boolean
 Параметры
 Параметры
 Описание
 obj
 Входной объект, с которым проверяется равенство. Тип Object.
 Возвращает
 Возвращает true, если оба объекта не являются нулевыми, имеют одинаковый тип и идентичные параметры. В противном случае возвращает false.
 Описание
 Метод используется для проверки идентичности данного и входного объектов.
 Замечания
 Переопределение методов Equals и GetHashCode должно выполняться согласованно с сохранением общей логики. Если Equals возвращает true, хеш-коды обязаны совпадать. Обратное не гарантируется - совпадение хэш-кодов не всегда означает совпадение объектов вследствие возможных коллизий. Хэш-коды должны формироваться с использованием полей, на которых основано равенство объектов. Иногда используется метод Equals() из объекта C++, но поскольку сравниваются указатели, вы по-прежнему можете использовать NurbsData.GetHashCode(), в то время как метод Equals() может быть переопределен в производном классе.
 Ссылки
 Teigha.DatabaseServices.NurbsData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!