Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.HighlightOverrule.Unhighlight
 Послать отзыв
 Отменяет в данном объекте подсвечивание указанного пути к подобъекту.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Unhighlight( ref Entity entity, FullSubentityPath subId, bool highlightAll );
Копировать Код
Public Sub Unhighlight( ByRef entity As Entity, subId As FullSubentityPath, highlightAll As Boolean )
 Параметры
 Параметры
 Описание
 entity
 Объект, тип Entity.
 subId
 Полный путь к подобъекту для отмены подсвечивания, тип FullSubentityPath.
 highlightAll
 Если данный флаг имеет значение true, то отмена подсвечивания выполняется во всех видовых экранах. Тип bool.
 Описание
 Отменяет в данном объекте подсвечивание указанного пути к подобъекту.
 Ссылки
 Teigha.DatabaseServices.HighlightOverrule, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!