Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve2d.IsDegenerate
 Послать отзыв
 Метод проверяет, является ли данная кривая вырожденной.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsDegenerate( out Entity2d result );
Копировать Код
Public Function IsDegenerate( ByRef result As Entity2d ) As Boolean
 Параметры
 Параметры
 Описание
 result
 Выходной тип объекта, в который выродилась кривая (в случае вырождения). Тип Entity2d.
 Возвращает
 Возвращает true, если вырождение имеет место. В противном случае возвращает false.
 Описание
 Метод проверяет, является ли данная кривая вырожденной. В случае вырождения возвращает тип объекта, в которой вырождается кривая.
 Используется вызов IsDegenerate(out Entity2d result, Tolerance tolerance) со значением точности, равным Tolerance.Global.
 Ссылки
 Teigha.Geometry.Curve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!