Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Entity3d.TransformBy
 Послать отзыв
 Метод применяет к данному объекту указанное трехмерное геометрическое преобразование.
 Синтаксис
C#
Visual Basic
Копировать Код
public void TransformBy( Matrix3d transform );
Копировать Код
Public Sub TransformBy( transform As Matrix3d )
 Параметры
 Параметры
 Описание
 transform
 Матрица геометрического преобразования. Тип Matrix3d.
 Описание
 Метод применяет к данному объекту указанное трехмерное геометрическое преобразование.
 Ссылки
 Teigha.Geometry.Entity3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!