Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.PolylineCurve2d.FitPointAt
 Послать отзыв
 Метод предоставляет определяющую точку с указанным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point2d FitPointAt( int i );
Копировать Код
Public Function FitPointAt( i As Integer ) As Point2d
 Параметры
 Параметры
 Описание
 i
 Входной индекс определяющей точки. Индексация начинается с нуля. Тип int.
 Возвращает
 Возвращает определяющую точку сплайна с индексом i. Тип Point2d.
 Описание
 Метод предоставляет определяющую точку данного сплайна с индексом i.
 Ссылки
 Teigha.Geometry.PolylineCurve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!