Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство BlockReference.DynamicBlockReferencePropertyCollection
 Послать отзыв
 Синтаксис
C#
Visual Basic
public DatabaseServices::DynamicBlockReferencePropertyCollection DynamicBlockReferencePropertyCollection;
Public Property DynamicBlockReferencePropertyCollection() As DatabaseServices.DynamicBlockReferencePropertyCollection
 Описание
 Возвращает коллекцию динамического блока (BlockTableRecord), описывающую, из чего состоит динамический блок, если блок, на который указывает ссылка, является динамическим блоком.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.BlockReference, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!