Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GripOverrule.SetExtensionDictionaryEntryFilter
 Послать отзыв
 Включает фильтрацию объектов в словаре расширений перед объектным переопределением.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetExtensionDictionaryEntryFilter( ref String entryName );
Копировать Код
Public Sub SetExtensionDictionaryEntryFilter( ByRef entryName As String )
 Параметры
 Параметры
 Описание
 entryName
 Имя записи в словаре расширений, тип String.
 Описание
 Включает фильтрацию объектов в словаре расширений перед объектным переопределением.
 Используйте этот метод, если требуется, чтобы nanoCAD искал в словаре расширений запись с именем entryName перед вызовом любого из ваших переопределений. Переопределения не будут вызываться, если entryName в словаре расширений отсутствует.
 Ссылки
 Teigha.DatabaseServices.GripOverrule, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!