Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.OffsetSurface.IsBoundedPlane
 Послать отзыв
 Свойство IsBoundedPlane позволяет определить, является ли поверхность смещения ограниченной плоскостью.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsBoundedPlane;
Копировать Код
Public ReadOnly Property IsBoundedPlane As Boolean
 Возвращает
 Возвращает true, если поверхность смещения представлена ограниченной плоскостью. В противном случае возвращает false.
 Описание
 Свойство IsBoundedPlane позволяет определить, является ли поверхность смещения ограниченной плоскостью.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.OffsetSurface, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!