Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.BlockReference
 Послать отзыв
 Класс предназначен для создания вставки блока в чертеже.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::GraphicsInterface::Drawable Teigha::DatabaseServices::DBObject Teigha::DatabaseServices::Entity Teigha::DatabaseServices::BlockReference
 Синтаксис
C#
Visual Basic
[Wrapper("AcDbBlockReference")] public class BlockReference : Entity;
<Wrapper("AcDbBlockReference")> Public Class BlockReference Inherits Entity
 Описание
 Вставка блока является графической частью блока и ссылкой на его неграфическую часть - определение блока BlockTableRecord, в котором указаны все параметры самого блока. Ссылка на блок используется для определения места, размера, и отображения экземпляра коллекции геометрических объектов, в BlockTableRecord, на которую он ссылается. Дополнительно, ссылка на блок может быть владельцем атрибутов геометрических объектов (список которых автоматически ограничивается геометрическим объектом SequenceEnd).
 Note
 Когда геометрические объекты BlockTableRecord, на которые ссылается ссылка блока, разрешены для отображения, WCS координаты для геометрического объекта из записи таблицы блоков преобразуются в координатную систему, по существу являющуюся OCS ссылки на блок. Исходные значения преобразуются в относительные позиции точки блока, а оси X и Y поворачиваются вокруг оси Z для получения относительной величины поворота блока. Величина поворота в радианах является положительной при повороте против часовой стрелки при просмотре вниз по оси Z по направлению к исходной точке.
 Любые масштабы по X, Y и Z применяются к геометрическим объектам относительно к их WCS координатам осей. Это делает возможным ориентировать желаемую версию масштаба для геометрического объекта.
 Свойство BlockTransform вернет матрицу, которая представляет преобразование системы координат (включая масштабирование), описанное выше.
 В классы, производные от BlockReference, не могут добавляться атрибуты.
 Методы
 Конструкторы
 Teigha.GraphicsInterface.Drawable
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 Drawable
 Конструктор класса Teigha.GraphicsInterface.Drawable. (Унаследован от Drawable)
 Teigha.DatabaseServices.DBObject
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 DBObject
 Конструктор. (Унаследован от DBObject)
 Teigha.DatabaseServices.BlockReference
 Имя
 Описание
 BlockReference
 Это обзор перегрузок BlockReference.
 Деструкторы
 Teigha.DatabaseServices.BlockReference
 ПоказатьProtected
 Нет совпадений по текущему фильтру
 Имя
 Описание
 ~BlockReference
 This is ~BlockReference, a member of class BlockReference.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.GraphicsInterface.Drawable
 Имя
 Описание
 Drawable Методы
 Ниже перечислены методы класса Drawable.
 Drawable Свойства
 Ниже перечислены свойства класса Drawable.
 Teigha.DatabaseServices.DBObject
 Имя
 Описание
 DBObject Методы
 Ниже перечислены методы класса DBObject.
 DBObject Свойства
 Ниже перечислены свойства класса DBObject.
 DBObject События
 Ниже перечислены события класса DBObject.
 Teigha.DatabaseServices.Entity
 Имя
 Описание
 Entity Методы
 Ниже перечислены методы класса Entity.
 Entity Свойства
 Ниже перечислены свойства класса Entity.
 Teigha.DatabaseServices.BlockReference
 Имя
 Описание
 BlockReference Данные
 Ниже перечислены данные класса BlockReference.
 BlockReference Методы
 Ниже перечислены методы класса BlockReference.
 BlockReference Свойства
 Ниже перечислены свойства класса BlockReference.
 Ссылки
 BlockReference Конструктор, BlockReference Данные, BlockReference Методы, BlockReference Свойства, Методы, Топики, BlockReference Данные, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства, DBObject События
 Ваши комментарии по поводу этого топика: Послать отзыв!