Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.TypedValue.ToString
 Послать отзыв
 Метод предназначен для получения строкового представления данного объекта с учетом заданных региональных и языковых настроек.
 Синтаксис
C#
Visual Basic
Копировать Код
public String ToString( ref IFormatProvider provider );
Копировать Код
Public Function ToString( ByRef provider As IFormatProvider ) As String
 Параметры
 Параметры
 Описание
 provider
 Поставщик языковых и региональных настроек. Тип IFormatProvider.
 Возвращает
 Возвращает представление данного объекта в виде строки, формат которой определяется указанным провайдером. Тип String.
 Описание
 Метод предназначен для получения строкового представления данного объекта в формате, котрый учитывает языковые и региональные настройки.
 Ссылки
 Teigha.DatabaseServices.TypedValue, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!