Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Spline.ToPolylineWithPrecision
 Послать отзыв
 Метод предназначен для аппроксимации данного сплайна полилинией с настраиваемой точностью.
 Синтаксис
C#
Visual Basic
Копировать Код
public Curve ToPolylineWithPrecision( int precision );
Копировать Код
Public Function ToPolylineWithPrecision( precision As Integer ) As Curve
 Параметры
 Параметры
 Описание
 precision
 Входная точность для процедуры аппроксимации. Тип int.
 Возвращает
 Возвращает результат аппроксимации сплайна полилинией. Тип Curve.
 Описание
 Метод предназначен для аппроксимации данного сплайна полилинией.
 Аргумент precision позволяет настраивать точность аппроксимации. Предполагается, что точность находится в диапазоне [0..99], но может быть и выше. Если передать отрицательное значение, его модуль будет использован как максимально допустимая точность, вычисляемая внутри метода. Необоснованно высокие значения точности порождают избыточное количество вершин полилинии, что закономерно снижает производительность отрисовки полилинии.
 Ссылки
 Teigha.DatabaseServices.Spline, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!