Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector2d.Negate
 Послать отзыв
 Метод меняет направление данного вектора на противоположное.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector2d Negate();
Копировать Код
Public Function Negate() As Vector2d
 Возвращает
 Возвращает вектор, обратный данному. Тип Vector2d.
 Описание
 Метод преобразует данный объект в вектор с координатами (-x, -y), меняя его направление на противоположное.
 Ссылки
 Teigha.Geometry.Vector2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!