Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.PointOnSurface.GetVDerivative
 Послать отзыв
 Метод переопределяет в данном объекте поверхность и точку поверхности, используя новые параметрические координаты, и вычисляет в указанной точке частную производную заданного порядка в направлении V. В текущей версии этот метод не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public static Vector3d GetVDerivative( int order, ref Surface surface, Point2d point );
Копировать Код
Public Shared Function GetVDerivative( order As Integer, ByRef surface As Surface, point As Point2d ) As Vector3d
 Параметры
 Параметры
 Описание
 order
 Порядок производной (1 или 2). Тип int.
 surface
 Входная поверхность. Тип Surface.
 point
 Входная 2D-точка в пространстве параметров. Тип Point2d. Координата point.x определяет значение параметра точки по оси u, а координата point.y - значение параметра по оси v.
 Возвращает
 Возвращает вектор частной производной порядка order в направлении V. Тип Vector3d.
 Описание
 Метод переопределяет в данном объекте поверхность surface и точку поверхности, используя новые параметрические координаты point, и вычисляет в указанной точке частную производную порядка order в направлении V. В текущей версии этот метод не реализован.
 Ссылки
 Teigha.Geometry.PointOnSurface, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!