Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SegmentType
 Послать отзыв
 Перечисление SegmentType определяет поддерживаемые типы сегментов полилинии.
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdDbPolyline.SegType")] public enum SegmentType { Line = 0, Arc = 1, Coincident = 2, Point = 3, Empty = 4 }
Копировать Код
<Wrapper("OdDbPolyline.SegType")> Public Enum SegmentType Line = 0 Arc = 1 Coincident = 2 Point = 3 Empty = 4 End Enum
 Члены
 Члены
 Описание
 Line
 Значение: 0. Прямолинейный сегмент ненулевой длины.
 Arc
 Значение: 1. Сегмент круглой дуги с ненулевой длиной.
 Coincident
 Значение: 2. Сегмент с ненулевой длиной.
 Point
 Значение: 3. Полилиния, состоящая лишь из одной вершины (точка).
 Empty
 Значение: 4. Полилиния с нулевым количеством вершин (пустая).
 Описание
 Перечисление SegmentType определяет поддерживаемые типы сегментов полилинии.
 Ваши комментарии по поводу этого топика: Послать отзыв!