Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CurveCurveIntersector2d.Set
 Послать отзыв
 Метод позволяет переопределить обе кривые в данном объекте. Точки пересечения вычисляются в пределах указанной точности.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Set( ref Curve2d curve1, ref Curve2d curve2, Geometry.Tolerance tolerance );
Копировать Код
Public Sub Set( ByRef curve1 As Curve2d, ByRef curve2 As Curve2d, tolerance As Geometry.Tolerance )
 Параметры
 Параметры
 Описание
 curve1
 Первая входная кривая. Тип Curve2d.
 curve2
 Вторая входная кривая. Тип Curve2d.
 tolerance
 Входное значение геометрической точности. Тип Geometry.Tolerance.
 Описание
 Метод позволяет переопределить обе кривые в данном объекте. Точки пересечения вычисляются в пределах указанной точности.
 Ссылки
 Teigha.Geometry.CurveCurveIntersector2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!