Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocArrayPathParameters.GetStartOffset
 Послать отзыв
 Метод получает начальный интервал между элементами в массиве по траектории.
 Синтаксис
C#
Visual Basic
Копировать Код
public double GetStartOffset( out String expression, out String evaluatorId );
Копировать Код
Public Function GetStartOffset( ByRef expression As String, ByRef evaluatorId As String ) As Double
 Параметры
 Параметры
 Описание
 expression
 Выражение для параметра. Тип String. Строка может быть пустой.
 evaluatorId
 Строковое представление идентификатора вычислителя. Тип String. Строка может быть пустой.
 Возвращает
 Возвращает начальный интервал между элементами в массиве по траектории. Тип double.
 Описание
 Метод получает начальный интервал между элементами в массиве по траектории. Если для параметра выражение отсутствует, то после выполнения метода строки expression и evaluatorId остаются пустыми.
 Ссылки
 Teigha.DatabaseServices.AssocArrayPathParameters, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!