Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GroundPlaneBackground.GroundPlaneBackground
 Послать отзыв
 Конструктор по умолчанию класса GroundPlaneBackground.
 Синтаксис
C#
Visual Basic
Копировать Код
public GroundPlaneBackground();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса GroundPlaneBackground.
 Ссылки
 Teigha.DatabaseServices.GroundPlaneBackground, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!