Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CellRange.IsBackgroundColorNone
 Послать отзыв
 Свойство позволяет проверить, задан ли цвет фона в ячейках диапазона.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool? IsBackgroundColorNone;
Копировать Код
Public Property IsBackgroundColorNone As Boolean?
 Возвращает
 Возвращает true, если цвет фона не задан. В противном случае возвращает false.
 Описание
 Свойство позволяет проверить, задан ли цвет фона в ячейках диапазона.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.CellRange, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!