Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocArrayRectangularParameters.GetColumnSpacing
 Послать отзыв
 Метод позволяет получить расстояние между столбцами массива.
 Синтаксис
C#
Visual Basic
Копировать Код
public double GetColumnSpacing( out String expression, out String evaluatorId );
Копировать Код
Public Function GetColumnSpacing( ByRef expression As String, ByRef evaluatorId As String ) As Double
 Параметры
 Параметры
 Описание
 expression
 Выражение для параметра. Тип String. Строка может быть пустой.
 evaluatorId
 Строковое представление идентификатора вычислителя. Тип String. Строка может быть пустой.
 Возвращает
 Возвращает расстояние между столбцами массива. Тип double.
 Описание
 Метод позволяет получить расстояние между столбцами массива.
 Если для параметра выражение отсутствует, то после выполнения метода строки expression и evaluatorId остаются пустыми.
 Ссылки
 Teigha.DatabaseServices.AssocArrayRectangularParameters, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!