Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocArrayCommonParameters.LevelSpacing
 Послать отзыв
 Свойство обеспечивает доступ к расстоянию между уровнями ассоциативного массива.
 Синтаксис
C#
Visual Basic
Копировать Код
public double LevelSpacing;
Копировать Код
Public Property LevelSpacing() As Double
 Возвращает
 Возвращает расстояние между уровнями. Тип double.
 Описание
 Свойство обеспечивает доступ к расстоянию между уровнями ассоциативного массива.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.AssocArrayCommonParameters, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!