Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Cylinder.Height
 Послать отзыв
 Свойство Height представляет интервал для высоты данного цилиндра.
 Синтаксис
C#
Visual Basic
Копировать Код
public Interval Height;
Копировать Код
Public Property Height As Interval
 Возвращает
 Возвращает интервал для высоты цилиндра. Тип Interval.
 Описание
 Свойство Height представляет интервал для высоты данного цилиндра.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.Geometry.Cylinder, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!