Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LineWeightConverter
 Послать отзыв
 Класс предназначен для преобразования весов (толщин) линий.
 Иерархия классов
Teigha::DatabaseServices::LineWeightConverter
 Синтаксис
C#
Visual Basic
Копировать Код
public class LineWeightConverter : TypeConverter;
Копировать Код
Public Class LineWeightConverter Inherits TypeConverter
 Описание
 Класс предназначен для преобразования весов (толщин) линий.
 Топики
 Имя
 Описание
 LineWeightConverter Методы
 Ниже перечислены методы класса LineWeightConverter.
 Ссылки
 LineWeightConverter Методы, Топики, LineWeightConverter Методы
 Ваши комментарии по поводу этого топика: Послать отзыв!