Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CoordinateSystem3d.Equals
 Послать отзыв
 Метод предназначен для проверки равенства объектов.
 Синтаксис
C#
Visual Basic
Копировать Код
public sealed override bool Equals( ref Object obj );
Копировать Код
Public NotOverridable Overrides Function Equals( ByRef obj As Object ) As Boolean
 Параметры
 Параметры
 Описание
 obj
 Объект, с которым проверяется равенство. Тип Object.
 Возвращает
 Возвращает true, если переданная система координат obj не является нулевой и имеет те же начальную точку и направляющие векторы осей X, Y и Z. В противном случае возвращает false.
 Описание
 Метод предназначен для проверки равенства объектов.
 Замечания
 Переопределение методов Equals и GetHashCode должно выполняться согласованно с соблюдением общей логики. Если Equals возвращает true, хеш-коды сравниваемых объектов обязаны совпадать. Обратное не гарантируется - совпадение хеш-кодов не всегда означает совпадение объектов вследствие возможных коллизий. Хэш-коды должны формироваться с использованием полей, на которых основано равенство объектов.
 Иногда используется метод Equals() из объекта C++, но поскольку сравниваются указатели, вы по-прежнему можете использовать GetHashCode() из этого класса, в то время как метод Equals() может быть переопределен в производном классе.
 Ссылки
 Teigha.Geometry.CoordinateSystem3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!