Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Scale2d.Y
 Послать отзыв
 Свойство Y представляет масштабный коэффициент по оси Y.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Y;
Копировать Код
Public ReadOnly Property Y As Double
 Возвращает
 Возвращает значение масштабного коэффициента по оси Y. Тип double.
 Описание
 Свойство Y представляет масштабный коэффициент по оси Y.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.Scale2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!