Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.PlanarEntity.ClosestPointToPlanarEntity
 Послать отзыв
 Метод вычисляет точку на данном объекте, которая располагается ближе всего к указанной плоской поверхности, и точку на этой плоской поверхности, которая ближе всего располагается к данному объекту.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d[] ClosestPointToPlanarEntity( ref PlanarEntity otherPlane );
Копировать Код
Public Function ClosestPointToPlanarEntity( ByRef otherPlane As PlanarEntity ) As Point3d()
 Параметры
 Параметры
 Описание
 otherPlane
 Входная плоская поверхность, для которой требуется найти ближайшие точки. Тип PlanarEntity.
 Возвращает
 Возвращает массив из двух точек. Тип Point3d[]. Первый элемент массива соответствует ближайшей точке на плоскости otherPlane, а второй — ближайшей точке на данной плоской поверхности.
 Описание
 Метод вычисляет точку на данном объекте, которая располагается ближе всего к указанной плоской поверхности, и точку на этой плоской поверхности, которая ближе всего располагается к данному объекту. Используется вызов метода PlanarEntity.ClosestPointToPlanarEntity(PlanarEntity otherPlane, Tolerance tolerance) с точностью по умолчанию, равной Tolerance.Global.
 Ссылки
 Teigha.Geometry.PlanarEntity, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!