Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LoftOptionsCheckCurvesOut.AllOpen
 Послать отзыв
 Свойство позволяет проверить, все ли поперечные сечения являются незамкнутыми.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool AllOpen;
Копировать Код
Public ReadOnly Property AllOpen As Boolean
 Возвращает
 Возвращает true, если все поперечные сечения являются незамкнутыми. В противном случае возвращает false.
 Описание
 Свойство позволяет проверить, все ли поперечные сечения являются незамкнутыми.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.LoftOptionsCheckCurvesOut, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!