Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MText.ColumnWidth
 Послать отзыв
 Свойство представляет ширину столбца, которая применяется к каждому столбцу данного объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public double ColumnWidth;
Копировать Код
Public Property ColumnWidth As Double
 Возвращает
 Возвращает ширину текстового столбца. Тип double.
 Описание
 Свойство представляет ширину столбца, которая применяется к каждому столбцу данного объекта.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MText, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!