Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ObjectIdGraph
 Послать отзыв
 Этот класс реализует общие объекты графа.
 Иерархия классов
Teigha::DatabaseServices::Graph Teigha::DatabaseServices::ObjectIdGraph
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdDbObjectIdGraph")] public class ObjectIdGraph : Graph
Копировать Код
<Wrapper("OdDbObjectIdGraph")> Public Class ObjectIdGraph Inherits Graph
 Описание
 Этот класс реализует общие объекты графа.
 Граф состоит из набора узлов, двунаправленно связанных направленными ребрами. Ребро, связанное с узлом, представляется как ссылка на узел на другом конце ребра. Ссылки делятся на входящие и исходящие. Каждой входящей ссылке соответствует исходящая ссылка, и наоборот. Каждый объект GraphNode может иметь любое количество связанных с ним ссылок, что позволяет реализовать граф произвольной структуры.
 Методы
 Конструкторы
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 Graph
 Конструктор класса Graph. Создает новый объект Graph с указанным корневым узлом. (Унаследован от Graph)
 Teigha.DatabaseServices.ObjectIdGraph
 ПоказатьInternal
 Нет совпадений по текущему фильтру
 Имя
 Описание
 ObjectIdGraph
 This is ObjectIdGraph, a member of class ObjectIdGraph.
 Топики
 Имя
 Описание
 Graph Методы
 Ниже перечислены методы класса Graph.
 Graph Свойства
 Ниже перечислены свойства класса Graph.
 Ссылки
 Методы, Топики, Graph Методы, Graph Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!