Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Textsize
 Послать отзыв
 Синтаксис
C#
Visual Basic
public double Textsize;
Public Property Textsize() As Double
 Описание
 Обеспечивает доступ к текущему значению TEXTSIZE для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!