Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.Dimtxt
 Послать отзыв
 Свойство управляет размером размерного текста.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Dimtxt;
Копировать Код
Public Property Dimtxt As Double
 Возвращает
 Возвращает размер текста. Тип double.
 Описание
 Свойство задает или возвращает размер размерного текста. Это свойство влияет как на высоту, так и на ширину размерного текста и используется в качестве масштабного коэффициента для межсимвольного интервала.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!