Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector2d.*
 Послать отзыв
 Оператор реализует умножение 2D-вектора на скалярный множитель.
 Синтаксис
C#
Visual Basic
Копировать Код
public static Vector2d Vector2d *( Vector2d a, double factor );
Копировать Код
Public Shared Operator *( a As Vector2d, factor As Double ) As Vector2d
 Параметры
 Параметры
 Описание
 a
 Левый операнд. Тип Vector2d.
 factor
 Правый операнд. Тип double.
 Возвращает
 Возвращает результат умножения 2D-вектора a на скалярный множитель factor. Тип Vector2d.
 Описание
 Оператор реализует умножение 2D-вектора a на скалярный множитель factor.
 Ссылки
 Teigha.Geometry.Vector2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!