Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SubentRef.Entity
 Послать отзыв
 Свойство Entity представляет идентификатор составного объекта, в который входит подобъект, представленный данной ссылкой SubentRef.
 Синтаксис
C#
Visual Basic
Копировать Код
public CompoundObjectId Entity;
Копировать Код
Public Property Entity() As CompoundObjectId
 Возвращает
 Возвращает идентификатор составного объекта. Тип CompoundObjectId.
 Описание
 Свойство Entity представляет идентификатор составного объекта, в который входит подобъект, представленный данной ссылкой SubentRef.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.SubentRef, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!