Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.HighlightOverrule
 Послать отзыв
 Этот класс переопределяет подмножество операций подсвечивания, определенных для объекта чертежа. Он является базовым классом для настройки поведения классов, производных от класса Entity. Каждая реализация по умолчанию вызывает соответствующий метод целевого класса.
 Иерархия классов
Teigha::DatabaseServices::HighlightOverrule
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdDbHighlightOverrule")] public class HighlightOverrule : Overrule;
Копировать Код
<Wrapper("OdDbHighlightOverrule")> Public Class HighlightOverrule Inherits Overrule
 Описание
 Этот класс переопределяет подмножество операций подсвечивания, определенных для объекта чертежа. Он является базовым классом для настройки поведения классов, производных от класса Entity. Каждая реализация по умолчанию вызывает соответствующий метод целевого класса.
 Топики
 Имя
 Описание
 HighlightOverrule Методы
 Ниже перечислены методы класса HighlightOverrule.
 Ссылки
 HighlightOverrule Методы, Топики, HighlightOverrule Методы
 Ваши комментарии по поводу этого топика: Послать отзыв!