Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ObjectTypeAttribute
 Послать отзыв
 Этот класс сообщает тип объекта.
 Иерархия классов
Teigha::DatabaseServices::ObjectTypeAttribute
 Синтаксис
C#
Visual Basic
Копировать Код
[AttributeUsage(AttributeTargets.Property | AttributeTargets.Field | AttributeTargets.Parameter | AttributeTargets.ReturnValue, AllowMultiple = false, Inherited = true)] public sealed class ObjectTypeAttribute : Attribute
Копировать Код
<AttributeUsage(AttributeTargets.Property Or AttributeTargets.Field Or AttributeTargets.Parameter Or AttributeTargets.ReturnValue, AllowMultiple:=False, Inherited:=True)> Public NotInheritable Class ObjectTypeAttribute Inherits Attribute
 Описание
 Этот класс сообщает тип объекта.
 Методы
 Конструкторы
 Имя
 Описание
 ObjectTypeAttribute
 Конструктор класса ObjectTypeAttribute.
 Топики
 Имя
 Описание
 ObjectTypeAttribute Свойства
 Ниже перечислены свойства класса ObjectTypeAttribute.
 Ссылки
 ObjectTypeAttribute Свойства, Методы, Топики, ObjectTypeAttribute Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!