Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MTextFragment.Bold
 Послать отзыв
 Свойство позволяет проверить, представлен ли текст полужирным шрифтом.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool Bold;
Копировать Код
Public ReadOnly Property Bold As Boolean
 Возвращает
 Возвращает true, если текст представлен полужирным шрифтом. В противном случае возвращает false.
 Описание
 Свойство позволяет проверить, представлен ли текст полужирным шрифтом.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.MTextFragment, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!