Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Cone
 Послать отзыв
 Класс Cone представляет ограниченный прямой круговой конус.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Geometry::Entity3d Teigha::Geometry::Surface Teigha::Geometry::Cone
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdGeCone")] public sealed class Cone : Surface
Копировать Код
<Wrapper("OdGeCone")> Public NotInheritable Class Cone Inherits Surface
 Описание
 Класс Cone представляет ограниченный прямой круговой конус.
 Методы
 Конструкторы
 Teigha.Geometry.Cone
 Имя
 Описание
 Cone
 Это обзор перегрузок Cone.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Geometry.Entity3d
 Имя
 Описание
 Entity3d Методы
 Ниже перечислены методы класса Entity3d.
 Teigha.Geometry.Surface
 Имя
 Описание
 Surface Методы
 Ниже перечислены методы класса Surface.
 Surface Свойства
 Ниже перечислены свойства класса Surface.
 Teigha.Geometry.Cone
 Имя
 Описание
 Cone Методы
 Ниже перечислены методы класса Cone.
 Cone Свойства
 Ниже перечислены свойства класса Cone.
 Ссылки
 Cone Конструктор, Cone Методы, Cone Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!