Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ProxyResurrectionCompletedEventArgs.Ids
 Послать отзыв
 Свойство Ids представляет идентификаторы восстанавливаемых объектов.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectIdCollection Ids;
Копировать Код
Public ReadOnly Property Ids As ObjectIdCollection
 Возвращает
 Возвращает коллекцию идентификаторов объектов. Тип ObjectIdCollection.
 Описание
 Свойство Ids представляет идентификаторы восстанавливаемых объектов.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.ProxyResurrectionCompletedEventArgs, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!