Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GripData.OnHotGrip
 Послать отзыв
 Метод предназначен для обработки события, когда ручка становится активной (выделенной).
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual ReturnValue OnHotGrip( ObjectId entityId, Context contextFlags );
Копировать Код
Public Overridable Function OnHotGrip( entityId As ObjectId, contextFlags As Context ) As ReturnValue
 Параметры
 Параметры
 Описание
 entityId
 Идентификатор объекта чертежа. Тип ObjectId.
 contextFlags
 Флаги контекста ручки. Перечисление Context.
 Возвращает
 Возвращает результат выполнения операции. Перечисление GripData.ReturnValue.
 Описание
 Метод предназначен для обработки события, когда ручка становится активной (выделенной).
 Ссылки
 Teigha.DatabaseServices.GripData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!