Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Ole2Frame.HimetricHeight
 Послать отзыв
 Свойство представляет высоту окна в единицах измерения, не зависящих от разрешения устройства вывода. Не используется, в будущих релизах будет удалено или переименовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public short HimetricHeight;
Копировать Код
Public ReadOnly Property HimetricHeight As Short
 Возвращает
 Возвращает высоту окна. Тип short.
 Описание
 Свойство представляет высоту окна в единицах измерения, не зависящих от разрешения устройства вывода. Не используется и в будущих релизах будет удалено или переименовано.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Ole2Frame, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!