Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Curve.GetProjectedCurve
 Послать отзыв
 Метод создает новую кривую Curve как результат проецирования кривой вдоль заданного направления projectionDirection на заданную плоскость planeToProjectOn.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual Curve GetProjectedCurve( ref Plane planeToProjectOn, Vector3d projectionDirection );
Копировать Код
Public virtual Function GetProjectedCurve( ByRef planeToProjectOn As Plane, projectionDirection As Vector3d ) As Curve
 Параметры
 Параметры
 Описание
 planeToProjectOn
 Заданная плоскость (тип Plane) для проецирования кривой.
 projectionDirection
 Заданное направление (тип Vector3d), вдоль которого кривая проецируется на плоскость planeToProjectOn.
 Возвращает
 Экземпляр класса Curve, представляющий спроецированную кривую.
 Описание
 Метод GetProjectedCurve создает новый экземпляр класса Curve как результат проецирования кривой вдоль заданного направления projectionDirection на заданную плоскость planeToProjectOn.
 Ссылки
 Teigha.DatabaseServices.Curve, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!