Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Maxactvp
 Послать отзыв
 Синтаксис
C#
Visual Basic
public int Maxactvp;
Public Property Maxactvp() As Integer
 Описание
 Возвращает или устанавливает текущее значение MAXACTVP для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!