Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Dimalttz
 Послать отзыв
 Синтаксис
C#
Visual Basic
public int Dimalttz;
Public Property Dimalttz() As Integer
 Описание
 Возвращает или устанавливает текущее значение DIMALTTZ для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!