Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SubDMesh.GetSubentPath
 Послать отзыв
 Метод извлекает все пути к подобъектам, используя заданные индекс и тип подобъекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public FullSubentityPath[] GetSubentPath( int index, SubentityType type );
Копировать Код
Public Function GetSubentPath( index As Integer, type As SubentityType ) As FullSubentityPath()
 Параметры
 Параметры
 Описание
 index
 Индекс подобъекта. Тип int. Если он равен -1, то все подобъекты указанного типа возвращаются в виде массива.
 type
 Тип заданного подобъекта. Тип SubentityType.
 Возвращает
 Возвращает массив полных путей подобъектов. Тип FullSubentityPath[].
 Описание
 Метод извлекает все пути к подобъектам, используя заданные индекс и тип подобъекта.
 Ссылки
 Teigha.DatabaseServices.SubDMesh, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!