Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 DimStyleTableRecord.Dimsah
 Послать отзыв
 Свойство предназначено для контроля генерации отдельных окончаний размерных линий.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual bool Dimsah { get; set; }
Копировать Код
Public Overridable Property Dimsah As Boolean
 Возвращает
 Возвращает тип данных bool.
 Описание
 В свойстве хранится настройка генерации отдельных окончаний размерных линий. Значение свойства связано со значением одноименной системной переменной DIMSAH, в которой хранится текущая настройка генерации отдельных окончаний размерных линий.
 Возможны следующие значения:
false – по Dimblk (по умолчанию). Для генерации обоих окончаний размерных линий линейных размеров берется значение свойства Dimblk, то есть оба окончания всегда будут одинаковыми;
true – по Dimblk1 и Dimblk2. Для генерации первого окончания размерной линии линейных размеров берется значение свойства Dimblk1, для генерации второго окончания размерной линии линейных размеров берется значение свойства Dimblk2, то есть вид окончаний может быть разным.
  При изменении системной переменной DIMSAH будет создан новый размерный стиль под названием <переопределение> на основе текущего с новым значением DIMSAH.
 Условия
 Чтение и запись.
 Пример
 Пример изменения настройки генерации отдельных окончаний размерных линий (значения свойства Dimsah) в размерном стиле Standard:
C#
 Копировать Код
public partial class Commands { [Teigha.Runtime.CommandMethod("DimsahChange")] public void DimsahStandardDimStyle() { // Получение ссылки на активный документ HostMgd.ApplicationServices.Document doc = HostMgd.ApplicationServices.Application.DocumentManager.MdiActiveDocument; // Получение ссылки на редактор документа HostMgd.EditorInput.Editor ed = doc.Editor; // Получение ссылки на базу данных документа Teigha.DatabaseServices.Database db = doc.Database; // Начало транзакции с базой данных документа using (Teigha.DatabaseServices.Transaction trans = db.TransactionManager.StartTransaction()) { // Открываем таблицу размерных стилей для чтения Teigha.DatabaseServices.DimStyleTable dimStyleTable = trans.GetObject(db.DimStyleTableId, Teigha.DatabaseServices.OpenMode.ForRead) as Teigha.DatabaseServices.DimStyleTable; // Находим в таблице размерных стилей ObjectId нужного стиля по его названию Teigha.DatabaseServices.ObjectId styleId = dimStyleTable["Standard"]; // Открываем таблицу размерного стиля для изменений Teigha.DatabaseServices.DimStyleTableRecord obj = trans.GetObject(styleId, Teigha.DatabaseServices.OpenMode.ForWrite) as Teigha.DatabaseServices.DimStyleTableRecord; ed.WriteMessage($"nDimsah before: {obj.Dimsah}"); // Изменяем значение свойства obj.Dimsah = true; ed.WriteMessage($"nDimsah after: {obj.Dimsah}"); trans.Commit(); } } }
 Результат работы команды DimsahChange:
 Ссылки
 Teigha.DatabaseServices.DimStyleTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!