Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeader.BlockPosition
 Послать отзыв
 Свойство представляет точку вставки блока, на который ссылается данный объект MLeader.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d BlockPosition;
Копировать Код
Public Property BlockPosition As Point3d
 Возвращает
 Возвращает точку вставки блока. Тип Point3d.
 Описание
 Свойство представляет точку вставки блока, на который ссылается данный объект MLeader.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MLeader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!