Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.TextStyle
 Послать отзыв
 Метод позволяет для строки указанного типа получить ObjectId текстового стиля, на который в данный момент ссылается объект Table.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual DatabaseServices.ObjectId TextStyle( DatabaseServices.RowType type );
Копировать Код
Public virtual Function TextStyle( type As DatabaseServices.RowType ) As DatabaseServices.ObjectId
 Параметры
 Параметры
 Описание
 type
 Тип строки в таблице из перечисления RowType.
 Возвращает
 Возвращает идентификатор текстового стиля. Тип DatabaseServices.ObjectId.
 Описание
 Метод позволяет для строки указанного типа получить ObjectId текстового стиля, на который в данный момент ссылается объект Table.
 Возможные значения типа строки: DataRow, TitleRow и HeaderRow из перечисления RowType. Если тип строки не указан, используется значение по умолчанию DataRow.
 Замечания
 Для получения того же результата предпочтительнее использовать функционал объекта Cell.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!