Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.GetNumberOfContents
 Послать отзыв
 Метод позволяет определить количество элементов содержимого в указанной ячейке.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual int GetNumberOfContents( int row, int column );
Копировать Код
Public virtual Function GetNumberOfContents( row As Integer, column As Integer ) As Integer
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 col
 Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
 Возвращает
 Возвращает количество элементов содержимого в ячейке. Тип int.
 Описание
 Метод позволяет определить количество элементов содержимого в указанной ячейке. Ячейка задается индексами строки и столбца.
 Замечания
 Для получения того же результата предпочтительнее использовать свойство Table.Cells[row,column].Contents.Count.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!