Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DataTable.RemoveColumnAt
 Послать отзыв
 Метод предназначен для удаления столбца с указанным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public void RemoveColumnAt( int index );
Копировать Код
Public Sub RemoveColumnAt( index As Integer )
 Параметры
 Параметры
 Описание
 index
 Индекс удаляемого столбца. Тип int. В случае недействительного индекса метод выбрасывает исключение Teigha.Runtime.ErrorStatus.eInvalidInput.
 Описание
 Метод предназначен для удаления столбца с указанным индексом.
 Ссылки
 Teigha.DatabaseServices.DataTable, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!