Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Interval.IsDisjoint
 Послать отзыв
 Метод позволяет убедиться, что в пределах заданной точности данный интервал не пересекается с указанным интервалом.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsDisjoint( ref Interval otherInterval );
Копировать Код
Public Function IsDisjoint( ByRef otherInterval As Interval ) As Boolean
 Параметры
 Параметры
 Описание
 otherInterval
 Проверяемый интервал. Тип Interval.
 Возвращает
 Возвращает true, если данный интервал не пересекается с интервалом otherInterval. В противном случае возвращает false.
 Описание
 Метод позволяет убедиться, что в пределах заданной точности данный интервал не пересекается с интервалом otherInterval.
 Ссылки
 Teigha.Geometry.Interval, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!