Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.LineSegment2d.LineSegment2d
 Послать отзыв
 Конструктор класса LineSegment2d. Строит линейный сегмент с концами в указанных точках.
 Синтаксис
C#
Visual Basic
Копировать Код
public LineSegment2d( Point2d point1, Point2d point2 );
Копировать Код
Public Sub New( point1 As Point2d, point2 As Point2d )
 Параметры
 Параметры
 Описание
 point1
 Первая входная точка (начальная). Тип Point2d.
 point2
 Вторая входная точка (конечная). Тип Point2d.
 Описание
 Конструктор класса LineSegment2d. Строит линейный сегмент с концами в точках point1 и point2.
 Ссылки
 Teigha.Geometry.LineSegment2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!