Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DynamicBlockReferenceProperty.PropertyName
 Послать отзыв
 Свойство PropertyName представляет имя данного свойства динамического блока.
 Синтаксис
C#
Visual Basic
Копировать Код
public String PropertyName;
Копировать Код
Public ReadOnly Property PropertyName As String
 Возвращает
 Возвращает имя свойства динамического блока. Тип String.
 Описание
 Свойство PropertyName представляет имя данного свойства динамического блока. Имена всех свойств в конкретном вхождении блока уникальны.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.DynamicBlockReferenceProperty, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!