Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Entity.GetSubentity(FullSubentityPath)
 Послать отзыв
 Метод предназначен для получения геометрического подобъекта по указанному пути FullSubentityPath.
 Синтаксис
C#
Visual Basic
Копировать Код
public Entity GetSubentity(FullSubentityPath id);
Копировать Код
public Entity GetSubentity(FullSubentityPath id);
 Параметры
 Параметры
 Описание
 id
 Путь к геометрическому подобъекту. Тип FullSubentityPath
 Возвращает
 Метод возвращает геометрический подобъект. Тип Entity
 Описание
 Метод предоставляет доступ к геометрическому подобъекту по указанному пути FullSubentityPath. Используется для получения конкретной части сложного объекта, например, ребра в полиголинии или поверхности в 3D-модели.
 Ссылки
 Teigha.DatabaseServices.Entity, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!