Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AbstractViewPE.EyeToWorld
 Послать отзыв
 Свойство EyeToWorld представляет геометрическое преобразование из системы координат камеры в мировую систему координат.
 Синтаксис
C#
Visual Basic
Копировать Код
public Matrix3d EyeToWorld;
Копировать Код
Public ReadOnly Property EyeToWorld As Matrix3d
 Возвращает
 Возвращает матрицу трехмерного геометрического преобразования. Тип Matrix3d.
 Описание
 Свойство EyeToWorld представляет геометрическое преобразование из системы координат камеры в мировую систему координат (WCS).
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.AbstractViewPE, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!