Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Hatch.PatternDouble
 Послать отзыв
 Синтаксис
C#
Visual Basic
public bool PatternDouble;
Public Property PatternDouble() As bool
 Описание
 Обеспечивает доступ к значению признака двойного образца для объекта заливки.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Hatch, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!