Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DataLinkManager.AddDataLink
 Послать отзыв
 Добавляет в данный менеджер указанный объект внешней ссылки.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectId AddDataLink( ref DataLink dataLink );
Копировать Код
Public Function AddDataLink( ByRef dataLink As DataLink ) As ObjectId
 Параметры
 Параметры
 Описание
 dataLink
 Добавляемый объект внешней ссылки. Тип DataLink.
 Возвращает
 Возвращает идентификатор внешней ссылки. Тип ObjectId.
 Описание
 Добавляет в данный менеджер указанный объект внешней ссылки.
 Ссылки
 Teigha.DatabaseServices.DataLinkManager, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!