Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Solid3d.Area
 Послать отзыв
 Свойство Area представляет площадь данного твердого тела.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual double Area;
Копировать Код
Public Overridable ReadOnly Property Area As Double
 Возвращает
 Возвращает площадь поверхности твердого тела. Тип double.
 Описание
 Свойство Area представляет площадь данного твердого тела.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Solid3d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!