Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DxfFiler.WriteName
 Послать отзыв
 Метод записывает в данный объект Filer указанное имя в виде текстовой строки.
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract void WriteName( DxfCode opCode, String value );
Копировать Код
Public MustOverride Sub WriteName( opCode As DxfCode, value As String )
 Параметры
 Параметры
 Описание
 opCode
 Групповой код DXF. Тип DxfCode.
 value
 Значение, которое следует записать. Тип String.
 Описание
 Метод записывает в данный объект Filer указанные групповой код DXF и имя в виде текстовой строки.
 Ссылки
 Teigha.DatabaseServices.DxfFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!