Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GradientColor
 Послать отзыв
 Этот класс является контейнером для градиентных цветов, используемых объектом Hatch.
 Иерархия классов
Teigha::DatabaseServices::GradientColor
 Синтаксис
C#
Visual Basic
Копировать Код
[StructLayout(LayoutKind.Sequential)] public class GradientColor;
Копировать Код
<StructLayout(LayoutKind.Sequential)> Public Class GradientColor
 Описание
 Этот класс является контейнером для градиентных цветов, используемых объектом Hatch.
 Методы
 Конструкторы
 Имя
 Описание
 GradientColor
 Это обзор перегрузок GradientColor.
 Топики
 Имя
 Описание
 GradientColor Свойства
 Ниже перечислены свойства класса GradientColor.
 Ссылки
 GradientColor Конструктор, GradientColor Свойства, Методы, Топики, GradientColor Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!