Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeader.ConnectionPoint
 Послать отзыв
 Метод возвращает точку присоединения линии выноски в заданном направлении с учетом ориентации полки.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d ConnectionPoint( Vector3d direction, TextAttachmentDirection attachDirection );
Копировать Код
Public Function ConnectionPoint( direction As Vector3d, attachDirection As TextAttachmentDirection ) As Point3d
 Параметры
 Параметры
 Описание
 direction
 Направление для искомой точки. Тип Vector3d.
 attachDirection
 Ориентация полки. Перечисление TextAttachmentDirection.
 Возвращает
 Возвращает точку присоединения. Тип Point3d.
 Описание
 Метод возвращает точку присоединения линии выноски в заданном направлении с учетом ориентации полки.
 Ссылки
 Teigha.DatabaseServices.MLeader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!