Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Database.ApplyPartialOpenFilters
 Послать отзыв
 Синтаксис
C#
Visual Basic
public void ApplyPartialOpenFilters(ref Filters::SpatialFilter spatialFilter, ref Filters::LayerFilter layerFilter);
Public Sub ApplyPartialOpenFilters(ByRef spatialFilter As Filters.SpatialFilter, ByRef layerFilter As Filters.LayerFilter)
 Параметры
 Параметры
 Описание
 spatialFilter
 Определяет том пространства модели, который используется для пространственного фильтра
 layerFilter
 Определяет слои, используемые для фильтрации
 Описание
 Эта функция может быть вызвана в базе данных с тем, чтобы отфильтровать геометрические объекты пространства модели, чтобы только часть чертежа располагалась в памяти.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!