Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SweepOptions.CheckIntersections
 Послать отзыв
 Свойство CheckIntersections позволяет определить состояние опции проверки самопересечения.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool CheckIntersections;
Копировать Код
Public ReadOnly Property CheckIntersections As Boolean
 Возвращает
 Возвращает true, если проверка самопересечений включена. В противном случае возвращает false.
 Описание
 Свойство CheckIntersections позволяет определить состояние опции проверки самопересечения. Если эта опция отключена, может быть создана поверхность или твердое тело с самопересечениями.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.SweepOptions, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!