Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 ViewportTableRecord.IsometricSnapEnabled
 Послать отзыв
 Свойство предназначено для включения/отключения режима изометрической привязки.
 Синтаксис
C#
Visual Basic
public bool IsometricSnapEnabled;
Public Property IsometricSnapEnabled() As bool
 Возвращает
 Возвращает тип данных bool:
true – ортогональная шаговая привязка;
false – изометрическая шаговая привязка.
 Описание
 Свойство предназначено для включения/отключения режима изометрической шаговой привязки. При включении режима изометрической шаговой привязки активируется режим изометрического черчения и курсор начинает перемещаться по углам изометрической сетки. В интерфейсе свойство настраивается через диалоговое окно «Режимы черчения» для каждого видового экрана отдельно. Окно «Режимы черчения» можно открыть либо командой DDRMODES, DDSETTINGS, либо через меню Сервис -> Режимы черчения…
 Также свойство можно настроить с помощью системной переменной SNAPSTYL.
 Условия
 Чтение и запись.
 Ссылки
 ViewportTableRecord Класс, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!