Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 BlockTableRecord.Units
 Послать отзыв
 Свойство предназначено для хранения единицы измерения.
 Синтаксис
C#
Visual Basic
Копировать Код
public UnitsValue Units { get; set; }
Копировать Код
Public Property Units As UnitsValue
 Возвращает
 Тип данных UnitsValue.
 Описание
 Свойство хранит в себе единицу измерения блока – одно из значений перечисления UnitsValue.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.BlockTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!