Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Light.WebFile
 Послать отзыв
 Свойство представляет полный путь к файлу световой сетки с гониометрическими данными источника света (файл IES).
 Синтаксис
C#
Visual Basic
Копировать Код
public String WebFile;
Копировать Код
Public Property WebFile As String
 Возвращает
 Возвращает полный путь к файлу световой сетки. Тип String.
 Описание
 Свойство представляет полный путь к файлу световой сетки, в котором хранятся гониометрические данные источника света (файл IES).
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Light, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!