Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.XrefPreXrefLockFileEventArgs.btrId
 Послать отзыв
 Свойство btrId представляет идентификатор объекта записи таблицы блоков.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectId btrId;
Копировать Код
Public ReadOnly Property btrId As ObjectId
 Возвращает
 Возвращает идентификатор объекта записи таблицы блоков. Тип ObjectId.
 Описание
 Свойство btrId представляет идентификатор объекта записи таблицы блоков.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.XrefPreXrefLockFileEventArgs, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!