Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PolygonMesh.MSurfaceDensity
 Послать отзыв
 Свойство предоставляет доступ к поверхностной плотности сети в направлении M.
 Синтаксис
C#
Visual Basic
Копировать Код
public short MSurfaceDensity;
Копировать Код
Public Property MSurfaceDensity() As short
 Возвращает
 Возвращает или задает поверхностную плотность сети в направлении M.
 Описание
 Свойство предоставляет доступ к поверхностной плотности сети в направлении M.
 Поверхностная плотность М — это количество вершин в направлении М после выполнения аппроксимации поверхности. Она используется вместо значения размера M, если тип сети PolyMeshType отличается от SimpleMesh.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.PolygonMesh, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!