Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DataLink.GetTargets
 Послать отзыв
 Метод позволяет получить коллекцию идентификаторов резидентных объектов базы данных, которые используют эту ссылку на данные.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectIdCollection GetTargets();
Копировать Код
Public Function GetTargets() As ObjectIdCollection
 Возвращает
 Возвращает коллекцию идентификаторов объектов. Тип ObjectIdCollection.
 Описание
 Метод позволяет получить коллекцию идентификаторов резидентных объектов базы данных, которые используют эту ссылку на данные.
 Ссылки
 Teigha.DatabaseServices.DataLink, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!