Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AnnotationScale.Name
 Послать отзыв
 Доступ к имени масштаба аннотаций. Уникальность таких имен не гарантируется.
 Синтаксис
C#
Visual Basic
Копировать Код
public String Name;
Копировать Код
Public Property Name() As String
 Возвращает
 Возвращает имя масштаба аннотаций. Тип String.
 Описание
 Доступ к имени масштаба аннотаций. Уникальность имен масштабов аннотаций не гарантируется.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.AnnotationScale, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!