Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.RenderEnvironment.FogColor
 Послать отзыв
 Свойство FogColor представляет цвет тумана.
 Синтаксис
C#
Visual Basic
Копировать Код
public Colors.EntityColor FogColor;
Копировать Код
Public Property FogColor() As Colors.EntityColor
 Возвращает
 Возвращает цвет тумана. Тип Colors.EntityColor.
 Описание
 Свойство FogColor представляет цвет тумана.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.RenderEnvironment, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!