Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.PlanarEntity.PointOnPlane
 Послать отзыв
 Свойство PointOnPlane представляет некоторую точку, гарантированно располагающуюся на плоскости данного объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d PointOnPlane;
Копировать Код
Public ReadOnly Property PointOnPlane As Point3d
 Возвращает
 Возвращает некоторую точку, гарантированно лежащую в плоскости данного объекта. Тип Point3d.
 Описание
 Свойство PointOnPlane представляет некоторую точку, гарантированно располагающуюся на плоскости данного объекта.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.PlanarEntity, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!