Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.ExternalBoundedSurface.IsSphere
 Послать отзыв
 Свойство IsSphere позволяет проверить, является ли неограниченная базовая поверхность данного объекта сферой.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsSphere;
Копировать Код
Public ReadOnly Property IsSphere As Boolean
 Возвращает
 Возвращает true, если базовая поверхность данного объекта является сферой. В противном случае возвращает false.
 Описание
 Свойство IsSphere определяет тип неограниченной базовой поверхности данного объекта и возвращает true, если она является сферой.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.ExternalBoundedSurface, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!