Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.BoundaryRepresentation.Element2d
 Послать отзыв
 Класс Element2d — это интерфейсный класс для линейных двумерных элементов первого порядка в сети. Реализован только в среде пространственного моделирования.
 Иерархия классов
Teigha::BoundaryRepresentation::MeshEntity Teigha::BoundaryRepresentation::Element Teigha::BoundaryRepresentation::Element2d
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("AcBrElement2d")] public class Element2d : Element;
Копировать Код
<Wrapper("AcBrElement2d")> Public Class Element2d Inherits Element
 Описание
 Класс Element2d — это интерфейсный класс для линейных двумерных элементов первого порядка в сети. Элемент представляет плоскую аппроксимацию участка ограниченной поверхности и не имеет напрямую связанной геометрии.
 Элемент содержит множество вершин многоугольника (т.е. замкнутого контура), состоящее как минимум из трех копланарных узлов сети (заметим, что координаты этих узлов могут использоваться для создания экземпляра Plane).
 Обратное соответствие с исходной топологией BREP обеспечивается обратным указателем на грань, на основе которой был сгенерирован данный элемент (см. также свойство MeshEntity.EntityAssociated).
 Этот класс определяет функционал, который относится к уровню 2D-элементов сети, и непосредственно использоваться не может, поскольку процедуры инициализации скрыты от пользователя и выполняются во время генерации объекта Mesh2d. Пользователь обычно получает доступ к этому классу через перечислитель элементов сети.
 Единственным способом удалить из кэша данных сети элемент, на который ссылается этот класс, является удаление объекта сети, которому элемент принадлежит. Альтернатива - регенерация сети заново.
 Замечания
 Класс реализован только в среде пространственного моделирования.
 Методы
 Конструкторы
 Teigha.BoundaryRepresentation.Element2d
 Имя
 Описание
 Element2d
 Конструктор по умолчанию класса Element2d.
 Топики
 Имя
 Описание
 MeshEntity Методы
 Ниже перечислены методы класса MeshEntity.
 MeshEntity Свойства
 Ниже перечислены свойства класса MeshEntity.
 Teigha.BoundaryRepresentation.Element2d
 Имя
 Описание
 Element2d Методы
 Ниже перечислены методы класса Element2d.
 Element2d Свойства
 Ниже перечислены свойства класса Element2d.
 Ссылки
 Element2d Методы, Element2d Свойства, Методы, Топики, MeshEntity Методы, MeshEntity Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!