Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.ClearSubSelection
 Послать отзыв
 Метод предназначен для удаления из таблицы подвыборки ячеек.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void ClearSubSelection();
Копировать Код
Public virtual Sub ClearSubSelection()
 Описание
 Метод предназначен для удаления из таблицы подвыборки ячеек.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!