Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.SetMergeAllEnabled
 Послать отзыв
 Метод позволяет задать слияние ячеек в строке или столбце таблицы от первой ячейки до ячейки с указанными индексами строки и столбца .
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetMergeAllEnabled( int row, int column, bool enable );
Копировать Код
Public virtual Sub SetMergeAllEnabled( row As Integer, column As Integer, enable As Boolean )
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 enable
 Флаг слияния всех ячеек, bool.
 col
 Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
 Описание
 Метод позволяет задать слияние ячеек в строке или столбце таблицы от первой ячейки до ячейки с указанными индексами строки и столбца .
 Замечания
 Метод не реализован, возвращает исключение eNotImplemented. Используйте метод Table.Cells[row,column].IsMergeAllEnabled.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!