Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DwgFiler.WritePoint2d
 Послать отзыв
 Метод предназначен для записи заданной двумерной точки Point2d в этот объект Filer.
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract void WritePoint2d( Point2d value );
Копировать Код
Public MustOverride Sub WritePoint2d( value As Point2d )
 Параметры
 Параметры
 Описание
 value
 Записываемое в Filer значение. Тип Point2d.
 Описание
 Метод предназначен для записи заданной двумерной точки Point2d в этот объект Filer.
 Ссылки
 Teigha.DatabaseServices.DwgFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!