Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ResultBufferEnumerator.MoveNext
 Послать отзыв
 Метод предназначен для перехода перечислителя к следующему типизированному значению в результирующем буфере.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool MoveNext();
Копировать Код
Public Function MoveNext() As Boolean
 Возвращает
 Возвращает true, если индекс типизированного значения не вышел за пределы результирующего буфера. В противном случае возвращает false.
 Описание
 Метод предназначен для перехода перечислителя к следующему типизированному значению в результирующем буфере.
 Ссылки
 Teigha.DatabaseServices.ResultBufferEnumerator, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!