Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PolygonMesh.PolygonMesh
 Послать отзыв
 Конструктор по умолчанию.
 Синтаксис
C#
Visual Basic
Копировать Код
public PolygonMesh();
Копировать Код
Public Sub New()
 Описание
 Этот конструктор инициализирует флаг полилинии равным 16 (это означает, что сеть PolygonMesh не замкнута как в направлении M, так и в направлении N).
 Он также присваивает значения 0 для MeshType, для количества вершин в направлении M и в направлении N, поверхностной плотности в направлении M и в направлении N.
 Ссылки
 Teigha.DatabaseServices.PolygonMesh, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!