Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ObjectContextCollection.GetContext
 Послать отзыв
 Метод предназначен для получения копии именованного контекста из коллекции.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual ObjectContext GetContext( ref String contextName );
Копировать Код
Public Overridable Function GetContext( ByRef contextName As String ) As ObjectContext
 Параметры
 Параметры
 Описание
 contextName
 Имя контекста. Тип String.
 Возвращает
 Возвращает копию именованного контекста. Тип ObjectContext. Если контекст с указанным именем в коллекции отсутствует, возвращается nullptr.
 Описание
 Метод предназначен для получения копии именованного контекста из коллекции.
 Ссылки
 Teigha.DatabaseServices.ObjectContextCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!