Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.RadialDimension.RadialDimension
 Послать отзыв
 Конструктор класса RadialDimension. Создает объект радиального размера с указанными параметрами.
 Синтаксис
C#
Visual Basic
Копировать Код
public RadialDimension( Point3d center, Point3d chordPoint, double leaderLength, ref String dimensionText, DatabaseServices.ObjectId dimensionStyle );
Копировать Код
Public Sub New( center As Point3d, chordPoint As Point3d, leaderLength As Double, ByRef dimensionText As String, dimensionStyle As DatabaseServices.ObjectId )
 Параметры
 Параметры
 Описание
 center
 Точка центра измеряемой окружности или дуги. Тип Point3d.
 chordPoint
 Точка хорды на измеряемой окружности или дуге, к которой проводится размерная линия. Тип Point3d.
 leaderLength
 Длина линии выноски (расстояние от точки хорды до линии полки размера). Тип double.
 dimensionText
 Размерный текст для замены текста измеренного значения. Тип String.
 dimensionStyle
 Идентификатор объекта размерного стиля, который используется для отрисовки объекта измерения. Тип DatabaseServices.ObjectId.
 Описание
 Конструктор класса RadialDimension. Создает объект радиального размера с указанными параметрами.
 Ссылки
 Teigha.DatabaseServices.RadialDimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!