Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.KnotCollection.Tolerance
 Послать отзыв
 Свойство Tolerance представляет доступ к точности, которая используется в данной коллекции для проверки узлов на совпадение.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Tolerance;
Копировать Код
Public Property Tolerance As Double
 Возвращает
 Возвращает точность для проверки узлов на совпадение. Тип double.
 Описание
 Свойство Tolerance представляет доступ к точности, которая используется в данной коллекции для проверки узлов на совпадение.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.Geometry.KnotCollection, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!