Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.OffsetCurve3d.Curve
 Послать отзыв
 Свойство Curve представляет базовую кривую данной кривой смещения.
 Синтаксис
C#
Visual Basic
Копировать Код
public Curve3d Curve;
Копировать Код
Public Property Curve As Curve3d
 Возвращает
 Возвращает базовую кривую для данного объекта. Тип Curve3d.
 Описание
 Свойство Curve представляет базовую кривую данной кривой смещения.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.Geometry.OffsetCurve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!