Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CellContentsCollection
 Послать отзыв
 Класс CellContentsCollection представляет коллекцию объектов содержимого ячейки таблицы.
 Иерархия классов
Teigha::DatabaseServices::CellContentsCollection
 Синтаксис
C#
Visual Basic
Копировать Код
[DefaultMember("Item")] public sealed class CellContentsCollection : IEnumerable<CellContent>
Копировать Код
<DefaultMember("Item")> Public NotInheritable Class CellContentsCollection Implements IEnumerable(Of CellContent)
 Описание
 Класс CellContentsCollection представляет коллекцию объектов содержимого ячейки таблицы CellContent.
 Топики
 Имя
 Описание
 CellContentsCollection Методы
 Ниже перечислены методы класса CellContentsCollection.
 CellContentsCollection Свойства
 Ниже перечислены свойства класса CellContentsCollection.
 Ссылки
 CellContentsCollection Методы, CellContentsCollection Свойства, Топики, CellContentsCollection Методы, CellContentsCollection Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!