Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Pinsbase
 Послать отзыв
 Синтаксис
C#
Visual Basic
public Point3d Pinsbase;
Public Property Pinsbase() As Point3d
 Описание
 Возвращает или устанавливает текущее значение INSBASE для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!