Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MentalRayRenderSettings.FGSampleRadiusState
 Послать отзыв
 Свойство FGSampleRadiusState позволяет определить, следует ли использовать заданные пользователем минимальный и максимальный радиусы финальной сборки.
 Синтаксис
C#
Visual Basic
Копировать Код
public MentalRayRenderSettingsTraitsBoolParameter FGSampleRadiusState;
Копировать Код
Public Property FGSampleRadiusState As MentalRayRenderSettingsTraitsBoolParameter
 Возвращает
 Возвращает значение логического параметра в настройках Mental Ray. Тип MentalRayRenderSettingsTraitsBoolParameter.
 Описание
 Свойство FGSampleRadiusState позволяет определить, следует ли использовать заданные пользователем минимальный и максимальный радиусы финальной сборки.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MentalRayRenderSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!