Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Mline.Element
 Послать отзыв
 Метод позволяет найти индекс элемента объекта Mline, который содержит указанную точку.
 Синтаксис
C#
Visual Basic
Копировать Код
public int Element( Point3d pt );
Копировать Код
Public Function Element( pt As Point3d ) As Integer
 Параметры
 Параметры
 Описание
 pt
 Точка, проверяемая на пересечения с элементами мультилинии. Тип Point3d.
 Возвращает
 В случае успеха возвращает индекс элемента мультилинии, который содержит указанную точку pt. Тип int. В противном случае возвращает -1.
 Описание
 Метод позволяет найти элемент объекта Mline, который содержит переданную в метод точку pt.
 Если элемент, на котором точка pt лежит непосредственно, не найден, и объект Mline не является замкнутым, предпринимается попытка проверить, не окажется ли указанная точка на «виртуальных» продолжениях конечных сегментов мультилинии. В случае успеха метод возвращает индекс найденного элемента мультилинии.
 Ссылки
 Teigha.DatabaseServices.Mline, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!