Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.LineSegment2d.GetSegmentLength
 Послать отзыв
 Метод позволяет вычислить длину параметрически заданного отрезка на данном сегменте.
 Синтаксис
C#
Visual Basic
Копировать Код
public double GetSegmentLength( double fromParameter, double toParameter );
Копировать Код
Public Function GetSegmentLength( fromParameter As Double, toParameter As Double ) As Double
 Параметры
 Параметры
 Описание
 fromParameter
 Значение параметра для начальной точки отрезка. Тип double.
 toParameter
 Значение параметра для конечной точки отрезка. Тип double.
 Возвращает
 Возвращает длину отрезка между указанными точками. Тип double.
 Описание
 Метод позволяет вычислить длину отрезка на данном сегменте, концы которого определены указанными значениями параметра. Используется вызов метода LineSegment2d.GetSegmentLength(Double fromParameter, Double toParameter, Tolerance tolerance) с точностью по умолчанию, равной Tolerance.Global.
 Ссылки
 Teigha.Geometry.LineSegment2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!