Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.EllipticalArc2d.MajorRadius
 Послать отзыв
 Свойство MajorRadius предоставляет доступ к значению большого радиуса данной эллиптической дуги.
 Синтаксис
C#
Visual Basic
Копировать Код
public double MajorRadius;
Копировать Код
Public Property MajorRadius As Double
 Возвращает
 Возвращает значение большого радиуса эллиптической дуги. Тип double.
 Описание
 Свойство MajorRadius предоставляет доступ к значению большого радиуса данной эллиптической дуги.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.Geometry.EllipticalArc2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!