Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FeatureControlFrame.TextStyleName
 Послать отзыв
 Свойство TextStyleName представляет имя текстового стиля, который используется данным объектом.
 Синтаксис
C#
Visual Basic
Копировать Код
public String TextStyleName { get; set; }
Копировать Код
Public Property TextStyleName As String
 Возвращает
 Возвращает имя текстового стиля. Тип String.
 Описание
 Свойство TextStyleName представляет имя текстового стиля, который используется данным объектом.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.FeatureControlFrame, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!