Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Элемент данных LinkedTableEnumerator.iCol
 Послать отзыв
 This is iCol, a member of class LinkedTableEnumerator.
 Синтаксис
C#
Visual Basic
private int iCol;
Private iCol As Integer
 Ссылки
 LinkedTableEnumerator Класс, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!