Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Material.Specular
 Послать отзыв
 Свойство представляет компонент зеркального отражения этого материала.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual MaterialSpecularComponent Specular;
Копировать Код
Public Overridable Property Specular As MaterialSpecularComponent
 Возвращает
 Возвращает компонент зеркального отражения материала. Тип MaterialSpecularComponent.
 Описание
 Свойство представляет компонент зеркального отражения этого материала.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Material, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!