Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Filters.FilteredBlockIterator.AddToBuffer
 Послать отзыв
 Метод позволяет добавить указанный идентификатор объекта чертежа в буфер, поддерживаемый итератором индекса.
 Синтаксис
C#
Visual Basic
Копировать Код
public void AddToBuffer( ObjectId id );
Копировать Код
Public Sub AddToBuffer( id As ObjectId )
 Параметры
 Параметры
 Описание
 id
 Идентификатор добавляемого объекта чертежа. Тип ObjectId.
 Описание
 Метод позволяет добавить указанный идентификатор объекта чертежа в буфер, поддерживаемый итератором индекса.
 Ссылки
 Teigha.DatabaseServices.Filters.FilteredBlockIterator, Teigha.DatabaseServices.Filters
 Ваши комментарии по поводу этого топика: Послать отзыв!