Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CompoundObjectId.!=
 Послать отзыв
 Оператор неравенства для объектов CompoundObjectId. Позволяет установить, что входной объект не совпадает с данным.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool operator !=( ref CompoundObjectId other );
Копировать Код
Public Operator !=( ByRef other As CompoundObjectId )
 Параметры
 Параметры
 Описание
 other
 Проверяемый входной объект. Тип CompoundObjectId.
 Возвращает
 Возвращает true, если объекты не совпадают или хотя бы один из них оказался нулевым. В противном случае возвращает false.
 Описание
 Оператор неравенства для объектов CompoundObjectId. Позволяет установить, что входной объект не совпадает с данным.
 Ссылки
 Teigha.DatabaseServices.CompoundObjectId, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!