Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObject.GetObjectSaveVersion(DwgFiler)
 Послать отзыв
 Метод позволяет получить номер версии чертежа и технического обновления.
 Синтаксис
C#
Visual Basic
Копировать Код
public FullDwgVersion GetObjectSaveVersion(DwgFiler filer);
Копировать Код
Public Function GetObjectSaveVersion(filer As DwgFiler) As FullDwgVersion
 Параметры
 Параметры
 Описание
 filer
 Набор данных, используемый для операции с dwg-файлом. Тип DwgFiler
 Возвращает
 Возвращает версию чертежа и технического обновления, в которой должен быть сохранен этот объект. Тип FullDwgVersion Реализация этого метода по умолчанию возвращает DwgFiler->DwgVersion.
 Описание
 Чтобы определить, какую версию данного объекта сохранить, необходимо переопределить этот метод. Это не требует обращения к данному методу родительского класса.
 Замечания
 Этот метод может быть переопределен в пользовательских классах. Предупреждение
 Не следует использовать Dwg(Dxf)Filer->Dwg(Dxf)Version() в ваших методах dwg(In/Out) и dxf(In/Out) — это не работает в экземплярах, производных от вашего класса. Вместо этого используйте GetObjectSaveVersion().
 Ссылки
 Teigha.DatabaseServices.DBObject, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!