Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.LineSegment3d.GetBisector
 Послать отзыв
 Метод вычисляет серединный перпендикуляр для данного линейного сегмента.
 Синтаксис
C#
Visual Basic
Копировать Код
public Plane GetBisector();
Копировать Код
Public Function GetBisector() As Plane
 Возвращает
 Возвращает бесконечную прямую, которая представляет собой серединный перпендикуляр для данного линейного сегмента. Тип Plane.
 Описание
 Метод вычисляет серединный перпендикуляр для данного линейного сегмента.
 Ссылки
 Teigha.Geometry.LineSegment3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!