Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbCurve2d.SetFitTangents
 Послать отзыв
 Метод позволяет переопределить направления касательных на концах сплайна.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool SetFitTangents( Vector2d startTangent, Vector2d endTangent );
Копировать Код
Public Function SetFitTangents( startTangent As Vector2d, endTangent As Vector2d ) As Boolean
 Параметры
 Параметры
 Описание
 startTangent
 Направление касательной в начальной точке сплайна. Тип Vector2d.
 endTangent
 Направление касательной в конечной точке сплайна. Тип Vector2d.
 Возвращает
 Возвращает true, если перевычисление сплайна с новыми касательными завершилось успешно. В противном случае возвращает false.
 Описание
 Метод позволяет переопределить направления касательных на концах сплайна.
 Ссылки
 Teigha.Geometry.NurbCurve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!