Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Sun.DateTime
 Послать отзыв
 Свойство DateTime представляет дату и время, используемые для калькулятора солнечных углов.
 Синтаксис
C#
Visual Basic
Копировать Код
public System.DateTime DateTime;
Копировать Код
Public Property DateTime As System.DateTime
 Возвращает
 Возвращает дату и время. Тип System.DateTime.
 Описание
 Свойство DateTime представляет дату и время, используемые для калькулятора солнечных углов.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Sun, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!