Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LayerViewportProperties.Color
 Послать отзыв
 Свойство представляет цвет слоя.
 Синтаксис
C#
Visual Basic
Копировать Код
public Colors.Color Color;
Копировать Код
Public Property Color As Colors.Color
 Возвращает
 Возвращает цвет слоя. Тип Teigha.Colors.Color.
 Описание
 Свойство представляет цвет слоя.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.LayerViewportProperties, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!