Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Point2d.Add
 Послать отзыв
 Метод формирует новую точку, которая получена трансляцией данной точки на заданный 2D-вектор.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point2d Add( Vector2d value );
Копировать Код
Public Function Add( value As Vector2d ) As Point2d
 Параметры
 Параметры
 Описание
 value
 Входной вектор. Тип Vector2d.
 Возвращает
 Возвращает точку Point2d.
 Описание
 Метод формирует новую точку, которая получена трансляцией данной 2D-точки на заданный 2D-вектор value.
 Ссылки
 Teigha.Geometry.Point2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!