Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CompoundObjectId.Set
 Послать отзыв
 Метод позволяет задать этот CompoundObjectId, используя входной идентификатор составного объекта CompoundObjectId и пути вхождений BlockReference в указанной базе данных.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Set( ObjectId id, ref ObjectIdCollection path, ref Database hostDatabase );
Копировать Код
Public Sub Set( id As ObjectId, ByRef path As ObjectIdCollection, ByRef hostDatabase As Database )
 Параметры
 Параметры
 Описание
 id
 Входной идентификатор объекта. Тип ObjectId.
 path
 Путь вхождений BlockRefrence, ведущий к входному объекту. Тип ObjectIdCollection.
 hostDatabase
 Входная база данных, которой принадлежит входной объект. Тип Database.
 Описание
 Метод позволяет задать этот CompoundObjectId, используя входной идентификатор составного объекта CompoundObjectId и пути вхождений BlockReference в указанной базе данных.
 Ссылки
 Teigha.DatabaseServices.CompoundObjectId, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!