Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.BulgeVertexCollection.Remove
 Послать отзыв
 Метод удаляет из коллекции элемент, соответствующий указанному объекту BulgeVertex.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Remove( ref BulgeVertex value );
Копировать Код
Public Sub Remove( ByRef value As BulgeVertex )
 Параметры
 Параметры
 Описание
 value
 Объект типа BulgeVertex, который должен быть удален из коллекции.
 Описание
 Метод удаляет из коллекции элемент, соответствующий указанному объекту value типа BulgeVertex. Если такой объект в коллекции отсутствует, метод завершает работу, ничего не предпринимая.
 Ссылки
 Teigha.DatabaseServices.BulgeVertexCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!