Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PolygonMesh.ConvertToPolyMeshType
 Послать отзыв
 Метод предназначен для преобразования сети PolygonMesh в заданный тип, используя метод SurfaceFit().
 Синтаксис
C#
Visual Basic
Копировать Код
public void ConvertToPolyMeshType( PolyMeshType newVal );
Копировать Код
Public Sub ConvertToPolyMeshType( newVal As PolyMeshType )
 Параметры
 Параметры
 Описание
 newVal
 Новый тип сети из перечисления PolyMeshType.
 Описание
 Этот метод использует метод SurfaceFit() для преобразования сети PolygonMesh в тип, заданный аргументом newVal.
 Допустимые значения для newVal:
 Значение
 Описание
 SimpleMesh
 Простая сеть без аппроксимации или сглаживания поверхности.
 QuadSurfaceMesh
 Квадратичная B-сплайновая аппроксимация поверхности.
 CubicSurfaceMesh
 Аппроксимация кубической B-сплайновой поверхностью.
 BezierSurfaceMesh
 Аппроксимация поверхностью Безье.
 Замечания
 Если PolyMeshType равен SimpleMesh, то значения размера сети M и N будут использоваться для задания размеров столбцов и строк вершин. В случае любого другого типа PolyMeshType в качестве размеров строки и столбца будут использоваться значения поверхностной плотности M и N.
 Ссылки
 Teigha.DatabaseServices.PolygonMesh, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!