Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MentalRayRenderSettings.TileSize
 Послать отзыв
 Свойство TileSize представляет размер фрагментов при тайлинге изображения в процессе рендеринга.
 Синтаксис
C#
Visual Basic
Копировать Код
public int TileSize;
Копировать Код
Public Property TileSize As Integer
 Возвращает
 Возвращает размер фрагментов при тайлинге в процессе рендеринга. Тип int.
 Описание
 Свойство TileSize представляет размер фрагментов при тайлинге изображения в процессе рендеринга.
 Малые значения увеличивают длительность рендеринга, но обеспечивают более частые обновления в процессе рендеринга. Значения TileSize должны находиться в диапазоне [4..512].
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MentalRayRenderSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!