Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Light.WebRotation
 Послать отзыв
 Свойство представляет угловые смещения световой сетки, необходимые для ориентирования гониометрических данных относительно текущей ориентации источника света.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d WebRotation;
Копировать Код
Public Property WebRotation As Vector3d
 Возвращает
 Возвращает угловые смещения световой сетки вокруг оптических осей X, Y и Z (в радианах). Тип Vector3d.
 Описание
 Свойство представляет угловые смещения световой сетки вокруг оптических осей X, Y и Z, необходимые для ориентирования гониометрических данных относительно текущей ориентации источника света.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Light, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!