Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Делегат Teigha.DatabaseServices.XrefBeginOperationEventHandler
 Послать отзыв
 This is type Teigha::DatabaseServices::XrefBeginOperationEventHandler.
 Синтаксис
C#
Visual Basic
public delegate XrefBeginOperationEventHandler();
Public Delegate Sub XrefBeginOperationEventHandler()
 Ваши комментарии по поводу этого топика: Послать отзыв!