Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Filters.SpatialFilterDefinition
 Послать отзыв
 Этот класс инкапсулирует данные, необходимые для определения пространственного фильтра SpatialFilter.
 Иерархия классов
Teigha::DatabaseServices::Filters::SpatialFilterDefinition
 Синтаксис
C#
Visual Basic
Копировать Код
[StructLayout(LayoutKind.Sequential)] public class SpatialFilterDefinition;
Копировать Код
<StructLayout(LayoutKind.Sequential)> Public Class SpatialFilterDefinition
 Описание
 Этот класс инкапсулирует данные, необходимые для определения пространственного фильтра SpatialFilter.
 Методы
 Конструкторы
 Имя
 Описание
 SpatialFilterDefinition
 Конструктор класса SpatialFilterDefinition.
 Топики
 Имя
 Описание
 SpatialFilterDefinition Методы
 Ниже перечислены методы класса SpatialFilterDefinition.
 SpatialFilterDefinition Свойства
 Ниже перечислены свойства класса SpatialFilterDefinition.
 Ссылки
 SpatialFilterDefinition Методы, SpatialFilterDefinition Свойства, Методы, Топики, SpatialFilterDefinition Методы, SpatialFilterDefinition Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!