Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Matrix2d.Rotation
 Послать отзыв
 Метод предоставляет матрицу, которая реализует вращение вокруг указанной точки на заданный угол.
 Синтаксис
C#
Visual Basic
Копировать Код
public static Matrix2d Rotation( double angle, Point2d center );
Копировать Код
Public Shared Function Rotation( angle As Double, center As Point2d ) As Matrix2d
 Параметры
 Параметры
 Описание
 angle
 Входное значение угла вращения. Тип double.
 center
 Входные координаты центра вращения. Тип Point2d.
 Возвращает
 Возвращает матрицу преобразования, которая описывает вращение вокруг точки center на угол angle. Тип Matrix2d.
 Описание
 Метод предоставляет матрицу, которая реализует вращение вокруг точки center на угол angle.
 Ссылки
 Teigha.Geometry.Matrix2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!