Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.UnderlayDefinition.UnderlayItem
 Послать отзыв
 Свойство UnderlayItem представляет элемент, на который ссылается эта подложка.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.UnderlayItem UnderlayItem;
Копировать Код
Public ReadOnly Property UnderlayItem As DatabaseServices.UnderlayItem
 Возвращает
 Возвращает элемент, на который ссылается подложка. Тип DatabaseServices.UnderlayItem.
 Описание
 Свойство UnderlayItem представляет элемент, на который ссылается эта подложка.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.UnderlayDefinition, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!