Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.ExternalSurface.Set
 Послать отзыв
 Метод позволяет переопределить параметры данного объекта, используя указатель на определение внешнего объекта и его тип.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Set( IntPtr surfaceDef, ExternalEntityKind surfaceKind );
Копировать Код
Public Sub Set( surfaceDef As IntPtr, surfaceKind As ExternalEntityKind )
 Параметры
 Параметры
 Описание
 surfaceDef
 Указатель на определение внешней поверхности. Тип IntPtr.
 surfaceKind
 Информация о системе, в которой было создано определение внешней поверхности. Перечисление ExternalEntityKind.
 Описание
 Метод позволяет переопределить параметры данного объекта, используя указатель на определение внешнего объекта и его тип. Текущее определение данного объекта удаляется.
 Ссылки
 Teigha.Geometry.ExternalSurface, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!