Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Spline.RemoveFitPointAt
 Послать отзыв
 Метод предназначен для удаления из данного сплайна определяющей точки с указанным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public void RemoveFitPointAt( int index );
Копировать Код
Public Sub RemoveFitPointAt( index As Integer )
 Параметры
 Параметры
 Описание
 index
 Индекс определяющей точки. Тип int.
 Описание
 Метод предназначен для удаления из данного сплайна определяющей точки с указанным индексом.
 Ссылки
 Teigha.DatabaseServices.Spline, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!