Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Wipeout
 Послать отзыв
 Класс Wipeout представляет в базе данных растровые объекты с полигональной границей, которые используются в качестве масок (маскирующих объектов), чтобы перекрывать элементы других объектов на чертеже.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::GraphicsInterface::Drawable Teigha::DatabaseServices::DBObject Teigha::DatabaseServices::Entity Teigha::DatabaseServices::Image Teigha::DatabaseServices::RasterImage Teigha::DatabaseServices::Wipeout
 Синтаксис
C#
Visual Basic
Копировать Код
[TypeDescriptionProvider("Teigha.ComponentModel.TypeDescriptionProvider`1[[Teigha.DatabaseServices.Wipeout, TD_Mgd]], TD_Mgd")] [Wrapper("AcDbWipeout")] public class Wipeout : RasterImage
Копировать Код
<TypeDescriptionProvider("Teigha.ComponentModel.TypeDescriptionProvider`1[[Teigha.DatabaseServices.Wipeout, TD_Mgd]], TD_Mgd")> <Wrapper("AcDbWipeout")> Public Class Wipeout Inherits RasterImage
 Описание
 Класс Wipeout представляет в базе данных растровые объекты с полигональной границей, которые используются в качестве масок (маскирующих объектов) для перекрытия элементов других объектов на чертеже. Чаще всего применяются в качестве фоновой маски для текстовых объектов.
 Методы
 Конструкторы
 Teigha.GraphicsInterface.Drawable
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 Drawable
 Конструктор класса Teigha.GraphicsInterface.Drawable. (Унаследован от Drawable)
 Teigha.DatabaseServices.DBObject
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 DBObject
 Конструктор. (Унаследован от DBObject)
 Teigha.DatabaseServices.RasterImage
 Имя
 Описание
 RasterImage
 Это обзор перегрузок RasterImage.
 Teigha.DatabaseServices.Wipeout
 Имя
 Описание
 Wipeout
 Конструктор по умолчанию класса Wipeout.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.GraphicsInterface.Drawable
 Имя
 Описание
 Drawable Методы
 Ниже перечислены методы класса Drawable.
 Drawable Свойства
 Ниже перечислены свойства класса Drawable.
 Teigha.DatabaseServices.DBObject
 Имя
 Описание
 DBObject Методы
 Ниже перечислены методы класса DBObject.
 DBObject Свойства
 Ниже перечислены свойства класса DBObject.
 DBObject События
 Ниже перечислены события класса DBObject.
 Teigha.DatabaseServices.Entity
 Имя
 Описание
 Entity Методы
 Ниже перечислены методы класса Entity.
 Entity Свойства
 Ниже перечислены свойства класса Entity.
 Teigha.DatabaseServices.RasterImage
 Имя
 Описание
 RasterImage Методы
 Ниже перечислены методы класса RasterImage.
 RasterImage Свойства
 Ниже перечислены свойства класса RasterImage.
 Teigha.DatabaseServices.Wipeout
 Имя
 Описание
 Wipeout Методы
 Ниже перечислены методы класса Wipeout.
 Wipeout Свойства
 Ниже перечислены свойства класса Wipeout.
 Ссылки
 Wipeout Методы, Wipeout Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства, DBObject События
 Ваши комментарии по поводу этого топика: Послать отзыв!