Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Filters.IndexUpdateData.SetIdData
 Послать отзыв
 Метод устарел - используйте метод SetIdData(ObjectId, IntPtr).
 Метод позволяет задать в этом объекте IndexUpdateData указанные данные, связанные с переданным идентификатором объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
[Obsolete("Use SetIdData(NAMESPACE_ACDB.ObjectId id, IntPtr data)")] public void SetIdData( ObjectId id, int data );
Копировать Код
<Obsolete("Use SetIdData(NAMESPACE_ACDB.ObjectId id, IntPtr data)")> Public Sub SetIdData( id As ObjectId, data As Integer )
 Параметры
 Параметры
 Описание
 id
 Входной идентификатор объекта. Тип ObjectId.
 data
 Связанные с идентификатором id данные. Тип int.
 Описание
 Метод устарел - используйте метод SetIdData(ObjectId, IntPtr).
 Метод позволяет задать в этом объекте IndexUpdateData указанные данные, связанные с переданным идентификатором объекта.
 Ссылки
 Teigha.DatabaseServices.Filters.IndexUpdateData, Teigha.DatabaseServices.Filters
 Ваши комментарии по поводу этого топика: Послать отзыв!