Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FileDependencyManager.GetEntry
 Послать отзыв
 Метод предоставляет запись в разделе .dwg списка файловых зависимостей для указанного приложения или функции. Дополнительно метод позволяет влиять на использование кешированных данных.
 Синтаксис
C#
Visual Basic
Копировать Код
public FileDependencyInfo GetEntry( ref String feature, ref String fullFileName, bool useCachedInfo );
Копировать Код
Public Function GetEntry( ByRef feature As String, ByRef fullFileName As String, useCachedInfo As Boolean ) As FileDependencyInfo
 Параметры
 Параметры
 Описание
 feature
 Имя приложения или функции, создавших запись. Тип String.
 fullFileName
 Полное имя файла для искомой записи. Тип String.
 useCachedInfo
 Флаг, который определяет, можно ли использовать кешированную информацию. Тип bool. В случае значения false, используется обновленная информация.
 Возвращает
 Возвращает найденную запись. Тип FileDependencyInfo.
 Описание
 Метод предоставляет запись в разделе .dwg списка файловых зависимостей для указанного приложения или функции. Дополнительно метод позволяет влиять на использование кешированных данных.
 Ссылки
 Teigha.DatabaseServices.FileDependencyManager, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!