Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.MsLtScale
 Послать отзыв
 Синтаксис
C#
Visual Basic
public bool MsLtScale;
Public Property MsLtScale() As bool
 Описание
 Возвращает или устанавливает текущее значение MSLTSCALE для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!