Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ImageBackground.FitToScreen
 Послать отзыв
 Свойство позволяет проверить, должен ли данный фон на основе изображения быть вписанным в экран.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool FitToScreen;
Копировать Код
Public Property FitToScreen As Boolean
 Возвращает
 Возвращает true, если фон должен быть вписан в экран. В противном случае возвращает false.
 Описание
 Свойство позволяет проверить, должен ли данный фон на основе изображения быть вписанным в экран.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.ImageBackground, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!