Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LoftedSurface.PathEntity
 Послать отзыв
 Свойство возвращает объект траектории, вдоль которой выполняется лофт.
 Синтаксис
C#
Visual Basic
Копировать Код
public Entity PathEntity;
Копировать Код
Public ReadOnly Property PathEntity As Entity
 Возвращает
 Возвращает траекторию лофта. Тип Entity.
 Описание
 Свойство возвращает объект траектории, вдоль которой выполняется лофт.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.LoftedSurface, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!