Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector2dCollection.Vector2dCollection
 Послать отзыв
 Конструктор по умолчанию класса Vector2dCollection.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector2dCollection();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса Vector2dCollection. Создает пустую коллекцию с ёмкостью по умолчанию, которая определяется константой Vector2dCollection.DefaultSize.
 Ссылки
 Teigha.Geometry.Vector2dCollection, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!