Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Tdcreate
 Послать отзыв
 Синтаксис
C#
Visual Basic
public DateTime Tdcreate;
Public Property Tdcreate() As DateTime
 Описание
 Обеспечивает доступ к текущему значению TDCREATE для базы данных.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!