Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FaceRecord.MakeEdgeInvisibleAt
 Послать отзыв
 Метод позволяет сделать невидимым ребро с началом в указанной угловой точке грани.
 Синтаксис
C#
Visual Basic
Копировать Код
public void MakeEdgeInvisibleAt( short faceIndex );
Копировать Код
Public Sub MakeEdgeInvisibleAt( faceIndex As Short )
 Параметры
 Параметры
 Описание
 faceIndex
 Индекс начальной точки ребра (0, 1, 2 или 3). Тип short.
 Описание
 Метод позволяет сделать невидимым ребро, которое начинается в угловой точке грани с индексом faceIndex.
 Ссылки
 Teigha.DatabaseServices.FaceRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!