Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeaderStyle.EnableBlockScale
 Послать отзыв
 Свойство позволяет включить или отключить масштабирование содержимого связанного блока.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool EnableBlockScale;
Копировать Код
Public Property EnableBlockScale As Boolean
 Возвращает
 Возвращает true, если масштабирование блока включено. В противном случае возвращает false.
 Описание
 Свойство позволяет включить или отключить масштабирование содержимого связанного блока.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MLeaderStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!