Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GripOverrule.SetIdFilter
 Послать отзыв
 Включает фильтрацию объектов по идентификатору перед объектным переопределением.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetIdFilter( ref ObjectId[] ids );
Копировать Код
Public Sub SetIdFilter( ByRef ids As ObjectId[] )
 Параметры
 Параметры
 Описание
 ids
 Массив идентификаторов ObjectId, используемых для фильтрации.
 Описание
 Включает фильтрацию объектов по идентификатору перед объектным переопределением.
 Используйте этот метод, когда требуется, чтобы nanoCAD вызывал ваши переопределения только для объектов с идентификаторами из заданного списка.
 Ссылки
 Teigha.DatabaseServices.GripOverrule, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!