Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Viewport.LensLength
 Послать отзыв
 Свойство LensLength представляет фокусное расстояние в режиме вида в перспективе (в мм) в данном видовом экране.
 Синтаксис
C#
Visual Basic
Копировать Код
public double LensLength;
Копировать Код
Public Property LensLength As Double
 Возвращает
 Возвращает фокусное расстояние (в мм). Тип double.
 Описание
 Свойство LensLength представляет фокусное расстояние в режиме вида в перспективе (в мм) в данном видовом экране.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Viewport, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!