Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Ray3d
 Послать отзыв
 Класс Ray3d представляет трехмерный луч, полубесконечную линию в трехмерном пространстве.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Geometry::Entity3d Teigha::Geometry::Curve3d Teigha::Geometry::LinearEntity3d Teigha::Geometry::Ray3d
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdGeRay3d")] public sealed class Ray3d : LinearEntity3d
Копировать Код
<Wrapper("OdGeRay3d")> Public NotInheritable Class Ray3d Inherits LinearEntity3d
 Описание
 Класс Ray3d представляет трехмерный луч, полубесконечную линию в трехмерном пространстве. Объект Ray3d имеет начальную точку, но не имеет конечной.
 Методы
 Конструкторы
 Teigha.Geometry.Ray3d
 Имя
 Описание
 Ray3d
 Это обзор перегрузок Ray3d.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Geometry.Entity3d
 Имя
 Описание
 Entity3d Методы
 Ниже перечислены методы класса Entity3d.
 Teigha.Geometry.Curve3d
 Имя
 Описание
 Curve3d Методы
 Ниже перечислены методы класса Curve3d.
 Curve3d Свойства
 Ниже перечислены свойства класса Curve3d.
 Teigha.Geometry.LinearEntity3d
 Имя
 Описание
 LinearEntity3d Методы
 Ниже перечислены методы класса LinearEntity3d.
 LinearEntity3d Свойства
 Ниже перечислены свойства класса LinearEntity3d.
 Teigha.Geometry.Ray3d
 Имя
 Описание
 Ray3d Методы
 Ниже перечислены методы класса Ray3d.
 Ссылки
 Ray3d Конструктор, Ray3d Методы, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!