Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GripData.TriggerGrip
 Послать отзыв
 Свойство позволяет определить, является ли эта ручка триггерной.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool TriggerGrip;
Копировать Код
Public Property TriggerGrip As Boolean
 Возвращает
 Возвращает true, если ручка является триггерной. В противном случае возвращает false.
 Описание
 Свойство позволяет определить, является ли эта ручка триггерной.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.GripData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!