Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SweepOptions.Clone
 Послать отзыв
 Метод предназначен для клонирования данного объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public Object Clone();
Копировать Код
Public Function Clone() As Object
 Возвращает
 Возвращает полный клон данного объекта. Тип Object.
 Описание
 Метод предназначен для клонирования данного объекта.
 Ссылки
 Teigha.DatabaseServices.SweepOptions, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!