Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Surface.RayTest
 Послать отзыв
 Метод предназначен для для создания луча, который начинается в указанной точке и имеет заданное направление.
 Синтаксис
C#
Visual Basic
Копировать Код
public void RayTest( Point3d rayBasePoint, Vector3d rayDir, double rayRadius, out SubentityId[] subEntIds, out DoubleCollection parameters );
Копировать Код
Public Sub RayTest( rayBasePoint As Point3d, rayDir As Vector3d, rayRadius As Double, ByRef subEntIds() As [Out] SubentityId, ByRef parameters As [Out] DoubleCollection )
 Параметры
 Параметры
 Описание
 rayBasePoint
 Базовая точка, в которой начинается луч. Тип Point3d.
 rayDir
 Направление распространения луча. Тип Vector3d.
 rayRadius
 Радиус луча. Тип double. Он определяет допуск для проверок пересечений.
 subEntIds
 Возвращаемый массив идентификаторов подобъектов. Тип SubentityId[]. Может содержать идентификаторы граней, ребер и вершин.
 Описание
 Метод предназначен для для создания луча, который начинается в указанной точке и имеет заданное направление.
 Замечания
 Этот метод реализован только в среде пространственного моделирования Spatial Modeler.
 Ссылки
 Teigha.DatabaseServices.Surface, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!