Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve2d.GetDistanceTo
 Послать отзыв
 Метод вычисляет расстояние от указанной точки до ближайшей точки на данной кривой с предписанной точностью.
 Синтаксис
C#
Visual Basic
Копировать Код
public double GetDistanceTo( Point2d point, Tolerance tolerance );
Копировать Код
Public Function GetDistanceTo( point As Point2d, tolerance As Tolerance ) As Double
 Параметры
 Параметры
 Описание
 point
 Входная двумерная точка, до которой вычисляется расстояние. Тип Point2d.
 tolerance
 Входная геометрическая точность. Тип Tolerance.
 Возвращает
 Возвращает расстояние от точки point до ближайшей точки на данной кривой. Тип double.
 Описание
 Метод вычисляет расстояние от указанной точки до ближайшей точки на данной кривой с предписанной точностью.
 Ссылки
 Teigha.Geometry.Curve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!