Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Chamferb
 Послать отзыв
 Синтаксис
C#
Visual Basic
public double Chamferb;
Public Property Chamferb() As Double
 Описание
 Возвращает или устанавливает текущее значение CHAMFERB для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!