Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство DBText.Rotation
 Послать отзыв
 Синтаксис
C#
Visual Basic
public double Rotation;
Public Property Rotation() As Double
 Описание
 Обеспечивает доступ к углу поворота текста. Угол поворота текста это угол относительно оси X OCS координат текста, с положительным углом, отсчитываемым против часовой стрелки, если смотреть по оси Z вниз к основанию координат. Ось X OCS определяется с использованием вектора нормали к тексту, оси Z мировых координат и алгоритма выбора осей nanoCAD.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.DBText, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!