Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Database.AuditXData
 Послать отзыв
 This is AuditXData, a member of class Database.
 Синтаксис
C#
Visual Basic
public void AuditXData(ref AuditInfo info);
Public Sub AuditXData(ByRef info As AuditInfo)
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!