Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод SymbolTable.GetEnumerator
 Послать отзыв
 Синтаксис
C#
Visual Basic
public SymbolTableEnumerator GetEnumerator();
Public Function GetEnumerator() As SymbolTableEnumerator
 Описание
 Возвращает енумератор для коллекции записей таблицы.
 Ссылки
 Teigha.DatabaseServices.SymbolTable, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!