Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Line2dCollection.Add
 Послать отзыв
 Метод добавляет в коллекцию указанную линию.
 Синтаксис
C#
Visual Basic
Копировать Код
public int Add( ref Line2d value );
Копировать Код
Public Function Add( ByRef value As Line2d ) As Integer
 Параметры
 Параметры
 Описание
 value
 Линия, которую требуется добавить в коллекцию. Тип Line2d.
 Возвращает
 Возвращает индекс только что добавленного элемента коллекции. Тип int. Индексация элементов коллекции начинается с нуля.
 Описание
 Метод добавляет в коллекцию указанную линию.
 Ссылки
 Teigha.Geometry.Line2dCollection, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!