Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SecurityParameters.ProviderType
 Послать отзыв
 Свойство ProviderType представляет тип провайдера шифрования.
 Синтаксис
C#
Visual Basic
Копировать Код
public int ProviderType;
Копировать Код
Public Property ProviderType As Integer
 Возвращает
 Возвращает тип провайдера шифрования. Тип int.
 Описание
 Свойство ProviderType представляет тип провайдера шифрования.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.SecurityParameters, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!