Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.BoundBlock2d.BoundBlock2d
 Послать отзыв
 Конструктор по умолчанию класса BoundBlock2d. Создает граничную рамку с минимальной и максимальной точками в начале системы координат.
 Синтаксис
C#
Visual Basic
Копировать Код
public BoundBlock2d();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса BoundBlock2d. Создает граничную рамку с минимальной и максимальной точками в начале системы координат.
 Ссылки
 Teigha.Geometry.BoundBlock2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!