Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Point3AngularDimension
 Послать отзыв
 Класс Point3AngularDimension представляет в базе данных объекты углового размера по трем точкам.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::GraphicsInterface::Drawable Teigha::DatabaseServices::DBObject Teigha::DatabaseServices::Entity Teigha::DatabaseServices::Dimension Teigha::DatabaseServices::Point3AngularDimension
 Синтаксис
C#
Visual Basic
Копировать Код
[TypeDescriptionProvider("Teigha.ComponentModel.TypeDescriptionProvider`1[[Teigha.DatabaseServices.Point3AngularDimension, TD_Mgd]], TD_Mgd")] [Wrapper("AcDb3PointAngularDimension")] public class Point3AngularDimension : Dimension
Копировать Код
<TypeDescriptionProvider("Teigha.ComponentModel.TypeDescriptionProvider`1[[Teigha.DatabaseServices.Point3AngularDimension, TD_Mgd]], TD_Mgd")> <Wrapper("AcDb3PointAngularDimension")> Public Class Point3AngularDimension Inherits Dimension
 Описание
 Класс Point3AngularDimension представляет в базе данных объекты углового размера по трем точкам.
 Методы
 Конструкторы
 Teigha.GraphicsInterface.Drawable
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 Drawable
 Конструктор класса Teigha.GraphicsInterface.Drawable. (Унаследован от Drawable)
 Teigha.DatabaseServices.DBObject
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 DBObject
 Конструктор. (Унаследован от DBObject)
 Teigha.DatabaseServices.Point3AngularDimension
 Имя
 Описание
 Point3AngularDimension
 Это обзор перегрузок Point3AngularDimension.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.GraphicsInterface.Drawable
 Имя
 Описание
 Drawable Методы
 Ниже перечислены методы класса Drawable.
 Drawable Свойства
 Ниже перечислены свойства класса Drawable.
 Teigha.DatabaseServices.DBObject
 Имя
 Описание
 DBObject Методы
 Ниже перечислены методы класса DBObject.
 DBObject Свойства
 Ниже перечислены свойства класса DBObject.
 DBObject События
 Ниже перечислены события класса DBObject.
 Teigha.DatabaseServices.Entity
 Имя
 Описание
 Entity Методы
 Ниже перечислены методы класса Entity.
 Entity Свойства
 Ниже перечислены свойства класса Entity.
 Teigha.DatabaseServices.Dimension
 Имя
 Описание
 Dimension Методы
 Ниже перечислены методы класса Dimension.
 Dimension Свойства
 Ниже перечислены свойства класса Dimension.
 Teigha.DatabaseServices.Point3AngularDimension
 Имя
 Описание
 Point3AngularDimension Свойства
 Ниже перечислены свойства класса Point3AngularDimension.
 Ссылки
 Point3AngularDimension Конструктор, Point3AngularDimension Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства, DBObject События
 Ваши комментарии по поводу этого топика: Послать отзыв!