Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FieldEngine.GetEvaluatorLoader
 Послать отзыв
 Метод предоставляет загрузчик вычислителя поля с указанным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual FieldEvaluatorLoader GetEvaluatorLoader( int inputIndex );
Копировать Код
Public Overridable Function GetEvaluatorLoader( inputIndex As Integer ) As FieldEvaluatorLoader
 Параметры
 Параметры
 Описание
 inputIndex
 Входной индекс требуемого загрузчика вычислителя поля. Тип int. Индекс отсчитывается от нуля, соответственно, должен быть меньше количества зарегистрированных загрузчиков вычислителей.
 Возвращает
 Возвращает загрузчик вычислителя поля, зарегистрированный под индексом inputIndex. Тип FieldEvaluatorLoader.
 Описание
 Метод предоставляет загрузчик вычислителя поля с указанным индексом. В сочетании со свойством EvaluatorLoaderCount позволяет реализовать перечисление всех зарегистрированных загрузчиков вычислителей полей.
 Ссылки
 Teigha.DatabaseServices.FieldEngine, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!