Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FileDependencyManager.IteratorInitialize
 Послать отзыв
 Метод инициализирует итератор для раздела .dwg списка файловых зависимостей.
 Синтаксис
C#
Visual Basic
Копировать Код
public void IteratorInitialize( ref String feature, bool modifiedOnly, bool affectsGraphicsOnly, bool walkXRefTree );
Копировать Код
Public Sub IteratorInitialize( ByRef feature As String, modifiedOnly As Boolean, affectsGraphicsOnly As Boolean, walkXRefTree As Boolean )
 Параметры
 Параметры
 Описание
 feature
 Имя приложения или функции, создавших запись. Тип String.
 modifiedOnly
 Флаг, который определяет, следует ли возвращать только измененные записи. Тип bool.
 affectsGraphicsOnly
 Флаг, который определяет, следует ли возвращать только те записи, которые влияют на отображаемый вид. Тип bool.
 walkXRefTree
 Флаг, который определяет, следует ли просматривать списки файловых зависимостей во внешних ссылках. Тип bool.
 Описание
 Метод инициализирует итератор для раздела .dwg списка файловых зависимостей.
 Замечания
 Если аргументы не указаны, просматриваются все записи в локальном списке. Первые три предоставленных аргумента ограничивают список просматриваемых записей.
 Ссылки
 Teigha.DatabaseServices.FileDependencyManager, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!