Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LinkedData
 Послать отзыв
 Класс представляет в базе данных объекты LinkedData и обеспечивает связывание данных.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::GraphicsInterface::Drawable Teigha::DatabaseServices::DBObject Teigha::DatabaseServices::LinkedData
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("AcDbLinkedData")] public class LinkedData : DBObject;
Копировать Код
<Wrapper("AcDbLinkedData")> Public Class LinkedData Inherits DBObject
 Описание
 Класс представляет в базе данных объекты LinkedData и обеспечивает связывание данных.
 Методы
 Конструкторы
 Teigha.GraphicsInterface.Drawable
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 Drawable
 Конструктор класса Teigha.GraphicsInterface.Drawable. (Унаследован от Drawable)
 Teigha.DatabaseServices.DBObject
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 DBObject
 Конструктор. (Унаследован от DBObject)
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.GraphicsInterface.Drawable
 Имя
 Описание
 Drawable Методы
 Ниже перечислены методы класса Drawable.
 Drawable Свойства
 Ниже перечислены свойства класса Drawable.
 Teigha.DatabaseServices.DBObject
 Имя
 Описание
 DBObject Методы
 Ниже перечислены методы класса DBObject.
 DBObject Свойства
 Ниже перечислены свойства класса DBObject.
 DBObject События
 Ниже перечислены события класса DBObject.
 Teigha.DatabaseServices.LinkedData
 Имя
 Описание
 LinkedData Методы
 Ниже перечислены методы класса LinkedData.
 LinkedData Свойства
 Ниже перечислены свойства класса LinkedData.
 Ссылки
 LinkedData Методы, LinkedData Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства, DBObject События
 Ваши комментарии по поводу этого топика: Послать отзыв!