Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SymbolUtilityServices.GetLayerZeroId
 Послать отзыв
 Метод позволяет извлечь из указанной базы данных идентификатор объекта слоя "0" .
 Синтаксис
C#
Visual Basic
Копировать Код
public static ObjectId GetLayerZeroId( ref Database database );
Копировать Код
Public Shared Function GetLayerZeroId( ByRef database As Database ) As ObjectId
 Параметры
 Параметры
 Описание
 database
 База данных, из которой извлекается идентификатор объекта. Тип Database.
 Возвращает
 Возвращает ненулевой идентификатор объекта слоя "0". Тип ObjectId.
 Описание
 Метод позволяет извлечь из указанной базы данных идентификатор объекта слоя "0" .
 Ссылки
 Teigha.DatabaseServices.SymbolUtilityServices, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!