Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DataColumn.DataColumn
 Послать отзыв
 Конструктор копирования класса DataColumn.
 Синтаксис
C#
Visual Basic
Копировать Код
public DataColumn( ref DataColumn column );
Копировать Код
Public Sub New( ByRef column As DataColumn )
 Параметры
 Параметры
 Описание
 column
 Входной объект для копирования. Тип DataColumn.
 Описание
 Конструктор копирования класса DataColumn. Создает новый объект DataColumn как копию указанного существующего объекта DataColumn.
 Ссылки
 Teigha.DatabaseServices.DataColumn, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!