Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObject.Annotative
 Послать отзыв
 Свойство позволяет управлять статусом аннотации объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public Object AcadObject;
Копировать Код
Public Property AcadObject() As Object
 Возвращает
 Возвращает установленный статус аннотации объекта. Тип AnnotativeStates
 Описание
 Свойство позволяет управлять статусом аннотации объекта.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.DBObject, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!