Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Auprec
 Послать отзыв
 Синтаксис
C#
Visual Basic
public int Auprec;
Public Property Auprec() As Integer
 Описание
 Возвращает или устанавливает текущее значение AUPREC для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!