Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotStyleTable.DisplayCustomLineweightUnits
 Послать отзыв
 Свойство DisplayCustomLineweightUnits позволяет определить, следует ли отображать пользовательские единицы измерения толщины линий для данного объекта PlotStyleTable.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool DisplayCustomLineweightUnits;
Копировать Код
Public Property DisplayCustomLineweightUnits As Boolean
 Возвращает
 Возвращает true, если для данной таблицы стилей печати должны отображаться пользовательские единицы измерения толщины линий. В противном случае возвращает false.
 Описание
 Свойство DisplayCustomLineweightUnits позволяет определить, следует ли отображать пользовательские единицы измерения толщины линий для данной таблицы стилей печати PlotStyleTable.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.PlotStyleTable, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!