Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SolidBackground.SolidBackground
 Послать отзыв
 Конструктор по умолчанию класса SolidBackground.
 Синтаксис
C#
Visual Basic
Копировать Код
public SolidBackground();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса SolidBackground.
 Ссылки
 Teigha.DatabaseServices.SolidBackground, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!