Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.PointOnCurve3d.Curve
 Послать отзыв
 Свойство обеспечивает доступ к кривой, на которой лежит данная точка.
 Синтаксис
C#
Visual Basic
Копировать Код
public Curve3d Curve;
Копировать Код
Public Property Curve() As Curve3d
 Возвращает
 Возвращает кривую, на которой лежит данная точка. Тип Curve3d.
 Описание
 Свойство обеспечивает доступ к кривой, на которой лежит данная точка.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.PointOnCurve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!