Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 DimStyleTableRecord.Dimatfit
 Послать отзыв
 Свойство отвечает за размещение стрелок размерных линий и текста размера, когда на размерной линии не хватает места.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual int Dimatfit { get; set; }
Копировать Код
Public Overridable Property Dimatfit As Integer
 Возвращает
 Возвращает тип данных int.
 Возвращаемые значения
 Возвращаемые значения
 Описание
 0
 когда на размерной линии не хватает места для текста или для стрелок, текст и стрелки автоматически будут размещены за пределами выносных линий
 1
 когда на размерной линии не хватает места для текста или для стрелок, сначала за пределы вывносных линий перемещаются стрелки. Если после этого и для текста не хватает места, то потом за пределы выносных линий перемещается текст. Если после перемещения стрелок за пределы выносных линий для текста достаточно места, то текст не перемещается.
 2
 когда на размерной линии не хватает места для текста или для стрелок, сначала за пределы вывносных линий перемещаются текст. Если после этого и для стрелок не хватает места, то потом за пределы выносных линий перемещаются стрелки. Если после перемещения текста за пределы выносных линий для стрелок достаточно места, то стрелки не перемещаются.
 3
 когда на размерной линии не хватает места для текста или для стрелок, то автоматически выбирается оптимальный вариант и за пределы выносных линий перемещаются либо стрелки, либо текст.
 Описание
 В свойстве хранится настройка размещения стрелок размерных линий и текста размера, когда на размерной линии не хватает места. В качестве значения свойства доступны следующие целые числа:
0 – текст и стрелки: размещение текста и стрелок за пределами выносных линий;
1 – стрелки, затем текст (стрелки): сначала перемещают стрелки, затем текст;
2 – текст, затем стрелки (текст): сначала перемещают текст, затем стрелки;
3 (значение по умолчанию) – либо текст, либо стрелки (оптимальное размещение): перемещение либо текста, либо стрелок.
 Свойство также доступно через системную переменную DIMATFIT и пользовательское меню в окне изменения/создания размерного стиля:
  При изменении системной переменной DIMATFIT будет создан новый размерный стиль под названием <переопределение> на основе текущего с новым значением DIMATFIT.
 Условия
 Чтение и запись.
 Пример
 Пример изменения настройки размещения стрелок размерных линий и текста размера, когда на размерной линии не хватает места (значения свойства Dimatfit) в размерном стиле Standard:
C#
 Копировать Код
public partial class Commands { [Teigha.Runtime.CommandMethod("DimatfitChange")] public void DimatfitStandardDimStyle() { // Получение ссылки на активный документ HostMgd.ApplicationServices.Document doc = HostMgd.ApplicationServices.Application.DocumentManager.MdiActiveDocument; // Получение ссылки на редактор документа HostMgd.EditorInput.Editor ed = doc.Editor; // Получение ссылки на базу данных документа Teigha.DatabaseServices.Database db = doc.Database; // Начало транзакции с базой данных документа using (Teigha.DatabaseServices.Transaction trans = db.TransactionManager.StartTransaction()) { // Открываем таблицу размерных стилей для чтения Teigha.DatabaseServices.DimStyleTable dimStyleTable = trans.GetObject(db.DimStyleTableId, Teigha.DatabaseServices.OpenMode.ForRead) as Teigha.DatabaseServices.DimStyleTable; // Находим в таблице размерных стилей ObjectId нужного стиля по его названию Teigha.DatabaseServices.ObjectId styleId = dimStyleTable["Standard"]; // Открываем таблицу размерного стиля для изменений Teigha.DatabaseServices.DimStyleTableRecord obj = trans.GetObject(styleId, Teigha.DatabaseServices.OpenMode.ForWrite) as Teigha.DatabaseServices.DimStyleTableRecord; ed.WriteMessage($"nDimatfit before: {obj.Dimatfit}"); // Изменяем размещение стрелок и размерного текста // если они не помещаются внутри выносных линий obj.Dimatfit = 0; ed.WriteMessage($"nDimatfit after: {obj.Dimatfit}"); trans.Commit(); } } }
 Результат работы команды DimatfitChange:
 Было:
 Стало:
 Ссылки
 Teigha.DatabaseServices.DimStyleTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!