Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBVisualStyle.CopyTo
 Послать отзыв
 Метод копирует данный визуальный стиль в указанный объект типа VisualStyle.
 Синтаксис
C#
Visual Basic
Копировать Код
public void CopyTo( ref VisualStyle pDest );
Копировать Код
Public Sub CopyTo( ByRef pDest As VisualStyle )
 Параметры
 Параметры
 Описание
 pDest
 Визуальный стиль, в который копируются данные из этого стиля. Тип VisualStyle.
 Описание
 Метод копирует данный визуальный стиль в указанный объект типа VisualStyle.
 Ссылки
 Teigha.DatabaseServices.DBVisualStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!