Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve2d.IsOn
 Послать отзыв
 Метод проверяет, находится ли указанное значение параметра в допустимом параметрическом интервале кривой в пределах заданной точности.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsOn( double parameter, Tolerance tolerance );
Копировать Код
Public Function IsOn( parameter As Double, tolerance As Tolerance ) As Boolean
 Параметры
 Параметры
 Описание
 parameter
 Входное проверяемое значение параметра. Тип double.
 tolerance
 Входная точность. Тип Tolerance.
 Возвращает
 Возвращает true, если переданное значение аргумента parameter находится в пределах параметрического интервала данной кривой. В противном случае возвращает false.
 Описание
 Метод проверяет, находится ли указанное значение параметра в допустимом параметрическом интервале кривой в пределах заданной точности.
 Ссылки
 Teigha.Geometry.Curve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!