Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LineWeightConverter.ConvertTo
 Послать отзыв
 Метод предназначен для преобразования указанного объекта в заданный тип.
 Синтаксис
C#
Visual Basic
Копировать Код
public override Object ConvertTo( ref ITypeDescriptorContext context, ref CultureInfo culture, ref Object value, ref Type destinationType );
Копировать Код
Public Overrides Function ConvertTo( ByRef context As ITypeDescriptorContext, ByRef culture As CultureInfo, ByRef value As Object, ByRef destinationType As Type ) As Object
 Параметры
 Параметры
 Описание
 context
 Контекст для преобразования входного объекта. Тип ITypeDescriptorContext.
 culture
 Провайдер языковых и региональных настроек. Тип CultureInfo.
 value
 Исходный объект. Тип Object.
 destinationType
 Требуемый тип, к которому следует привести объект value. Тип Type.
 Возвращает
 Возвращает результат преобразования. Тип Object.
 Описание
 Метод предназначен для преобразования указанного объекта в заданный тип. Преобразование учитывает переданный контекст, а также языковые и региональные настройки.
 Ссылки
 Teigha.DatabaseServices.LineWeightConverter, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!