Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FaceRecord.FaceRecord
 Послать отзыв
 Конструктор по умолчанию класса FaceRecord.
 Синтаксис
C#
Visual Basic
Копировать Код
public FaceRecord();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса FaceRecord.
 Ссылки
 Teigha.DatabaseServices.FaceRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!