Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Leader.SetDimstyleData
 Послать отзыв
 Синтаксис
C#
Visual Basic
public void SetDimstyleData(ref DimStyleTableRecord style);
Public Sub SetDimstyleData(ByRef style As DimStyleTableRecord)
 Параметры
 Параметры
 Описание
 style
 Id объекта требуемого размерного стиля
 Описание
 Устанавливает, что выноска использует размерный стиль (и переопределяет размер, связанный с ним), заданный в параметре style.
 Ссылки
 Teigha.DatabaseServices.Leader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!