Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObjectReferenceCollection.Add
 Послать отзыв
 Метод добавляет в коллекцию объектную ссылку DBObjectReference.
 Синтаксис
C#
Visual Basic
Копировать Код
public int Add( DBObjectReference value );
Копировать Код
Public Function Add( value As DBObjectReference ) As Integer
 Параметры
 Параметры
 Описание
 value
 Входная объектная ссылка. Тип DBObjectReference.
 Возвращает
 Возвращает индекс вновь созданного элемента коллекции. Тип int.
 Описание
 Метод добавляет в коллекцию объектную ссылку DBObjectReference.
 Ссылки
 Teigha.DatabaseServices.DBObjectReferenceCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!