Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MlineStyleElement.ToString
 Послать отзыв
 Метод формирует эквивалентное представление данного объекта в виде текстовой строки.
 Синтаксис
C#
Visual Basic
Копировать Код
public sealed override String ToString();
Копировать Код
Public NotOverridable Overrides Function ToString() As String
 Возвращает
 Возвращает текстовою строку, представляющую данный объект. Тип String.
 Описание
 Метод формирует эквивалентное представление данного объекта в виде текстовой строки.
 Ссылки
 Teigha.DatabaseServices.MlineStyleElement, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!