Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.TransformOverrule.TransformBy
 Послать отзыв
 Метод предназначен для выполнения 3D-преобразования заданного объекта с использованием указанной матрицы преобразования.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void TransformBy( ref Entity entity, Matrix3d transform );
Копировать Код
Public virtual Sub TransformBy( ByRef entity As Entity, transform As Matrix3d )
 Параметры
 Параметры
 Описание
 entity
 Объект чертежа, у которому применяется 3D-преобразование. Тип Entity.
 transform
 Матрица 3D-преобразования. Тип Matrix3d.
 Описание
 Метод предназначен для выполнения 3D-преобразования объекта entity с использованием матрицы преобразования transform.
 Ссылки
 Teigha.DatabaseServices.TransformOverrule, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!