Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Hatch.NumberOfHatchLines
 Послать отзыв
 Синтаксис
C#
Visual Basic
public int NumberOfHatchLines;
Public Property NumberOfHatchLines() As Integer
 Описание
 Возвращает общее количество линий заливки, которые есть в объекте заливки. Линии заливки объекта вычисляет функция EvaluateHatch().
 Свойство возвращает 0, если образец заливки является сплошным.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.Hatch, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!