Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SweepOptionsCheckSweepCurveOut.SweepOptionsCheckSweepCurveOut
 Послать отзыв
 Конструктор по умолчанию класса SweepOptionsCheckSweepCurveOut.
 Синтаксис
C#
Visual Basic
Копировать Код
public SweepOptionsCheckSweepCurveOut();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса SweepOptionsCheckSweepCurveOut.
 Ссылки
 Teigha.DatabaseServices.SweepOptionsCheckSweepCurveOut, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!