Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Viewport.UcsIconAtOrigin
 Послать отзыв
 Свойство UcsIconAtOrigin позволяет определить, располагается ли в данном видовом экране значок ПСК (UCS) в начале пользовательской системы координат.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool UcsIconAtOrigin;
Копировать Код
Public Property UcsIconAtOrigin As Boolean
 Возвращает
 Возвращает true, если значок ПСК располагается в начале пользовательской системы координат. В противном случае возвращает false.
 Описание
 Свойство UcsIconAtOrigin позволяет определить, располагается ли в данном видовом экране значок ПСК (UCS) в начале пользовательской системы координат.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Viewport, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!