Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство RasterImage.Fade
 Послать отзыв
 Синтаксис
C#
Visual Basic
public unsigned char Fade;
Public Property Fade() As unsigned char
 Описание
 Обеспечивает доступ к текущему значению постепенного изменения отображения.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.RasterImage, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!