Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.Dimtvp
 Послать отзыв
 Свойство управляет вертикальным положением размерного текста относительно размерной линии.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Dimtvp;
Копировать Код
Public Property Dimtvp As Double
 Возвращает
 Возвращает смещение текста по вертикали относительно размерной линии. Тип double.
 Описание
 Свойство задает или возвращает расстояние по вертикали от середины поля размерного текста до размерной линии.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!