Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Circle.Normal
 Послать отзыв
 Синтаксис
C#
Visual Basic
public Vector3d Normal;
Public Property Normal() As Vector3d
 Описание
 Возвращает или устанавливает вектор нормали к окружности из центра.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Circle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!