Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 DimStyleTableRecord.Dimtad
 Послать отзыв
 Свойство предназначено для контроля вертикальной позиции размерного текста.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual int Dimtad { get; set; }
Копировать Код
Public Overridable Property Dimtad As Integer
 Возвращает
 Возвращает тип данных int.
 Описание
 В свойстве хранится настройка вертикальной позиции размерного текста.
 Возможны следующие значения:
0 – центрирована – центрирован над размерной линией (по умолчанию);
1 – над размерной линией;
2 – наиболее удаленная – сторона размерной линии, наиболее удаленная от определяющих точек;
3 – стандарт JIS;
4 – под – текст под размерной линией.
 Примечание: Если установлено «Над размерной линией», тогда этот параметр будет применен, если для Dimtih не установлено значение «Горизонтально» и размерная линия не горизонтальная.
 Свойство также доступно через системную переменную DIMTAD и пользовательское меню в окне изменения/создания размерного стиля:
  При изменении системной переменной DIMTAD будет создан новый размерный стиль под названием <переопределение> на основе текущего с новым значением DIMTAD.
 Условия
 Чтение и запись.
 Пример
 Пример изменения настройки вертикальной позиции размерного текста (значения свойства Dimtad) в размерном стиле Standard:
C#
 Копировать Код
public partial class Commands { [Teigha.Runtime.CommandMethod("DimtadChange")] public void DimtadStandardDimStyle() { // Получение ссылки на активный документ HostMgd.ApplicationServices.Document doc = HostMgd.ApplicationServices.Application.DocumentManager.MdiActiveDocument; // Получение ссылки на редактор документа HostMgd.EditorInput.Editor ed = doc.Editor; // Получение ссылки на базу данных документа Teigha.DatabaseServices.Database db = doc.Database; // Начало транзакции с базой данных документа using (Teigha.DatabaseServices.Transaction trans = db.TransactionManager.StartTransaction()) { // Открываем таблицу размерных стилей для чтения Teigha.DatabaseServices.DimStyleTable dimStyleTable = trans.GetObject(db.DimStyleTableId, Teigha.DatabaseServices.OpenMode.ForRead) as Teigha.DatabaseServices.DimStyleTable; // Находим в таблице размерных стилей ObjectId нужного стиля по его названию Teigha.DatabaseServices.ObjectId styleId = dimStyleTable["Standard"]; // Открываем таблицу размерного стиля для изменений Teigha.DatabaseServices.DimStyleTableRecord obj = trans.GetObject(styleId, Teigha.DatabaseServices.OpenMode.ForWrite) as Teigha.DatabaseServices.DimStyleTableRecord; ed.WriteMessage($"nDimtad before: {obj.Dimtad}"); // Изменяем выравнивание текста по вертикали obj.Dimtad = 4; ed.WriteMessage($"nDimtad after: {obj.Dimtad}"); trans.Commit(); } } }
 Результат работы команды DimtadChange:
 Было:
 Стало:
 Ссылки
 Teigha.DatabaseServices.DimStyleTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!