Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.SplineEntity2d
 Послать отзыв
 Класс SplineEntity2d представляет различные двумерные сплайновые объекты. В текущей версии не реализован.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Geometry::Entity2d Teigha::Geometry::Curve2d Teigha::Geometry::SplineEntity2d
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdGeSplineEnt2d")] public abstract class SplineEntity2d : Curve2d
Копировать Код
<Wrapper("OdGeSplineEnt2d")> Public MustInherit Class SplineEntity2d Inherits Curve2d
 Описание
 Класс SplineEntity2d представляет различные двумерные сплайновые объекты.
 Замечания
 В текущей версии этот класс не реализован.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Geometry.Entity2d
 Имя
 Описание
 Entity2d Методы
 Ниже перечислены методы класса Entity2d.
 Teigha.Geometry.Curve2d
 Имя
 Описание
 Curve2d Методы
 Ниже перечислены методы класса Curve2d.
 Curve2d Свойства
 Ниже перечислены свойства класса Curve2d.
 Teigha.Geometry.SplineEntity2d
 Имя
 Описание
 SplineEntity2d Методы
 Ниже перечислены методы класса SplineEntity2d.
 SplineEntity2d Свойства
 Ниже перечислены свойства класса SplineEntity2d.
 Ссылки
 SplineEntity2d Методы, SplineEntity2d Свойства, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!