Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotSettings.PlotHidden
 Послать отзыв
 Свойство PlotHidden позволяет определить, предусмотрено ли удаление при печати скрытых линий у объектов.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool PlotHidden;
Копировать Код
Public Property PlotHidden As Boolean
 Возвращает
 Возвращает true, если алгоритм удаления скрытых линий не используется. В противном случае возвращает false.
 Описание
 Свойство PlotHidden позволяет определить, предусмотрено ли удаление при печати скрытых линий у объектов.
 Заметим, что эта настройка не влияет на объекты в плавающих видовых экранах пространства модели. Удалением скрытых линий в этих видовых экранах управляют собственные отдельные элементы управления.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.PlotSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!