Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CircularArc3d.Set
 Послать отзыв
 Метод позволяет переопределить дугу в полную окружность в указанной плоскости с заданными центром и радиусом.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Set( Point3d center, Vector3d normal, double radius );
Копировать Код
Public Sub Set( center As Point3d, normal As Vector3d, radius As Double )
 Параметры
 Параметры
 Описание
 center
 Цент окружности. Тип Point3d.
 normal
 Вектор нормали плоскости, в которой располагается окружность. Тип Vector3d.
 radius
 Радиус окружности. Тип double. Не может равняться 0.
 Описание
 Метод позволяет переопределить дугу в полную окружность в указанной плоскости с заданными центром и радиусом.
 Замечания
 Окружность будет ориентирована против часовой стрелки относительно вектора нормали плоскости.
 Ссылки
 Teigha.Geometry.CircularArc3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!