Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 DimStyleTableRecord.Dimaltu
 Послать отзыв
 Свойство предназначено для настройки формата альтернативных единиц в размерах.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual int Dimaltu { get; set; }
Копировать Код
Public Overridable Property Dimaltu As Integer
 Возвращает
 Возвращает тип данных int.
 Возвращаемые значения
 Возвращаемые значения
 Описание
 1
 научный формат альтернативных единиц в размерах
 2
 десятичный формат альтернативных единиц в рамерах
 3
 дюймовый десятичный формат альтернативных единиц в размерах
 4
 дюймовый дробный формат (--) альтернативных единиц в размерах
 5
 дробный формат (--) альтернативных единиц в размерах
 6
 дюймовый дробный формат альтернативных единиц в размерах
 7
 дробный формат альтернативных единиц в размерах
 8
 формат альтернативных единиц в размерах, установленный в Windows
 Описание
 В свойстве хранится формат альтернативных единиц в размерах. В качестве значений свойства доступны следующие целые числа:
1 – научные;
2 – десятичные (по умолчанию);
3 – дюймовые десятичные;
4 – дюймовые дробные (--);
5 – дробные (--);
6 – дюймовые дробные;
7 – дробные;
8 – установленные в Windows.
 Там, где в названии дробного формата есть символы (--), дробь отображается с горизонтальным разделителем числителя и знаменателя, в противном случае дробь отображается с косой чертой.
 Свойство также доступно через системную переменную DIMALTU и пользовательское меню в окне изменения/создания размерного стиля:
  При изменении системной переменной DIMALTU будет создан новый размерный стиль под названием <переопределение> на основе текущего с новым значением DIMALTU.
 Условия
 Чтение и запись.
 Пример
 Пример изменения формата альтернативных единиц в размерах (значения свойства Dimaltu) в размерном стиле Standard:
C#
 Копировать Код
public partial class Commands { [Teigha.Runtime.CommandMethod("DimaltuChange")] public void DimaltuStandardDimStyle() { // Получение ссылки на активный документ HostMgd.ApplicationServices.Document doc = HostMgd.ApplicationServices.Application.DocumentManager.MdiActiveDocument; // Получение ссылки на редактор документа HostMgd.EditorInput.Editor ed = doc.Editor; // Получение ссылки на базу данных документа Teigha.DatabaseServices.Database db = doc.Database; // Начало транзакции с базой данных документа using (Teigha.DatabaseServices.Transaction trans = db.TransactionManager.StartTransaction()) { // Открываем таблицу размерных стилей для чтения Teigha.DatabaseServices.DimStyleTable dimStyleTable = trans.GetObject(db.DimStyleTableId, Teigha.DatabaseServices.OpenMode.ForRead) as Teigha.DatabaseServices.DimStyleTable; // Находим в таблице размерных стилей ObjectId нужного стиля по его названию Teigha.DatabaseServices.ObjectId styleId = dimStyleTable["Standard"]; // Открываем таблицу размерного стиля для изменений Teigha.DatabaseServices.DimStyleTableRecord obj = trans.GetObject(styleId, Teigha.DatabaseServices.OpenMode.ForWrite) as Teigha.DatabaseServices.DimStyleTableRecord; ed.WriteMessage($"nDimaltu before: {obj.Dimaltu}"); // Проверка, включено ли отображение альтернативных измерений if (obj.Dimalt == false) obj.Dimalt = true; // Изменяем формат альтернативных единиц на "Дробные(--)" obj.Dimaltu = 5; ed.WriteMessage($"nDimaltu after: {obj.Dimaltu}"); trans.Commit(); } } }
 Результат работы команды DimaltuChange:
 Было:
 Стало:
 Ссылки
 Teigha.DatabaseServices.DimStyleTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!