Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Database.AbortDeepClone
 Послать отзыв
 Инициирует отмену глубокого копирования.
 Синтаксис
C#
Visual Basic
public void AbortDeepClone(ref IdMapping idMap);
Public Sub AbortDeepClone(ByRef idMap As IdMapping)
 Параметры
 Параметры
 Описание
 idMap
 IdMapping
 Описание
 Инициирует в классе Editor событие, в котором операция deepClone, определенная по значению idMap, будет отменена. Объект IdMapping должен однозначно определять операцию deepClone.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!