Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Cell.Row
 Послать отзыв
 Свойство возвращает индекс строки данной ячейки.
 Синтаксис
C#
Visual Basic
Копировать Код
public int Row;
Копировать Код
Public ReadOnly Property Row As Integer
 Возвращает
 Возвращает индекс строки данной ячейки. Тип int.
 Описание
 Свойство возвращает индекс строки данной ячейки.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Cell, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!