Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ObjectContextManager.ObjectContextManager
 Послать отзыв
 Конструктор по умолчанию класса ObjectContextManager.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectContextManager();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса ObjectContextManager.
 Ссылки
 Teigha.DatabaseServices.ObjectContextManager, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!