Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DxfFiler.WriteInt32
 Послать отзыв
 Метод записывает в данный объект Filer указанное 32-разрядное целое число со знаком (int).
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract void WriteInt32( DxfCode opCode, int value );
Копировать Код
Public MustOverride Sub WriteInt32( opCode As DxfCode, value As Integer )
 Параметры
 Параметры
 Описание
 opCode
 Групповой код DXF. Тип DxfCode.
 value
 Значение, которое следует записать. Тип int.
 Описание
 Метод записывает в данный объект Filer указанные групповой код DXF и 32-разрядное целое число со знаком (int).
 Ссылки
 Teigha.DatabaseServices.DxfFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!