Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.UpdateDirection
 Послать отзыв
 Данное перечисление определяет направления обновления данных.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum UpdateDirection { SourceToData = 1, DataToSource = 2 }
Копировать Код
Public Enum UpdateDirection SourceToData = 1 DataToSource = 2 End Enum
 Члены
 Члены
 Описание
 SourceToData
 Значение: 1. Обновить целевые данные в объекте nanoCAD из внешнего источника данных.
 DataToSource
 Значение: 2. Обновить внешний источник данных, используя целевые данные в объекте nanoCAD.
 Описание
 Данное перечисление определяет направления обновления данных.
 Ваши комментарии по поводу этого топика: Послать отзыв!