Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CellRange.Borders
 Послать отзыв
 Свойство возвращает границы ячеек диапазона.
 Синтаксис
C#
Visual Basic
Копировать Код
public CellBorders Borders;
Копировать Код
Public ReadOnly Property Borders As CellBorders
 Возвращает
 Возвращает границы ячеек. Тип CellBorders.
 Описание
 Свойство возвращает границы ячеек диапазона.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.CellRange, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!