Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector2d.IsUnitLength
 Послать отзыв
 Метод проверяет, является ли данный вектор единичным.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsUnitLength();
Копировать Код
Public Function IsUnitLength() As Boolean
 Возвращает
 Возвращает true, если в пределах точности по умолчанию данный вектор можно считать единичным. В противном случае возвращает false.
 Описание
 Метод проверяет, является ли данный вектор единичным. Реализация использует вызов метода Vector2d.IsUnitLength(Tolerance tolerance) с точностью по умолчанию Tolerance.Global.
 Ссылки
 Teigha.Geometry.Vector2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!