Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MText.Location
 Послать отзыв
 Свойство представляет точку вставки данного объекта MText.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d Location;
Копировать Код
Public Property Location As Point3d
 Возвращает
 Возвращает точку вставки данного объекта. Тип Point3d.
 Описание
 Свойство представляет точку вставки данного объекта MText.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MText, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!