Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.ColumnWidth
 Послать отзыв
 Метод предназначен для получения ширины указанного столбца.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual double ColumnWidth( int col );
Копировать Код
Public virtual Function ColumnWidth( col As Integer ) As double
 Параметры
 Параметры
 Описание
 col
 Индекс столбца, тип int.
 Возвращает
 Возвращает ширину указанного столбца, тип double.
 Описание
 Метод предназначен для получения ширины столбца, указанного индексом столбца в таблице.
 Замечания
 Для получения того же результата предпочтительнее использовать Table.Columns[col].Width.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!