Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CellContentLayout
 Послать отзыв
 Данное перечисление определяет варианты расположения содержимого ячеек.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum CellContentLayout { Flow = 1, StackedHorizontal = 2, StackedVertical = 4 }
Копировать Код
Public Enum CellContentLayout Flow = 1 StackedHorizontal = 2 StackedVertical = 4 End Enum
 Члены
 Члены
 Описание
 Flow
 Значение: 1. Содержимое ячейки распределяется слева направо и сверху вниз.
 StackedHorizontal
 Значение: 2. Содержимое ячейки размещается рядом друг с другом (бок о бок).
 StackedVertical
 Значение: 4. Содержимое ячейки размещается одно над другим.
 Описание
 Данное перечисление определяет варианты расположения содержимого ячеек.
 Ваши комментарии по поводу этого топика: Послать отзыв!