Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Cell.SetBlockAttributeValue
 Послать отзыв
 Метод задаёт значение указанного атрибута блока данной ячейки.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetBlockAttributeValue( ObjectId attDefId, ref String value );
Копировать Код
Public Sub SetBlockAttributeValue( attDefId As ObjectId, ByRef value As String )
 Параметры
 Параметры
 Описание
 attDefId
 Идентификатор объекта определения атрибута. Тип ObjectId.
 value
 Новое значение атрибута. Тип String.
 Описание
 Метод задаёт значение указанного атрибута блока данной ячейки. Атрибут задается идентификатором определения атрибута.
 Ссылки
 Teigha.DatabaseServices.Cell, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!