Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Leader.AnnotationOffset
 Послать отзыв
 This is AnnotationOffset, a member of class Leader.
 Синтаксис
C#
Visual Basic
public Vector3d AnnotationOffset;
Public Property AnnotationOffset() As Vector3d
 Ссылки
 Teigha.DatabaseServices.Leader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!