Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Curve.GetPointAtParameter
 Послать отзыв
 Метод определяет точку на кривой Point3d, соответствующую заданному значению параметра кривой.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual Point3d GetPointAtParameter( double value );
Копировать Код
Public virtual Function GetPointAtParameter( value As double ) As Point3d
 Параметры
 Параметры
 Описание
 value
 Заданное значение параметра кривой (тип double).
 Возвращает
 Возвращает объект типа Point3d, который определяет искомую точку на кривой.
 Описание
 Метод GetPointAtParameter определяет точку на кривой Point3d, соответствующую заданному значению параметра кривой.
 Ссылки
 Teigha.DatabaseServices.Curve, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!