Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MentalRayRenderSettings
 Послать отзыв
 Класс MentalRayRenderSettings является классом-контейнером для свойств, связанных с рендерерами Mental Ray.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::GraphicsInterface::Drawable Teigha::DatabaseServices::DBObject Teigha::DatabaseServices::RenderSettings Teigha::DatabaseServices::MentalRayRenderSettings
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("AcDbMentalRayRenderSettings")] public class MentalRayRenderSettings : RenderSettings
Копировать Код
<Wrapper("AcDbMentalRayRenderSettings")> Public Class MentalRayRenderSettings Inherits RenderSettings
 Описание
 Класс MentalRayRenderSettings является классом-контейнером для свойств, связанных с рендерерами Mental Ray.
 Методы
 Конструкторы
 Teigha.GraphicsInterface.Drawable
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 Drawable
 Конструктор класса Teigha.GraphicsInterface.Drawable. (Унаследован от Drawable)
 Teigha.DatabaseServices.DBObject
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 DBObject
 Конструктор. (Унаследован от DBObject)
 Teigha.DatabaseServices.RenderSettings
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 RenderSettings
 Конструктор по умолчанию класса RenderSettings. (Унаследован от RenderSettings)
 Teigha.DatabaseServices.MentalRayRenderSettings
 Имя
 Описание
 MentalRayRenderSettings
 Это обзор перегрузок MentalRayRenderSettings.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.GraphicsInterface.Drawable
 Имя
 Описание
 Drawable Методы
 Ниже перечислены методы класса Drawable.
 Drawable Свойства
 Ниже перечислены свойства класса Drawable.
 Teigha.DatabaseServices.DBObject
 Имя
 Описание
 DBObject Методы
 Ниже перечислены методы класса DBObject.
 DBObject Свойства
 Ниже перечислены свойства класса DBObject.
 DBObject События
 Ниже перечислены события класса DBObject.
 Teigha.DatabaseServices.RenderSettings
 Имя
 Описание
 RenderSettings Свойства
 Ниже перечислены свойства класса RenderSettings.
 Teigha.DatabaseServices.MentalRayRenderSettings
 Имя
 Описание
 MentalRayRenderSettings Свойства
 Ниже перечислены свойства класса MentalRayRenderSettings.
 Ссылки
 MentalRayRenderSettings Конструктор, MentalRayRenderSettings Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства, DBObject События
 Ваши комментарии по поводу этого топика: Послать отзыв!