Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.NurbSurface.GetWeight
 Послать отзыв
 Метод позволяет определить значение веса в указанной позиции массива весов, заданной параметрами iUIndex и iVIndex.
 Синтаксис
C#
Visual Basic
Копировать Код
public double GetWeight( int iUIndex, int iVIndex );
Копировать Код
Public Function GetWeight( iUIndex As Integer, iVIndex As Integer ) As Double
 Параметры
 Параметры
 Описание
 iUIndex
 Индекс веса в направлении u. Тип int. Начальное значение индекса равно нулю.
 iVIndex
 Индекс веса в направлении v. Тип int. Начальное значение индекса равно нулю.
 Возвращает
 Возвращает значение веса. Тип double.
 Описание
 Метод позволяет определить значение веса в указанной позиции массива весов, заданной параметрами iUIndex и iVIndex.
 Возвращает действительное значение веса только в том случае, если поверхность является рациональной. Если поверхность не содержит информации о весах, метод генерирует исключение eFail. Если значения iUIndex или iVIndex недопустимы, выдается исключение eOutOfRange.
 Ссылки
 Teigha.DatabaseServices.NurbSurface, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!