Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.SetGridColor
 Послать отзыв
 Метод позволяет задать цвет сетки с указанной стороны ячейки.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetGridColor( int row, int col, short edges, ref Color color );
Копировать Код
Public virtual Sub SetGridColor( row As Integer, col As Integer, edges As short, ByRef color As Color )
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 col
 Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
 edges
 Индекс стороны ячейки, тип short. См.перечисление CellEdgeMasks.
 color
 Новый цвет линий. Тип Color.
 Описание
 Метод позволяет задать цвет сетки с указанной стороны ячейки.
 Замечания
 Для получения того же результата предпочтительнее использовать Table.Cells[row,column].{Top,Bottom,Left,Right}Edge.Color.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!