Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.TableStyle.FlowDirection
 Послать отзыв
 Свойство FlowDirection представляет направление, в котором таблица заполняется содержимым.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual DatabaseServices.FlowDirection FlowDirection;
Копировать Код
Public Overridable Property FlowDirection As DatabaseServices.FlowDirection
 Возвращает
 Возвращает направление заполнения таблицы. Перечисление DatabaseServices.FlowDirection.
 Описание
 Свойство FlowDirection представляет направление, в котором таблица заполняется содержимым.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.TableStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!