Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbCurve2dData.Knots
 Послать отзыв
 Свойство Knots представляет узловой вектор NURBS кривой.
 Синтаксис
C#
Visual Basic
Копировать Код
public KnotCollection Knots;
Копировать Код
Public ReadOnly Property Knots As KnotCollection
 Возвращает
 Возвращает узловой вектор NURBS кривой. Тип KnotCollection.
 Описание
 Свойство Knots представляет узловой вектор NURBS кривой.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.NurbCurve2dData, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!