Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Surface.BooleanSubtract
 Послать отзыв
 Метод предназначен для выполнения операции логического вычитания из данной поверхности указанной трехмерной поверхности.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual Surface BooleanSubtract( ref Surface surface2 );
Копировать Код
Public Overridable Function BooleanSubtract( ByRef surface2 As Surface ) As Surface
 Параметры
 Параметры
 Описание
 surface2
 Поверхность, которая вычитается из данной поверхности. Тип Surface.
 Возвращает
 Возвращает поверхность, являющуюся результатом логического вычитания. Тип Surface.
 Описание
 Метод реализует операцию логического вычитания указанной трехмерной поверхности из данной поверхности.
 Если данная поверхность не является производной от класса Surface, результат сохраняется в данной поверхности. В противном случае данная поверхность остается без изменений, а метод возвращает результирующую поверхность.
 В случае отсутствия пересечения поверхностей метод выбрасывает исключение eNoIntersections, возвращает NULL и данный объект не изменяется. Если операцию логического вычитания успешно завершить не удается, метод возвращает NULL, и данный объект не изменяется.
 Замечания
 Данный метод реализован только в ModelerGeometry и в среде пространственного моделирования Spatial Modeler.
 Ссылки
 Teigha.DatabaseServices.Surface, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!