Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.TstackSize
 Послать отзыв
 Синтаксис
C#
Visual Basic
public int TstackSize;
Public Property TstackSize() As Integer
 Описание
 Обеспечивает доступ к текущему значению TSTACKSIZE для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!