Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CurveCurveIntersector3d.PlaneNormal
 Послать отзыв
 Свойство PlaneNormal представляет нормаль плоскости, которая используется для вычисления конфигураций в точке пересечения.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d PlaneNormal;
Копировать Код
Public ReadOnly Property PlaneNormal As Vector3d
 Возвращает
 Возвращает нормаль плоскости. Тип Vector3d.
 Описание
 Свойство PlaneNormal представляет нормаль плоскости, которая используется для вычисления конфигураций в точке пересечения.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.CurveCurveIntersector3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!