Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObject.ObjectClosed
 Послать отзыв
 Событие происходит непосредственно перед закрытием объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public event ObjectClosedEventHandler ObjectClosed;
Копировать Код
Public Event ObjectClosed As ObjectClosedEventHandler
 Возвращает
 Тип данных ObjectClosedEventHandler, представляющий обработчик события.
 Описание
 Событие происходит непосредственно перед закрытием объекта.
 Ссылки
 Teigha.DatabaseServices.DBObject, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!