Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeaderStyle.LeaderLineWeight
 Послать отзыв
 Свойство представляет предусмотренную данным стилем толщину (вес) выносных линий мультивыноски.
 Синтаксис
C#
Visual Basic
Копировать Код
public LineWeight LeaderLineWeight;
Копировать Код
Public Property LeaderLineWeight As LineWeight
 Возвращает
 Возвращает толщину (вес) линий из перечисления DatabaseServices.LineWeight.
 Описание
 Свойство представляет предусмотренную данным стилем толщину (вес) выносных линий мультивыноски.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MLeaderStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!