Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Scale2d.ToArray
 Послать отзыв
 Метод формирует на основе данного объекта двухэлементный массив масштабных коэффициентов по осям X и Y.
 Синтаксис
C#
Visual Basic
Копировать Код
public double[] ToArray();
Копировать Код
Public Function ToArray() As Double()
 Возвращает
 Возвращает двухэлементный массив с масштабными коэффициентами по осям X и Y. Тип double[]. Индекс 0 соответствует направлению X, индекс 1 - направлению Y.
 Описание
 Метод формирует на основе данного объекта двухэлементный массив масштабных коэффициентов по осям X и Y.
 Ссылки
 Teigha.Geometry.Scale2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!