Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeaderStyle.OverwritePropChanged
 Послать отзыв
 Метод позволяет проверить, были ли изменены свойства данного объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool OverwritePropChanged();
Копировать Код
Public Function OverwritePropChanged() As Boolean
 Возвращает
 Возвращает true, если свойства были изменены. В противном случае возвращает false.
 Описание
 Метод позволяет проверить, были ли изменены свойства данного объекта.
 Ссылки
 Teigha.DatabaseServices.MLeaderStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!