Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Solid3dMassProperties.Volume
 Послать отзыв
 Свойство Volume представляет текущий объем твердого тела.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Volume;
Копировать Код
Public ReadOnly Property Volume As Double
 Возвращает
 Возвращает объем твердого тела. Тип double.
 Описание
 Свойство Volume представляет текущий объем твердого тела.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Solid3dMassProperties, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!