Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Filters.SpatialFilterDefinition.GetPoints
 Послать отзыв
 Метод позволяет получить коллекцию точек, которые определяют выдавливаемый контур области фильтра (её основание).
 Синтаксис
C#
Visual Basic
Копировать Код
public Point2dCollection GetPoints();
Копировать Код
Public Function GetPoints() As Point2dCollection
 Возвращает
 Возвращает коллекцию 2D-вершин основания области фильтра. Тип Point2dCollection.
 Описание
 Метод позволяет получить коллекцию точек Point2dCollection, которые определяют выдавливаемый контур области фильтра (её основание).
 Ссылки
 Teigha.DatabaseServices.Filters.SpatialFilterDefinition, Teigha.DatabaseServices.Filters
 Ваши комментарии по поводу этого топика: Послать отзыв!