Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AbstractViewTableRecord.ViewDirection
 Послать отзыв
 Свойство ViewDirection предоставляет доступ к направлению вида в координатах WCS.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d ViewDirection;
Копировать Код
Public Property ViewDirection As Vector3d
 Возвращает
 Возвращает вектор, определяющий направление вида. Тип Vector3d.
 Описание
 Свойство ViewDirection предоставляет доступ к направлению вида в координатах WCS. Это вектор из точки цели в точку камеры вида.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.AbstractViewTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!