Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DataColumn
 Послать отзыв
 Класс DataColumn представляет один столбец таблицы данных DataTable.
 Иерархия классов
Teigha::DatabaseServices::DataColumn
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdDbDataColumn")] public class DataColumn : RXObject;
Копировать Код
<Wrapper("OdDbDataColumn")> Public Class DataColumn Inherits RXObject
 Описание
 Класс DataColumn представляет один столбец таблицы данных DataTable.
 Методы
 Конструкторы
 Имя
 Описание
 DataColumn
 Это обзор перегрузок DataColumn.
 Топики
 Имя
 Описание
 DataColumn Методы
 Ниже перечислены методы класса DataColumn.
 DataColumn Свойства
 Ниже перечислены свойства класса DataColumn.
 Ссылки
 DataColumn Конструктор, DataColumn Методы, DataColumn Свойства, Методы, Топики, DataColumn Методы, DataColumn Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!