Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.SetGridColor
 Послать отзыв
 Метод позволяет задать цвет сетки ячейки, целой строки или всего столбца.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetGridColor( int row, int column, GridLineType gridLineType, ref Color color );
Копировать Код
Public virtual Sub SetGridColor( row As Integer, column As Integer, gridLineType As GridLineType, ByRef color As Color )
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс может равняться -1.
 color
 Новый цвет линий. Тип Color.
 col
 Индекс столбца, тип int. Индекс может равняться -1.
 gridlineType
 Тип линий сетки из перечисления GridLineType.
 Описание
 Метод позволяет задать цвет сетки ячейки, целой строки или всего столбца.
 Чтобы задать одинаковый цвет сразу для нескольких типов линий сетки, можно объединить требуемые типы линий с помощью оператора OR.
 Чтобы задать ячейку, следует указать допустимые индексы строки и столбца. Чтобы задать строку, следует указать допустимый индекс строки и -1 в качестве индекса столбца. Чтобы задать столбец, следует указать допустимый индекс столбца и -1 в качестве индекса строки.
 Замечания
 Для получения того же результата предпочтительнее использовать Table.Cells[row,column].{Top,Bottom,Left,Right}Edge.Color.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!