Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotSettingsShadePlotType
 Послать отзыв
 Данное перечисление определяет режимы тонированной печати, используемые объектом PlotSettings. От режима тонирования зависит, как будут отображаться видовые экраны при выводе на печать.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum PlotSettingsShadePlotType { AsDisplayed = 0, Wireframe = 1, Hidden = 2, Rendered = 3, VisualStyle = 4, RenderPreset = 5 }
Копировать Код
Public Enum PlotSettingsShadePlotType AsDisplayed = 0 Wireframe = 1 Hidden = 2 Rendered = 3 VisualStyle = 4 RenderPreset = 5 End Enum
 Члены
 Члены
 Описание
 AsDisplayed
 Значение: 0. Вывод на печать аналогично выводу на дисплей.
 Wireframe
 Значение: 1. Вывод на печать каркаса, независимо от режима отображения на экране.
 Hidden
 Значение: 2. Вывод на печать скрытых элементов, независимо от режима отображения на экране.
 Rendered
 Значение: 3. Вывод на печать результатов рендеринга вне зависимости от режима отображения на экране.
 VisualStyle
 Значение: 4. Вывод на печать с использованием настроек визуального стиля, на которые ссылается идентификатор режима тонирования.
 RenderPreset
 Значение: 5. Вывод на печать с использованием настроек рендеринга, на которые ссылается идентификатор режима тонирования.
 Описание
 Данное перечисление определяет режимы тонированной печати, используемые объектом PlotSettings. От режима тонирования зависит, как будут отображаться видовые экраны при выводе на печать.
 Ваши комментарии по поводу этого топика: Послать отзыв!