Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve3d.Explode
 Послать отзыв
 Метод разбивает кривую на составляющие ее подкривые.
 Синтаксис
C#
Visual Basic
Копировать Код
public Curve3d[] Explode( ref Interval interval );
Копировать Код
Public Function Explode( ByRef interval As Interval ) As Curve3d()
 Параметры
 Параметры
 Описание
 interval
 Интервал кривой, на котором выполняется разбиение на составляющие подкривые. Тип Interval.
 Возвращает
 Возвращает массив кривых. Тип Curve3d[].
 Описание
 Метод разбивает кривую на составляющие ее подкривые. Если интервал не указан, то рассматривается вся кривая.
 Ссылки
 Teigha.Geometry.Curve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!