Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ObjectContextManager
 Послать отзыв
 Класс ObjectContextManager предназначен для управления коллекцией доступных в чертеже типов контекста.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::DatabaseServices::ObjectContextManager
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdDbObjectContextManager")] public class ObjectContextManager : RXObject;
Копировать Код
<Wrapper("OdDbObjectContextManager")> Public Class ObjectContextManager Inherits RXObject
 Описание
 Класс предназначен для управления коллекцией доступных в чертеже типов контекста. Каждая база данных предоставляет экземпляр ObjectContextManager, который можно использовать для регистрации, отмены регистрации и перечисления пользовательских коллекций контекстов.
 Методы
 Конструкторы
 Teigha.DatabaseServices.ObjectContextManager
 Имя
 Описание
 ObjectContextManager
 Это обзор перегрузок ObjectContextManager.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.DatabaseServices.ObjectContextManager
 Имя
 Описание
 ObjectContextManager Методы
 Ниже перечислены методы класса ObjectContextManager.
 Ссылки
 ObjectContextManager Конструктор, ObjectContextManager Методы, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!