Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.Dimaltu
 Послать отзыв
 Свойство задает формат для размеров, представленных в альтернативных единицах измерения.
 Синтаксис
C#
Visual Basic
Копировать Код
public int Dimaltu;
Копировать Код
Public Property Dimaltu As Integer
 Возвращает
 Возвращает код формата. Тип int.
 Описание
 Свойство задает формат для размеров, представленных в альтернативных единицах измерения.
 Значение
 Описание
 1
 Научный формат.
 2
 Десятичный формат.
 3
 Конструкторский формат.
 4
 Архитектурный (дробный) формат.
 5
 Дробный формат.
 6
 Архитектурный формат.
 7
 Формат с дробной частью.
 8
 Формат по умолчанию, принятый в Microsoft® Windows®. Используются настройки панели управления для десятичного разделителя и группирования разрядов.
 Это свойство действует при условии, что для свойства Dimalt установлено значение true.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!