Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Scale3d.Inverse
 Послать отзыв
 Метод инвертирует данный вектор масштабирования.
 Синтаксис
C#
Visual Basic
Копировать Код
public Scale3d Inverse();
Копировать Код
Public Function Inverse() As Scale3d
 Возвращает
 Возвращает инвертированный вектор масштабирования. Тип Scale3d.
 Описание
 Метод инвертирует данный вектор масштабирования.
 Ссылки
 Teigha.Geometry.Scale3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!