Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.IntersectColor
 Послать отзыв
 Синтаксис
C#
Visual Basic
public int IntersectColor;
Public Property IntersectColor() As Integer
 Описание
 Возвращает или устанавливает текущее значение заголовка INTERSECTIONCOLOR для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!