Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Polyline.Elevation
 Послать отзыв
 Синтаксис
C#
Visual Basic
public double Elevation;
Public Property Elevation() As Double
 Описание
 Обеспечивает доступ к расстоянию между плоскостью полилинии и началом мировых координат.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Polyline, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!