Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.Alignment
 Послать отзыв
 Данный метод позволяет определить выравнивание в ячейках строк указанного типа (строка наименования таблицы, строка с заголовками столбцов, строка данных).
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual CellAlignment Alignment( RowType type );
Копировать Код
Public virtual Function Alignment( type As RowType ) As CellAlignment
 Параметры
 Параметры
 Описание
 type
 Тип строки из перечисления RowType. Возможные значения типа строки: DataRow (строка данных), TitleRow (строка наименования таблицы) и HeaderRow (строка с заголовками столбцов).
 Возвращает
 Возвращает значение для выравнивания из перечисления Teigha.DatabaseServices.CellAlignment.
 Описание
 Данный метод позволяет определить выравнивание в ячейках строк указанного типа (строка наименования таблицы, строка с заголовками столбцов, строка данных). Если тип строки не указан, то по умолчанию используется тип DataRow - строка данных.
 Замечания
 Для получения того же результата предпочтительнее использовать функционал объекта Cell.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!