Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DataCellCollection.DataCellCollection
 Послать отзыв
 Конструктор по умолчанию класса DataCellCollection.
 Синтаксис
C#
Visual Basic
Копировать Код
public DataCellCollection();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса DataCellCollection.
 Ссылки
 Teigha.DatabaseServices.DataCellCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!