Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.HostApplicationServices.GRIPHOVER
 Послать отзыв
 Свойство представляет доступ к индексу цвета ACI невыбранных ручек, когда на них наведен курсор (подсвеченное состояние).
 Синтаксис
C#
Visual Basic
Копировать Код
public short GRIPHOVER;
Копировать Код
Public Property GRIPHOVER As Short
 Возвращает
 Возвращает индекс цвета ручки. Тип short.
 Описание
 Свойство представляет доступ к индексу цвета ACI невыбранных ручек, когда на них наведен курсор (подсвеченное состояние). Индекс цвета принимает следующие значения в диапазоне [0..257]:
 Индекс
 Описание
 0
 ByBlock
 7
 Foreground color
 1
 Red
 2
 Yellow
 3
 Green
 4
 Cyan
 5
 Blue
 6
 Magenta
 7
 Foreground color
 8-255
 Defined by display device
 256
 ByLayer
 257
 No color
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.HostApplicationServices, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!