Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Region.Body
 Послать отзыв
 Свойство Body представляет указатель на текущую геометрию моделлера для данной области.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual IntPtr Body;
Копировать Код
Public Overridable Property Body As IntPtr
 Возвращает
 Возвращает указатель на текущую геометрию моделлера для области. Тип IntPtr.
 Описание
 Свойство Body представляет указатель на текущую геометрию моделлера для данной области.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Region, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!