Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Scale2d
 Послать отзыв
 Структура Scale2d представляет преобразование масштаба в двумерном пространстве.
 Иерархия классов
Teigha::Geometry::Scale2d
 Синтаксис
C#
Visual Basic
Копировать Код
[DefaultMember("Coordinate")] [Wrapper("OdGeScale2d")] public struct Scale2d
Копировать Код
<DefaultMember("Coordinate")> <Wrapper("OdGeScale2d")> Public Structure Scale2d
 Описание
 Структура Scale2d представляет преобразования масштаба в двумерном пространстве (векторы 2D-масштабирования). Scale2d можно рассматривать как двухэлементный массив вещественных чисел двойной точности. Каждый из элементов представляет свой масштабный коэффициент:
0 — масштабный коэффициент для оси X.
1 — масштабный коэффициент для оси Y.
 Замечания
 Вектор масштабирования не должен иметь нулевых компонентов.
 Методы
 Конструкторы
 Имя
 Описание
 Scale2d
 Это обзор перегрузок Scale2d.
 Топики
 Имя
 Описание
 Scale2d Методы
 Ниже перечислены методы класса Scale2d.
 Scale2d Операторы
 Ниже перечислены операторы класса Scale2d.
 Scale2d Свойства
 Ниже перечислены свойства класса Scale2d.
 Ссылки
 Scale2d Конструктор, Scale2d Методы, Scale2d Операторы, Scale2d Свойства, Методы, Топики, Scale2d Методы, Scale2d Операторы, Scale2d Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!