Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.GraphicsInterface.DrawableOverrule
 Послать отзыв
 Класс предназначен для создания переопределения графического представления стандартных примитивов nanoCAD.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::Runtime::Overrule Teigha::GraphicsInterface::DrawableOverrule
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdGiDrawableOverrule")] public class DrawableOverrule : Overrule;
Копировать Код
<Wrapper("OdGiDrawableOverrule")> Public Class DrawableOverrule Inherits Overrule
 Описание
 Класс предназначен для создания переопределения графического представления стандартных примитивов nanoCAD. С помощью класса можно фактически рисовать окружность на чертеже, но она будет отображаться так, как задано в переопределении, например, линией.
 Класс является абстрактным. Чтобы его использовать, необходимо унаследовать его другим классом. Далее, внутри этого класса можно переопределить методы
SetAttributes(Drawable drawable, DrawableTraits traits), чтобы переопределить атрибуты отрисовки;
ViewportDraw(Drawable drawable, ViewportDraw vd), чтобы переопределить геометрию, зависящую от видового экрана;
ViewportDrawLogicalFlags(Drawable drawable, ViewportDraw vd), чтобы переопределить флаги отрисовки текущего видового экрана;
WorldDraw(Drawable drawable, WorldDraw wd), чтобы переопределить геометрию, не зависящую от видового экрана.
 Пример
 В качестве примера приведена команда DrawOverrule_Line_Square, которая переопределяет геометрию линии, превращая её в прямоугольник:
C#
 Копировать Код
 // Создаем класс-наследник DrawableOverrule, чтобы переопределить геометрию class MyDrawableOverrule : Teigha.GraphicsInterface.DrawableOverrule { // Переопределяем геометрию, не зависящую от видового экрана методом WorldDraw public override bool WorldDraw(Teigha.GraphicsInterface.Drawable drawable, Teigha.GraphicsInterface.WorldDraw wd) { // Указываем, что это переопределение для типа Line Teigha.DatabaseServices.Line line = drawable as Teigha.DatabaseServices.Line; if (line == null) return true; // Устанавливаем голубой цвет wd.SubEntityTraits.Color = 4; // Делаем необходимые расчеты геометрических параметров замещающей геометрии // на основе параметров Line. В примере используются начальная и конечная точки. Teigha.Geometry.Point3dCollection points = new Teigha.Geometry.Point3dCollection(); Teigha.Geometry.Vector3d vec = line.StartPoint.GetVectorTo(line.EndPoint); Teigha.Geometry.Vector3d vec1 = vec.GetPerpendicularVector(); points.Add(line.StartPoint - vec1); points.Add(line.StartPoint + vec1); points.Add(line.EndPoint + vec1); points.Add(line.EndPoint - vec1); points.Add(line.StartPoint - vec1); // Указываем графической подсистеме, что следует рисовать вместо линии wd.Geometry.Polyline(points,new Teigha.Geometry.Vector3d(0,0,1),new IntPtr()); // Возвращаем true, так как у нас нет геометрии, зависящей от видового экрана, // и метод ViewportDraw вызывать не нужно return true; } } public partial class Commands { // Создаем в классе статический экземпляр класса переопределения геометрии Line static MyDrawableOverrule drawableOverrule; [Teigha.Runtime.CommandMethod("DrawOverrule_Line_Square")] public void DrawOverrule_Line_Square() { // Если экземпляр класса переопределения drawableOverrule = null, значит активируем переопределение. // Если нет, то отключаем работу переопределения геометрии и линия снова будет рисоваться, как линия if (drawableOverrule == null) { drawableOverrule = new MyDrawableOverrule(); Teigha.Runtime.Overrule.AddOverrule(Teigha.Runtime.RXObject.GetClass(typeof(Teigha.DatabaseServices.Line)), drawableOverrule, false); Teigha.Runtime.Overrule.Overruling = true; } else { Teigha.Runtime.Overrule.Overruling = false; Teigha.Runtime.Overrule.RemoveOverrule(Teigha.Runtime.RXObject.GetClass(typeof(Teigha.DatabaseServices.Line)), drawableOverrule); drawableOverrule.Dispose(); drawableOverrule = null; } } }
 На рисунке ниже приведен результат работы переопределения: сверху - линия, отрисованная после первого вызова команды, которая активировала переопределение графического представления линии, снизу – результат повторного выполнения команды, при котором переопределение линии было отключено.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.Runtime.Overrule
 Имя
 Описание
 Overrule Методы
 Ниже перечислены методы класса Overrule.
 Overrule Свойства
 Ниже перечислены свойства класса Overrule.
 Teigha.GraphicsInterface.DrawableOverrule
 Имя
 Описание
 DrawableOverrule Методы
 Ниже перечислены методы класса DrawableOverrule.
 Ссылки
 DrawableOverrule Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!