Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Spline.ToPolyline
 Послать отзыв
 Метод позволяет получить полилинию, которая аппроксимирует данный сплайн.
 Синтаксис
C#
Visual Basic
Копировать Код
public Curve ToPolyline();
Копировать Код
Public Function ToPolyline() As Curve
 Возвращает
 Возвращает результат аппроксимации сплайна полилинией. Тип Curve.
 Описание
 Метод позволяет получить полилинию, которая аппроксимирует данный сплайн.
 Ссылки
 Teigha.DatabaseServices.Spline, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!