Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Solid3d.StlOut
 Послать отзыв
 Метод предназначен для записи представления данного твердого тела в формате стереолитографии (STL) в файл с указанным именем.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void StlOut( ref String fileName, bool asciiFormat );
Копировать Код
Public Overridable Sub StlOut( ByRef fileName As String, asciiFormat As Boolean )
 Параметры
 Параметры
 Описание
 fileName
 Имя файла. Тип String.
 asciiFormat
 Флаг, определяющий, будет ли записан файл в текстовом формате ASCII (значение true), или же будет записан файл в двоичном формате (значение false). Тип bool.
 Описание
 Метод предназначен для записи представления данного твердого тела в формате стереолитографии (STL) в файл с указанным именем.
 Если файл с таким именем уже существует, он перезаписывается.
 Если аргумент asciiFormat имеет значение true, то формат файла STL будет текстовым ASCII; в противном случае будет записан файл двоичного формата.
 Если хотя бы одна из полученных вершин треугольников имеет хотя бы одну координату из интервала (-inf, 0), все вершины смещаются в октант, где все координаты являются положительными числами из интервала [0.01, +inf).
 Ссылки
 Teigha.DatabaseServices.Solid3d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!