Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObjectCollection.RemoveAt
 Послать отзыв
 Метод удаляет из коллекции объект, расположенный по указанному индексу.
 Синтаксис
C#
Visual Basic
Копировать Код
public void RemoveAt( int index );
Копировать Код
Public Function RemoveAt( index As Integer )
 Параметры
 Параметры
 Описание
 index
 Индекс (int) удаляемого элемента коллекции.
 Описание
 Метод удаляет из коллекции объект, расположенный по указанному индексу.
 Ссылки
 Teigha.DatabaseServices.DBObjectCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!