Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Matrix3d.Identity
 Послать отзыв
 Свойство возвращает единичную матрицу.
 Синтаксис
C#
Visual Basic
Копировать Код
public Matrix3d Identity;
Копировать Код
Public Property Identity() As Matrix3d
 Возвращает
 Возвращает возвращает единичную матрицу. Тип Matrix3d.
 Описание
 Свойство возвращает единичную матрицу.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.Matrix3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!