Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CellRange.TextStyleId
 Послать отзыв
 Свойство обеспечивает доступ к текстовому стилю ячеек диапазона.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectId? TextStyleId;
Копировать Код
Public Property TextStyleId As ObjectId?
 Возвращает
 Возвращает идентификатор объекта текстового стиля. Тип ObjectId.
 Описание
 Свойство обеспечивает доступ к текстовому стилю ячеек диапазона.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.CellRange, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!