Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AttributeReference.AttributeReference
 Послать отзыв
 Конструктор класса по умолчанию.
 Синтаксис
C#
Visual Basic
Копировать Код
public AttributeReference();
Копировать Код
Public Sub New()
 Описание
 Конструктор класса по умолчанию. Инициализирует длину поля равной 0, флаги равны 0 (т.е. атрибут является непостоянным, видимым, неустановленным и не контролируемым), длина тега равна 0. Кроме того, выполняются все инициализации по умолчанию нового объекта DBText.
 Ссылки
 Teigha.DatabaseServices.AttributeReference, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!