Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CustomScale.Denominator
 Послать отзыв
 Свойство представляет знаменатель этого пользовательского масштаба.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Denominator;
Копировать Код
Public Property Denominator() As Double
 Возвращает
 Возвращает знаменатель пользовательского масштаба. Тип double.
 Описание
 Свойство представляет знаменатель этого пользовательского масштаба.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.CustomScale, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!