Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AuditInfo.NumEntities
 Послать отзыв
 Свойство возвращает количество объектов, обработанных данным экземпляром AuditInfo.
 Синтаксис
C#
Visual Basic
Копировать Код
public int NumEntities;
Копировать Код
Public Property NumEntities() As Integer
 Возвращает
 Возвращает количество объектов. Тип int.
 Описание
 Свойство возвращает значение счетчика количества обработанных объектов в данном экземпляре AuditInfo.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.AuditInfo, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!