Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GeoLocationData.DesignPoint
 Послать отзыв
 Свойство обеспечивает доступ к координатам текущей точки DWG данного объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d DesignPoint;
Копировать Код
Public Property DesignPoint As Point3d
 Возвращает
 Возвращает текущую 3D-точку. Тип Point3d.
 Описание
 Свойство обеспечивает доступ к координатам текущей точки DWG данного объекта.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.GeoLocationData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!