Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.LinearEntity2d.Direction
 Послать отзыв
 Свойство Direction представляет единичный направляющий вектор данного линейного объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector2d Direction;
Копировать Код
Public ReadOnly Property Direction As Vector2d
 Возвращает
 Возвращает единичный направляющий вектор. Тип Vector2d.
 Описание
 Свойство Direction представляет единичный направляющий вектор данного линейного объекта. Этот вектор ориентирован в направлении увеличения значения параметра.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.LinearEntity2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!