Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.SetGridProperty
 Послать отзыв
 Метод позволяет задать свойства линий сетки в ячейке, строке или столбце.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetGridProperty( int row, int column, GridLineType gridLineType, GridPropertyParameter gridProperty );
Копировать Код
Public virtual Sub SetGridProperty( row As Integer, column As Integer, gridLineType As GridLineType, gridProperty As GridPropertyParameter )
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс может равняться -1.
 gridProperty
 Свойства линий сетки, которые требуется задать. Тип GridPropertyParameter.
 col
 Индекс столбца, тип int. Индекс может равняться -1.
 gridlineType
 Тип линии сетки из перечисления GridLineType. Допускаются комбинации типов линий с использованием оператора OR.
 Описание
 Метод позволяет задать свойства линий сетки в ячейке, строке или столбце.
 Чтобы задать ячейку, следует указать допустимые индексы строки и столбца. Чтобы задать строку, следует указать допустимый индекс строки и -1 в качестве индекса столбца. Чтобы задать столбец, следует указать допустимый индекс столбца и -1 в качестве индекса строки.
 Чтобы задать одно и то же значение сразу для нескольких типов линий сетки, следует объединить эти типы с помощью оператора OR.
 Перед вызовом этого метода свойство PropertyMask класса Teigha.DatabaseServices.GridPropertyParameter должно быть инициализировано значением, указывающим, какие именно свойства должны быть изменены. Если в метод передается нуль, будут установлены все свойства.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!