Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Filters.SpatialFilterVolume.ToPoint
 Послать отзыв
 Свойство ToPoint возвращает точку "до" преобразованной границы отсечения.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d ToPoint;
Копировать Код
Public ReadOnly Property ToPoint As Point3d
 Возвращает
 Возвращает точку "до" преобразованной границы отсечения. Тип Point3d.
 Описание
 Свойство ToPoint возвращает точку "до" преобразованной границы отсечения.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Filters.SpatialFilterVolume, Teigha.DatabaseServices.Filters
 Ваши комментарии по поводу этого топика: Послать отзыв!