Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DbDictionaryEnumerator.Value
 Послать отзыв
 Свойство возвращает значение текущей записи перечислителя.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.ObjectId Value;
Копировать Код
Public Property Value() As DatabaseServices.ObjectId
 Возвращает
 Возвращает значение текущей записи перечислителя. Тип DatabaseServices.ObjectId.
 Описание
 Свойство обеспечивает доступ к значению текущей записи перечислителя.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.DbDictionaryEnumerator, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!