Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ModelerFlavor
 Послать отзыв
 Данное перечисление определяет возможные уровни поддержки средств геометрического моделирования, доступные в хост-приложениях.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum ModelerFlavor { Full = 0, ObjectsOnly = 2, RegionsOnly = 1 }
Копировать Код
Public Enum ModelerFlavor Full = 0 ObjectsOnly = 2 RegionsOnly = 1 End Enum
 Члены
 Члены
 Описание
 Full
 Значение: 0. Полная поддержка моделирования.
 RegionsOnly
 Значение: 1. Поддержка только для чтения.
 ObjectsOnly
 Значение: 2. Уровень зарезервирован для внутреннего использования.
 Описание
 Данное перечисление определяет возможные уровни поддержки средств геометрического моделирования, доступные в хост-приложениях.
 Ваши комментарии по поводу этого топика: Послать отзыв!