Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObjectReferenceCollection
 Послать отзыв
 Класс DBObjectReferenceCollection представляет коллекцию объектов DBObjectReference.
 Иерархия классов
Teigha::DatabaseServices::DBObjectReferenceCollection
 Синтаксис
C#
Visual Basic
Копировать Код
[DefaultMember("Item")] public sealed class DBObjectReferenceCollection : CollectionBase
Копировать Код
<DefaultMember("Item")> Public NotInheritable Class DBObjectReferenceCollection Inherits CollectionBase
 Описание
 Класс DBObjectReferenceCollection представляет коллекцию ссылок DBObjectReference на объекты базы данных.
 Топики
 Имя
 Описание
 DBObjectReferenceCollection Методы
 Ниже перечислены методы класса DBObjectReferenceCollection.
 DBObjectReferenceCollection Свойства
 Ниже перечислены свойства класса DBObjectReferenceCollection.
 Ссылки
 DBObjectReferenceCollection Методы, DBObjectReferenceCollection Свойства, Топики, DBObjectReferenceCollection Методы, DBObjectReferenceCollection Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!