Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Light.Direction
 Послать отзыв
 Свойство представляет направление удаленного источника света.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d Direction;
Копировать Код
Public Property Direction As Vector3d
 Возвращает
 Возвращает направление излучения света. Тип Vector3d.
 Описание
 Свойство представляет направление удаленного источника света.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Light, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!