Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CoordinateSystem2d
 Послать отзыв
 Структура CoordinateSystem2d представляет двумерную систему координат, которая определяется точкой начала и направлениями осей X и Y.
 Иерархия классов
Teigha::Geometry::CoordinateSystem2d
 Синтаксис
C#
Visual Basic
Копировать Код
public struct CoordinateSystem2d : IFormattable
Копировать Код
Public Structure CoordinateSystem2d Implements IFormattable
 Описание
 Структура CoordinateSystem2d представляет двумерную систему координат, которая определяется точкой начала и направлениями осей X и Y.
 Методы
 Конструкторы
 Имя
 Описание
 CoordinateSystem2d
 Конструктор класса CoordinateSystem2d. Создает экземпляр класса с указанными параметрами.
 Топики
 Имя
 Описание
 CoordinateSystem2d Методы
 Ниже перечислены методы класса CoordinateSystem2d.
 CoordinateSystem2d Операторы
 Ниже перечислены операторы класса CoordinateSystem2d.
 CoordinateSystem2d Свойства
 Ниже перечислены свойства класса CoordinateSystem2d.
 Ссылки
 CoordinateSystem2d Методы, CoordinateSystem2d Операторы, CoordinateSystem2d Свойства, Методы, Топики, CoordinateSystem2d Методы, CoordinateSystem2d Операторы, CoordinateSystem2d Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!