Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод LinetypeTableRecord.ShapeStyleAt
 Послать отзыв
 Синтаксис
C#
Visual Basic
public DatabaseServices::ObjectId ShapeStyleAt(int index);
Public Function ShapeStyleAt(index As Integer) As DatabaseServices.ObjectId
 Параметры
 Параметры
 Описание
 index
 Индекс (начинающийся с 0) строки, для которой производится определение используемого стиля
 Описание
 Этот метод возвращает используемое значение ObjectId для TextStyleTableRecord для формы (или textStyle если вместо формы текстовая строка) для строки LinetypeTableRecord со значением индекса index. Если в строке нет ни формы, ни текста, то возвращается значение null .
 Ссылки
 Teigha.DatabaseServices.LinetypeTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!