Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.BoundaryRepresentation.Brep.Solid
 Послать отзыв
 Свойство Solid представляет твердое тело, связанное с данным объектом.
 Синтаксис
C#
Visual Basic
Копировать Код
public Teigha.DatabaseServices.Solid3d Solid;
Копировать Код
Public Property Solid() As Teigha.DatabaseServices.Solid3d
 Возвращает
 Возвращает твердое тело. Тип Teigha.DatabaseServices.Solid3d.
 Описание
 Свойство Solid представляет твердое тело, связанное с данным объектом.
 Условия
 Только чтение.
 Ссылки
 Teigha.BoundaryRepresentation.Brep, Teigha.BoundaryRepresentation
 Ваши комментарии по поводу этого топика: Послать отзыв!