Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.UnderlayReference.FadeUpperLimit
 Послать отзыв
 Свойство FadeUpperLimit представляет верхнюю границу возможных значений затухания.
 Синтаксис
C#
Visual Basic
Копировать Код
public static int FadeUpperLimit;
Копировать Код
Public Shared ReadOnly Property FadeUpperLimit As Integer
 Возвращает
 Возвращает верхнюю границу возможных значений затухания. Тип int.
 Описание
 Свойство FadeUpperLimit представляет верхнюю границу возможных значений затухания.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.UnderlayReference, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!