Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GraphNode.CycleOut
 Послать отзыв
 Метод возвращает указанную по индексу исходящую циклическую ссылку этого объекта GraphNode.
 Синтаксис
C#
Visual Basic
Копировать Код
public GraphNode CycleOut( int index );
Копировать Код
Public Function CycleOut( index As Integer ) As GraphNode
 Параметры
 Параметры
 Описание
 index
 Индекс циклической ссылки. Тип int.
 Возвращает
 Возвращает исходящую циклическую ссылку. Тип GraphNode. Если указанный индекс недействителен, возвращает нулевой указатель.
 Описание
 Метод возвращает указанную по индексу исходящую циклическую ссылку этого объекта GraphNode. Результат будет действительным только при условии, что с момента последнего вызова метода Graph.FindCycles(), используемого для обнаружения циклов, граф не претерпевал каких-либо промежуточных изменений.
 Ссылки
 Teigha.DatabaseServices.GraphNode, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!