Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.EdgeRef.EdgeRef
 Послать отзыв
 Конструктор класса EdgeRef. Создает ссылку на ребро, используя полные пути подобъектов ребра и грани указанного составного объекта и кривую Curve3d.
 Синтаксис
C#
Visual Basic
Копировать Код
public EdgeRef( ref CompoundObjectId compoundObjectId, SubentityId edgeSubentId, SubentityId faceSubentId, ref Curve3d curve );
Копировать Код
Public Sub New( ByRef compoundObjectId As CompoundObjectId, edgeSubentId As SubentityId, faceSubentId As SubentityId, ByRef curve As Curve3d )
 Параметры
 Параметры
 Описание
 compoundObjectId
 Идентификатор составного объекта. Тип CompoundObjectId.
 edgeSubentId
 Идентификатор подобъекта-ребра. Тип SubentityId.
 faceSubentId
 Идентификатор подобъекта-грани. Тип SubentityId.
 curve
 3D-кривая, используемая для создания этой ссылки на ребро. Тип Curve3d.
 Описание
 Конструктор класса EdgeRef. Создает ссылку на ребро, используя полные пути подобъектов ребра и грани указанного составного объекта и кривую Curve3d.
 Ссылки
 Teigha.DatabaseServices.EdgeRef, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!