Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlaceHolder
 Послать отзыв
 Данный класс предоставляет способ создания экземпляров заглушек для объектов DBObject. Класс не имеет собственных данных и не реализует никаких новых методов.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::GraphicsInterface::Drawable Teigha::DatabaseServices::DBObject Teigha::DatabaseServices::PlaceHolder
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("AcDbPlaceHolder")] public class PlaceHolder : DBObject;
Копировать Код
<Wrapper("AcDbPlaceHolder")> Public Class PlaceHolder Inherits DBObject
 Описание
 Данный класс предоставляет способ создания экземпляров заглушек для объектов DBObject. Класс не имеет собственных данных и не реализует никаких новых методов. Его единственная цель — предоставить объекты для добавления в словари, чтобы строки ключей в словаре можно было связывать с идентификаторами объектов.
 Объекты этого класса используются в словаре имен стилей печати.
 Методы
 Конструкторы
 Teigha.GraphicsInterface.Drawable
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 Drawable
 Конструктор класса Teigha.GraphicsInterface.Drawable. (Унаследован от Drawable)
 Teigha.DatabaseServices.DBObject
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 DBObject
 Конструктор. (Унаследован от DBObject)
 Teigha.DatabaseServices.PlaceHolder
 Имя
 Описание
 PlaceHolder
 Конструктор по умолчанию.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.GraphicsInterface.Drawable
 Имя
 Описание
 Drawable Методы
 Ниже перечислены методы класса Drawable.
 Drawable Свойства
 Ниже перечислены свойства класса Drawable.
 Teigha.DatabaseServices.DBObject
 Имя
 Описание
 DBObject Методы
 Ниже перечислены методы класса DBObject.
 DBObject Свойства
 Ниже перечислены свойства класса DBObject.
 DBObject События
 Ниже перечислены события класса DBObject.
 Ссылки
 Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства, DBObject События
 Ваши комментарии по поводу этого топика: Послать отзыв!