Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Dimtsz
 Послать отзыв
 Синтаксис
C#
Visual Basic
public double Dimtsz;
Public Property Dimtsz() As Double
 Описание
 Возвращает или устанавливает текущее значение DIMTSZ для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!