Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство BulgeVertexCollection.IList_Item
 Послать отзыв
 This is IList_Item, a member of class BulgeVertexCollection.
 Синтаксис
C#
Visual Basic
private Object IList_Item;
Private Property IList_Item() As Object
 Ссылки
 Teigha.DatabaseServices.BulgeVertexCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!