Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.BlockTableRecordEnumerator.MoveNext
 Послать отзыв
 Метод реализует переход перечислителя к следующему блоку в объекте BlockTableRecord.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool MoveNext();
Копировать Код
Public Function MoveNext() As Boolean
 Возвращает
 Возвращает true, если индекс текущего блока не превышает количество элементов в коллекции. В противном случае возвращает false.
 Описание
 Метод реализует переход перечислителя к следующему блоку в объекте BlockTableRecord.
 Ссылки
 Teigha.DatabaseServices.BlockTableRecordEnumerator, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!