Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Viewport.UcsOrthographic
 Послать отзыв
 Свойство UcsOrthographic представляет ортогональный вид в пользовательской системе координат.
 Синтаксис
C#
Visual Basic
Копировать Код
public OrthographicView UcsOrthographic;
Копировать Код
Public ReadOnly Property UcsOrthographic As OrthographicView
 Возвращает
 Возвращает ортогональный вид из перечисления OrthographicView.
 Описание
 Свойство UcsOrthographic представляет ортогональный вид в пользовательской системе координат.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Viewport, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!