Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DataLinkOption
 Послать отзыв
 Данное перечисление определяет опции связывания данных.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum DataLinkOption { Anonymous = 1, DisableInLT = 4, None = 0, PersistCache = 2 }
Копировать Код
Public Enum DataLinkOption Anonymous = 1 DisableInLT = 4 None = 0 PersistCache = 2 End Enum
 Члены
 Члены
 Описание
 Anonymous
 Значение: 1. Связь с данными является анонимной и не должна отображаться в диспетчере связей с данными.
 DisableInLT
 Значение: 4. Отключено в версии LT.
 None
 Значение: 0. Опции не заданы.
 PersistCache
 Значение: 2. Связь с данными имеет постоянный кеш.
 Описание
 Данное перечисление определяет опции связывания данных.
 Ваши комментарии по поводу этого топика: Послать отзыв!