Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Entity.GetObjectSnapPoints(ObjectSnapModes
 Послать отзыв
 Метод вычисляет точки объектной привязки для геометрического объекта с учетом заданного режима привязки и матрицы преобразования блока insertionMat, которая определяет положение объекта внутри блока. Все найденные точки добавляются в существующий массив snapPoints для последующего выбора наиболее подходящей точки привязки.
 Синтаксис
C#
Visual Basic
Копировать Код
public void GetObjectSnapPoints(ObjectSnapModes snapMode, int gsSelectionMark, Point3d pickPoint, Point3d lastPoint, Matrix3d viewTransform, Point3dCollection snapPoints, IntegerCollection geometryIds, Matrix3d insertionMat);
Копировать Код
Public Sub GetObjectSnapPoints(snapMode As ObjectSnapModes, gsSelectionMark As Integer, pickPoint As Point3d, lastPoint As Point3d, viewTransform As Matrix3d, snapPoints As Point3dCollection, geometryIds As IntegerCollection, insertionMat As Matrix3d)
 Параметры
 Параметры
 Описание
 snapMode
 Требуемый режим объектной привязки. Тип ObjectSnapModes
 gsSelectionMark
 GS маркер геометрического подобъекта, участвующего в операции объектной привязки. Тип int
 pickPoint
 Точка указания (в WCS координатах) во время операции объектной привязки. Тип Point3d
 lastPoint
 Точка (в WCS координатах), выбранная перед pickPoint. Тип Point3d
 viewTransform
 Матрица преобразования из WCS в DCS. Тип Matrix3d
 snapPoints
 Заранее созданный массив для добавления точек объектной привязки (может уже содержать точки), на выходе метода добавляет точки привязки объекта. Тип Point3dCollection
 geometryIds
 Не используется
 insertionMat
 Матрица преобразования блока. Тип Matrix3d
 Описание
 Этот метод ведет себя точно так же, как его вариант без параметра insertionMat. Геометрические объекты, содержащиеся в блоке, получают данные о преобразовании блока в параметре insertionMat.
 Ссылки
 Teigha.DatabaseServices.Entity, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!