Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DxfFiler.ReadBytes
 Послать отзыв
 Метод возвращает указанное количество байтов из данного объекта Filer.
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract void ReadBytes(unsigned char[] value);
Копировать Код
Public MustOverride Sub ReadBytes(value() As unsigned char)
 Параметры
 Параметры
 Описание
 value
 Массив байтов. Тип unsigned char[]. Длина массива определяет количество считываемых байтов.
 Описание
 Метод возвращает указанное количество байтов из данного объекта Filer.
 Ссылки
 Teigha.DatabaseServices.DxfFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!