Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.NurbSurface.GetParameterOfPoint
 Послать отзыв
 Метод позволяет определить параметры u и v для заданной точки на поверхности.
 Синтаксис
C#
Visual Basic
Копировать Код
public void GetParameterOfPoint( Point3d point, out double dU, out double dV );
Копировать Код
Public Sub GetParameterOfPoint( point As Point3d, dU As out double, dV As out double )
 Параметры
 Параметры
 Описание
 point
 Точка, лежащая на данной поверхности. Тип Point3d.
 dU
 Выходное значение параметра u. Тип double.
 dV
 Выходное значение параметра v. Тип double.
 Описание
 Метод позволяет определить параметры u и v для заданной точки на поверхности.
 Если поверхность не содержит информации об управляющих вершинах, метод генерирует исключение eFail. Если этот метод в конкретном моделере не реализован, выбрасывается исключение eNotImplementedYet.
 Ссылки
 Teigha.DatabaseServices.NurbSurface, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!