Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DimAssoc.AssocFlag
 Послать отзыв
 Свойство AssocFlag возвращает индекс используемой опорной точки как комбинацию значений из перечисления AssocFlags.
 Синтаксис
C#
Visual Basic
Копировать Код
public AssocFlags AssocFlag;
Копировать Код
Public ReadOnly Property AssocFlag As AssocFlags
 Возвращает
 Возвращает индекс используемой привязки. Комбинация значений из перечисления AssocFlags.
 Описание
 Свойство AssocFlag возвращает индекс (тип) используемой опорной точки как комбинацию значений из перечисления AssocFlags.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.DimAssoc, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!