Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Handle
 Послать отзыв
 Класс Handle предназначен для инкапсуляции 64-битных целочисленных идентификаторов дескрипторов, которые использовались в ряде ранних релизов.
 Иерархия классов
Teigha::DatabaseServices::Handle
 Синтаксис
C#
Visual Basic
Копировать Код
public class Handle;
Копировать Код
Public Class Handle
 Описание
 Класс Handle предназначен для инкапсуляции 64-битных целочисленных идентификаторов дескрипторов, которые использовались в ряде ранних релизов.
 Дескриптор однозначно идентифицирует DBObject в пределах одной базы данных и сохраняется в базе данных вместе с этим объектом, оставаясь неизменным от сеанса к сеансу. Однако в случае разных баз данных дескрипторы уже не уникальны. На самом деле их дублирование в различных базах данных практически неизбежно, поскольку нумерация во всех базах данных начинается с одного и того же начального значения, равного 1, и далее идет по возрастающей.
 Замечания
 Если у вас есть дескриптор, и вы хотите получить ObjectId соответствующего объекта, следует использовать функцию Database.GetObjectId().
 Если у вас есть ObjectId объекта, и вы хотите получить дескриптор этого объекта, следует открыть объект и использовать его функцию DBObject.GetHandle().
 Методы
 Конструкторы
 Имя
 Описание
 Handle
 Конструктор создает экземпляр дескриптора Handle, используя на входе значение 64-битного дескриптора.
 Топики
 Имя
 Описание
 Handle Методы
 Ниже перечислены методы класса Handle.
 Handle Операторы
 Ниже перечислены операторы класса Handle.
 Handle Свойства
 Ниже перечислены свойства класса Handle.
 Ссылки
 Handle Методы, Handle Операторы, Handle Свойства, Методы, Топики, Handle Методы, Handle Операторы, Handle Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!