Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Polyline.ConstantWidth
 Послать отзыв
 Синтаксис
C#
Visual Basic
public double ConstantWidth;
Public Property ConstantWidth() As Double
 Описание
 Обеспечивает доступ к постоянной ширине полилинии.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Polyline, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!