Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CompoundObjectId.Path
 Послать отзыв
 Свойство предоставляет путь вхождений блоков BlockReference.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectIdCollection Path;
Копировать Код
Public Property Path() As ObjectIdCollection
 Возвращает
 Возвращает путь вхождений блоков. Тип ObjectIdCollection.
 Описание
 Свойство предоставляет путь вхождений блоков BlockReference.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.CompoundObjectId, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!