Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotSettings.UseStandardScale
 Послать отзыв
 Свойство UseStandardScale определяет, используется ли листом свойство StdScaleType для расчета текущего масштаба печати.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool UseStandardScale;
Копировать Код
Public ReadOnly Property UseStandardScale As Boolean
 Возвращает
 Возвращает true, если свойство StdScaleType используется для определения текущего масштаба печати. В противном случае возвращает false.
 Описание
 Свойство UseStandardScale определяет, используется ли листом свойство StdScaleType для расчета текущего масштаба печати.
 Если используется, то свойство CustomPrintScale отражает вычисленный масштаб, соответствующий номенклатуре StdScaleType. В противном случае свойства CustomPrintScale и StdScaleType никак не связаны, и следует использовать только свойство CustomPrintScale. Другими словами, свойство CustomPrintScale всегда отражает текущий масштаб, используемый для печати, независимо от того, был ли он вычислен на основе стандартного масштаба или задан непосредственно пользователем.
 Свойство UseStandardScale определяет, как было получено значение CustomPrintScale (вычислено исходя из стандартного масштаба, включая подгонку масштаба под размер текущего формата листа, или же было непосредственного указано пользователем).
 У свойства StdScaleType значение задано всегда, но используется оно для вычисления CustomPrintScale только в том случае, если свойство UseStandardScale имеет значение true.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.PlotSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!