Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBPoint
 Послать отзыв
 Класс представляет геометрический объект "точка", который хранит своё положение в пространстве, вектор нормали для определения направления вытеснения и плоскости отображения, а также толщину — длину вытеснения вдоль нормали. Этот класс поддерживает различные режимы отображения точки в зависимости от системной переменной PDMODE.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::GraphicsInterface::Drawable Teigha::DatabaseServices::DBObject Teigha::DatabaseServices::Entity Teigha::DatabaseServices::DBPoint
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("AcDbPoint")] public class DBPoint : Entity;
Копировать Код
<Wrapper("AcDbPoint")> Public Class DBPoint Inherits Entity
 Описание
 Геометрический объект "точка" содержит значение положения этой точки в пространстве. Он также содержит вектор нормали, который используется для определения направления "вытеснения" и определения плоскости, на которой отображается изображение точек, если они выглядят иначе чем "." (системная переменная PDMODE управляет таким отображением). Геометрический объект "точка" имеет толщину, которая является его "длиной" в направлении ее вектора нормали (это и есть ее длина "вытеснения").
 Методы
 Конструкторы
 Teigha.GraphicsInterface.Drawable
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 Drawable
 Конструктор класса Teigha.GraphicsInterface.Drawable. (Унаследован от Drawable)
 Teigha.DatabaseServices.DBObject
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 DBObject
 Конструктор. (Унаследован от DBObject)
 Teigha.DatabaseServices.DBPoint
 Имя
 Описание
 DBPoint
 Это обзор перегрузок DBPoint.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.GraphicsInterface.Drawable
 Имя
 Описание
 Drawable Методы
 Ниже перечислены методы класса Drawable.
 Drawable Свойства
 Ниже перечислены свойства класса Drawable.
 Teigha.DatabaseServices.DBObject
 Имя
 Описание
 DBObject Методы
 Ниже перечислены методы класса DBObject.
 DBObject Свойства
 Ниже перечислены свойства класса DBObject.
 DBObject События
 Ниже перечислены события класса DBObject.
 Teigha.DatabaseServices.Entity
 Имя
 Описание
 Entity Методы
 Ниже перечислены методы класса Entity.
 Entity Свойства
 Ниже перечислены свойства класса Entity.
 Teigha.DatabaseServices.DBPoint
 Имя
 Описание
 DBPoint Свойства
 Ниже перечислены свойства класса DBPoint.
 Ссылки
 DBPoint Конструктор, DBPoint Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства, DBObject События
 Ваши комментарии по поводу этого топика: Послать отзыв!