Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotStyleTable.AddNewPlotStyle
 Послать отзыв
 Метод добавляет в данную таблицу новый стиль печати с указанным именем.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual PlotStyle AddNewPlotStyle( ref String styleName );
Копировать Код
Public Overridable Function AddNewPlotStyle( ByRef styleName As String ) As PlotStyle
 Параметры
 Параметры
 Описание
 styleName
 Имя нового стиля печати. Тип String.
 Возвращает
 Возвращает вновь добавленный стиль печати. Тип PlotStyle.
 Описание
 Метод добавляет в данную таблицу новый стиль печати с указанным именем.
 Ссылки
 Teigha.DatabaseServices.PlotStyleTable, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!