Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Point3d.*
 Послать отзыв
 Оператор умножения класса Point3d. Реализует преобразование координат этой точки матрицей mat.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d operator *( Matrix3d mat, Point3d a );
Копировать Код
Public Operator *( mat As Matrix3d, a As Point3d )
 Параметры
 Параметры
 Описание
 mat
 Левый операнд. Тип Matrix3d.
 a
 Правый операнд. Тип Point3d.
 Возвращает
 Возвращает точку Point3d в новых координатах.
 Описание
 Оператор умножения класса Point3d. Реализует преобразование координат точки a матрицей mat.
 Ссылки
 Teigha.Geometry.Point3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!