Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Entity.GetSubentityGeometricExtents(FullSubentityPath)
 Послать отзыв
 Метод предназначен для получения трёхмерных пределов (границ) указанного геометрического подобъекта в виде параллелепипеда, ориентированного по осям WCS.
 Синтаксис
C#
Visual Basic
Копировать Код
public Extents3d GetSubentityGeometricExtents(FullSubentityPath subPath);
Копировать Код
Public Function GetSubentityGeometricExtents(subPath As FullSubentityPath) As Extents3d
 Параметры
 Параметры
 Описание
 subPath
 Путь к геометрическому подобъекту. Тип Extents3d
 Возвращает
 Метод возвращает трёхмерные пределы (границы) указанного геометрического подобъекта в виде параллелепипеда, ориентированного по осям WCS. Тип Extents3d
 Описание
 Метод предоставляет информацию о геометрических пределах для геометрического подобъекта. Используется для определения области пространства, занимаемой подобъектом.
 На уровне класса Entity этот объект не применяется и предназначен для переопределения в производных классах.
 Производные классы должны вычислять и возвращать угловые точки (в WCS координатах) параллелепипеда границ (с ребрами, параллельными WCS осям X, Y и Z), который включает 3D пространство геометрического объекта и возвращает эти точки как экземпляр класса Extents в параметре " extents".
 Замечания
 В базовом классе Entity метод не реализован и должен быть переопределён в производных классах для корректного вычисления границ.
 Ссылки
 Teigha.DatabaseServices.Entity, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!