Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GeoLocationData.NumMeshPoints
 Послать отзыв
 Свойство возвращает общее количество точек в сети.
 Синтаксис
C#
Visual Basic
Копировать Код
public int NumMeshPoints;
Копировать Код
Public ReadOnly Property NumMeshPoints As Integer
 Возвращает
 Возвращает количество точек в сети. Тип int.
 Описание
 Свойство возвращает общее количество точек в сети.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.GeoLocationData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!