Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Matrix3d.IsScaledOrtho
 Послать отзыв
 Метод позволяет проверить, перпендикулярны ли друг другу векторы-столбцы линейной части данной матрицы.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsScaledOrtho();
Копировать Код
Public Function IsScaledOrtho() As Boolean
 Возвращает
 Возвращает true, если трехмерные векторы, которые представлены столбцами линейной части этой матрицы, перпендикулярны друг другу. В противном случае возвращает false.
 Описание
 Метод позволяет проверить, перпендикулярны ли друг другу векторы-столбцы линейной части данной матрицы. Реализация метода использует вызов Matrix3d.IsScaledOrtho(Tolerance tolerance) с допуском, равным Tolerance.Global.
 Ссылки
 Teigha.Geometry.Matrix3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!