Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Cell.Contents
 Послать отзыв
 Свойство возвращает коллекцию элементов содержимого данной ячейки.
 Синтаксис
C#
Visual Basic
Копировать Код
public CellContentsCollection Contents;
Копировать Код
Public ReadOnly Property Contents As CellContentsCollection
 Возвращает
 Возвращает коллекцию элементов содержимого данной ячейки. Тип CellContentsCollection.
 Описание
 Свойство возвращает коллекцию CellContentsCollection элементов содержимого данной ячейки.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Cell, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!