Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Surface.UIsoLineDensity
 Послать отзыв
 Свойство UIsoLineDensity представляет плотность изолиний в направлении U, отображаемых при визуализации поверхности в каркасном режиме.
 Синтаксис
C#
Visual Basic
Копировать Код
public short UIsoLineDensity;
Копировать Код
Public Property UIsoLineDensity As Short
 Возвращает
 Возвращает плотность изолиний в направлении U. Тип short.
 Описание
 Свойство UIsoLineDensity представляет плотность изолиний в направлении U, отображаемых при визуализации поверхности в каркасном режиме.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Surface, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!