Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.UnderlayItem.Units
 Послать отзыв
 Свойство Units представляет единицы измерения, используемые данным элементом.
 Синтаксис
C#
Visual Basic
Копировать Код
public UnitsValue Units;
Копировать Код
Public ReadOnly Property Units As UnitsValue
 Возвращает
 Возвращает единицы измерения, используемые элементом. Перечисление UnitsValue.
 Описание
 Свойство Units представляет единицы измерения, используемые данным элементом.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.UnderlayItem, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!