Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CellContent.ContentTypes
 Послать отзыв
 Свойство ContentTypes представляет тип содержимого ячейки таблицы.
 Синтаксис
C#
Visual Basic
Копировать Код
public CellContentTypes ContentTypes;
Копировать Код
Public ReadOnly Property ContentTypes As CellContentTypes
 Возвращает
 Возвращает тип содержимого ячейки таблицы. Перечисление CellContentTypes.
 Описание
 Свойство ContentTypes представляет тип содержимого ячейки таблицы (блок, поле, значение, неизвестный тип).
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.CellContent, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!