Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotSettingsValidator.SetCurrentStyleSheet
 Послать отзыв
 Метод позволяет задать текущую таблицу стилей печати для указанного объекта PlotSettings.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetCurrentStyleSheet( ref PlotSettings plotSet, ref String styleSheetName );
Копировать Код
Public Sub SetCurrentStyleSheet( ByRef plotSet As PlotSettings, ByRef styleSheetName As String )
 Параметры
 Параметры
 Описание
 plotSet
 Входной объект PlotSettings с настройками печати.
 styleSheetName
 Имя текущего стиля листа. Тип String.
 Описание
 Метод позволяет задать текущую таблицу стилей печати для указанного объекта PlotSettings.
 Ссылки
 Teigha.DatabaseServices.PlotSettingsValidator, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!