Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbSurfaceDefinition
 Послать отзыв
 Структура NurbSurfaceDefinition организует данные определения NURBS поверхности, доступ к которым предоставляет метод NurbSurface.GetDefinition.
 Иерархия классов
Teigha::Geometry::NurbSurfaceDefinition
 Синтаксис
C#
Visual Basic
Копировать Код
public struct NurbSurfaceDefinition
Копировать Код
Public Structure NurbSurfaceDefinition
 Описание
 Структура NurbSurfaceDefinition организует данные определения NURBS поверхности, доступ к которым предоставляет метод NurbSurface.GetDefinition.
 Топики
 Имя
 Описание
 NurbSurfaceDefinition Методы
 Ниже перечислены методы класса NurbSurfaceDefinition.
 NurbSurfaceDefinition Операторы
 Ниже перечислены операторы класса NurbSurfaceDefinition.
 NurbSurfaceDefinition Свойства
 Ниже перечислены свойства класса NurbSurfaceDefinition.
 Ссылки
 NurbSurfaceDefinition Методы, NurbSurfaceDefinition Операторы, NurbSurfaceDefinition Свойства, Топики, NurbSurfaceDefinition Методы, NurbSurfaceDefinition Операторы, NurbSurfaceDefinition Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!