Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SubentityOverrule.SubentPtr
 Послать отзыв
 Этот метод переопределяет метод Entity.GetSubentity() и вызывает его в случае реализации по умолчанию.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual Entity SubentPtr( ref Entity entity, FullSubentityPath id );
Копировать Код
Public virtual Function SubentPtr( ByRef entity As Entity, id As FullSubentityPath ) As Entity
 Параметры
 Параметры
 Описание
 entity
 Объект чертежа, Entity.
 id
 Массив полных путей FullSubentityPath, идентифицирующий подобъекты.
 Возвращает
 Возвращает объект Entity.
 Описание
 Этот метод переопределяет метод Entity.GetSubentity() и вызывает его в случае реализации по умолчанию.
 Метод Entity.GetSubentity() в реализации по умолчанию возвращает указатель на подобъект. Метод SubentPtr() настоящего класса позволяет переопределить этот механизм.
 Ссылки
 Teigha.DatabaseServices.SubentityOverrule, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!