Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.ShadowPlaneLocation
 Послать отзыв
 Синтаксис
C#
Visual Basic
public double ShadowPlaneLocation;
Public Property ShadowPlaneLocation() As Double
 Описание
 Обеспечивает доступ к текущему значению Z плоскости земли в мировых координатах. Плоскость земли всегда параллельна плоскости X-Y.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!