Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve3d.GetProjectedEntity
 Послать отзыв
 Метод позволяет получить объект, который является результатом проецирования данной кривой в указанном направлении на заданную плоскость.
 Синтаксис
C#
Visual Basic
Копировать Код
public Entity3d GetProjectedEntity( ref Plane projectionPlane, Vector3d projectDirection );
Копировать Код
Public Function GetProjectedEntity( ByRef projectionPlane As Plane, projectDirection As Vector3d ) As Entity3d
 Параметры
 Параметры
 Описание
 projectionPlane
 Плоскость проецирования. Тип Plane.
 projectDirection
 Направление проецирования. Тип Vector3d.
 Возвращает
 Возвращает результат проецирования в виде объекта Entity3d.
 Описание
 Метод находит объект, который является результатом проецирования этой кривой в указанном направлении на заданную плоскость.
 Реализация использует вызов метода Curve3d.GetProjectedEntity(Plane projectionPlane, Vector3d projectDirection, Tolerance tolerance) с точностью, равной Tolerance.Global.
 Вектор projectDirection не должен быть параллелен плоскости проецирования. Ответственность за удаление созданного объекта-проекции возлагается на вызывающее приложение.
 Замечания
 Возвращаемый объект-проекция может отличаться по типу от исходной кривой, и может даже не быть кривой вовсе. Например, прямая линия проецируется в точку, если она параллельна вектору projectDirection.
 Ссылки
 Teigha.Geometry.Curve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!