Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Viewport.FrontClipOn
 Послать отзыв
 Свойство FrontClipOn позволяет определить, включен ли в данном видовом экране режим переднего отсечения.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool FrontClipOn;
Копировать Код
Public Property FrontClipOn As Boolean
 Возвращает
 Возвращает true, если режим переднего отсечения включен. В противном случае возвращает false.
 Описание
 Свойство FrontClipOn позволяет определить, включен ли в данном видовом экране режим переднего отсечения.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Viewport, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!