Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Point3d.Add
 Послать отзыв
 Метод создает новую точку как результат перемещения данной точки на заданный 3D-вектор.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d Add( Vector3d value );
Копировать Код
Public Function Add( value As Vector3d ) As Point3d
 Параметры
 Параметры
 Описание
 value
 Входной 3D-вектор. Тип Vector3d.
 Возвращает
 Возвращает результирующую точку Point3d.
 Описание
 Метод создает новую точку как результат перемещения данной точки на заданный 3D-вектор value.
 Ссылки
 Teigha.Geometry.Point3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!