Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Ray.Ray
 Послать отзыв
 Конструктор по умолчанию класса Ray.
 Синтаксис
C#
Visual Basic
Копировать Код
public Ray();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса Ray.
 Ссылки
 Teigha.DatabaseServices.Ray, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!