Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector3d.-
 Послать отзыв
 Оператор возвращает вектор, противоположный по направлению входному вектору.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d operator -( Vector3d a );
Копировать Код
Public Operator -( a As Vector3d )
 Параметры
 Параметры
 Описание
 a
 Входной вектор. Тип Vector3d.
 Возвращает
 Возвращает вектор, который противоположен по направлению входному вектору a. Тип Vector3d.
 Описание
 Оператор возвращает вектор, который противоположен по направлению входному вектору a и имеет координаты (-x, -y, -z).
 Ссылки
 Teigha.Geometry.Vector3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!