Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MText.SetColumnHeight
 Послать отзыв
 Метод позволяет задать высоту столбца многострочного текста MText.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetColumnHeight( int index, double height );
Копировать Код
Public Sub SetColumnHeight( index As Integer, height As Double )
 Параметры
 Параметры
 Описание
 index
 Индекс столбца. Тип int.
 height
 Новая высота указанного столбца. Тип double.
 Описание
 Метод позволяет задать высоту столбца (колонки) многострочного текста MText. Этот метод генерирует исключение eInvalidInput, если указанная высота столбца окажется неположительной.
 Ссылки
 Teigha.DatabaseServices.MText, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!