Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ObjectContext.CollectionName
 Послать отзыв
 Свойство представляет имя коллекции контекстов, которой принадлежит данный контекст.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual String CollectionName;
Копировать Код
Public Overridable ReadOnly Property CollectionName As String
 Возвращает
 Возвращает имя коллекции контекстов. Тип String.
 Описание
 Свойство представляет имя коллекции контекстов, которой принадлежит данный контекст. Этот метод позволяет клиенту идентифицировать тип контекста через имя коллекции, чтобы выяснить, разрешено ли использование конкретного контекста в экземпляре коллекции.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.ObjectContext, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!