Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FormattedTableData.GetMergeRange
 Послать отзыв
 Метод позволяет определить диапазон слияния, которому принадлежит указанная ячейка.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual CellRange GetMergeRange( int row, int column );
Копировать Код
Public Overridable Function GetMergeRange( row As Integer, column As Integer ) As CellRange
 Параметры
 Параметры
 Описание
 row
 Индекс строки. Тип int. Должен быть неотрицательным и меньше количества строк в таблице.
 column
 Индекс столбца. Тип int. Должен быть неотрицательным и меньше количества столбцов в таблице.
 Возвращает
 Возвращает диапазон ячеек. Тип CellRange.
 Описание
 Метод позволяет определить диапазон слияния, которому принадлежит указанная ячейка. Возвращаемый диапазон будет недействительным, если ячейка не входит в диапазон слияния.
 Ссылки
 Teigha.DatabaseServices.FormattedTableData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!