Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 LayerTableRecord.LayerTableRecord()
 Послать отзыв
 Конструктор класса
 Синтаксис
C#
Visual Basic
public LayerTableRecord();
Public Sub New()
 Описание
 Конструктор класса.
 Ссылки
 Teigha.DatabaseServices.LayerTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!