Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Assoc2dConstraintGroup.Assoc2dConstraintGroup
 Послать отзыв
 Конструктор по умолчанию.
 Синтаксис
C#
Visual Basic
Копировать Код
public Assoc2dConstraintGroup( ref Teigha.Geometry.Plane plane );
Копировать Код
Public Sub New( ByRef plane As Teigha.Geometry.Plane )
 Параметры
 Параметры
 Описание
 plane
 Плоскость вновь созданной группы ограничений. По умолчанию используется плоскость XY.
 Описание
 Конструктор по умолчанию.
 Ссылки
 Teigha.DatabaseServices.Assoc2dConstraintGroup, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!