Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PolyFaceMesh.NumVertices
 Послать отзыв
 Свойство предоставляет доступ к количеству вершин по координатным точкам в списке вершин сети PolyFaceMesh.
 Синтаксис
C#
Visual Basic
Копировать Код
public int NumVertices;
Копировать Код
Public Property NumVertices() As Integer
 Возвращает
 Возвращает количество вершин в сети PolyFaceMesh, тип int.
 Описание
 Свойство предоставляет доступ к количеству вершин по координатным точкам в списке вершин сети PolyFaceMesh. Это количество не включает FaceRecords в списке вершин.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.PolyFaceMesh, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!