Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.CmlstyleID
 Послать отзыв
 Синтаксис
C#
Visual Basic
public DatabaseServices::ObjectId CmlstyleID;
Public Property CmlstyleID() As DatabaseServices.ObjectId
 Описание
 Возвращает или устанавливает текущее значение ID мультилинии, определенной текущим значением переменной CMLSTYLEID для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!