Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Filters.FilteredBlockIterator
 Послать отзыв
 Данный класс реализует итераторы, выполняющие проход по запросам, которые определены объектами Filter в записях таблицы блоков.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::DatabaseServices::Filters::FilteredBlockIterator
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("AcDbFilteredBlockIterator")] public class FilteredBlockIterator : DisposableWrapper;
Копировать Код
<Wrapper("AcDbFilteredBlockIterator")> Public Class FilteredBlockIterator Inherits DisposableWrapper
 Описание
 Данный класс реализует итераторы, выполняющие проход по запросам, которые определены объектами Filter в записях таблицы блоков. Используется перечислителем FilteredBlockIterator.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.DatabaseServices.Filters.FilteredBlockIterator
 Имя
 Описание
 FilteredBlockIterator Методы
 Ниже перечислены методы класса FilteredBlockIterator.
 FilteredBlockIterator Свойства
 Ниже перечислены свойства класса FilteredBlockIterator.
 Ссылки
 FilteredBlockIterator Методы, FilteredBlockIterator Свойства, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!