Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DiametricDimension.FarChordPoint
 Послать отзыв
 Свойство позволяет получить или задать вторую (дальнюю) точку диаметра на измеряемой окружности или дуге.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d FarChordPoint;
Копировать Код
Public Property FarChordPoint() As Point3d
 Возвращает
 Возвращает вторую (противоположную) точку диаметра. Тип Point3d.
 Описание
 Свойство позволяет получить или задать вторую (дальнюю) точку диаметра на измеряемой окружности или дуге.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.DiametricDimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!