Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Hatch.SetHatchPattern
 Послать отзыв
 Синтаксис
C#
Visual Basic
public void SetHatchPattern(HatchPatternType patternType, ref String patternName);
Public Sub SetHatchPattern(patternType As HatchPatternType, ByRef patternName As String)
 Параметры
 Параметры
 Описание
 patternType
 Номер в перечислении типа образца
 patternName
 Имя образца
 Описание
 Метод устанавливает и тип образца, и его имя для объекта заливки. patternType определяет номер в перечислениях UserDefined (пользовательский), PreDefined (стандартный), или CustomDefined (ранее определенный пользователем). patternName задает имя образца, которое может быть установлено в NULL для типа образца UserDefined.
 Для типа образца UserDefined (пользовательское) вам может потребоваться использование методов SetPatternAngle(angle), SetPatternSpace (space), and SetPatternDouble (double) для определения данных образца до вызова данного метода.
 Для типа образца PreDefined (стандартный), метод читает данные образца из стандартного файла nanoCAD acad.pat и заносит их в объект заливки.
 Для типа CustomDefined вы должны предоставить ваш собственный .pat файл, имя которого должно совпадать с именем образца заливки. Например, вы должны сохранить образец заливки TEST в файл с именем test.pst и файл должен находиться в каталоге, в котором он может быть найден nanoCAD.
 Когда вы используете не предопределенный образец, вы также можете определить масштаб и угол для того, чтобы изменить вид заливки. Note Убедитесь, что вы вызвали метод SetPattern() до вызова метода Hatch.EvaluateHatch.
 Ссылки
 Teigha.DatabaseServices.Hatch, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!