Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SubDMesh.GetAdjacentSubentPath
 Послать отзыв
 Метод предназначен для извлечения подобъектов, смежных с данным SubDMesh.
 Синтаксис
C#
Visual Basic
Копировать Код
public FullSubentityPath[] GetAdjacentSubentPath( FullSubentityPath path, SubentityType type );
Копировать Код
Public Function GetAdjacentSubentPath( path As FullSubentityPath, type As SubentityType ) As FullSubentityPath[]
 Параметры
 Параметры
 Описание
 path
 Исходный подобъект. Тип FullSubentityPath.
 type
 Тип подобъектов, которые должны быть возвращены. Тип SubentityType.
 Возвращает
 Массив путей подобъектов, смежных с указанным путем.
 Описание
 Метод предназначен для извлечения подобъектов, смежных с данным SubDMesh.
 Ссылки
 Teigha.DatabaseServices.SubDMesh, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!