Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FieldEngine.EvaluateFields
 Послать отзыв
 Метод вычисляет поля в указанной базе данных.
 Синтаксис
C#
Visual Basic
Копировать Код
public static FieldUpdateResult EvaluateFields( ref Database pDb, int nContext, ref ObjectIdCollection objIds, ref ObjectIdCollection pFieldsToEvaluate, ref String pszEvaluatorId, EvalFields nEvalFlag );
Копировать Код
Public Shared Function EvaluateFields( ByRef pDb As Database, nContext As Integer, ByRef objIds As ObjectIdCollection, ByRef pFieldsToEvaluate As ObjectIdCollection, ByRef pszEvaluatorId As String, nEvalFlag As EvalFields ) As FieldUpdateResult
 Параметры
 Параметры
 Описание
 pDb
 База данных, в которой вычисляются поля. Тип Database.
 nContext
 Контекст, в котором вычисляется поле. Тип int.
 objIds
 Массив идентификаторов объектов, поля которых вычисляются. Тип ObjectIdCollection.
 pFieldsToEvaluate
 Массив идентификаторов объектов полей, которые должны быть вычислены. Тип ObjectIdCollection.
 pszEvaluatorId
 Идентификатор вычислителя. Тип String.
 nEvalFlag
 Один или более флагов EvalFields. Тип EvalFields.
 Возвращает
 Возвращает объект с информацией о том, сколько полей найдено во время вычисления и сколько из них было вычислено. Тип FieldUpdateResult.
 Описание
 Метод выполняет вычисление полей в указанной базе данных.
 Замечания
 Параметр nContext может быть предопределенным флагом из перечисления FieldEvaluationOptions или определяемым пользователем флагом контекста; этот флаг контекста передается в вычислитель.
 Вычисляются поля для объектов, которые соответствуют ненулевым идентификаторам из массива objIds.
 Вычисляются поля с ненулевыми идентификаторами в массиве pFieldsToEvaluate. Если этот параметр равен null, в указанных объектах вычисляются все поля.
 Вычисляются только те поля, которые соответствуют ненулевым идентификаторам вычислителя pszEvaluatorId. Если этот параметр равен null, в указанных объектах вычисляются все поля.
 Ссылки
 Teigha.DatabaseServices.FieldEngine, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!