Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Field.State
 Послать отзыв
 Свойство State возвращает текущее состояние поля одним из значений перечисления FieldState или их комбинацией.
 Синтаксис
C#
Visual Basic
Копировать Код
public FieldState State;
Копировать Код
Public ReadOnly Property State As FieldState
 Возвращает
 Возвращает состояние поля как значение (или комбинация значений) из перечисления FieldState.
 Описание
 Свойство State возвращает текущее состояние поля одним из значений перечисления FieldState или их комбинацией.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Field, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!