Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocDependency.OwningAction
 Послать отзыв
 Свойство позволяет получить или задать ассоциативное действие AssocAction, являющееся владельцем данной зависимости.
 Синтаксис
C#
Visual Basic
Копировать Код
public Teigha.DatabaseServices.ObjectId OwningAction;
Копировать Код
Public Property OwningAction() As Teigha.DatabaseServices.ObjectId
 Возвращает
 Возвращает ObjectId действия-владельца данной зависимости. Тип Teigha.DatabaseServices.ObjectId.
 Описание
 Свойство позволяет получить или задать ассоциативное действие AssocAction, являющееся владельцем данной зависимости. Каждая зависимость принадлежит некоторому действию AssocAction (как в логическом смысле, так и в смысле базы данных nanoCAD).
 Это свойство не следует задавать напрямую; используйте методы AssocAction.AddDependency() и AssocAction.RemoveDependency().
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.AssocDependency, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!