Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AbstractViewportData.AbstractViewportData
 Послать отзыв
 Конструктор класса AbstractViewportData. Создает экземпляр класса на основе указанного видового экрана.
 Синтаксис
C#
Visual Basic
Копировать Код
public AbstractViewportData( ref RXObject pViewport );
Копировать Код
Public Sub New( ByRef pViewport As RXObject )
 Параметры
 Параметры
 Описание
 pViewport
 Исходный видовой экран. Тип RXObject.
 Описание
 Конструктор класса AbstractViewportData. Создает экземпляр класса на основе указанного видового экрана.
 Ссылки
 Teigha.DatabaseServices.AbstractViewportData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!