Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.UnderlayDefinition.Loaded
 Послать отзыв
 Свойство Loaded позволяет определить, загружена ли в данный момент эта подложка.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool Loaded;
Копировать Код
Public ReadOnly Property Loaded As Boolean
 Возвращает
 Возвращает true, если данная подложка загружена. В противном случае возвращает false.
 Описание
 Свойство Loaded позволяет определить, загружена ли в данный момент эта подложка.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.UnderlayDefinition, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!