Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MText.LineSpacingStyle
 Послать отзыв
 Свойство представляет стиль межстрочного интервала, который определяет применение этого интервала в зависимости от размера символов.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.LineSpacingStyle LineSpacingStyle;
Копировать Код
Public Property LineSpacingStyle As DatabaseServices.LineSpacingStyle
 Возвращает
 Возвращает стиль межстрочного интервала. Перечисление DatabaseServices.LineSpacingStyle.
 Описание
 Свойство представляет стиль межстрочного интервала, который определяет применение этого интервала в зависимости от размера символов.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MText, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!