Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LinkedTableData.GetBlockTableRecordId
 Послать отзыв
 Метод позволяет получить идентификатор записи таблицы блоков, если первым элементом содержимого указанной ячейки является блок.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual DatabaseServices.ObjectId GetBlockTableRecordId( int row, int column );
Копировать Код
Public Overridable Function GetBlockTableRecordId( row As Integer, column As Integer ) As DatabaseServices.ObjectId
 Параметры
 Параметры
 Описание
 row
 Индекс строки. Тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 column
 Индекс столбца. Тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице.
 Возвращает
 Возвращает идентификатор записи таблицы блоков. Тип DatabaseServices.ObjectId. Возвращает нулевой идентификатор, если первый элемент содержимого ячейки не является блоком.
 Описание
 Метод позволяет получить идентификатор записи таблицы блоков, если первым элементом содержимого указанной ячейки является блок.
 Замечания
 Метод выбрасывает исключение eInvalidInput, если индексы строки и/или столбца меньше 0 или больше размера таблицы.
 Ссылки
 Teigha.DatabaseServices.LinkedTableData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!