Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LayoutManager.PlotStyleTableChanged
 Послать отзыв
 Cобытие создается после изменения таблицы стилей печати.
 Синтаксис
C#
Visual Basic
Копировать Код
public event PlotStyleTableChangedEventHandler PlotStyleTableChanged;
Копировать Код
Public Event PlotStyleTableChanged As PlotStyleTableChangedEventHandler
 Описание
 Cобытие создается после изменения таблицы стилей печати.
 Ссылки
 Teigha.DatabaseServices.LayoutManager, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!