Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SectionManager.SectionManager
 Послать отзыв
 Конструктор по умолчанию класса SectionManager.
 Синтаксис
C#
Visual Basic
Копировать Код
public SectionManager();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса SectionManager.
 Ссылки
 Teigha.DatabaseServices.SectionManager, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!