Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DwgFiler.WriteScale3d
 Послать отзыв
 Метод предназначен для записи указанного объекта Scale3d в этот объект Filer.
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract void WriteScale3d( Scale3d value );
Копировать Код
Public MustOverride Sub WriteScale3d( value As Scale3d )
 Параметры
 Параметры
 Описание
 value
 Записываемое в Filer значение. Тип Scale3d.
 Описание
 Метод предназначен для записи указанного объекта Scale3d в этот объект Filer.
 Ссылки
 Teigha.DatabaseServices.DwgFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!