Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.HostApplicationServices.Current
 Послать отзыв
 Свойство обеспечивает доступ к активному в данный момент объекту HostApplicationServices.
 Синтаксис
C#
Visual Basic
Копировать Код
public static HostApplicationServices Current;
Копировать Код
Public Shared Property Current As HostApplicationServices
 Возвращает
 Возвращает активный объект HostApplicationServices.
 Описание
 Свойство обеспечивает доступ к активному в данный момент объекту HostApplicationServices.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.HostApplicationServices, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!