Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.EdgeRef.EdgeRef
 Послать отзыв
 Конструктор класса EdgeRef. Создает ссылку на ребро, используя указанный объект чертежа Entity.
 Синтаксис
C#
Visual Basic
Копировать Код
public EdgeRef( ref DatabaseServices.Entity entity );
Копировать Код
Public Sub New( ByRef entity As DatabaseServices.Entity )
 Параметры
 Параметры
 Описание
 entity
 Объект чертежа, используемый для создания этой ссылки на ребро. Тип DatabaseServices.Entity.
 Описание
 Конструктор класса EdgeRef. Создает ссылку на ребро, используя указанный объект чертежа Entity.
 Ссылки
 Teigha.DatabaseServices.EdgeRef, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!