Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MeshPointMap.DestPoint
 Послать отзыв
 Свойство DestPoint представляет точку назначения.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point2d DestPoint;
Копировать Код
Public Property DestPoint As Point2d
 Возвращает
 Возвращает точку назначения. Тип Point2d.
 Описание
 Свойство DestPoint представляет точку назначения.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MeshPointMap, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!