Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AuditInfo.PrintNumEntities
 Послать отзыв
 Как только количество учтенных в экземпляре AuditInfo объектов оказывается кратным 100, этот метод выводит в файл журнала указанное сообщение (если оно не нулевое) и текущее количество учтенных объектов.
 Синтаксис
C#
Visual Basic
Копировать Код
public void PrintNumEntities( ref String msg );
Копировать Код
Public Sub PrintNumEntities( ByRef msg As String )
 Параметры
 Параметры
 Описание
 msg
 Входная строка, которую требуется напечатать в лог-файл аудита. Тип String.
 Описание
 Как только количество учтенных в экземпляре AuditInfo объектов оказывается кратным 100, этот метод выводит в файл журнала указанное сообщение (если оно не нулевое) и текущее количество учтенных объектов.
 Ссылки
 Teigha.DatabaseServices.AuditInfo, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!