Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DynamicDimensionDataCollection
 Послать отзыв
 Класс DynamicDimensionDataCollection представляет коллекцию объектов DynamicDimensionData.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::DatabaseServices::DynamicDimensionDataCollection
 Синтаксис
C#
Visual Basic
Копировать Код
[DefaultMember("Item")] public class DynamicDimensionDataCollection : DisposableWrapper, System.Collections.ICollection;
Копировать Код
<DefaultMember("Item")> Public Class DynamicDimensionDataCollection Inherits DisposableWrapper Inherits System.Collections.ICollection
 Описание
 Класс DynamicDimensionDataCollection представляет коллекцию объектов DynamicDimensionData.
 Методы
 Конструкторы
 Teigha.DatabaseServices.DynamicDimensionDataCollection
 Имя
 Описание
 DynamicDimensionDataCollection
 Конструктор класса по умолчанию.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.DatabaseServices.DynamicDimensionDataCollection
 Имя
 Описание
 DynamicDimensionDataCollection Методы
 Ниже перечислены методы класса DynamicDimensionDataCollection.
 DynamicDimensionDataCollection Свойства
 Ниже перечислены свойства класса DynamicDimensionDataCollection.
 Ссылки
 DynamicDimensionDataCollection Методы, DynamicDimensionDataCollection Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!