Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DataLink.UpdateOption
 Послать отзыв
 Свойство предоставляет доступ к опциям обновления связи с данными.
 Синтаксис
C#
Visual Basic
Копировать Код
public int UpdateOption;
Копировать Код
Public Property UpdateOption() As Integer
 Возвращает
 Возвращает опции обновления. Тип int.
 Описание
 Свойство предоставляет доступ к опциям обновления связи с данными.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.DataLink, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!