Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Point3d.TransformBy
 Послать отзыв
 Метод применяет к данной точке указанное геометрическое преобразование и возвращает точку в новых координатах.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d TransformBy( Matrix3d leftSide );
Копировать Код
Public Function TransformBy( leftSide As Matrix3d ) As Point3d
 Параметры
 Параметры
 Описание
 leftSide
 Матрица геометрического преобразования. Тип Matrix3d.
 Возвращает
 Возвращает 3D-точку как результат геометрического преобразования текущих координат данной точки. Тип Point3d.
 Описание
 Метод применяет к данной точке геометрическое преобразование, представленное матрицей leftSide, и возвращает точку в новых координатах.
 Ссылки
 Teigha.Geometry.Point3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!