Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод IdPair.ToString ()
 Послать отзыв
 This is ToString, a member of class IdPair.
 Синтаксис
C#
Visual Basic
public String ToString();
Public Function ToString() As String
 Ссылки
 IdPair Структура, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!