Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ObjectClosedEventArgs
 Послать отзыв
 Класс ObjectClosedEventArgs представляет данные для события ObjectClosed базы данных.
 Иерархия классов
Teigha::DatabaseServices::ObjectClosedEventArgs
 Синтаксис
C#
Visual Basic
Копировать Код
public sealed class ObjectClosedEventArgs : EventArgs
Копировать Код
Public NotInheritable Class ObjectClosedEventArgs Inherits EventArgs
 Описание
 Класс ObjectClosedEventArgs представляет данные для события ObjectClosed базы данных.
 Топики
 Имя
 Описание
 ObjectClosedEventArgs Свойства
 Ниже перечислены свойства класса ObjectClosedEventArgs.
 Ссылки
 ObjectClosedEventArgs Свойства, Топики, ObjectClosedEventArgs Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!