Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LayerStateManager.RestoreLayerState
 Послать отзыв
 Метод восстанавливает имя состояния слоя и настройки VPLAYER для указанного видового экрана. Также восстанавливает атрибуты, указанные в clientMask.
 Синтаксис
C#
Visual Basic
Копировать Код
public void RestoreLayerState( ref String name, DatabaseServices.ObjectId id, int undefinedLayerStatePolicy, LayerStateMasks clientMask );
Копировать Код
Public Function RestoreLayerState( ByRef name As String, id As DatabaseServices.ObjectId, undefinedLayerStatePolicy As Integer, clientMask As LayerStateMasks )
 Параметры
 Параметры
 Описание
 name
 Имя состояния слоя, которое станет текущим, тип String.
 id
 Идентификатор ObjectId видового экрана, настройка VPLAYER которого должна быть восстановлена из сохраненных данных, тип DatabaseServices.ObjectId.
 undefinedLayerStatePolicy
 Аргумент, определяющий, следует ли обрабатывать неопределенные слои, тип int.
 clientMask
 Маска атрибутов слоя, тип LayerStateMasks.
 Описание
 Метод восстанавливает имя состояния слоя и настройки VPLAYER для указанного видового экрана. Также восстанавливает атрибуты, указанные в clientMask.
 Ссылки
 Teigha.DatabaseServices.LayerStateManager, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!