Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Viewport.PerspectiveOn
 Послать отзыв
 Свойство PerspectiveOn позволяет определить, включено ли перспективное проецирование в данном видовом экране.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool PerspectiveOn;
Копировать Код
Public Property PerspectiveOn As Boolean
 Возвращает
 Возвращает true, если перспективное проецирование включено. В противном случае возвращает false.
 Описание
 Свойство PerspectiveOn позволяет определить, включено ли перспективное проецирование в данном видовом экране.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Viewport, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!