Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.PlanarEntity.IsPerpendicularTo
 Послать отзыв
 Метод позволяет проверить перпендикулярность данного объекта и указанной плоской поверхности в пределах заданной точности.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsPerpendicularTo( ref PlanarEntity linearEntity, Tolerance tolerance );
Копировать Код
Public Function IsPerpendicularTo( ByRef linearEntity As PlanarEntity, tolerance As Tolerance ) As Boolean
 Параметры
 Параметры
 Описание
 linearEntity
 Проверяемый плоский объект. Тип PlanarEntity.
 tolerance
 Входная геометрическая точность. Тип Tolerance.
 Возвращает
 Возвращает true, если в пределах точности tolerance плоский объект linearEntity можно считать перпендикулярной данной плоской поверхности. В противном случае возвращает false.
 Описание
 Метод позволяет проверить перпендикулярность данного объекта и указанной плоской поверхности linearEntity в пределах точности tolerance.
 Ссылки
 Teigha.Geometry.PlanarEntity, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!