Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.SetTextHeight
 Послать отзыв
 Метод задает высоту текста для элемента содержимого ячейки, который задан указанным индексом в коллекции содержимого.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetTextHeight( int row, int column, int contentIndex, double height );
Копировать Код
Public virtual Sub SetTextHeight( row As Integer, column As Integer, contentIndex As Integer, height As double )
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 contentIndex
 Индекс элемента содержимого ячейки, тип int. Индекс должен быть больше или равен нулю и меньше количества элементов содержимого в ячейке.
 height
 Высота строки, тип double.
 col
 Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
 Описание
 Метод задает высоту текста для элемента содержимого ячейки, который задан указанным индексом в коллекции содержимого.
 Замечания
 Для получения того же результата предпочтительнее использовать Table.Cells[row,column].Contents[i].TextHeight.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!