Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Light.HasTarget
 Послать отзыв
 Свойство позволяет проверить, отображает ли данный источник света ручку цели для выбора направления распространения света.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool HasTarget;
Копировать Код
Public Property HasTarget As Boolean
 Возвращает
 Возвращает true, если ручка отображается. В противном случае возвращает false.
 Описание
 Свойство позволяет проверить, отображает ли данный источник света ручку цели для выбора направления распространения света.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Light, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!