Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Mline.AppendSegment
 Послать отзыв
 Метод добавляет новую вершину в конец этого объекта MLine.
 Синтаксис
C#
Visual Basic
Копировать Код
public void AppendSegment( Point3d newVertex );
Копировать Код
Public Sub AppendSegment( newVertex As Point3d )
 Параметры
 Параметры
 Описание
 newVertex
 Точка, которая используется для создания новой вершины мультилинии. Тип Point3d.
 Описание
 Метод добавляет вершину в конец этого объекта MLine. Новая вершина получается проецированием указанной 3D-точки newVertex на плоскость данного объекта MLine.
 Ссылки
 Teigha.DatabaseServices.Mline, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!