Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObject.GetEventExtender(bool)
 Послать отзыв
 Метод предоставляет доступ к расширителю событий данного объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public DBObjectEventExtender GetEventExtender(bool create);
Копировать Код
Public Function GetEventExtender(create As bool) As DBObjectEventExtender
 Параметры
 Параметры
 Описание
 create
 Флаг, указывающий, создавать ли расширитель при вызове метода. Тип bool
 Возвращает
 Возвращает расширитель событий данного объекта. Тип DBObjectEventExtender
 Описание
 Метод позволяет расширить события данного объекта.
 Ссылки
 Teigha.DatabaseServices.DBObject, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!