Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Событие Database.WblockMappingAvailable
 Послать отзыв
 Синтаксис
C#
Visual Basic
public event IdMappingEventHandler WblockMappingAvailable;
Public Event WblockMappingAvailable As IdMappingEventHandler
 Описание
 Событие показывает, что операция wblock, выполняется в базе данных чертежа.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!