Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.EdgeRef.EdgeRef
 Послать отзыв
 Конструктор класса EdgeRef. Создает ссылку на ребро на базе указанного полного пути к подобъекту.
 Синтаксис
C#
Visual Basic
Копировать Код
public EdgeRef( FullSubentityPath path );
Копировать Код
Public Sub New( path As FullSubentityPath )
 Параметры
 Параметры
 Описание
 path
 Полный путь к подобъекту, который используется для создания ссылки на ребро. Тип FullSubentityPath.
 Описание
 Конструктор класса EdgeRef. Создает ссылку на ребро на базе указанного полного пути к подобъекту.
 Ссылки
 Teigha.DatabaseServices.EdgeRef, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!