Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CurveBoundaryData.IsEqualTo
 Послать отзыв
 Метод предназначен для сравнения 2D- и 3D-ориентаций, а также 2D- и 3D-кривых в этом определении границы с данными в указанном объекте CurveBoundaryData.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsEqualTo( CurveBoundaryData a );
Копировать Код
Public Function IsEqualTo( a As CurveBoundaryData ) As Boolean
 Параметры
 Параметры
 Описание
 a
 Входной объект, с которым выполняется сравнение. Тип CurveBoundaryData.
 Возвращает
 Возвращает true, если сравнение подтверждает идентичность 2D- и 3D-ориентаций, а также 2D- и 3D-кривых для сравниваемых объектов. В противном случае возвращает false.
 Описание
 Метод предназначен для сравнения 2D- и 3D-ориентаций, а также 2D- и 3D-кривых в этом определении границы с данными в указанном объекте CurveBoundaryData.
 Ссылки
 Teigha.Geometry.CurveBoundaryData, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!