Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.FormatMeasurement
 Послать отзыв
 Метод возвращает строку MText, представляющую форматированное значение размера объекта Dimension.
 Синтаксис
C#
Visual Basic
Копировать Код
public String FormatMeasurement( double measurement, ref String dimensionText );
Копировать Код
Public Function FormatMeasurement( measurement As Double, ByRef dimensionText As String ) As String
 Параметры
 Параметры
 Описание
 measurement
 Измеренное значение размера, которое должно быть отформатировано. Тип double.
 dimensionText
 Размерный текст для форматирования. Тип String.
 Возвращает
 Возвращает строку с отформатированным значением размера. Тип String.
 Описание
 Метод возвращает строку MText, представляющую форматированное значение размера объекта Dimension.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!