Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.FieldId
 Послать отзыв
 Метод предназначен для получения идентификатора ObjectId поля в указанной ячейке.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual DatabaseServices.ObjectId FieldId( int row, int col );
Копировать Код
Public virtual Function FieldId( row As Integer, col As Integer ) As DatabaseServices.ObjectId
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 col
 Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
 Возвращает
 Возвращает идентификатор ObjectId поля. Тип DatabaseServices.ObjectId.
 Описание
 Метод предназначен для получения идентификатора ObjectId поля в ячейке, заданной индексами строки и столбца.
 Замечания
 Для получения того же результата предпочтительнее использовать Table.Cells[row,column].FieldId.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!