Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод RasterImage.SetClipBoundaryToWholeImage
 Послать отзыв
 Синтаксис
C#
Visual Basic
public void SetClipBoundaryToWholeImage();
Public Sub SetClipBoundaryToWholeImage()
 Описание
 Устанавливает контур показа совпадающим с границами изображения. Любой существующий контур показа будет удален.
 Ссылки
 Teigha.DatabaseServices.RasterImage, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!