Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DxfFiler.ReadPoint2d
 Послать отзыв
 Метод возвращает двумерную точку Point2d из текущего элемента этого объекта Filer.
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract Point2d ReadPoint2d();
Копировать Код
Public MustOverride Function ReadPoint2d() As Point2d
 Возвращает
 Возвращает двумерную точку. Тип Point2d.
 Описание
 Метод возвращает двумерную точку Point2d из текущего элемента этого объекта Filer.
 Ссылки
 Teigha.DatabaseServices.DxfFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!