Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.LineSegment3d.LineSegment3d
 Послать отзыв
 Конструктор класса LineSegment3d. Создает экземпляр класса с указанными параметрами. Строит линейный сегмент с концами в указанных точках.
 Синтаксис
C#
Visual Basic
Копировать Код
public LineSegment3d( Point3d point1, Point3d point2 );
Копировать Код
Public Sub New( point1 As Point3d, point2 As Point3d )
 Параметры
 Параметры
 Описание
 point1
 Первая входная точка (начальная). Тип Point3d.
 point2
 Вторая входная точка (конечная). Тип Point3d.
 Описание
 Конструктор класса LineSegment3d. Создает экземпляр класса с указанными параметрами. Строит линейный сегмент с концами в точках point1 и point2.
 Ссылки
 Teigha.Geometry.LineSegment3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!