Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство IdPair.IsCloned
 Послать отзыв
 This is IsCloned, a member of class IdPair.
 Синтаксис
C#
Visual Basic
public bool IsCloned;
Public Property IsCloned() As bool
 Ссылки
 IdPair Структура, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!