Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.RenderEnvironment.DoubleRangeParameter
 Послать отзыв
 Структура DoubleRangeParameter используется для представления информации о ближнем и дальнем тумане.
 Иерархия классов
Teigha::DatabaseServices::RenderEnvironment::DoubleRangeParameter
 Синтаксис
C#
Visual Basic
Копировать Код
public struct DoubleRangeParameter
Копировать Код
Public Structure DoubleRangeParameter
 Описание
 Структура DoubleRangeParameter используется для представления информации о ближнем и дальнем тумане.
 Методы
 Конструкторы
 Имя
 Описание
 DoubleRangeParameter
 Конструктор структуры DoubleRangeParameter.
 Топики
 Имя
 Описание
 DoubleRangeParameter Свойства
 Ниже перечислены свойства класса DoubleRangeParameter.
 Ссылки
 DoubleRangeParameter Свойства, Методы, Топики, DoubleRangeParameter Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!