Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GripData.HotGripInvokesRightClick
 Послать отзыв
 Свойство определяет, назначено ли выделение ручки нажатию правой кнопки мыши.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool HotGripInvokesRightClick;
Копировать Код
Public Property HotGripInvokesRightClick As Boolean
 Возвращает
 Возвращает true, если ручка становится активной при нажатии правой кнопки мыши. В противном случае возвращает false.
 Описание
 Свойство определяет, назначено ли выделение ручки нажатию правой кнопки мыши.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.GripData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!