Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObjectCollection.Contains
 Послать отзыв
 Метод осуществляет поиск заданного объекта в коллекции.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool Contains( ref DBObject value );
Копировать Код
Public Function Contains( ByRef value As DBObject ) As Boolean
 Параметры
 Параметры
 Описание
 value
 Искомый объект типа DBObject.
 Возвращает
 Возвращает true, если совпадающий с аргументом объект типа DBObject в коллекции найден. В противном случае возарвщвет false.
 Описание
 Метод осуществляет поиск заданного объекта в коллекции и возвращает true, если совпадение найдено.
 Ссылки
 Teigha.DatabaseServices.DBObjectCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!