Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Section.IndicatorFillColor
 Послать отзыв
 Свойство IndicatorFillColor представляет цвет заливки индикатора секущей плоскости.
 Синтаксис
C#
Visual Basic
Копировать Код
public Teigha.Colors.Color IndicatorFillColor;
Копировать Код
Public Property IndicatorFillColor As Teigha.Colors.Color
 Возвращает
 Возвращает цвет заливки. Тип Teigha.Colors.Color.
 Описание
 Свойство IndicatorFillColor представляет цвет заливки индикатора секущей плоскости.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Section, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!