Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CurveBoundaryData.GetCurve3ds
 Послать отзыв
 Метод предоставляет массив трехмерных кривых для данного объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public Entity3d[] GetCurve3ds();
Копировать Код
Public Function GetCurve3ds() As Entity3d()
 Возвращает
 Возвращает массив трехмерных кривых для данного объекта. Тип Entity3d[].
 Описание
 Метод предоставляет массив трехмерных кривых для данного объекта.
 Ссылки
 Teigha.Geometry.CurveBoundaryData, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!