Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Userr5
 Послать отзыв
 Синтаксис
C#
Visual Basic
public double Userr5;
Public Property Userr5() As Double
 Описание
 Обеспечивает доступ к текущему значению USERR5 для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!