Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод RasterImage.ImageSize
 Послать отзыв
 Синтаксис
C#
Visual Basic
public Vector2d ImageSize(bool getCachedValue);
Public Function ImageSize(getCachedValue As bool) As Vector2d
 Параметры
 Параметры
 Описание
 getCachedValue
 признак, указывающий, будет ли значение из объекта использоваться
 Описание
 Размер исходного изображения в точках (эта величина может также быть получена прямо из объекта RasterImageDef).
 При определенных редких условиях полученное значение может отличаться от значения, которое находится в объекте RasterImageDef (например, сразу после изменения размера в операции редактирования растрового изображения, но перед тем, как геометрический объект RasterImage будет изменен).
 Если параметр bGetCachedValue равен false (это значение по умолчанию), то размер изображения запрашивается у связанного объекта RasterImageDef. Если этот объект не может быть открыт, то используется значение, которое хранится в данном объекте. Если bGetCachedValue равен true, то функция требует вернуть значение из данного объекта.
 Ссылки
 Teigha.DatabaseServices.RasterImage, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!