Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.ExternalSurface.IsSphere
 Послать отзыв
 Свойство IsSphere позволяет проверить, является ли данная внешняя поверхность сферой.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsSphere;
Копировать Код
Public ReadOnly Property IsSphere As Boolean
 Возвращает
 Возвращает true, если данная внешняя поверхность является сферой. В противном случае возвращает false.
 Описание
 Свойство IsSphere определяет тип данной внешней поверхности и возвращает true, если она является сферой.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.ExternalSurface, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!