Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ItemLocator.LevelIndex
 Послать отзыв
 Свойство представляет индекс, определяющий текущий уровень элемента в массиве относительно первого уровня.
 Синтаксис
C#
Visual Basic
Копировать Код
public int LevelIndex;
Копировать Код
Public Property LevelIndex() As Integer
 Возвращает
 Возвращает уровень данного элемента. Тип int.
 Описание
 Свойство представляет индекс, определяющий текущий уровень элемента в массиве относительно первого уровня.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.ItemLocator, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!