Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.AugmentedPolylineCurve3d.AugmentedPolylineCurve3d
 Послать отзыв
 Конструктор класса AugmentedPolylineCurve3d. Создает экземпляр класса с указанными управляющими вершинами, узлами и векторами.
 Синтаксис
C#
Visual Basic
Копировать Код
public AugmentedPolylineCurve3d( ref KnotCollection knots, ref Point3dCollection controlPoints, ref Vector3dCollection vectorBundle );
Копировать Код
Public Sub New( ByRef knots As KnotCollection, ByRef controlPoints As Point3dCollection, ByRef vectorBundle As Vector3dCollection )
 Параметры
 Параметры
 Описание
 knots
 Входной узловой вектор. Тип KnotCollection.
 controlPoints
 Входной массив управляющих 3D-вершин. Тип Point3dCollection.
 vectorBundle
 Входной массив 3D-векторов. Тип Vector3dCollection.
 Описание
 Конструктор класса AugmentedPolylineCurve3d. Создает экземпляр класса с указанными управляющими вершинами, узлами и векторами.
 Ссылки
 Teigha.Geometry.AugmentedPolylineCurve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!