Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Dimzin
 Послать отзыв
 Синтаксис
C#
Visual Basic
public int Dimzin;
Public Property Dimzin() As Integer
 Описание
 Возвращает или устанавливает текущее значение DIMZIN для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!