Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Viewport.UcsPerViewport
 Послать отзыв
 Свойство UcsPerViewport позволяет определить, следует ли сохранять связь ПСК с данным видовым экраном.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool UcsPerViewport;
Копировать Код
Public Property UcsPerViewport As Boolean
 Возвращает
 Возвращает true, если связь ПСК с данным видовым экраном сохраняется. В противном случае возвращает false.
 Описание
 Свойство UcsPerViewport позволяет определить, сохраняется ли связь ПСК с данным видовым экраном. Если да, то при каждой активации видового экрана активируется и связанная с ним ПСК и наоборот.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Viewport, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!