Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector2d.XAxis
 Послать отзыв
 Свойство XAxis представляет направление оси X.
 Синтаксис
C#
Visual Basic
Копировать Код
public static Vector2d XAxis;
Копировать Код
Public Shared ReadOnly Property XAxis As Vector2d
 Возвращает
 Возвращает направление оси X. Тип Vector2d.
 Описание
 Свойство XAxis представляет направление оси X.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.Vector2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!