Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AuditInfo
 Послать отзыв
 Класс предназначен для отслеживания общей информации, получаемой в ходе выполнения аудита базы данных.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::DatabaseServices::AuditInfo
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdDbAuditInfo")] public class AuditInfo : DisposableWrapper;
Копировать Код
<Wrapper("OdDbAuditInfo")> Public Class AuditInfo Inherits DisposableWrapper
 Описание
 Класс предназначен для отслеживания общей информации, получаемой в ходе выполнения аудита базы данных.
 Методы
 Конструкторы
 Teigha.DatabaseServices.AuditInfo
 Имя
 Описание
 AuditInfo
 Конструктор класса по умолчанию.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.DatabaseServices.AuditInfo
 Имя
 Описание
 AuditInfo Методы
 Ниже перечислены методы класса AuditInfo.
 AuditInfo Свойства
 Ниже перечислены свойства класса AuditInfo.
 Ссылки
 AuditInfo Методы, AuditInfo Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!