Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocAction.RemoveAllDependencies
 Послать отзыв
 Метод позволяет удалить все зависимости AssocDependencies, хранящиеся в векторе зависимостей данного действия, и опционально стереть их.
 Синтаксис
C#
Visual Basic
Копировать Код
public void RemoveAllDependencies( bool alsoEraseThem );
Копировать Код
Public Sub RemoveAllDependencies( alsoEraseThem As Boolean )
 Параметры
 Параметры
 Описание
 alsoEraseThem
 Флаг стирания зависимостей после их удаления из данного действия. Тип bool.
 Описание
 Метод удаляет все зависимости AssocDependencies, хранящиеся в векторе зависимостей данного действия, и опционально стирает их.
 Если действие владеет объектом AssocActionBody с переопределенным методом RemoveAllDependenciesOverride(), то для уведомления об удалении зависимостей вызывается переопределенный метод. Это происходит после того, как все зависимости уже удалены.
 Ссылки
 Teigha.DatabaseServices.AssocAction, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!