Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор BlockReference.BlockReference (IntPtr, bool)
 Послать отзыв
 This is BlockReference, a member of class BlockReference.
 Синтаксис
C#
Visual Basic
internal BlockReference(IntPtr unmanagedObjPtr, bool autoDelete);
Friend Sub New(unmanagedObjPtr As IntPtr, autoDelete As bool)
 Ссылки
 Teigha.DatabaseServices.BlockReference, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!