Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Matrix3d.ToString
 Послать отзыв
 Метод реализует эквивалентное представление данной матрицы в виде текстовой строки с учетом региональных и языковых настроек.
 Синтаксис
C#
Visual Basic
Копировать Код
public String ToString( ref IFormatProvider provider );
Копировать Код
Public Function ToString( ByRef provider As IFormatProvider ) As String
 Параметры
 Параметры
 Описание
 provider
 Провайдер региональных и языковых настроек. Тип IFormatProvider.
 Возвращает
 Возвращает строковое представление данной матрицы. Тип String.
 Описание
 Метод реализует эквивалентное представление данной матрицы в виде текстовой строки с учетом региональных и языковых настроек, определяемых указанным провайдером provider.
 Ссылки
 Teigha.Geometry.Matrix3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!