Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ObjectContextCollection.GetEnumerator
 Послать отзыв
 Метод предоставляет перечислитель ObjectContextCollectionEnumerator для данной коллекции.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectContextCollectionEnumerator GetEnumerator();
Копировать Код
Public Function GetEnumerator() As ObjectContextCollectionEnumerator
 Возвращает
 Возвращает перечислитель данной коллекции. Тип ObjectContextCollectionEnumerator.
 Описание
 Метод предоставляет перечислитель ObjectContextCollectionEnumerator для данной коллекции.
 Ссылки
 Teigha.DatabaseServices.ObjectContextCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!