Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.Dimclrt
 Послать отзыв
 Свойство задает или возвращает цвет размерного текста.
 Синтаксис
C#
Visual Basic
Копировать Код
public Colors.Color Dimclrt;
Копировать Код
Public Property Dimclrt As Colors.Color
 Возвращает
 Возвращает цвет размерного текста. Тип Colors.Color.
 Описание
 Свойство задает или возвращает цвет размерного текста.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!