Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Dimaltz
 Послать отзыв
 Синтаксис
C#
Visual Basic
public int Dimaltz;
Public Property Dimaltz() As Integer
 Описание
 Возвращает или устанавливает текущее значение DIMALTZ для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!