Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Polyline3d.InsertVertexAt
 Послать отзыв
 Этот метод вставляет объект PolylineVertex3d, заданный аргументом newVertex, в список вершин полилинии непосредственно после вершины PolylineVertex3d, заданной аргументом indexVertex.
 Синтаксис
C#
Visual Basic
Копировать Код
public void InsertVertexAt( ref PolylineVertex3d indexVertex, ref PolylineVertex3d newVertex );
Копировать Код
Public Sub InsertVertexAt( ByRef indexVertex As PolylineVertex3d, ByRef newVertex As PolylineVertex3d )
 Параметры
 Параметры
 Описание
 indexVertex
 Вершина PolylineVertex3d, после которой должна быть вставлена новая вершина. Чтобы вставить новую вершину в начало полилинии, в аргументе indexVertex следует передать Null.
 newVertex
 Вставляемая вершина, тип PolylineVertex3d.
 Описание
 Этот метод вставляет объект PolylineVertex3d, заданный аргументом newVertex, в список вершин полилинии непосредственно после вершины PolylineVertex3d, заданной аргументом indexVertex, а затем делает полилинию владельцем вершины. Для успешного выполнения этой операции полилиния должна быть резидентной в базе данных.
 Чтобы вставить вершину в начало полилинии, в аргументе indexVertex следует передать значение Null.
 Вставленная вершина должна быть явно закрыта вызывающим приложением после возврата из метода InsertVertexAt().
 Ссылки
 Teigha.DatabaseServices.Polyline3d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!