Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.LineSegment2d.LineSegment2d
 Послать отзыв
 Конструктор класса LineSegment2d. Создает линейный сегмент с началом в указанной точке, направление и длина которого определяются заданным вектором.
 Синтаксис
C#
Visual Basic
Копировать Код
public LineSegment2d( Point2d point1, Vector2d vector );
Копировать Код
Public Sub New( point1 As Point2d, vector As Vector2d )
 Параметры
 Параметры
 Описание
 point1
 Начальная точка линейного сегмента. Тип Point2d.
 vector
 Направляющий вектор линейного сегмента. Тип Vector2d. Определяет как направление, так и конечную точку линейного сегмента. Не может быть нулевой длины.
 Описание
 Конструктор класса LineSegment2d. Создает линейный сегмент с началом в указанной точке, направление и длина которого определяются заданным вектором.
 Ссылки
 Teigha.Geometry.LineSegment2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!