Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotStyleDescriptor.==
 Послать отзыв
 Оператор возвращает true в случае равенства операндов и false в противном случае.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool operator ==( PlotStyleDescriptor a, PlotStyleDescriptor b );
Копировать Код
Public Operator ==( a As PlotStyleDescriptor, b As PlotStyleDescriptor )
 Параметры
 Параметры
 Описание
 a
 Левый операнд, тип PlotStyleDescriptor.
 b
 Правый операнд, тип PlotStyleDescriptor.
 Возвращает
 Возвращает true в случае равенства операндов и false в противном случае.
 Описание
 Оператор возвращает true в случае равенства операндов и false в противном случае.
 Ссылки
 Teigha.DatabaseServices.PlotStyleDescriptor, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!