Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DefaultLightingType
 Послать отзыв
 Перечисление DefaultLightingType определяет типы источников света по умолчанию, которые доступны для видовых экранов и полноценной визуализации.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum DefaultLightingType { OneDistantLight = 0, TwoDistantLights = 1 }
Копировать Код
Public Enum DefaultLightingType OneDistantLight = 0 TwoDistantLights = 1 End Enum
 Члены
 Члены
 Описание
 OneDistantLight
 Значение: 0. Освещение по умолчанию обеспечивается одним удаленным источником света и одним источником рассеянного света.
 TwoDistantLights
 Значение: 1. Освещение по умолчанию обеспечивается двумя удаленными источниками света и одним источником рассеянного света.
 Описание
 Перечисление DefaultLightingType определяет типы источников света по умолчанию, которые доступны для видовых экранов и полноценной визуализации. Один из этих типов используется, когда пользовательское освещение не задано или когда восстанавливается освещение по умолчанию.
 Ваши комментарии по поводу этого топика: Послать отзыв!