Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Surfu
 Послать отзыв
 Синтаксис
C#
Visual Basic
public int Surfu;
Public Property Surfu() As Integer
 Описание
 Обеспечивает доступ к текущему значению SURFU для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!