Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Filters.IndexUpdateData.GetIdFlags
 Послать отзыв
 Метод предназначен для получения 8-битного флага, связанного с идентификатором объекта ObjectId.
 Синтаксис
C#
Visual Basic
Копировать Код
public byte GetIdFlags( ObjectId id );
Копировать Код
Public Function GetIdFlags( id As ObjectId ) As Byte
 Параметры
 Параметры
 Описание
 id
 Входной идентификатор объекта, с которым связан флаг. Тип ObjectId.
 Возвращает
 Возвращает флаг, связанный с указанным ObjectId. Тип byte.
 Описание
 Метод предназначен для получения 8-битного флага, связанного с идентификатором объекта ObjectId.
 Ссылки
 Teigha.DatabaseServices.Filters.IndexUpdateData, Teigha.DatabaseServices.Filters
 Ваши комментарии по поводу этого топика: Послать отзыв!