Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LinkedTableData.DeleteRow
 Послать отзыв
 Метод позволяет удалить из данной таблицы заданное количество строк, начиная со строки с указанным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void DeleteRow( int index, int rowsNumberToDelete );
Копировать Код
Public Overridable Sub DeleteRow( index As Integer, rowsNumberToDelete As Integer )
 Параметры
 Параметры
 Описание
 index
 Индекс первой удаляемой строки. Тип int.
 rowsNumberToDelete
 Количество удаляемых строк. Тип int.
 Описание
 Метод позволяет удалить из данной таблицы заданное количество строк, начиная со строки с указанным индексом.
 Замечания
 Метод выбрасывает исключение eInvalidInput, если количество удаляемых строк превышает количество строк в данной связанной таблице.
 Ссылки
 Teigha.DatabaseServices.LinkedTableData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!