Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CellRange.DataFormat
 Послать отзыв
 Свойство обеспечивает доступ к формату данных в ячейках диапазона.
 Синтаксис
C#
Visual Basic
Копировать Код
public String DataFormat;
Копировать Код
Public Property DataFormat As String
 Возвращает
 Возвращает формат данных. Тип String.
 Описание
 Свойство обеспечивает доступ к формату данных в ячейках диапазона.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.CellRange, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!