Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.KnotCollection.GetDistinctKnots
 Послать отзыв
 Метод позволяет получить последовательность уникальных узлов в данной коллекции.
 Синтаксис
C#
Visual Basic
Копировать Код
public DoubleCollection GetDistinctKnots();
Копировать Код
Public Function GetDistinctKnots() As DoubleCollection
 Возвращает
 Возвращает коллекцию уникальных узлов. Тип DoubleCollection.
 Описание
 Метод позволяет получить последовательность уникальных (несовпадающих) узлов в данной коллекции.
 Ссылки
 Teigha.Geometry.KnotCollection, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!