Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 BlockTableRecord.PaperSpace
 Послать отзыв
 Свойство предназначено для хранения названия служебного блока листов dwg-документа.
 Синтаксис
C#
Visual Basic
Копировать Код
public static readonly string PaperSpace;
Копировать Код
Public Shared ReadOnly PaperSpace As String
 Возвращает
 Тип данных string.
 Описание
 Свойство предназначено для быстрого поиска служебного блока листа в базе данных чертежа, и хранит в себе название этого блока.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.BlockTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!