Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LayerViewportProperties.PlotStyleName
 Послать отзыв
 Свойство представляет имя стиля печати.
 Синтаксис
C#
Visual Basic
Копировать Код
public String PlotStyleName;
Копировать Код
Public Property PlotStyleName As String
 Возвращает
 Возвращает имя стиля печати. Тип String.
 Описание
 Свойство представляет имя стиля печати.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.LayerViewportProperties, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!