Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Point3d.Point3d
 Послать отзыв
 Конструктор класса Point3d. Создает 3D-точку в указанной 2D-точке в системе координат заданной плоскости.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d( ref PlanarEntity plane, Point2d point );
Копировать Код
Public Sub New( ByRef plane As PlanarEntity, point As Point2d )
 Параметры
 Параметры
 Описание
 plane
 Входная плоскость. Тип PlanarEntity.
 point
 Входная 2D-точка. Тип Point2d.
 Описание
 Конструктор класса Point3d. Создает 3D-точку в указанной 2D-точке point в системе координат заданной плоскости plane. Искомая позиция определяется выражением p + uAxis * pnt2d.x + vAxis * pnt2d.y, где начало координат p и координатные оси uAxis и vAxis возвращает метод plane.GetCoordinateSystem().
 Ссылки
 Teigha.Geometry.Point3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!