Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Xline.Xline
 Послать отзыв
 Конструктор.
 Синтаксис
C#
Visual Basic
Копировать Код
public Xline( IntPtr unmanagedObjPtr, bool autoDelete );
Копировать Код
Public Sub New( unmanagedObjPtr As IntPtr, autoDelete As Boolean )
 Параметры
 Параметры
 Описание
 unmanagedObjPtr
 Неуправляемый указатель на исходный объект. Тип IntPtr.
 autoDelete
 Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.
 Описание
 Конструктор.
 Ссылки
 Teigha.DatabaseServices.Xline, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!