Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.EllipticalCone.MajorAxis
 Послать отзыв
 Свойство MajorAxis представляет направление большой оси данного эллиптического конуса.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d MajorAxis;
Копировать Код
Public ReadOnly Property MajorAxis As Vector3d
 Возвращает
 Возвращает направляющий вектор большой оси эллиптического конуса. Тип Vector3d.
 Описание
 Свойство MajorAxis представляет направление большой оси данного эллиптического конуса.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.EllipticalCone, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!