Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор DataLinkManager.DataLinkManager
 Послать отзыв
 This is DataLinkManager, a member of class DataLinkManager.
 Синтаксис
C#
Visual Basic
internal DataLinkManager(IntPtr unmanagedObjPtr, bool autoDelete);
Friend Sub New(unmanagedObjPtr As IntPtr, autoDelete As bool)
 Ссылки
 Teigha.DatabaseServices.DataLinkManager, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!