Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Position3d.Set
 Послать отзыв
 Метод переопределяет координатную привязку данного объекта позиции, используя указанные значения (x,y,z).
 Синтаксис
C#
Visual Basic
Копировать Код
public void Set( double x, double y, double z );
Копировать Код
Public Sub [Set]( x As Double, y As Double, z As Double )
 Параметры
 Параметры
 Описание
 x
 Входная координата по оси X. Тип double.
 y
 Входная координата по оси Y. Тип double.
 z
 Входная координата по оси Z. Тип double.
 Описание
 Метод переопределяет координатную привязку данного объекта позиции, используя указанные значения (x,y,z).
 Ссылки
 Teigha.Geometry.Position3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!