Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ProxyResurrectionCompletedEventArgs.ApplicationName
 Послать отзыв
 Свойство ApplicationName представляет имя приложения.
 Синтаксис
C#
Visual Basic
Копировать Код
public String ApplicationName;
Копировать Код
Public ReadOnly Property ApplicationName As String
 Возвращает
 Возвращает имя приложения. Тип String.
 Описание
 Свойство ApplicationName представляет имя приложения.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.ProxyResurrectionCompletedEventArgs, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!