Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FieldEvaluator.EvaluatorId
 Послать отзыв
 Метод предоставляет идентификаторы вычислителя, поддерживаемые данным объектом.
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract String EvaluatorId();
Копировать Код
Public MustOverride Function EvaluatorId() As String
 Возвращает
 Возвращает идентификатор вычислителя. Если их несколько, идентификаторы разделяются запятыми. Тип String.
 Описание
 Метод предоставляет идентификаторы вычислителя, поддерживаемые данным вычислителем FieldEvaluator.
 Замечания
 Может возвращать более одного идентификатора вычислителя, если вычислитель поддерживает несколько идентификаторов. Если возвращается более одного идентификатора, они перечисляются через запятую.
 Ссылки
 Teigha.DatabaseServices.FieldEvaluator, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!