Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 DimStyleTableRecord.Dimldrblks
 Послать отзыв
 Свойство отвечает за вид окончания выноски.
 Синтаксис
C#
Visual Basic
Копировать Код
public string Dimldrblks { get; set; }
Копировать Код
Public Property Dimldrblks As String
 Возвращает
 Возвращает тип данных string.
 Описание
 В свойстве хранится настройка внешнего вида окончания выноски в виде строки string. В строке записано название того вида выноски, который в настоящий момент установлен.
 Каждый вид окончания выноски является блоком и в чертеже хранится, как тип данных BlockTableRecord в таблице блоков BlockTable.
 Коллекция блоков - окончаний выносок хранится в шаблоне чертежа и через API недоступна. Отдельные блоки из этой коллекции появляются в таблице блоков чертежа после того, как к ним обратились через системную переменную DIMLDRBLK или через пользовательский интерфейс:
  При изменении системной переменной DIMLDRBLK будет создан новый размерный стиль под названием <переопределение> на основе текущего с новым значением DIMLDRBLK.
 Также изменение вида окончания размерной линии возможно через системную переменную DIMLDRBLK.
 Таблица соответствия названий вида окончания и названий в настройках размерных стилей:
 Значение string
 Значение в пользовательском интерфейсе
 .
 Значение по умолчанию, или  - "Закрашенная замкнутая"
 ClosedBlank
  - "Пустая замкнутая"
 Closed
  - "Замкнутая"
 DOT
  - "Точка"
 ARCHTICK
  - "Двойная засечка"
 Oblique
  - "Наклон"
 Open
  - "Разомкнутая"
 Origin
  - "Указатель начала"
 Origin2
  - "Указатель начала 2"
 Open90
  - "Прямой угол"
 OPEN30
  - "Разомкнутая 30"
 DotSmall
  - "Малая точка"
 DotBlank
  - "Контурная точка"
 Small
  - "Контурная малая точка"
 BoxBlank
  - "Прямоугольник"
 BoxFilled
  - "Закрашенный прямоугольник"
 DatumBlank
  - "Треугольник"
 DatumFilled
  - "Закрашенный треугольник"
 Integral
  - "Интеграл"
 NONE
  - "Нет"
 Условия
 Чтение и запись.
 Пример
 Пример изменения значения свойства Dimldrblks в размерном стиле Standard:
C#
 Копировать Код
public partial class Commands { [Teigha.Runtime.CommandMethod("DimldrblksChange")] public void DimldrblksStandardDimStyle() { // Получение ссылки на активный документ HostMgd.ApplicationServices.Document doc = HostMgd.ApplicationServices.Application.DocumentManager.MdiActiveDocument; // Получение ссылки на редактор документа HostMgd.EditorInput.Editor ed = doc.Editor; // Получение ссылки на базу данных документа Teigha.DatabaseServices.Database db = doc.Database; // Начало транзакции с базой данных документа using (Teigha.DatabaseServices.Transaction trans = db.TransactionManager.StartTransaction()) { // Открываем таблицу размерных стилей для чтения Teigha.DatabaseServices.DimStyleTable dimStyleTable = trans.GetObject(db.DimStyleTableId, Teigha.DatabaseServices.OpenMode.ForRead) as Teigha.DatabaseServices.DimStyleTable; // Находим в таблице размерных стилей ObjectId нужного стиля по его названию Teigha.DatabaseServices.ObjectId styleId = dimStyleTable["Standard"]; // Открываем таблицу размерного стиля для изменений Teigha.DatabaseServices.DimStyleTableRecord obj = trans.GetObject(styleId, Teigha.DatabaseServices.OpenMode.ForWrite) as Teigha.DatabaseServices.DimStyleTableRecord; ed.WriteMessage($"nDimldrblks before: {obj.Dimldrblks}"); // Изменяем окончание выноски на двойную засечку obj.Dimldrblks = "ARCHTICK"; ed.WriteMessage($"nDimldrblks after: {obj.Dimldrblks}"); trans.Commit(); } } }
 Ссылки
 Teigha.DatabaseServices.DimStyleTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!