Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.HyperLink.SubLocation
 Послать отзыв
 Свойство обеспечивает доступ к вложенной именованной позиции, связанной с этим объектом HyperLink.
 Синтаксис
C#
Visual Basic
Копировать Код
public String SubLocation;
Копировать Код
Public Property SubLocation As String
 Возвращает
 Возвращает вложенную именованную позицию этой гиперссылки. Тип String.
 Описание
 Свойство обеспечивает доступ к вложенной именованной позиции, связанной с этим объектом HyperLink.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.HyperLink, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!