Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GraphNodeCollection.Item
 Послать отзыв
 Свойство предоставляет доступ к элементу коллекции по его индексу.
 Синтаксис
C#
Visual Basic
Копировать Код
public GraphNode this[int index];
Копировать Код
Public Property Item( index As Integer ) As GraphNode
 Возвращает
 Возвращает элемент коллекции. Тип GraphNode.
 Описание
 Свойство предоставляет доступ к элементу коллекции по его индексу. В случае недействительного индекса выбрасывается исключение ArgumentOutOfRangeException.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.GraphNodeCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!