Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SubDMesh.Vertices
 Послать отзыв
 Свойство представляет доступ к коллекции вершин на базовом уровне сети.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3dCollection Vertices;
Копировать Код
Public Property Vertices() As Point3dCollection
 Возвращает
 Возвращает коллекцию вершин. Тип Point3dCollection.
 Описание
 Свойство представляет доступ к коллекции вершин на базовом уровне сети.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.SubDMesh, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!