Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Viewport.LinkedToSheetView
 Послать отзыв
 Свойство LinkedToSheetView позволяет определить, связан ли данный видовой экран с видом в пространстве листа.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool LinkedToSheetView;
Копировать Код
Public ReadOnly Property LinkedToSheetView As Boolean
 Возвращает
 Возвращает true, если данный видовой экран связан с видом в пространстве листа. В противном случае возвращает false.
 Описание
 Свойство LinkedToSheetView позволяет определить, связан ли данный видовой экран с видом в пространстве листа.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Viewport, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!