Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.ExternalSurface.IsNurbSurface
 Послать отзыв
 Свойство IsNurbSurface позволяет проверить, может ли данный экземпляр внешней поверхности быть представлен определением, которое является нативным для графической системы платформы.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsNurbSurface;
Копировать Код
Public ReadOnly Property IsNurbSurface As Boolean
 Возвращает
 Возвращает true, если данный экземпляр внешней поверхности может быть представлен нативным определением в графической системе платформы. В противном случае возвращает false.
 Описание
 Свойство IsNurbSurface позволяет проверить, может ли данный экземпляр внешней поверхности быть представлен определением, которое является нативным для графической системы платформы.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.ExternalSurface, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!