Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocArrayCommonParameters.GetRowSpacing
 Послать отзыв
 Метод извлекает расстояние между рядами в массиве.
 Синтаксис
C#
Visual Basic
Копировать Код
public double GetRowSpacing( out String expression, out String evaluatorId );
Копировать Код
Public Function GetRowSpacing( ByRef expression As out String, ByRef evaluatorId As out String ) As Double
 Параметры
 Параметры
 Описание
 expression
 Выражение для параметра. Тип String.
 evaluatorId
 Полученное строковое представление идентификатора вычислителя. Тип String.
 Возвращает
 Возвращает приращение расстояние между рядами массива. Тип double.
 Описание
 Метод извлекает расстояние между рядами в массиве.
 Если для параметра выражение отсутствует, то после выполнения метода строки expression и evaluatorId после выполнения метода остаются пустыми.
 Ссылки
 Teigha.DatabaseServices.AssocArrayCommonParameters, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!