Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Ole2Frame.DrawAspect
 Послать отзыв
 Свойство представляет характер представления объекта при отрисовке или получении данных.
 Синтаксис
C#
Visual Basic
Копировать Код
public OleDvAspect DrawAspect;
Копировать Код
Public Property DrawAspect As OleDvAspect
 Возвращает
 Возвращает значение из перечисления OleDvAspect.
 Описание
 Свойство представляет характер представления объекта при отрисовке или получении данных.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Ole2Frame, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!