Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FormattedTableData.GetGridLineWeight
 Послать отзыв
 Метод предназначен для получения толщины линий сетки в ячейке, строке или столбце.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual LineWeight GetGridLineWeight( int row, int column, GridLineType gridLinetype );
Копировать Код
Public Overridable Function GetGridLineWeight( row As Integer, column As Integer, gridLinetype As GridLineType ) As LineWeight
 Параметры
 Параметры
 Описание
 row
 Индекс строки. Тип int. Может принимать значение -1.
 column
 Индекс столбца. Тип int. Может принимать значение -1.
 gridLinetype
 Тип линий сетки из перечисления GridLineType. Можно задать комбинацию типов линий сетки, объединив их с помощью оператора OR.
 Возвращает
 Возвращает толщину (вес) линий из перечисления LineWeight.
 Описание
 Метод предназначен для получения толщины линий сетки в ячейке, строке или столбце.
 Чтобы указать ячейку, следует передать действительные индексы строки и столбца. Чтобы указать строку, следует передать действительный индекс строки и -1 в качестве индекса столбца. Чтобы указать столбец, следует передать действительный индекс столбца и -1 в качестве индекса строки.
 Ссылки
 Teigha.DatabaseServices.FormattedTableData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!