Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Hatch.RemoveLoopAt
 Послать отзыв
 Синтаксис
C#
Visual Basic
public void RemoveLoopAt(int loopIndex);
Public Sub RemoveLoopAt(loopIndex As Integer)
 Параметры
 Параметры
 Описание
 loopIndex
 Индекс удаляемой петли
 Описание
 Метод удаляет петлю и все ее данные из объекта заливки.
 Ссылки
 Teigha.DatabaseServices.Hatch, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!