Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Mline.IsClosed
 Послать отзыв
 Свойство предоставляет возможность проверить, является ли данная мультилиния замкнутой.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsClosed;
Копировать Код
Public Property IsClosed As Boolean
 Возвращает
 Возвращает true, если мультилиния является замкнутой. В противном случае возвращает false.
 Описание
 Свойство предоставляет возможность проверить, является ли данная мультилиния замкнутой.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Mline, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!