Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.Dimalt
 Послать отзыв
 Свойство управляет режимом отображения размеров в альтернативных единицах измерения.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool Dimalt;
Копировать Код
Public Property Dimalt As Boolean
 Возвращает
 Возвращает true, если размеры отображаются в альтернативных единицах измерения. В противном случае возвращает false.
 Описание
 Свойство позволяет включать режим отображения размеров в альтернативных единицах измерения.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!