Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Extents3d.MaxPoint
 Послать отзыв
 Свойство обеспечивает доступ к максимальной точке данного объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d MaxPoint;
Копировать Код
Public ReadOnly Property MaxPoint As Point3d
 Возвращает
 Возвращает максимальную точку данного объекта. Тип Point3d.
 Описание
 Свойство обеспечивает доступ к максимальной точке данного объекта.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Extents3d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!