Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Matrix3d.IsEqualTo
 Послать отзыв
 Метод позволяет выяснить, совпадает ли данная матрица с указанной матрицей в пределах заданного допуска.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsEqualTo( Matrix3d mat, Tolerance tolerance );
Копировать Код
Public Function IsEqualTo( mat As Matrix3d, tolerance As Tolerance ) As Boolean
 Параметры
 Параметры
 Описание
 mat
 Входная матрица для сравнения. Тип Matrix3d.
 tolerance
 Допуск, используемый для сравнеия. Тип Tolerance.
 Возвращает
 Возвращает true в случае совпадения матриц и false в противном случае.
 Описание
 Метод позволяет выяснить, совпадает ли данная матрица с матрицей mat в пределах допуска tolerance. Возвращает true, если каждый столбец данной матрицы как вектор равен соответствующему столбцу матрицы mat.
 Ссылки
 Teigha.Geometry.Matrix3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!