Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 ViewportTableRecord.SnapPair
 Послать отзыв
 Свойство предназначено для изменения плоскости черчения в изометрическом режиме.
 Синтаксис
C#
Visual Basic
public short SnapPair;
Public Property SnapPair() As short
 Возвращает
 Возвращает тип данных short (Int16):
0 – слева (по умолчанию);
1 – сверху;
2 – слева.
 Описание
 С помощью свойства можно переключать плоскость черчения видового экрана в изометрическом режиме. Значение свойства совпадает со значением системной переменной SNAPISOPAIR для данного видового экрана.
 Условия
 Чтение и запись.
 Ссылки
 ViewportTableRecord Класс, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!