Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.UnderlayFile.Items
 Послать отзыв
 Свойство Items представляет элементы, на которые должны быть ссылки.
 Синтаксис
C#
Visual Basic
Копировать Код
public UnderlayItemCollection Items;
Копировать Код
Public ReadOnly Property Items As UnderlayItemCollection
 Возвращает
 Возвращает коллекцию элементов, на которые должны быть ссылки. Тип UnderlayItemCollection.
 Описание
 Свойство Items представляет элементы, на которые должны быть ссылки.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.UnderlayFile, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!