Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObject.OpenedForModify
 Послать отзыв
 Событие происходит каждый раз, когда объект открывается для изменения в режиме OpenMode.ForWrite.
 Синтаксис
C#
Visual Basic
Копировать Код
public event EventHandler OpenedForModify;
Копировать Код
Public Event OpenedForModify As EventHandler
 Возвращает
 Тип данных EventHandler, представляющий обработчик события.
 Описание
 Событие происходит каждый раз, когда объект открывается для изменения в режиме OpenMode.ForWrite.
 Ссылки
 Teigha.DatabaseServices.DBObject, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!