Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Cylinder.Set
 Послать отзыв
 Метод переопределяет данный объект, используя новые ось цилиндра, его радиус и начало координат.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Set( double radius, Point3d origin, Vector3d axisOfSymmetry );
Копировать Код
Public Sub Set( radius As Double, origin As Point3d, axisOfSymmetry As Vector3d )
 Параметры
 Параметры
 Описание
 radius
 Радиус основания цилиндра. Тип double.
 origin
 Начало координат цилиндра. Тип Point3d.
 axisOfSymmetry
 Ось цилиндра. Тип Vector3d.
 Описание
 Метод переопределяет данный объект, используя новые ось цилиндра, его радиус и начало координат.
 Ссылки
 Teigha.Geometry.Cylinder, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!