Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Section.Boundary
 Послать отзыв
 Свойство Boundary представляет секущую плоскость, ограниченную линией сечения, двумя боковыми линиями и задней линией.
 Синтаксис
C#
Visual Basic
Копировать Код
public IList<Point3d> Boundary;
Копировать Код
Public ReadOnly Property Boundary As IList(Of Point3d)
 Возвращает
 Возвращает список точек границы. Тип IList<Point3d>.
 Описание
 Свойство Boundary представляет секущую плоскость, ограниченную линией сечения, двумя боковыми линиями и задней линией.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Section, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!