Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AbstractViewTableRecord.SetSun
 Послать отзыв
 Метод задаёт объект солнца для данного видового экрана.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.ObjectId SetSun( ref DatabaseServices.DBObject sun );
Копировать Код
Public Function SetSun( ByRef sun As DatabaseServices.DBObject ) As DatabaseServices.ObjectId
 Параметры
 Параметры
 Описание
 sun
 Входной идентификатор DatabaseServices.DBObject объекта солнца.
 Возвращает
 Возвращает идентификатор объекта солнца, связанного с видовым экраном. Тип DatabaseServices.ObjectId.
 Описание
 Метод задаёт объект солнца для данного видового экрана.
 Ссылки
 Teigha.DatabaseServices.AbstractViewTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!