Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 DimStyleTableRecord.Dimjogang
 Послать отзыв
 Свойство отвечает за угол излома размерной линии радиуса.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual double Dimjogang { get; set; }
Копировать Код
Public Overridable Property Dimjogang As Double
 Возвращает
 Возвращает тип данных double.
 Описание
 В свойстве хранится величина угла излома (в радианах) размерной линии радиуса в виде числа double. Возможные значения – углы в радианах от п/36 до п/2 (от 0,08726646 до 1,57079632). Значение по умолчанию - п/4 (0,785).
 Свойство также доступно через системную переменную DIMJOGANG и пользовательское меню в окне изменения/создания размерного стиля:
  При изменении системной переменной DIMJOGANG будет создан новый размерный стиль под названием <переопределение> на основе текущего с новым значением DIMJOGANG.
 Условия
 Чтение и запись.
 Пример
 Пример изменения угла излома размерной линии радиуса (значения свойства Dimjogang) в размерном стиле Standard:
C#
 Копировать Код
public partial class Commands { [Teigha.Runtime.CommandMethod("DimjogangChange")] public void DimjogangStandardDimStyle() { // Получение ссылки на активный документ HostMgd.ApplicationServices.Document doc = HostMgd.ApplicationServices.Application.DocumentManager.MdiActiveDocument; // Получение ссылки на редактор документа HostMgd.EditorInput.Editor ed = doc.Editor; // Получение ссылки на базу данных документа Teigha.DatabaseServices.Database db = doc.Database; // Начало транзакции с базой данных документа using (Teigha.DatabaseServices.Transaction trans = db.TransactionManager.StartTransaction()) { // Открываем таблицу размерных стилей для чтения Teigha.DatabaseServices.DimStyleTable dimStyleTable = trans.GetObject(db.DimStyleTableId, Teigha.DatabaseServices.OpenMode.ForRead) as Teigha.DatabaseServices.DimStyleTable; // Находим в таблице размерных стилей ObjectId нужного стиля по его названию Teigha.DatabaseServices.ObjectId styleId = dimStyleTable["Standard"]; // Открываем таблицу размерного стиля для изменений Teigha.DatabaseServices.DimStyleTableRecord obj = trans.GetObject(styleId, Teigha.DatabaseServices.OpenMode.ForWrite) as Teigha.DatabaseServices.DimStyleTableRecord; ed.WriteMessage($"nDimjogang before: {obj.Dimjogang}"); // Изменяем угол излома размерной линии радиуса obj.Dimjogang = 1.57; ed.WriteMessage($"nDimjogang after: {obj.Dimjogang}"); trans.Commit(); } } }
 Результат работы команды DimjogangChange:
 Было:
 Стало:
 Ссылки
 Teigha.DatabaseServices.DimStyleTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!