Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbCurve2dFitData.KnotParam
 Послать отзыв
 Свойство KnotParam представляет метод узловой параметризации кривой.
 Синтаксис
C#
Visual Basic
Копировать Код
public KnotParameterizationEnum KnotParam;
Копировать Код
Public ReadOnly Property KnotParam As KnotParameterizationEnum
 Возвращает
 Возвращает метод узловой параметризации кривой. Тип KnotParameterizationEnum.
 Описание
 Свойство KnotParam представляет метод узловой параметризации кривой.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.NurbCurve2dFitData, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!