Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DimAssoc.UpdateDimension
 Послать отзыв
 Метод позволяет обновить размер, связанный с данным объектом, или разорвать ассоциативную связь с ним. Опционально можно настроить удаление или сохранение реакторов.
 Синтаксис
C#
Visual Basic
Копировать Код
public void UpdateDimension( bool update, bool skipReactors );
Копировать Код
Public Sub UpdateDimension( update As Boolean, skipReactors As Boolean )
 Параметры
 Параметры
 Описание
 update
 Входной флаг, который определяет, следует ли обновить размер (значение true), или удалить ассоциативную связь с ним (значение false). Тип bool.
 skipReactors
 Входной флаг, который определяет, следует ли пропускать реакторы. Тип bool.
 Описание
 Метод позволяет обновить размер, связанный с данным объектом, или разорвать ассоциативную связь с ним. Опционально можно настроить удаление или сохранение реакторов.
 Ссылки
 Teigha.DatabaseServices.DimAssoc, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!