Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Position2d.Position2d
 Послать отзыв
 Конструктор класса Position2d. Создает объект позиции в точке c указанными координатами (x,y).
 Синтаксис
C#
Visual Basic
Копировать Код
public Position2d( double x, double y );
Копировать Код
Public Sub New( x As Double, y As Double )
 Параметры
 Параметры
 Описание
 x
 Координата позиции по оси X. Тип double.
 y
 Координата позиции по оси Y. Тип double.
 Описание
 Конструктор класса Position2d. Создает объект позиции в точке c указанными координатами (x,y).
 Ссылки
 Teigha.Geometry.Position2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!