Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Region.BooleanOperation
 Послать отзыв
 Метод реализует логические операции между данной и указанной областями.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void BooleanOperation( BooleanOperationType operation, ref Region otherRegion );
Копировать Код
Public Overridable Sub BooleanOperation( operation As BooleanOperationType, ByRef otherRegion As Region )
 Параметры
 Параметры
 Описание
 operation
 Тип логической операции из перечисления BooleanOperationType.
 otherRegion
 Другая область, участвующая вторым аргументом в логической операции. Тип Region.
 Описание
 Метод реализует логические операции между данной и указанной областями.
 Возможные типы логических операций включают объединение, пересечение и вычитание областей. Этот метод реализован только в среде пространственного моделирования и выдает исключение eNotImplementedYet для других моделлеров.
 Ссылки
 Teigha.DatabaseServices.Region, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!