Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FieldEngine
 Послать отзыв
 Класс FieldEngine управляет вычислением полей.
 Иерархия классов
Teigha::DatabaseServices::FieldEngine
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdFdFieldEngine")] public class FieldEngine : RXObject
Копировать Код
<Wrapper("OdFdFieldEngine")> Public Class FieldEngine Inherits RXObject
 Описание
 Класс FieldEngine управляет вычислением полей.
 Замечания
 Объект FieldEngine является глобальным и в пределах сеанса создается лишь в единственном экземпляре. Вычислители полей должны регистрировать свой загрузчик в этом движке на этапе старта приложения.
 Топики
 Имя
 Описание
 FieldEngine Методы
 Ниже перечислены методы класса FieldEngine.
 FieldEngine Свойства
 Ниже перечислены свойства класса FieldEngine.
 Ссылки
 FieldEngine Методы, FieldEngine Свойства, Топики, FieldEngine Методы, FieldEngine Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!