Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DataColumn.RemoveCellAt
 Послать отзыв
 Метод удаляет из столбца ячейку данных по указанному индексу.
 Синтаксис
C#
Visual Basic
Копировать Код
public void RemoveCellAt( int index );
Копировать Код
Public Sub RemoveCellAt( index As Integer )
 Параметры
 Параметры
 Описание
 index
 Индекс удаляемой ячейки данных. Тип int. В случае недействительного индекса происходит завершение работы приложения, сопровождаемое сообщением 'Operation is not valid due to the current state of the object.' (Текущее состояния объекта не позволяет выполнить эту операцию.)
 Описание
 Метод удаляет из этого столбца ячейку данных, расположенную по указанному индексу index.
 Ссылки
 Teigha.DatabaseServices.DataColumn, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!