Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve3d.GetOrthoProjectEntity
 Послать отзыв
 Метод создает геометрический объект, являющийся ортогональной проекцией кривой на заданную плоскость. Геометрические построения выполняются с указанной точностью.
 Синтаксис
C#
Visual Basic
Копировать Код
public Entity3d GetOrthoProjectEntity( ref Plane projectionPlane, Tolerance tolerance );
Копировать Код
Public Function GetOrthoProjectEntity( ByRef projectionPlane As Plane, tolerance As Tolerance ) As Entity3d
 Параметры
 Параметры
 Описание
 projectionPlane
 Плоскость, на которую выполняется проецирование. Тип Plane.
 tolerance
 Точность выполняемых вычислений. Тип Tolerance.
 Возвращает
 Возвращает спроецированный объект. Тип Entity3d.
 Описание
 Метод создает геометрический объект, являющийся ортогональной проекцией кривой на заданную плоскость. Геометрические построения выполняются с указанной точностью.
 Тип возвращаемого объекта может не совпадать с типом с исходной кривой. Например, линия может проецироваться в точку, если она ортогональна плоскости проекции.
 Ответственность за удаление созданного объекта-проекции возлагается на вызывающее приложение.
 Ссылки
 Teigha.Geometry.Curve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!