Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Viewport.ViewOrthographic
 Послать отзыв
 Свойство ViewOrthographic представляет текущий ортогональный вид в данном видовом экране.
 Синтаксис
C#
Visual Basic
Копировать Код
public OrthographicView ViewOrthographic;
Копировать Код
Public ReadOnly Property ViewOrthographic As OrthographicView
 Возвращает
 Возвращает текущий ортогональный вид. Перечисление OrthographicView.
 Описание
 Свойство ViewOrthographic представляет текущий ортогональный вид в данном видовом экране.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Viewport, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!