Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство SymbolTableRecord.Name
 Послать отзыв
 Синтаксис
C#
Visual Basic
public String Name;
Public Property Name() As String
 Описание
 Обеспечивает доступ к имени записи таблицы символов.
 Строка имени записи таблицы символов используется для DXF как групповой код 2.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.SymbolTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!