Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DxfFiler.ReadUInt64
 Послать отзыв
 Метод возвращает 64-разрядное целое число без знака (ulong) из текущего элемента этого объекта Filer.
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract ulong ReadUInt64();
Копировать Код
Public MustOverride Function ReadInt64() As Long
 Возвращает
 Возвращает 64-разрядное целое число без знака. Тип ulong.
 Описание
 Метод возвращает 64-разрядное целое число без знака (ulong) из текущего элемента этого объекта Filer.
 Ссылки
 Teigha.DatabaseServices.DxfFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!