Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CompoundObjectId.DxfInFields
 Послать отзыв
 Метод предназначен для чтения данных этого объекта из файла .dxf.
 Синтаксис
C#
Visual Basic
Копировать Код
public void DxfInFields( ref DxfFiler filer, ref Database hostDatabase, int ownerVersion );
Копировать Код
Public Sub DxfInFields( ByRef filer As DxfFiler, ByRef hostDatabase As Database, ownerVersion As Integer )
 Параметры
 Параметры
 Описание
 filer
 Входной объект DxfFiler, используемый для чтения данных.
 hostDatabase
 Главная база данных. Тип Database.
 ownerVersion
 Версия владельца. Тип int. Клиентский код должен передавать значение 0.
 Описание
 Метод предназначен для чтения данных этого объекта из файла .dxf с использованием переданного в метод объекта DxfFiler.
 Ссылки
 Teigha.DatabaseServices.CompoundObjectId, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!