Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.VertexRef.VertexRef
 Послать отзыв
 Конструктор класса VertexRef. Создает ссылку на вершину на основе указанного составного объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public VertexRef( ref CompoundObjectId compoundObjectId );
Копировать Код
Public Sub New( ByRef compoundObjectId As CompoundObjectId )
 Параметры
 Параметры
 Описание
 compoundObjectId
 Входной идентификатор составного объекта. Тип CompoundObjectId.
 Описание
 Конструктор класса VertexRef. Создает ссылку на вершину на основе указанного составного объекта.
 Ссылки
 Teigha.DatabaseServices.VertexRef, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!