Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.TransformOverrule.GetTransformedCopy
 Послать отзыв
 Метод создает копию указанного объекта и применяет к этой копии заданное геометрическое 3D-преобразование.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual Entity GetTransformedCopy( ref Entity entity, Matrix3d transform );
Копировать Код
Public virtual Function GetTransformedCopy( ByRef entity As Entity, transform As Matrix3d ) As Entity
 Параметры
 Параметры
 Описание
 entity
 Копируемый объект, тип Entity.
 transform
 Матрица 3D-преобразования, которое применяется к объекту-копии.
 Возвращает
 Возвращает копию объекта entity после применения 3D-преобразования.
 Описание
 Метод создает копию указанного объекта entity и применяет к этой копии заданное аргументом transform геометрическое 3D-преобразование.
 Ссылки
 Teigha.DatabaseServices.TransformOverrule, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!