Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Handseed
 Послать отзыв
 Синтаксис
C#
Visual Basic
public Handle Handseed;
Public Property Handseed() As Handle
 Описание
 Обеспечивает доступ к значению переменной HANDSEED базы данных. HANDSEED представляет собой счетчик, который содержит следующий возможный номер дескриптора. Дескрипторы — это 64 разрядные целые числа, в шестнадцатеричном виде, 64 битовое целое может содержать до 16 цифр.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!