Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AbstractViewTableRecord.DefaultLightingType
 Послать отзыв
 Свойство DefaultLightingType предоставляет доступ к типу освещения по умолчанию, которое используется в видовом экране.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.DefaultLightingType DefaultLightingType;
Копировать Код
Public Property DefaultLightingType As DatabaseServices.DefaultLightingType
 Возвращает
 Возвращает тип освещения по умолчанию в видовом экране. Перечисление DatabaseServices.DefaultLightingType.
 Описание
 Свойство DefaultLightingType предоставляет доступ к типу освещения по умолчанию, которое используется в видовом экране.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.AbstractViewTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!