Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.TableStyle.SetMargin
 Послать отзыв
 Метод позволяет задать величину поля ячейки таблицы для указанного типа поля в заданном стиле ячейки.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetMargin( CellMargins cellMargin, double margin, ref String styleName );
Копировать Код
Public Overridable Sub SetMargin( cellMargin As CellMargins, margin As Double, ByRef styleName As String )
 Параметры
 Параметры
 Описание
 cellMargin
 Тип поля. Перечисление CellMargins.
 margin
 Величина поля. Тип double.
 styleName
 Имя стиля ячейки. Тип String.
 Описание
 Метод позволяет задать величину поля ячейки таблицы для указанного типа поля в заданном стиле ячейки.
 Ссылки
 Teigha.DatabaseServices.TableStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!