Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Matrix2d.*
 Послать отзыв
 Оператор умножения для структуры Matrix2d.
 Синтаксис
C#
Visual Basic
Копировать Код
public static Matrix2d Matrix2d *( Matrix2d a, Matrix2d b );
Копировать Код
Public Shared Operator *( a As Matrix2d, b As Matrix2d ) As Matrix2d
 Параметры
 Параметры
 Описание
 a
 Левый операнд. Тип Matrix2d.
 b
 Правый операнд. Тип Matrix2d.
 Возвращает
 Возвращает результат матричного умножения (a x b). Тип Matrix2d.
 Описание
 Оператор умножения для структуры Matrix2d. Выполняет матричное умножение левого операнда на правый операнд (a x b).
 Ссылки
 Teigha.Geometry.Matrix2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!