Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbSurface.NumKnotsInU
 Послать отзыв
 Свойство NumKnotsInU представляет количество управляющих вершин в направлении U.
 Синтаксис
C#
Visual Basic
Копировать Код
public int NumKnotsInU;
Копировать Код
Public ReadOnly Property NumKnotsInU As Integer
 Возвращает
 Возвращает количество управляющих вершин в направлении U. Тип int.
 Описание
 Свойство NumKnotsInU представляет количество управляющих вершин в направлении U.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.NurbSurface, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!