Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.TypedValue.GetHashCode
 Послать отзыв
 Метод предназначен для доступа к хеш-коду объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public int GetHashCode();
Копировать Код
Public Function GetHashCode() As Integer
 Возвращает
 Возвращает хеш-код объекта. Тип int.
 Описание
 Метод предназначен для доступа к хеш-коду объекта.
 Ссылки
 Teigha.DatabaseServices.TypedValue, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!