Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DynamicBlockReferencePropertyCollection
 Послать отзыв
 Класс представляет коллекцию свойств вхождений динамических блоков DynamicBlockReferenceProperty.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::DatabaseServices::DynamicBlockReferencePropertyCollection
 Синтаксис
C#
Visual Basic
Копировать Код
[DefaultMember("Item"),Wrapper("OdDbDynBlockReferencePropertyArray")] public class DynamicBlockReferencePropertyCollection : DisposableWrapper, System.Collections.ICollection, System.Collections.IEnumerable;
Копировать Код
<DefaultMember("Item"),Wrapper("OdDbDynBlockReferencePropertyArray")> Public Class DynamicBlockReferencePropertyCollection Inherits DisposableWrapper Inherits System.Collections.ICollection Inherits System.Collections.IEnumerable
 Описание
 Класс DynamicBlockReferencePropertyCollection представляет коллекцию свойств вхождений динамических блоков DynamicBlockReferenceProperty.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.DatabaseServices.DynamicBlockReferencePropertyCollection
 Имя
 Описание
 DynamicBlockReferencePropertyCollection Методы
 Ниже перечислены методы класса DynamicBlockReferencePropertyCollection.
 DynamicBlockReferencePropertyCollection Свойства
 Ниже перечислены свойства класса DynamicBlockReferencePropertyCollection.
 Ссылки
 DynamicBlockReferencePropertyCollection Методы, DynamicBlockReferencePropertyCollection Свойства, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!