Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Rectangle3d.LowerLeft
 Послать отзыв
 Свойство LowerLeft представляет нижнюю левую вершину прямоугольника.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d LowerLeft;
Копировать Код
Public ReadOnly Property LowerLeft As Point3d
 Возвращает
 Возвращает указанную вершину прямоугольника. Тип Point3d.
 Описание
 Свойство LowerLeft представляет нижнюю левую вершину прямоугольника.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Rectangle3d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!