Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SequenceEnd
 Послать отзыв
 Класс SequenceEnd представляет объекты SequenceEnd в экземпляре базы данных Database.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::GraphicsInterface::Drawable Teigha::DatabaseServices::DBObject Teigha::DatabaseServices::Entity Teigha::DatabaseServices::SequenceEnd
 Синтаксис
C#
Visual Basic
Копировать Код
C# [Wrapper("AcDbSequenceEnd")] public class SequenceEnd : Entity
Копировать Код
<Wrapper("AcDbSequenceEnd")> Public Class SequenceEnd Inherits Entity
 Описание
 Класс SequenceEnd представляет объекты SequenceEnd (Seqend) в экземпляре базы данных Database.
 Объекты SequenceEnd автоматически создаются и обрабатываются чертежами в случае сложных объектов, таких как полилинии и вхождения блоков. Эти объекты не имеют связанной геометрии.
 Клиентские приложения могут добавлять к этим объектам расширенные данные или словари расширений, но не должны создавать или удалять их из базы данных.
 Замечания
 Не следует наследовать от этого класса.
 Методы
 Конструкторы
 Teigha.GraphicsInterface.Drawable
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 Drawable
 Конструктор класса Teigha.GraphicsInterface.Drawable. (Унаследован от Drawable)
 Teigha.DatabaseServices.DBObject
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 DBObject
 Конструктор. (Унаследован от DBObject)
 Teigha.DatabaseServices.SequenceEnd
 Имя
 Описание
 SequenceEnd
 Конструктор по умолчанию класса SequenceEnd.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.GraphicsInterface.Drawable
 Имя
 Описание
 Drawable Методы
 Ниже перечислены методы класса Drawable.
 Drawable Свойства
 Ниже перечислены свойства класса Drawable.
 Teigha.DatabaseServices.DBObject
 Имя
 Описание
 DBObject Методы
 Ниже перечислены методы класса DBObject.
 DBObject Свойства
 Ниже перечислены свойства класса DBObject.
 DBObject События
 Ниже перечислены события класса DBObject.
 Teigha.DatabaseServices.Entity
 Имя
 Описание
 Entity Методы
 Ниже перечислены методы класса Entity.
 Entity Свойства
 Ниже перечислены свойства класса Entity.
 Ссылки
 Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства, DBObject События
 Ваши комментарии по поводу этого топика: Послать отзыв!