Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Scale2d.Scale2d
 Послать отзыв
 Конструктор структуры Scale2d. Создает экземпляр структуры, который представляет преобразование масштаба с указанными масштабными коэффициентами вдоль осей X и Y.
 Синтаксис
C#
Visual Basic
Копировать Код
public Scale2d( double x, double y );
Копировать Код
Public Sub New( x As Double, y As Double )
 Параметры
 Параметры
 Описание
 x
 Масштабный коэффициент для оси X. Тип double.
 y
 Масштабный коэффициент для оси Y. Тип double.
 Описание
 Конструктор структуры Scale2d. Создает экземпляр структуры, который представляет преобразование масштаба с указанными масштабными коэффициентами вдоль осей X и Y.
 Ссылки
 Teigha.Geometry.Scale2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!