Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CircularArc3d
 Послать отзыв
 Класс CircularArc3d представляет окружности и круглые дуги в трёхмерном пространстве.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Geometry::Entity3d Teigha::Geometry::Curve3d Teigha::Geometry::CircularArc3d
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdGeCircArc3d")] public sealed class CircularArc3d : Curve3d
Копировать Код
<Wrapper("OdGeCircArc3d")> Public NotInheritable Class CircularArc3d Inherits Curve3d
 Описание
 Класс CircularArc3d представляет окружности и круглые дуги в трёхмерном пространстве.
 Методы
 Конструкторы
 Teigha.Geometry.CircularArc3d
 Имя
 Описание
 CircularArc3d
 Это обзор перегрузок CircularArc3d.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Geometry.Entity3d
 Имя
 Описание
 Entity3d Методы
 Ниже перечислены методы класса Entity3d.
 Teigha.Geometry.Curve3d
 Имя
 Описание
 Curve3d Методы
 Ниже перечислены методы класса Curve3d.
 Curve3d Свойства
 Ниже перечислены свойства класса Curve3d.
 Teigha.Geometry.CircularArc3d
 Имя
 Описание
 CircularArc3d Методы
 Ниже перечислены методы класса CircularArc3d.
 CircularArc3d Свойства
 Ниже перечислены свойства класса CircularArc3d.
 Ссылки
 CircularArc3d Конструктор, CircularArc3d Методы, CircularArc3d Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!