Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DwgFiler.FilerStatus
 Послать отзыв
 Свойство представляет текущее состояние данного объекта Filer.
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract Teigha.Runtime.ErrorStatus FilerStatus;
Копировать Код
Public MustOverride Property FilerStatus As Teigha.Runtime.ErrorStatus
 Возвращает
 Возвращает статус объекта как значение из перечисления Teigha.Runtime.ErrorStatus.
 Описание
 Свойство представляет текущее состояние данного объекта Filer.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.DwgFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!