Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.Dimtol
 Послать отзыв
 Свойство управляет отображением допусков в размерах.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool Dimtol;
Копировать Код
Public Property Dimtol As Boolean
 Возвращает
 Возвращает true, если отображение допусков включено. В противном случае возвращает false.
 Описание
 Свойство позволяет отображать предельные отклонения в конце размерного текста.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!