Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Interval.Subtract
 Послать отзыв
 Метод вычитает указанный интервал из данного интервала.
 Синтаксис
C#
Visual Basic
Копировать Код
public Interval[] Subtract( ref Interval otherInterval );
Копировать Код
Public Function Subtract( ByRef otherInterval As Interval ) As Interval()
 Параметры
 Параметры
 Описание
 otherInterval
 Вычитаемый интервал. Тип Interval.
 Возвращает
 Возвращает массив из двух интервалов, образование которых возможно в результате операции вычитания. Тип Interval[]. Элемент с индексом 0 представляет левый или единственный интервал, образующийся в результате операции вычитания. Если результатом являются два интервала, то элемент с индексом 1 представляет правый интервал. Два интервала образуются только в том случае, если otherInterval полностью включен в данный интервал, не касаясь его границ своими концами.
 Описание
 Метод вычитает указанный интервал из данного интервала. Результат операции возвращается в виде двухэлементного массива интервалов.
 Ссылки
 Teigha.Geometry.Interval, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!