Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CircularArc3d.IntersectWith
 Послать отзыв
 Метод позволяет найти точки пересечения данной дуги с указанной 3D-линией.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d[] IntersectWith( ref LinearEntity3d line );
Копировать Код
Public Function IntersectWith( ByRef line As LinearEntity3d ) As Point3d()
 Параметры
 Параметры
 Описание
 line
 Входная 3D-линия, точки пересечения с которой требуется найти. Тип LinearEntity3d.
 Возвращает
 Возвращает массив точек пересечения дуги и линии. Тип Point3d[].
 Описание
 Метод позволяет найти точки пересечения данной дуги с указанной 3D-линией. Используется вызов метода CircularArc3d.IntersectWith(LinearEntity3d line, Tolerance tolerance) с точностью, равной Tolerance.Global.
 Ссылки
 Teigha.Geometry.CircularArc3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!