Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.BoundBlock3d.Direction3
 Послать отзыв
 Свойство Direction3 представляет направление и длину третьей стороны данной граничной рамки.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d Direction3;
Копировать Код
Public ReadOnly Property Direction3 As Vector3d
 Возвращает
 Возвращает вектор, определяющий третью сторону граничной рамки. Тип Vector3d.
 Описание
 Свойство Direction3 представляет направление и длину третьей стороны данной граничной рамки.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.BoundBlock3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!