Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocAction.IsActionEvaluationInProgress
 Послать отзыв
 Свойство позволяет проверить, не находится ли система в данный момент в процессе вычисления данного действия или сети действий.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsActionEvaluationInProgress;
Копировать Код
Public Property IsActionEvaluationInProgress() SolutionStatusType
 Возвращает
 Возвращает true, если система в данный момент находится в процессе вычисления данного действия. В противном случае возвращает false.
 Описание
 Свойство позволяет проверить, не находится ли система в данный момент в процессе вычисления данного действия или сети действий.
 Следует отметить, что во время вычисления действия уведомления у зависимостей отключаются. Когда объект, к которому зависимости прикреплены, изменяется, зависимости игнорируют это уведомление и в свою очередь также не уведомляют действия, владеющие зависимостями. Это необходимо, поскольку в противном случае возникают риски зацикливания. Так, если вычисление одного действия изменит некоторые объекты, зависимости от этих объектов получат соответствующие уведомления, будет изменен статус других действий, владеющих этими зависимостями, что повлечет за собой запросы на повторное вычисление действий. Это приведет к бесконечным циклам.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.AssocAction, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!