Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Database.MarkObjectNonPersistent
 Послать отзыв
 Синтаксис
C#
Visual Basic
public void MarkObjectNonPersistent(ObjectId id, bool value);
Public Sub MarkObjectNonPersistent(id As ObjectId, value As bool)
 Параметры
 Параметры
 Описание
 id
 Id изменяемого объекта
 value
 true, чтобы сделать объект не постоянным и false, чтобы сделать объект постоянным
 Описание
 Помечает объект как постоянный или не постоянный. Объекты в чертеже по умолчанию являются постоянными (если у них есть владелец). Этот метод позволяет делать их не постоянными.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!