Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SubDMesh.GetSubDividedVertexAt
 Послать отзыв
 Метод предназначен для извлечения вершины гладкой сети, используя указанный идентификатор подобъекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d GetSubDividedVertexAt( SubentityId subentId );
Копировать Код
Public Function GetSubDividedVertexAt( subentId As SubentityId ) As Point3d
 Параметры
 Параметры
 Описание
 subentId
 Subentity ID of the vertex. Тип SubentityId.
 Возвращает
 Возвращает координатную точку Point3d вершины гладкой сети, используя указанный идентификатор подобъекта.
 Описание
 Метод предназначен для извлечения вершины гладкой сети, используя указанный идентификатор подобъекта.
 Ссылки
 Teigha.DatabaseServices.SubDMesh, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!