Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AbstractViewPE.HasUcs
 Послать отзыв
 Свойство HasUcs позволяет проверить, определена ли пользовательская система координат для связанного видового экрана.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool HasUcs;
Копировать Код
Public ReadOnly Property HasUcs As Boolean
 Возвращает
 Возвращает true, если ПСК определена. В противном случае возвращает false.
 Описание
 Свойство HasUcs позволяет проверить, определена ли пользовательская система координат (ПСК, UCS) для связанного видового экрана.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.AbstractViewPE, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!