Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbSurfaceDefinition.NumberOfControlPointsInU
 Послать отзыв
 Свойство NumberOfControlPointsInU представляет количество управляющих вершин в направлении U.
 Синтаксис
C#
Visual Basic
Копировать Код
public int NumberOfControlPointsInU;
Копировать Код
Public ReadOnly Property NumberOfControlPointsInU As Integer
 Возвращает
 Возвращает количество управляющих вершин в направлении U. Тип int.
 Описание
 Свойство NumberOfControlPointsInU представляет количество управляющих вершин в направлении U.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.NurbSurfaceDefinition, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!