Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SectionSettings.SetHatchSpacing
 Послать отзыв
 Метод позволяет задать интервал штриховки для геометрии указанного типа.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetHatchSpacing( SectionType nSecType, SectionGeometry nGeometry, double fSpacing );
Копировать Код
Public Sub SetHatchSpacing( nSecType As SectionType, nGeometry As SectionGeometry, fSpacing As Double )
 Параметры
 Параметры
 Описание
 nSecType
 Тип сечения. Перечисление SectionType.
 nGeometry
 Типы элементов геометрии сечения. Перечисление SectionGeometry.
 fSpacing
 Значение интервала штриховки. Тип double.
 Описание
 Метод позволяет задать значение интервала штриховки для геометрии указанного типа.
 Ссылки
 Teigha.DatabaseServices.SectionSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!