Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Point3dCollection.GetEnumerator
 Послать отзыв
 Метод предоставляет перечислитель для этой коллекции точек.
 Синтаксис
C#
Visual Basic
Копировать Код
public System.Collections.IEnumerator GetEnumerator();
Копировать Код
Public Function GetEnumerator() As System.Collections.IEnumerator
 Возвращает
 Возвращает перечислитель. Тип System.Collections.IEnumerator.
 Описание
 Метод предоставляет перечислитель для этой коллекции точек.
 Ссылки
 Teigha.Geometry.Point3dCollection, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!