Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DbHomeView
 Послать отзыв
 Этот класс представляет исходный вид в системе управления ориентацией модели.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::DatabaseServices::DbHomeView
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdDbHomeView")] public class DbHomeView : DisposableWrapper, ICloneable;
Копировать Код
<Wrapper("OdDbHomeView")> Public Class DbHomeView Inherits DisposableWrapper Inherits ICloneable
 Описание
 Этот класс представляет исходный вид в системе управления ориентацией модели.
 Методы
 Конструкторы
 Teigha.DatabaseServices.DbHomeView
 Имя
 Описание
 DbHomeView
 Конструктор класса DbHomeView.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.DatabaseServices.DbHomeView
 Имя
 Описание
 DbHomeView Методы
 Ниже перечислены методы класса DbHomeView.
 DbHomeView Операторы
 Ниже перечислены операторы класса DbHomeView.
 Ссылки
 DbHomeView Методы, DbHomeView Операторы, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!