Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Plane.Plane
 Послать отзыв
 Конструктор класса Plane. Создает плоскость, используя заданные начало координат и нормальный вектор плоскости.
 Синтаксис
C#
Visual Basic
Копировать Код
public Plane( Point3d origin, Vector3d normal );
Копировать Код
Public Sub New( origin As Point3d, normal As Vector3d )
 Параметры
 Параметры
 Описание
 origin
 Начало координат плоскости. Тип Point3d.
 normal
 Нормаль плоскости. Тип Vector3d. Не может иметь ненулевую длину.
 Описание
 Конструктор класса Plane. Создает плоскость, используя заданные начало координат origin и нормальный вектор плоскости normal.
 Ссылки
 Teigha.Geometry.Plane, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!