Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.HatchLoopTypes
 Послать отзыв
 Данное перечисление представляет типы границ областей, используемых в штриховке.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum HatchLoopTypes { Default = 0, External = 1, Polyline = 2, Derived = 4, Textbox = 8, Outermost = 16, NotClosed = 32, SelfIntersecting = 64, TextIsland = 128, Duplicate = 256 }
Копировать Код
Public Enum HatchLoopTypes Default = 0 External = 1 Polyline = 2 Derived = 4 Textbox = 8 Outermost = 16 NotClosed = 32 SelfIntersecting = 64 TextIsland = 128 Duplicate = 256 End Enum
 Члены
 Члены
 Описание
 Default
 Значение: 0. Тип контура пока не определен. Он принимает «реальное» значение по мере создания реальных контуров.
 External
 Значение: 1. Контур, состоящий из внешних объектов (производных от Entity и принадлежащих базе данных документа). Штриховка может быть ассоциативно связана с этими объектами.
 Polyline
 Значение: 2. Контур штриховки представлен полилинией.
 Derived
 Значение: 4. Контур, построенный трассировщиком границ nanoCAD из указанной точки.
 Textbox
 Значение: 8. Контур, представляющий собой рамку вокруг существующего текстового объекта - объекта Text.
 Outermost
 Значение: 16. Самый внешний контур штриховки.
 NotClosed
 Значение: 32= 0x20. Незамкнутый контур.
 SelfIntersecting
 Значение: 64 = 0x40. Контур штриховки с самопересечениями.
 TextIsland
 Значение: 128 = 0x80. Текстовые контуры, окруженные четным количеством внешних контуров. При выполнении сплошной заливки островные контуры текста игнорируются.
 Duplicate
 Значение: 256 = 0x100. Дублирующий контур.
 Описание
 Перечисление HatchLoopTypes представляет типы границ областей, используемых в штриховке.
 Ваши комментарии по поводу этого топика: Послать отзыв!