Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Ellipse.GetAngleAtParameter
 Послать отзыв
 Метод позволяет определить значение угла для точки на эллипсе, заданной параметрически.
 Синтаксис
C#
Visual Basic
Копировать Код
public double GetAngleAtParameter( double value );
Копировать Код
Public Function GetAngleAtParameter( value As Double ) As Double
 Параметры
 Параметры
 Описание
 value
 Значение параметра в радианах. Тип double.
 Возвращает
 Возвращает угол в радианах. Тип double.
 Описание
 Метод позволяет определить значение угла для точки на эллипсе, заданной указанным значением параметра.
 Возвращаемый угол будет находиться в диапазоне от -PI до +PI. Начало отсчета углов определяет вектор majorAxis эллипса. Положительное направление отсчета углов определяется правилом правой руки - если смотреть вдоль вектора нормали на центр эллипса, то положительным считается направление против часовой стрелки.
 Ссылки
 Teigha.DatabaseServices.Ellipse, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!