Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LinkedTableData.GetDataLink
 Послать отзыв
 Метод позволяет получить коллекцию всех идентификаторов объектов внешних ссылок.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual DatabaseServices.ObjectIdCollection GetDataLink();
Копировать Код
Public Overridable Function GetDataLink() As DatabaseServices.ObjectIdCollection
 Возвращает
 Возвращает коллекцию идентификаторов внешних ссылок. Тип DatabaseServices.ObjectIdCollection.
 Описание
 Метод позволяет получить коллекцию всех идентификаторов объектов внешних ссылок.
 Ссылки
 Teigha.DatabaseServices.LinkedTableData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!