Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DataColumn.SetCellAt
 Послать отзыв
 Метод устанавливает входную ячейку данных по указанному индексу.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetCellAt( int index, ref DataCell cell );
Копировать Код
Public Sub SetCellAt( index As Integer, ByRef cell As DataCell )
 Параметры
 Параметры
 Описание
 index
 Индекс ячейки. Тип int. В случае недействительного индекса происходит завершение работы приложения, сопровождаемое сообщением 'Operation is not valid due to the current state of the object.' (Текущее состояния объекта не позволяет выполнить эту операцию.)
 cell
 Входная ячейка данных. Тип DataCell.
 Описание
 Метод устанавливает входную ячейку данных cell по указанному индексу index.
 Ссылки
 Teigha.DatabaseServices.DataColumn, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!