Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.Select
 Послать отзыв
 Метод позволяет выделить в таблице ячейку, используя заданные точку, направление взгляда и ориентацию, а также вернуть подобъекты ячейки.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual TableHitTestInfo Select( Point3d pickingPoint, Vector3d hitTestViewDirection, Vector3d hitTestViewOrientation, bool allowOutside, bool inPickFirst, ref FullSubentityPath[] paths );
Копировать Код
Public virtual Function Select( pickingPoint As Point3d, hitTestViewDirection As Vector3d, hitTestViewOrientation As Vector3d, allowOutside As Boolean, inPickFirst As Boolean, ByRef paths As FullSubentityPath[] ) As TableHitTestInfo
 Параметры
 Параметры
 Описание
 pickingPoint
 3D-точка указания. Тип Point3d. Задается в мировой системе координат (WCS).
 hitTestViewDirection
 3D-вектор, определяющий направление взгляда. Тип Vector3d. Задается в WCS.
 hitTestViewOrientation
 3D-вектор, определяющий ориентацию вида. Тип Vector3d. Задается в WCS.
 allowOutside
 Флаг, определяющий, будет ли выбирать ячейку точка указания за пределами таблицы. Тип bool.
 inPickFirst
 Флаг, который определяет, находится ли объект уже в наборе pickfirst (значение true) или логика pick first должна попытаться выделить объект напрямую (значение false). Тип bool.
 paths
 Выходной массив путей подобъектов. Тип FullSubentityPath[].
 Возвращает
 Возвращает результат проверки выделения в виде экземпляра класса TableHitTestInfo.
 Описание
 Метод позволяет выделить в таблице ячейку, используя заданные точку, направление взгляда и ориентацию. Если аргумент paths не равен нулю, в нём будут возвращены подобъекты ячейки, включая обрамляющие линии сетки, MText и вхождения блоков.
 Замечания
 Метод не реализован.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!