Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AuditInfo.ResetNumEntities
 Послать отзыв
 Метод обнуляет количество объектов, поддерживаемых данным экземпляром AuditInfo.
 Синтаксис
C#
Visual Basic
Копировать Код
public void ResetNumEntities();
Копировать Код
Public Sub ResetNumEntities()
 Описание
 Метод обнуляет количество объектов, поддерживаемых данным экземпляром AuditInfo.
 Ссылки
 Teigha.DatabaseServices.AuditInfo, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!