Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve3dCollection.IsReadOnly
 Послать отзыв
 Свойство IsReadOnly позволяет проверить, доступна ли данная коллекция только на чтение.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual bool IsReadOnly;
Копировать Код
Public Overridable ReadOnly Property IsReadOnly As Boolean
 Возвращает
 Возвращает true, если данная коллекция доступна только на чтение. В противном случае возвращает false.
 Описание
 Свойство IsReadOnly позволяет проверить, доступна ли данная коллекция только на чтение.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.Curve3dCollection, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!