Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Matrix3d.PlaneToWorld
 Послать отзыв
 Метод формирует матрицу преобразования из системы координат на заданной плоскости в мировую систему координат (WCS).
 Синтаксис
C#
Visual Basic
Копировать Код
public Matrix3d PlaneToWorld( ref Plane plane );
Копировать Код
Public Function PlaneToWorld( ByRef plane As Plane ) As Matrix3d
 Параметры
 Параметры
 Описание
 plane
 Входная плоскость. Тип Plane.
 Возвращает
 Возвращает матрицу преобразования. Тип Matrix3d.
 Описание
 Метод формирует матрицу преобразования из системы координат на заданной плоскости в мировую систему координат (WCS).
 Ссылки
 Teigha.Geometry.Matrix3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!