Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DwgFiler.WriteVector2d
 Послать отзыв
 Метод записывает в этот Filer указанный объект Vector2d.
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract void WriteVector2d( Vector2d value );
Копировать Код
Public MustOverride Sub WriteVector2d( value As Vector2d )
 Параметры
 Параметры
 Описание
 value
 Записываемое в Filer значение. Тип Vector2d.
 Описание
 Метод записывает в этот Filer указанный объект Vector2d.
 Ссылки
 Teigha.DatabaseServices.DwgFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!