Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.UnderlayHost.DwfHost
 Послать отзыв
 Свойство DwfHost представляет текущее хост-приложение для подложки DWF.
 Синтаксис
C#
Visual Basic
Копировать Код
public static UnderlayHost DwfHost;
Копировать Код
Public Shared ReadOnly Property DwfHost As UnderlayHost
 Возвращает
 Возвращает хост-приложение для подложки DWF. Тип UnderlayHost.
 Описание
 Свойство DwfHost представляет текущее хост-приложение для подложки DWF.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.UnderlayHost, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!