Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObjectCollection.Remove
 Послать отзыв
 Метод удаляет из коллекции заданный объект DBObject.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Remove( ref DBObject value );
Копировать Код
Public Function Remove( ByRef value As DBObject )
 Параметры
 Параметры
 Описание
 value
 Элемент типа DBObject, подлежащий удалению из коллекции.
 Описание
 Метод удаляет из коллекции заданный объект DBObject.
 Ссылки
 Teigha.DatabaseServices.DBObjectCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!