Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotStyle.LocalizedName
 Послать отзыв
 Свойство LocalizedName представляет локализованное имя стиля печати.
 Синтаксис
C#
Visual Basic
Копировать Код
public String LocalizedName;
Копировать Код
Public Property LocalizedName As String
 Возвращает
 Возвращает локализованное имя стиля печати. Тип String.
 Описание
 Свойство LocalizedName предоставляет доступ к локализованному имени стиля печати.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.PlotStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!