Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SymbolUtilityServices.ValidatePreExtendedSymbolName
 Послать отзыв
 Метод реализует проверку указанного имени на соответствие устаревшим требованиям к именам символов.
 Синтаксис
C#
Visual Basic
Копировать Код
public static void ValidatePreExtendedSymbolName( ref String name, bool allowVerticalBar );
Копировать Код
Public Shared Sub ValidatePreExtendedSymbolName( ByRef name As String, allowVerticalBar As Boolean )
 Параметры
 Параметры
 Описание
 name
 Проверяемое входное имя. Тип String.
 allowVerticalBar
 Флаг, определяющий, допускается ли в имени символа знак вертикальной черты ("|"). Тип bool.
 Описание
 Метод реализует проверку указанного имени на соответствие устаревшим требованиям к именам символов.
 Ссылки
 Teigha.DatabaseServices.SymbolUtilityServices, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!