Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector3d.GetNormal
 Послать отзыв
 Метод позволяет получить единичный вектор, сонаправленный данному вектору.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d GetNormal( Tolerance tolerance );
Копировать Код
Public Function GetNormal( tolerance As Tolerance ) As Vector3d
 Параметры
 Параметры
 Описание
 tolerance
 Входная точность. Тип Tolerance.
 Возвращает
 Возвращает единичный вектор. Тип Vector3d.
 Описание
 Метод позволяет получить единичный вектор, сонаправленный данному вектору. Возвращаемый вектор не нормируется, если его длина оказывается меньше допуска Tolerance.EqualVector().
 Ссылки
 Teigha.Geometry.Vector3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!