Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PropertiesOverrule
 Послать отзыв
 Этот класс переопределяет подмножество специфичных для объекта операций, связанных со свойствами. Он служит базовым классом для классов, производных от DBObject или DBEntity, и используется для настройки их поведения.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::Runtime::Overrule Teigha::DatabaseServices::PropertiesOverrule
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdDbPropertiesOverrule")] public class PropertiesOverrule : Overrule;
Копировать Код
<Wrapper("OdDbPropertiesOverrule")> Public Class PropertiesOverrule Inherits Overrule
 Описание
 Этот класс переопределяет подмножество специфичных для объекта операций, связанных со свойствами. Он служит базовым классом для классов, производных от DBObject или DBEntity, и используется для настройки их поведения. Каждая реализация по умолчанию вызывает соответствующий метод целевого класса.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.Runtime.Overrule
 Имя
 Описание
 Overrule Методы
 Ниже перечислены методы класса Overrule.
 Overrule Свойства
 Ниже перечислены свойства класса Overrule.
 Teigha.DatabaseServices.PropertiesOverrule
 Имя
 Описание
 PropertiesOverrule Методы
 Ниже перечислены методы класса PropertiesOverrule.
 Ссылки
 PropertiesOverrule Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!