Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Surface.ClosestPointTo
 Послать отзыв
 Метод вычисляет на данной поверхности точку, которая является ближайшей к указанной точке.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d ClosestPointTo( Point3d point );
Копировать Код
Public Function ClosestPointTo( point As Point3d ) As Point3d
 Параметры
 Параметры
 Описание
 point
 Входная точка, для которой следует найти ближайшую к ней точку на данной поверхности. Тип Point3d.
 Возвращает
 Возвращает точку на поверхности, минимально удаленную от точки point. Тип Point3d.
 Описание
 Метод вычисляет на данной поверхности точку, которая является ближайшей к указанной точке.
 Замечания
 Используется вызов метода Surface.ClosestPointTo(Point3d point, Tolerance tolerance) с точностью по умолчанию Tolerance.Global.
 Ссылки
 Teigha.Geometry.Surface, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!