Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FullDwgVersion.Equals
 Послать отзыв
 Метод предназначен для проверки данного объекта на совпадение с указанным объектом.
 Синтаксис
C#
Visual Basic
Копировать Код
public sealed override bool Equals( ref Object other );
Копировать Код
Public NotOverridable Overrides Function Equals( ByRef other As Object ) As Boolean
 Параметры
 Параметры
 Описание
 other
 Объект, с которым выполняется сравнение. Тип Object.
 Возвращает
 Возвращает true, если данный объект идентичен объекту other. В противном случае возвращает false.
 Описание
 Метод предназначен для проверки данного объекта на совпадение с указанным объектом other.
 Ссылки
 Teigha.DatabaseServices.FullDwgVersion, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!