Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.ClearTableStyleOverrides
 Послать отзыв
 Метод предназначен для удаления переопределений стилей, используемых в таблице и ее ячейках.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void ClearTableStyleOverrides( int options );
Копировать Код
Public virtual Sub ClearTableStyleOverrides( options As Integer )
 Параметры
 Параметры
 Описание
 options
 Опции операции удаления, тип int.
 Описание
 Метод предназначен для удаления переопределений стилей, используемых в таблице и ее ячейках.
 Замечания
 Для получения того же результата предпочтительнее использовать функционал объекта Cell.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!