Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство BlockReference.Rotation
 Послать отзыв
 Синтаксис
C#
Visual Basic
public double Rotation;
Public Property Rotation() As Double
 Описание
 Обеспечивает доступ к величине угла поворота (в радианах) ссылки на блок. Угол поворота отсчитывается относительно оси X координатной системы, которая параллельна JCS ссылки на блок, но ее начало находится в точке, указывающей на ссылку на блок. Ось поворота — это ось Z этой координатной системы с положительным значением угла, отсчитываемым против часовой стрелки, если смотреть вниз по оси Z по направлению к центру координат. Note Значение угла поворота — это групповой код 50 в DXF.
 Ссылки
 Teigha.DatabaseServices.BlockReference, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!