Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CubicSplineCurve3d.CubicSplineCurve3d
 Послать отзыв
 Конструктор класса CubicSplineCurve3d. Создает интерполяционный кубический сплайн, проходящий через указанные определяющие точки.
 Синтаксис
C#
Visual Basic
Копировать Код
public CubicSplineCurve3d( ref Point3dCollection points );
Копировать Код
Public Sub New( ByRef points As Point3dCollection )
 Параметры
 Параметры
 Описание
 points
 Входной массив определяющих точек сплайна. Тип Point3dCollection.
 Описание
 Конструктор класса CubicSplineCurve3d. Создает интерполяционный кубический сплайн, проходящий через указанные определяющие точки. Используется вызов метода CubicSplineCurve3d(ref Point3dCollection fitPoints, Tolerance tolerance) с точностью интерполяции Tolerance.Global.
 Ссылки
 Teigha.Geometry.CubicSplineCurve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!