Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.ExternalSurface.IsEllipCone
 Послать отзыв
 Свойство IsEllipCone позволяет проверить, является ли данная внешняя поверхность эллиптическим конусом.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsEllipCone;
Копировать Код
Public ReadOnly Property IsEllipCone As Boolean
 Возвращает
 Возвращает true, если данная внешняя поверхность является эллиптическим конусом. В противном случае возвращает false.
 Описание
 Свойство IsEllipCone определяет тип данной внешней поверхности и возвращает true, если она является эллиптическим конусом.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.ExternalSurface, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!