Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.ClipBoundary2d.Set
 Послать отзыв
 Метод переопределяет данный объект так, чтобы его граница обрезки приняла вид прямоугольника с указанными вершинами.
 Синтаксис
C#
Visual Basic
Копировать Код
public ClipError Set( Point2d firstCorner, Point2d secondCorner );
Копировать Код
Public Function [Set]( firstCorner As Point2d, secondCorner As Point2d ) As ClipError
 Параметры
 Параметры
 Описание
 firstCorner
 Первая вершина прямоугольника. Тип Point2d.
 secondCorner
 Вторая вершина прямоугольника. Тип Point2d.
 Возвращает
 Возвращает результат выполнения метода из перечисления ClipError.
 Описание
 Метод позволяет переопределить данный объект так, чтобы его граница обрезки приняла вид прямоугольника с указанными вершинами.
 Ссылки
 Teigha.Geometry.ClipBoundary2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!