Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Solid3dMassProperties.Extents
 Послать отзыв
 Свойство Extents представляет габаритную рамку твердого тела.
 Синтаксис
C#
Visual Basic
Копировать Код
public Extents3d Extents;
Копировать Код
Public ReadOnly Property Extents As Extents3d
 Возвращает
 Возвращает габаритную рамку твердого тела. Тип Extents3d.
 Описание
 Свойство Extents представляет габаритную рамку твердого тела. Габаритная рамка представляет собой ориентированный по осям системы координат прямоугольный параллелепипед минимального размера, в который вписано твердое тело.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Solid3dMassProperties, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!