Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 LayerTableRecord.IsUsed
 Послать отзыв
 Свойство предназначено для получения информации об использовании слоя в чертеже.
 Синтаксис
C#
Visual Basic
public bool IsUsed;
Public Property IsUsed() As bool
 Возвращает
 Возвращает тип данных bool:
true – слой используется;
false – слой не используется.
 Описание
 С помощью свойства можно получить информацию о том, используется слой в чертеже или нет. Определение неиспользуемого слоя хранится в таблице слоёв, но к нему не относится ни один объект чертежа.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.LayerTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!