Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CircularArc2d.Set
 Послать отзыв
 Метод позволяет переопределить все параметры данной дуги.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Set( Point2d center, double radius, double angle1, double angle2, Vector2d referenceVector, bool isClockWise );
Копировать Код
Public Sub Set( center As Point2d, radius As Double, angle1 As Double, angle2 As Double, referenceVector As Vector2d, isClockWise As Boolean )
 Параметры
 Параметры
 Описание
 center
 Центр дуги. Тип Point2d.
 radius
 Радиус дуги. Тип double.
 angle1
 Начальный угол дуги. Тип double.
 angle2
 Конечный угол дуги. Тип double.
 referenceVector
 Опорный вектор, определяющий направление начала отсчета углов дуги (направление нулевого угла). Тип Vector2d.
 isClockWise
 Флаг, определяющий, что дуга строится по часовой стрелке. Тип bool.
 Описание
 Метод позволяет переопределить все параметры данной дуги - центр, радиус, начальный и конечный углы, а также направление самой дуги и направление нулевого угла.
 Замечания
 Все углы представляются в радианах. Начальный угол angle1 должен быть меньше конечного угла angle2.
 Ссылки
 Teigha.Geometry.CircularArc2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!