Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Filters.SpatialFilterVolume.SpatialFilterVolume
 Послать отзыв
 Конструктор класса SpatialFilterVolume.
 Синтаксис
C#
Visual Basic
Копировать Код
public SpatialFilterVolume( Point3d fromPoint, Point3d toPoint, Vector3d upDir, Vector2d viewField );
Копировать Код
Public Sub New( fromPoint As Point3d, toPoint As Point3d, upDir As Vector3d, viewField As Vector2d )
 Параметры
 Параметры
 Описание
 fromPoint
 Точка «от» преобразованной границы отсечения. Тип Point3d.
 toPoint
 Точка «до» преобразованной границы отсечения. Тип Point3d.
 upDir
 Вектор нормали преобразованной границы отсечения. Тип Vector3d.
 viewField
 Вектор поля зрения преобразованной границы отсечения. Тип Vector2d.
 Описание
 Конструктор класса SpatialFilterVolume.
 Ссылки
 Teigha.DatabaseServices.Filters.SpatialFilterVolume, Teigha.DatabaseServices.Filters
 Ваши комментарии по поводу этого топика: Послать отзыв!