Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotSettingsValidator.GetLocaleMediaName
 Послать отзыв
 Метод предоставляет локализованную версию наименования бумажного носителя по его наименованию в коллекции канонических имен носителей, возвращаемой методом GetCanonicalMediaNameList().
 Синтаксис
C#
Visual Basic
Копировать Код
public String GetLocaleMediaName( ref PlotSettings plotSet, ref String canonicalName );
Копировать Код
Public Function GetLocaleMediaName( ByRef plotSet As PlotSettings, ByRef canonicalName As String ) As String
 Параметры
 Параметры
 Описание
 plotSet
 Входной объект PlotSettings.
 canonicalName
 Независимое от локализации каноническое имя носителя. Тип String.
 Возвращает
 Возвращает локализованную версию наименования бумажного носителя. Тип String.
 Описание
 Метод предоставляет локализованную версию наименования бумажного носителя по его наименованию в коллекции канонических имен носителей, возвращаемой методом GetCanonicalMediaNameList().
 Замечания
 Если какие-либо устройства печати, файлы PC3 или таблицы стилей печати изменяются после запуска приложения, то перед использованием других методов этого класса следует вызвать метод RefreshLists(), чтобы обновить списки стилей и устройств вывода.
 Ссылки
 Teigha.DatabaseServices.PlotSettingsValidator, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!