Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CompositeCurve2d.CompositeCurve2d
 Послать отзыв
 Конструктор класса CompositeCurve2d. Создает составную кривую из кривых в предоставленном списке.
 Синтаксис
C#
Visual Basic
Копировать Код
public CompositeCurve2d( ref Curve2d[] curves );
Копировать Код
Public Sub New( ByRef curves As Curve2d() )
 Параметры
 Параметры
 Описание
 curves
 Массив кривых, из которых будет создана составная кривая. Тип Curve2d[].
 Описание
 Конструктор класса CompositeCurve2d. Создает составную кривую из кривых в предоставленном массиве.
 Замечания
 Кривые из этого массива должны быть соединены конец в конец. Это означает, что начальная точка каждой кривой в массиве (кроме первой) должна совпадать с конечной точкой предыдущей кривой в массиве. Проверка выполнения этого условия в конструкторе не предусмотрена.
 Ссылки
 Teigha.Geometry.CompositeCurve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!