Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotStyleData.LineJoinStyle
 Послать отзыв
 Свойство LineJoinStyle представляет текущий стиль соединения линий, используемый в данном объекте.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.LineJoinStyle LineJoinStyle;
Копировать Код
Public Property LineJoinStyle As DatabaseServices.LineJoinStyle
 Возвращает
 Возвращает стиль соединения линий. Перечисление DatabaseServices.LineJoinStyle.
 Описание
 Свойство LineJoinStyle представляет текущий стиль соединения линий, используемый в данном объекте.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.PlotStyleData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!