Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Curve.Closed
 Послать отзыв
 Свойство возвращает true, если кривая является замкнутой.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool Closed;
Копировать Код
Public Property Closed() As Boolean
 Описание
 Свойство возвращает true, если кривая является замкнутой.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Curve, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!