Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.Dimarcsym
 Послать отзыв
 Свойство определяет отображение обозначения дуги в размерном тексте длины дуги.
 Синтаксис
C#
Visual Basic
Копировать Код
public int Dimarcsym;
Копировать Код
Public Property Dimarcsym As Integer
 Возвращает
 Возвращает вариант отображения обозначения дуги. Тип int.
 Описание
 Свойство определяет отображение обозначения дуги в размерном тексте длины дуги.
 Значение
 Описание
 0
 Помещает обозначение длины дуги перед текстом размера.
 1
 Помещает обозначение длины дуги над текстом размера.
 2
 Отображение обозначения длины дуги подавлено.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!