Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.PointEntity2d
 Послать отзыв
 Класс PointEntity2d является базовым классом для всех классов двумерных точечных объектов.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Geometry::Entity2d Teigha::Geometry::PointEntity2d
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdGePointEnt2d")] public abstract class PointEntity2d : Entity2d
Копировать Код
<Wrapper("OdGePointEnt2d")> Public MustInherit Class PointEntity2d Inherits Entity2d
 Описание
 Класс PointEntity2d является базовым классом для всех классов двумерных точечных объектов.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Geometry.Entity2d
 Имя
 Описание
 Entity2d Методы
 Ниже перечислены методы класса Entity2d.
 Teigha.Geometry.PointEntity2d
 Имя
 Описание
 PointEntity2d Методы
 Ниже перечислены методы класса PointEntity2d.
 PointEntity2d Свойства
 Ниже перечислены свойства класса PointEntity2d.
 Ссылки
 PointEntity2d Методы, PointEntity2d Свойства, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!