Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ExtrudedSurface.CreateExtrudedSurface
 Послать отзыв
 Метод CreateExtrudedSurface предназначен для создания экструдированной поверхности сдвигом плоской кривой, области или плоской поверхности на заданный вектор.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void CreateExtrudedSurface( ref Entity sweepEnt, Vector3d directionVec, ref DatabaseServices.SweepOptions sweepOptions );
Копировать Код
Public Overridable Sub CreateExtrudedSurface( ByRef sweepEnt As Entity, directionVec As Vector3d, ByRef sweepOptions As DatabaseServices.SweepOptions )
 Параметры
 Параметры
 Описание
 sweepEnt
 Выдавливаемый геометрический объект - кривая, область или плоская поверхность. Тип Entity.
 directionVec
 Вектор, определяющий направление и длину выдавливания. Тип Vector3d.
 sweepOptions
 Опции выдавливания из перечисления DatabaseServices.SweepOptions.
 Описание
 Метод CreateExtrudedSurface предназначен для создания экструдированной поверхности сдвигом плоской кривой, области или плоской поверхности на заданный вектор. С помощью аргумента sweepOptions можно настроить дополнительные параметры операции выдавливания.
 Замечания
 Этот метод реализован только для пространственного моделирования, в случае иных моделлеров выбрасывает исключение eNotImplementedYet.
 Ссылки
 Teigha.DatabaseServices.ExtrudedSurface, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!