Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.HostApplicationServices.LocalRootFolder
 Послать отзыв
 Свойство предоставляет путь к корневой папке. Реализация по умолчанию возвращает пустую строку.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual String LocalRootFolder;
Копировать Код
Public Overridable ReadOnly Property LocalRootFolder As String
 Возвращает
 Возвращает путь к корневой папке. Тип String.
 Описание
 Свойство предоставляет путь к корневой папке. Реализация по умолчанию возвращает пустую строку.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.HostApplicationServices, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!