Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.LayerTableId
 Послать отзыв
 Синтаксис
C#
Visual Basic
public DatabaseServices::ObjectId LayerTableId;
Public Property LayerTableId() As DatabaseServices.ObjectId
 Описание
 Возвращает Id таблицы слоев базы данных.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!