Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve2d.IsDegenerate
 Послать отзыв
 Метод проверяет, является ли данная кривая вырожденной в пределах заданной геометрической точности.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsDegenerate( out Entity2d result, Tolerance tolerance );
Копировать Код
Public Function IsDegenerate( ByRef result As Entity2d, tolerance As Tolerance ) As Boolean
 Параметры
 Параметры
 Описание
 result
 Выходной тип объекта, в который выродилась кривая (в случае вырождения). Тип Entity2d.
 tolerance
 Заданная геометрическая точность. Тип Tolerance.
 Возвращает
 Возвращает true, если вырождение имеет место. В противном случае возвращает false.
 Описание
 Метод проверяет, является ли данная кривая вырожденной в пределах заданной геометрической точности. В случае вырождения возвращает тип объекта, в которой вырождается кривая.
 Ссылки
 Teigha.Geometry.Curve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!