Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DxfFiler.ReadDouble
 Послать отзыв
 Метод возвращает значение типа double из текущего элемента этого объекта Filer.
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract double ReadDouble();
Копировать Код
Public MustOverride Function ReadDouble() As Double
 Возвращает
 Возвращает значение типа double.
 Описание
 Метод возвращает значение типа double из текущего элемента этого объекта Filer.
 Ссылки
 Teigha.DatabaseServices.DxfFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!