Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Material.ColorBleedScale
 Послать отзыв
 Свойство, которое представляет коэффициент цветового заполнения для данного материала.
 Синтаксис
C#
Visual Basic
Копировать Код
public double ColorBleedScale;
Копировать Код
Public Property ColorBleedScale As Double
 Возвращает
 Возвращает коэффициент цветового заполнения. Тип double.
 Описание
 Свойство, которое представляет коэффициент цветового заполнения для данного материала (color bleed scale).
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Material, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!