Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Tducreate
 Послать отзыв
 Синтаксис
C#
Visual Basic
public DateTime Tducreate;
Public Property Tducreate() As DateTime
 Описание
 Обеспечивает доступ к текущему значению TDUCREATE для базы данных.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!