Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LoftOptions.CheckGuideCurves
 Послать отзыв
 Метод позволяет проверить, допустимы ли указанные направляющие для операции лофта.
 Синтаксис
C#
Visual Basic
Копировать Код
public void CheckGuideCurves( ref Entity[] guideCurves, bool displayErrorMessages );
Копировать Код
Public Sub CheckGuideCurves( ByRef guideCurves() As Entity, displayErrorMessages As Boolean )
 Параметры
 Параметры
 Описание
 guideCurves
 Массив кривых, используемых в качестве направляющих в операции лофта. Тип Entity[].
 displayErrorMessages
 Флаг, определяющий, требуется ли отображать сообщения об ошибках. Тип bool. Значение по умолчанию - false.
 Описание
 Метод позволяет проверить, допустимы ли указанные направляющие для операции лофта. Метод выбрасывает исключение eInvalidInput, если кривые недопустимы.
 Ссылки
 Teigha.DatabaseServices.LoftOptions, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!