Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Viewport.GridBoundToLimits
 Послать отзыв
 Свойство GridBoundToLimits определяет, отображается ли сетка в этом видовом экране только в границах лимитов МСК (WCS) и ПСК (UCS).
 Синтаксис
C#
Visual Basic
Копировать Код
public bool GridBoundToLimits;
Копировать Код
Public Property GridBoundToLimits As Boolean
 Возвращает
 Возвращает true, если сетка отображается только в границах МСК (WCS) и ПСК (UCS). В противном случае возвращает false.
 Описание
 Свойство GridBoundToLimits определяет, отображается ли сетка в этом видовом экране только в границах лимитов МСК (WCS) и ПСК (UCS).
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Viewport, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!