Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SymbolUtilityServices.BlockPaperSpaceName
 Послать отзыв
 Свойство BlockPaperSpaceName представляет предопределенную запись символа для имени пространства листа.
 Синтаксис
C#
Visual Basic
Копировать Код
public static String BlockPaperSpaceName;
Копировать Код
Public Shared ReadOnly Property BlockPaperSpaceName As String
 Возвращает
 Возвращает предопределенное имя пространства листа. Тип String.
 Описание
 Свойство BlockPaperSpaceName представляет предопределенную запись символа для имени пространства листа. Не может быть ни NULL, ни пустой строкой.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.SymbolUtilityServices, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!