Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.ExternalBoundedSurface.SetToOwnSurface
 Послать отзыв
 Метод делает этот объект владельцем данных своего определения.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetToOwnSurface();
Копировать Код
Public Sub SetToOwnSurface()
 Описание
 Метод делает этот объект владельцем данных своего определения. Если текущий экземпляр уже является владельцем этих данных, метод не делает ничего. В противном случае метод создает копию данных определения поверхности перед тем, как сделать данный объект владельцем этой геометрии.
 Замечания
 Данные, которыми владеет внешняя поверхность, удаляются при уничтожении внешней поверхности.
 Ссылки
 Teigha.Geometry.ExternalBoundedSurface, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!