Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DataTable.SetCellAt
 Послать отзыв
 Метод позволяет задать данные в ячейке с указанными индексами строки и столбца.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetCellAt( int row, int col, ref DataCell cell );
Копировать Код
Public Sub SetCellAt( row As Integer, col As Integer, ByRef cell As DataCell )
 Параметры
 Параметры
 Описание
 row
 Индекс строки. Тип int. В случае недействительного индекса строки метод выбрасывает исключение Teigha.Runtime.ErrorStatus.eInvalidInput.
 col
 Индекс столбца. Тип int. В случае недействительного индекса столбца метод выбрасывает исключение Teigha.Runtime.ErrorStatus.eInvalidInput.
 cell
 Данные для ячейки. Тип DataCell.
 Описание
 Метод позволяет задать данные в ячейке с указанными индексами строки и столбца.
 Ссылки
 Teigha.DatabaseServices.DataTable, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!