Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.LineSegment3d.LineSegment3d
 Послать отзыв
 Конструктор по умолчанию класса LineSegment3d.
 Синтаксис
C#
Visual Basic
Копировать Код
public LineSegment3d();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса LineSegment3d. Строит линейный сегмент с концами в точках (0,0,0) и (1,0,0).
 Ссылки
 Teigha.Geometry.LineSegment3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!