Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector3d.IsZeroLength
 Послать отзыв
 Метод позволяет проверить, является ли данный вектор нулевым.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsZeroLength();
Копировать Код
Public Function IsZeroLength() As Boolean
 Возвращает
 Возвращает true, если данный вектор можно считать нулевым. В противном случае возвращает false.
 Описание
 Метод позволяет проверить, является ли данный вектор нулевым. Реализация использует вызов Vector3d.IsZeroLength(Tolerance tolerance) со значением аргумента tolerance, равным Tolerance.Global. Метод возвращает true, если это условие выполнено, и false в противном случае.
 Ссылки
 Teigha.Geometry.Vector3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!