Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Solid3d.SetSubentityColor
 Послать отзыв
 Метод позволяет задать цвет указанной подобъекту грани или ребра.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetSubentityColor( SubentityId subEntityId, ref Teigha.Colors.Color color );
Копировать Код
Public Overridable Sub SetSubentityColor( subEntityId As SubentityId, ByRef color As Teigha.Colors.Color )
 Параметры
 Параметры
 Описание
 subEntityId
 Идентификатор подобъекта (грани или ребра), которому назначается новый цвет. Тип SubentityId.
 color
 Новый цвет подобъекта. Тип Teigha.Colors.Color.
 Описание
 Метод позволяет задать цвет указанной подобъекту грани или ребра.
 Ссылки
 Teigha.DatabaseServices.Solid3d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!