Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.SetColumnWidth
 Послать отзыв
 Метод позволяет задать единую ширину для всех столбцов данной таблицы.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetColumnWidth( double width );
Копировать Код
Public virtual Sub SetColumnWidth( width As double )
 Параметры
 Параметры
 Описание
 width
 Новое значение ширины для всех столбцов таблицы. Тип double.
 Описание
 Метод позволяет задать единую ширину для всех столбцов данной таблицы.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!