Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.Dimtolj
 Послать отзыв
 Свойство управляет вертикальным выравниванием текста допуска относительно текста номинального размера.
 Синтаксис
C#
Visual Basic
Копировать Код
public int Dimtolj;
Копировать Код
Public Property Dimtolj As Integer
 Возвращает
 Возвращает код варианта вертикального выравнивания текста допуска. Тип int.
 Описание
 Свойство позволяет выбрать вариант вертикального выравнивания текста допуска относительно текста номинального размера.
 Свойство принимает следующие значения:
 Значение
 Описание
 0
 Снизу.
 1
 Посередине.
 2
 Сверху.
 Это свойство имеет эффект только в том случае, когда отображение допуска включено (т.е. свойство Dimtol имеет значение true).
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!