Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.DrawOrderCtl
 Послать отзыв
 Синтаксис
C#
Visual Basic
public unsigned char DrawOrderCtl;
Public Property DrawOrderCtl() As unsigned char
 Описание
 Устанавливает или возвращает значение системной переменной DRAWORDERCTL, которая позволяет пользователю вернуться к прежнему режиму работы с чертежом, если это требуется. Эта переменная в чертеже должна быть согласована со значением SORTENTS.
 Значения определяются следующим образом:
0 — полная функциональность чертежа;
1 — отсутствует оперативное обновление графики. Когда этот бит установлен, измененные объекты появляются перед остальными. Важно отметить, что это в действительности не гарантирует, что они останутся на том же месте после выполнения команды REGEN, сохранения файла, его закрытия и повторного открытия или при его печати;
2 — установка этого бита закрывает наследование объектов, полученное от других объектов, таких как разделяемые объекты. Если он выключен, новая линия, созданная из разделяемой линии, будет располагаться перед всеми объектами, а старая линия будет на своем старом месте чертежа;
3 — и оперативное обновление графики, и наследование объектов, полученное от других объектов, запрещены.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!