Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbSurface.SingularityInV
 Послать отзыв
 Свойство SingularityInV представляет одно из значений NurbSurfaceProperties, которое является характеристикой сингулярности поверхности в направлении V.
 Синтаксис
C#
Visual Basic
Копировать Код
public int SingularityInV;
Копировать Код
Public ReadOnly Property SingularityInV As Integer
 Возвращает
 Возвращает значение NurbSurfaceProperties, являющееся характеристикой сингулярности поверхности в направлении V. Тип int.
 Описание
 Свойство SingularityInV представляет одно из значений NurbSurfaceProperties, которое является характеристикой сингулярности поверхности в направлении V.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.NurbSurface, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!