Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Matrix2dBuilder.ElementAt
 Послать отзыв
 Свойство ElementAt представляет элемент матрицы с указанными индексами строки и столбца.
 Синтаксис
C#
Visual Basic
Копировать Код
public double this[int i, int j];
Копировать Код
Default Public Property ElementAt( i As Integer, j As Integer ) As Double
 Параметры
 Параметры
 Описание
 i
 Индекс строки. Тип int.
 j
 Индекс столбца. Тип int.
 Возвращает
 Возвращает элемент матрицы с указанными индексами строки и столбца. Тип double.
 Описание
 Свойство ElementAt представляет элемент матрицы с указанными индексами строки и столбца.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.Geometry.Matrix2dBuilder, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!