Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AuditInfo.NumErrors
 Послать отзыв
 Свойство возвращает количество ошибок, учтенных в данном экземпляре AuditInfo.
 Синтаксис
C#
Visual Basic
Копировать Код
public int NumErrors;
Копировать Код
Public Property NumErrors() As Integer
 Возвращает
 Возвращает количество учтенных ошибок. Тип int.
 Описание
 Свойство обеспечивает доступ к счетчику количества ошибок, учтенных в данном экземпляре AuditInfo.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.AuditInfo, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!