Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Cone.ReferenceAxis
 Послать отзыв
 Свойство ReferenceAxis представляет опорный вектор в основании конуса.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d ReferenceAxis;
Копировать Код
Public ReadOnly Property ReferenceAxis As Vector3d
 Возвращает
 Возвращает опорный вектор в основании конуса. Тип Vector3d.
 Описание
 Свойство ReferenceAxis представляет опорный вектор в основании конуса. Он определяет направления отсчета углов в основании конуса.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.Cone, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!