Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GeoLocationData.TransformFromLonLatAlt
 Послать отзыв
 Метод предназначен для преобразования географической точки в координатах ГИС в эквивалентную точку в координатах DWG.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d TransformFromLonLatAlt( Point3d geoPt );
Копировать Код
Public Function TransformFromLonLatAlt( geoPt As Point3d ) As Point3d
 Параметры
 Параметры
 Описание
 geoPt
 Исходная географическая точка в системе координат ГИС. Тип Point3d.
 Возвращает
 Возвращает соответствующую точку в координатах модели. Тип Point3d.
 Описание
 Метод предназначен для преобразования географической точки в координатах ГИС в эквивалентную точку в координатах DWG. Значения долготы, широты и высоты исходной геоточки преобразуются, соответственно, в компоненты X, Y и Z точки назначения в координатах модели.
 Ссылки
 Teigha.DatabaseServices.GeoLocationData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!