Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Layout.LayoutName
 Послать отзыв
 Обеспечивает доступ к имени листа, которое отображается на вкладке листа.
 Синтаксис
C#
Visual Basic
Копировать Код
public String LayoutName;
Копировать Код
Public Property LayoutName() As String
 Возвращает
 Возвращает отображаемое на вкладке имя листа, тип String.
 Описание
 Обеспечивает доступ к имени листа, которое отображается на вкладке листа.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Layout, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!