Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.NurbSurface.SetWeight
 Послать отзыв
 Метод позволяет задать новое значение веса в указанной позиции массива весов. Если поверхность не является рациональной, метод ничего не делает.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetWeight( int iUDegree, int iVDegree, double dWeight );
Копировать Код
Public Sub SetWeight( iUDegree As Integer, iVDegree As Integer, dWeight As Double )
 Параметры
 Параметры
 Описание
 iUDegree
 Индекс значения веса в направлении u. Тип int.
 iVDegree
 Индекс значения веса в направлении v. Тип int.
 dWeight
 Новое значение веса, которое устанавливается в указанной позиции. Тип double.
 Описание
 Метод позволяет задать новое значение веса в указанной позиции массива весов. Если поверхность не является рациональной, метод ничего не делает.
 Если поверхность не содержит информации о весах, метод генерирует исключение eFail. Если значения параметров iUDegree или iVDegree выходят за пределы допустимого диапазона, выбрасывается исключение eOutOfRange. Если этот метод в конкретном моделере не реализован, выбрасывается исключение eNotImplementedYet.
 Ссылки
 Teigha.DatabaseServices.NurbSurface, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!