Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FeatureControlFrame.Dimgap
 Послать отзыв
 Свойство Dimgap представляет текущее значение системной переменной DIMGAP, которая определяет зазор между размерным текстом и размерными линиями.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Dimgap;
Копировать Код
Public Property Dimgap As Double
 Возвращает
 Возвращает текущее значение системной переменной DIMGAP. Тип double.
 Описание
 Свойство Dimgap представляет текущее значение системной переменной DIMGAP, которая определяет зазор между размерным текстом и размерными линиями.
В случае отрицательного значения переменной DIMGAP размерный текст отображается в рамке.
Значение переменной DIMGAP используется также в качестве минимальной длины каждого сегмента размерной линии.
 Для размещения элементов линейного размера между выносными линиями требуется наличие достаточного пространства для двух стрелок (2 x DIMASZ), двух сегментов размерной линии (2 x DIMGAP), двух зазоров по обе стороны от размерного текста (2 x DIMGAP) и собственной длины размерного текста, которая зависит от текущей высоты размерного текста и количества отображаемых десятичных знаков.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.FeatureControlFrame, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!