Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство DBText.IsMirroredInX
 Послать отзыв
 Синтаксис
C#
Visual Basic
public bool IsMirroredInX;
Public Property IsMirroredInX() As bool
 Описание
 Обеспечивает доступ к признаку того, что текст отображается зеркально по направлению оси X (т.е. отображается справа налево в горизонтальном направлении). False означает, что текст отображается слева направо.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.DBText, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!