Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocEvaluationCallback.EndActionEvaluation
 Послать отзыв
 Метод реализует уведомление о том, что вычисление действия завершено.
 Синтаксис
C#
Visual Basic
Копировать Код
public void EndActionEvaluation( ref AssocAction action );
Копировать Код
Public Sub EndActionEvaluation( ByRef action As AssocAction )
 Параметры
 Параметры
 Описание
 action
 Действие, вычисление которого завершено. Тип AssocAction.
 Описание
 Метод реализует уведомление о том, что вычисление действия завершено.
 Ссылки
 Teigha.DatabaseServices.AssocEvaluationCallback, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!