Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Polyline2d.Normal
 Послать отзыв
 Свойство обеспечивает доступ к вектору нормали плоскости, в которой располагается полилиния.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d Normal;
Копировать Код
Public Property Normal() As Vector3d
 Возвращает
 Возвращает вектор типа Vector3d.
 Описание
 Свойство обеспечивает доступ к вектору нормали плоскости, в которой располагается полилиния. Вектор нормали дается в мировой системе координат (WCS).
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Polyline2d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!