Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Hatch.PatternAngle
 Послать отзыв
 Синтаксис
C#
Visual Basic
public double PatternAngle;
Public Property PatternAngle() As Double
 Описание
 Обеспечивает доступ к углу наклона образца (в радианах) объекта заливки.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Hatch, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!