Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SubDMesh.SubdRefine
 Послать отзыв
 Данный метод предназначен для применения текущей степени сглаженности сети к заданному массиву вершин и граней. Степень сглаженности устанавливается равной 0.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SubdRefine( ref FullSubentityPath[] paths );
Копировать Код
Public Sub SubdRefine( ByRef paths As FullSubentityPath[] )
 Параметры
 Параметры
 Описание
 paths
 Массив подобъектов. Тип FullSubentityPath[].
 Описание
 Данный метод предназначен для применения текущей степени сглаженности сети к заданному массиву вершин и граней. Степень сглаженности устанавливается равной 0.
 Ссылки
 Teigha.DatabaseServices.SubDMesh, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!