Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 DimStyleTableRecord.Dimclrt
 Послать отзыв
 Свойство отвечает за цвет текста, относящегося к размерам.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual Color Dimclrt { get; set; }
Копировать Код
Public Overridable Property Dimclrt As Color
 Возвращает
 Возвращает тип данных Teigha.Colors.Color.
 Возвращаемые значения
 Возвращаемые значения
 Описание
 BYBLOCK
 цвет текста, относящегося к размерам ПО БЛОКУ
 BYLAYER
 цвет текста, относящегося к размерам ПО СЛОЮ
 red
 цвет текста, относящегося к размерам КРАСНЫЙ
 yellow
 цвет текста, относящегося к размерам ЖЕЛТЫЙ
 green
 цвет текста, относящегося к размерам ЗЕЛЕНЫЙ
 cyan
 цвет текста, относящегося к размерам ГОЛУБОЙ
 blue
 цвет текста, относящегося к размерам СИНИЙ
 magenta
 цвет текста, относящегося к размерам ФИОЛЕТОВЫЙ
 white
 цвет текста, относящегося к размерам БЕЛЫЙ
 Описание
 В свойстве хранится цвет текста, относящегося к размерам, в виде типа данных Teigha.Colors.Color. Помимо различных цветов для этого свойства доступны значения «BYBLOCK» и «BYLAYER». Значение по умолчанию – «BYBLOCK».
 Свойство также доступно через системную переменную DIMCLRT и пользовательское меню в окне изменения/создания размерного стиля:
  При изменении системной переменной DIMCLRT будет создан новый размерный стиль под названием <переопределение> на основе текущего с новым значением DIMCLRT.
 Соответствия значений свойства Dimclrt в пользовательском интерфейсе и при работе с ним через .NET API:
 Наименование цвета в UI
 Наименование цвета при считывании через API
 Как изменить через API
 «По блоку»
 BYBLOCK
 Teigha.Colors.Color.FromColorIndex(Teigha.Colors.ColorMethod.ByBlock, 0)
 «По слою»
 BYLAYER
 Teigha.Colors.Color.FromColorIndex(Teigha.Colors.ColorMethod.ByLayer, 256)
 красный
 red
 Teigha.Colors.Color.FromColorIndex(Teigha.Colors.ColorMethod.ByColor, 1)
 желтый
 yellow
 Teigha.Colors.Color.FromColorIndex(Teigha.Colors.ColorMethod.ByColor, 2)
 зеленый
 green
 Teigha.Colors.Color.FromColorIndex(Teigha.Colors.ColorMethod.ByColor, 3)
 голубой
 cyan
 Teigha.Colors.Color.FromColorIndex(Teigha.Colors.ColorMethod.ByColor, 4)
 синий
 blue
 Teigha.Colors.Color.FromColorIndex(Teigha.Colors.ColorMethod.ByColor, 5)
 фиолетовый
 magenta
 Teigha.Colors.Color.FromColorIndex(Teigha.Colors.ColorMethod.ByColor, 6)
 белый
 white
 Teigha.Colors.Color.FromColorIndex(Teigha.Colors.ColorMethod.ByColor, 7)
 Условия
 Чтение и запись.
 Пример
 Пример изменения цвета текста, относящегося к размерам (значения свойства Dimclrt) в размерном стиле Standard:
C#
 Копировать Код
public partial class Commands { [Teigha.Runtime.CommandMethod("DimclrtChange")] public void DimclrtStandardDimStyle() { // Получение ссылки на активный документ HostMgd.ApplicationServices.Document doc = HostMgd.ApplicationServices.Application.DocumentManager.MdiActiveDocument; // Получение ссылки на редактор документа HostMgd.EditorInput.Editor ed = doc.Editor; // Получение ссылки на базу данных документа Teigha.DatabaseServices.Database db = doc.Database; // Начало транзакции с базой данных документа using (Teigha.DatabaseServices.Transaction trans = db.TransactionManager.StartTransaction()) { // Открываем таблицу размерных стилей для чтения Teigha.DatabaseServices.DimStyleTable dimStyleTable = trans.GetObject(db.DimStyleTableId, Teigha.DatabaseServices.OpenMode.ForRead) as Teigha.DatabaseServices.DimStyleTable; // Находим в таблице размерных стилей ObjectId нужного стиля по его названию Teigha.DatabaseServices.ObjectId styleId = dimStyleTable["Standard"]; // Открываем таблицу размерного стиля для изменений Teigha.DatabaseServices.DimStyleTableRecord obj = trans.GetObject(styleId, Teigha.DatabaseServices.OpenMode.ForWrite) as Teigha.DatabaseServices.DimStyleTableRecord; ed.WriteMessage($"nDimclrt before: {obj.Dimclrt}"); // Изменяем цвет размерного текста на красный obj.Dimclrt = Teigha.Colors.Color.FromColorIndex(Teigha.Colors.ColorMethod.ByColor, 1); ed.WriteMessage($"nDimclrt after: {obj.Dimclrt}"); trans.Commit(); } } }
 Результат работы команды DimclrtChange:
 Было:
 Стало:
 Ссылки
 Teigha.DatabaseServices.DimStyleTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!