Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector3dCollection.Add
 Послать отзыв
 Метод добавляет в коллекцию указанный объект Vector3d.
 Синтаксис
C#
Visual Basic
Копировать Код
public int Add( Vector3d value );
Копировать Код
Public Function Add( value As Vector3d ) As Integer
 Параметры
 Параметры
 Описание
 value
 Входной объект для добавления в коллекцию. Тип Vector3d.
 Возвращает
 Возвращает количество элементов в коллекции после добавления объекта value. Тип int.
 Описание
 Метод добавляет в коллекцию новый элемент, используя указанный объект Vector3d.
 Ссылки
 Teigha.Geometry.Vector3dCollection, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!