Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocManager.RemoveGlobalEvaluationCallback
 Послать отзыв
 Метод удаляет указанный пользовательский обратный вызов обновления из глобального объекта AssocEvaluationMultiCallback.
 Синтаксис
C#
Visual Basic
Копировать Код
public void RemoveGlobalEvaluationCallback( ref Object callback );
Копировать Код
Public Sub RemoveGlobalEvaluationCallback( ByRef callback As Object )
 Параметры
 Параметры
 Описание
 callback
 Удаляемый пользовательский обратный вызов. Тип Object.
 Описание
 Метод удаляет указанный пользовательский обратный вызов обновления из глобального объекта AssocEvaluationMultiCallback.
 Ссылки
 Teigha.DatabaseServices.AssocManager, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!