Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.ExternalCurve2d.NurbCurve
 Послать отзыв
 Свойство NurbCurve представляет внешнюю кривую в нативном представлении графической системы платформы.
 Синтаксис
C#
Visual Basic
Копировать Код
public NurbCurve2d NurbCurve;
Копировать Код
Public ReadOnly Property NurbCurve As NurbCurve2d
 Возвращает
 Возвращает нативное представление кривой в графической системе платформы. Тип NurbCurve2d.
 Описание
 Свойство NurbCurve представляет внешнюю кривую в нативном представлении графической системы платформы.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.ExternalCurve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!