Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 DimStyleTableRecord.Dimltype
 Послать отзыв
 Свойство отвечает за настройку типа размерных линий.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual ObjectId Dimltype { get; set; }
Копировать Код
Public Overridable Property Dimltype As ObjectId
 Возвращает
 Возвращает тип данных ObjectId.
 Описание
 В свойстве хранится ObjectId установленного типа линии для размерных линий. Значение по умолчанию - «По слою».
 Свойство также доступно через системную переменную DIMLTYPE и пользовательское меню в окне изменения/создания размерного стиля:
  При изменении системной переменной DIMLTYPE будет создан новый размерный стиль под названием <переопределение> на основе текущего с новым значением DIMLTYPE.
 Условия
 Чтение и запись.
 Пример
 Пример изменения типа размерных линий (значения свойства Dimltype) в размерном стиле "Standard":
C#
 Копировать Код
public partial class Commands { [Teigha.Runtime.CommandMethod("DimltypeChange")] public void DimltypeStandardDimStyle() { // Получение ссылки на активный документ HostMgd.ApplicationServices.Document doc = HostMgd.ApplicationServices.Application.DocumentManager.MdiActiveDocument; // Получение ссылки на редактор документа HostMgd.EditorInput.Editor ed = doc.Editor; // Получение ссылки на базу данных документа Teigha.DatabaseServices.Database db = doc.Database; // Начало транзакции с базой данных документа using (Teigha.DatabaseServices.Transaction trans = db.TransactionManager.StartTransaction()) { // Открываем таблицу размерных стилей для чтения Teigha.DatabaseServices.DimStyleTable dimStyleTable = trans.GetObject(db.DimStyleTableId, Teigha.DatabaseServices.OpenMode.ForRead) as Teigha.DatabaseServices.DimStyleTable; // Находим в таблице размерных стилей ObjectId нужного стиля по его названию Teigha.DatabaseServices.ObjectId styleId = dimStyleTable["Standard"]; // Открываем таблицу размерного стиля для изменений Teigha.DatabaseServices.DimStyleTableRecord obj = trans.GetObject(styleId, Teigha.DatabaseServices.OpenMode.ForWrite) as Teigha.DatabaseServices.DimStyleTableRecord; // Открываем таблицу типов линий для чтения Teigha.DatabaseServices.LinetypeTable linetypeTable= trans.GetObject(db.LinetypeTableId, Teigha.DatabaseServices.OpenMode.ForRead) as Teigha.DatabaseServices.LinetypeTable; ed.WriteMessage($"nDimltype before: {obj.Dimltype}"); // Изменяем тип размерных линий obj.Dimltype = linetypeTable["ГОСТ 2.303 3"]; // Также увеличим размерный текст и размер стрелок на окончаниях размерных линий obj.Dimtxt = 7; obj.Dimasz = 7; ed.WriteMessage($"nDimltype after: {obj.Dimltype}"); trans.Commit(); } } }
 Результат работы команды DimltypeChange:
 Было:
 Стало:
 Ссылки
 Teigha.DatabaseServices.DimStyleTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!