Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Solid3d.ShowHistory
 Послать отзыв
 Свойство ShowHistory позволяет определить, отображаются ли элементы из истории операций тела.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual bool ShowHistory;
Копировать Код
Public Overridable Property ShowHistory As Boolean
 Возвращает
 Возвращает true, если элементы из истории операций отображаются. В противном случае возвращает false.
 Описание
 Свойство ShowHistory позволяет определить, отображаются ли элементы из истории операций тела.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Solid3d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!