Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Polyline.GetSegmentType
 Послать отзыв
 Синтаксис
C#
Visual Basic
public SegmentType GetSegmentType(int index);
Public Function GetSegmentType(index As Integer) As SegmentType
 Параметры
 Параметры
 Описание
 index
 Индекс (отсчитываемый от 0) вершины
 Описание
 Этот метод возвращает тип сегмента (SegType), который начинается с вершины index.
 Если index некорректный, то метод принимает значения начальной и конечной вершин, равными 0.0, и возвращает SegType Coincident.
 Ссылки
 Teigha.DatabaseServices.Polyline, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!