Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeader.LeaderLineTypeId
 Послать отзыв
 Свойство представляет идентификатор ObjectId типа линии, используемого для отрисовки выносных линий данного объекта MLeader.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.ObjectId LeaderLineTypeId;
Копировать Код
Public Property LeaderLineTypeId As DatabaseServices.ObjectId
 Возвращает
 Возвращает идентификатор типа линии. Тип DatabaseServices.ObjectId.
 Описание
 Свойство представляет идентификатор ObjectId типа линии, используемого для отрисовки выносных линий данного объекта MLeader.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MLeader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!