Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeader.ExtendLeaderToText
 Послать отзыв
 Свойство позволяет проверить, продлеваются ли горизонтальные линии выносок автоматически до текста.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool ExtendLeaderToText;
Копировать Код
Public Property ExtendLeaderToText As Boolean
 Возвращает
 Возвращает true, если линии выноски автоматически продлеваются до текста. В противном случае возвращает false.
 Описание
 Свойство позволяет проверить, продлеваются ли горизонтальные линии выносок автоматически до текста.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MLeader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!