Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Position3d.Set
 Послать отзыв
 Метод переопределяет координатную привязку данного объекта позиции на основе указанной 3D-точки.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Set( Point3d point );
Копировать Код
Public Sub [Set]( point As Point3d )
 Параметры
 Параметры
 Описание
 point
 Входная 3D-точка, определяющая новое положение данного объекта позиции. Тип Point3d.
 Описание
 Метод переопределяет координатную привязку данного объекта позиции на основе указанной 3D-точки.
 Ссылки
 Teigha.Geometry.Position3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!