Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ObjectErasedEventArgs.DBObject
 Послать отзыв
 Свойство DBObject представляет изменённый объект.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.DBObject DBObject;
Копировать Код
Public ReadOnly Property DBObject As DatabaseServices.DBObject
 Возвращает
 Возвращает изменённый объект. Тип DatabaseServices.DBObject.
 Описание
 Свойство DBObject представляет изменённый объект.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.ObjectErasedEventArgs, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!