Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.TableStyle.CellStyles
 Послать отзыв
 Свойство CellStyles представляет массив стилей ячеек, связанных с данным табличным стилем.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual ArrayList CellStyles;
Копировать Код
Public Overridable ReadOnly Property CellStyles As ArrayList
 Возвращает
 Возвращает массив стилей ячеек. Тип ArrayList.
 Описание
 Свойство CellStyles представляет массив стилей ячеек, связанных с данным табличным стилем.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.TableStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!