Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotSettingsValidator.GetPlotDeviceList
 Послать отзыв
 Метод предоставляет коллекцию всех доступных системных принтеров и файлов PC3 c настройками устройств печати.
 Синтаксис
C#
Visual Basic
Копировать Код
public StringCollection GetPlotDeviceList();
Копировать Код
Public Function GetPlotDeviceList() As StringCollection
 Возвращает
 Возвращает коллекцию всех доступных системных принтеров. Тип StringCollection.
 Описание
 Метод предоставляет коллекцию всех доступных системных принтеров и файлов PC3 c настройками устройств печати. Эта коллекция создается лишь один раз в пределах сеанса nanoCAD, поэтому в случае каких-либо изменений в списке устройств печати следует предусмотреть ее принудительное обновление.
 Замечания
 Если какие-либо устройства печати, файлы PC3 или таблицы стилей печати изменяются после запуска приложения, то перед использованием других методов этого класса следует вызвать метод RefreshLists(), чтобы обновить списки стилей и устройств вывода.
 Ссылки
 Teigha.DatabaseServices.PlotSettingsValidator, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!