Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SkyBackground.SunId
 Послать отзыв
 Свойство SunId представляет идентификатор объекта солнца.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.ObjectId SunId;
Копировать Код
Public Property SunId As DatabaseServices.ObjectId
 Возвращает
 Возвращает идентификатор объекта солнца. Тип DatabaseServices.ObjectId.
 Описание
 Свойство SunId представляет доступ к идентификатору объекта солнца.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.SkyBackground, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!