Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.NurbSurface.RemoveControlPointsAtV
 Послать отзыв
 Метод удаляет из массива управляющих вершин ряд с указанным индексом в направлении v.
 Синтаксис
C#
Visual Basic
Копировать Код
public void RemoveControlPointsAtV( int iVIndex );
Копировать Код
Public Sub RemoveControlPointsAtV( iVIndex As Integer )
 Параметры
 Параметры
 Описание
 iVIndex
 Исходный индекс в направлении V  удаляемого ряда управляющих вершин. Тип int.
 Описание
 Метод удаляет из массива управляющих вершин ряд с указанным индексом в направлении v. Эта операция влияет на форму поверхности.
 Если поверхность не содержит никакой NURBS информации, метод генерирует исключение eFail. Если этот метод в конкретном моделере не реализован, выбрасывается исключение eNotImplementedYet.
 Ссылки
 Teigha.DatabaseServices.NurbSurface, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!