Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MText.ExplodeFragments
 Послать отзыв
 Метод предназначен для разбиения данного многострочного текста на простые текстовые фрагменты, каждый из которых передается на обработку указанной функции.
 Синтаксис
C#
Visual Basic
Копировать Код
public void ExplodeFragments( ref MTextFragmentCallback enumerator );
Копировать Код
Public Sub ExplodeFragments( ByRef enumerator As MTextFragmentCallback )
 Параметры
 Параметры
 Описание
 enumerator
 Функция обработки текстовых фрагментов. Тип MTextFragmentCallback.
 Описание
 Метод предназначен для разбиения данного многострочного текста на простые текстовые фрагменты, каждый из которых передается на обработку указанной функции.
 В контексте данного метода под фрагментом понимается часть текста в пределах одной строки до переноса по словам, имеющего определенный набор характеристик (т.е. шрифт, цвет, высота, ширина и т.п.). Таким образом, каждый перенос слов и всякое изменение характеристик текста начинают новый фрагмент.
 Функция обработки получает текстовый фрагмент в виде объекта MTextFragment, который представляет всю информацию о фрагменте. Каждый фрагмент обрабатывается один раз. Используется текущий объект WorldDraw. Функция обработки должна возвращать 1 для продолжения операции или 0 для завершения работы.
 Ссылки
 Teigha.DatabaseServices.MText, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!