Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Layout.Limits
 Послать отзыв
 Обеспечивает доступ к лимитам листа.
 Синтаксис
C#
Visual Basic
Копировать Код
public Extents2d Limits;
Копировать Код
Public Property Limits() As Extents2d
 Возвращает
 Возвращает лимиты листа в виде объекта Extents2d.
 Описание
 Обеспечивает доступ к лимитам листа.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Layout, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!