Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocArrayRectangularParameters.XAxisDirection
 Послать отзыв
 Свойство обеспечивает доступ к направлению рядов массива.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d XAxisDirection;
Копировать Код
Public Property XAxisDirection() As Vector3d
 Возвращает
 Возвращает направление рядов массива. Тип Vector3d.
 Описание
 Свойство обеспечивает доступ к направлению рядов массива (направление оси X массива).
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.AssocArrayRectangularParameters, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!