Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CustomScale.IsEqualTo
 Послать отзыв
 Метод предназначен для проверки данного объекта на совпадение с входным объектом CustomScale.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsEqualTo( CustomScale a );
Копировать Код
Public Function IsEqualTo( a As CustomScale ) As Boolean
 Параметры
 Параметры
 Описание
 a
 Пользовательский масштаб, с которым данный объект проверяется на равенство. Тип CustomScale.
 Возвращает
 Возвращает true, если входной объект a не является нулевым и имеет те же самые значения числителя и знаменателя масштаба. В противном случае возвращает false.
 Описание
 Метод предназначен для проверки данного объекта на совпадение с входным объектом CustomScale.
 Ссылки
 Teigha.DatabaseServices.CustomScale, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!