Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FieldState
 Послать отзыв
 Данное перечисление определяет состояния поля.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum FieldState { Compiled = 2, Evaluated = 8, HasCache = 16, HasFormattedString = 32, Initialized = 1, Modified = 4 }
Копировать Код
Public Enum FieldState Compiled = 2 Evaluated = 8 HasCache = 16 HasFormattedString = 32 Initialized = 1 Modified = 4 End Enum
 Члены
 Члены
 Описание
 Initialized
 Значение: 1. Поле инициализировано.
 Compiled
 Значение: 2. Поле компилировано.
 Modified
 Значение: 4. Поле изменено.
 Evaluated
 Значение: 8. Поле вычислено.
 HasCache
 Значение: 16. Поле имеет кэш.
 HasFormattedString
 Значение: 32. Поле имеет форматированную строку.
 Описание
 Данное перечисление определяет состояния поля.
 Ваши комментарии по поводу этого топика: Послать отзыв!