Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DimAssoc.ModifiedGraphics
 Послать отзыв
 Метод уведомления, который вызывается при открытии на изменение объекта, производного от Entity.
 Синтаксис
C#
Visual Basic
Копировать Код
public void ModifiedGraphics( ref DBObject pObj );
Копировать Код
Public Sub ModifiedGraphics( ByRef pObj As DBObject )
 Параметры
 Параметры
 Описание
 pObj
 Входной указатель на изменяемый объект. Тип DBObject.
 Описание
 Метод уведомления, который вызывается, когда объект, производный от Entity, открывается на изменение, и один из его методов вызывает DbObject.AssertWriteEnabled() или Entity.RecordGraphicsModified(), а затем объект закрывается с помощью метода DbObject.Close().
 Ссылки
 Teigha.DatabaseServices.DimAssoc, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!