Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.ShowHist
 Послать отзыв
 Синтаксис
C#
Visual Basic
public int ShowHist;
Public Property ShowHist() As Integer
 Описание
 Обеспечивает доступ к текущему значению SHOWHIST для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!