Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.IdMapping.Lookup
 Послать отзыв
 Метод предназначен для поиска в объекте IdMapping объекта IdPair с указанным ключом.
 Синтаксис
C#
Visual Basic
Копировать Код
public IdPair Lookup( ObjectId key );
Копировать Код
Public Function Lookup( key As ObjectId ) As IdPair
 Параметры
 Параметры
 Описание
 key
 Идентификатор исходного объекта клонирования как ключ для поиска объекта IdPair. Тип ObjectId.
 Возвращает
 Возвращает объект IdPair с заданным ключом key или NULL, если поиск успехом не увенчался.
 Описание
 Метод реализует поиск по ключу в данном объекте IdMapping и возвращает найденный объект IdPair с указанным ключом или NULL.
 Ссылки
 Teigha.DatabaseServices.IdMapping, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!