Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObject.DxfOut(DxfFiler)
 Послать отзыв
 Метод записывает данные этого объекта в указанный файл формата .dxf.
 Синтаксис
C#
Visual Basic
Копировать Код
public void DxfOut(DxfFiler filer);
Копировать Код
Public Sub DxfOut(filer As DxfFiler)
 Параметры
 Параметры
 Описание
 filer
 Набор данных, которые нужно записать в dxf-файл. Тип DxfFiler
 Описание
 Этот метод выполняет несколько внутренних учетных действий, и затем записывает в dxf-файл любые xdata, присоединенные к объекту.
 Ссылки
 Teigha.DatabaseServices.DBObject, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!