Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Line.EndPoint
 Послать отзыв
 Синтаксис
C#
Visual Basic
public Point3d EndPoint;
Public Property EndPoint() As Point3d
 Описание
 Обеспечивает доступ к координатам конечной точки линии в мировых координатах.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Line, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!