Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.TableCellType
 Послать отзыв
 Данное перечисление определяет типы ячеек в таблице.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum TableCellType { BlockCell = 2, MultipleContentCell = 3, TextCell = 1, UnknownCell = 0 }
Копировать Код
Public Enum TableCellType BlockCell = 2 MultipleContentCell = 3 TextCell = 1 UnknownCell = 0 End Enum
 Члены
 Члены
 Описание
 UnknownCell
 Значение: 0. Ячейка содержит неизвестный тип данных.
 TextCell
 Значение: 1. Ячейка содержит текст.
 BlockCell
 Значение: 2. Ячейка содержит блок.
 MultipleContentCell
 Значение: 3. В ячейке содержатся несколько объектов, возможно, различного типа.
 Описание
 Данное перечисление определяет типы ячеек в таблице.
 Ваши комментарии по поводу этого топика: Послать отзыв!