Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Solid3d.SetSubentityMaterialMapper
 Послать отзыв
 Метод позволяет задать указанному подобъекту новый объект Mapper для сопоставления материалов.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetSubentityMaterialMapper( SubentityId subEntityId, ref Mapper mapper );
Копировать Код
Public Overridable Sub SetSubentityMaterialMapper( subEntityId As SubentityId, ByRef mapper As Mapper )
 Параметры
 Параметры
 Описание
 subEntityId
 Идентификатор подобъекта. Тип SubentityId.
 mapper
 Объект для сопоставления материалов. Тип Mapper.
 Описание
 Метод позволяет задать указанному подобъекту новый объект Mapper для сопоставления материалов.
 Ссылки
 Teigha.DatabaseServices.Solid3d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!