Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 DimStyleTableRecord.Dimtsz
 Послать отзыв
 Свойство отвечает за настройку размеров архитектурных тиков, отрисованных вместо стрелок для линейных, радиальных и диаметральных размеров.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual double Dimtsz { get; set; }
Копировать Код
Public Overridable Property Dimtsz As Double
 Возвращает
 Возвращает тип данных double.
 Описание
 В свойстве хранится текущая настройка размеров архитектурных тиков. Если значение этого свойства 0, то в качестве окончаний размерных линий берется значение свойств Dimblk, Dimldrblk, Dimblk1, Dimblk1, Dimblk2, Dimblk2. Если значение этого свойства больше 0, то на окончаниях размерных линий отрисовываются архитектурные тики и их размер равен значению свойства.
 Свойство также доступно через системную переменную DIMTSZ.
  При изменении системной переменной DIMTSZ будет создан новый размерный стиль под названием <переопределение> на основе текущего с новым значением DIMTSZ.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.DimStyleTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!