Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DwgFiler.WriteDouble
 Послать отзыв
 Метод предназначен для записи заданного значения типа double в этот объект Filer.
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract void WriteDouble( double value );
Копировать Код
public MustOverride Sub WriteDouble( double value );
 Параметры
 Параметры
 Описание
 value
 Записываемое в Filer значение. Тип double.
 Описание
 Метод предназначен для записи заданного значения типа double в этот объект Filer.
 Ссылки
 Teigha.DatabaseServices.DwgFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!