Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector2dCollection.GetEnumerator
 Послать отзыв
 Метод предоставляет перечислитель для данной коллекции.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector2dCollectionEnumerator GetEnumerator();
Копировать Код
Public Function GetEnumerator() As Vector2dCollectionEnumerator
 Возвращает
 Возвращает перечислитель для данной коллекции. Тип Vector2dCollectionEnumerator.
 Описание
 Метод предоставляет перечислитель для данной коллекции.
 Ссылки
 Teigha.Geometry.Vector2dCollection, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!