Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DxfFiler.ReadInt64
 Послать отзыв
 Метод возвращает 64-разрядное целое число со знаком из текущего элемента этого объекта Filer.
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract long ReadInt64();
Копировать Код
Public MustOverride Function ReadUInt64() As ULong
 Возвращает
 Возвращает 64-разрядное целое число со знаком. Тип long.
 Описание
 Метод возвращает 64-разрядное целое число со знаком из текущего элемента этого объекта Filer.
 Ссылки
 Teigha.DatabaseServices.DxfFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!