Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DxfFiler.____FilerStatus_
 Послать отзыв
 Свойство возвращает текущее состояние данного объекта DxfFiler.
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract Runtime.ErrorStatus FilerStatus;
Копировать Код
Public MustOverride Property FilerStatus As Runtime.ErrorStatus
 Возвращает
 Возвращает текущее состояние данного объекта DxfFiler. Тип Runtime.ErrorStatus.
 Описание
 Свойство возвращает текущее состояние данного объекта DxfFiler.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.DxfFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!