Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.IntersectDisplay
 Послать отзыв
 Синтаксис
C#
Visual Basic
public int IntersectDisplay;
Public Property IntersectDisplay() As Integer
 Описание
 Возвращает или устанавливает текущее значение заголовка INTERSECTIONDISPLAY для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!