Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector3d.ToArray
 Послать отзыв
 Метод позволяет создать массив типа double, содержащий значения координат X, Y и Z данного вектора.
 Синтаксис
C#
Visual Basic
Копировать Код
public double[] ToArray();
Копировать Код
Public Function ToArray() As Double()
 Возвращает
 Возвращает массив с координатами данного вектора. Тип double[].
 Описание
 Метод позволяет создать массив типа double, содержащий значения координат X, Y и Z данного вектора.
 Ссылки
 Teigha.Geometry.Vector3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!