Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AbstractViewPE.FrozenLayers
 Послать отзыв
 Свойство FrozenLayers предоставляет доступ к коллекции замороженных слоёв.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectIdCollection FrozenLayers;
Копировать Код
Public Property FrozenLayers As ObjectIdCollection
 Возвращает
 Возвращает коллекцию замороженных слоёв. Тип ObjectIdCollection.
 Описание
 Свойство FrozenLayers предоставляет доступ к коллекции замороженных слоёв.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.AbstractViewPE, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!