Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Solid3dMassProperties.RadiiOfGyration
 Послать отзыв
 Свойство RadiiOfGyration представляет радиусы инерции твердого тела относительно осей X, Y и Z.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d RadiiOfGyration;
Копировать Код
Public ReadOnly Property RadiiOfGyration As Vector3d
 Возвращает
 Возвращает радиусы инерции. Тип Vector3d.
 Описание
 Свойство RadiiOfGyration представляет радиусы инерции твердого тела относительно осей X, Y и Z.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Solid3dMassProperties, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!