Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Curve.GetClosestPointTo
 Послать отзыв
 Метод сначала проецирует кривую на плоскость, заданную точкой givenPoint, а затем возвращает точку на кривой (в системе координат WCS), ближайшую к точке givenPoint.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual Point3d GetClosestPointTo( Point3d givenPoint, bool extend );
Копировать Код
Public virtual Function GetClosestPointTo( givenPoint As Point3d, extend As Boolean ) As Point3d
 Параметры
 Параметры
 Описание
 givenPoint
 Точка типа Point3d (заданная в мировой системе координат WCS), для которой нужно найти ближайшую точку на кривой.
 extend
 Аргумент, определяющий, допускается ли достраивать кривую в процессе поиска ближайшей точки. Задать true, если допускается, и false в противном случае.
 Возвращает
 Возвращает экземпляр класса Point3d.
 Описание
 Метод проецирует кривую на плоскость, заданную точкой givenPoint, а затем возвращает точку на кривой (в системе координат WCS), ближайшую к точке givenPoint.
 Ссылки
 Teigha.DatabaseServices.Curve, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!