Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Matrix3d
 Послать отзыв
 Класс Matrix3d представляет аффинное преобразование трехмерного пространства, включая вращения и трансляцию.
 Иерархия классов
Teigha::Geometry::Matrix3d
 Синтаксис
C#
Visual Basic
Копировать Код
[StructLayout(LayoutKind.Sequential),Wrapper("OdGeMatrix3d"),DefaultMember("ElementAt")] public class Matrix3d : IFormattable;
Копировать Код
<StructLayout(LayoutKind.Sequential),Wrapper("OdGeMatrix3d"),DefaultMember("ElementAt")> Public Class Matrix3d Inherits IFormattable
 Описание
 Класс Matrix3d представляет аффинное преобразование трехмерного пространства, включая вращения и трансляцию.
 Всякая матрица M типа Matrix3d имеет вид:
a00 a01 a02 t0 a10 a11 a12 t1 a20 a21 a22 t2 0 0 0 1
 где матрица A:
a00 a01 a02 a10 a11 a12 a20 a21 a22
 получила название линейной части матрицы M.
 Столбец T:
t0 t1 t2
 называется трансляционной частью матрицы M.
 Преобразование точки Point3d определяется произведением M x P, где M - матрица преобразования, P - столбец координат точки P = (pnt.x, pnt.y, pnt.z, 1.0)^T.
 Преобразование вектора Vector3d определяется произведением M x V, где M - матрица преобразования, V - вектор-столбец V = (vec.x, vec.y, vec.z, 0.0)^T.
 Всякую матрицу M можно связать с системой координат (СК). Такая система координат имеет начало в точке (t0, t1, t2), а направления координатных осей определяются векторами (a00, a10, a20), (a01, a11, a21) и (a02, a12, a22). Матрица M описывает преобразование в эту СК из базовой системы координат с началом в точке (0, 0, 0) и координатными осями (1, 0, 0), (0, 1, 0) и (0, 0, 1).
 Методы
 Конструкторы
 Имя
 Описание
 Matrix3d
 Конструктор создает 3D-матрицу на основе значений в переданном массиве.
 Топики
 Имя
 Описание
 Matrix3d Методы
 Ниже перечислены методы класса Matrix3d.
 Matrix3d Операторы
 Ниже перечислены операторы класса Matrix3d.
 Matrix3d Свойства
 Ниже перечислены свойства класса Matrix3d.
 Ссылки
 Matrix3d Методы, Matrix3d Операторы, Matrix3d Свойства, Методы, Топики, Matrix3d Методы, Matrix3d Операторы, Matrix3d Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!