Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Material.LuminanceMode
 Послать отзыв
 Свойство представляет режим яркости данного материала.
 Синтаксис
C#
Visual Basic
Копировать Код
public GraphicsInterface.LuminanceMode LuminanceMode;
Копировать Код
Public Property LuminanceMode As GraphicsInterface.LuminanceMode
 Возвращает
 Возвращает режим яркости материала. Перечисление GraphicsInterface.LuminanceMode.
 Описание
 Свойство представляет режим яркости данного материала. Он определяет, видим мы этот материал в отраженном свете, или же он обладает свойством самосвечения.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Material, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!