Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.UpdateOption
 Послать отзыв
 Данное перечисление определяет опции для обновления адаптеров данных.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum UpdateOption { None = 0, SkipFormat = 0x20000, UpdateRowHeight = 0x40000, UpdateColumnWidth = 0x80000, AllowSourceUpdate = 0x100000, ForceFullSourceUpdate = 0x200000, OverwriteContentModifiedAfterUpdate = 0x400000, OverwriteFormatModifiedAfterUpdate = 0x800000, ForPreview = 0x1000000, IncludeXrefs = 0x2000000 }
Копировать Код
Public Enum UpdateOption None = 0 SkipFormat = 0x20000 UpdateRowHeight = 0x40000 UpdateColumnWidth = 0x80000 AllowSourceUpdate = 0x100000 ForceFullSourceUpdate = 0x200000 OverwriteContentModifiedAfterUpdate = 0x400000 OverwriteFormatModifiedAfterUpdate = 0x800000 ForPreview = 0x1000000 IncludeXrefs = 0x2000000 End Enum
 Члены
 Члены
 Описание
 None
 Значение: 0. Опции обновления не заданы.
 SkipFormat
 Значение: 0x20000. Игнорировать формат ячейки и обновлять только содержимое ячейки.
 UpdateRowHeight
 Значение: 0x40000. Обновить высоту строки связанных ячеек, чтобы она соответствовала высоте ячеек в источнике.
 UpdateColumnWidth
 Значение: 0x80000. Обновить ширину столбца связанных ячеек, чтобы она соответствовала ширине столбца в источнике.
 AllowSourceUpdate
 Значение: 0x100000. Допускается запись в источник из данных в объекте nanoCAD.
 ForceFullSourceUpdate
 Значение: 0x200000. В источник перезаписываются все данные. Если этот параметр не установлен, в источник записываются только изменённые данные. Этот параметр действителен только при обновлении источника из данных (т.е. когда направление обновления принимает значение UpdateDirection.DataToSource).
 OverwriteContentModifiedAfterUpdate
 Значение: 0x400000. Выполняется перезапись всех изменений контента, внесенных в связанные данные с момента последнего обновления данных из источника. Этот параметр действителен только при обновлении данных из источника (т.е. когда направление обновления принимает значение UpdateDirection.SourceToData).
 OverwriteFormatModifiedAfterUpdate
 Значение: 0x800000. Выполняется перезапись всех изменений формата, внесенных в связанные данные с момента последнего обновления данных из источника. Этот параметр действителен только при обновлении данных из источника (т.е. когда направление обновления принимает значение UpdateDirection.SourceToData).
 ForPreview
 Значение: 0x1000000. Обновление предназначено лишь для отображения изменений в окне предварительного просмотра.
 IncludeXrefs
 Значение: 0x2000000. Выполняется обновление ссылок на данные во внешних ссылках xrefs. Используется в методе UpdateDataLink классов, где есть функционал связывания данных.
 Описание
 Данное перечисление определяет опции для обновления адаптеров данных.
 Ваши комментарии по поводу этого топика: Послать отзыв!