Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CustomScale.CustomScale
 Послать отзыв
 Конструктор класса CustomScale.
 Синтаксис
C#
Visual Basic
Копировать Код
public CustomScale( double numerator, double denominator );
Копировать Код
Public Sub New( numerator As Double, denominator As Double )
 Параметры
 Параметры
 Описание
 numerator
 Числитель. Тип double.
 denominator
 Знаменатель. Тип double.
 Описание
 Конструктор класса CustomScale. Создает новый пользовательский масштаб с указанными числителем и знаменателем.
 Ссылки
 Teigha.DatabaseServices.CustomScale, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!