Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.GridLineWeight
 Послать отзыв
 Метод позволяет получить толщину линии для заданного типа линии сетки и типа строки объекта Table.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual DatabaseServices.LineWeight GridLineWeight( GridLineType gridlineType, RowType type );
Копировать Код
Public virtual Function GridLineWeight( gridlineType As GridLineType, type As RowType ) As DatabaseServices.LineWeight
 Параметры
 Параметры
 Описание
 gridlineType
 Тип линии сетки из перечисления GridLineType.
 type
 Тип строки из перечисления RowType.
 Возвращает
 Возвращает толщину линии сетки как значение из перечисления DatabaseServices.LineWeight.
 Описание
 Метод позволяет получить толщину линии для заданного типа линии сетки и типа строки объекта Table.
 Замечания
 Для получения того же результата предпочтительнее использовать функционал объекта Cell.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!