Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.NurbSurface.GetNormal
 Послать отзыв
 Метод вычисляет вектор нормали к поверхности в точке, заданной параметрическими координатами ([u, v]).
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d GetNormal( double dU, double dV );
Копировать Код
Public Function GetNormal( dU As Double, dV As Double ) As Vector3d
 Параметры
 Параметры
 Описание
 dU
 Входное значение параметра U. Тип double.
 dV
 Входное значение параметра V. Тип double.
 Возвращает
 Возвращает вектор нормали к поверхности. Тип Vector3d.
 Описание
 Метод вычисляет вектор нормали к поверхности в точке, заданной параметрическими координатами ([u, v]).
 Если поверхность не содержит информации об управляющих вершинах, метод выбрасывает исключение eFail. Метод выбрасывает исключение eOutOfRange, если входные аргументы dU или dV оказываются недействительными.
 Ссылки
 Teigha.DatabaseServices.NurbSurface, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!