Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Matrix2d.CoordinateSystem2d
 Послать отзыв
 Свойство CoordinateSystem2d представляет начало и оси системы координат, в которую данная матрица отображает стандартную систему координат с началом (0,0) и осями (1,0) и (0,1).
 Синтаксис
C#
Visual Basic
Копировать Код
public Geometry.CoordinateSystem2d CoordinateSystem2d;
Копировать Код
Public ReadOnly Property CoordinateSystem2d As Geometry.CoordinateSystem2d
 Возвращает
 Возвращает объект Geometry.CoordinateSystem2d, который представляет начало и оси системы координат.
 Описание
 Свойство CoordinateSystem2d представляет начало и оси системы координат, в которую данная матрица отображает стандартную систему координат с началом (0,0) и осями (1,0) и (0,1).
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.Matrix2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!