Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Sphere.IsClosed
 Послать отзыв
 Метод позволяет проверить, является ли данный объект полной сферой.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsClosed();
Копировать Код
Public Function IsClosed() As Boolean
 Возвращает
 Возвращает true, если данный объект представляет собой полную сферу. В противном случае возвращает false.
 Описание
 Метод позволяет проверить, является ли данный объект полной сферой. Экватор полной (замкнутой) сферической поверхности представляет собой полную окружность. Используется вызов метода CircularArc2d.IsClosed(Tolerance tolerance) с точностью по умолчанию, равной Tolerance.Global.
 Ссылки
 Teigha.Geometry.Sphere, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!