Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SubentityId.!=
 Послать отзыв
 Оператор неравенства для структуры SubentityId.
 Синтаксис
C#
Visual Basic
Копировать Код
public static bool operator !=( SubentityId a, SubentityId b );
Копировать Код
Public Shared Operator <>( a As SubentityId, b As SubentityId ) As Boolean
 Параметры
 Параметры
 Описание
 a
 Левый операнд. Тип SubentityId.
 b
 Правый операнд. Тип SubentityId.
 Возвращает
 Возвращает true только в случае неравенства операндов. Тип bool.
 Описание
 Оператор неравенства для структуры SubentityId.
 Замечания
 Условием неравенства двух объектов SubentityId является невыполнение хотя бы одного из следующих условий:
Объекты имеют одинаковый тип подобъекта.
Объекты имеют одинаковый индекс подобъекта.
Объекты имеют одинаковый тип класса.
 Ссылки
 Teigha.DatabaseServices.SubentityId, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!