Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GripData.GripPoint
 Послать отзыв
 Свойство предоставляет доступ к точке привязки этой ручки.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d GripPoint;
Копировать Код
Public Property GripPoint As Point3d
 Возвращает
 Возвращает базовую точку ручки. Тип Point3d.
 Описание
 Свойство предоставляет доступ к базовой точке этой ручки.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.GripData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!