Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MlineStyleElementCollection.GetEnumerator
 Послать отзыв
 Метод предоставляет перечислитель для данной коллекции.
 Синтаксис
C#
Visual Basic
Копировать Код
public MlineStyleElementCollectionEnumerator GetEnumerator();
Копировать Код
Public Function GetEnumerator() As MlineStyleElementCollectionEnumerator
 Возвращает
 Возвращает перечислитель. Тип MlineStyleElementCollectionEnumerator.
 Описание
 Метод предоставляет перечислитель для данной коллекции.
 Ссылки
 Teigha.DatabaseServices.MlineStyleElementCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!