Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Solid3dMassProperties.Solid3dMassProperties
 Послать отзыв
 Конструктор класса Solid3dMassProperties.
 Синтаксис
C#
Visual Basic
Копировать Код
public Solid3dMassProperties( int dummy );
Копировать Код
Public Sub New( dummy As Integer )
 Параметры
 Параметры
 Описание
 dummy
 Не используется. Тип int.
 Описание
 Конструктор класса Solid3dMassProperties.
 Ссылки
 Teigha.DatabaseServices.Solid3dMassProperties, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!