Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.ExternalCurve3d.IsNativeCurve
 Послать отзыв
 Свойство IsNativeCurve позволяет проверить, поддерживает ли геометрическая библиотека платформы нативное представление данной внешней кривой.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsNativeCurve;
Копировать Код
Public ReadOnly Property IsNativeCurve As Boolean
 Возвращает
 Возвращает true, если геометрической библиотекой платформы поддерживается нативное представление данной внешней кривой. В противном случае возвращает false.
 Описание
 Свойство IsNativeCurve позволяет проверить, поддерживает ли геометрическая библиотека платформы нативное представление данной внешней кривой.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.ExternalCurve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!