Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocArrayCommonParameters.BaseNormal
 Послать отзыв
 Свойство предоставляет доступ к вектору нормали базовой плоскости.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d BaseNormal;
Копировать Код
Public Property BaseNormal() As Vector3d
 Возвращает
 Возвращает вектор нормали. Тип Vector3d.
 Описание
 Свойство предоставляет доступ к вектору нормали базовой плоскости.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.AssocArrayCommonParameters, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!