Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve3d.GetTrimmedOffset
 Послать отзыв
 Метод позволяет получить одну или несколько кривых смещением данной кривой (с возможной обрезкой).
 Синтаксис
C#
Visual Basic
Копировать Код
public Curve3d[] GetTrimmedOffset( double distance, Vector3d planeNormal, OffsetCurveExtensionType extensionType );
Копировать Код
Public Function GetTrimmedOffset( distance As double, planeNormal As Vector3d, extensionType As OffsetCurveExtensionType ) As Curve3d()
 Параметры
 Параметры
 Описание
 distance
 Величина смещения. Тип double.
 planeNormal
 Вектор нормали к плоскости кривой. Тип Vector3d.
 extensionType
 Значение из перечисления OffsetCurveExtensionType, которое определяет вариант смещения в точках излома исходной кривой (точки разрыва C1).
 Возвращает
 Возвращает массив кривых, полученных смещением.
 Описание
 Метод позволяет получить одну или несколько кривых смещением данной кривой (с возможной обрезкой).
 Реализация использует вызов метода Curve3d.GetTrimmedOffset(Double distance, Vector3d planeNormal, OffsetCurveExtensionType extensionType, Tolerance tolerance) с геометрическим допуском, равным Tolerance.Global.
 Исходная кривая должна быть плоской, а вектор planeNormal должен быть перпендикулярен плоскости кривой. Направление смещения кривой задается знаком величины смещения distance. За положительное направление смещения в точке на кривой принимается результат векторного произведения вектора planeNormal и вектора касательной в этой точке. Обрезка смещенных кривых используется, чтобы исключить случаи самопересечения.
 Ссылки
 Teigha.Geometry.Curve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!