Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.Dimtfillclr
 Послать отзыв
 Свойство определяет цвет фона для заполнения поля размерного текста.
 Синтаксис
C#
Visual Basic
Копировать Код
public Colors.Color Dimtfillclr;
Копировать Код
Public Property Dimtfillclr As Colors.Color
 Возвращает
 Возвращает цвет фоновой заливки размерного текста. Тип Colors.Color.
 Описание
 Свойство определяет цвет фона для заполнения поля размерного текста. Чтобы разрешить фоновую заливку текста указанным цветом, свойство Dimtfill должно быть установлено в значение 2.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!