Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод RasterImageDef.CloseImage
 Послать отзыв
 Синтаксис
C#
Visual Basic
public void CloseImage();
Public Sub CloseImage()
 Описание
 Закрывает связанный объект с данными изображения, и обновляет любые изменения экземпляра изображения nanoCAD.
 Ссылки
 Teigha.DatabaseServices.RasterImageDef, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!