Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Database.FromAcadDatabase
 Послать отзыв
 This is FromAcadDatabase, a member of class Database.
 Синтаксис
C#
Visual Basic
public Database FromAcadDatabase(ref Object acadDatabase);
Public Function FromAcadDatabase(ByRef acadDatabase As Object) As Database
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!