Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SweepOptions.SweepOptions
 Послать отзыв
 Конструктор класса SweepOptions. Создает экземпляр класса как копию указанного объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public SweepOptions( ref SweepOptions opts );
Копировать Код
Public Sub New( ByRef opts As SweepOptions )
 Параметры
 Параметры
 Описание
 opts
 Экземпляр класса, копию которого требуется создать. Тип SweepOptions.
 Описание
 Конструктор класса SweepOptions. Создает экземпляр класса, являющийся копией переданного в аргументе объекта SweepOptions.
 Ссылки
 Teigha.DatabaseServices.SweepOptions, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!