Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LayerTable
 Послать отзыв
 Класс предназначен для хранения определений слоёв в базе данных чертежа.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::GraphicsInterface::Drawable Teigha::DatabaseServices::DBObject Teigha::DatabaseServices::SymbolTable Teigha::DatabaseServices::LayerTable
 Синтаксис
C#
Visual Basic
[Wrapper("AcDbLayerTable")] public class LayerTable : SymbolTable;
<Wrapper("AcDbLayerTable")> Public Class LayerTable Inherits SymbolTable
 Описание
 Класс предназначен для хранения определений слоёв в базе данных чертежа, то есть является коллекцией/таблицей, в которой каждая запись – это определение слоя. Определение слоя – это набор данных, определяющий его характеристики: название, цвет, прозрачность и пр. Для определения слоя используется класс LayerTableRecord. Соответственно, все записи таблицы слоёв имеют тип данных LayerTableRecord. Итератор таблицы устроен так, что при переборе коллекции перебираются ObjectId каждого элемента. По ObjectId можно открыть каждую запись и получить подробные данные, либо изменить их.
 В интерфейсе nanoCAD каждое определение слоя (запись в таблице слоёв) является слоём в менеджере слоёв. Сам менеджер слоёв отражает всё содержимое и возможности таблицы слоёв. Слои создаются для упорядочивания работы с чертежом. Каждый объект чертежа расположен на каком-либо слое. По умолчанию в новом чертеже всегда есть слой «0». В таблицу слоёв можно добавлять нужное количество слоёв, изменять свойства этих слоёв и удалять неиспользуемые.
 На рисунке приведено диалоговое окно менеджера слоёв, которое можно вызвать либо через меню nanoCAD (Формат -> Слои), либо командой LAYERS (ДИАЛСЛОЙ).
 В окне можно увидеть все слои, которые есть в документе и их основные свойства: статус, имя, видимость, заморозка, защита от изменений, цвет, тип линий, вес линий, прозрачность, стиль печати, печать, заморозка в новых видовых экранах.
 К каждому слою можно делать пояснения, которые будут видны в графе «Пояснения» окна менеджера слоёв. Вся эта информация хранится в таблице слоёв и её записях по каждому отдельному слою.
 Пример
 В качестве примера работы с таблицей слоёв приведена команда LayerTableReading, которая открывает таблицу слоёв и перебирает её содержимое, выводя в командную строку название каждого слоя и его тип.
C#
 Копировать Код
public partial class Commands { [Teigha.Runtime.CommandMethod("LayerTableReading")] public void LayerTableReading() { // Получение ссылки на активный документ HostMgd.ApplicationServices.Document doc = HostMgd.ApplicationServices.Application.DocumentManager.MdiActiveDocument; // Получение ссылки на редактор докумена HostMgd.EditorInput.Editor ed = doc.Editor; // Получение ссылки на базу данных документа Teigha.DatabaseServices.Database db = doc.Database; // Начало транзакции с базой данных документа using (Teigha.DatabaseServices.Transaction trans = db.TransactionManager.StartTransaction()) { // Открываем таблицу блоков для чтения Teigha.DatabaseServices.LayerTable layerTable = trans.GetObject(db.LayerTableId, Teigha.DatabaseServices.OpenMode.ForRead) as Teigha.DatabaseServices.LayerTable; ed.WriteMessage($"LT: {layerTable.IncludingHidden.HasFields}"); // Перебираем таблицу блоков в цикле foreach (Teigha.DatabaseServices.ObjectId ltr in layerTable) { // Открываем каждую запись таблицы Teigha.DatabaseServices.LayerTableRecord obj = trans.GetObject(ltr, Teigha.DatabaseServices.OpenMode.ForRead) as Teigha.DatabaseServices.LayerTableRecord; // Выводим в командную строку название каждой записи и ее тип ed.WriteMessage($"nTable record name and type: {obj.Name} , {obj.GetType()} "); } trans.Abort(); } } }
 На рисунке ниже приведен пример того, как отработала команда LayerTableReading в новом пустом документе, где еще не созданы новые слои. Соответственно, в перечне можно увидеть только слой 0, который существует во всех dwg-документах по умолчанию и его тип.
 Методы
 Конструкторы
 Teigha.GraphicsInterface.Drawable
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 Drawable
 Конструктор класса Teigha.GraphicsInterface.Drawable. (Унаследован от Drawable)
 Teigha.DatabaseServices.DBObject
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 DBObject
 Конструктор. (Унаследован от DBObject)
 Teigha.DatabaseServices.SymbolTable
 ПоказатьPrivateУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 SymbolTable
 This is SymbolTable, a member of class SymbolTable. (Унаследован от SymbolTable)
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.GraphicsInterface.Drawable
 Имя
 Описание
 Drawable Методы
 Ниже перечислены методы класса Drawable.
 Drawable Свойства
 Ниже перечислены свойства класса Drawable.
 Teigha.DatabaseServices.DBObject
 Имя
 Описание
 DBObject Методы
 Ниже перечислены методы класса DBObject.
 DBObject Свойства
 Ниже перечислены свойства класса DBObject.
 DBObject События
 Ниже перечислены события класса DBObject.
 Teigha.DatabaseServices.SymbolTable
 Имя
 Описание
 SymbolTable Методы
 Ниже перечислены методы класса SymbolTable.
 SymbolTable Свойства
 Ниже перечислены свойства класса SymbolTable.
 Teigha.DatabaseServices.LayerTable
 Имя
 Описание
 LayerTable Методы
 Ниже перечислены методы класса LayerTable.
 LayerTable Свойства
 Ниже перечислены свойства класса LayerTable.
 Ссылки
 LayerTable Методы, LayerTable Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства, DBObject События
 Ваши комментарии по поводу этого топика: Послать отзыв!