Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Cone.Set
 Послать отзыв
 Метод позволяет переопределить основные параметры конуса - центр и радиус основания, направление оси и угол раствора конуса.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Set( double cosineAngle, double sineAngle, Point3d baseCenter, double baseRadius, Vector3d axisOfSymmetry );
Копировать Код
Public Sub Set( cosineAngle As Double, sineAngle As Double, baseCenter As Point3d, baseRadius As Double, axisOfSymmetry As Vector3d )
 Параметры
 Параметры
 Описание
 cosineAngle
 Косинус угла между осью конуса и его образующей. Тип double.
 sineAngle
 Синус угла между осью конуса и его образующей. Тип double.
 baseCenter
 Центр окружности в основании конуса. Тип Point3d.
 baseRadius
 Радиус основания конуса. Тип double.
 axisOfSymmetry
 Направление оси конуса. Тип Vector3d.
 Описание
 Метод позволяет переопределить основные параметры конуса - центр и радиус основания, направление оси и угол раствора конуса.
 Ссылки
 Teigha.Geometry.Cone, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!