Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CompoundObjectId.Remap
 Послать отзыв
 Метод позволяет заново сопоставить все идентификаторы объектов, относящиеся к данному CompoundObjectId, используя указанный экземпляр класса IdMapping.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool Remap( ref IdMapping idMap );
Копировать Код
Public Function Remap( ByRef idMap As IdMapping ) As Boolean
 Параметры
 Параметры
 Описание
 idMap
 Объект, использовавшийся в процессе глубокого клонирования. Тип IdMapping.
 Возвращает
 Возвращает true, если пересопоставление завершилось успешно. В противном случае возвращает false.
 Описание
 Метод позволяет заново сопоставить все идентификаторы объектов, относящиеся к данному CompoundObjectId, используя указанный экземпляр класса IdMapping.
 Ссылки
 Teigha.DatabaseServices.CompoundObjectId, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!