Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LinkedTableData.AppendColumn
 Послать отзыв
 Метод добавляет в данную таблицу указанное количество столбцов.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual int AppendColumn( int columnsNumber );
Копировать Код
Public Overridable Function AppendColumn( columnsNumber As Integer ) As Integer
 Параметры
 Параметры
 Описание
 columnsNumber
 Количество добавляемых столбцов. Тип int.
 Возвращает
 Возвращает индекс первого добавленного столбца. Тип int.
 Описание
 Метод добавляет в данную таблицу указанное количество столбцов.
 Замечания
 Если аргумент columnsNumber меньше или равен нулю, метод выбрасывает исключение eInvalidInput.
 Ссылки
 Teigha.DatabaseServices.LinkedTableData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!