Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство RasterImageDef.UndoStoreSize
 Послать отзыв
 Синтаксис
C#
Visual Basic
public int UndoStoreSize;
Public Property UndoStoreSize() As Integer
 Описание
 Обеспечивает доступ к текущему размеру буфера Undo.
 Ссылки
 Teigha.DatabaseServices.RasterImageDef, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!