Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 ViewportTableRecord.IconAtOrigin
 Послать отзыв
 Свойство предназначено для управления расположением значка системы координат в пространстве модели.
 Синтаксис
C#
Visual Basic
public bool IconAtOrigin;
Public Property IconAtOrigin() As bool
 Возвращает
 Возвращает тип данных bool:
true – значок системы координат всегда отображается в нижнем левом углу видового экрана;
false – значок системы координат привязан к точке начала координат в пространстве
 модели и перемещается вместе с этой точкой при панорамировании и зумировании чертежа.
 Описание
 Свойство предназначено для управления положением значка системы координат в пространстве модели. Значок системы координат может быть привязан к левому нижнему углу окна, либо при панорамировании и зумировании передвигаться вместе с точкой привязки. Через интерфейс значением свойства можно управлять либо системной переменной UCSICON, либо с помощью команды UCSICON.
 Условия
 Чтение и запись.
 Ссылки
 ViewportTableRecord Класс, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!