Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.EllipticalCylinder.Origin
 Послать отзыв
 Свойство Origin представляет положение начала координат данного эллиптического цилиндра.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d Origin;
Копировать Код
Public ReadOnly Property Origin As Point3d
 Возвращает
 Возвращает точку начала координат эллиптического цилиндра. Тип Point3d.
 Описание
 Свойство Origin представляет точку начала координат данного эллиптического цилиндра.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.EllipticalCylinder, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!