Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Solid3d.GetSubentityMaterial
 Послать отзыв
 Метод позволяет получить материал для указанного подобъекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual DatabaseServices.ObjectId GetSubentityMaterial( SubentityId subEntityId );
Копировать Код
Public Overridable Function GetSubentityMaterial( subEntityId As SubentityId ) As DatabaseServices.ObjectId
 Параметры
 Параметры
 Описание
 subEntityId
 Идентификатор подобъекта. Тип SubentityId.
 Возвращает
 Возвращает идентификатор материала указанного подобъекта. Тип DatabaseServices.ObjectId.
 Описание
 Метод позволяет получить материал для указанного подобъекта.
 Ссылки
 Teigha.DatabaseServices.Solid3d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!