Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CellContentsCollection.GetEnumerator
 Послать отзыв
 Метод предоставляет перечислитель для данной коллекции.
 Синтаксис
C#
Visual Basic
Копировать Код
public IEnumerator<CellContent> GetEnumerator();
Копировать Код
Public Function GetEnumerator() As IEnumerator(Of CellContent)
 Возвращает
 Возвращает перечислитель для данной коллекции. Тип IEnumerator.
 Описание
 Метод предоставляет перечислитель для данной коллекции.
 Ссылки
 Teigha.DatabaseServices.CellContentsCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!