Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Dimaunit
 Послать отзыв
 Синтаксис
C#
Visual Basic
public int Dimaunit;
Public Property Dimaunit() As Integer
 Описание
 Возвращает или устанавливает текущее значение DIMAUNIT для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!