Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CircularArc3d.Radius
 Послать отзыв
 Свойство Radius предоставляет доступ к значению радиуса дуги.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Radius;
Копировать Код
Public Property Radius As Double
 Возвращает
 Возвращает радиус дуги. Тип double.
 Описание
 Свойство Radius предоставляет доступ к значению радиуса дуги.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.Geometry.CircularArc3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!