Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Viewport.Width
 Послать отзыв
 Свойство Width представляет ширину данного видового экрана.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Width;
Копировать Код
Public Property Width As Double
 Возвращает
 Возвращает ширину видового экрана. Тип double.
 Описание
 Свойство Width представляет ширину данного видового экрана.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Viewport, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!