Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DataTable.AppendRow
 Послать отзыв
 Метод добавляет строку в конец данной таблицы. Дополнительно метод позволяет выполнить проверку соответствия столбцов в строке и таблице по количеству и типам данных.
 Синтаксис
C#
Visual Basic
Копировать Код
public void AppendRow( ref DataCellCollection row, bool validate );
Копировать Код
Public Sub AppendRow( ByRef row As DataCellCollection, validate As Boolean )
 Параметры
 Параметры
 Описание
 row
 Вставляемая строка. Тип DataCellCollection.
 validate
 Флаг проверок соответствия строки структуре таблицы. Тип bool. В настоящее время не используется.
 Описание
 Метод добавляет строку в конец данной таблицы.
 Входной аргумент validate определяет, следует ли выполнять проверку при добавлении строки. Если validate имеет значение true, этот метод проверяет соответствие количества столбцов в строке и в таблице, а также совпадение типа каждой ячейки строки и типа соответствующего ячейке столбца.
 Ссылки
 Teigha.DatabaseServices.DataTable, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!