Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ItemLocator.ItemLocator
 Послать отзыв
 Конструктор класса ItemLocator. Инициализирует индексы этой структуры указанными значениями.
 Синтаксис
C#
Visual Basic
Копировать Код
public ItemLocator( int itemIndex, int rowIndex, int levelIndex );
Копировать Код
Public Sub New( itemIndex As Integer, rowIndex As Integer, levelIndex As Integer )
 Параметры
 Параметры
 Описание
 itemIndex
 Индекс элемента. Тип int.
 rowIndex
 Индекс строки. Тип int.
 levelIndex
 Индекс уровня. Тип int.
 Описание
 Конструктор класса ItemLocator. Инициализирует индексы этой структуры указанными значениями.
 Ссылки
 Teigha.DatabaseServices.ItemLocator, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!