Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.TableStyle.GridVisibility
 Послать отзыв
 Метод позволяет выяснить, отображается ли указанный тип линий сетки в строках заданного типа.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual bool GridVisibility( GridLineType gridLineType, RowType rowType );
Копировать Код
Public Overridable Function GridVisibility( gridLineType As GridLineType, rowType As RowType ) As Boolean
 Параметры
 Параметры
 Описание
 gridLineType
 Тип линий сетки. Перечисление GridLineType.
 rowType
 Тип строки. Перечисление RowType.
 Возвращает
 Возвращает true, если линии сетки отображаются. В противном случае возвращает false.
 Описание
 Метод позволяет выяснить, отображается ли указанный тип линий сетки в строках заданного типа.
 Ссылки
 Teigha.DatabaseServices.TableStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!