Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBVisualStyle.SetTrait
 Послать отзыв
 Метод позволяет задать указанному свойству данного визуального стиля логическое значение.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetTrait( VisualStyleProperty vsProp, bool bVal, VisualStyleOperation vsOp );
Копировать Код
Public Sub SetTrait( vsProp As VisualStyleProperty, bVal As Boolean, vsOp As VisualStyleOperation )
 Параметры
 Параметры
 Описание
 vsProp
 Свойство визуального стиля, которое необходимо установить. Значение из перечисления VisualStyleProperty.
 bVal
 Логическое значение, которое требуется задать свойству. Тип bool.
 vsOp
 Операция, используемая для установки свойства. Значение из перечисления VisualStyleOperation.
 Описание
 Метод позволяет задать указанному свойству данного визуального стиля логическое значение.
 Ссылки
 Teigha.DatabaseServices.DBVisualStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!