Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 DimStyleTableRecord.Dimtfac
 Послать отзыв
 Свойство отвечает за настройку высоты текста допуска и дробей в размерах.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual double Dimtfac { get; set; }
Копировать Код
Public Overridable Property Dimtfac As Double
 Возвращает
 Возвращает тип данных double.
 Описание
 В свойстве хранится коэффициент масштабирования высоты текста допуска и дробей относительно величины основного размерного текста. В качестве значения свойства допускаются положительные вещественные числа больше 0. Значение по умолчанию 1.
 Свойство также доступно через системную переменную DIMTFAC и пользовательское меню в окне изменения/создания размерного стиля:
  При изменении системной переменной DIMTFAC будет создан новый размерный стиль под названием <переопределение> на основе текущего с новым значением DIMTFAC.
 Также значение свойства Dimtfac можно увидеть в пользовательском интерфейсе в настройках размерного текста, но там оно не доступно для изменений:
 Условия
 Чтение и запись.
 Пример
 Пример изменения высоты текста допуска и дробей в размерах (значения свойства Dimtfac) в размерном стиле Standard:
C#
 Копировать Код
public partial class Commands { [Teigha.Runtime.CommandMethod("DimtfacChange")] public void DimtfacStandardDimStyle() { // Получение ссылки на активный документ HostMgd.ApplicationServices.Document doc = HostMgd.ApplicationServices.Application.DocumentManager.MdiActiveDocument; // Получение ссылки на редактор документа HostMgd.EditorInput.Editor ed = doc.Editor; // Получение ссылки на базу данных документа Teigha.DatabaseServices.Database db = doc.Database; // Начало транзакции с базой данных документа using (Teigha.DatabaseServices.Transaction trans = db.TransactionManager.StartTransaction()) { // Открываем таблицу размерных стилей для чтения Teigha.DatabaseServices.DimStyleTable dimStyleTable = trans.GetObject(db.DimStyleTableId, Teigha.DatabaseServices.OpenMode.ForRead) as Teigha.DatabaseServices.DimStyleTable; // Находим в таблице размерных стилей ObjectId нужного стиля по его названию Teigha.DatabaseServices.ObjectId styleId = dimStyleTable["Standard"]; // Открываем таблицу размерного стиля для изменений Teigha.DatabaseServices.DimStyleTableRecord obj = trans.GetObject(styleId, Teigha.DatabaseServices.OpenMode.ForWrite) as Teigha.DatabaseServices.DimStyleTableRecord; if (obj.Dimtol == false) obj.Dimtol = true; ed.WriteMessage($"nDimtfac before: {obj.Dimtfac}"); // Изменяем масштаб текста допуска obj.Dimtfac = 0.5; ed.WriteMessage($"nDimtfac after: {obj.Dimtfac}"); trans.Commit(); } } }
 Результат работы команды DimtfacChange:
 Было:
 Стало:
 Если изменить формат размера на дробный (Dimlunit = 5), то можно будет увидеть, что дроби тоже будут меньше относительно основной цифры размера:
 Ссылки
 Teigha.DatabaseServices.DimStyleTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!