Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve2d.IsPeriodic
 Послать отзыв
 Метод позволяет проверить, является ли данная кривая периодической.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsPeriodic( out double period );
Копировать Код
Public Function IsPeriodic( ByRef period As Double ) As Boolean
 Параметры
 Параметры
 Описание
 period
 Выходной параметр, содержащий период данной кривой. Тип double. Это значение действительно только в том случае, если метод возвращает значение true.
 Возвращает
 Возвращает true, если кривая является периодической. В противном случае возвращает false.
 Описание
 Метод позволяет проверить, является ли данная кривая периодической.
 Замечания
 Кривая является периодической с периодом period тогда и только тогда, когда она замкнута и для любого вещественного значения t точки Curve2d.EvaluatePoint(t) и Curve2d.EvaluatePoint(t + period) всегда совпадают.
 Ссылки
 Teigha.Geometry.Curve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!