Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SectionSettings.SetHatchAngle
 Послать отзыв
 Метод позволяет задать значение угла наклона штриховки геометрии указанного типа.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetHatchAngle( SectionType nSecType, SectionGeometry nGeometry, double fAngle );
Копировать Код
Public Sub SetHatchAngle( nSecType As SectionType, nGeometry As SectionGeometry, fAngle As Double )
 Параметры
 Параметры
 Описание
 nSecType
 Тип сечения. Перечисление SectionType.
 nGeometry
 Типы элементов геометрии сечения. Перечисление SectionGeometry.
 fAngle
 Угол наклона штриховки в радианах. Тип double.
 Описание
 Метод позволяет задать значение угла наклона штриховки геометрии указанного типа.
 Ссылки
 Teigha.DatabaseServices.SectionSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!