Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.SortEnts
 Послать отзыв
 Синтаксис
C#
Visual Basic
public int SortEnts;
Public Property SortEnts() As Integer
 Описание
 Обеспечивает доступ к текущему значению SORTENTS для базы данных.
 Условия
 На чтение и запись Note Использование системной переменной SORTENTS не рекомендуется, новым приложениям следует использовать системную переменную DRAWORDERCTL.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!