Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ColumnsCollection.Item
 Послать отзыв
 Свойство Item предоставляет доступ к элементу коллекции с указанным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public Column this[int index];
Копировать Код
Default Public ReadOnly Property Item( index As Integer ) As Column
 Параметры
 Параметры
 Описание
 index
 Входной индекс требуемого элемента. Тип int. Значения индекса отсчитываются от нуля.
 Возвращает
 Возвращает элемент коллекции с указанным индексом. Тип Column.
 Описание
 Свойство Item предоставляет доступ к элементу коллекции с указанным индексом.
 Замечания
 Если значение аргумента index окажется недействительным, выбрасывается исключение ArgumentOutOfRangeException.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.ColumnsCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!