Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.PointOnCurve3d.Point
 Послать отзыв
 Свойство предоставляет доступ к 3D-точке, координаты которой совпадают с данной точкой на кривой.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d Point;
Копировать Код
Public Property Point() As Point3d
 Возвращает
 Возвращает 3D-точку, координаты которой совпадают с данной точкой на кривой. Тип Point3d.
 Описание
 Свойство предоставляет доступ к 3D-точке, координаты которой совпадают с данной точкой на кривой.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.PointOnCurve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!