Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbCurve2d.AddFitPointAt
 Послать отзыв
 Метод позволяет вставить определяющую точку с заданным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool AddFitPointAt( int index, Point2d point );
Копировать Код
Public Function AddFitPointAt( index As Integer, point As Point2d ) As Boolean
 Параметры
 Параметры
 Описание
 index
 Индекс определяющей точки. Тип int.
 point
 Положение определяющей точки. Тип Point2d.
 Возвращает
 Возвращает true, если сплайн был создан методом определяющих точек, и вставка новой определяющей точки с заданным индексом завершилась успешно. В противном случае возвращает false.
 Описание
 Метод позволяет вставить определяющую точку с заданным индексом.
 Замечания
 Если сплайн не был создан методом определяющих точек, метод возвращает false. В противном случае новая определяющая точка добавляется по указанному индексу. При этом прежняя определяющая точка с индексом index и все последующие увеличивают свой индекс на единицу. Значение индекса должно быть неотрицательным и должно быть меньше количества определяющих точек.
 Ссылки
 Teigha.Geometry.NurbCurve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!