Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.SetBlockAttributeValue
 Послать отзыв
 Метод позволяет присвоить значение атрибуту блока, если элементом содержимого ячейки по указанному индексу является вхождение блока с атрибутами.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetBlockAttributeValue( int row, int column, int contentIndex, DatabaseServices.ObjectId attDefId, ref String value );
Копировать Код
Public virtual Sub SetBlockAttributeValue( row As Integer, column As Integer, contentIndex As Integer, attDefId As DatabaseServices.ObjectId, ByRef value As String )
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 contentIndex
 Индекс элемента содержимого ячейки, тип int. Индекс должен быть больше или равен нулю и меньше количества элементов содержимого в ячейке.
 value
 Новое значение атрибута блока, тип String.
 col
 Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
 attributeDefinitionId
 Идентификатор определения атрибута AttributeDefinition. Тип DatabaseServices.ObjectId.
 Описание
 Метод позволяет присвоить значение атрибуту блока, если элементом содержимого ячейки по индексу contentIndex является вхождение блока с атрибутами.
 Замечания
 Для получения того же результата предпочтительнее использовать Table.Cells[row,column].Contents[i].GetBlockAttributeValue
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!