Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBVisualStyle.SetTrait
 Послать отзыв
 Метод позволяет задать указанному свойству данного визуального стиля значение с плавающей точкой двойной точности.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetTrait( VisualStyleProperty vsProp, double dVal, VisualStyleOperation vsOp );
Копировать Код
Public Sub SetTrait( vsProp As VisualStyleProperty, dVal As Double, vsOp As VisualStyleOperation )
 Параметры
 Параметры
 Описание
 vsProp
 Свойство визуального стиля, которое необходимо установить. Значение из перечисления VisualStyleProperty.
 vsOp
 Операция, используемая для установки свойства. Значение из перечисления VisualStyleOperation.
 bVal
 Числовое значение, которое требуется задать свойству. Тип double.
 Описание
 Метод позволяет задать указанному свойству данного визуального стиля значение с плавающей точкой двойной точности.
 Ссылки
 Teigha.DatabaseServices.DBVisualStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!