Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.BlockRotation
 Послать отзыв
 Данный метод предназначен для определения угла поворота вхождения блока в указанной ячейке таблицы.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual double BlockRotation( int row, int col );
Копировать Код
Public virtual Function BlockRotation( row As Integer, col As Integer ) As double
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int.
 col
 Индекс столбца, тип int.
 Возвращает
 Возвращает значение угла поворота вхождения блока в радианах, тип double.
 Описание
 Данный метод предназначен для определения угла поворота вхождения блока в ячейке, заданной индексами строки и столбца.
 Замечания
 Для получения того же результата предпочтительнее использовать Table.Cells[row,column].Contents[i].Rotation.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!