Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Surface.CreateFrom
 Послать отзыв
 Метод позволяет создать выдавленную поверхность из 2D-объекта с некоторой толщиной или плоскую поверхность из замкнутой кривой или области.
 Синтаксис
C#
Visual Basic
Копировать Код
public static Surface CreateFrom( ref Entity fromEntity );
Копировать Код
Public Shared Function CreateFrom( ByRef fromEntity As Entity ) As Surface
 Параметры
 Параметры
 Описание
 fromEntity
 Объект чертежа, на основе которого создается поверхность. Тип Entity.
 Возвращает
 Возвращает созданную поверхность. Тип Surface.
 Описание
 Метод позволяет создать выдавленную поверхность из 2D-объекта с некоторой толщиной или плоскую поверхность из замкнутой кривой или области.
 Замечания
 Этот метод реализован только в среде пространственного моделирования.
 Ссылки
 Teigha.DatabaseServices.Surface, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!