Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.HostApplicationServices.BitmapDevice
 Послать отзыв
 Метод предназначен для получения имени растрового устройства, связанного с данным объектом HostApplicationServices. В текущей версии не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual String BitmapDevice( ref RXObject viewObj, ref Database database, BitmapDeviceFlags flag );
Копировать Код
Public Overridable Function BitmapDevice( ByRef viewObj As RXObject, ByRef database As Database, flag As BitmapDeviceFlags ) As String
 Параметры
 Параметры
 Описание
 viewObj
 Объект, совместимый с AbstractViewPE (View, Viewport и т.п.). Тип RXObject.
 database
 Контекст базы данных. Тип Database.
 flag
 Флаги растрового устройства. Тип BitmapDeviceFlags.
 Возвращает
 Возвращает имя растрового устройства, связанного с этим объектом (если оно реализовано). Тип String.
 Описание
 Метод предназначен для получения имени растрового устройства, связанного с данным объектом HostApplicationServices. В текущей версии не реализован.
 Ссылки
 Teigha.DatabaseServices.HostApplicationServices, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!