Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Polyline2d.VertexPosition
 Послать отзыв
 Метод предназначен для получения координат вершины в мировой системе координат (WCS). Метод извлекает координаты X и Y из вершины, а координату Z - из полилинии, после чего применяет преобразование из системы координат полилинии (OCS) в WCS для получения позиции в мировой системе координат.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d VertexPosition( ref Vertex2d vertex );
Копировать Код
Public Function VertexPosition( ByRef vertex As Vertex2d ) As Point3d
 Параметры
 Параметры
 Описание
 vertex
 Вершина Vertex2d, положение которой требуется определить в мировой системе координат.
 Возвращает
 Возвращает экземпляр Point3d.
 Описание
 Метод предназначен для получения координат вершины в мировой системе координат (WCS).
 Метод извлекает координаты X и Y из вершины, а координату Z - из полилинии, после чего применяет преобразование из системы координат полилинии (OCS) в WCS для получения позиции в мировой системе координат.
 Этот метод будет работать и с теми вершинами, для которых данная полилиния владельцем не является. Возвращаемое положение будет таким, как если бы такая вершина принадлежала полилинии.
 Ссылки
 Teigha.DatabaseServices.Polyline2d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!