Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод LinetypeTableRecord.SetTextAt
 Послать отзыв
 Синтаксис
C#
Visual Basic
public void SetTextAt(int index, ref String value);
Public Sub SetTextAt(index As Integer, ByRef value As String)
 Параметры
 Параметры
 Описание
 index
 Индекс (начинающийся с 0) строки, содержащей форму (текстовую строку), для которой производится установка текстовой строки
 value
 указатель на значение задаваемого текстового поля
 Описание
 Этот метод устанавливает для строки LinetypeTableRecord со значением индекса index значение поля текста из параметра value (это значение копируется).
 Значение index должно быть больше или равно 0, но меньше чем значение, возвращаемое LinetypeTableRecord.NumDashes. index представляет собой индекс, начинающийся с нуля (формы и текстовые строки имеют тот же самый индекс, как и штриховка, предшествующая им в определении типа линии) с первым элементом типа линии, соответствующим индексу, равному 0.
 Для получения дополнительной информации об определении типа линии и длины штриховки, смотри раздел "Типы линий" в Инструкции пользователя по nanoCAD.
 Ссылки
 Teigha.DatabaseServices.LinetypeTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!