Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.PointOnSurface.PointOnSurface
 Послать отзыв
 Конструктор по умолчанию класса PointOnSurface.
 Синтаксис
C#
Visual Basic
Копировать Код
public PointOnSurface();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса PointOnSurface. Создает экземпляр класса, представляющий на плоскости XY точку с параметрическим координатами (0,0).
 Ссылки
 Teigha.Geometry.PointOnSurface, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!