Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Database.AddDBObject
 Послать отзыв
 Синтаксис
C#
Visual Basic
public ObjectId AddDBObject(ref DBObject appendIt);
Public Function AddDBObject(ByRef appendIt As DBObject) As ObjectId
 Параметры
 Параметры
 Описание
 appendIt
 Объект, который должен быть добавлен в базу данных
 Описание
 Добавляет объект, на который указывает параметр метода, в базу данных. Возвращается Id нового объекта.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!