Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocArrayPathParameters.MethodType
 Послать отзыв
 Перечисление MethodType представляет методы распределения объектов вдоль траектории.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum MethodType { Divide = 0, Measure = 1 }
Копировать Код
Public Enum MethodType Divide = 0 Measure = 1 End Enum
 Члены
 Члены
 Описание
 Divide
 Равномерное распределение элементов массива по всей длине траектории.
 Measure
 Распределение элементов массива на заданном расстоянии вдоль траектории.
 Ваши комментарии по поводу этого топика: Послать отзыв!