Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DwgFiler.Database
 Послать отзыв
 Свойство возвращает объект Database, представляющий базу данных, с которой связан данный объект Filer.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual DatabaseServices.Database Database;
Копировать Код
Public Overridable ReadOnly Property Database As DatabaseServices.Database
 Возвращает
 Возвращает базу данных. Тип DatabaseServices.Database.
 Описание
 Свойство возвращает объект Database, представляющий базу данных, с которой связан данный объект Filer.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.DwgFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!