Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.ExternalSurface.nativeSurface
 Послать отзыв
 Свойство nativeSurface обеспечивает доступ к нативному представлению данной внешней поверхности в графической системе платформы.
 Синтаксис
C#
Visual Basic
Копировать Код
public Surface nativeSurface;
Копировать Код
Public ReadOnly Property nativeSurface As Surface
 Возвращает
 Возвращает нативное представление данной внешней поверхности в графической системе платформы. Тип Surface.
 Описание
 Свойство nativeSurface обеспечивает доступ к нативному представлению данной внешней поверхности в графической системе платформы.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.ExternalSurface, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!