Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Cell.BlockTableRecordId
 Послать отзыв
 Свойство предоставляет доступ к идентификатору записи в таблице блоков для данного объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectId BlockTableRecordId;
Копировать Код
Public Property BlockTableRecordId As ObjectId
 Возвращает
 Возвращает идентификатор записи в таблице блоков. Тип ObjectId.
 Описание
 Свойство предоставляет доступ к идентификатору записи в таблице блоков для данного объекта.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Cell, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!