Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AttributeDefinition.FieldLength
 Послать отзыв
 Свойство позволяет получить или задать длину поля в данном объекте AttributeDefinition.
 Синтаксис
C#
Visual Basic
Копировать Код
public int FieldLength;
Копировать Код
Public Property FieldLength() As Integer
 Возвращает
 Возвращает длину поля. Тип int.
 Описание
 Свойство позволяет получить или задать длину поля в данном объекте AttributeDefinition.
 Замечания
 Длина поля используется в групповом коде DXF 73.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.AttributeDefinition, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!