Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Interval.Contains
 Послать отзыв
 Метод позволяет проверить, принадлежит ли указанный интервал данному интервалу с учетом используемой точности задания границ.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool Contains( ref Interval otherInterval );
Копировать Код
Public Function Contains( ByRef otherInterval As Interval ) As Boolean
 Параметры
 Параметры
 Описание
 otherInterval
 Проверяемый интервал. Тип Interval.
 Возвращает
 Возвращает true, если интервал otherInterval включается в данный интервал. В противном случае возвращает false.
 Описание
 Метод позволяет проверить, принадлежит ли интервал otherInterval данному интервалу с учетом используемой точности задания границ.
 Ссылки
 Teigha.Geometry.Interval, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!