Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Matrix2d.ToString
 Послать отзыв
 Метод позволяет получить эквивалентное строковое представление данной матрицы.
 Синтаксис
C#
Visual Basic
Копировать Код
public sealed override String ToString();
Копировать Код
Public NotOverridable Overrides Function ToString() As String
 Возвращает
 Возвращает эквивалентное строковое представление данной матрицы. Тип String.
 Описание
 Метод позволяет получить эквивалентное строковое представление данной матрицы.
 Ссылки
 Teigha.Geometry.Matrix2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!