Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve3d.EndPoint
 Послать отзыв
 Свойство EndPoint возвращает конечную точку кривой.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d EndPoint;
Копировать Код
Public Property EndPoint() As Point3d
 Возвращает
 Возвращает конечную точку кривой. Тип Point3d.
 Описание
 Свойство EndPoint возвращает конечную точку кривой.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.Curve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!