Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Group.Remove
 Послать отзыв
 Метод позволяет удалить указанные объекты из данной группы.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Remove( ref ObjectIdCollection ids );
Копировать Код
Public Sub Remove( ByRef ids As ObjectIdCollection )
 Параметры
 Параметры
 Описание
 ids
 Идентификаторы удаляемых объектов. Тип ObjectIdCollection.
 Описание
 Метод позволяет удалить указанные в коллекции ids объекты из данной группы.
 Ссылки
 Teigha.DatabaseServices.Group, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!