Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocManager.Initialize
 Послать отзыв
 Внутренний метод инициализации ассоциативного фреймворка.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Initialize();
Копировать Код
Public Sub Initialize()
 Описание
 Внутренний метод инициализации ассоциативного фреймворка. Он должен быть вызван до первого использования подсистемы ассоциативных связей. Метод можно безопасно выполнять более одного раза.
 Клиентскому коду не обязательно вызывать этот метод.
 Ссылки
 Teigha.DatabaseServices.AssocManager, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!