Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ResultBuffer.AsArray
 Послать отзыв
 Этот метод возвращает массив типизированных значений, представляющих узлы в цепочке буфера результатов.
 Синтаксис
C#
Visual Basic
Копировать Код
public TypedValue[] AsArray();
Копировать Код
Public Function AsArray() As TypedValue[]
 Возвращает
 Возвращает массив тпизированных значений TypedValue[].
 Описание
 Этот метод возвращает массив типизированных значений, представляющих узлы в цепочке буфера результатов.
 Ссылки
 Teigha.DatabaseServices.ResultBuffer, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!