Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.TableContent.GetCellStyle
 Послать отзыв
 Метод предоставляет стиль указанной ячейки.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual String GetCellStyle( int row, int column );
Копировать Код
Public Overridable Function GetCellStyle( row As Integer, column As Integer ) As String
 Параметры
 Параметры
 Описание
 row
 Индекс строки таблицы. Тип int.
 column
 Индекс столбца таблицы. Тип int.
 Возвращает
 Возвращает имя стиля ячейки. Тип String.
 Описание
 Метод предоставляет стиль указанной ячейки.
 Имя стиля ячейки может принимать одно из следующих значений:
_TITLE,
_HEADER,
_DATA.
 Ссылки
 Teigha.DatabaseServices.TableContent, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!