Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Entity.SetDatabaseDefaults(Database)
 Послать отзыв
 Метод устанавливает значения цвета, слоя, типа линии, масштаба линии, видимости, стиля печати и ширины линий геометрического объекта на основе значений по умолчанию указанной базы данных; если база данных не задана, используются значения текущей базы данных nanoCAD.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetDatabaseDefaults(Database sourceDatabase);
Копировать Код
Public Sub SetDatabaseDefaults(sourceDatabase As Database)
 Параметры
 Параметры
 Описание
 sourceDatabase
 База данных, чьи значения по умолчанию используются для установки значений геометрического объекта Тип Database
 Описание
 Этот метод устанавливает для геометрического объекта:
Color (цвет);
Layer (слой);
Linetype (тип линий);
Linetype scale (масштаб типа линий);
Visibility (видимость);
Plot style name (имя стиля печати);
Line weight (ширина линий).
 по значениям по умолчанию базы данных, заданной в параметре sourceDatabase. Если sourceDatabase == null, то используется редактор текущей базы данных nanoCAD.
 Ссылки
 Teigha.DatabaseServices.Entity, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!