Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DwgFiler.WriteUInt64
 Послать отзыв
 Метод записывает в этот Filer указанное 64-разрядное целое число без знака (тип unsigned long long).
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract void WriteUInt64( unsigned long long value );
Копировать Код
Public MustOverride Sub WriteUInt64( value As unsigned long long )
 Параметры
 Параметры
 Описание
 value
 Записываемое в Filer значение. Тип unsigned long long.
 Описание
 Метод записывает в этот Filer указанное 64-разрядное целое число без знака (тип unsigned long long).
 Ссылки
 Teigha.DatabaseServices.DwgFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!