Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод SymbolTable.Has (DatabaseServices::ObjectId)
 Послать отзыв
 Синтаксис
C#
Visual Basic
public bool Has(DatabaseServices::ObjectId id);
Public Function Has(id As DatabaseServices.ObjectId) As bool
 Параметры
 Параметры
 Описание
 id
 Id записи для поиска
 Описание
 Метод возвращает true, если таблица содержит запись с ObjectId, соответствующим Id. В противном случае он возвращает false.
 Ссылки
 Teigha.DatabaseServices.SymbolTable, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!