Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ExtrudedSurface.ExtrudedSurface
 Послать отзыв
 Конструктор класса ExtrudedSurface.
 Синтаксис
C#
Visual Basic
Копировать Код
public ExtrudedSurface();
Копировать Код
Public Sub New()
 Описание
 Конструктор класса ExtrudedSurface.
 Ссылки
 Teigha.DatabaseServices.ExtrudedSurface, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!