Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbCurve2d
 Послать отзыв
 Класс NurbCurve2d представляет неоднородные рациональные B-сплайны (NURBS) в двумерном пространстве.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Geometry::Entity2d Teigha::Geometry::Curve2d Teigha::Geometry::SplineEntity2d Teigha::Geometry::NurbCurve2d
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdGeNurbCurve2d")] public sealed class NurbCurve2d : SplineEntity2d
Копировать Код
<Wrapper("OdGeNurbCurve2d")> Public NotInheritable Class NurbCurve2d Inherits SplineEntity2d
 Описание
 Класс NurbCurve2d представляет неоднородные рациональные B-сплайны (NURBS) в двумерном пространстве.
 Методы
 Конструкторы
 Teigha.Geometry.NurbCurve2d
 Имя
 Описание
 NurbCurve2d
 Это обзор перегрузок NurbCurve2d.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Geometry.Entity2d
 Имя
 Описание
 Entity2d Методы
 Ниже перечислены методы класса Entity2d.
 Teigha.Geometry.Curve2d
 Имя
 Описание
 Curve2d Методы
 Ниже перечислены методы класса Curve2d.
 Curve2d Свойства
 Ниже перечислены свойства класса Curve2d.
 Teigha.Geometry.SplineEntity2d
 Имя
 Описание
 SplineEntity2d Методы
 Ниже перечислены методы класса SplineEntity2d.
 SplineEntity2d Свойства
 Ниже перечислены свойства класса SplineEntity2d.
 Teigha.Geometry.NurbCurve2d
 Имя
 Описание
 NurbCurve2d Методы
 Ниже перечислены методы класса NurbCurve2d.
 NurbCurve2d Свойства
 Ниже перечислены свойства класса NurbCurve2d.
 Ссылки
 NurbCurve2d Конструктор, NurbCurve2d Методы, NurbCurve2d Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!