Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SweepOptionsCheckSweepCurveOut.Vector
 Послать отзыв
 Свойство Vector представляет вектор нормали к вытягиваемому объекту, если он плоский, или направление линии, если объект линейный.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d Vector;
Копировать Код
Public ReadOnly Property Vector As Vector3d
 Возвращает
 Возвращает характерный вектор объекта (нормаль плоскости, либо направляющий вектор прямой). Тип Vector3d.
 Описание
 Свойство Vector представляет вектор нормали к вытягиваемому объекту, если он плоский (Planarity.Planar), или направление прямой, если объект линейный (Planarity.Linear).
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.SweepOptionsCheckSweepCurveOut, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!