Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.SetScale
 Послать отзыв
 Метод позволяет задать масштаб для элемента содержимого ячейки, который указан по индексу.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetScale( int row, int column, int contentIndex, double scale );
Копировать Код
Public virtual Function SetScale( row As Integer, column As Integer, contentIndex As Integer, scale As double )
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 contentIndex
 Индекс элемента содержимого ячейки, тип int. Индекс должен быть больше или равен нулю и меньше количества элементов содержимого в ячейке.
 scale
 Масштаб элемента содержимого ячейки, double.
 col
 Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
 Описание
 Метод позволяет задать масштаб для элемента содержимого ячейки, который указан по индексу.
 Замечания
 Для получения того же результата предпочтительнее использовать Table.Cells[row,column].Contents[i].Scale.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!