Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CompoundObjectId.NullId
 Послать отзыв
 Метод позволяет получить нулевой идентификатор составного объекта CompoundObjectId.
 Синтаксис
C#
Visual Basic
Копировать Код
public CompoundObjectId NullId();
Копировать Код
Public Function NullId() As CompoundObjectId
 Возвращает
 Возвращает нулевой идентификатор объекта CompoundObjectId.
 Описание
 Метод позволяет получить нулевой идентификатор составного объекта CompoundObjectId.
 Ссылки
 Teigha.DatabaseServices.CompoundObjectId, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!