Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SymbolUtilityServices.IsRegAppAcadName
 Послать отзыв
 Метод позволяет проверить, соответствует ли входная строка имени зарегистрированного приложения "ACAD".
 Синтаксис
C#
Visual Basic
Копировать Код
public static bool IsRegAppAcadName( ref String name );
Копировать Код
Public Shared Function IsRegAppAcadName( ByRef name As String ) As Boolean
 Параметры
 Параметры
 Описание
 name
 Проверяемое имя. Тип String.
 Возвращает
 Возвращает true, если строка name соответствует имени имени RegApp-объекта "ACAD". В противном случае возвращает false.
 Описание
 Метод позволяет проверить, соответствует ли входная строка имени зарегистрированного приложения "ACAD".
 Ссылки
 Teigha.DatabaseServices.SymbolUtilityServices, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!