Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBDictionary.GetEnumerator
 Послать отзыв
 Метод создает новый перечислитель.
 Синтаксис
C#
Visual Basic
Копировать Код
public DbDictionaryEnumerator GetEnumerator();
Копировать Код
Public Function GetEnumerator() As DbDictionaryEnumerator
 Возвращает
 Метод возвращает новый перечислитель типа DbDictionaryEnumerator.
 Описание
 Метод создает новый перечислитель типа DbDictionaryEnumerator.
 Ссылки
 Teigha.DatabaseServices.DBDictionary, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!