Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Point3d.+
 Послать отзыв
 Оператор сложения класса Point3d. Реализует сложение координат заданной точки с соответствующими компонентами заданного 3D-вектора.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d operator +( Point3d a, Vector3d vector );
Копировать Код
Public Operator +( a As Point3d, vector As Vector3d )
 Параметры
 Параметры
 Описание
 a
 Левый операнд. Тип Point3d.
 vector
 Правый операнд. Тип Vector3d.
 Возвращает
 Возвращает точку Point3d в новых координатах.
 Описание
 Оператор сложения класса Point3d. Реализует сложение координат точки a с соответствующими компонентами 3D-вектора vector, что эквивалентно перемещению точки a на заданный вектор.
 Ссылки
 Teigha.Geometry.Point3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!