Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObject.DwgOut(DwgFiler)
 Послать отзыв
 Метод записывает данные этого объекта в указанный файл формата .dwg.
 Синтаксис
C#
Visual Basic
Копировать Код
public void DwgOut(DwgFiler filer);
Копировать Код
Public Sub DwgOut(filer As DwgFiler)
 Параметры
 Параметры
 Описание
 filer
 Набор данных, которые нужно записать в dwg-файл. Тип DwgFiler
 Описание
 Этот метод выполняет несколько внутренних учетных действий, и затем записывает в dwg-файл любые xdata, присоединенные к объекту.
 Ссылки
 Teigha.DatabaseServices.DBObject, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!