Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocDependency.IsReadDependency
 Послать отзыв
 Свойство позволяет указать или проверить, что данная зависимость использует связанный объект, не меняя его состояния.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsReadDependency;
Копировать Код
Public Property IsReadDependency() As Boolean
 Возвращает
 Возвращает true, если действие-владелец зависимости лишь использует значение связанного объекта DBObject. В противном случае возвращает false.
 Описание
 Свойство позволяет указать или проверить, что данная зависимость использует связанный объект, не меняя его состояния. Значение true указывает, что действие AssocAction как владелец зависимости лишь использует значение зависимого объекта DBObject.
 Значение этого флага по умолчанию — false.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.AssocDependency, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!