Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FullSubentityPath.Null
 Послать отзыв
 Свойство возвращает нулевой путь к подобъекту.
 Синтаксис
C#
Visual Basic
Копировать Код
public static FullSubentityPath Null;
Копировать Код
Public Shared ReadOnly Property Null As FullSubentityPath
 Возвращает
 Возвращает нулевой путь к подобъекту. Тип FullSubentityPath.
 Описание
 Свойство возвращает нулевой путь к подобъекту.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.FullSubentityPath, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!