Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Database.Insert (String^, String^, Database^, bool)
 Послать отзыв
 Синтаксис
C#
Visual Basic
public ObjectId Insert(ref String sourceBlockName, ref String destinationBlockName, ref Database dataBase, bool preserveSourceDatabase);
Public Function Insert(ByRef sourceBlockName As String, ByRef destinationBlockName As String, ByRef dataBase As Database, preserveSourceDatabase As bool) As ObjectId
 Параметры
 Параметры
 Описание
 sourceBlockName
 Имя блока (записи в таблице блоков)
 destinationBlockName
 Имя, используемое для новой записи таблицы блоков, созданной данным методом
 dataBase
 База данных источника
 preserveSourceDatabase
 Признак, определяющий, будет ли база данных источника сохранена независимой
 Описание
 Метод создает новую запись таблицы блоков в базе данных, в которой он исполняется. Этому новому блоку дается имя, указанное в destinationBlockName. Затем каждый геометрический объект в таблице записей блоков с именем sourceBlockName, который находится в базе данных dataBase, копируется в новую запись таблицы блоков.
 Аргумент preserveSourceDatabase определяет, должна ли база данных источника быть сохранена независимой от базы данных назначения или нет. Значение этого параметра по умолчанию — true. В этом случае объекты из базы данных источника копируются в базу данных назначения и база данных источника не меняется. Если параметр preserveSourceDatabase равен false, то объекты из базы данных источника не переписываются в базу данных назначения. В этом случае метод исполняется быстрее, но это делает базу данных источника зависимой от базы данных назначения. При таком вызове необходимо быть уверенным, что база данных источника будет удалена сразу же после или, как минимум, перед удалением базы данных назначения.
 Возвращает Id объекта новой записи таблицы блоков, созданной этой функцией.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!