Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DrawOrderTable.SwapOrder
 Послать отзыв
 Метод позволяет поменять на обратный порядок отрисовки двух указанных объектов в данной таблице DrawOrderTable.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SwapOrder( DatabaseServices.ObjectId id1, DatabaseServices.ObjectId id2 );
Копировать Код
Public Sub SwapOrder( id1 As DatabaseServices.ObjectId, id2 As DatabaseServices.ObjectId )
 Параметры
 Параметры
 Описание
 id1
 Идентификатор первого объекта. Тип DatabaseServices.ObjectId.
 id2
 Идентификатор второго объекта. Тип DatabaseServices.ObjectId.
 Описание
 Метод позволяет поменять на обратный порядок отрисовки двух указанных объектов в данной таблице DrawOrderTable.
 Ссылки
 Teigha.DatabaseServices.DrawOrderTable, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!