Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.LinearEntity3d.GetLine
 Послать отзыв
 Метод предоставляет бесконечную линию, коллинеарную данному линейному объекту.
 Синтаксис
C#
Visual Basic
Копировать Код
public Line3d GetLine();
Копировать Код
Public Function GetLine() As Line3d
 Возвращает
 Возвращает бесконечную линию, коллинеарную данному линейному объекту. Тип Line3d.
 Описание
 Метод предоставляет бесконечную линию, коллинеарную данному линейному объекту.
 Замечания
 В случае таких объектов как LineSeg3d или Ray3d этот метод позволяет получить бесконечную линию из ограниченного линейного объекта.
 Ссылки
 Teigha.Geometry.LinearEntity3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!