Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocArray.IsAssociativeArray
 Послать отзыв
 Метод позволяет проверить, является ли указанный объект ассоциативным массивом.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsAssociativeArray( ObjectId entity );
Копировать Код
Public Function IsAssociativeArray( entity As ObjectId ) As Boolean
 Параметры
 Параметры
 Описание
 entity
 Идентификатор проверяемого объекта. Тип ObjectId.
 Возвращает
 Возвращает true, если проверяемый объект является ассоциативным массивом. В противном случае возвращает false.
 Описание
 Метод позволяет проверить, является ли ассоциативным массивом входной объект с указанным ObjectId.
 Ссылки
 Teigha.DatabaseServices.AssocArray, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!