Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CircularArc3d.CircularArc3d
 Послать отзыв
 Конструктор класса CircularArc3d. Создает круглую дугу по трем точкам.
 Синтаксис
C#
Visual Basic
Копировать Код
public CircularArc3d( Point3d startPoint, Point3d point, Point3d endPoint );
Копировать Код
Public Sub New( startPoint As Point3d, point As Point3d, endPoint As Point3d )
 Параметры
 Параметры
 Описание
 startPoint
 Начальная точка дуги. Тип Point3d.
 point
 Точка на дуге. Тип Point3d.
 endPoint
 Конечная точка дуги. Тип Point3d.
 Описание
 Конструктор класса CircularArc3d. Создает круглую дугу по трем точкам. Никакие две точки из этих трех не должны совпадать, и все три не должны лежать на одной прямой. Данный конструктор всегда строит ограниченную дугу и не может использоваться для построения полной окружности.
 Ссылки
 Teigha.Geometry.CircularArc3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!