Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Entity.BoundingBoxIntersectWith(Entity
 Послать отзыв
 Метод предназначен для проецирования ребер ограничивающего параллелепипеда данного геометрического объекта и другого геометрического объекта на указанную плоскость проекции, поиска точек пересечений и последующего проецирования этих точек обратно на ребра ограничивающего параллелепипеда данного объекта. Все найденные точки добавляются в выходной массив и представляют собой точки ребер ограничивающего параллелепипеда данного геометрического объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
[Obsolete("Use the overload taking IntPtr instead.")] public void BoundingBoxIntersectWith(ref Entity entityPointer, Intersect intersectType, ref Plane projectionPlane, ref Point3dCollection points, int thisGraphicSystemMarker, int otherGraphicSystemMarker);
Копировать Код
<Obsolete("Use the overload taking IntPtr instead.")> Public Sub BoundingBoxIntersectWith(ByRef entityPointer As Entity, intersectType As Intersect, ByRef projectionPlane As Plane, ByRef points As Point3dCollection, thisGraphicSystemMarker As Integer, otherGraphicSystemMarker As Integer)
 Параметры
 Параметры
 Описание
 entityPointer
 Геометрический объект, с которым "данный" геометрический объект пересекается. Тип Entity
 intersectType
 Тип пересечения. Тип Intersect
 projectionPlane
 Плоскость проекции, на которой ищутся пересечения. Тип Plane
 points
 Выходной массив точек пересечения (в WCS координатах). Тип Point3dCollection
 thisGraphicSystemMarker
 GS маркер геометрических подобъектов "данного" объекта, который включен в операцию пересечения. Может быть равен 0, если не используется. Тип int
 otherGraphicSystemMarker
 GS маркер геометрических подобъектов объекта entityPointer, который включен в операцию пересечения. Может быть равен 0, если не используется. Тип int
 Описание
 Этот метод проецирует ребра ограничивающего параллелепипеда данного геометрического объекта и геометрического объекта на плоскость projectionPlane, находит точки пересечений и затем проецирует точки пересечения назад на соответствующие ребра ограничивающего параллелепипеда данного объекта. Таким образом, все точки, добавляемые к массиву points, являются точками ребер ограничивающего параллелепипеда геометрического объекта.
 Проецирование осуществляется параллельно вектору нормали к плоскости projectionPlane.
 Параметр intersectType используется для определения того, как поступать с пересечением продолжения ребер ограничивающего параллелепипеда данного объекта и геометрического объекта, заданного entityPointer, при расчете пересечений. Возможные значения intersectType:
 Intersect.OnBothOperands
 Не продолжать ни ребра ограничивающего параллелепипеда геометрического объекта, ни геометрического объекта, заданного entityPointer. В этом случае результат вычисляется только по точкам реального пересечения линий границ объекта с геометрическим объектом, заданным entityPointer
 Intersect.ExtendThis
 Продлевать ребра линий ограничивающего параллелепипеда (если необходимо) при расчете пересечений, но не продлевать геометрический объект, заданный entityPointer
 Intersect.ExtendArg
 Продлевать геометрический объект, заданный entityPointer (если необходимо) при расчете пересечений, но не продлевать ребра ограничивающего параллелепипеда данного геометрического объекта
 Intersect.ExtendBoth
 Продлевать и ребра ограничивающего параллелепипеда данного геометрического объекта, и геометрический объект, заданный entityPointer (если необходимо) при расчете пересечений
 Ссылки
 Teigha.DatabaseServices.Entity, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!