Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 DimStyleTableRecord.Dimfrac
 Послать отзыв
 Свойство отвечает за формат дроби, когда для линейных размеров выбран формат «Дюймовые дробные» или «Дробные».
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual int Dimfrac { get; set; }
Копировать Код
Public Overridable Property Dimfrac As Integer
 Возвращает
 Возвращает тип данных int.
 Возвращаемые значения
 Возвращаемые значения
 Описание
 0
 дробь отображается с горизонтальным разделителем, когда для линейных размеров выбран формат «Дюймовые дробные» или «Дробные»
 1
 дробь отображается с косой чертой, когда для линейных размеров выбран формат «Дюймовые дробные» или «Дробные»
 2
 дробь отображается в одну строку, когда для линейных размеров выбран формат «Дюймовые дробные» или «Дробные»
 Описание
 В свойстве хранится формат отображения дроби в виде числа int. Возможно несколько значений:
0 – горизонтальный разделитель (по умолчанию);
1 – косая черта;
2 – в одну строку.
 Свойство также доступно через системную переменную DIMFRAC и пользовательское меню в окне изменения/создания размерного стиля:
  При изменении системной переменной DIMFRAC будет создан новый размерный стиль под названием <переопределение> на основе текущего с новым значением DIMFRAC.
 Условия
 Чтение и запись.
 Пример
 Пример изменения формата отображения дроби (значения свойства Dimfrac) в размерном стиле Standard:
C#
 Копировать Код
public partial class Commands { [Teigha.Runtime.CommandMethod("DimfracChange")] public void DimfracStandardDimStyle() { // Получение ссылки на активный документ HostMgd.ApplicationServices.Document doc = HostMgd.ApplicationServices.Application.DocumentManager.MdiActiveDocument; // Получение ссылки на редактор документа HostMgd.EditorInput.Editor ed = doc.Editor; // Получение ссылки на базу данных документа Teigha.DatabaseServices.Database db = doc.Database; // Начало транзакции с базой данных документа using (Teigha.DatabaseServices.Transaction trans = db.TransactionManager.StartTransaction()) { // Открываем таблицу размерных стилей для чтения Teigha.DatabaseServices.DimStyleTable dimStyleTable = trans.GetObject(db.DimStyleTableId, Teigha.DatabaseServices.OpenMode.ForRead) as Teigha.DatabaseServices.DimStyleTable; // Находим в таблице размерных стилей ObjectId нужного стиля по его названию Teigha.DatabaseServices.ObjectId styleId = dimStyleTable["Standard"]; // Открываем таблицу размерного стиля для изменений Teigha.DatabaseServices.DimStyleTableRecord obj = trans.GetObject(styleId, Teigha.DatabaseServices.OpenMode.ForWrite) as Teigha.DatabaseServices.DimStyleTableRecord; ed.WriteMessage($"nDimfrac before: {obj.Dimfrac}"); // Изменяем формат дробной части в размерных числах obj.Dimfrac = 2; ed.WriteMessage($"nDimfrac after: {obj.Dimfrac}"); trans.Commit(); } } }
 Результат работы команды DimfracChange:
 Было:
 Стало:
 Ссылки
 Teigha.DatabaseServices.DimStyleTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!