Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Saveproxygraphics
 Послать отзыв
 Синтаксис
C#
Visual Basic
public int Saveproxygraphics;
Public Property Saveproxygraphics() As Integer
 Описание
 Возвращает или устанавливает текущее значение PROXYGRAPHICS для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!