Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Spline.get
 Послать отзыв
 This is get, a member of class Spline.
 Синтаксис
C#
Visual Basic
public bool get();
Public Function get() As bool
 Ссылки
 Teigha.DatabaseServices.Spline, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!