Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObject.ApplyPartialUndo(DwgFiler,RXClass)
 Послать отзыв
 Метод уведомления, который вызывается каждый раз, когда этот объект использует механизм частичной отмены.
 Синтаксис
C#
Visual Basic
Копировать Код
public void ApplyPartialUndo(DwgFiler undoFiler, RXClass classObj);
Копировать Код
Public Sub ApplyPartialUndo(undoFiler As DwgFiler, classObj As RXClass)
 Параметры
 Параметры
 Описание
 undoFiler
 Программа работы с файлами, содержащая информацию о частичном Undo, которая должна быть повторно инсталлирована
 classObj
 RXClass объект для класса, который должен управлять этой информацией Undo
 Описание
 Этот метод вызывается nanoCAD всегда, когда выполняется операция Undo с объектом DBObject, и объект последовательно установил признак autoUndo во всех вызовах assertWriteEnabled() в false, что указывает на использование механизма частичного удаления.
 Ссылки
 Teigha.DatabaseServices.DBObject, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!