Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SweepOptionsBuilder.SweepOptionsBuilder
 Послать отзыв
 Конструктор класса SweepOptionsBuilder. Создает экземпляр класса с указанными параметрами.
 Синтаксис
C#
Visual Basic
Копировать Код
public SweepOptionsBuilder( ref SweepOptions value );
Копировать Код
Public Sub New( ByRef value As SweepOptions )
 Параметры
 Параметры
 Описание
 value
 Параметры операции вытягивания по траектории. Тип SweepOptions.
 Описание
 Конструктор класса SweepOptionsBuilder. Создает экземпляр класса с указанными параметрами.
 Ссылки
 Teigha.DatabaseServices.SweepOptionsBuilder, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!