Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Cone.IsOuterNormal
 Послать отзыв
 Свойство IsOuterNormal представляет флаг, определяющий, направлена ли нормаль конуса в сторону замкнутого конуса.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsOuterNormal;
Копировать Код
Public ReadOnly Property IsOuterNormal As Boolean
 Возвращает
 Возвращает true, если нормаль конуса ориентирована в сторону замкнутого конуса. В противном случае возвращает false.
 Описание
 Свойство IsOuterNormal представляет флаг, определяющий, направлена ли нормаль конуса в сторону замкнутого конуса.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.Cone, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!