Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector3d.AngleOnPlane
 Послать отзыв
 Метод определяет угол между ортогональной проекцией этого вектора на заданный плоский объект и нулевым базисным вектором v0 этого плоского объекта, который возвращает метод PlanarEntity.GetCoordinateSystem(p, v0, v1).
 Синтаксис
C#
Visual Basic
Копировать Код
public double AngleOnPlane( ref PlanarEntity plane );
Копировать Код
Public Function AngleOnPlane( ByRef plane As PlanarEntity ) As Double
 Параметры
 Параметры
 Описание
 plane
 Входной геометрический плоский объект. Тип PlanarEntity.
 Возвращает
 Возвращает угол между векторами в плоскости plane. Тип double.
 Описание
 Метод определяет угол между ортогональной проекцией этого вектора на заданный плоский объект plane и нулевым базисным вектором v0 объекта plane, который возвращает метод PlanarEntity.GetCoordinateSystem(p, v0, v1).
 Ссылки
 Teigha.Geometry.Vector3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!