Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DiametricDimension.DiametricDimension
 Послать отзыв
 Конструктор по умолчанию.
 Синтаксис
C#
Visual Basic
Копировать Код
public DiametricDimension();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию. Создает объект диаметрального размера с концами хорды в точке (0, 0, 0) и нулевой длиной выноски.
 Ссылки
 Teigha.DatabaseServices.DiametricDimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!