Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AbstractViewTableRecord.VisualStyleId
 Послать отзыв
 Свойство VisualStyleId предоставляет доступ к идентификатору объекта визуального стиля, используемого в видовом экране.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.ObjectId VisualStyleId;
Копировать Код
Public Property VisualStyleId As DatabaseServices.ObjectId
 Возвращает
 Возвращает идентификатор объекта визуального стиля. Тип DatabaseServices.ObjectId.
 Описание
 Свойство VisualStyleId предоставляет доступ к идентификатору объекта визуального стиля, используемого в видовом экране.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.AbstractViewTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!