Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.ExternalCurve2d.SetToOwnCurve
 Послать отзыв
 Метод делает этот объект владельцем данных своего определения.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetToOwnCurve();
Копировать Код
Public Sub SetToOwnCurve()
 Описание
 Метод делает этот объект владельцем данных своего определения. Если текущий экземпляр уже является владельцем этих данных, метод не делает ничего. В противном случае метод создает копию данных определения кривой перед тем, как сделать данный объект владельцем этой геометрии.
 Замечания
 Данные, которыми владеет внешняя кривая, удаляются при уничтожении внешней кривой.
 Ссылки
 Teigha.Geometry.ExternalCurve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!