Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Extents3d.TransformBy
 Послать отзыв
 Метод применяет к данному объекту Extents3d указанное геометрическое преобразование.
 Синтаксис
C#
Visual Basic
Копировать Код
public void TransformBy( Matrix3d mat );
Копировать Код
Public Sub TransformBy( mat As Matrix3d )
 Параметры
 Параметры
 Описание
 mat
 Матрица геометрического преобразования. Тип Matrix3d.
 Описание
 Метод применяет к данному объекту Extents3d геометрическое преобразование, заданное матрицей Matrix3d.
 Ссылки
 Teigha.DatabaseServices.Extents3d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!