Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.TableStyle.SetTextStyle
 Послать отзыв
 Метод позволяет задать текстовый стиль для указанного стиля ячейки.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetTextStyle( DatabaseServices.ObjectId id, ref String styleName );
Копировать Код
Public Overridable Sub SetTextStyle( id As DatabaseServices.ObjectId, ByRef styleName As String )
 Параметры
 Параметры
 Описание
 id
 Идентификатор объекта текстового стиля. Тип DatabaseServices.ObjectId.
 styleName
 Имя стиля ячейки таблицы. Тип String.
 Описание
 Метод позволяет задать текстовый стиль для указанного стиля ячейки.
 Ссылки
 Teigha.DatabaseServices.TableStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!