Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Filters.SpatialFilter.GetQueryBounds
 Послать отзыв
 Метод предназначен для получения ограничивающего бокса данного фильтра SpatialFilter.
 Синтаксис
C#
Visual Basic
Копировать Код
public Extents3d GetQueryBounds();
Копировать Код
Public Function GetQueryBounds() As Extents3d
 Возвращает
 Возвращает ограничивающий бокс данного фильтра. Тип Extents3d.
 Описание
 Метод предназначен для получения ограничивающего бокса данного фильтра SpatialFilter. Возвращаемый объект Extents3d характеризует проверяемую фильтром область пространства.
 Ссылки
 Teigha.DatabaseServices.Filters.SpatialFilter, Teigha.DatabaseServices.Filters
 Ваши комментарии по поводу этого топика: Послать отзыв!