Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MeshFaceterData
 Послать отзыв
 Структура MeshFaceterData предназначена для хранения данных, которые использует метод Teigha.DatabaseServices.SubDMesh.GetObjectMesh().
 Иерархия классов
Teigha::DatabaseServices::MeshFaceterData
 Синтаксис
C#
Visual Basic
Копировать Код
public struct MeshFaceterData
Копировать Код
Public Structure MeshFaceterData
 Описание
 Структура MeshFaceterData предназначена для хранения данных, которые использует метод Teigha.DatabaseServices.SubDMesh.GetObjectMesh().
 Методы
 Конструкторы
 Имя
 Описание
 MeshFaceterData
 Конструктор структуры MeshFaceterData.
 Топики
 Имя
 Описание
 MeshFaceterData Свойства
 Ниже перечислены свойства класса MeshFaceterData.
 Ссылки
 MeshFaceterData Свойства, Методы, Топики, MeshFaceterData Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!