Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GeoLocationData.EraseFromDb
 Послать отзыв
 Метод предназначен для удаления данного объекта из базы данных.
 Синтаксис
C#
Visual Basic
Копировать Код
public void EraseFromDb();
Копировать Код
Public Sub EraseFromDb()
 Описание
 Метод предназначен для удаления данного объекта из базы данных.
 Ссылки
 Teigha.DatabaseServices.GeoLocationData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!