Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DatabaseSummaryInfo.Keywords
 Послать отзыв
 Свойство предоставляет доступ к ключевым словам данного объекта DatabaseSummaryInfo.
 Синтаксис
C#
Visual Basic
Копировать Код
public String Keywords;
Копировать Код
Public Property Keywords() As String
 Возвращает
 Возвращает значение поля Keywords. Тип String.
 Описание
 Свойство предоставляет доступ к ключевым словам данного объекта DatabaseSummaryInfo.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.DatabaseSummaryInfo, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!