Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CurveCurveIntersector2d.OrderWithRegardsTo2
 Послать отзыв
 Метод сортирует точки пересечения по возрастанию значений параметра второй кривой.
 Синтаксис
C#
Visual Basic
Копировать Код
public void OrderWithRegardsTo2();
Копировать Код
Public Sub OrderWithRegardsTo2()
 Описание
 Метод сортирует точки пересечения по возрастанию значений параметра второй кривой.
 Ссылки
 Teigha.Geometry.CurveCurveIntersector2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!