Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.TableContent.SetColumnWidth
 Послать отзыв
 Метод позволяет задать ширину столбца с указанным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetColumnWidth( int column, double width );
Копировать Код
Public Overridable Sub SetColumnWidth( column As Integer, width As Double )
 Параметры
 Параметры
 Описание
 column
 Индекс столбца. Тип int.
 width
 Новая ширина указанного столбца. Тип double.
 Описание
 Метод позволяет задать ширину столбца с указанным индексом.
 Ссылки
 Teigha.DatabaseServices.TableContent, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!