Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.NurbSurface.PeriodInU
 Послать отзыв
 Свойство представляет значение периода в направлении u, если данная поверхность является периодической в направлении u.
 Синтаксис
C#
Visual Basic
Копировать Код
public double PeriodInU;
Копировать Код
Public ReadOnly Property PeriodInU As Double
 Возвращает
 Возвращает значение периода в указанном направлении. Тип double.
 Описание
 Свойство представляет значение периода в направлении u для данной поверхности. Это свойство действительно только тогда, когда поверхность периодична в направлении u.
 Условия
 Только чтение.
 This property is valid only when the surface is periodic in the v-direction.
 Ссылки
 Teigha.DatabaseServices.NurbSurface, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!