Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GridLineStyle
 Послать отзыв
 Перечисление GridLineStyle определяет стили линий сетки таблицы.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum GridLineStyle { Single = 1, Double = 2 }
Копировать Код
Public Enum GridLineStyle Single = 1 Double = 2 End Enum
 Члены
 Члены
 Описание
 Single
 Значение: 1. Сетка таблицы отображается одинарными линиями.
 Double
 Значение: 2. Сетка таблицы отображается двойными линиями.
 Описание
 Перечисление GridLineStyle определяет стили линий сетки таблицы.
 Ваши комментарии по поводу этого топика: Послать отзыв!