Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Filters.SpatialFilterVolume
 Послать отзыв
 Класс представляет данные, необходимые для описания объема пространственного фильтра.
 Иерархия классов
Teigha::DatabaseServices::Filters::SpatialFilterVolume
 Синтаксис
C#
Visual Basic
Копировать Код
[StructLayout(LayoutKind.Sequential)] public class SpatialFilterVolume;
Копировать Код
<StructLayout(LayoutKind.Sequential)> Public Class SpatialFilterVolume
 Описание
 Класс представляет данные, необходимые для описания объема пространственного фильтра.
 Методы
 Конструкторы
 Имя
 Описание
 SpatialFilterVolume
 Конструктор класса SpatialFilterVolume.
 Топики
 Имя
 Описание
 SpatialFilterVolume Свойства
 Ниже перечислены свойства класса SpatialFilterVolume.
 Ссылки
 SpatialFilterVolume Свойства, Методы, Топики, SpatialFilterVolume Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!