Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Leader.AppendVertex
 Послать отзыв
 Синтаксис
C#
Visual Basic
public bool AppendVertex(Point3d pointToAdd);
Public Function AppendVertex(pointToAdd As Point3d) As bool
 Параметры
 Параметры
 Описание
 pointToAdd
 Точка (в WCS координатах) для добавления вершины в список
 Описание
 Добавляет вершину в конец списка вершин для выноски. Если вершина не находится в плоскости выноски, то она проектируется параллельно вектору нормали на эту плоскость и эта проекция добавляется в конец списка вершин. Если новая вершина слишком близко к предыдущей (не дальше чем 1.е-10 по осям X, Y и Z), новая точка не появляется.
 Метод возвращает true, если вершина успешно добавлена и false в противном случае. Note Эта функция сбрасывает установленную ассоциативность.
 Ссылки
 Teigha.DatabaseServices.Leader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!