Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.SetGridLinetype
 Послать отзыв
 Метод позволяет задать тип линий сетки для ячеек, строк и столбцов.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetGridLinetype( int row, int column, GridLineType gridLineType, DatabaseServices.ObjectId linetype );
Копировать Код
Public virtual Sub SetGridLinetype( row As Integer, column As Integer, gridLineType As GridLineType, linetype As DatabaseServices.ObjectId )
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс может равняться -1.
 linetype
 Идентификатор типа линии. Тип DatabaseServices.ObjectId.
 col
 Индекс столбца, тип int. Индекс может равняться -1.
 gridlineType
 Тип линии сетки из перечисления GridLineType. Допускаются комбинации типов с использованием оператора OR.
 Описание
 Метод позволяет задать тип линий сетки для ячеек, строк и столбцов.
 Чтобы задать одинаковое значение сразу для нескольких типов линий сетки, эти типы можно объединять с помощью оператора OR.
 Чтобы задать ячейку, следует указать допустимые индексы строки и столбца. Чтобы задать строку, следует указать допустимый индекс строки и -1 в качестве индекса столбца. Чтобы задать столбец, следует указать допустимый индекс столбца и -1 в качестве индекса строки.
 Замечания
 Для получения того же результата предпочтительнее использовать Table.Cells[row,column].{Top,Bottom,Left,Right}Edge.Linetype.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!