Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve3d.GetParameterOf
 Послать отзыв
 Метод позволяет получить значение параметра для заданной точки на кривой.
 Синтаксис
C#
Visual Basic
Копировать Код
public double GetParameterOf( Point3d point );
Копировать Код
Public Function GetParameterOf( point As Point3d ) As double
 Параметры
 Параметры
 Описание
 point
 Точка на кривой. Тип Point3d.
 Возвращает
 Возвращает значение параметра для точки на кривой. Тип double.
 Описание
 Метод позволяет получить значение параметра для заданной точки на кривой. Реализация использует вызов метода Curve3d.GetParameterOf(Point3d point, Tolerance tolerance) с точностью, равной Tolerance.Global.
 Ссылки
 Teigha.Geometry.Curve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!