Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MeshDataCollection.VertexArray
 Послать отзыв
 Свойство представляет коллекцию 3D-точек в вершинах сети.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3dCollection VertexArray;
Копировать Код
Public Property VertexArray As Point3dCollection
 Возвращает
 Возвращает коллекцию 3D-точек в вершинах сети. Тип Point3dCollection.
 Описание
 Свойство представляет коллекцию 3D-точек в вершинах сети.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MeshDataCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!