Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство OrdinateDimension.UsingYAxis
 Послать отзыв
 This is UsingYAxis, a member of class OrdinateDimension.
 Синтаксис
C#
Visual Basic
public bool UsingYAxis;
Public Property UsingYAxis() As bool
 Ссылки
 OrdinateDimension Класс, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!