Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SectionManager.NumSections
 Послать отзыв
 Свойство NumSections представляет количество секущих плоскостей в базе данных.
 Синтаксис
C#
Visual Basic
Копировать Код
public int NumSections;
Копировать Код
Public ReadOnly Property NumSections As Integer
 Возвращает
 Возвращает количество секущих плоскостей. Тип int.
 Описание
 Свойство NumSections представляет количество секущих плоскостей в базе данных.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.SectionManager, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!