Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeaderStyle.GetTextAttachmentType
 Послать отзыв
 Метод возвращает текущий вариант расположения точки прикрепления выносной линии к многострочному тексту мультивыноски с учетом указанного расположения полки.
 Синтаксис
C#
Visual Basic
Копировать Код
public TextAttachmentType GetTextAttachmentType( LeaderDirectionType leaderDirection );
Копировать Код
Public Function GetTextAttachmentType( leaderDirection As LeaderDirectionType ) As TextAttachmentType
 Параметры
 Параметры
 Описание
 leaderDirection
 Вариант ориентации полки из перечисления LeaderDirectionType.
 Возвращает
 Возвращает тип прикрепления выносной линии к многострочному тексту. Перечисление TextAttachmentType. Тип TextAttachmentType.
 Описание
 Метод возвращает текущий вариант расположения точки прикрепления выносной линии к многострочному тексту мультивыноски с учетом указанного расположения полки.
 Ссылки
 Teigha.DatabaseServices.MLeaderStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!