Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Transaction.GetAllObjects
 Послать отзыв
 Метод формирует коллекцию всех объектов, открытых в этой транзакции на данный момент.
 Синтаксис
C#
Visual Basic
Копировать Код
public DBObjectCollection GetAllObjects();
Копировать Код
Public Function GetAllObjects() As DBObjectCollection
 Возвращает
 Возвращает коллекцию объектов, тип DBObjectCollection.
 Описание
 Метод формирует коллекцию всех объектов, открытых в этой транзакции на данный момент.
 Ссылки
 Teigha.DatabaseServices.Transaction, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!