Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ShadowSamplingMultiplier
 Послать отзыв
 Перечисление ShadowSamplingMultiplier определяет допустимые значения множителя выборки теней для протяженных источников света.
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("AcDbMentalRayRenderSettings.ShadowSamplingMultiplier")] public enum ShadowSamplingMultiplier { SamplingMultiplierZero = 0, SamplingMultiplierOneEighth = 1, SamplingMultiplierOneFourth = 2, SamplingMultiplierOneHalf = 3, SamplingMultiplierOne = 4, SamplingMultiplierTwo = 5 }
Копировать Код
<Wrapper("AcDbMentalRayRenderSettings.ShadowSamplingMultiplier")> Public Enum ShadowSamplingMultiplier SamplingMultiplierZero = 0 SamplingMultiplierOneEighth = 1 SamplingMultiplierOneFourth = 2 SamplingMultiplierOneHalf = 3 SamplingMultiplierOne = 4 SamplingMultiplierTwo = 5 End Enum
 Члены
 Члены
 Описание
 SamplingMultiplierZero
 Значение: 0. Множитель выборки равен 0.
 SamplingMultiplierOneEighth
 Значение: 1. Множитель выборки равен 1/8.
 SamplingMultiplierOneFourth
 Значение: 2. Множитель выборки равен 1/4.
 SamplingMultiplierOneHalf
 Значение: 3. Множитель выборки равен 1/2.
 SamplingMultiplierOne
 Значение: 4. Множитель выборки равен 1.
 SamplingMultiplierTwo
 Значение: 5. Множитель выборки равен 2.
 Описание
 Перечисление ShadowSamplingMultiplier определяет допустимые значения множителя выборки теней для протяженных источников света.
 Ваши комментарии по поводу этого топика: Послать отзыв!