Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.EllipticalArc3d.IsInside
 Послать отзыв
 Метод позволяет убедиться, находится ли указанная точка внутри полного эллипса в пределах точности по умолчанию.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsInside( Point3d pointValue );
Копировать Код
Public Function IsInside( pointValue As Point3d ) As Boolean
 Параметры
 Параметры
 Описание
 pointValue
 Проверяемая точка. Тип Point3d.
 Возвращает
 Возвращает true, если в пределах используемой точности можно считать, что проверяемая точка находится в пределах полного эллипса. В противном случае возвращает false.
 Описание
 Метод позволяет убедиться, находится ли указанная точка внутри полного эллипса. Используется вызов метода EllipticalArc3d.IsInside(Point3d pointValue, Tolerance tolerance) с геометрической точностью по умолчанию, которая равна Tolerance.Global.
 Ссылки
 Teigha.Geometry.EllipticalArc3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!