Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Filters.SpatialFilter.Definition
 Послать отзыв
 Свойство Definition предоставляет доступ к определению данного пространственного фильтра SpatialFilter.
 Синтаксис
C#
Visual Basic
Копировать Код
public SpatialFilterDefinition Definition;
Копировать Код
Public Property Definition As SpatialFilterDefinition
 Возвращает
 Возвращает определение данного пространственного фильтра. Тип SpatialFilterDefinition.
 Описание
 Свойство Definition предоставляет доступ к определению данного пространственного фильтра SpatialFilter.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Filters.SpatialFilter, Teigha.DatabaseServices.Filters
 Ваши комментарии по поводу этого топика: Послать отзыв!