Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Scale3d.Y
 Послать отзыв
 Свойство представляет масштабный коэффициент по оси Y.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Y;
Копировать Код
Public ReadOnly Property Y As Double
 Возвращает
 Возвращает значение масштабного коэффициента по оси Y. Тип double.
 Описание
 Свойство представляет масштабный коэффициент по оси Y.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.Scale3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!