Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SectionSettings.SetDivisionLines
 Послать отзыв
 Метод позволяет задать видимость линий разделения для указанной геометрии.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetDivisionLines( SectionType nSecType, SectionGeometry nGeometry, bool bShow );
Копировать Код
Public Sub SetDivisionLines( nSecType As SectionType, nGeometry As SectionGeometry, bShow As Boolean )
 Параметры
 Параметры
 Описание
 nSecType
 Тип сечения. Перечисление SectionType.
 nGeometry
 Типы элементов геометрии сечения. Перечисление SectionGeometry.
 bShow
 Флаг, определяющий, должны ли отображаться линии разделения. Тип bool. Линии видимы в случае значения true.
 Описание
 Метод позволяет задать видимость линий разделения для указанной геометрии.
 Ссылки
 Teigha.DatabaseServices.SectionSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!