Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DbHomeView.Clone
 Послать отзыв
 Метод предназначен для клонирования данного объекта DbHomeView.
 Синтаксис
C#
Visual Basic
Копировать Код
public Object Clone();
Копировать Код
Public Function Clone() As Object
 Возвращает
 Возвращает результат клонирования. Тип Object.
 Описание
 Метод предназначен для клонирования данного объекта DbHomeView.
 Ссылки
 Teigha.DatabaseServices.DbHomeView, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!