Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Solid3d.CleanBody
 Послать отзыв
 Метод позволяет удалить все избыточные ребра и грани, которые не являются необходимыми для обеспечения топологии данного твердого тела.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void CleanBody();
Копировать Код
Public Overridable Sub CleanBody()
 Описание
 Метод позволяет удалить все избыточные ребра и грани, которые не являются необходимыми для обеспечения топологии данного твердого тела.
 Ссылки
 Teigha.DatabaseServices.Solid3d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!