Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LinkedTableData.IsContentEditable
 Послать отзыв
 Метод позволяет проверить, допустимо ли редактирование содержимого указанной ячейки таблицы.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual bool IsContentEditable( int row, int column );
Копировать Код
Public Overridable Function IsContentEditable( row As Integer, column As Integer ) As Boolean
 Параметры
 Параметры
 Описание
 row
 Индекс строки. Тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 column
 Индекс столбца. Тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице.
 Возвращает
 Возвращает true, если содержимое ячейки можно редактировать. В противном случае возвращает false.
 Описание
 Метод позволяет проверить, допустимо ли редактирование содержимого указанной ячейки таблицы.
 Ссылки
 Teigha.DatabaseServices.LinkedTableData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!