Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AbstractViewPE.AbstractViewPE
 Послать отзыв
 Конструктор класса AbstractViewPE. Создает экземпляр класса на основе указанного видового экрана.
 Синтаксис
C#
Visual Basic
Копировать Код
public AbstractViewPE( ref RXObject pViewport );
Копировать Код
Public Sub New( ByRef pViewport As RXObject )
 Параметры
 Параметры
 Описание
 pViewport
 Исходный видовой экран для создания расширения протокола. Тип RXObject.
 Описание
 Конструктор класса AbstractViewPE. Создает экземпляр класса на основе указанного видового экрана.
 Ссылки
 Teigha.DatabaseServices.AbstractViewPE, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!