Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MTextFragment.Text
 Послать отзыв
 Свойство возвращает текст данного фрагмента в виде строки, очищенной от кодов форматирования.
 Синтаксис
C#
Visual Basic
Копировать Код
public String Text;
Копировать Код
Public ReadOnly Property Text As String
 Возвращает
 Возвращает строку текста данного фрагмента. Тип String.
 Описание
 Свойство возвращает текст данного фрагмента в виде строки, очищенной от кодов форматирования.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.MTextFragment, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!