Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.VertexRef
 Послать отзыв
 Класс VertexRef представляет ссылку на вершину объекта чертежа.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::DatabaseServices::GeomRef Teigha::DatabaseServices::SubentRef Teigha::DatabaseServices::VertexRef
 Синтаксис
C#
Visual Basic
Копировать Код
[TypeDescriptionProvider("Teigha.ComponentModel.TypeDescriptionProvider`1[[Teigha.DatabaseServices.VertexRef, TD_MgdDbConstraints]], TD_MgdDbConstraints")] [Wrapper("AcDbVertexRef")] public class VertexRef : SubentRef
Копировать Код
<TypeDescriptionProvider("Teigha.ComponentModel.TypeDescriptionProvider`1[[Teigha.DatabaseServices.VertexRef, TD_MgdDbConstraints]], TD_MgdDbConstraints")> <Wrapper("AcDbVertexRef")> Public Class VertexRef Inherits SubentRef
 Описание
 Класс VertexRef представляет ссылку на вершину объекта чертежа.
 Методы
 Конструкторы
 Teigha.DatabaseServices.VertexRef
 Имя
 Описание
 VertexRef
 Это обзор перегрузок VertexRef.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.DatabaseServices.GeomRef
 Имя
 Описание
 GeomRef Методы
 Ниже перечислены методы класса GeomRef.
 GeomRef Свойства
 Ниже перечислены свойства класса GeomRef.
 Teigha.DatabaseServices.SubentRef
 Имя
 Описание
 SubentRef Методы
 Ниже перечислены методы класса SubentRef.
 SubentRef Свойства
 Ниже перечислены свойства класса SubentRef.
 Teigha.DatabaseServices.VertexRef
 Имя
 Описание
 VertexRef Свойства
 Ниже перечислены свойства класса VertexRef.
 Ссылки
 VertexRef Конструктор, VertexRef Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!