Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Tduupdate
 Послать отзыв
 Синтаксис
C#
Visual Basic
public DateTime Tduupdate;
Public Property Tduupdate() As DateTime
 Описание
 Обеспечивает доступ к текущему значению TDUUPDATE для базы данных.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!