Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DataLink.DataAdapterId
 Послать отзыв
 Свойство предоставляет доступ к идентификатору адаптера данных.
 Синтаксис
C#
Visual Basic
Копировать Код
public String DataAdapterId;
Копировать Код
Public Property DataAdapterId() As String
 Возвращает
 Возвращает идентификатор адаптера данных. Тип String.
 Описание
 Свойство предоставляет доступ к идентификатору адаптера данных.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.DataLink, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!