Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.HostApplicationServices.RegistryProductRootKey
 Послать отзыв
 Свойство возвращает корневой ключ продукта в реестре Windows.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual String RegistryProductRootKey;
Копировать Код
Public Overridable ReadOnly Property RegistryProductRootKey As String
 Возвращает
 Возвращает корневой ключ продукта в реестре. Тип String.
 Описание
 Свойство возвращает корневой ключ продукта в реестре Windows.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.HostApplicationServices, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!