Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AbstractViewPE.FieldWidth
 Послать отзыв
 Свойство FieldWidth представляет ширину поля камеры вида.
 Синтаксис
C#
Visual Basic
Копировать Код
public double FieldWidth;
Копировать Код
Public ReadOnly Property FieldWidth As Double
 Возвращает
 Возвращает ширину поля камеры вида в системе координат дисплея (DCS). Тип double.
 Описание
 Свойство FieldWidth представляет ширину поля камеры вида. Определяется в системе координат дисплея (DCS).
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.AbstractViewPE, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!