Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.TableEnumerator.MoveNext
 Послать отзыв
 Метод обеспечивает переход перечислителя к следующему элементу таблицы.
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract bool MoveNext();
Копировать Код
Public MustOverride Function MoveNext() As Boolean
 Возвращает
 Возвращает true, если текущий элемент перечислителя находится в таблице (его индекс не превышает максимальный индекс таблицы). Если он вышел за пределы таблицы, возвращает false.
 Описание
 Метод обеспечивает переход перечислителя к следующему элементу таблицы.
 Ссылки
 LinkedTableEnumerator Класс, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!