Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.InsertColumnsAndInherit
 Послать отзыв
 Метод предназначен для вставки в таблицу заданного количества новых столбцов, начиная с указанного индекса.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void InsertColumnsAndInherit( int col, int inheritFrom, int numCols );
Копировать Код
Public virtual Sub InsertColumnsAndInherit( col As Integer, inheritFrom As Integer, numCols As Integer )
 Параметры
 Параметры
 Описание
 col
 Индекс, начиная с которого выполняется вставка новых столбцов, тип int.
 inheritFrom
 Индекс столбца, у которого вставляемые столбцы наследуют формат, тип int. Может принимать значение -1. В этом случае новые столбцы создаются с форматом по умолчанию.
 numCols
 Количество вставляемых столбцов, тип int.
 Описание
 Метод предназначен для вставки в таблицу заданного количества новых столбцов, начиная с указанного индекса. Метод позволяет на выбор использовать для новых столбцов формат по умолчанию или наследовать формат у существующего столбца.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!