Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbCurve3d.ElevateDegree
 Послать отзыв
 Метод увеличивает степень сплайна на указанную величину.
 Синтаксис
C#
Visual Basic
Копировать Код
public void ElevateDegree( int plusDegree );
Копировать Код
Public Sub ElevateDegree( plusDegree As Integer )
 Параметры
 Параметры
 Описание
 plusDegree
 Величина, на которую увеличивается степень сплайна. Тип int.
 Описание
 Метод увеличивает степень сплайна на величину plusDegree.
 Ссылки
 Teigha.Geometry.NurbCurve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!