Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ObjectId.IsEffectivelyErased
 Послать отзыв
 Свойство определяет, удален или нет объект, связанный с этим ObjectId, а также не удален ли кто-либо из владельцев в иерархии владения этим объектом.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsEffectivelyErased;
Копировать Код
Public Property IsEffectivelyErased() As Boolean
 Возвращает
 Возвращает значение true, если объект, связанный с этим ObjectId, удален, или если удален кто-либо из владельцев в иерархии владения этим объектом.
 Описание
 Свойство определяет, удален или нет объект, связанный с этим ObjectId. Возвращает значение true, если этот объект удален, или если удален кто-либо из владельцев в иерархии владения этим объектом (другими словами, владелец объекта, владелец владельца объекта и т. д.).
 Замечания
 Для поиска следующего владельца в иерархии используется свойство OwnerId каждого объекта. Если у какого-либо объекта в иерархии владения (кроме верхнеуровневых объектов Symbol Table или Named Object Dictionary) идентификатор владельца OwnerId не задан, этот метод не сможет проследить всю цепочку владения. Если это произойдет, или если какой-либо из объектов-владельцев не удастся открыть на чтение, то будет возвращено значение true.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.ObjectId, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!