Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Viewport.SetUcs
 Послать отзыв
 Метод позволяет задать в видовом экране пользовательскую систему координат непосредственно, используя координаты точки начала и направления осей X и Y.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetUcs( Point3d origin, Vector3d x, Vector3d y );
Копировать Код
Public Sub SetUcs( origin As Point3d, x As Vector3d, y As Vector3d )
 Параметры
 Параметры
 Описание
 origin
 Положение начала новой пользовательской системы координат. Тип Point3d.
 x
 Направляющий вектор оси X. Тип Vector3d.
 y
 Направляющий вектор оси Y. Тип Vector3d.
 Описание
 Метод позволяет задать в видовом экране пользовательскую систему координат непосредственно, используя координаты точки начала и направления осей X и Y. Все координаты и направления задаются в мировой системе координат (WCS).
 Ссылки
 Teigha.DatabaseServices.Viewport, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!