Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Point2d.Point2d
 Послать отзыв
 Конструктор. Создает новый объект Point2d с указанными координатами x и y.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point2d( double x, double y );
Копировать Код
Public Sub New( x As Double, y As Double )
 Параметры
 Параметры
 Описание
 x
 X-координата новой точки. Тип double.
 y
 Y-координата новой точки. Тип double.
 Описание
 Конструктор. Создает новый объект Point2d с указанными координатами x и y.
 Ссылки
 Teigha.Geometry.Point2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!