Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Database.ReadDwgFileFromMemory
 Послать отзыв
 This is ReadDwgFileFromMemory, a member of class Database.
 Синтаксис
C#
Visual Basic
public void ReadDwgFileFromMemory(ref array<Byte> drawingFileByteArray, bool allowCPConversion, ref String password);
Public Sub ReadDwgFileFromMemory(ByRef drawingFileByteArray As array<Byte>, allowCPConversion As bool, ByRef password As String)
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!