Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Entity.Linetype
 Послать отзыв
 Свойство предназначено для получения или установки имени типа линии (записи таблицы типов линий LinetypeTableRecord), которая связана с данным геометрическим объектом.
 Синтаксис
C#
Visual Basic
Копировать Код
public String Linetype;
Копировать Код
Public Property Linetype() As String
 Возвращает
 Возвращает строковое значение (String), представляющее имя текущего типа линии объекта. Это значение может быть изменено для назначения объекту другого стиля линии.
 Описание
 Свойство предназначено для получения или установки имени типа линии (записи таблицы типов линий LinetypeTableRecord), которая связана с данным геометрическим объектом.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Entity, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!