Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LoftOptionsCheckCurvesOut
 Послать отзыв
 Этот класс представляет группу флагов, которые отражают состояние кривых поперечных сечений при их использовании в операциях вытягивания поверхностей по сечениям (лофт).
 Иерархия классов
Teigha::DatabaseServices::LoftOptionsCheckCurvesOut
 Синтаксис
C#
Visual Basic
Копировать Код
public class LoftOptionsCheckCurvesOut;
Копировать Код
Public Class LoftOptionsCheckCurvesOut
 Описание
 Этот класс представляет группу флагов, которые отражают состояние кривых поперечных сечений при их использовании в операциях вытягивания поверхностей по сечениям (лофт). Выделены следующие состояния:
Все кривые поперечных сечений незамкнуты.
Все кривые поперечных сечений замкнуты.
Все кривые поперечных сечений являются плоскими.
 Методы
 Конструкторы
 Имя
 Описание
 LoftOptionsCheckCurvesOut
 Конструктор ро умолчанию класса LoftOptionsCheckCurvesOut.
 Топики
 Имя
 Описание
 LoftOptionsCheckCurvesOut Свойства
 Ниже перечислены свойства класса LoftOptionsCheckCurvesOut.
 Ссылки
 LoftOptionsCheckCurvesOut Свойства, Методы, Топики, LoftOptionsCheckCurvesOut Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!