Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.XrefSubCommandEventArgs.xrefOp
 Послать отзыв
 Свойство xrefOp представляет связанную с событием подкоманду внешних ссылок.
 Синтаксис
C#
Visual Basic
Копировать Код
public XrefOperation xrefOp;
Копировать Код
Public ReadOnly Property xrefOp As XrefOperation
 Возвращает
 Возвращает подкоманду внешних ссылок. Значение из перечисления XrefOperation.
 Описание
 Свойство xrefOp представляет связанную с событием подкоманду внешних ссылок.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.XrefSubCommandEventArgs, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!