Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FileDependencyManager.EraseEntry
 Послать отзыв
 Метод удаляет указанную запись из раздела .dwg списка файловых зависимостей.
 Синтаксис
C#
Visual Basic
Копировать Код
public void EraseEntry( int index, bool forceRemove );
Копировать Код
Public Sub EraseEntry( index As Integer, forceRemove As Boolean )
 Параметры
 Параметры
 Описание
 index
 Индекс записи в списке файловых зависимостей. Тип int.
 forceRemove
 Флаг, который определяет, следует ли принудительно удалять запись независимо от значения счетчика ссылок. Тип bool.
 Описание
 Метод удаляет указанную запись из раздела .dwg списка файловых зависимостей.
 Замечания
 Указанная запись удаляется, если счетчик ссылок на запись равен 1, или если аргумент forceRemove имеет значение true. В противном случае этот метод просто уменьшает счетчик ссылок на единицу.
 Ссылки
 Teigha.DatabaseServices.FileDependencyManager, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!