Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство IdPair.IsPrimary
 Послать отзыв
 This is IsPrimary, a member of class IdPair.
 Синтаксис
C#
Visual Basic
public bool IsPrimary;
Public Property IsPrimary() As bool
 Ссылки
 IdPair Структура, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!