Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObject.OwnerId
 Послать отзыв
 Свойство предназначено для получения идентификатора владельца объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectId OwnerId;
Копировать Код
Public Property OwnerId() As ObjectId
 Возвращает
 Возвращает идентификатор владельца в базе данных чережа. Тип ObjectId
 Описание
 Свойство предоставляет значение идентификатора владельца этого объекта в базе данных чертежа.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.DBObject, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!