Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObject.UndoFiler
 Послать отзыв
 Свойство предоставляет доступ к истории операций с объектом.
 Синтаксис
C#
Visual Basic
Копировать Код
public DwgFiler UndoFiler;
Копировать Код
Public Property UndoFiler() As DwgFiler
 Возвращает
 Возвращает историю операций с объектом выполнения операции Undo с объектом. Тип DwgFiler
 Описание
 Свойство предоставляет доступ к истории операций с объектом для выполнения операции Undo.
 Условия
 Только чтение
 Ссылки
 Teigha.DatabaseServices.DBObject, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!