Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LayoutManager.RenameLayout
 Послать отзыв
 Метод присваивает новое имя newName объекту Layout с именем oldName.
 Синтаксис
C#
Visual Basic
Копировать Код
public void RenameLayout( ref String oldName, ref String newName );
Копировать Код
Public Sub RenameLayout( ByRef oldName As String, ByRef newName As String )
 Параметры
 Параметры
 Описание
 oldName
 Текущее имя объекта Layout, тип String.
 newName
 Новое имя объекта Layout, тип String.
 Описание
 Метод присваивает новое имя newName объекту Layout с именем oldName.
 Ссылки
 Teigha.DatabaseServices.LayoutManager, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!