Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector2d.Subtract
 Послать отзыв
 Метод реализует вычитание указанного вектора из данного вектора.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector2d Subtract( Vector2d v );
Копировать Код
Public Function Subtract( v As Vector2d ) As Vector2d
 Параметры
 Параметры
 Описание
 v
 Вычитаемый вектор. Тип Vector2d.
 Возвращает
 Возвращает результат векторного вычитания. Тип Vector2d.
 Описание
 Метод вычитает вектор v из данного вектора.
 Ссылки
 Teigha.Geometry.Vector2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!