Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Point3dCollection.Count
 Послать отзыв
 Свойство предоставляет доступ к текущему количеству элементов в коллекции.
 Синтаксис
C#
Visual Basic
Копировать Код
public Int32 Count;
Копировать Код
Public Property Count() As Int32
 Возвращает
 Возвращает количество элементов в этой коллекции. Тип Int32.
 Описание
 Свойство предоставляет доступ к текущему количеству элементов в коллекции.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.Point3dCollection, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!