Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Cell
 Послать отзыв
 Данный класс представляет ячейки таблицы.
 Иерархия классов
Teigha::DatabaseServices::CellRange Teigha::DatabaseServices::Cell
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("AcCell"), DefaultMember("Item")] public class Cell : CellRange;
Копировать Код
<Wrapper("AcCell"), DefaultMember("Item")> Public Class Cell Inherits CellRange
 Описание
 Данный класс представляет ячейки таблицы.
 Методы
 Конструкторы
 Teigha.DatabaseServices.Cell
 Имя
 Описание
 Cell
 Конструктор класса Cell. Создает ячейку в указанной таблице в заданных строке и столбце.
 Топики
 Имя
 Описание
 CellRange Методы
 Ниже перечислены методы класса CellRange.
 CellRange Операторы
 Ниже перечислены операторы класса CellRange.
 CellRange Свойства
 Ниже перечислены свойства класса CellRange.
 Teigha.DatabaseServices.Cell
 Имя
 Описание
 Cell Методы
 Ниже перечислены методы класса Cell.
 Cell Свойства
 Ниже перечислены свойства класса Cell.
 Ссылки
 Cell Методы, Cell Свойства, Методы, Топики, CellRange Методы, CellRange Операторы, CellRange Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!