Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Vertex2d.Tangent
 Послать отзыв
 Свойство Tangent представляет направление касательной к кривой в данной вершине.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Tangent;
Копировать Код
Public Property Tangent As Double
 Возвращает
 Возвращает угол в радианах между осью X объектной системы координат (OCS) полилинии и направлением касательной к кривой в данной вершине. Тип double.
 Описание
 Свойство Tangent представляет направление касательной к кривой в данной вершине. Это угол между осью X объектной системы координат (OCS) Polyline2d и направлением касательной, измеряемый в радианах.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Vertex2d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!