Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocArray
 Послать отзыв
 Класс AssocArray представляет массив ассоциативных действий, вычисление которых позволяет управлять элементами ассоциативного массива или их расположением.
 Иерархия классов
Teigha::DatabaseServices::AssocArray
 Синтаксис
C#
Visual Basic
Копировать Код
public class AssocArray;
Копировать Код
Public Class AssocArray
 Описание
 Класс AssocArray представляет массив ассоциативных действий, вычисление которых позволяет управлять элементами ассоциативного массива или их расположением.
 Он содержит идентификатор ассоциативного массива (это может быть прямоугольный массив, круговой массив, массив по траектории) и идентификатор соответствующего объекта OdDbAssocArrayActionBody этого массива, который используется в вычислениях ассоциативного массива. AssocArray является владельцем объекта AssocArrayParameters, через который реализуется управление параметрами ассоциативного массива.
 Топики
 Имя
 Описание
 AssocArray Методы
 Ниже перечислены методы класса AssocArray.
 AssocArray Свойства
 Ниже перечислены свойства класса AssocArray.
 Ссылки
 AssocArray Методы, AssocArray Свойства, Топики, AssocArray Методы, AssocArray Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!