Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector3d.IsEqualTo
 Послать отзыв
 Метод позволяет проверить, совпадает ли данный вектор с входным вектором.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsEqualTo( Vector3d vector );
Копировать Код
Public Function IsEqualTo( vector As Vector3d ) As Boolean
 Параметры
 Параметры
 Описание
 vector
 Входной вектор для сравнения. Тип Vector3d.
 Возвращает
 Возвращает true, если векторы можно считать совпадающими. В противном случае возвращает false.
 Описание
 Метод позволяет проверить, совпадает ли данный вектор с входным вектором. Реализация использует вызов Vector3d.IsEqualTo(Vector3d vector, Tolerance tolerance) со значением аргумента tolerance, равным Tolerance.Global. Метод возвращает true, если это условие выполнено, и false в противном случае.
 Ссылки
 Teigha.Geometry.Vector3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!