Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.HyperLinkCollection.Add
 Послать отзыв
 Метод позволяет добавить в данную коллекцию указанный объект HyperLink.
 Синтаксис
C#
Visual Basic
Копировать Код
public int Add( ref HyperLink value );
Копировать Код
Public Function Add( ByRef value As HyperLink ) As Integer
 Параметры
 Параметры
 Описание
 value
 Добавляемая гиперссылка. Тип HyperLink.
 Возвращает
 Возвращает текущее количество объектов в коллекции после добавления гиперссылки value. Тип int.
 Описание
 Метод позволяет добавить в данную коллекцию указанный объект HyperLink.
 Ссылки
 Teigha.DatabaseServices.HyperLinkCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!