Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.HostApplicationServices.GetPassword
 Послать отзыв
 Хост-приложения вызывают этот метод внутри себя, чтобы отобразить диалоговое окно запроса пароля. В текущей версии не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual bool GetPassword( ref String fileName, PasswordOptions options, out String pass );
Копировать Код
Public Overridable Function GetPassword( ByRef fileName As String, options As PasswordOptions, pass As Out String ) As Boolean
 Параметры
 Параметры
 Описание
 fileName
 Имя файла чертежа, для доступа к которому требуется пароль. Тип String.
 options
 Опции пароля. Перечисление PasswordOptions.
 pass
 Полученный пароль. Тип String.
 Возвращает
 Возвращает false.
 Описание
 Хост-приложения вызывают этот метод внутри себя, чтобы отобразить диалоговое окно запроса пароля. В текущей версии не реализован.
 Ссылки
 Teigha.DatabaseServices.HostApplicationServices, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!