Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.RowType
 Послать отзыв
 Метод позволяет получить тип указанной строки данной таблицы (наименование таблицы, заголовки столбцов, строки данных).
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual RowType RowType( int row );
Копировать Код
Public virtual Function RowType( row As Integer ) As RowType
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 Возвращает
 Возвращает тип строки из перечисления RowType.
 Описание
 Метод позволяет получить тип указанной строки данной таблицы (наименование таблицы, заголовки столбцов, строки данных).
 Замечания
 Для получения того же результата предпочтительнее использовать функционал объекта Row.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!