Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 DimStyleTableRecord.Dimgap
 Послать отзыв
 Свойство отвечает за величину отступа текста от размерной линии.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual double Dimgap { get; set; }
Копировать Код
Public Overridable Property Dimgap As Double
 Возвращает
 Возвращает тип данных double.
 Описание
 В свойстве хранится величина отступа текста от размерной линии в виде числа double. Доступные значения – положительные числа. Значение по умолчанию 1.0. Текст помещается внутри выносных линий, только если длина текста вместе с величиной Dimgap справа и слева, либо сверху и снизу не выходят за пределы выносных линий.
 Свойство также доступно через системную переменную DIMGAP и пользовательское меню в окне изменения/создания размерного стиля:
  При изменении системной переменной DIMGAP будет создан новый размерный стиль под названием <переопределение> на основе текущего с новым значением DIMGAP.
 Условия
 Чтение и запись.
 Пример
 Пример изменения величины отступа текста от размерной линии (значения свойства Dimgap) в размерном стиле Standard:
C#
 Копировать Код
public partial class Commands { [Teigha.Runtime.CommandMethod("DimgapChange")] public void DimgapStandardDimStyle() { // Получение ссылки на активный документ HostMgd.ApplicationServices.Document doc = HostMgd.ApplicationServices.Application.DocumentManager.MdiActiveDocument; // Получение ссылки на редактор документа HostMgd.EditorInput.Editor ed = doc.Editor; // Получение ссылки на базу данных документа Teigha.DatabaseServices.Database db = doc.Database; // Начало транзакции с базой данных документа using (Teigha.DatabaseServices.Transaction trans = db.TransactionManager.StartTransaction()) { // Открываем таблицу размерных стилей для чтения Teigha.DatabaseServices.DimStyleTable dimStyleTable = trans.GetObject(db.DimStyleTableId, Teigha.DatabaseServices.OpenMode.ForRead) as Teigha.DatabaseServices.DimStyleTable; // Находим в таблице размерных стилей ObjectId нужного стиля по его названию Teigha.DatabaseServices.ObjectId styleId = dimStyleTable["Standard"]; // Открываем таблицу размерного стиля для изменений Teigha.DatabaseServices.DimStyleTableRecord obj = trans.GetObject(styleId, Teigha.DatabaseServices.OpenMode.ForWrite) as Teigha.DatabaseServices.DimStyleTableRecord; ed.WriteMessage($"nDimgap before: {obj.Dimgap}"); // Изменяем расстояние между размерной линией и размерным текстом obj.Dimgap = 15; ed.WriteMessage($"nDimgap after: {obj.Dimgap}"); trans.Commit(); } } }
 Результат работы команды DimgapChange:
 Было:
 Стало:
 Ссылки
 Teigha.DatabaseServices.DimStyleTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!