Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Section.NumVertices
 Послать отзыв
 Свойство NumVertices представляет количество вершин на секущей плоскости.
 Синтаксис
C#
Visual Basic
Копировать Код
public int NumVertices;
Копировать Код
Public ReadOnly Property NumVertices As Integer
 Возвращает
 Возвращает количество вершин. Тип int.
 Описание
 Свойство NumVertices представляет количество вершин на секущей плоскости.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Section, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!