Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Section.Settings
 Послать отзыв
 Свойство Settings представляет настройки этого сечения или разреза.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.ObjectId Settings;
Копировать Код
Public ReadOnly Property Settings As DatabaseServices.ObjectId
 Возвращает
 Возвращает идентификатор объекта настроек данного объекта. Тип DatabaseServices.ObjectId.
 Описание
 Свойство Settings представляет настройки этого сечения или разреза.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Section, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!