Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Curve.GetOffsetCurves
 Послать отзыв
 Метод создает коллекцию кривых, полученных со смещением (offset).
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual DBObjectCollection GetOffsetCurves( double offsetDist );
Копировать Код
Public virtual Function GetOffsetCurves( offsetDist As double ) As DBObjectCollection
 Параметры
 Параметры
 Описание
 offsetDist
 Величина смещения, тип double.
 Возвращает
 Возвращает коллекцию типа DBObjectCollection, в которой содержатся построенные кривые.
 Описание
 Метод создает коллекцию кривых, полученных со смещением (offset).
 Ссылки
 Teigha.DatabaseServices.Curve, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!