Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SubentityId.==
 Послать отзыв
 Оператор равенства для структуры SubentityId.
 Синтаксис
C#
Visual Basic
Копировать Код
public static bool operator ==( SubentityId a, SubentityId b );
Копировать Код
Public Shared Operator =( a As SubentityId, b As SubentityId ) As Boolean
 Параметры
 Параметры
 Описание
 a
 Левый операнд. Тип SubentityId.
 b
 Правый операнд. Тип SubentityId.
 Возвращает
 Возвращает true только в случае равенства операндов. Тип bool.
 Описание
 Оператор равенства для структуры SubentityId.
 Замечания
 Условием равенства двух объектов SubentityId является совместное выполнение следующих условий:
Объекты имеют одинаковый тип подобъекта.
Объекты имеют одинаковый индекс подобъекта.
Объекты имеют одинаковый тип класса.
 Ссылки
 Teigha.DatabaseServices.SubentityId, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!