Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Cone.IntersectWith
 Послать отзыв
 Метод позволяет получить точки пересечения данного конуса с указанным линейным объектом, вычисленные с заданной точностью.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d[] IntersectWith( ref LinearEntity3d linearEntity, Tolerance tolerance );
Копировать Код
Public Function IntersectWith( ByRef linearEntity As LinearEntity3d, tolerance As Tolerance ) As Point3d()
 Параметры
 Параметры
 Описание
 linearEntity
 Линейный объект, который пересекается с конусом. Тип LinearEntity3d.
 tolerance
 Заданная точность вычислений. Тип Tolerance.
 Возвращает
 Возвращает массив точек пересечения. Тип Point3d[].
 Описание
 Метод позволяет получить точки пересечения данного конуса с указанным линейным объектом, вычисленные с заданной точностью.
 Замечания
 Точка касания считается точкой пересечения.
 Ссылки
 Teigha.Geometry.Cone, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!