Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GeomRef.Reset
 Послать отзыв
 Метод обнуляет ссылку на геометрию в данном объекте.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Reset();
Копировать Код
Public Sub Reset()
 Описание
 Метод обнуляет ссылку на геометрию в данном объекте.
 Ссылки
 Teigha.DatabaseServices.GeomRef, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!