Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ObjectId.OldIdPtr
 Послать отзыв
 Свойство предоставляет доступ к значению ObjectId в старом формате - как к длинному целому (он представляет собой массив из двух long, первый элемент которого содержит то же значение, что и ObjectId).
 Синтаксис
C#
Visual Basic
Копировать Код
public IntPtr OldIdPtr;
Копировать Код
Public Property OldIdPtr() As IntPtr
 Возвращает
 Возвращает IntPtr.
 Описание
 Свойство предоставляет доступ к значению ObjectId в старом формате - как к длинному целому (он представляет собой массив из двух long, первый элемент которого содержит то же значение, что и ObjectId).
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.ObjectId, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!