Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.AlternatePrefix
 Послать отзыв
 Свойство задает или возвращает альтернативный префикс размерного текста.
 Синтаксис
C#
Visual Basic
Копировать Код
public String AlternatePrefix;
Копировать Код
Public Property AlternatePrefix As String
 Возвращает
 Возвращает альтернативный префикс. Тип String.
 Описание
 Свойство задает или возвращает альтернативный префикс размерного текста. Это свойство имеет эффект только в том случае, если для свойства Dimalt установлено значение true.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!