Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Material.Mode
 Послать отзыв
 Свойство представляет режим представления данного материала.
 Синтаксис
C#
Visual Basic
Копировать Код
public GraphicsInterface.Mode Mode;
Копировать Код
Public Property Mode As GraphicsInterface.Mode
 Возвращает
 Возвращает режим представления материала. Перечисление GraphicsInterface.Mode.
 Описание
 Свойство представляет режим представления данного материала (Advanced / Realistic).
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Material, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!