Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.Dimfxlen
 Послать отзыв
 Свойство задает или возвращает длину выносных линий с фиксированной длиной.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Dimfxlen;
Копировать Код
Public Property Dimfxlen As Double
 Возвращает
 Возвращает длину выносных линий. Тип double.
 Описание
 Свойство задает или возвращает длину выносных линий с фиксированной длиной.
 Длина выносной линии — это расстояние от начала выносной линии и до ее пересечения с размерной линией. Выступ и отступ в эту длину не включаются. Если длина выносной линии имеет отрицательное значение, выносные линии проводят снаружи к точкам пересечения с размерными линиями, в сторону выносных точек.
 Свойство Dimfxlen действительно, только если свойство DimfxlenOn имеет значение true.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!