Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.ExternalCurve2d
 Послать отзыв
 Класс ExternalCurve2d представляет 2D-кривые, определения которых являются внешними по отношению к геометрической библиотеке nanoCAD.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Geometry::Entity2d Teigha::Geometry::Curve2d Teigha::Geometry::ExternalCurve2d
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdGeExternalCurve2d")] public sealed class ExternalCurve2d : Curve2d
Копировать Код
<Wrapper("OdGeExternalCurve2d")> Public NotInheritable Class ExternalCurve2d Inherits Curve2d
 Описание
 Класс ExternalCurve2d представляет 2D-кривые, определения которых являются внешними по отношению к геометрической библиотеке nanoCAD.
 С экземплярами ExternalCurve2d можно работать как с любыми объектами Curve2d. Доступ к ExternalCurve2d можно получить так же, как к кривой Curve2d, если она существует. Кроме того, возможно получить доступ к внешним данным в их нативной форме (что может оказаться более эффективным). Одним из примеров использования ExternalCurve2d является доступ к кривым ACIS.
 Следует, однако, иметь ввиду, что определения внешних кривых отличаются от соответствующих определений в геометрической библиотеке nanoCAD. Например, могут отличаться способы параметризации кривых.
 Методы
 Конструкторы
 Teigha.Geometry.ExternalCurve2d
 Имя
 Описание
 ExternalCurve2d
 Это обзор перегрузок ExternalCurve2d.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Geometry.Entity2d
 Имя
 Описание
 Entity2d Методы
 Ниже перечислены методы класса Entity2d.
 Teigha.Geometry.Curve2d
 Имя
 Описание
 Curve2d Методы
 Ниже перечислены методы класса Curve2d.
 Curve2d Свойства
 Ниже перечислены свойства класса Curve2d.
 Teigha.Geometry.ExternalCurve2d
 Имя
 Описание
 ExternalCurve2d Методы
 Ниже перечислены методы класса ExternalCurve2d.
 ExternalCurve2d Свойства
 Ниже перечислены свойства класса ExternalCurve2d.
 Ссылки
 ExternalCurve2d Конструктор, ExternalCurve2d Методы, ExternalCurve2d Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!