Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Assoc2dConstraintGroup.RegenDimensionSystem
 Послать отзыв
 Метод восстанавливает внутреннюю систему размеров. Предназначен только для внутреннего использования.
 Синтаксис
C#
Visual Basic
Копировать Код
public void RegenDimensionSystem();
Копировать Код
Public Sub RegenDimensionSystem()
 Описание
 Метод восстанавливает внутреннюю систему размеров. Предназначен только для внутреннего использования.
 Ссылки
 Teigha.DatabaseServices.Assoc2dConstraintGroup, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!