Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Cmljust
 Послать отзыв
 Синтаксис
C#
Visual Basic
public int Cmljust;
Public Property Cmljust() As Integer
 Описание
 Возвращает или устанавливает текущее значение CMLJUST для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!