Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Visretain
 Послать отзыв
 Синтаксис
C#
Visual Basic
public bool Visretain;
Public Property Visretain() As bool
 Описание
 Обеспечивает доступ к текущему значению VISRETAIN для базы данных. Значение false соответствует 0. Значение true — 1.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!