Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.HostApplicationServices.PutRemoteFile
 Послать отзыв
 Метод позволяет загрузить локальный файл в удаленное расположение с указанным URI. В текущей версии не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public void PutRemoteFile( Uri url, ref String localFile );
Копировать Код
Public Sub PutRemoteFile( url As Uri, ByRef localFile As String )
 Параметры
 Параметры
 Описание
 url
 Целевой адрес URL. Тип Uri.
 localFile
 Локальный файл-источник для загрузки. Тип String.
 Описание
 Метод позволяет загрузить локальный файл в удаленное расположение с указанным URI. В текущей версии не реализован.
 Ссылки
 Teigha.DatabaseServices.HostApplicationServices, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!