Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Spline.Spline
 Послать отзыв
 Конструктор по умолчанию класса Spline.
 Синтаксис
C#
Visual Basic
Копировать Код
public Spline();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса Spline.
 Ссылки
 Teigha.DatabaseServices.Spline, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!