Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 DimStyleTableRecord.Dimapost
 Послать отзыв
 Свойство отвечает за префикс и суффикс в альтернативных измерениях в размерах.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual string Dimapost { get; set; }
Копировать Код
Public Overridable Property Dimapost As String
 Возвращает
 Возвращает тип данных string.
 Описание
 В свойстве хранится префикс и/или суффикс, которые должны быть добавлены к тексту альтернативных измерений в размерах, в виде строки string. Запись хранится в формате «префикс[]суффикс». Если есть суффикс и нет префикса, то в записи вместо суффикса ничего не пишется: «префикс[]» и наоборот.
 Свойство также доступно через системную переменную DIMAPOST и пользовательское меню в окне изменения/создания размерного стиля:
  При изменении системной переменной DIMAPOST будет создан новый размерный стиль под названием <переопределение> на основе текущего с новым значением DIMAPOST.
 Условия
 Чтение и запись.
 Пример
 В качестве примера работы со свойством Dimapost можно рассмотреть пример, приведенный в описании свойства Dimpost, заменив в нем Dimpost на Dimapost и добавив проверку признака отображения альтернативных измерений (значения свойства Dimalt) с изменением его на true (включить отображение альтернативных измерений), если оно равно false (отображение альтернативных измерений отключено).
 Ссылки
 Teigha.DatabaseServices.DimStyleTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!