Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.PointEntity3d
 Послать отзыв
 Класс PointEntity3d является базовым классом для всех классов трехмерных точечных объектов.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Geometry::Entity3d Teigha::Geometry::PointEntity3d
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdGePointEnt3d")] public abstract class PointEntity3d : Entity3d
Копировать Код
<Wrapper("OdGePointEnt3d")> Public MustInherit Class PointEntity3d Inherits Entity3d
 Описание
 Класс PointEntity3d является базовым классом для всех классов трехмерных точечных объектов.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Geometry.Entity3d
 Имя
 Описание
 Entity3d Методы
 Ниже перечислены методы класса Entity3d.
 Teigha.Geometry.PointEntity3d
 Имя
 Описание
 PointEntity3d Методы
 Ниже перечислены методы класса PointEntity3d.
 Ссылки
 PointEntity3d Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!