Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.PointOnCurve3d.GetCurvature
 Послать отзыв
 Метод вычисляет кривизну кривой в точке, соответствующей указанному значению параметра. Метод не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public double GetCurvature( double parameter );
Копировать Код
Public Function GetCurvature( parameter As Double ) As Double
 Параметры
 Параметры
 Описание
 parameter
 Входной параметр точки на кривой. Тип double.
 Возвращает
 Возвращает значение кривизны кривой в указанной точке на кривой. Тип double.
 Описание
 Метод вычисляет кривизну кривой в точке, соответствующей указанному значению параметра. Метод не реализован.
 Ссылки
 Teigha.Geometry.PointOnCurve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!