Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBVisualStyle.SetTraitFlag
 Послать отзыв
 Метод позволяет задать значение флага в указанном свойстве данного стиля.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetTraitFlag( VisualStyleProperty vsProp, unsigned long flagVal, bool bEnable );
Копировать Код
Public Sub SetTraitFlag( vsProp As VisualStyleProperty, flagVal As unsigned long, bEnable As Boolean )
 Параметры
 Параметры
 Описание
 vsProp
 Свойство визуального стиля, которое необходимо установить. Значение из перечисления VisualStyleProperty.
 flagVal
 Значение флага для свойства. Тип unsigned long.
 bEnable
 Тип операции, применяемой к свойству. Тип bool.
 Описание
 Метод позволяет задать значение флага в указанном свойстве данного стиля. Применяется для свойств, которые являются перечислениями битовых полей.
 Ссылки
 Teigha.DatabaseServices.DBVisualStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!