Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Sun.ShadowParameters
 Послать отзыв
 Свойство ShadowParameters представляет параметры теней, связанных с солнечным освещением.
 Синтаксис
C#
Visual Basic
Копировать Код
public GraphicsInterface.ShadowParameters ShadowParameters;
Копировать Код
Public Property ShadowParameters As GraphicsInterface.ShadowParameters
 Возвращает
 Возвращает параметры теней как объект типа GraphicsInterface.ShadowParameters.
 Описание
 Свойство ShadowParameters представляет параметры теней, связанных с солнечным освещением.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Sun, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!