Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство DBText.TextStyleId
 Послать отзыв
 Синтаксис
C#
Visual Basic
public DatabaseServices::ObjectId TextStyleId;
Public Property TextStyleId() As DatabaseServices.ObjectId
 Описание
 Предоставляет доступ к имени используемого текстового стиля.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.DBText, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!