Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SectionSettings.HatchScale
 Послать отзыв
 Метод позволяет получить масштаб штриховки геометрии указанного типа.
 Синтаксис
C#
Visual Basic
Копировать Код
public double HatchScale( SectionType nSecType, SectionGeometry nGeometry );
Копировать Код
Public Function HatchScale( nSecType As SectionType, nGeometry As SectionGeometry ) As Double
 Параметры
 Параметры
 Описание
 nSecType
 Тип сечения. Перечисление SectionType.
 nGeometry
 Типы элементов геометрии сечения. Перечисление SectionGeometry.
 Возвращает
 Возвращает значение масштаба штриховки. Тип double.
 Описание
 Метод позволяет получить значение масштаба штриховки геометрии указанного типа.
 Ссылки
 Teigha.DatabaseServices.SectionSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!