Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство RasterImage.Contrast
 Послать отзыв
 Синтаксис
C#
Visual Basic
public unsigned char Contrast;
Public Property Contrast() As unsigned char
 Описание
 Обеспечивает доступ к текущему значению контраста.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.RasterImage, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!