Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocArrayCommonParameters.RowElevation
 Послать отзыв
 Свойство обеспечивает доступ к приращению отметок между рядами массива.
 Синтаксис
C#
Visual Basic
Копировать Код
public double RowElevation;
Копировать Код
Public Property RowElevation() As Double
 Возвращает
 Возвращает приращение отметок между рядами. Тип double.
 Описание
 Свойство обеспечивает доступ к приращению отметок между рядами массива.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.AssocArrayCommonParameters, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!