Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DwgFiler.WriteInt16
 Послать отзыв
 Метод предназначен для записи заданного 16-разрядного целого числа со знаком в этот объект Filer.
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract void WriteInt16( short value );
Копировать Код
Public MustOverride Sub WriteInt16( value As Short )
 Параметры
 Параметры
 Описание
 value
 Записываемое в Filer значение. Тип short.
 Описание
 Метод предназначен для записи заданного 16-разрядного целого числа со знаком (тип short) в этот объект Filer.
 Ссылки
 Teigha.DatabaseServices.DwgFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!