Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DataColumn.AppendCell
 Послать отзыв
 Метод добавляет указанную ячейку в конец столбца.
 Синтаксис
C#
Visual Basic
Копировать Код
public void AppendCell( ref DataCell cell );
Копировать Код
Public Sub AppendCell( ByRef cell As DataCell )
 Параметры
 Параметры
 Описание
 cell
 Добавляемая в столбец ячейка. Тип DataCell.
 Описание
 Метод добавляет указанную ячейку в конец столбца.
 Ссылки
 Teigha.DatabaseServices.DataColumn, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!