Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.TableContent.TableContent
 Послать отзыв
 Конструктор по умолчанию класса TableContent.
 Синтаксис
C#
Visual Basic
Копировать Код
public TableContent();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса TableContent.
 Ссылки
 Teigha.DatabaseServices.TableContent, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!