Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Solid3d.CreateFrustum
 Послать отзыв
 Метод создаёт усеченный конус, ориентированный по осям мировой системы координат (WCS), с центром основания в начале координат. В зависимости от входных параметров метода геометрия получаемого твердого тела может иметь вид круглого или эллиптического цилиндра, круглого или эллиптического конуса, круглого или эллиптического усеченного конуса.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void CreateFrustum( double height, double radiusAlongX, double radiusAlongY, double topRadius );
Копировать Код
Public Overridable Sub CreateFrustum( height As Double, radiusAlongX As Double, radiusAlongY As Double, topRadius As Double )
 Параметры
 Параметры
 Описание
 height
 Высота получаемого тела. Тип double. Значение не должно быть меньше 1e-6.
 radiusAlongX
 Радиус основания в направлении оси X МСК (WCS). Тип double. Значение не должно быть меньше 1e-6.
 radiusAlongY
 Радиус основания в направлении оси Y МСК (WCS). Тип double. Значение не должно быть меньше 1e-6.
 topRadius
 Радиус верхнего основания. Тип double. Значение не должно быть меньше 1e-6.
 Описание
 Метод создаёт усеченный конус, ориентированный по осям мировой системы координат (WCS), с центром основания в начале координат.
 В зависимости от входных параметров метода геометрия получаемого твердого тела может иметь следующий вид.
Круглый цилиндр (если радиус radiusAlongX равен topRadius, и совпадают радиусы radiusAlongX и radiusAlongY).
Эллиптический цилиндр (если радиусы radiusAlongX и topRadius совпадают, а радиусы radiusAlongX и radiusAlongY отличаются).
Круглый конус (если topRadius равен нулю, а радиусы radiusAlongX и radiusAlongY совпадают).
Эллиптический конус (если topRadius равен нулю, а радиусы radiusAlongX и radiusAlongY отличаются).
Усеченный круглый конус (когда topRadius отличается от нуля и не равен радиусу radiusAlongX, а радиусы radiusAlongX и radiusAlongY совпадают).
Усеченный эллиптический конус (когда topRadius отличается от нуля и не равен радиусу radiusAlongX, а радиусы radiusAlongX и radiusAlongY отличаются).
 Значения любого из входных аргументов должны быть больше или равны 1e-6 (в единицах чертежа).
 Ссылки
 Teigha.DatabaseServices.Solid3d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!