Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Matrix3d.IsEqualTo
 Послать отзыв
 Метод позволяет выяснить, совпадает ли данная матрица с указанной матрицей.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsEqualTo( Matrix3d mat );
Копировать Код
Public Function IsEqualTo( mat As Matrix3d ) As Boolean
 Параметры
 Параметры
 Описание
 mat
 Входная матрица для сравнения. Тип Matrix3d.
 Возвращает
 Возвращает true в случае совпадения матриц и false в противном случае.
 Описание
 Метод позволяет выяснить, совпадает ли данная матрица с матрицей mat. Реализация метода использует вызов Matrix3d.IsEqualTo(Matrix3d mat, Tolerance tolerance) с допуском, равным Tolerance.Global.
 Ссылки
 Teigha.Geometry.Matrix3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!