Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.UnderlayItem.Extents
 Послать отзыв
 Свойство Extents представляет габаритную рамку данного элемента в координатах модели элемента.
 Синтаксис
C#
Visual Basic
Копировать Код
public Extents2d Extents;
Копировать Код
Public ReadOnly Property Extents As Extents2d
 Возвращает
 Возвращает габаритную рамку элемента. Тип Extents2d.
 Описание
 Свойство Extents представляет габаритную рамку данного элемента в координатах модели элемента.
 Замечания
 Свойство UnderlayReference.Transform предоставляет матрицу преобразования координат модели элемента в координаты пространства блока. Координаты пространства блока обычно совпадают с координатами МСК (WCS), если только UnderlayReference не является частью блока.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.UnderlayItem, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!