Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PatternDefinition.GetDashes
 Послать отзыв
 Метод предоставляет коллекцию значений, определяющих штрихи в определении штриховки.
 Синтаксис
C#
Visual Basic
Копировать Код
public DoubleCollection GetDashes();
Копировать Код
Public Function GetDashes() As DoubleCollection
 Возвращает
 Возвращает коллекцию штрихов. Тип DoubleCollection.
 Описание
 Метод предоставляет коллекцию значений, определяющих штрихи в определении штриховки.
 Ссылки
 Teigha.DatabaseServices.PatternDefinition, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!