Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Entity.Visible
 Послать отзыв
 Свойство предназначено для получения или установки состояния видимости геометрического объекта в чертеже.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool Visible;
Копировать Код
Public Property Visible() As bool
 Возвращает
 Возвращает значение типа bool, где true означает, что объект отображается на чертеже, а false — что он скрыт.
 Описание
 Свойство устанавливает или возвращает видимость геометрического объекта в чертеже.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Entity, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!