Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector3d
 Послать отзыв
 Этот класс представляет векторы в трехмерном пространстве.
 Иерархия классов
Teigha::Geometry::Vector3d
 Синтаксис
C#
Visual Basic
Копировать Код
[StructLayout(LayoutKind.Sequential),DefaultMember("Coordinate"),Wrapper("OdGeVector3d")] public class Vector3d : IFormattable;
Копировать Код
<StructLayout(LayoutKind.Sequential),DefaultMember("Coordinate"),Wrapper("OdGeVector3d")> Public Class Vector3d Inherits IFormattable
 Описание
 Этот класс представляет векторы в трехмерном пространстве. Vector3d можно рассматривать как массив из трех вещественных чисел, представляющих компоненты вектора.
 Методы
 Конструкторы
 Имя
 Описание
 Vector3d
 Это обзор перегрузок Vector3d.
 Топики
 Имя
 Описание
 Vector3d Методы
 Ниже перечислены методы класса Vector3d.
 Vector3d Операторы
 Ниже перечислены операторы класса Vector3d.
 Vector3d Свойства
 Ниже перечислены свойства класса Vector3d.
 Ссылки
 Vector3d Конструктор, Vector3d Методы, Vector3d Операторы, Vector3d Свойства, Методы, Топики, Vector3d Методы, Vector3d Операторы, Vector3d Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!