Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Entity.Ecs
 Послать отзыв
 Свойство предназначено для получения матрицы преобразования, которая позволяет перевести точки или векторы из локальной системы координат объекта (OCS) в мировую систему координат (WCS).
 Синтаксис
C#
Visual Basic
Копировать Код
public Matrix3d Ecs;
Копировать Код
Public Property Ecs() As Matrix3d
 Возвращает
 Возвращает значение типа Matrix3d, представляющее собой трехмерную матрицу преобразования. Эта матрица содержит информацию о положении, ориентации и масштабировании объекта, необходимую для корректного перевода координат из OCS в WCS.
 Описание
 Свойство предоставляет матрицу преобразования, которая может использоваться для преобразования вектора или точки из системы координат объекта (OCS) в мировую систему координат (WCS).
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.Entity, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!