Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AbstractViewPE.WorldToEye
 Послать отзыв
 Свойство WorldToEye представляет геометрическое преобразование из мировой системы координат в систему координат камеры вида.
 Синтаксис
C#
Visual Basic
Копировать Код
public Matrix3d WorldToEye;
Копировать Код
Public ReadOnly Property WorldToEye As Matrix3d
 Возвращает
 Возвращает матрицу трехмерного геометрического преобразования. Тип Matrix3d.
 Описание
 Свойство WorldToEye представляет геометрическое преобразование из мировой системы координат в систему координат камеры вида.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.AbstractViewPE, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!