Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Database.ResolveXrefs
 Послать отзыв
 Синтаксис
C#
Visual Basic
public void ResolveXrefs(bool useThreadEngine, bool doNewOnly);
Public Sub ResolveXrefs(useThreadEngine As bool, doNewOnly As bool)
 Параметры
 Параметры
 Описание
 useThreadEngine
 Параметр, определяющий, будет ли использоваться многопотоковый механизм
 doNewOnly
 Параметр, определяющий, нужно ли обрабатывать только новые добавленные внешние ссылки
 Описание
 Метод разрешает существующие внешние ссылки в работающей базе данных. Если doNewOnly установлен в true, только неразрешеннные внешние ссылки будут обрабатываться. Существующие внешние ссылки LayerTableRecord, LinetypeTableRecord и BlockTableRecords будут игнорироваться. В этом случае параметр useThreadEngine игнорируется.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!