Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.TableContent.TableStyleId
 Послать отзыв
 Свойство TableStyleId представляет идентификатор табличного стиля.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.ObjectId TableStyleId;
Копировать Код
Public Property TableStyleId As DatabaseServices.ObjectId
 Возвращает
 Возвращает идентификатор табличного стиля. Тип DatabaseServices.ObjectId.
 Описание
 Свойство TableStyleId представляет идентификатор табличного стиля.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.TableContent, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!