Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.HostApplicationServices.GRIPSIZE
 Послать отзыв
 Свойство предоставляет отображаемый размер ручки. Допустимы значения в диапазоне [1..255] пикселей.
 Синтаксис
C#
Visual Basic
Копировать Код
public int GRIPSIZE;
Копировать Код
Public Property GRIPSIZE As Integer
 Возвращает
 Возвращает размер ручки. Тип int.
 Описание
 Свойство предоставляет отображаемый размер ручки. Допустимы значения в диапазоне [1..255] пикселей.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.HostApplicationServices, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!