Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Rectangle3d.Rectangle3d
 Послать отзыв
 Конструктор структуры Rectangle3d. Создает 3D-прямоугольник, используя заданные вершины.
 Синтаксис
C#
Visual Basic
Копировать Код
public Rectangle3d( Point3d upperLeft, Point3d upperRight, Point3d lowerLeft, Point3d lowerRight );
Копировать Код
Public Sub New( upperLeft As Point3d, upperRight As Point3d, lowerLeft As Point3d, lowerRight As Point3d )
 Параметры
 Параметры
 Описание
 upperLeft
 Вершина в верхнем левом углу прямоугольника. Тип Point3d.
 upperRight
 Вершина в верхнем правом углу прямоугольника. Тип Point3d.
 lowerLeft
 Вершина в нижнем левом углу прямоугольника. Тип Point3d.
 lowerRight
 Вершина в нижнем правом углу прямоугольника. Тип Point3d.
 Описание
 Конструктор структуры Rectangle3d. Создает 3D-прямоугольник, используя заданные вершины.
 Ссылки
 Teigha.DatabaseServices.Rectangle3d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!