Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ImageBackground.Offset
 Послать отзыв
 Свойство предоставляет доступ к вектору смещения исходного изображения в данном объекте.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector2d Offset;
Копировать Код
Public Property Offset As Vector2d
 Возвращает
 Возвращает вектор смещения исходного изображения. Тип Vector2d.
 Описание
 Свойство предоставляет доступ к вектору смещения исходного изображения в данном объекте.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.ImageBackground, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!