Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.ProjectName
 Послать отзыв
 Синтаксис
C#
Visual Basic
public String ProjectName;
Public Property ProjectName() As String
 Описание
 Обеспечивает доступ к строке заголовка переменной PROJECTNAME.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!