Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotSettings.PlotCentered
 Послать отзыв
 Свойство PlotCentered позволяет проверить, предусмотрено ли настройками данного PlotSettings центрирование на листе при печати.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool PlotCentered;
Копировать Код
Public ReadOnly Property PlotCentered As Boolean
 Возвращает
 Возвращает true, если используется центрирование при печати. В противном случае возвращает false.
 Описание
 Свойство PlotCentered позволяет проверить, предусмотрено ли настройками данного PlotSettings центрирование на листе при печати.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.PlotSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!