Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve3d.GetArea
 Послать отзыв
 Метод вычисляет площадь под кривой на заданном параметрическом интервале и с указанным допуском.
 Синтаксис
C#
Visual Basic
Копировать Код
public double GetArea( double startingParameter, double endingParameter, Tolerance tolerance );
Копировать Код
Public Function GetArea( startingParameter As Double, endingParameter As Double, tolerance As Tolerance ) As Double
 Параметры
 Параметры
 Описание
 startingParameter
 Значение параметра начальной точки интервала. Тип double.
 endingParameter
 Значение параметра конечной точки интервала (должно превышать значение startParameter). Тип double.
 tolerance
 Значение допуска. Тип double.
 Возвращает
 Возвращает площадь под кривой. Тип double.
 Описание
 Метод вычисляет площадь под кривой с указанным допуском tolerance на параметрическом интервале, который задан начальным и конечным параметрами startingParameter и endingParameter, соответственно.
 Если точки кривой, соответствующие параметрам startingParameter и endingParameter, геометрически совпадают, метод вычисляет площадь замкнутой кривой.
 Если же эти точки не совпадают, то метод соединяет их линейным сегментом и возвращает площадь со знаком между кривой и этой линией. Если на заданном параметрическом интервале прямая линия не имеет пересечений с кривой, возвращаемая площадь считается положительной. Если точки пересечения с кривой имеются, возвращаемая площадь представляет собой сумму площадей всех подобластей, ограниченных кривой и линейным сегментом. Знак площади для каждой подобласти зависит от того, проходит ли кривая выше или ниже линейного сегмента.
 Таким образом, общая площадь под кривой, возвращаемая этим методом, может быть положительной, отрицательной или даже равной нулю.
 Ссылки
 Teigha.Geometry.Curve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!