Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeader.GetFirstVertex
 Послать отзыв
 Метод позволяет определить первую вершину выносной линии с указанным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d GetFirstVertex( int leaderLineIndex );
Копировать Код
Public Function GetFirstVertex( leaderLineIndex As Integer ) As Point3d
 Параметры
 Параметры
 Описание
 leaderLineIndex
 Индекс выносной линии. Тип int.
 Возвращает
 Возвращает точку первой вершины. Тип Point3d.
 Описание
 Метод позволяет определить первую вершину выносной линии с указанным индексом.
 Ссылки
 Teigha.DatabaseServices.MLeader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!