Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Plane.Plane
 Послать отзыв
 Конструктор класса Plane. Создает плоскость, используя заданные начало координат и направляющие векторы осей.
 Синтаксис
C#
Visual Basic
Копировать Код
public Plane( Point3d origin, Vector3d u, Vector3d v );
Копировать Код
Public Sub New( origin As Point3d, u As Vector3d, v As Vector3d )
 Параметры
 Параметры
 Описание
 origin
 Начало координат. Тип Point3d.
 u
 Направляющий вектор оси uAxis. Тип Vector3d.
 v
 Направляющий вектор оси vAxis. Тип Vector3d.
 Описание
 Конструктор класса Plane. Создает плоскость, используя заданные начало координат origin и направляющие векторы осей u и v.
 Замечания
 Векторы u и v не должны быть коллинеарными.
 Ссылки
 Teigha.Geometry.Plane, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!