Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.XclipFrame
 Послать отзыв
 Синтаксис
C#
Visual Basic
public bool XclipFrame;
Public Property XclipFrame() As bool
 Описание
 Обеспечивает доступ к заголовку переменной XCLIPFRAME.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!