Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.UnderlayReference.IsClipped
 Послать отзыв
 Свойство IsClipped позволяет определить , обрезан ли по границе данный объект.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsClipped;
Копировать Код
Public Property IsClipped As Boolean
 Возвращает
 Возвращает true, если обрезка по границе применена. В противном случае возвращает false.
 Описание
 Свойство IsClipped позволяет определить , обрезан ли по границе данный объект.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.UnderlayReference, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!