Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.BoundBlock2d.IsDisjoint
 Послать отзыв
 Метод позволяет проверить, пересекается ли данная граничная рамка с указанной граничной рамкой.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsDisjoint( ref BoundBlock2d block );
Копировать Код
Public Function IsDisjoint( ByRef block As BoundBlock2d ) As Boolean
 Параметры
 Параметры
 Описание
 block
 Входная граничная рамка, пересечение с которой требуется проверить. Тип BoundBlock2d.
 Возвращает
 Возвращает true тогда и только тогда, когда указанная граничная рамка не пересекается с данной. В противном случае возвращает false.
 Описание
 Метод позволяет проверить, пересекается ли данная граничная рамка с указанной граничной рамкой.
 Ссылки
 Teigha.Geometry.BoundBlock2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!