Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.SetDataFormat
 Послать отзыв
 Метод позволяет задать формат данных для первого элемента содержимого ячейки.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetDataFormat( int row, int column, ref String format );
Копировать Код
Public virtual Sub SetDataFormat( row As Integer, column As Integer, ByRef format As String )
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 format
 Новый формат элемента содержимого ячейки, тип String.
 col
 Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
 Описание
 Метод позволяет задать формат данных для первого элемента содержимого ячейки.
 Замечания
 Для получения того же результата предпочтительнее использовать Table.Cells[row,column].DataFormat.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!