Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.UnderlayReference.Transform
 Послать отзыв
 Свойство Transform представляет матрицу преобразования данной подложки.
 Синтаксис
C#
Visual Basic
Копировать Код
public Matrix3d Transform;
Копировать Код
Public Property Transform As Matrix3d
 Возвращает
 Возвращает матрицу геометрического преобразования данного объекта. Тип Matrix3d.
 Описание
 Свойство Transform представляет матрицу преобразования данной подложки.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.UnderlayReference, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!