Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector3d.DivideBy
 Послать отзыв
 Метод реализует деление компонент данного вектора на входное вещественное значение.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d DivideBy( double value );
Копировать Код
Public Function DivideBy( value As Double ) As Vector3d
 Параметры
 Параметры
 Описание
 value
 Входное значение делителя. Тип double.
 Возвращает
 Возвращает трехмерный вектор. Тип Vector3d.
 Описание
 Метод реализует деление компонент данного вектора на входное вещественное значение value.
 Ссылки
 Teigha.Geometry.Vector3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!