Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.OpenCloseTransaction.Abort
 Послать отзыв
 Метод позволяет прервать текущую открытую транзакцию. Инициирует откат всех изменений объектов с момента начала транзакции.
 Синтаксис
C#
Visual Basic
Копировать Код
public override void Abort();
Копировать Код
Public Overrides Sub Abort()
 Описание
 Метод позволяет прервать текущую открытую транзакцию. Инициирует откат всех изменений объектов с момента начала транзакции.
 Ссылки
 Teigha.DatabaseServices.OpenCloseTransaction, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!