Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LoftedSurface.LoftOptions
 Послать отзыв
 Свойство представляет параметры лофта, используемые для управления геометрией результирующей поверхности.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.LoftOptions LoftOptions;
Копировать Код
Public Property LoftOptions As DatabaseServices.LoftOptions
 Возвращает
 Возвращает параметры лофта. Тип DatabaseServices.LoftOptions.
 Описание
 Свойство представляет параметры лофта, используемые для управления геометрией результирующей поверхности.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.LoftedSurface, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!