Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Surface.DistanceTo
 Послать отзыв
 Метод вычисляет минимальное расстояние от заданной точки до этой поверхности. Используется точность по умолчанию.
 Синтаксис
C#
Visual Basic
Копировать Код
public double DistanceTo( Point3d point );
Копировать Код
Public Function DistanceTo( point As Point3d ) As Double
 Параметры
 Параметры
 Описание
 point
 Входная точка, минимальное расстояние до которой требуется определить. Тип Point3d.
 Возвращает
 Возвращает минимальное расстояние от точки point до данной поверхности. Тип double.
 Описание
 Метод вычисляет минимальное расстояние между заданной точкой point и этой поверхностью.
 Замечания
 Используется вызов метода Surface.DistanceTo(Point3d point, Tolerance tolerance) с точностью по умолчанию Tolerance.Global.
 Ссылки
 Teigha.Geometry.Surface, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!