Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Entity.LayerId
 Послать отзыв
 Свойство предназначено для получения или установки идентификатора записи таблицы слоёв (LayerTableRecord), которая связана с текущим геометрическим объектом.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectId LayerId;
Копировать Код
Public Property LayerId() As ObjectId
 Возвращает
 Возвращает значение типа ObjectId, представляющее собой ссылку на запись таблицы слоёв, определяющую параметры слоя (цвет, тип линии, статус видимости и др.), к которому принадлежит объект.
 Описание
 Свойство предназначено для получения или установки идентификатора записи таблицы слоёв (LayerTableRecord), которая связана с текущим геометрическим объектом.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Entity, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!