Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotStyleTableChangedEventArgs.NewName
 Послать отзыв
 Свойство NewName представляет имя новой таблицы стилей печати, которую только что связали с листом, имеющим идентификатор Id.
 Синтаксис
C#
Visual Basic
Копировать Код
public String NewName;
Копировать Код
Public ReadOnly Property NewName As String
 Возвращает
 Возвращает имя таблицы стилей печати. Тип String.
 Описание
 Свойство NewName представляет имя новой таблицы стилей печати, которую только что связали с листом, имеющим идентификатор Id.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.PlotStyleTableChangedEventArgs, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!