Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotStyleTable.SetOrdering
 Послать отзыв
 Метод предназначен для сортировки записей в данной таблице.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetOrdering( ref String[] order );
Копировать Код
Public Overridable Sub SetOrdering( ByRef order() As String )
 Параметры
 Параметры
 Описание
 order
 Массив имен, определяющий новый порядок следования стилей печати в данной таблице. Тип String[].
 Описание
 Метод сортирует записи в данной таблице в указанном порядке имён стилей печати.
 Ссылки
 Teigha.DatabaseServices.PlotStyleTable, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!