Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ArcDimension.XLine2Point
 Послать отзыв
 Свойство предоставляет доступ к начальной точке второй выносной линии.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d XLine2Point;
Копировать Код
Public Property XLine2Point() As Point3d
 Возвращает
 Возвращает точку, тип Point3d.
 Описание
 Свойство позволяет получить или задать начальную точку второй выносной линии. Точка задается в мировой системе коордмнат (WCS).
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.ArcDimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!