Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.GeoDataLonLatAltInfo.Longitude
 Послать отзыв
 Свойство Longitude представляет высоту над уровнем моря в метрах.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Longitude;
Копировать Код
Public Property Longitude As Double
 Возвращает
 Возвращает высоту над уровнем моря в метрах. Тип double.
 Описание
 Свойство Longitude представляет высоту над уровнем моря в метрах.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.Geometry.GeoDataLonLatAltInfo, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!