Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.BoundBlock3d.TransformBy
 Послать отзыв
 Метод выполняет геометрическое преобразование этой граничной рамки, определяемое заданной 3D матрицей преобразования.
 Синтаксис
C#
Visual Basic
Копировать Код
public void TransformBy( Matrix3d A_0 );
Копировать Код
Public Sub TransformBy( A_0 As Matrix3d )
 Параметры
 Параметры
 Описание
 A_0
 Входная матрица преобразования. Тип Matrix3d.
 Описание
 Метод выполняет геометрическое преобразование этой граничной рамки, определяемое заданной 3D матрицей преобразования.
 Ссылки
 Teigha.Geometry.BoundBlock3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!