Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.LoftMag1
 Послать отзыв
 Синтаксис
C#
Visual Basic
public double LoftMag1;
Public Property LoftMag1() As Double
 Описание
 Возвращает или устанавливает текущее значение LOFTMAG1 для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!