Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.DimensionText
 Послать отзыв
 Свойство задает или возвращает текстовую строку, которая заменяет измеренное значение.
 Синтаксис
C#
Visual Basic
Копировать Код
public String DimensionText;
Копировать Код
Public Property DimensionText As String
 Возвращает
 Возвращает текстовую строку, которая заменяет измеренное значение. Тип String.
 Описание
 Свойство задает или возвращает текстовую строку, которая заменяет измеренное значение. Если свойство DimensionText представляет собой пустую строку, что является значением по умолчанию, размер представляет на чертеже измеренное значение.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!