Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocAction.EvaluateDependencies
 Послать отзыв
 Метод реализует перевычисление всех зависимостей данного действия, для которых IsEvaluationRequest() == true.
 Синтаксис
C#
Visual Basic
Копировать Код
public void EvaluateDependencies();
Копировать Код
Public Sub EvaluateDependencies()
 Описание
 Метод предназначен для вызова из метода AssessmentOverride() клиентского кода, обычно после того, как клиентский код в процессе проверки зависимостей обнаруживает, какие из них изменились, какие были связаны с удаленными объектами и т.п. Метод получает все зависимости данного действия и заново вычисляет те из них, для которых это необходимо, т.е. зависимости, для которых IsEvaluationRequest() == true.
 Ссылки
 Teigha.DatabaseServices.AssocAction, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!