Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CurveCurveIntersector2d.GetIntersectionParameters
 Послать отзыв
 Метод вычисляет значения параметров для каждой из кривых в точке пересечения с указанным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public double[] GetIntersectionParameters( int intersection );
Копировать Код
Public Function GetIntersectionParameters( intersection As Integer ) As Double()
 Параметры
 Параметры
 Описание
 intersection
 Индекс точки пересечения, в которой требуется вычислить параметры для пересекающихся кривых. Тип int.
 Возвращает
 Возвращает массив из двух элементов. Тип double[]. Первое значение представляет параметр для первой кривой в точке пересечения, а второе значение — параметр для второй кривой в точке пересечения.
 Описание
 Метод вычисляет значения параметров для каждой из кривых в точке пересечения с указанным индексом.
 Ссылки
 Teigha.Geometry.CurveCurveIntersector2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!