Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LoftedSurface.CreateLoftedSurface
 Послать отзыв
 Метод позволяет создать лофтом поверхность на основе заданных кривых в соответствии с переданными параметрами операции лофта.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void CreateLoftedSurface( ref Entity[] crossSections, ref Entity[] guideCurves, ref Entity pathCurve, ref DatabaseServices.LoftOptions loftOptions );
Копировать Код
Public Overridable Sub CreateLoftedSurface( ByRef crossSections() As Entity, ByRef guideCurves() As Entity, ByRef pathCurve As Entity, ByRef loftOptions As DatabaseServices.LoftOptions )
 Параметры
 Параметры
 Описание
 crossSections
 Массив поперечных сечений. Тип Entity[].
 guideCurves
 Массив направляющих. Тип Entity[].
 pathCurve
 Траектория вытягивания поверхности. Тип Entity.
 loftOptions
 Опции операции лофта. Тип DatabaseServices.LoftOptions. Эти опции оказывают влияние на геометрию получаемой поверхности.
 Описание
 Метод позволяет создать лофтом поверхность на основе заданных кривых в соответствии с переданными параметрами операции лофта.
 Профили поперечных сечений могут быть как замкнутыми, так и разомкнутыми. Когда все кривые замкнутые, этот метод принимает объект-точку в качестве первого и/или последнего элемента массива сечений crossSections.
 Всякая кривая из массива направляющих guideCurves должна начинаться на первом поперечном сечении, завершаться на последнем поперечном сечении и пересекать каждую из кривых поперечных сечений. Таким образом, кривые направляющих и кривые поперечных сечений образуют структуру, подобную сетчатой. При этом кривые направляющих и поперечных сечений располагаются на вытянутой по сечениям поверхности.
 В случае лофта по траектории используется траектория из аргумента pathCurve, а массив направляющих guideCurves должен иметь значение NULL, и наоборот, при лофте по направляющим нулевой должна быть траектория pathCurve, а массив guideCurves должен содержать какие-либо кривые направляющих. Кривая траектории не обязана ни пересекать кривые сечений, ни даже проходить вблизи них. Но, как правило, рекомендуется начинать траекторию на плоскости первого поперечного сечения и заканчивать на плоскости последнего поперечного сечения.
 Ссылки
 Teigha.DatabaseServices.LoftedSurface, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!