Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.TextHeight
 Послать отзыв
 Метод позволяет получить высоту текста в указанной ячейке таблицы.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual double TextHeight( int row, int col );
Копировать Код
Public virtual Function TextHeight( row As Integer, col As Integer ) As double
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 col
 Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
 Возвращает
 Возвращает высоту текста, double.
 Описание
 Метод позволяет получить высоту текста в указанной ячейке таблицы.
 Замечания
 Для получения того же результата предпочтительнее использовать Table.Cells[row,column].TextHeight.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!