Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство BlockReference.AnonymousBlockTableRecord
 Послать отзыв
 Синтаксис
C#
Visual Basic
public DatabaseServices::ObjectId AnonymousBlockTableRecord;
Public Property AnonymousBlockTableRecord() As DatabaseServices.ObjectId
 Описание
 Возвращает определение анонимного блока, используя динамический блок чертежа.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.BlockReference, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!