Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ResultBuffer.==
 Послать отзыв
 Оператор выполняет сравнение операндов на равенство.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool operator ==( ref ResultBuffer a, ref ResultBuffer b );
Копировать Код
Public Operator ==( ByRef a As ResultBuffer, ByRef b As ResultBuffer )
 Параметры
 Параметры
 Описание
 a
 Левый операнд, тип ResultBuffer.
 b
 Правый операнд, тип ResultBuffer.
 Возвращает
 Возвращает true, если a равно b, иначе - false.
 Описание
 Оператор выполняет сравнение операндов на равенство. Возвращает true, если a равно b, и false в противном случае.
 Ссылки
 Teigha.DatabaseServices.ResultBuffer, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!