Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Point3dCollection.Add
 Послать отзыв
 Метод добавляет точку в коллекцию и возвращает индекс вновь добавленного элемента коллекции.
 Синтаксис
C#
Visual Basic
Копировать Код
public int Add( Point3d p );
Копировать Код
Public Function Add( p As Point3d ) As Integer
 Параметры
 Параметры
 Описание
 p
 Добавляемая точка. Тип Point3d.
 Возвращает
 Возвращает отсчитываемый от нуля индекс вновь добавленного элемента коллекции. Тип int.
 Описание
 Метод добавляет точку в коллекцию. Возвращает индекс вновь добавленного элемента коллекции (индекс отсчитывается от нуля).
 Ссылки
 Teigha.Geometry.Point3dCollection, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!