Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CellRange.BackgroundColor
 Послать отзыв
 Свойство обеспечивает доступ к цвету фоновой заливки ячеек данного диапазона.
 Синтаксис
C#
Visual Basic
Копировать Код
public Colors.Color BackgroundColor;
Копировать Код
Public Property BackgroundColor As Colors.Color
 Возвращает
 Возвращает цвет фона ячеек диапазона. Тип Colors.Color.
 Описание
 Свойство обеспечивает доступ к цвету фоновой заливки ячеек данного диапазона.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.CellRange, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!