Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Column.MinimumWidth
 Послать отзыв
 Свойство MinimumWidth представляет минимально допустимую ширину столбца ячеек.
 Синтаксис
C#
Visual Basic
Копировать Код
public double MinimumWidth;
Копировать Код
Public ReadOnly Property MinimumWidth As Double
 Возвращает
 Возвращает минимальную ширину столбца ячеек. Тип double.
 Описание
 Свойство MinimumWidth представляет минимально допустимую ширину столбца ячеек.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Column, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!