Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DataLinkManager.Update
 Послать отзыв
 Метод обновляет данные для указанных внешних ссылок в данном экземпляре DataLinkManager.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Update( ref ObjectIdCollection dataIds, UpdateDirection direction, UpdateOption option );
Копировать Код
Public Sub Update( ByRef dataIds As ObjectIdCollection, direction As UpdateDirection, option As UpdateOption )
 Параметры
 Параметры
 Описание
 dataIds
 Коллекция ID обновляемых внешних ссылок. Тип ObjectIdCollection.
 direction
 Направление обновления. Тип UpdateDirection.
 option
 Опции обновления. Тип UpdateOption.
 Описание
 Метод обновляет данные для указанных внешних ссылок в данном экземпляре DataLinkManager.
 Ссылки
 Teigha.DatabaseServices.DataLinkManager, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!