Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.NurbSurface.NumberOfControlPointsInV
 Послать отзыв
 Свойство представляет количество управляющих вершин данной поверхности в направлении v.
 Синтаксис
C#
Visual Basic
Копировать Код
public int NumberOfControlPointsInV;
Копировать Код
Public ReadOnly Property NumberOfControlPointsInV As Integer
 Возвращает
 Возвращает количество управляющих вершин поверхности. Тип int.
 Описание
 Свойство представляет количество управляющих вершин данной поверхности в направлении v.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.NurbSurface, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!