Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbSurface.NumControlPointsInU
 Послать отзыв
 Свойство NumControlPointsInU представляет количество управляющих вершин в направлении U.
 Синтаксис
C#
Visual Basic
Копировать Код
public int NumControlPointsInU;
Копировать Код
Public ReadOnly Property NumControlPointsInU As Integer
 Возвращает
 Возвращает количество управляющих вершин в направлении U. Тип int.
 Описание
 Свойство NumControlPointsInU представляет количество управляющих вершин в направлении U.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.NurbSurface, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!