Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.BeginWblockSelectedObjectsEventArgs.InsertionPoint
 Послать отзыв
 Свойство возвращает точку вставки для операции Wblock.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d InsertionPoint;
Копировать Код
Public Property InsertionPoint() As Point3d
 Возвращает
 Возвращает точку вставки. Тип Point3d.
 Описание
 Свойство возвращает 3D-точку вставки для операции Wblock.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.BeginWblockSelectedObjectsEventArgs, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!