Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Interferecolor
 Послать отзыв
 Синтаксис
C#
Visual Basic
public Colors::Color Interferecolor;
Public Property Interferecolor() As Colors.Color
 Описание
 Возвращает или устанавливает цвет объектов взаимодействия, определенный в системной переменной INTERFERECOLOR для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!