Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.KnotCollection.SyncRoot
 Послать отзыв
 Свойство SyncRoot представляет объект, используемый для синхронизации доступа к данной коллекции.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual Object SyncRoot;
Копировать Код
Public Overridable ReadOnly Property SyncRoot As Object
 Возвращает
 Возвращает объект, используемый для синхронизации доступа к данной коллекции. Тип Object.
 Описание
 Свойство SyncRoot представляет объект, используемый для синхронизации доступа к данной коллекции.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.KnotCollection, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!