Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LayerStateManager.GetLayerStateNames
 Послать отзыв
 Возвращает массив с именами всех состояний слоя.
 Синтаксис
C#
Visual Basic
Копировать Код
public ArrayList GetLayerStateNames( bool bIncludeHidden, bool bIncludeXref );
Копировать Код
Public Function GetLayerStateNames( bIncludeHidden As Boolean, bIncludeXref As Boolean ) As ArrayList
 Параметры
 Параметры
 Описание
 bIncludeHidden
 Задать true, чтобы включить в массив имена скрытых состояний слоя. Тип bool.
 bIncludeXref
 Задать true для включения XRefs. Тип bool.
 Возвращает
 Возвращает массив типа ArrayList с именами всех состояний слоя.
 Описание
 Возвращает массив с именами всех состояний слоя.
 Ссылки
 Teigha.DatabaseServices.LayerStateManager, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!