Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.SurfaceSurfaceIntersectorConfiguration
 Послать отзыв
 Перечисление SurfaceSurfaceIntersectorConfiguration определяет конфигурации окрестности поверхности, расположенной слева или справа от кривой пересечения двух поверхностей, по отношению к второй поверхности.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum SurfaceSurfaceIntersectorConfiguration { Unknown = 0, Out = 1, In = 2, Coincident = 3 }
Копировать Код
Public Enum SurfaceSurfaceIntersectorConfiguration Unknown = 0 Out = 1 In = 2 Coincident = 3 End Enum
 Члены
 Члены
 Описание
 Unknown
 Значение: 0. Конфигурация окрестности неизвестна.
 Out
 Значение: 1. Окрестность находится с внешней стороны другой поверхности.
 In
 Значение: 2. Окрестность находится с внутренней стороны другой поверхности.
 Coincident
 Значение: 3. Ненулевая площадь пересечения двух поверхностей.
 Описание
 Перечисление SurfaceSurfaceIntersectorConfiguration определяет конфигурации окрестности поверхности, расположенной слева или справа от кривой пересечения двух поверхностей, по отношению к второй поверхности.
 Положение "внутри" или "снаружи" означает, что окрестность находится с внутренней или с наружной стороны второй поверхности, что определяется ориентацией вектора нормали второй поверхности. Положение окрестности поверхности слева и справа от кривой на поверхности определяется с учетом ориентации вектора нормали поверхности и направления параметризации кривой.
 Ваши комментарии по поводу этого топика: Послать отзыв!