Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.EllipticalArc3d.EndAngle
 Послать отзыв
 Свойство EndAngle представляет конечный угол данной эллиптической дуги.
 Синтаксис
C#
Visual Basic
Копировать Код
public double EndAngle;
Копировать Код
Public ReadOnly Property EndAngle As Double
 Возвращает
 Возвращает конечный угол эллиптической дуги. Тип double.
 Описание
 Свойство EndAngle представляет конечный угол данной эллиптической дуги.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.EllipticalArc3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!