Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Ray.UnitDir
 Послать отзыв
 Свойство UnitDir представляет 3D-вектор, определяющий направление данного луча.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d UnitDir;
Копировать Код
Public Property UnitDir As Vector3d
 Возвращает
 Возвращает 3D-вектор для направления луча. Тип Vector3d.
 Описание
 Свойство UnitDir представляет 3D-вектор, определяющий направление данного луча.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Ray, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!