Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SymbolUtilityServices.GetRegAppAcadId
 Послать отзыв
 Метод позволяет получить идентификатор объекта зарегистрированного приложения "ACAD" из указанной базы данных.
 Синтаксис
C#
Visual Basic
Копировать Код
public static ObjectId GetRegAppAcadId( ref Database databasePointer );
Копировать Код
Public Shared Function GetRegAppAcadId( ByRef databasePointer As Database ) As ObjectId
 Параметры
 Параметры
 Описание
 databasePointer
 База данных, из которой извлекается идентификатор объекта. Тип Database.
 Возвращает
 Возвращает идентификатор RegApp-объекта "ACAD". Тип ObjectId.
 Описание
 Метод позволяет получить идентификатор объекта зарегистрированного приложения "ACAD" из указанной базы данных.
 Ссылки
 Teigha.DatabaseServices.SymbolUtilityServices, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!