Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve2d.GetLength
 Послать отзыв
 Метод вычисляет длину кривой на заданном параметрическом интервале с точностью по умолчанию.
 Синтаксис
C#
Visual Basic
Копировать Код
public double GetLength( double fromParameter, double toParameter );
Копировать Код
Public Function GetLength( fromParameter As Double, toParameter As Double ) As Double
 Параметры
 Параметры
 Описание
 fromParameter
 Значение параметра в начальной точке интервала. Тип double.
 toParameter
 Значение параметра в конечной точке интервала. Тип double.
 Возвращает
 Возвращает длину кривой на заданном параметрическом интервале. Тип double.
 Описание
 Метод вычисляет длину вдоль кривой между двумя точками, которые определяются заданным параметрическим интервалом. Используется вызов метода Curve2d.GetLength(Double fromParameter, Double toParameter, Tolerance tolerance) со значением точности по умолчанию, равным Tolerance.Global.
 Ссылки
 Teigha.Geometry.Curve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!