Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DecomposeForSaveReplacementRecord.ReplacementId
 Послать отзыв
 Свойство ReplacementId предоставляет идентификатор нерезидентного замещающего объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.ObjectId ReplacementId;
Копировать Код
Public ReadOnly Property ReplacementId As DatabaseServices.ObjectId
 Возвращает
 Возвращает идентификатор нерезидентного замещающего объекта. Тип DatabaseServices.ObjectId.
 Описание
 Свойство ReplacementId предоставляет идентификатор нерезидентного замещающего объекта.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.DecomposeForSaveReplacementRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!