Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DxfFiler.AtExtendedData
 Послать отзыв
 Свойство позволяет определить, находится ли этот объект Filer в начале расширенных данных xdata объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract bool AtExtendedData;
Копировать Код
Public MustOverride ReadOnly Property AtExtendedData As Boolean
 Возвращает
 Возвращает true, если Filer находится в начале расширенных данных (xdata) объекта. В противном случае возвращает false.
 Описание
 Свойство позволяет определить, находится ли этот объект Filer в начале расширенных данных xdata объекта.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.DxfFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!