Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CircularArc2d.SetToComplement
 Послать отзыв
 Метод позволяет изменить направление данной дуги при сохранении ее конечных точек.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetToComplement();
Копировать Код
Public Sub SetToComplement()
 Описание
 Метод позволяет переопределить данную дугу, изменив ее направление при сохранении конечных точек.
 Ссылки
 Teigha.Geometry.CircularArc2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!