Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LayerStateMasks
 Послать отзыв
 Перечисление LayerStateMasks определяет биты, используемые для указания атрибутов слоя.
 Синтаксис
C#
Visual Basic
Копировать Код
enum LayerStateMasks { Color = &H20, CurrentViewport = &H200, Frozen = 2, LastRestored = &H10000, LineType = &H40, LineWeight = &H80, Locked = 4, NewViewport = &H10, None = 0, On = 1, Plot = 8, PlotStyle = &H100, Transparency = &H400 }
Копировать Код
Public Enum LayerStateMasks Color = &H20 CurrentViewport = &H200 Frozen = 2 LastRestored = &H10000 LineType = &H40 LineWeight = &H80 Locked = 4 NewViewport = &H10 None = 0 On = 1 Plot = 8 PlotStyle = &H100 Transparency = &H400 End Enum
 Члены
 Члены
 Описание
 None
 Ограничения отсутствуют. None = 0.
 On
 Делает слой видимым. On = 1.
 Frozen
 Замораживает слой (нет регенерации, нет печати, нет рендеринга). Frozen = 2.
 Locked
 Блокировка слоя (подавляется выделение и редактирование). Locked = 4.
 Plot
 Разрешается вывод слоя на печать. Plot = 8.
 NewViewport
 Добавляет слой в новые видовые экраны. NewViewport = 0x10.
 Color
 Разрешается изменение цвета. Color = 0x20.
 LineType
 Разрешается изменение типа линий. LineType = 0x40.
 LineWeight
 Разрешается изменение веса линий. LineWeight = 0x80.
 PlotStyle
 Разрешается изменение стиля печати. PlotStyle = 0x100.
 CurrentViewport
 Указывает настройки пользователя относительно того, следует ли восстанавливать текущие настройки VPLAYER видового экрана во время операции восстановления состояния слоя. CurrentViewport = 0x200.
 Transparency
 Разрешается изменение прозрачности. Transparency = 0x400.
 LastRestored
 Слой является последним из восстановленных. LastRestored = 0x10000.
 Описание
 Перечисление LayerStateMasks определяет биты, используемые для указания атрибутов слоя.
 Ваши комментарии по поводу этого топика: Послать отзыв!