Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector2dCollection.Contains
 Послать отзыв
 Метод позволяет определить, является ли указанный объект Vector2d членом данной коллекции.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool Contains( Vector2d value );
Копировать Код
Public Function Contains( value As Vector2d ) As Boolean
 Параметры
 Параметры
 Описание
 value
 Входной проверяемый объект. Тип Vector2d.
 Возвращает
 Возвращает true, если объект value присутствует в коллекции. В противном случае возвращает false.
 Описание
 Метод позволяет определить, является ли указанный объект Vector2d членом данной коллекции.
 Ссылки
 Teigha.Geometry.Vector2dCollection, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!