Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocArrayRectangularParameters.ColumnSpacing
 Послать отзыв
 Свойство обеспечивает доступ к расстоянию между соседними столбцами массива.
 Синтаксис
C#
Visual Basic
Копировать Код
public double ColumnSpacing;
Копировать Код
Public Property ColumnSpacing() As Double
 Возвращает
 Возвращает расстояние между соседними столбцами массива. Тип double.
 Описание
 Свойство обеспечивает доступ к расстоянию между соседними столбцами массива.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.AssocArrayRectangularParameters, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!