Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.SetToolTip
 Послать отзыв
 Метод позволяет задать строку всплывающей подсказки для ячейки, строки или столбца.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetToolTip( int row, int column, ref String toolTip );
Копировать Код
Public virtual Sub SetToolTip( row As Integer, column As Integer, ByRef toolTip As String )
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс может равняться -1.
 toolTip
 Текст всплывающей подсказки, тип String.
 col
 Индекс столбца, тип int. Индекс может равняться -1.
 Описание
 Метод позволяет задать строку всплывающей подсказки для ячейки, строки или столбца.
 Чтобы задать ячейку, следует указать допустимые индексы строки и столбца. Чтобы задать строку, следует указать допустимый индекс строки и -1 в качестве индекса столбца. Чтобы задать столбец, следует указать допустимый индекс столбца и -1 в качестве индекса строки.
 Замечания
 Для получения того же результата предпочтительнее использовать Table.Cells[row,column].Contents[i].TextStyleId.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!