Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.SetFormat
 Послать отзыв
 Метод позволяет задать формат в ячейках строки указанного типа.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetFormat( ref String pFormat, int rowTypes );
Копировать Код
Public virtual Sub SetFormat( ByRef pFormat As String, rowTypes As Integer )
 Параметры
 Параметры
 Описание
 pFormat
 Имя формата. Тип String.
 rowTypes
 Тип строки объекта Table, int. См. перечисление RowType.
 Описание
 Метод позволяет задать формат в ячейках строки указанного типа.
 Замечания
 Метод не реализован. Используйте метод Table.Cells[row,column].DataFormat.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!