Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Group.SetColor
 Послать отзыв
 Метод позволяет назначить новый цвет всем объектам данной группы.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetColor( ref Color color );
Копировать Код
Public Sub SetColor( ByRef color As Color )
 Параметры
 Параметры
 Описание
 color
 Новое значение цвета для объектов группы. Тип Color.
 Описание
 Метод позволяет назначить новый цвет всем объектам данной группы.
 Ссылки
 Teigha.DatabaseServices.Group, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!