Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Entity.MoveGripPointsAt(IntPtr[]
 Послать отзыв
 Метод применяет смещение, заданное вектором offset, к одной или нескольким ручкам объекта, выбранным из коллекции appData.
 Синтаксис
C#
Visual Basic
Копировать Код
public void MoveGripPointsAt(IntPtr[] appData, Vector3d offset, MoveGripPointsFlags bitFlags);
Копировать Код
Public Sub MoveGripPointsAt(appData As IntPtr[], offset As Vector3d, bitFlags As MoveGripPointsFlags)
 Параметры
 Параметры
 Описание
 appData
 Коллекция ручек, к которым применяется смещение. Каждый элемент должен содержать данные приложения, связанные с ручками объекта. Тип IntPtr[]
 offset
 Вектор смещения в мировых координатах (WCS), определяющий направление и величину перемещения. Тип Vector3d
 bitFlags
 Битовая маска флагов из перечисления MoveGripPointsFlags, управляющая поведением перемещения ручек. Тип MoveGripPointsFlags
 Описание
 Метод предназначен для применения векторного смещения к одной или нескольким ручкам (grip points) геометрического объекта. Ручки представляют собой характерные точки объекта, используемые при его интерактивном редактировании — например, перемещении, растяжении или повороте.
 Метод применяет указанное смещение только к тем ручкам, которые переданы в коллекции appData. Это позволяет гибко управлять поведением объекта при редактировании — например, перемещать только определённые части сложного объекта, оставляя остальные без изменений.
 Работа метода тесно связана с реализацией метода GetGripPoints(), поскольку именно он определяет, какие точки объекта доступны для редактирования как ручки, и какая информация приложения ассоциирована с каждой из них.
 Этот метод может быть вызван как часть процесса интерактивного редактирования объекта в среде nanoCAD (например, при использовании команд MOVE, STRETCH и др.), а также из пользовательских приложений, если требуется программно модифицировать положение ручек объекта.
 Ссылки
 Teigha.DatabaseServices.Entity, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!