Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SubDMesh.NumberOfSubDividedVertices
 Послать отзыв
 Свойство предоставляет доступ к количеству вершин с текущей степенью сглаженности.
 Синтаксис
C#
Visual Basic
Копировать Код
public int NumberOfSubDividedVertices;
Копировать Код
Public Property NumberOfSubDividedVertices() As Integer
 Возвращает
 Возвращает количество вершин, int.
 Описание
 Свойство предоставляет доступ к количеству вершин с текущей степенью сглаженности.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.SubDMesh, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!