Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ObjectContextManager.UnregisterContextCollection
 Послать отзыв
 Метод предназначен для отмены регистрации коллекции контекстов в данном менеджере контекстов.
 Синтаксис
C#
Visual Basic
Копировать Код
public void UnregisterContextCollection( ref String collectionName );
Копировать Код
Public Sub UnregisterContextCollection( ByRef collectionName As String )
 Параметры
 Параметры
 Описание
 collectionName
 Имя коллекции контекстов. Тип String.
 Описание
 Метод предназначен для отмены регистрации коллекции контекстов в данном менеджере контекстов.
 Ссылки
 Teigha.DatabaseServices.ObjectContextManager, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!