Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.RenderGlobal
 Послать отзыв
 Класс RenderGlobal служит контейнером для всех глобальных свойств рендеринга.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::GraphicsInterface::Drawable Teigha::DatabaseServices::DBObject Teigha::DatabaseServices::RenderGlobal
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("AcDbRenderGlobal")] public class RenderGlobal : DBObject
Копировать Код
<Wrapper("AcDbRenderGlobal")> Public Class RenderGlobal Inherits DBObject
 Описание
 Класс RenderGlobal служит контейнером для всех глобальных свойств рендеринга. Резидентные объекты RenderGlobal базы данных хранятся в словаре NamedObjectsDictionary в разделе ACAD_RENDER_GLOBAL.
 Методы
 Конструкторы
 Teigha.GraphicsInterface.Drawable
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 Drawable
 Конструктор класса Teigha.GraphicsInterface.Drawable. (Унаследован от Drawable)
 Teigha.DatabaseServices.DBObject
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 DBObject
 Конструктор. (Унаследован от DBObject)
 Teigha.DatabaseServices.RenderGlobal
 Имя
 Описание
 RenderGlobal
 Конструктор по умолчанию класса RenderGlobal.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.GraphicsInterface.Drawable
 Имя
 Описание
 Drawable Методы
 Ниже перечислены методы класса Drawable.
 Drawable Свойства
 Ниже перечислены свойства класса Drawable.
 Teigha.DatabaseServices.DBObject
 Имя
 Описание
 DBObject Методы
 Ниже перечислены методы класса DBObject.
 DBObject Свойства
 Ниже перечислены свойства класса DBObject.
 DBObject События
 Ниже перечислены события класса DBObject.
 Teigha.DatabaseServices.RenderGlobal
 Имя
 Описание
 RenderGlobal Классы
 Ниже перечислены классы класса RenderGlobal.
 RenderGlobal Перечисления
 Ниже перечислены перечисления класса RenderGlobal.
 RenderGlobal Свойства
 Ниже перечислены свойства класса RenderGlobal.
 Ссылки
 RenderGlobal Классы, RenderGlobal Перечисления, RenderGlobal Свойства, Методы, Топики, RenderGlobal Классы, RenderGlobal Перечисления, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства, DBObject События
 Ваши комментарии по поводу этого топика: Послать отзыв!