Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Hatch.GetAssociatedObjectIdsAt
 Послать отзыв
 Синтаксис
C#
Visual Basic
public ObjectIdCollection GetAssociatedObjectIdsAt(int loopIndex);
Public Function GetAssociatedObjectIdsAt(loopIndex As Integer) As ObjectIdCollection
 Параметры
 Параметры
 Описание
 loopIndex
 Индекс для определения выбранной петли контура
 Описание
 Метод возвращает все Id объектов исходных контуров, ассоциированных с выбранной петлей контура.
 Ссылки
 Teigha.DatabaseServices.Hatch, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!