Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CellProperties
 Послать отзыв
 Перечисление CellProperties определяет свойства ячейки.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum CellProperties { Invalid = 0, DataType = 1, DataFormat = 2, Rotation = 4, Scale = 8, Alignment = 16, ContentColor = 32, TextStyle = 64, TextHeight = 128, AutoScale = 256, BackgroundColor = 512, MarginLeft = 1024, MarginTop = 2048, MarginRight = 4096, MarginBottom = 8192, ContentLayout = 16384, MergeAll = 32768, FlowDirBtoT = 65536, MarginHorzSpacing = 131072, MarginVertSpacing = 262144 }
Копировать Код
Public Enum CellProperties Invalid = 0 DataType = 1 DataFormat = 2 Rotation = 4 Scale = 8 Alignment = 16 ContentColor = 32 TextStyle = 64 TextHeight = 128 AutoScale = 256 BackgroundColor = 512 MarginLeft = 1024 MarginTop = 2048 MarginRight = 4096 MarginBottom = 8192 ContentLayout = 16384 MergeAll = 32768 FlowDirBtoT = 65536 MarginHorzSpacing = 131072 MarginVertSpacing = 262144 End Enum
 Члены
 Члены
 Описание
 Invalid
 Значение: 0. Недействительное свойство.
 DataType
 Значение: 1. Тип данных.
 DataFormat
 Значение: 2. Формат данных.
 Rotation
 Значение: 4. Вращение.
 Scale
 Значение: 8. Масштаб.
 Alignment
 Значение: 16 = 0x10. Выравнивание.
 ContentColor
 Значение: 32 = 0x20. Цвет содержимого ячейки.
 TextStyle
 Значение: 64 = 0x40. Текстовый стиль.
 TextHeight
 Значение: 128 = 0x80. Высота текстовых символов.
 AutoScale
 Значение: 256 = 0x100. Автоматический масштаб.
 BackgroundColor
 Значение: 512 = 0x200. Фоновый цвет.
 MarginLeft
 Значение: 1024 = 0x400. Поле слева.
 MarginTop
 Значение: 2048 = 0x800. Поле сверху.
 MarginRight
 Значение: 4096t = 0x1000. Поле справа.
 MarginBottom
 Значение: 8192 = 0x2000. Поле снизу.
 ContentLayout
 Значение: 16384 = 0x4000. Макет содержимого ячейки.
 MergeAll
 Значение: 32768 = 0x8000. Флаг объединения всех ячеек.
 FlowDirBtoT
 Значение: 65536 = 0x10000. Направление, в котором располагаются данные таблицы.
 MarginHorzSpacing
 Значение: 131072 = 0x20000. Горизонтальный просвет между ячейками.
 MarginVertSpacing
 Значение: 262144 = 0x40000. Вертикальный просвет между ячейками.
 Описание
 Перечисление CellProperties определяет свойства ячейки.
 Ваши комментарии по поводу этого топика: Послать отзыв!