Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Database.GetDimensionStyleParentId
 Послать отзыв
 Синтаксис
C#
Visual Basic
public ObjectId GetDimensionStyleParentId(ObjectId childStyle);
Public Function GetDimensionStyleParentId(childStyle As ObjectId) As ObjectId
 Параметры
 Параметры
 Описание
 childStyle
 Id размерного стиля потомка
 Описание
 Получив Id размерного стиля потомка, функция возвращает Id размерного стиля родителя. Если родитель не доступен, возвращается Id размерного стиля потомка.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!