Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.PlanarEntity.IsCoplanarTo
 Послать отзыв
 Метод позволяет проверить, являются ли данный объект и указанная плоская поверхность компланарными в пределах заданной точности.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsCoplanarTo( ref PlanarEntity otherPlanarEntity, Tolerance tolerance );
Копировать Код
Public Function IsCoplanarTo( ByRef otherPlanarEntity As PlanarEntity, tolerance As Tolerance ) As Boolean
 Параметры
 Параметры
 Описание
 otherPlanarEntity
 Проверяемый входной плоский объект. Тип PlanarEntity.
 tolerance
 Заданная геометрическая точность. Тип Tolerance.
 Возвращает
 Возвращает true, если в пределах точности tolerance проверяемые плоские объекты можно считать компланарными. В противном случае возвращает false.
 Описание
 Метод позволяет проверить, являются ли данный объект и плоская поверхность otherPlanarEntity компланарными в пределах точности tolerance.
 Ссылки
 Teigha.Geometry.PlanarEntity, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!