Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FileDependencyManager.EraseEntry
 Послать отзыв
 Метод удаляет запись для указанного элемента из указанного файла из раздела .dwg списка файловых зависимостей.
 Синтаксис
C#
Visual Basic
Копировать Код
public void EraseEntry( ref String feature, ref String fullFileName, bool forceRemove );
Копировать Код
Public Sub EraseEntry( ByRef feature As String, ByRef fullFileName As String, forceRemove As Boolean )
 Параметры
 Параметры
 Описание
 feature
 Имя приложения или функции, создавших запись. Тип String.
 fullFileName
 Полное имя файла. Тип String.
 forceRemove
 Флаг, который определяет, следует ли принудительно удалять запись независимо от значения счетчика ссылок на запись. Тип bool.
 Описание
 Метод удаляет из раздела .dwg списка файловых зависимостей запись, которая была создана указанным приложением или функцией.
 Замечания
 Указанная запись удаляется, если счетчик ссылок на запись равен 1, или если аргумент forceRemove имеет значение true. В противном случае этот метод просто уменьшает счетчик ссылок на единицу.
 Ссылки
 Teigha.DatabaseServices.FileDependencyManager, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!