Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Leader.AnnoType
 Послать отзыв
 Синтаксис
C#
Visual Basic
public AnnotationType AnnoType;
Public Property AnnoType() As AnnotationType
 Описание
 Возвращает тип аннотации выноски.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.Leader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!