Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector2dCollectionEnumerator.MoveNext
 Послать отзыв
 Метод реализует переход перечислителя к следующему элементу в коллекции.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual bool MoveNext();
Копировать Код
Public Overridable Function MoveNext() As Boolean
 Возвращает
 Возвращает true, если текущий элемент перечислителя находится в коллекции (его индекс не превышает количество элементов коллекции). В случае выхода за границы коллекции возвращает false.
 Описание
 Метод реализует переход перечислителя к следующему элементу в коллекции.
 Ссылки
 Teigha.Geometry.Vector2dCollectionEnumerator, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!