Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SymbolUtilityServices.GetBlockPaperSpaceId
 Послать отзыв
 Метод извлекает идентификатор пространства листа в таблице предопределенных символов из указанной базы данных.
 Синтаксис
C#
Visual Basic
Копировать Код
public static ObjectId GetBlockPaperSpaceId( ref Database databasePointer );
Копировать Код
Public Shared Function GetBlockPaperSpaceId( ByRef databasePointer As Database ) As ObjectId
 Параметры
 Параметры
 Описание
 databasePointer
 База данных, из которой извлекается идентификатор объекта. Тип Database.
 Возвращает
 Возвращает ненулевой идентификатор, представляющий пространство листа в указанной базе данных. Тип ObjectId.
 Описание
 Метод извлекает идентификатор пространства листа в таблице предопределенных символов из указанной базы данных.
 Ссылки
 Teigha.DatabaseServices.SymbolUtilityServices, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!