Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocArrayRectangularParameters.GetColumnCount
 Послать отзыв
 Метод позволяет получить количество столбцов в массиве.
 Синтаксис
C#
Visual Basic
Копировать Код
public int GetColumnCount( out String expression, out String evaluatorId );
Копировать Код
Public Function GetColumnCount( ByRef expression As String, ByRef evaluatorId As String ) As Integer
 Параметры
 Параметры
 Описание
 expression
 Выражение для параметра. Тип String. Строка может быть пустой.
 evaluatorId
 Строковое представление идентификатора вычислителя. Тип String. Строка может быть пустой.
 Возвращает
 Возвращает количество столбцов в массиве. Тип int.
 Описание
 Метод позволяет получить количество столбцов в массиве.
 Если для параметра выражение отсутствует, то после выполнения метода строки expression и evaluatorId остаются пустыми.
 Ссылки
 Teigha.DatabaseServices.AssocArrayRectangularParameters, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!