Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector3d.IsPerpendicularTo
 Послать отзыв
 Метод проверяет перпендикулярность данного вектора входному вектору.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsPerpendicularTo( Vector3d vector );
Копировать Код
Public Function IsPerpendicularTo( vector As Vector3d ) As Boolean
 Параметры
 Параметры
 Описание
 vector
 Входной вектор для сравнения. Тип Vector3d.
 Возвращает
 В случае перпендикулярности векторов возвращает true. В противном случае возвращает false.
 Описание
 Метод позволяет проверить перпендикулярность данного вектора входному вектору vector.
 Реализация использует вызов метода Vector3d.IsPerpendicularTo(Vector3d vector, Tolerance tolerance) со значением аргумента tolerance, равным Tolerance.Global. Метод возвращает true, если это условие выполнено, и false в противном случае.
 Ссылки
 Teigha.Geometry.Vector3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!