Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbCurve2d.NurbCurve2d
 Послать отзыв
 Конструктор класса NurbCurve2d. Создает двумерную кривую, которая интерполирует заданный массив определяющих 2D-точек с заданной точностью и опционально использует указанные производные в начальной и конечной точках.
 Синтаксис
C#
Visual Basic
Копировать Код
public NurbCurve2d( ref Point2dCollection fitPoints, Vector2d startTangent, Vector2d endTangent, bool startTangentDefined, bool endTangentDefined, Tolerance fitTolerance );
Копировать Код
Public Sub New( ByRef fitPoints As Point2dCollection, startTangent As Vector2d, endTangent As Vector2d, startTangentDefined As Boolean, endTangentDefined As Boolean, fitTolerance As Tolerance )
 Параметры
 Параметры
 Описание
 fitPoints
 Массив определяющих точек для интерполирующей кривой. Тип Point2dCollection.
 startTangent
 Вектор касательной в начальной точке. Тип Vector2d.
 endTangent
 Вектор касательной в конечной точке. Тип Vector2d.
 startTangentDefined
 Флаг, который указывает, что следует использовать аргумент startTangent. Тип bool.
 endTangentDefined
 Флаг, который указывает, что следует использовать аргумент endTangent. Тип bool.
 fitTolerance
 Заданная точность интерполяции. Тип Tolerance.
 Описание
 Конструктор класса NurbCurve2d. Создает двумерную кривую, которая интерполирует заданный массив определяющих 2D-точек с заданной точностью и опционально использует указанные производные в начальной и конечной точках.
 Замечания
 Если флаг startTangentDefined равен false, аргумент startTangent игнорируется, а вектор касательной в начальной точке вычисляется конструктором. Соответственно, если флаг endTangentDefined равен false, то игнорируется аргумент endTangent, а вектор касательной в конечной точке вычисляется конструктором.
 Ссылки
 Teigha.Geometry.NurbCurve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!