Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Ellipse.EndAngle
 Послать отзыв
 Свойство EndAngle предоставляет доступ к конечному углу эллипса или эллиптической дуги в радианах.
 Синтаксис
C#
Visual Basic
Копировать Код
public double EndAngle;
Копировать Код
Public Property EndAngle As Double
 Возвращает
 Возвращает конечный угол. Тип double.
 Описание
 Свойство EndAngle предоставляет доступ к конечному углу эллипса или эллиптической дуги в радианах.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Ellipse, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!