Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LinkedTableData.GetValue
 Послать отзыв
 Метод позволяет получить значение первого элемента содержимого указанной ячейки таблицы.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual Object GetValue( int row, int column );
Копировать Код
Public Overridable Function GetValue( row As Integer, column As Integer ) As Object
 Параметры
 Параметры
 Описание
 row
 Индекс строки. Тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 column
 Индекс столбца. Тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице.
 Возвращает
 Возвращает объект элемента содержимого ячейки. Тип Object.
 Описание
 Метод позволяет получить значение первого элемента содержимого указанной ячейки таблицы.
 Ссылки
 Teigha.DatabaseServices.LinkedTableData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!