Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.TextString
 Послать отзыв
 Метод позволяет получить форматированную текстовую строку содержимого ячейки.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual String TextString( int row, int col, FormatOption nOption );
Копировать Код
Public virtual Function TextString( row As Integer, col As Integer, nOption As FormatOption ) As String
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 col
 Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
 nOption
 Опции форматирования из перечисления Teigha.DatabaseServices.FormatOption.
 Возвращает
 Возвращает форматированную строку, тип String.
 Описание
 Данный метод позволяет получить форматированную текстовую строку содержимого ячейки.
 Метод получает значение объекта в виде строки в определенном формате. Для форматирования строки он использует строку формата, хранящуюся в самом объекте. Аргумент nOption передает в метод опциональные флаги для управления форматированием.
 Используются следующие флаги.
FormatOptionNone: Выполняется форматирование по умолчанию. Отформатированную строку можно использовать для отображения на экране.
ForEditing: Метод форматирует значения таким образом, чтобы его возможно было использовать для редактирования. Он форматирует значение с максимальной точностью, даже если в формате, установленном в значении, явно установлена конкретная точность.
ForExpression: Метод форматирует значение таким образом, чтобы его можно было использовать в выражениях. Он форматирует значение с максимальной точностью, даже если в формате, установленном в значении, явно установлена конкретная точность.
UseMaximumPrecision: Для значения используется максимальная точность.
IgnoreMtextFormat: Код форматирования многострочного текста (Mtext) не включается в отформатированный текст.
 Замечания
 Для получения того же результата предпочтительнее использовать Table.Cells[row,column].TextString.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!