Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.UnderlayItemCollection.GetEnumerator
 Послать отзыв
 Метод позволяет получить перечислитель данной коллекции.
 Синтаксис
C#
Visual Basic
Копировать Код
public Collections.IEnumerator GetEnumerator();
Копировать Код
Public Function GetEnumerator() As Collections.IEnumerator
 Возвращает
 Возвращает перечислитель коллекции. Тип Collections.IEnumerator.
 Описание
 Метод позволяет получить перечислитель данной коллекции.
 Ссылки
 Teigha.DatabaseServices.UnderlayItemCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!