Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.SetMargin
 Послать отзыв
 Метод позволяет задать поля (расстояния между границами и содержимым) для ячеек, строк или столбцов.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetMargin( int row, int column, CellMargins margin, double value );
Копировать Код
Public virtual Sub SetMargin( row As Integer, column As Integer, margin As CellMargins, value As double )
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс может равняться -1.
 margin
 Тип поля (Top, Left, Bottom, Right) из перечисления Teigha.DatabaseServices.CellMargins.
 value
 Размер поля, double.
 col
 Индекс столбца, тип int. Индекс может равняться -1.
 Описание
 Метод позволяет задать поля (расстояния между границами и содержимым) для ячеек, строк или столбцов.
 Чтобы указать ячейку, следует задать допустимые индексы строки и столбца. Чтобы указать строку, следует задать допустимый индекс строки и -1 в качестве индекса столбца. Чтобы указать столбец, следует задать допустимый индекс столбца и -1 в качестве индекса строки.
 Замечания
 Для получения того же результата предпочтительнее использовать Table.Cells[row,column].{Top,Bottom,Left,Right}Edge.Margin.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!