Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Entity.Thickness
 Послать отзыв
 Свойство предназначено для получения или установки толщины точки, которая определяет её размер вдоль направления вектора нормали (направления "вытеснения").
 Синтаксис
C#
Visual Basic
Копировать Код
public double Thickness;
Копировать Код
Public Property Thickness() As Double
 Возвращает
 Возвращает значение типа double, представляющее текущую толщину точки.
 Описание
 Возвращает или задает значение толщины точки. Толщина определяет размер точки по вдоль направления вектора нормали (иногда называется направлением "вытеснения").
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.DBPoint, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!