Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.CanDeleteRows
 Послать отзыв
 Данный метод проверяет, можно ли удалить строку, заданную ее индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual bool CanDeleteRows( int index, int nCount );
Копировать Код
Public virtual Function CanDeleteRows( index As Integer, nCount As Integer ) As Boolean
 Параметры
 Параметры
 Описание
 index
 Индекс предполагаемой к удалению строки. Тип int.
 nCount
 Количество предполагаемых к удалению строк. Тип int.
 Возвращает
 Возвращает true, если удаление возможно, и false в противном случае.
 Описание
 Данный метод проверяет, можно ли удалить строку, заданную ее индексом.
 Замечания
 Для получения того же результата предпочтительнее использовать CellRange.CanDeleteRows.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!