Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.ExternalSurface.IsOwnerOfSurface
 Послать отзыв
 Свойство IsOwnerOfCurve позволяет убедиться, что данный объект является владельцем данных своего определения.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsOwnerOfSurface;
Копировать Код
Public ReadOnly Property IsOwnerOfSurface As Boolean
 Возвращает
 Возвращает true, если данный объект является владельцем данных своего определения. В противном случае возвращает false.
 Описание
 Свойство IsOwnerOfCurve позволяет убедиться, что данный объект является владельцем данных своего определения.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.ExternalSurface, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!