Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Plane.GetSignedDistanceTo
 Послать отзыв
 Метод вычисляет расстояние со знаком от данной плоскости до указанной точки.
 Синтаксис
C#
Visual Basic
Копировать Код
public double GetSignedDistanceTo( Point3d pointValue );
Копировать Код
Public Function GetSignedDistanceTo( pointValue As Point3d ) As Double
 Параметры
 Параметры
 Описание
 pointValue
 Входная точка, расстояние до которой от плоскости требуется определить. Тип Point3d.
 Возвращает
 Возвращает расстояние со знаком от данной плоскости до точки pointValue. Тип double.
 Описание
 Метод вычисляет расстояние со знаком от данной плоскости до точки pointValue. Знак результата определяется знаком скалярного произведения вектора нормали плоскости на вектор, построенный из начала координат плоскости в точку pointValue.
 Ссылки
 Teigha.Geometry.Plane, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!