Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbCurve3d.NurbCurve3d
 Послать отзыв
 Конструктор класса NurbCurve3d. Создает экземпляр класса с указанными параметрами.
 Синтаксис
C#
Visual Basic
Копировать Код
public NurbCurve3d( ref Point3dCollection fitPoints, ref Vector3dCollection fitTangents, Tolerance fitTolerance, bool periodic );
Копировать Код
Public Sub New( ByRef fitPoints As Point3dCollection, ByRef fitTangents As Vector3dCollection, fitTolerance As Tolerance, periodic As Boolean )
 Параметры
 Параметры
 Описание
 fitPoints
 Массив определяющих точек для интерполирующей кривой. Тип Point3dCollection.
 fitTangents
 Векторы, интерполирующие производные кривой в определяющих точках. Тип Vector3dCollection.
 fitTolerance
 Заданная точность интерполяции. Тип Tolerance. Ограничивает максимальное отклонение интерполирующей кривой от определяющих точек.
 periodic
 Флаг, определяющий, должна ли создаваемая кривая быть периодической (замкнутой). Тип bool.
 Описание
 Конструктор класса NurbCurve3d. Создает экземпляр класса с указанными параметрами.
 Ссылки
 Teigha.Geometry.NurbCurve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!