Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.EllipticalArc2d.Set
 Послать отзыв
 Метод позволяет переопределить данный объект, используя указанные центр, оси, радиусы, а также начальный и конечный углы.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Set( Point2d center, Vector2d majorAxis, Vector2d minorAxis, double majorRadius, double minorRadius, double startAngle, double endAngle );
Копировать Код
Public Sub Set( center As Point2d, majorAxis As Vector2d, minorAxis As Vector2d, majorRadius As Double, minorRadius As Double, startAngle As Double, endAngle As Double )
 Параметры
 Параметры
 Описание
 center
 Центр эллипса. Тип Point2d.
 majorAxis
 Большая ось эллипса. Тип Vector2d.
 minorAxis
 Малая ось эллипса. Тип Vector2d.
 majorRadius
 Большой радиус эллипса. Тип double.
 minorRadius
 Малый радиус эллипса. Тип double.
 startAngle
 Начальный угол эллиптической дуги (угловое смещение начальной точки дуги). Тип double.
 endAngle
 Конечный угол эллиптической дуги (угловое смещение конечной точки дуги). Тип double.
 Описание
 Метод позволяет переопределить данный эллипс или эллиптическую дугу, используя указанные точку центра, большую и малую оси, большой и малый радиусы, а также начальный и конечный углы.
 Замечания
 Угол точки на эллипсе измеряется путем проецирования этой точки перпендикулярно большой оси на окружность, центр которой совпадает с центром эллипса, а радиус равен большому радиусу этого эллипса. Угол между большой осью эллипса и вектором из центра эллипса в спроецированную точку на окружности, измеренный против часовой стрелки, является углом этой точки на эллипсе.
 У полного эллипса разница между EndAngle и StartAngle составляет 2 x Pi.
 Ссылки
 Teigha.Geometry.EllipticalArc2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!