Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SymbolUtilityServices.IsLayerDefpointsName
 Послать отзыв
 Метод позволяет проверить, соответствует ли переданная строка имени слоя "Defpoints".
 Синтаксис
C#
Visual Basic
Копировать Код
public static bool IsLayerDefpointsName( ref String name );
Копировать Код
Public Shared Function IsLayerDefpointsName( ByRef name As String ) As Boolean
 Параметры
 Параметры
 Описание
 name
 Проверяемое имя. Тип String.
 Возвращает
 Возвращает true, если строка name соответствует имени слоя "Defpoints". В противном случае возвращает false.
 Описание
 Метод позволяет проверить, соответствует ли переданная строка имени слоя "Defpoints".
 Ссылки
 Teigha.DatabaseServices.SymbolUtilityServices, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!