Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.RenderEnvironment.DoubleRangeParameter.DoubleRangeParameter
 Послать отзыв
 Конструктор структуры DoubleRangeParameter.
 Синтаксис
C#
Visual Basic
Копировать Код
public DoubleRangeParameter( double n, double f );
Копировать Код
Public Sub New( n As Double, f As Double )
 Параметры
 Параметры
 Описание
 n
 Близкое расстояние. Тип double.
 f
 Дальнее расстояние. Тип double.
 Описание
 Конструктор структуры DoubleRangeParameter. Создает экземпляр класса с указанными дальностями.
 Ссылки
 Teigha.DatabaseServices.RenderEnvironment.DoubleRangeParameter, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!