Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.NurbSurface.NumberOfKnotsInU
 Послать отзыв
 Свойство представляет количество узлов данной поверхности в направлении u.
 Синтаксис
C#
Visual Basic
Копировать Код
public int NumberOfKnotsInU;
Копировать Код
Public ReadOnly Property NumberOfKnotsInU As Integer
 Возвращает
 Возвращает количество узлов поверхности в заданном направлении. Тип int.
 Описание
 Свойство представляет количество узлов данной поверхности в направлении u.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.NurbSurface, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!