Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GeoLocationData.HorizontalUnits
 Послать отзыв
 Свойство обеспечивает доступ к горизонтальным единицам измерения.
 Синтаксис
C#
Visual Basic
Копировать Код
public UnitsValue HorizontalUnits;
Копировать Код
Public Property HorizontalUnits As UnitsValue
 Возвращает
 Возвращает горизонтальные единицы измерения. Значение из перечисления UnitsValue.
 Описание
 Свойство обеспечивает доступ к горизонтальным единицам измерения.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.GeoLocationData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!