Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Matrix3d.Scaling
 Послать отзыв
 Метод формирует матрицу равномерного масштабирования относительно заданной точки с заданным коэффициентом.
 Синтаксис
C#
Visual Basic
Копировать Код
public Matrix3d Scaling( double scaleAll, Point3d center );
Копировать Код
Public Function Scaling( scaleAll As Double, center As Point3d ) As Matrix3d
 Параметры
 Параметры
 Описание
 scaleAll
 Коэффициент масштабирования. Тип double.
 center
 Центр масштабирования. Тип Point3d.
 Возвращает
 Возвращает матрицу Matrix3d, которая обеспечивает заданное масштабирование.
 Описание
 Метод формирует матрицу равномерного масштабирования относительно точки center с коэффициентом масштабирования scaleAll.
 Ссылки
 Teigha.Geometry.Matrix3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!