Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MTextFragment.Direction
 Послать отзыв
 Свойство возвращает направление оси X текста.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d Direction;
Копировать Код
Public ReadOnly Property Direction As Vector3d
 Возвращает
 Возвращает направление оси X текста. Тип Vector3d.
 Описание
 Свойство возвращает направление оси X текста.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.MTextFragment, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!