Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.HostApplicationServices.IsUrl
 Послать отзыв
 Метод позволяет проверить, является ли переданная строка допустимым URL-адресом. В текущей версии не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual bool IsUrl( ref String filePath );
Копировать Код
Public Overridable Function IsUrl( ByRef filePath As String ) As Boolean
 Параметры
 Параметры
 Описание
 filePath
 Проверяемая строка. Тип String.
 Возвращает
 Возвращает true, если переданная в метод строка является допустимым URL-адресом. В противном случае возвращает false.
 Описание
 Метод позволяет проверить, является ли переданная строка допустимым URL-адресом. В текущей версии не реализован.
 Ссылки
 Teigha.DatabaseServices.HostApplicationServices, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!