Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.XrefNotificationStatus
 Послать отзыв
 Перечисление XrefNotificationStatus определяет статусы уведомлений о разрешении внешних ссылок.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum XrefNotificationStatus { None = 0, ResolvedMatch = 1, ResolvedElsewhere = 2, ResolvedWithUpdate = 3, ResolvedUpdateAvailable = 4 }
Копировать Код
Public Enum XrefNotificationStatus None = 0 ResolvedMatch = 1 ResolvedElsewhere = 2 ResolvedWithUpdate = 3 ResolvedUpdateAvailable = 4 End Enum
 Члены
 Члены
 Описание
 None
 Значение: 0. Статус по умолчанию. Означает отсутствие доступной информации для уведомлений о внешних ссылках.
 ResolvedMatch
 Значение: 1. Статус означает, что внешняя ссылка была разрешена с использованием чертежа, указанного в записи таблицы блоков.
 ResolvedElsewhere
 Значение: 2. Статус означает, что внешняя ссылка была разрешена с использованием чертежа из другого расположения, которое отличается от указанного в записи таблицы блоков.
 ResolvedWithUpdate
 Значение: 3. Статус означает, что внешняя ссылка была разрешена с использованием чертежа, который был обновлен с момента последнего сохранения ссылочного чертежа.
 ResolvedUpdateAvailable
 Значение: 4. Статус означает, что внешняя ссылка была разрешена, но с момента разрешения файл был обновлен, и его необходимо перезагрузить заново.
 Описание
 Перечисление XrefNotificationStatus определяет статусы уведомлений о разрешении внешних ссылок.
 Ваши комментарии по поводу этого топика: Послать отзыв!