Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeaderStyle.LeaderLineTypeId
 Послать отзыв
 Свойство представляет предусмотренный данным стилем идентификатор ObjectId типа линии, используемого для отрисовки выносных линий мультивыноски.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.ObjectId LeaderLineTypeId;
Копировать Код
Public Property LeaderLineTypeId As DatabaseServices.ObjectId
 Возвращает
 Возвращает идентификатор типа линии. Тип DatabaseServices.ObjectId.
 Описание
 Свойство представляет предусмотренный данным стилем идентификатор ObjectId типа линии, используемого для отрисовки выносных линий мультивыноски.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MLeaderStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!