Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.TableStyle.SetGridVisibility
 Послать отзыв
 Метод позволяет задать видимость сетки для указанных типов линий сетки и типов строк.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetGridVisibility( bool visible, int gridLineTypes, int rowTypes );
Копировать Код
Public Overridable Sub SetGridVisibility( visible As Boolean, gridLineTypes As Integer, rowTypes As Integer )
 Параметры
 Параметры
 Описание
 visible
 Флаг видимости. Тип bool.
 gridLineTypes
 Тип линий сетки (или логическая комбинация нескольких типов). Тип int. См. перечисление GridLineType.
 rowTypes
 Тип строк таблицы (или логическая комбинация нескольких типов). Тип int. См. перечисление RowType.
 Описание
 Метод позволяет задать видимость сетки для указанных типов линий сетки и типов строк. Различные типы линий и типы строк можно комбинировать с помощью логического оператора OR.
 Ссылки
 Teigha.DatabaseServices.TableStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!