Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.EllipticalCone.SetAngles
 Послать отзыв
 Метод переопределяет начальный и конечный углы данного эллиптического конуса.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetAngles( double startAngle, double endAngle );
Копировать Код
Public Sub SetAngles( startAngle As Double, endAngle As Double )
 Параметры
 Параметры
 Описание
 startAngle
 Начальный угол конуса. Тип double.
 endAngle
 Конечный угол конуса. Тип double.
 Описание
 Метод позволяет переопределить начальный и конечный углы данного эллиптического конуса.
 Ссылки
 Teigha.Geometry.EllipticalCone, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!