Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Ray2d.Ray2d
 Послать отзыв
 Конструктор класса Ray2d. Создает луч по двум несовпадающим 2D-точкам, первая из которых становится начальной точкой луча, а вторая задает его направление.
 Синтаксис
C#
Visual Basic
Копировать Код
public Ray2d( Point2d point1, Point2d point2 );
Копировать Код
Public Sub New( point1 As Point2d, point2 As Point2d )
 Параметры
 Параметры
 Описание
 point1
 Точка начала луча. Тип Point2d.
 point2
 Точка, через которую проходит луч. Тип Point2d. Не может совпадать с точкой point1.
 Описание
 Конструктор класса Ray2d. Создает луч, который начинается в точке point1 и проходит через точку point2. Точки point1 и point2 не могут совпадать.
 Ссылки
 Teigha.Geometry.Ray2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!