Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.XrefGraphNode.XrefNotificationStatus
 Послать отзыв
 Свойство XrefNotificationStatus представляет состояние уведомления о внешней ссылке для данного узла.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.XrefNotificationStatus XrefNotificationStatus;
Копировать Код
Public ReadOnly Property XrefNotificationStatus As DatabaseServices.XrefNotificationStatus
 Возвращает
 Возвращает состояние уведомления о внешней ссылке. Перечисление DatabaseServices.XrefNotificationStatus.
 Описание
 Свойство XrefNotificationStatus представляет состояние уведомления о внешней ссылке для данного узла.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.XrefGraphNode, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!