Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.BoundBlock2d.BoundBlock2d
 Послать отзыв
 Конструктор класса BoundBlock2d. Создает граничную рамку в виде параллелограмма с заданными базовой точкой и сторонами.
 Синтаксис
C#
Visual Basic
Копировать Код
public BoundBlock2d( Point2d basePoint, Vector2d direction1, Vector2d direction2 );
Копировать Код
Public Sub New( basePoint As Point2d, direction1 As Vector2d, direction2 As Vector2d )
 Параметры
 Параметры
 Описание
 basePoint
 Базовая точка параллелограмма. Тип Point2d.
 direction1
 Вектор, определяющий направление и длину первой стороны параллелограмма. Тип Vector2d.
 direction2
 Вектор, определяющий направление и длину второй стороны параллелограмма. Тип Vector2d.
 Описание
 Конструктор класса BoundBlock2d. Создает граничную рамку в виде параллелограмма с заданными базовой точкой и сторонами.
 Ссылки
 Teigha.Geometry.BoundBlock2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!