Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Polyline2d.DefaultEndWidth
 Послать отзыв
 Свойство предоставляет доступ к значению по умолчанию конечной ширины сегмента этой полилинии. Это значение используется как конечная ширина по умолчанию для всех вершин полилинии.
 Синтаксис
C#
Visual Basic
Копировать Код
public double DefaultEndWidth;
Копировать Код
Public Property DefaultEndWidth() As double
 Возвращает
 Возвращает конечную ширину сегмента полилинии как значение типа double.
 Описание
 Свойство предоставляет доступ к значению по умолчанию конечной ширины сегмента этой полилинии. Это значение используется как конечная ширина по умолчанию для всех вершин полилинии. Таким образом, в рамках функции DXFOUT вершины с такой конечной шириной не будут записывать это значение в файл. В случае DXFIN вершины без группового кода DXF 41 будут использовать конечную ширину полилинии по умолчанию.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Polyline2d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!