Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve2d.GetNormalPoint
 Послать отзыв
 Метод с заданной точностью находит на данной кривой точку, в которой нормаль к кривой пройдет через указанную точку.
 Синтаксис
C#
Visual Basic
Копировать Код
public PointOnCurve2d GetNormalPoint( Point2d point, Tolerance tolerance );
Копировать Код
Public Function GetNormalPoint( point As Point2d, tolerance As Tolerance ) As PointOnCurve2d
 Параметры
 Параметры
 Описание
 point
 Входная точка, через которую должна пройти нормаль к кривой. Тип Point2d.
 tolerance
 Заданная геометрическая точность. Тип Tolerance.
 Возвращает
 Возвращает точку на кривой, в которой нормаль к кривой пройдет через входную точку point. Тип PointOnCurve2d.
 Описание
 Метод позволяет с заданной точностью найти на данной кривой такую точку, в которой нормаль к кривой пройдет через переданную в метод точку. Если на кривой окажется более одной такой точки, возвращается точка с наименьшим значением параметра.
 Замечания
 Нормаль к кривой в точке на кривой представляет собой линию, проходящую через эту точку и перпендикулярную касательному вектору в этой точке.
 Ссылки
 Teigha.Geometry.Curve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!