Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObject.FromAcadObject(Object)
 Послать отзыв
 Метод предназначен для получения идентификатора объекта в базе данных чертежа по указателю на него.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectId FromAcadObject(Object acadObj);
Копировать Код
Public Function FromAcadObject(acadObj As Object) As ObjectId
 Параметры
 Параметры
 Описание
 acadObj
 Указатель на объект чертежа. Тип Object
 Возвращает
 Возвращает идентификатор объекта базы данных. Тип ObjectId.
 Описание
 С помощью метода можно получить идентификатор объекта в базе данных чертежа по указателю на этот объект.
 Ссылки
 Teigha.DatabaseServices.DBObject, Teigha.DatabaseServices
 Исключения
 Этот метод генерирует исключение 'ArgumentNullException', если переданный аргумент равен null.
 Ваши комментарии по поводу этого топика: Послать отзыв!