Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Matrix2d.!=
 Послать отзыв
 Оператор неравенства для структуры Matrix2d.
 Синтаксис
C#
Visual Basic
Копировать Код
public static bool operator !=( Matrix2d a, Matrix2d b );
Копировать Код
Public Shared Operator <>( a As Matrix2d, b As Matrix2d ) As Boolean
 Параметры
 Параметры
 Описание
 a
 Левый операнд. Тип Matrix2d.
 b
 Правый операнд. Тип Matrix2d.
 Возвращает
 Возвращает true, если не равны значения хотя бы в одной паре соответствующих элементов двух матриц. В противном случае возвращает false.
 Описание
 Оператор неравенства для структуры Matrix2d.
 Ссылки
 Teigha.Geometry.Matrix2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!