Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.InsertColumns
 Послать отзыв
 Метод вставляет в таблицу по указанному индексу один или несколько столбцов.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void InsertColumns( int col, double width, int columns );
Копировать Код
Public virtual Sub InsertColumns( col As Integer, width As double, columns As Integer )
 Параметры
 Параметры
 Описание
 col
 Индекс столбца в месте вставки, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
 width
 Ширина вставляемых столбцов, тип double.
 columns
 Количество вставляемых столбцов, тип int.
 Описание
 Метод вставляет в таблицу по указанному индексу один или несколько столбцов.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!