Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Database.ClassDxfName
 Послать отзыв
 Синтаксис
C#
Visual Basic
public String ClassDxfName(ref RXClass getMyDxfName);
Public Function ClassDxfName(ByRef getMyDxfName As RXClass) As String
 Параметры
 Параметры
 Описание
 getMyDxfName
 Объект, для которого должно быть получено имя
 Описание
 Функция, возвращающая DXF имя для класса.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!