Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.HostApplicationServices.GetRemoteFile
 Послать отзыв
 Метод предназначен для получения файла, заданного параметром URL. В текущей версии не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public String GetRemoteFile( Uri url, bool ignoreCache );
Копировать Код
Public Function GetRemoteFile( url As Uri, ignoreCache As Boolean ) As String
 Параметры
 Параметры
 Описание
 url
 URL, которым идентифицируется файл. Тип Uri.
 ignoreCache
 Флаг, определяющий, следует ли загружать существующие кэшированные файлы. Тип bool. В случае значения true кэшированные файлы не загружаются.
 Возвращает
 Возвращает найденный файл. Тип String.
 Описание
 Метод предназначен для получения файла, заданного параметром URL. В текущей версии не реализован.
 Ссылки
 Teigha.DatabaseServices.HostApplicationServices, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!