Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve3d.GetProjectedClosestPointTo
 Послать отзыв
 Метод находит точки на данной кривой и указанной кривой Curve3d, которые оказываются ближайшими точками на проекциях этих двух кривых на заданную плоскость. Метод позволяет задавать точность вычислений.
 Синтаксис
C#
Visual Basic
Копировать Код
public PointOnCurve3d[] GetProjectedClosestPointTo( ref Curve3d curve3d, Vector3d projectDirection, Tolerance tolerance );
Копировать Код
Public Function GetProjectedClosestPointTo( ByRef curve3d As Curve3d, projectDirection As Vector3d, tolerance As Tolerance ) As PointOnCurve3d()
 Параметры
 Параметры
 Описание
 curve3d
 Другая 3D-кривая. Тип Curve3d.
 projectDirection
 Нормаль плоскости проецирования. Тип Vector3d.
 tolerance
 Точность вычислений. Тип Tolerance.
 Возвращает
 Возвращает массив "ближайших" точек на 3D-кривой. Тип PointOnCurve3d[].
 Описание
 Метод находит точки на данной кривой и указанной кривой Curve3d, которые оказываются ближайшими точками на проекциях этих двух кривых на плоскость с нормалью projectDirection. Результатом является массив "ближайших" точек на данной кривой. Дополнительно метод позволяет задавать желаемую точность вычислений.
 Данный метод используется в основном в задачах графической визуализации, где projectDirection служит направлением взгляда. В этом случае метод возвращает точки двух кривых, которые в проекции кажутся ближайшими точками этих кривых (хотя, разумеется, в действительности ближайшими точками они могут и не быть).
 Ссылки
 Teigha.Geometry.Curve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!