Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve3d.IsOn
 Послать отзыв
 Метод позволяет установить, находится ли указанное значение параметра в пределах параметрического интервала данной кривой при заданной точности вычислений.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsOn( double value, Tolerance tolerance );
Копировать Код
Public Function IsOn( value As double, tolerance As Tolerance ) As Boolean
 Параметры
 Параметры
 Описание
 value
 Входное значение параметра для точки на кривой. Тип double.
 tolerance
 Входная точность. Тип Tolerance.
 Возвращает
 Возвращает true в случае, если точка point находится на данной кривой, иначе - false.
 Описание
 Метод позволяет установить, находится ли указанное значение параметра value в пределах параметрического интервала данной кривой. Проверка выполняется с заданной точностью tolerance.
 Ссылки
 Teigha.Geometry.Curve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!