Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.RotatedDimension.XLine2Point
 Послать отзыв
 Свойство задает и получает начальную трехмерную точку второй выносной линии размера. Система координат - мировая (WCS).
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d XLine2Point;
Копировать Код
Public Property XLine2Point() As Point3d
 Возвращает
 Возвращает или задает начальную трехмерную точку второй выносной линии размера, тип Point3d.
 Описание
 Свойство задает и получает начальную трехмерную точку второй выносной линии размера. Система координат - мировая (WCS). Отображение выносной линии относительно этой точки определяется значением системной переменной DIMEXO.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.RotatedDimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!