Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.HighlightOverrule.SetExtensionDictionaryEntryFilter
 Послать отзыв
 Метод включает режим поиска по словарю расширений для фильтрации объектов, к которым будут применены переопределения.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetExtensionDictionaryEntryFilter( ref String entryName );
Копировать Код
Public Sub SetExtensionDictionaryEntryFilter( ByRef entryName As String )
 Параметры
 Параметры
 Описание
 entryName
 Имя записи, тип String.
 Описание
 Метод включает режим поиска по словарю расширений для фильтрации объектов, к которым будут применены переопределения.
 Используйте этот метод, если требуется, чтобы nanoCAD искал в словаре расширений запись с именем entryName для переопределяемого объекта прежде чем вызвать любое из ваших переопределений. Переопределения не будут вызываться, если entryName отсутствует в словаре расширений.
 Ссылки
 Teigha.DatabaseServices.HighlightOverrule, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!