Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SectionSettings.PlotStyleName
 Послать отзыв
 Метод позволяет получить имя стиля печати для геометрии указанного типа.
 Синтаксис
C#
Visual Basic
Копировать Код
public String PlotStyleName( SectionType nSecType, SectionGeometry nGeometry );
Копировать Код
Public Function PlotStyleName( nSecType As SectionType, nGeometry As SectionGeometry ) As String
 Параметры
 Параметры
 Описание
 nSecType
 Тип сечения. Перечисление SectionType.
 nGeometry
 Типы элементов геометрии сечения. Перечисление SectionGeometry.
 Возвращает
 Возвращает имя стиля печати. Тип String.
 Описание
 Метод позволяет получить имя стиля печати, используемого при выводе на печать геометрии указанного типа.
 Ссылки
 Teigha.DatabaseServices.SectionSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!