Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DataCellCollection.Add
 Послать отзыв
 Метод добавляет в коллекцию новый объект DataCell.
 Синтаксис
C#
Visual Basic
Копировать Код
public int Add( ref DataCell value );
Копировать Код
Public Function Add( ByRef value As DataCell ) As Integer
 Параметры
 Параметры
 Описание
 value
 Добавляемый объект. Тип DataCell.
 Возвращает
 Возвращает отсчитываемый от нуля индекс нового элемента коллекции. Тип int.
 Описание
 Метод добавляет в коллекцию новый объект DataCell и возвращает его индекс.
 Ссылки
 Teigha.DatabaseServices.DataCellCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!