Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve3d.Create
 Послать отзыв
 Метод создает объект Curve3d на основе переданного указателя.
 Синтаксис
C#
Visual Basic
Копировать Код
public Curve3d Create( IntPtr unmanagedPointer, bool autoDelete );
Копировать Код
Public Function Create( unmanagedPointer As IntPtr, autoDelete As Boolean ) As Curve3d
 Параметры
 Параметры
 Описание
 unmanagedPointer
 Неуправляемый указатель на исходный объект. Тип IntPtr.
 autoDelete
 Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.
 Возвращает
 Возвращает новый объект типа Curve3d.
 Описание
 Метод создает объект Curve3d на основе переданного указателя.
 Ссылки
 Teigha.Geometry.Curve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!