Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Ellipse.RadiusRatio
 Послать отзыв
 Свойство RadiusRatio возвращает отношение длин малой и большой полуосей данного эллипса или эллиптической дуги.
 Синтаксис
C#
Visual Basic
Копировать Код
public double RadiusRatio;
Копировать Код
Public Property RadiusRatio As Double
 Возвращает
 Возвращает отношение длин полуосей эллипса или эллиптической дуги. Тип double.
 Описание
 Свойство RadiusRatio возвращает отношение длин малой и большой полуосей данного эллипса или эллиптической дуги. Возвращаемое значение лежит в интервале [1e-6, 1.0].
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Ellipse, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!