Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.TableStyle.GridLineWeight
 Послать отзыв
 Метод позволяет получить вес (толщину) линий, используемый в заданном сочетании типа линий сетки и типа строк таблицы.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual LineWeight GridLineWeight( GridLineType gridLineType, RowType rowType );
Копировать Код
Public Overridable Function GridLineWeight( gridLineType As GridLineType, rowType As RowType ) As LineWeight
 Параметры
 Параметры
 Описание
 gridLineType
 Тип линий сетки. Перечисление GridLineType.
 rowType
 Тип строки. Перечисление RowType.
 Возвращает
 Возвращает вес (толщину) линий. Перечисление LineWeight.
 Описание
 Метод позволяет получить вес (толщину) линий, используемый в заданном сочетании типа линий сетки и типа строк таблицы.
 Ссылки
 Teigha.DatabaseServices.TableStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!