Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.DeleteCellContent
 Послать отзыв
 Метод предназначен для удаления содержимого из ячейки, заданной индексами строки и столбца.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void DeleteCellContent( int row, int col );
Копировать Код
Public virtual Sub DeleteCellContent( row As Integer, col As Integer )
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 col
 Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
 Описание
 Метод предназначен для удаления содержимого из ячейки, заданной индексами строки и столбца.
 Замечания
 Для получения того же результата предпочтительнее использовать метод Table.Cells[row,column].DeleteCellContent.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!