Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.GetTextString
 Послать отзыв
 Метод предназначен для получения текстовой строки из первого элемента содержимого, заданного по индексу.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual String GetTextString( int row, int column, int contentIndex, FormatOption formatOption );
Копировать Код
Public virtual Function GetTextString( row As Integer, column As Integer, contentIndex As Integer, formatOption As FormatOption ) As String
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 contentIndex
 Индекс элемента содержимого ячейки, тип int. Индекс должен быть больше или равен нулю и меньше количества элементов содержимого в ячейке.
 formatOption
 Опции формирования строки из перечисления FormatOption.
 col
 Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
 Возвращает
 Возвращает строку String.
 Описание
 Метод предназначен для получения текстовой строки из первого элемента содержимого, заданного по индексу. Опции форматирования передаются с помощью параметра formatOption.
 Замечания
 Для получения того же результата предпочтительнее использовать метод Table.Cells[row,column].Contents[i].GetTextString.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!