Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.EllipticalCone.IsClosed
 Послать отзыв
 Метод позволяет проверить, является ли основание этого эллиптического конуса полным эллипсом в рамках заданной точности.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsClosed( Tolerance tolerance );
Копировать Код
Public Function IsClosed( tolerance As Tolerance ) As Boolean
 Параметры
 Параметры
 Описание
 tolerance
 Входная геометрическая точность. Тип Tolerance.
 Возвращает
 Возвращает true, если основание данного эллиптического конуса можно считать полным эллипсом в пределах точности tolerance. В противном случае возвращает false.
 Описание
 Метод позволяет проверить, можно ли считать основание этого эллиптического конуса полным эллипсом в рамках заданной точности tolerance.
 Ссылки
 Teigha.Geometry.EllipticalCone, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!