Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbCurve2d.NurbCurve2d
 Послать отзыв
 Конструктор класса NurbCurve2d. Создает двумерную NURBS кривую, которая интерполирует указанный массив двумерных точек в пределах заданной точности.
 Синтаксис
C#
Visual Basic
Копировать Код
public NurbCurve2d( ref Point2dCollection fitPoints, Tolerance fitTolerance );
Копировать Код
Public Sub New( ByRef fitPoints As Point2dCollection, fitTolerance As Tolerance )
 Параметры
 Параметры
 Описание
 fitPoints
 Входная коллекция определяющих точек. Тип Point2dCollection.
 fitTolerance
 Входная точность интерполяции. Тип Tolerance. Определяет максимальное отклонение интерполирующей кривой от определяющих точек.
 Описание
 Конструктор класса NurbCurve2d. Создает двумерную NURBS кривую, которая интерполирует указанный массив двумерных точек в пределах заданной точности.
 Ссылки
 Teigha.Geometry.NurbCurve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!