Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Polyline2d.PolyType
 Послать отзыв
 Свойство предоставляет доступ к типу аппроксимации для данной полилинии в виде элемента перечисления Poly2dType.
 Синтаксис
C#
Visual Basic
Копировать Код
public Poly2dType PolyType;
Копировать Код
Public Property PolyType() As Poly2dType
 Возвращает
 Возвращает значение из перечисления Poly2dType.
 Описание
 Свойство предоставляет доступ к типу аппроксимации для данной полилинии в виде значения из перечисления Poly2dType.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Polyline2d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!