Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotStyleTable.PlotStyleSize
 Послать отзыв
 Свойство PlotStyleSize представляет логический размер данной таблицы PlotStyleTable.
 Синтаксис
C#
Visual Basic
Копировать Код
public unsigned int PlotStyleSize;
Копировать Код
Public ReadOnly Property PlotStyleSize As unsigned int
 Возвращает
 Возвращает логический размер данной таблицы стилей. Тип unsigned int.
 Описание
 Свойство PlotStyleSize представляет логический размер данной таблицы стилей печати PlotStyleTable.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.PlotStyleTable, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!