Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Solid.Normal
 Послать отзыв
 Свойство Normal представляет вектор нормали плоскости данного плоского твердого объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d Normal;
Копировать Код
Public Property Normal As Vector3d
 Возвращает
 Возвращает вектор нормали плоскости данного плоского твердого объекта. Тип Vector3d.
 Описание
 Свойство Normal представляет вектор нормали плоскости данного плоского твердого объекта. Компоненты вектора определены в мировой системе координат (WCS).
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Solid, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!