Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Useri3
 Послать отзыв
 Синтаксис
C#
Visual Basic
public int Useri3;
Public Property Useri3() As Integer
 Описание
 Обеспечивает доступ к текущему значению USERI3 для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!