Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.XrefRedirectedEventArgs
 Послать отзыв
 Класс XrefRedirectedEventArgs представляет данные для события XrefRedirected базы данных.
 Иерархия классов
Teigha::DatabaseServices::XrefRedirectedEventArgs
 Синтаксис
C#
Visual Basic
Копировать Код
public sealed class XrefRedirectedEventArgs : EventArgs
Копировать Код
Public NotInheritable Class XrefRedirectedEventArgs Inherits EventArgs
 Описание
 Класс XrefRedirectedEventArgs представляет данные для события XrefRedirected базы данных.
 Топики
 Имя
 Описание
 XrefRedirectedEventArgs Свойства
 Ниже перечислены свойства класса XrefRedirectedEventArgs.
 Ссылки
 XrefRedirectedEventArgs Свойства, Топики, XrefRedirectedEventArgs Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!