Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector3d.Z
 Послать отзыв
 Свойство возвращает значение Z-координаты данного вектора.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Z;
Копировать Код
Public Property Z() As Double
 Возвращает
 Возвращает значение координаты Z данного вектора. Тип double.
 Описание
 Свойство возвращает значение Z-координаты данного вектора.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.Vector3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!