Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.UnderlayLayer
 Послать отзыв
 Класс UnderlayLayer представляет слои подложки на чертеже.
 Иерархия классов
Teigha::DatabaseServices::UnderlayLayer
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdUnderlayLayer")] public class UnderlayLayer : DisposableWrapper
Копировать Код
<Wrapper("OdUnderlayLayer")> Public Class UnderlayLayer Inherits DisposableWrapper
 Описание
 Класс UnderlayLayer представляет слои подложки на чертеже.
 Методы
 Конструкторы
 Имя
 Описание
 UnderlayLayer
 Конструктор по умолчанию класса UnderlayLayer.
 Топики
 Имя
 Описание
 UnderlayLayer Свойства
 Ниже перечислены свойства класса UnderlayLayer.
 Ссылки
 UnderlayLayer Свойства, Методы, Топики, UnderlayLayer Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!