Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Mline.Mline
 Послать отзыв
 Конструктор по умолчанию класса Mline.
 Синтаксис
C#
Visual Basic
Копировать Код
public Mline();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса Mline.
 Ссылки
 Teigha.DatabaseServices.Mline, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!