Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.PointOnCurve3d.GetCurvature
 Послать отзыв
 Метод вычисляет кривизну кривой в данной точке на кривой. Метод не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public double GetCurvature();
Копировать Код
Public Function GetCurvature() As Double
 Возвращает
 Возвращает значение кривизны кривой в данной точке на кривой. Тип double.
 Описание
 Метод вычисляет кривизну кривой в данной точке на кривой. Метод не реализован.
 Ссылки
 Teigha.Geometry.PointOnCurve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!