Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство RasterImageDef.FileDescCopy
 Послать отзыв
 Синтаксис
C#
Visual Basic
public IntPtr FileDescCopy;
Public Property FileDescCopy() As IntPtr
 Описание
 Возвращает копию объекта OdGiRasterImage.FileReadDescriptor. Если объект не имеет корректного значения OdGiRasterImage.FileReadDescriptor, то возвращается null.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.RasterImageDef, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!