Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Curve.GetOrthoProjectedCurve
 Послать отзыв
 Метод создает новую кривую как результат проецирования кривой на заданную плоскость.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual Curve GetOrthoProjectedCurve( ref Plane planeToProjectOn );
Копировать Код
Public virtual Function GetOrthoProjectedCurve( ByRef planeToProjectOn As Plane ) As Curve
 Параметры
 Параметры
 Описание
 planeToProjectOn
 Плоскость, на которую следует спроецировать кривую.
 Возвращает
 Возвращает новую кривую, спроецированную на плоскость planeToProjectOn, как экземпляр класса Curve.
 Описание
 Метод GetOrthoProjectedCurve создает новую кривую как результат проецирования кривой на заданную плоскость.
 Ссылки
 Teigha.DatabaseServices.Curve, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!