Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocAction.IsOwnedDependency
 Послать отзыв
 Метод позволяет проверить, принадлежит ли указанная зависимость AssocDependency данному действию напрямую или, если данное действие является сетью, принадлежит ли зависимость действию, принадлежащему сети.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsOwnedDependency( ref AssocDependency dependency );
Копировать Код
Public Function IsOwnedDependency( ByRef dependency As AssocDependency ) As Boolean
 Параметры
 Параметры
 Описание
 dependency
 Входная зависимость, проверяемая на принадлежность данному действию. Тип AssocDependency. Должна быть доступна как минимум на чтение.
 Возвращает
 Возвращает true, если зависимость dependency принадлежит данному действию напрямую или принадлежит действию, принадлежащему сети (когда данное действие является сетью). В противном случае возвращает false.
 Описание
 Метод проверяет, принадлежит ли указанная зависимость AssocDependency данному действию напрямую или, если данное действие является сетью, принадлежит ли зависимость действию, принадлежащему сети.
 Реализация по умолчанию сначала проверяет, совпадают ли OwnerId() зависимости и ObjectId() этого действия. Если нет, и действие является сетью, вызывается метод GetDependencies(), чтобы проверить, окажется ли данная зависимость в полученном списке зависимостей. Вторая проверка является общей и применима к любому действию, но она не используется в качестве реализации по умолчанию для каких-либо действий, поскольку более затратна.
 Если действию принадлежит объект AssocActionBody с переопределенным предикатом IsOwnedDependencyOverride(), вместо реализации по умолчанию вызывается именно этот переопределенный предикат.
 Ссылки
 Teigha.DatabaseServices.AssocAction, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!