Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DxfFiler.ReadUInt32
 Послать отзыв
 Метод возвращает 32-разрядное целое число без знака (uint) из текущего элемента этого объекта Filer.
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract uint ReadUInt32();
Копировать Код
Public MustOverride Function ReadUInt32() As UInteger
 Возвращает
 Возвращает 32-разрядное целое число без знака. Тип uint.
 Описание
 Метод возвращает 32-разрядное целое число без знака (uint) из текущего элемента этого объекта Filer.
 Ссылки
 Teigha.DatabaseServices.DxfFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!