Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CubicSplineCurve3d.CubicSplineCurve3d
 Послать отзыв
 Конструктор по умолчанию класса CubicSplineCurve3d. Инициализирует кубический сплайн с пустым списком точек.
 Синтаксис
C#
Visual Basic
Копировать Код
public CubicSplineCurve3d();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса CubicSplineCurve3d. Инициализирует кубический сплайн с пустым списком точек (т.е. без фактических данных).
 Ссылки
 Teigha.Geometry.CubicSplineCurve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!