Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.BoundaryRepresentation.Mesh2dElement2dEnumerator
 Послать отзыв
 Класс Mesh2dElement2dEnumerator представляет перечислитель объектов Element2d двумерной сети Mesh2d.
 Иерархия классов
Teigha::BoundaryRepresentation::EnumeratorBase Teigha::BoundaryRepresentation::Mesh2dElement2dEnumerator
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("AcBrMesh2dElement2dTraverser")] public class Mesh2dElement2dEnumerator : EnumeratorBase, Generic.IEnumerator<Element2d>;
Копировать Код
<Wrapper("AcBrMesh2dElement2dTraverser")> Public Class Mesh2dElement2dEnumerator Inherits EnumeratorBase Inherits Generic.IEnumerator<Element2d>
 Описание
 Класс Mesh2dElement2dEnumerator представляет перечислитель объектов Element2d двумерной сети Mesh2d.
 Топики
 Имя
 Описание
 EnumeratorBase Методы
 Ниже перечислены методы класса EnumeratorBase.
 EnumeratorBase Свойства
 Ниже перечислены свойства класса EnumeratorBase.
 Teigha.BoundaryRepresentation.Mesh2dElement2dEnumerator
 Имя
 Описание
 Mesh2dElement2dEnumerator Свойства
 Ниже перечислены свойства класса Mesh2dElement2dEnumerator.
 Ссылки
 Mesh2dElement2dEnumerator Свойства, Топики, EnumeratorBase Методы, EnumeratorBase Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!