Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ObjectId.GetObject
 Послать отзыв
 Возвращает объект, связанный с данным ObjectId.
 Синтаксис
C#
Visual Basic
Копировать Код
public DBObject GetObject( OpenMode mode, bool openErased );
Копировать Код
Public Function GetObject( mode As OpenMode, openErased As Boolean ) As DBObject
 Параметры
 Параметры
 Описание
 mode
 Режим обращения к объекту из перечисления Teigha.DatabaseServices.OpenMode.
 openErased
 Задать true, если следует получать ID удаленных объектов.
 Возвращает
 Возвращает экземпляр класса DBObject.
 Описание
 Возвращает объект, связанный с данным ObjectId.
 Ссылки
 Teigha.DatabaseServices.ObjectId, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!