Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 BlockTableRecord.BlockBeginId
 Послать отзыв
 Свойство предназначено для хранения ObjectID начала блока.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectId BlockBeginId { get; }
Копировать Код
Public Property BlockBeginId As ObjectId
 Возвращает
 Возвращает ObjectId объекта BlockBegin текущей записи таблицы блоков (BlockTableRecord).
 Описание
 В свойстве хранится ObjectId объекта BlockBegin.
 Объект BlockBegin создается автоматически при создании блока и существует в чертеже для совместимости.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.BlockTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!