Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.GetOverrides
 Послать отзыв
 Метод позволяет получить переопределение ячейки, строки, столбца или содержимого ячейки.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual CellProperties GetOverrides( int row, int column, int contentIndex );
Копировать Код
Public virtual Function GetOverrides( row As Integer, column As Integer, contentIndex As Integer ) As CellProperties
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс может равняться -1.
 contentIndex
 Индекс элемента содержимого ячейки, тип int. Индекс может равняться -1.
 col
 Индекс столбца, тип int. Индекс может равняться -1.
 Возвращает
 Возвращает значение из перечисления Teigha.DatabaseServices.CellProperties.
 Описание
 Метод позволяет получить переопределение ячейки, строки, столбца или содержимого ячейки.
 Чтобы указать элемент содержимого ячейки, следует задать допустимые индексы строки, столбца и элемента содержимого ячейки. Чтобы указать ячейку, следует задать допустимые индексы строки и столбца, а также -1 в качестве индекса элемента содержимого ячейки. Чтобы указать строку, следует задать допустимый индекс строки и -1 для индексов столбца и элемента содержимого ячейки. Чтобы указать столбец, следует задать допустимый индекс столбца и -1 для индексов строки и элемента содержимого ячейки.
 Замечания
 Для получения того же результата предпочтительнее использовать Table.Cells[row,column].Contents[i].Overrides
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!