Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство LinetypeTableRecord.AsciiDescription
 Послать отзыв
 Синтаксис
C#
Visual Basic
public String AsciiDescription;
Public Property AsciiDescription() As String
 Описание
 Это свойство является устаревшим, используйте вместо него свойство Comments.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.LinetypeTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!