Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Material.Material
 Послать отзыв
 Конструктор по умолчанию класса Material.
 Синтаксис
C#
Visual Basic
Копировать Код
public Material();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса Material.
 Ссылки
 Teigha.DatabaseServices.Material, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!