Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.EllipticalCylinder.MinorRadius
 Послать отзыв
 Свойство MinorRadius представляет текущее значение малого радиуса данного эллиптического цилиндра.
 Синтаксис
C#
Visual Basic
Копировать Код
public double MinorRadius;
Копировать Код
Public Property MinorRadius As Double
 Возвращает
 Возвращает текущее значение малого радиуса эллиптического цилиндра. Тип double.
 Описание
 Свойство MinorRadius представляет текущее значение малого радиуса данного эллиптического цилиндра.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.Geometry.EllipticalCylinder, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!