Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Solid3d.CreateTorus
 Послать отзыв
 Метод предназначен для создания твердого тела в виде тора в мировой системе координат (WCS) c осью z в качестве оси вращения и с центром в начале координат.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void CreateTorus( double majorRadius, double minorRadius );
Копировать Код
Public Overridable Sub CreateTorus( majorRadius As Double, minorRadius As Double )
 Параметры
 Параметры
 Описание
 majorRadius
 Радиус тора. Тип double.
 minorRadius
 Радиус образующей окружности тора. Тип double.
 Описание
 Метод предназначен для создания твердого тела в виде тора. Осью тора служит ось z мировой системы координат (WCS), центр тора совмещен с началом координат.
 Радиусы majorRadius и minorRadius не могут равняться нулю. Если majorRadius меньше нуля, значение minorRadius должно быть больше абсолютного значения majorRadius.
 Действуют следующие ограничения:
minorRadius >= 1e-6;
majorRadius| >= 1e-6;
Если majorRadius < 0, то minorRadius > |majorRadius| + 1e-6.
 Ссылки
 Teigha.DatabaseServices.Solid3d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!