Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocAction.TransformActionBy
 Послать отзыв
 Метод позволяет уведомить данное действие о том, что владелец действия был подвергнут геометрическому преобразованию.
 Синтаксис
C#
Visual Basic
Копировать Код
public void TransformActionBy( Teigha.Geometry.Matrix3d transform );
Копировать Код
Public Sub TransformActionBy( transform As Teigha.Geometry.Matrix3d )
 Параметры
 Параметры
 Описание
 transform
 Входная матрица геометрического преобразования. Тип Teigha.Geometry.Matrix3d.
 Описание
 Метод уведомляет данное действие о том, что владелец действия был подвергнут геометрическому преобразованию. Например, были преобразованы все объекты в записи BlockTableRecord, владеющей сетью, которой принадлежит данное действие.
 Ссылки
 Teigha.DatabaseServices.AssocAction, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!