Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 BlockTableRecord.GetAnonymousBlockIds()
 Послать отзыв
 Метод предназначен для получения коллекции ObjectId анонимных блоков чертежа.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectIdCollection GetBlockReferenceIds()
Копировать Код
Public Function GetAnonymousBlockIds() As ObjectIdCollection
 Возвращает
 Метод возвращает коллекцию ObjectId в формате ObjectIdCollection.
 Описание
 Метод формирует коллекцию ObjectId анонимных блоков, которые создаются платформой из определения динамического блока.
 Ссылки
 Teigha.DatabaseServices.BlockTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!