Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotSettingsValidator.SetCanonicalMediaName
 Послать отзыв
 Метод позволяет задать каноническое (независимое от локализации) имя физического носителя для указанного объекта PlotSettings.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetCanonicalMediaName( ref PlotSettings plotSet, ref String mediaName );
Копировать Код
Public Sub SetCanonicalMediaName( ByRef plotSet As PlotSettings, ByRef mediaName As String )
 Параметры
 Параметры
 Описание
 plotSet
 Входной объект PlotSettings с настройками печати.
 mediaName
 Каноническое имя бумажного носителя. Тип String.
 Описание
 Метод позволяет задать каноническое (независимое от локализации) имя физического носителя для указанного объекта PlotSettings.
 Следует помнить, что канонические имена носителей являются чувствительными к регистру символов.
 Чтобы получить локализованные версии имен носителей, используйте метод GetLocaleMediaName().
 Ссылки
 Teigha.DatabaseServices.PlotSettingsValidator, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!