Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Sphere.NorthPole
 Послать отзыв
 Свойство NorthPole представляет положение северного полюса данной сферы.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d NorthPole;
Копировать Код
Public ReadOnly Property NorthPole As Point3d
 Возвращает
 Возвращает точку северного полюса данной сферы. Тип Point3d.
 Описание
 Свойство NorthPole представляет положение северного полюса данной сферы.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.Sphere, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!