Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Database.Purge (ObjectIdGraph^)
 Послать отзыв
 Синтаксис
C#
Visual Basic
public void Purge(ref ObjectIdGraph idGraph);
Public Sub Purge(ByRef idGraph As ObjectIdGraph)
 Параметры
 Параметры
 Описание
 idGraph
 Граф объектов базы данных. Возвращаемый граф содержит только те объекты, которые могут быть безопасно удалены из базы данных.
 Описание
 Эта версия метода purge() работает в один проход. Метод ищет связи между объектами, что не требует вызова метода несколько раз. Другими словами, если есть объекты Layer и Linetype и единственная ссылка на Linetype производится из Layer, то на возвращаемом графе помечается, что очищены должны быть оба объекта — и Layer, и Linetype. (Более старая ObjectIdCollection, создаваемая предыдущей версией purge() сначала помечала, что только Layer может быть очищен. Затем, при втором вызове после удаления Layer, метод указывал, что Linetype может быть очищен).
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!