Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство BlockReference.BlockUnit
 Послать отзыв
 Синтаксис
C#
Visual Basic
public UnitsValue BlockUnit;
Public Property BlockUnit() As UnitsValue
 Описание
 Возвращает или устанавливает единицы, связанные с блоком.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.BlockReference, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!