Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.IdMapping.DeepCloneContext
 Послать отзыв
 Свойство обеспечивает доступ к типу операции глубокого клонирования DeepCloneType, в которой используется этот объект IdMapping.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.DeepCloneType DeepCloneContext;
Копировать Код
Public ReadOnly Property DeepCloneContext As DatabaseServices.DeepCloneType
 Возвращает
 Возвращает тип операции глубокого клонирования. Перечисление DatabaseServices.DeepCloneType.
 Описание
 Свойство обеспечивает доступ к типу операции глубокого клонирования DeepCloneType, в которой используется этот объект IdMapping.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.IdMapping, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!