Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SweepOptionsBuilder.PathEntityTransform
 Послать отзыв
 Свойство PathEntityTransform представляет матрицу преобразования для траектории вытягивания.
 Синтаксис
C#
Visual Basic
Копировать Код
public Matrix3d PathEntityTransform;
Копировать Код
Public Property PathEntityTransform As Matrix3d
 Возвращает
 Возвращает матрицу геометрического преобразования. Тип Matrix3d.
 Описание
 Свойство PathEntityTransform представляет матрицу преобразования для траектории вытягивания.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.SweepOptionsBuilder, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!