Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObjectCollection
 Послать отзыв
 Класс представляет интерфейс к коллекции объектов DBObject.
 Иерархия классов
Teigha::DatabaseServices::DBObjectCollection
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdRxObjectPtrArray"), DefaultMember("Item")] public class DBObjectCollection : DisposableWrapper, System.Collections.IList;
Копировать Код
<Wrapper("OdRxObjectPtrArray"), DefaultMember("Item")> Public Class DBObjectCollection Inherits DisposableWrapper Inherits System.Collections.IList
 Описание
 Класс представляет интерфейс к коллекции объектов DBObject.
 Замечания
 В случае, когда пополнение коллекции DBObjectCollection выполняется неуправляемым кодом, попавшие в коллекцию объекты управляемых оберток ещё не имеют. Обычно они не являются и постоянными объектами базы данных. Для каждого такого объекта DBObjectCollection сгенерирует обертку только в случае предоставления доступа к этому объекту (при извлечении из коллекции). В отсутствие запросов на извлечение обертки не создаются. При удалении коллекции DBObjectCollection она проверяет свой набор неуправляемых объектов и набор созданных ею оберток.
 В случае объектов с обертками предполагается, что временем жизни объекта будут управлять обертки, поэтому DBObjectCollection никаких действий не предпринимает. Объекты без оберток коллекция удаляет или закрывает сама, таким образом, она берет на себя ответственность за время жизни объекта. Поэтому следует исключать ситуации, когда объект OdDbObject с управляемой оберткой сохраняется в DBObjectCollection без своей обертки. Такое может происходить, если объект DBObject передается в неуправляемый код, неуправляемый объект сохраняется в массиве типа OdDbVoidPtrArray (как аналог DBObjectCollection), после чего OdDbVoidPtrArray снова преобразуется в DBObjectCollection и возвращается в управляемый код.
 Важно убедиться, что коллекции типа DBObjectCollection удаляются корректно (возможно, явным образом).
 Методы
 Конструкторы
 Имя
 Описание
 DBObjectCollection
 Конструктор по умолчанию.
 Топики
 Имя
 Описание
 DBObjectCollection Методы
 Ниже перечислены методы класса DBObjectCollection.
 DBObjectCollection Свойства
 Ниже перечислены свойства класса DBObjectCollection.
 Ссылки
 DBObjectCollection Методы, DBObjectCollection Свойства, Методы, Топики, DBObjectCollection Методы, DBObjectCollection Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!