Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.EllipticalArc2d.IsInside
 Послать отзыв
 Метод позволяет убедиться, находится ли указанная точка внутри полного эллипса в пределах точности по умолчанию.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsInside( Point2d point );
Копировать Код
Public Function IsInside( point As Point2d ) As Boolean
 Параметры
 Параметры
 Описание
 point
 Проверяемая точка. Тип Point2d.
 Возвращает
 Возвращает true, если в пределах точности по умолчанию можно считать, что точка point находится в пределах полного эллипса. В противном случае возвращает false.
 Описание
 Метод позволяет убедиться, находится ли указанная точка внутри полного эллипса в пределах точности по умолчанию. Используется вызов метода EllipticalArc2d.IsInside(Point2d point, Tolerance tolerance) с геометрической точностью, равной Tolerance.Global.
 Ссылки
 Teigha.Geometry.EllipticalArc2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!