Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.LinearEntity3d.IsPerpendicularTo
 Послать отзыв
 Метод позволяет проверить перпендикулярность данного объекта и указанной плоскости в пределах заданной точности.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsPerpendicularTo( ref PlanarEntity plane, Tolerance tolerance );
Копировать Код
Public Function IsPerpendicularTo( ByRef plane As PlanarEntity, tolerance As Tolerance ) As Boolean
 Параметры
 Параметры
 Описание
 plane
 Входная плоскость. Тип PlanarEntity.
 tolerance
 Входная геометрическая точность. Тип Tolerance.
 Возвращает
 Возвращает true, если в пределах точности tolerance данный объект можно считать перпендикулярным плоскости plane. В противном случае возвращает false.
 Описание
 Метод позволяет проверить перпендикулярность данного объекта и указанной плоскости в пределах заданной точности.
 Ссылки
 Teigha.Geometry.LinearEntity3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!