Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 LayerTableRecord.LineWeight
 Послать отзыв
 В свойстве хранится информация о весе линии, установленной в слое.
 Синтаксис
C#
Visual Basic
Копировать Код
public LineWeight LineWeight { get; set; }
Копировать Код
Public Property LineWeight As LineWeight
 Возвращает
 Возвращает тип данных LineWeight.
 Описание
 С помощью свойства можно получить информацию о том, какой вес линии установлен в слое и изменить его.
 Установленный в слое вес линии будет у всех объектов чертежа, расположенных на этом слое, если вес линии этих объектов установлен в значение «По слою».
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.LayerTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!