Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Graph.FindCycles
 Послать отзыв
 Метод предназначен для выявления всех узлов данного графа, участвующих в циклах.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual bool FindCycles( ref GraphNode start );
Копировать Код
Public Overridable Function FindCycles( ByRef start As GraphNode ) As Boolean
 Параметры
 Параметры
 Описание
 start
 Узел графа, с которого начинается поиск циклов. Тип GraphNode. Обычно передается null.
 Возвращает
 Возвращает true, только если данный объект представляет собой циклический граф. В противном случае возвращает false.
 Описание
 Метод предназначен для выявления всех узлов данного графа, участвующих в циклах.
 Чтобы получать корректную информацию о циклах, метод FindCycles() следует вызывать непосредственно перед выполнением соответствующих запросов (т.е. какие-либо промежуточные изменения графа должны быть исключены).
 Ссылки
 Teigha.DatabaseServices.Graph, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!