Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MentalRayRenderSettings.ExportMIFileName
 Послать отзыв
 Свойство ExportMIFileName представляет используемое имя MI-файла.
 Синтаксис
C#
Visual Basic
Копировать Код
public String ExportMIFileName;
Копировать Код
Public Property ExportMIFileName As String
 Возвращает
 Возвращает имя MI-файла. Тип String.
 Описание
 Свойство ExportMIFileName представляет используемое имя MI-файла.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MentalRayRenderSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!