Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 DimStyleTableRecord.Dimdsep
 Послать отзыв
 Свойство отвечает за настройку разделителя в десятичных дробях измерений.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual char Dimdsep { get; set; }
Копировать Код
Public Overridable Property Dimdsep As Char
 Возвращает
 Возвращает тип данных char.
 Возвращаемые значения
 Возвращаемые значения
 Описание
 .
 разделитель в десятичных дробях между целой и дробной частью - точка
 ,
 разделитель в десятичных дробях между целой и дробной частью - запятая
 : разделитель в десятичных дробях между целой и дробной частью
 пробел
 Описание
 В свойстве хранится текущая настройка разделителя в десятичных дробях измерений в виде символа char. Возможны следующие значения:
‘.’ – точка (по умолчанию);
‘,’ – запятая;
‘ ’ – пробел.
 Свойство также доступно через системную переменную DIMDSEP.
  При изменении системной переменной DIMDSEP будет создан новый размерный стиль под названием <переопределение> на основе текущего с новым значением DIMDSEP.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.DimStyleTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!