Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CompositeCurve3d.GlobalToLocalParameter
 Послать отзыв
 Метод позволяет получить локальное значение параметра подкривой, которое соответствует переданному значению глобального параметра составной кривой.
 Синтаксис
C#
Visual Basic
Копировать Код
public CompositeParameter GlobalToLocalParameter( double value );
Копировать Код
Public Function GlobalToLocalParameter( value As Double ) As CompositeParameter
 Параметры
 Параметры
 Описание
 value
 Значение параметра точки на составной кривой. Тип double.
 Возвращает
 Возвращает составной параметр, который включает значение параметра подкривой и индекс этой подкривой. Тип CompositeParameter.
 Описание
 Метод принимает значение параметра точки на составной кривой (global parameter) и возвращает значение локального параметра той же точки на соответствующей подкривой (local parameter). Возвращаемый "составной параметр" CompositeParameter хранит параметр на подкривой и индекс этой подкривой, соответствующий заданному глобальному параметру составной кривой.
 Ссылки
 Teigha.Geometry.CompositeCurve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!