Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CustomScale.ToString
 Послать отзыв
 Метод предназначен для формирования эквивалентного строкового представления данного объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public String ToString();
Копировать Код
Public Function ToString() As String
 Возвращает
 Возвращает строку, которая содержит значения числителя и знаменателя пользовательского масштаба. Тип String.
 Описание
 Метод предназначен для формирования эквивалентного строкового представления данного объекта.
 Ссылки
 Teigha.DatabaseServices.CustomScale, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!