Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector2dCollection.Insert
 Послать отзыв
 Метод вставляет в коллекцию заданный объект Vector2d по указанному индексу.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Insert( int index, Vector2d value );
Копировать Код
Public Sub Insert( index As Integer, value As Vector2d )
 Параметры
 Параметры
 Описание
 index
 Входной индекс вставленного в коллекцию элемента. Тип int.
 value
 Входной объект, вставляемый в коллекцию. Тип Vector2d.
 Описание
 Метод вставляет в коллекцию заданный объект Vector2d по указанному индексу. Индекс должен иметь допустимое значение.
 Ссылки
 Teigha.Geometry.Vector2dCollection, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!