Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DynamicDimensionDataCollection.CopyTo
 Послать отзыв
 Метод CopyTo() копирует эту коллекцию в указанный массив по указанному индексу.
 Синтаксис
C#
Visual Basic
Копировать Код
public void CopyTo( ref DynamicDimensionData[] arr, int index );
Копировать Код
Public Sub CopyTo( ByRef arr() As DynamicDimensionData, index As Integer )
 Параметры
 Параметры
 Описание
 arr
 Массив, в который копируется данная коллекция. Тип DynamicDimensionData[].
 index
 Индекс в указанном массиве, начиная с которого в массиве сохраняются элементы коллекции. Тип int.
 Описание
 Метод CopyTo() копирует эту коллекцию в указанный массив по указанному индексу.
 Ссылки
 Teigha.DatabaseServices.DynamicDimensionDataCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!