Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GripDataCollection
 Послать отзыв
 Класс GripDataCollection представляет коллекцию объектов GripData.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::DatabaseServices::GripDataCollection
 Синтаксис
C#
Visual Basic
Копировать Код
[DefaultMember("Item")] [Wrapper("OdDbGripDataPtrArray")] public sealed class GripDataCollection : DisposableWrapper, ICollection<GripData>
Копировать Код
<DefaultMember("Item")> <Wrapper("OdDbGripDataPtrArray")> Public NotInheritable Class GripDataCollection Inherits DisposableWrapper Implements ICollection(Of GripData)
 Описание
 Класс GripDataCollection представляет коллекцию объектов GripData.
 Методы
 Конструкторы
 Teigha.DatabaseServices.GripDataCollection
 Имя
 Описание
 GripDataCollection
 Это обзор перегрузок GripDataCollection.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.DatabaseServices.GripDataCollection
 Имя
 Описание
 GripDataCollection Методы
 Ниже перечислены методы класса GripDataCollection.
 GripDataCollection Свойства
 Ниже перечислены свойства класса GripDataCollection.
 Ссылки
 GripDataCollection Конструктор, GripDataCollection Методы, GripDataCollection Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!