Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод RasterImageDef.SuggestName
 Послать отзыв
 Синтаксис
C#
Visual Basic
public String SuggestName(ref DBDictionary imageDictionary, ref String newImagePathName);
Public Function SuggestName(ByRef imageDictionary As DBDictionary, ByRef newImagePathName As String) As String
 Параметры
 Параметры
 Описание
 imageDictionary
 Указатель на (ранее открытый на чтение) каталог изображения, в котором это имя должно быть уникальным
 newImagePathName
 Указатель на строку, содержащую исходное имя файла или имя пути к файлу
 Описание
 Преобразует исходное имя файла изображения в строку, максимально подобную имени файла, но подходящую для использования в каталоге изображений.
 Возвращает строку с уникальным именем, подходящем для использования в каталоге изображений.
 Ссылки
 Teigha.DatabaseServices.RasterImageDef, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!