Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LinkedTableData.GetColumnName
 Послать отзыв
 Метод позволяет получить имя столбца с указанным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual String GetColumnName( int index );
Копировать Код
Public Overridable Function GetColumnName( index As Integer ) As String
 Параметры
 Параметры
 Описание
 index
 Индекс столбца. Тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице.
 Возвращает
 Возвращает имя столбца. Тип String.
 Описание
 Метод позволяет получить имя столбца с указанным индексом.
 Ссылки
 Teigha.DatabaseServices.LinkedTableData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!