Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GeoLocationData.NorthDirection
 Послать отзыв
 Свойство возвращает угол направления на истинный север как угловое отклонение от оси X в мировой системе координат.
 Синтаксис
C#
Visual Basic
Копировать Код
public double NorthDirection;
Копировать Код
Public ReadOnly Property NorthDirection As Double
 Возвращает
 Возвращает угол в радианах направления на истинный север в WCS. Тип double.
 Описание
 Свойство возвращает направление на север как угловое отклонение от оси X в мировой системе координат (МСК). По умолчанию севером считается положительное направление оси Y. Угол измеряется в радианах.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.GeoLocationData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!