Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство BlockReference.Normal
 Послать отзыв
 Синтаксис
C#
Visual Basic
public Vector3d Normal;
Public Property Normal() As Vector3d
 Описание
 Возвращает вектор нормали (в миировых координатах) к плоскости, содержащей ссылку на блок.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.BlockReference, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!