Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SectionSettings.Reset
 Послать отзыв
 Метод сбрасывает к значениям по умолчанию все настройки для всех типов сечений.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Reset();
Копировать Код
Public Sub Reset()
 Описание
 Метод сбрасывает к значениям по умолчанию все настройки для всех типов сечений.
 Ссылки
 Teigha.DatabaseServices.SectionSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!