Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Entity.LinetypeId
 Послать отзыв
 Свойство предназначено для получения или установки идентификатора записи таблицы типов линий (LinetypeTableRecord), которая связана с текущим геометрическим объектом.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectId LinetypeId;
Копировать Код
Public Property LinetypeId() As ObjectId
 Возвращает
 Возвращает значение типа ObjectId, представляющее собой ссылку на запись таблицы типов линий, определяющую стиль отображения линии объекта.
 Описание
 Свойство обеспечивает доступ к идентификатору записи таблицы типов линий, относящейся к объекту.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Entity, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!