Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GsMarkType
 Послать отзыв
 Перечисление GsMarkType определяет типы GS-меток для мультивыноски.
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdDbMLeader.gsMarkType")] public enum GsMarkType { None = 0, ArrowMark = 1, LeaderLineMark = 5001, DoglegMark = 10001, MTextMark = 15001, MTextUnderLineMark = 15002, ToleranceMark = 15003, BlockMark = 15004 }
Копировать Код
<Wrapper("OdDbMLeader.gsMarkType")> Public Enum GsMarkType None = 0 ArrowMark = 1 LeaderLineMark = 5001 DoglegMark = 10001 MTextMark = 15001 MTextUnderLineMark = 15002 ToleranceMark = 15003 BlockMark = 15004 End Enum
 Члены
 Члены
 Описание
 ArrowMark
 Значение: 1. GS-метка стрелки.
 BlockMark
 Значение: 15004. GS-метка содержимого блока.
 DoglegMark
 Значение: 10001. GS-метка полки линии выноски.
 LeaderLineMark
 Значение: 5001. GS-метка выносной линии.
 MTextMark
 Значение: 15001. GS-метка содержимого многострочного текста.
 MTextUnderLineMark
 Значение: 15002. GS-метка содержимого многострочного подчеркнутого текста (включая рамку вокруг текста, при наличии).
 None
 Значение: 0. GS-метка отсутствует.
 ToleranceMark
 Значение: 15003. GS-метка содержимого допуска.
 Описание
 Перечисление GsMarkType определяет типы GS-меток для мультивыноски.
 Ваши комментарии по поводу этого топика: Послать отзыв!