Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Viewport.SetPreviousBackground
 Послать отзыв
 Метод позволяет задать предыдущий фон в данном видовом экране. Не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetPreviousBackground( DatabaseServices.ObjectId value, GraphicsInterface.DrawableType type );
Копировать Код
Public Sub SetPreviousBackground( value As DatabaseServices.ObjectId, type As GraphicsInterface.DrawableType )
 Параметры
 Параметры
 Описание
 value
 Идентификатор объекта фона. Тип DatabaseServices.ObjectId.
 type
 Тип предыдущего объекта фона. Перечисление GraphicsInterface.DrawableType.
 Описание
 Метод позволяет задать предыдущий фон в данном видовом экране. В текущей версии не реализован.
 Ссылки
 Teigha.DatabaseServices.Viewport, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!