Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.SetOverrides
 Послать отзыв
 Метод позволяет задать переопределение в ячейке, строке или столбце.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetOverrides( int row, int column, GridLineType gridLineType, CellProperties overrd );
Копировать Код
Public virtual Sub SetOverrides( row As Integer, column As Integer, gridLineType As GridLineType, overrd As CellProperties )
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс может равняться -1.
 overrd
 Свойства переопределения из перечисления CellProperties.
 col
 Индекс столбца, тип int. Индекс может равняться -1.
 gridlineType
 Тип линии сетки из перечисления GridLineType.
 Описание
 Метод позволяет задать переопределение в ячейке, строке или столбце.
 Чтобы задать ячейку, следует указать допустимые индексы строки и столбца. Чтобы задать строку, следует указать допустимый индекс строки и -1 в качестве индекса столбца. Чтобы задать столбец, следует указать допустимый индекс столбца и -1 в качестве индекса строки.
 Замечания
 Для получения того же результата предпочтительнее использовать Table.Cells[row,column].{Top,Bottom,Left,Right}Edge.Overrides.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!