Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Solid3d
 Послать отзыв
 Класс Solid3d представляет в базе данных объекты трехмерных твердых тел.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::GraphicsInterface::Drawable Teigha::DatabaseServices::DBObject Teigha::DatabaseServices::Entity Teigha::DatabaseServices::Solid3d
 Синтаксис
C#
Visual Basic
Копировать Код
[TypeDescriptionProvider("Teigha.ComponentModel.TypeDescriptionProvider`1[[Teigha.DatabaseServices.Solid3d, TD_Mgd]], TD_Mgd")] [Wrapper("AcDb3dSolid")] public class Solid3d : Entity
Копировать Код
<TypeDescriptionProvider("Teigha.ComponentModel.TypeDescriptionProvider`1[[Teigha.DatabaseServices.Solid3d, TD_Mgd]], TD_Mgd")> <Wrapper("AcDb3dSolid")> Public Class Solid3d Inherits Entity
 Описание
 Класс Solid3d представляет в базе данных объекты трехмерных твердых тел. Этот класс наследует базовую функциональность объектов чертежа.
 Методы
 Конструкторы
 Teigha.GraphicsInterface.Drawable
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 Drawable
 Конструктор класса Teigha.GraphicsInterface.Drawable. (Унаследован от Drawable)
 Teigha.DatabaseServices.DBObject
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 DBObject
 Конструктор. (Унаследован от DBObject)
 Teigha.DatabaseServices.Solid3d
 Имя
 Описание
 Solid3d
 Конструктор по умолчанию класса Solid3d.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.GraphicsInterface.Drawable
 Имя
 Описание
 Drawable Методы
 Ниже перечислены методы класса Drawable.
 Drawable Свойства
 Ниже перечислены свойства класса Drawable.
 Teigha.DatabaseServices.DBObject
 Имя
 Описание
 DBObject Методы
 Ниже перечислены методы класса DBObject.
 DBObject Свойства
 Ниже перечислены свойства класса DBObject.
 DBObject События
 Ниже перечислены события класса DBObject.
 Teigha.DatabaseServices.Entity
 Имя
 Описание
 Entity Методы
 Ниже перечислены методы класса Entity.
 Entity Свойства
 Ниже перечислены свойства класса Entity.
 Teigha.DatabaseServices.Solid3d
 Имя
 Описание
 Solid3d Методы
 Ниже перечислены методы класса Solid3d.
 Solid3d Свойства
 Ниже перечислены свойства класса Solid3d.
 Ссылки
 Solid3d Методы, Solid3d Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства, DBObject События
 Ваши комментарии по поводу этого топика: Послать отзыв!