Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.TypedValue.ToString
 Послать отзыв
 Метод предназначен для получения строкового представления данного объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public String ToString();
Копировать Код
Public Function ToString() As String
 Возвращает
 Возвращает представление данного объекта в виде строки. Тип String.
 Описание
 Метод предназначен для получения строкового представления данного объекта.
 Ссылки
 Teigha.DatabaseServices.TypedValue, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!