Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SubDMesh.GetSubentMaterial
 Послать отзыв
 Метод предназначен для получения материала указанного подобъекта сети.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.ObjectId GetSubentMaterial( SubentityId subentId );
Копировать Код
Public Function GetSubentMaterial( subentId As SubentityId ) As DatabaseServices.ObjectId
 Параметры
 Параметры
 Описание
 subentId
 Идентификатор подобъекта. Тип SubentityId.
 Возвращает
 Возвращает ObjectId для материала подобъекта.
 Описание
 Метод предназначен для получения материала указанного подобъекта сети.
 Ссылки
 Teigha.DatabaseServices.SubDMesh, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!