Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotSettings.PlotPaperSize
 Послать отзыв
 Свойство PlotPaperSize представляет ширину и высоту листов бумаги, которые заданы в этом объекте PlotSettings.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point2d PlotPaperSize;
Копировать Код
Public ReadOnly Property PlotPaperSize As Point2d
 Возвращает
 Возвращает ширину и высоту листов бумаги. Тип Point2d.
 Описание
 Свойство PlotPaperSize представляет ширину и высоту листов бумаги, которые заданы в этом объекте PlotSettings. Размер бумаги — это физический размер носителя, включающий поля. Все расстояния представлены в миллиметрах независимо от единиц и текущего масштаба чертежа.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.PlotSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!