Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeader.SetContextDataManager
 Послать отзыв
 Метод позволяет задать указатель на менеджер данных контекста этой мультивыноски.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetContextDataManager( IntPtr contextDataManager );
Копировать Код
Public Sub SetContextDataManager( contextDataManager As IntPtr )
 Параметры
 Параметры
 Описание
 contextDataManager
 Менеджер данных контекста. Тип IntPtr.
 Описание
 Метод позволяет задать указатель на менеджер данных контекста этой мультивыноски.
 Ссылки
 Teigha.DatabaseServices.MLeader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!