Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Xline.BasePoint
 Послать отзыв
 Свойство BasePoint обеспечивает доступ к базовой точке данного объекта Xline.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d BasePoint;
Копировать Код
Public Property BasePoint() As Point3d
 Возвращает
 Возвращает или задает базовую точку данного объекта Xline. Тип Point3d.
 Описание
 Свойство BasePoint обеспечивает доступ к базовой точке данного объекта Xline.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Xline, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!