Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.GeoDataLonLatAltInfo.Latitude
 Послать отзыв
 Свойство Latitude представляет широту в градусах.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Latitude;
Копировать Код
Public Property Latitude As Double
 Возвращает
 Возвращает широту в градусах. Тип double.
 Описание
 Свойство Latitude представляет широту в градусах.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.Geometry.GeoDataLonLatAltInfo, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!