Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.EllipticalArc2d.EllipticalArc2d
 Послать отзыв
 Конструктор класса EllipticalArc2d. Создает эллиптическую дугу на базе указанной круглой дуги.
 Синтаксис
C#
Visual Basic
Копировать Код
public EllipticalArc2d( ref CircularArc2d arc );
Копировать Код
Public Sub New( ByRef arc As CircularArc2d )
 Параметры
 Параметры
 Описание
 arc
 Входная круглая дуга. Тип CircularArc2d.
 Описание
 Конструктор класса EllipticalArc2d. Создает эллиптическую дугу на базе указанной круглой дуги.
 Ссылки
 Teigha.Geometry.EllipticalArc2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!