Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CellRange.RightColumn
 Послать отзыв
 Свойство возвращает индекс правого столбца данного диапазона ячеек.
 Синтаксис
C#
Visual Basic
Копировать Код
public int RightColumn;
Копировать Код
Public ReadOnly Property RightColumn As Integer
 Возвращает
 Возвращает индекс правого столбца диапазона. Тип int.
 Описание
 Свойство возвращает индекс правого столбца данного диапазона ячеек.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.CellRange, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!