Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.BeginWblockBlockEventArgs
 Послать отзыв
 Класс представляет данные для события BeginWblockBlock базы данных.
 Иерархия классов
Teigha::DatabaseServices::BeginWblockBlockEventArgs
 Синтаксис
C#
Visual Basic
Копировать Код
public class BeginWblockBlockEventArgs : System.EventArgs;
Копировать Код
Public Class BeginWblockBlockEventArgs Inherits System.EventArgs
 Описание
 Класс представляет данные для события BeginWblockBlock базы данных.
 Методы
 Конструкторы
 ПоказатьInternal
 Нет совпадений по текущему фильтру
 Имя
 Описание
 BeginWblockBlockEventArgs
 This is BeginWblockBlockEventArgs, a member of class BeginWblockBlockEventArgs.
 Топики
 Имя
 Описание
 BeginWblockBlockEventArgs Свойства
 Ниже перечислены свойства класса BeginWblockBlockEventArgs.
 Ссылки
 BeginWblockBlockEventArgs Свойства, Методы, Топики, BeginWblockBlockEventArgs Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!