Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Scale2d.*
 Послать отзыв
 Оператор умножения структуры Scale2d. Реализует умножение скалярного множителя на вектор масштабирования.
 Синтаксис
C#
Visual Basic
Копировать Код
public static Scale2d Scale2d *( double factor, Scale2d a );
Копировать Код
Public Shared Operator *( factor As Double, a As Scale2d ) As Scale2d
 Параметры
 Параметры
 Описание
 factor
 Левый операнд. Представляет скалярный множитель. Тип double.
 a
 Правый операнд. Представляет вектор масштабирования. Тип Scale2d.
 Возвращает
 Возвращает результат умножения скалярного множителя factor на вектор масштабирования a. Тип Scale2d.
 Описание
 Оператор умножения структуры Scale2d. Возвращает результат умножения скалярного множителя factor на вектор масштабирования a.
 Ссылки
 Teigha.Geometry.Scale2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!