Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Matrix2d.PreMultiplyBy
 Послать отзыв
 Метод реализует левое умножение данной матрицы на указанную матрицу, являющуюся левым множителем.
 Синтаксис
C#
Visual Basic
Копировать Код
public Matrix2d PreMultiplyBy( Matrix2d leftSide );
Копировать Код
Public Function PreMultiplyBy( leftSide As Matrix2d ) As Matrix2d
 Параметры
 Параметры
 Описание
 leftSide
 Входная матрица, которая в произведении является левым множителем. Тип Matrix2d.
 Возвращает
 Возвращает результат левого произведения данной матрицы на матрицу leftSide. Тип Matrix2d.
 Описание
 Метод реализует левое умножение данной матрицы на матрицу leftSide, являющуюся левым множителем. Результат произведения (leftSide) х (данная матрица) сохраняется в данной матрице.
 Ссылки
 Teigha.Geometry.Matrix2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!