Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.KnotCollection.Split
 Послать отзыв
 Метод предназначен для разделения данного узлового вектора (коллекции узлов) на две части в точке, которая задается указанным значением входного параметра.
 Синтаксис
C#
Visual Basic
Копировать Код
public KnotCollection[] Split( double parameter, int multiplicityLast, int multiplicityFirst );
Копировать Код
Public Function Split( parameter As Double, multiplicityLast As Integer, multiplicityFirst As Integer ) As KnotCollection()
 Параметры
 Параметры
 Описание
 parameter
 Параметр, определяющий точку разделения данной коллекции (узлового вектора) на две части. Тип double.
 multiplicityLast
 Кратность последнего узла головной части. Тип int.
 multiplicityFirst
 Кратность первого узла хвостовой части. Тип int.
 Возвращает
 Возвращает массив из двух узловых векторов, полученных в результате разделения на две части исходного узлового вектора. Тип KnotCollection[]. Нулевой элемент массива содержит головную часть разделения, а первый - хвостовую.
 Описание
 Метод предназначен для разделения данного узлового вектора (коллекции узлов) на две части в точке, которая задается указанным значением параметра. Дополнительно позволяет настроить кратность узлов на смежных концах полученных двух узловых векторов.
 Ссылки
 Teigha.Geometry.KnotCollection, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!