Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FieldCodeFlags
 Послать отзыв
 Данное перечисление определяет флаги кодов поля.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum FieldCodeFlags { AddMarkers = 16, EscapeBackslash = 32, EvaluatedChildren = 4, EvaluatedText = 2, FieldCode = 1, ObjectReference = 8, PreserveFields = 128, StripOptions = 64, TextField = 256 }
Копировать Код
Public Enum FieldCodeFlags AddMarkers = 16 EscapeBackslash = 32 EvaluatedChildren = 4 EvaluatedText = 2 FieldCode = 1 ObjectReference = 8 PreserveFields = 128 StripOptions = 64 TextField = 256 End Enum
 Члены
 Члены
 Описание
 FieldCode
 Значение: 1. Получает необработанный код поля. Этот флаг неприменим при задании кода поля и будет игнорироваться в этом контексте.
 EvaluatedText
 Значение: 2. Получает вычисленный текст. Этот флаг неприменим при задании кода поля и будет игнорироваться в этом контексте.
 EvaluatedChildren
 Значение: 4. Получает код поля с вычисленным текстом дочерних элементов. Этот флаг комбинируется с FieldCode. Неприменим при задании кода поля и будет игнорироваться в этом контексте.
 ObjectReference
 Значение: 8. Получает внедренные в текст поля как ссылки на объекты дочерних полей, хранящиеся в аргументе ChildFields. Этот флаг действителен только для текстовых полей и используется для редактирования. Данный флаг неприменим при задании кода поля и будет игнорироваться в этом контексте.
 AddMarkers
 Значение: 16. Если этот флаг установлен, внедренные в текст поля заключаются в маркеры полей %< и >%. Этот флаг неприменим при задании кода поля и будет игнорироваться в этом контексте.
 EscapeBackslash
 Значение: 32. Если этот флаг установлен, в вычисляемом тексте все одинарные символы </c> преобразуются в двойные \. При получении кода поля этот флаг можно комбинировать с EvaluatedText или EvaluatedChildren.
 StripOptions
 Значение: 64. Если этот флаг установлен, стандартные опции, такие как идентификатор вычислителя, формат и информация о гиперссылке, удаляются из кода поля. Например, если код поля имеет вид %%, стандартные параметры удаляются и возвращается только код поля %%. Этот флаг можно комбинировать с FieldCode или EvaluatedChildren. Флаг неприменим при задании кода поля и будет игнорироваться в этом контексте.
 PreserveFields
 Значение: 128. Только для внутреннего использования. Этот флаг неприменим при получении кода поля и будет игнорироваться в этом контексте.
 TextField
 Значение: 256. Если этот флаг установлен, код поля обрабатывается как текст с внедренными полями. Этот флаг неприменим при получении кода поля и будет игнорироваться в этом контексте.
 Описание
 Данное перечисление определяет флаги кодов поля.
 Ваши комментарии по поводу этого топика: Послать отзыв!