Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Surface.FilletEdges
 Послать отзыв
 Метод позволяет создать скругления на указанных ребрах данной поверхности.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void FilletEdges( ref SubentityId[] subentityIds, ref DoubleCollection radius, ref DoubleCollection startSetback, ref DoubleCollection endSetback );
Копировать Код
Public Overridable Sub FilletEdges( ByRef subentityIds() As SubentityId, ByRef radius As DoubleCollection, ByRef startSetback As DoubleCollection, ByRef endSetback As DoubleCollection )
 Параметры
 Параметры
 Описание
 subentityIds
 Идентификаторы подобъектов ребер данной поверхности, на которых требуется создать скругления. Тип SubentityId[].
 radius
 Массив радиусов скруглений на соответствующих ребрах. Тип DoubleCollection.
 startSetback
 Массив начальных отступов на соответствующих ребрах. Тип DoubleCollection.
 endSetback
 Массив конечных отступов на соответствующих ребрах. Тип DoubleCollection.
 Описание
 , DoubleCollection, DoubleCollection, DoubleCollection)"/>
 Метод позволяет создать скругления на указанных ребрах данной поверхности.
 Замечания
 Данный метод реализован только в среде пространственного моделирования Spatial Modeler.
 Ссылки
 Teigha.DatabaseServices.Surface, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!