Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DwgFiler.WriteBoolean
 Послать отзыв
 Метод предназначен для записи заданного логического значения в этот объект Filer.
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract void WriteBoolean( bool value );
Копировать Код
Public MustOverride Sub WriteBoolean( value As Boolean )
 Параметры
 Параметры
 Описание
 value
 Записываемое в Filer значение. Тип bool.
 Описание
 Метод предназначен для записи в этот объект Filer заданного логического значения value.
 Ссылки
 Teigha.DatabaseServices.DwgFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!