Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBVisualStyle.GetTrait
 Послать отзыв
 Метод позволяет получить значение указанного свойства данного визуального стиля.
 Синтаксис
C#
Visual Basic
Копировать Код
public GraphicsInterface.Variant GetTrait( VisualStyleProperty vsProp );
Копировать Код
Public Function GetTrait( vsProp As VisualStyleProperty ) As GraphicsInterface.Variant
 Параметры
 Параметры
 Описание
 vsProp
 Запрашиваемое свойство данного визуального стиля. Значение из перечисления VisualStyleProperty.
 Возвращает
 Возвращает значение свойства. Тип GraphicsInterface.Variant.
 Описание
 Метод позволяет получить значение указанного свойства данного визуального стиля.
 Ссылки
 Teigha.DatabaseServices.DBVisualStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!