Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Polyline2d.Thickness
 Послать отзыв
 Свойство предоставляет доступ к толщине полилинии.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Thickness;
Копировать Код
Public Property Thickness() As double
 Возвращает
 Возвращает толщину полилинии, тип double.
 Описание
 Свойство предоставляет доступ к толщине полилинии. Направление этого вектора иногда называют направлением выдавливания.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Polyline2d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!