Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Cone.AxisOfSymmetry
 Послать отзыв
 Свойство AxisOfSymmetry представляет ось данного конуса.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d AxisOfSymmetry;
Копировать Код
Public ReadOnly Property AxisOfSymmetry As Vector3d
 Возвращает
 Возвращает направляющий вектор оси конуса. Тип Vector3d.
 Описание
 Свойство AxisOfSymmetry представляет ось данного конуса.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.Cone, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!