Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.PucsBase
 Послать отзыв
 Синтаксис
C#
Visual Basic
public DatabaseServices::ObjectId PucsBase;
Public Property PucsBase() As DatabaseServices.ObjectId
 Описание
 Представляет доступ к Id таблицы записей UCS (пользовательской системы координат), которая определяет положение и ориентацию ортогональной UCS для текущего пространства листа базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!