Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector2dCollectionEnumerator
 Послать отзыв
 Класс Vector2dCollectionEnumerator представляет перечислитель для коллекции Vector2dCollection.
 Иерархия классов
Teigha::Geometry::Vector2dCollectionEnumerator
 Синтаксис
C#
Visual Basic
Копировать Код
public class Vector2dCollectionEnumerator : System.Collections.IEnumerator;
Копировать Код
Public Class Vector2dCollectionEnumerator Implements System.Collections.IEnumerator
 Описание
 Класс Vector2dCollectionEnumerator представляет перечислитель для коллекции двумерных векторов Vector2dCollection.
 Топики
 Имя
 Описание
 Vector2dCollectionEnumerator Методы
 Ниже перечислены методы класса Vector2dCollectionEnumerator.
 Vector2dCollectionEnumerator Свойства
 Ниже перечислены свойства класса Vector2dCollectionEnumerator.
 Ссылки
 Vector2dCollectionEnumerator Методы, Vector2dCollectionEnumerator Свойства, Топики, Vector2dCollectionEnumerator Методы, Vector2dCollectionEnumerator Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!