Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbCurve2dData.Periodic
 Послать отзыв
 Свойство Periodic позволяет проверить, является ли данная кривая периодической.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool Periodic;
Копировать Код
Public ReadOnly Property Periodic As Boolean
 Возвращает
 Возвращает true, если кривая является периодической. В противном случае возвращает false.
 Описание
 Свойство Periodic позволяет проверить, является ли данная кривая периодической.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.NurbCurve2dData, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!