Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBDictionary Constructor
 Послать отзыв
 Конструктор по умолчанию.
 Синтаксис
C#
Visual Basic
Копировать Код
public DBDictionary();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию.
 Ссылки
 Teigha.DatabaseServices.DBDictionary, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!