Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LayoutPaperPE.DrawBorder
 Послать отзыв
 Этот метод вызывается в процессе векторизации для отрисовки границы бумажного листа.
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract bool DrawBorder( ref Layout layout, ref GraphicsInterface.WorldDraw worldDraw, ref Point3dCollection points );
Копировать Код
Public MustOverride Function DrawBorder( ByRef layout As Layout, ByRef worldDraw As GraphicsInterface.WorldDraw, ByRef points As Point3dCollection ) As Boolean
 Параметры
 Параметры
 Описание
 layout
 Векторизуемый лист. Тип Layout.
 worldDraw
 Объект WorldDraw, используемый данным методом для настройки необходимых атрибутов и создания требуемой геометрии. Тип GraphicsInterface.WorldDraw.
 points
 Коллекция точек, определяющих координаты четырех углов листа бумаги. Тип Point3dCollection.
 Возвращает
 Возвращает true, если отрисовка границ бумаги завершена успешно, и false, если лист использует для границ рендеринг по умолчанию.
 Описание
 Этот метод вызывается в процессе векторизации для отрисовки границы бумажного листа.
 Ссылки
 Teigha.DatabaseServices.LayoutPaperPE, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!