Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GraphNode.Data
 Послать отзыв
 Свойство предоставляет доступ к данным, которые связаны с данным узлом графа.
 Синтаксис
C#
Visual Basic
Копировать Код
public IntPtr Data;
Копировать Код
Public Property Data As IntPtr
 Возвращает
 Возвращает указатель на данные. Тип IntPtr.
 Описание
 Свойство предоставляет доступ к данным, которые связаны с данным узлом графа.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.GraphNode, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!