Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FitData
 Послать отзыв
 Этот класс инкапсулирует данные, возвращаемые свойством Spline.FitData.
 Иерархия классов
Teigha::DatabaseServices::FitData
 Синтаксис
C#
Visual Basic
Копировать Код
public class FitData;
Копировать Код
Public Class FitData
 Описание
 Этот класс инкапсулирует данные, возвращаемые свойством Spline.FitData.
 Если у сплайна есть данные о подгонке, то эта структура представляет все его определяющие точки (в координатах WCS), допуск аппроксимации и касательные на концах сплайна, если они существуют. Доступ к этим данным можно получить, используя метод GetFitPoints() и свойства FitTolerance, StartTangent и EndTangent, соответственно.
 Топики
 Имя
 Описание
 FitData Методы
 Ниже перечислены методы класса FitData.
 FitData Операторы
 Ниже перечислены операторы класса FitData.
 FitData Свойства
 Ниже перечислены свойства класса FitData.
 Ссылки
 FitData Методы, FitData Операторы, FitData Свойства, Топики, FitData Методы, FitData Операторы, FitData Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!