Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CircularArc2d.Center
 Послать отзыв
 Свойство Center представляет центр данной дуги.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point2d Center;
Копировать Код
Public Property Center As Point2d
 Возвращает
 Возвращает 2D-точку центра дуги. Тип Point2d.
 Описание
 Свойство Center представляет центр данной дуги.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.Geometry.CircularArc2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!