Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Xrecord.Data
 Послать отзыв
 Данное свойство обеспечивает доступ к данным XRecord.
 Синтаксис
C#
Visual Basic
Копировать Код
public ResultBuffer Data;
Копировать Код
Public Property Data() As ResultBuffer
 Возвращает
 Возвращает или изменяет данные XRecord. Тип ResultBuffer.
 Описание
 Данное свойство обеспечивает доступ к данным XRecord.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Xrecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!