Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.UnitsValue
 Послать отзыв
 Данное перечисление определяет единицы измерения длины, используемые в чертежах.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum UnitsValue { Angstroms = 11, Astronomical = 18, Centimeters = 5, Decimeters = 14, Dekameters = 15, Feet = 2, Gigameters = 17, Hectometers = 16, Inches = 1, Kilometers = 7, LightYears = 19, Meters = 6, MicroInches = 8, Microns = 13, Miles = 3, Millimeters = 4, Mils = 9, Nanometers = 12, Parsecs = 20, Undefined = 0, USSurveyFeet = 21, USSurveyInch = 22, USSurveyMile = 24, USSurveyYard = 23, Yards = 10 }
Копировать Код
Public Enum UnitsValue Angstroms = 11 Astronomical = 18 Centimeters = 5 Decimeters = 14 Dekameters = 15 Feet = 2 Gigameters = 17 Hectometers = 16 Inches = 1 Kilometers = 7 LightYears = 19 Meters = 6 MicroInches = 8 Microns = 13 Miles = 3 Millimeters = 4 Mils = 9 Nanometers = 12 Parsecs = 20 Undefined = 0 USSurveyFeet = 21 USSurveyInch = 22 USSurveyMile = 24 USSurveyYard = 23 Yards = 10 End Enum
 Члены
 Члены
 Описание
 Undefined
 Значение: 0. Единица измерения не задана.
 Inches
 Значение: 1. Британская единица измерения - дюйм.
 Feet
 Значение: 2. Британская единица измерения - фут. 1 фут = 12 дюймов.
 Miles
 Значение: 3. Британская единица измерения - миля, равная примерно 1609 м.
 Millimeters
 Значение: 4. Единица измерения - миллиметр, 1 мм = 0.001 м.
 Centimeters
 Значение: 5. Единица измерения - сантиметр, 1 см = 0.01 м.
 Meters
 Значение: 6. Единица измерения длины в системе СИ - метр.
 Kilometers
 Значение: 7. Единица измерения - километр, 1 км = 1000 м.
 MicroInches
 Значение: 8. Британская единица измерения - микродюйм, равный одной миллионной дюйма.
 Mils
 Значение: 9. Британская единица измерения - мил, равный одной тысячной дюйма.
 Yards
 Значение: 10. Британская единица измерения - ярд, длиной около 0.91 метра.
 Angstroms
 Значение: 11. Единица измерения - ангстрем, равный одной десятимиллиардной метра.
 Nanometers
 Значение: 12. Единица измерения - нанометр, равный одной миллиардной метра.
 Microns
 Значение: 13. Единица измерения - микрон, равный одной миллионной метра.
 Decimeters
 Значение: 14. Единица измерения - дециметр, равный одной десятой метра.
 Dekameters
 Значение: 15. Единица измерения - декаметр, равный 10 метрам.
 Hectometers
 Значение: 16. Единица измерения - гектометр, равный 100 метрам.
 Gigameters
 Значение: 17. Единица измерения - гигаметр, равный 10^9 метров.
 Astronomical
 Значение: 18. Астрономическая единица, используемая для измерения расстояний в астрономии. 1 а.е. точно равна 149 597 870 700 м (среднее расстояние от Земли до Солнца).
 LightYears
 Значение: 19. Единица измерения - световой год, внесистемная единица измерения расстояний в астрономии. Равна расстоянию, которое электромагнитные волны (свет) проходят в вакууме, не испытывая влияния гравитационных полей, за один юлианский год. Составляет примерно 9.46?10^15 м.
 Parsecs
 Значение: 20. Единица измерения - парсек, внесистемная единица измерения расстояний в астрономии. 1 пк примерно равен 3,086?10^16 м.
 USSurveyFeet
 Значение: 21. Геодезический фут США (1200/3937 м).
 USSurveyInch
 Значение: 22. Геодезический дюйм США (1/39.37 м)
 USSurveyYard
 Значение: 23. Геодезический ярд США (3 геодезических фута США).
 USSurveyMile
 Значение: 24. Геодезическая миля США (6336/3937 км)
 Описание
 Данное перечисление определяет единицы измерения длины, используемые в чертежах.
 Ваши комментарии по поводу этого топика: Послать отзыв!