Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.LayerEval
 Послать отзыв
 Синтаксис
C#
Visual Basic
public int LayerEval;
Public Property LayerEval() As Integer
 Описание
 Возвращает или устанавливает текущее значение заголовка LAYEREVAL.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!