Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.LinearEntity3d.Overlap
 Послать отзыв
 Метод позволяет определить область перекрытия данного объекта с указанным линейным объектом.
 Синтаксис
C#
Visual Basic
Копировать Код
public LinearEntity3d Overlap( ref LinearEntity3d line );
Копировать Код
Public Function Overlap( ByRef line As LinearEntity3d ) As LinearEntity3d
 Параметры
 Параметры
 Описание
 line
 Входной линейный объект. Тип LinearEntity3d.
 Возвращает
 Возвращает объект, который представляет область перекрытия. Тип LinearEntity3d.
 Описание
 Метод позволяет определить, перекрывается ли данный объект с указанным линейным объектом, и если да, возвращает линейный объект, который представляет область их перекрытия. В зависимости от типов проверяемых линейных объектов возвращаемая область перекрытия может быть объектом любого класса, производного от класса LinearEnt3d. Используется вызов метода LinearEntity3d.Overlap(LinearEntity3d line, Tolerance tolerance) с точностью, равной Tolerance.Global.
 Ссылки
 Teigha.Geometry.LinearEntity3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!