Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Point2d.Point2d
 Послать отзыв
 Конструктор. Создает новый объект Point2d с координатами из двух первых элементов входного массива.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point2d( ref double[] xy );
Копировать Код
Public Sub New( ByRef xy As double[] )
 Параметры
 Параметры
 Описание
 xy
 Массив координат. Тип double[].
 Описание
 Конструктор. Создает новый объект Point2d с координатами из двух первых элементов входного массива.
 Ссылки
 Teigha.Geometry.Point2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!