Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector2d.Length
 Послать отзыв
 Свойство Length представляет длину данного вектора.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Length;
Копировать Код
Public ReadOnly Property Length As Double
 Возвращает
 Возвращает длину данного вектора. Тип double.
 Описание
 Свойство Length представляет евклидову длину данного вектора.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.Vector2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!