Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GeomRef.IsValid
 Послать отзыв
 Свойство позволяет проверить, является ли данный объект действительным.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsValid;
Копировать Код
Public Property IsValid() As Boolean
 Возвращает
 Возвращает true, если данный объект является действительным. В противном случае возвращает false.
 Описание
 Свойство позволяет проверить, является ли данный объект действительным.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.GeomRef, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!