Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MentalRayRenderSettings.ShadowSamplingMultiplier
 Послать отзыв
 Свойство ShadowSamplingMultiplier представляет текущее значение множителя выборки для теней. Не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.ShadowSamplingMultiplier ShadowSamplingMultiplier;
Копировать Код
Public Property ShadowSamplingMultiplier As DatabaseServices.ShadowSamplingMultiplier
 Возвращает
 Возвращает значение множителя выборки для теней. Перечисление DatabaseServices.ShadowSamplingMultiplier.
 Описание
 Свойство ShadowSamplingMultiplier представляет текущее значение множителя выборки для теней. В текущей версии это свойство не реализовано.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MentalRayRenderSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!