Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocAction.RemoveActionsControllingObject
 Послать отзыв
 Метод отключает зависимости, контролирующие указанный объект, а также позволяет настроить обработку зависимостей со статусом "только для чтения".
 Синтаксис
C#
Visual Basic
Копировать Код
public void RemoveActionsControllingObject( Teigha.DatabaseServices.ObjectId objID, int readOnlyDependencyHandling );
Копировать Код
Public Sub RemoveActionsControllingObject( objID As Teigha.DatabaseServices.ObjectId, readOnlyDependencyHandling As Integer )
 Параметры
 Параметры
 Описание
 objID
 Объект базы данных, у которого необходимо удалить контролирующие его зависимости (write-dependencies). Тип Teigha.DatabaseServices.ObjectId.
 readOnlyDependencyHandling
 Определяет, как обрабатывать зависимости только для чтения. Тип int.
 Описание
 Метод отключает зависимости, контролирующие указанный объект, а также позволяет настроить обработку зависимостей со статусом "только для чтения". Зависимости отключаются в обратном порядке, начиная с последней зависимости и заканчивая первой. Метод на данный момент не реализован.
 Замечания
 Допустимые значения аргумента readOnlyDependencyHandling:
 Значение
 Описание
 0
 Все зависимости только для чтения сохраняются или перенаправляются на другой объект, если он указан. Зависимости для промежуточного состояния объекта будут зависеть от последнего состояния объекта, что иногда может давать неверные результаты.
 1
 Сохраняются все зависимости только для чтения или перенаправляются их на другой объект, если он указан, и они зависят от последнего состояния объекта.
 2
 Сбрасываются все зависимости у объекта.
 Ссылки
 Teigha.DatabaseServices.AssocAction, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!