Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Group.Remove
 Послать отзыв
 Метод позволяет удалить указанный объект из данной группы.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Remove( DatabaseServices.ObjectId id );
Копировать Код
Public Sub Remove( id As DatabaseServices.ObjectId )
 Параметры
 Параметры
 Описание
 id
 Идентификатор удаляемого объекта. Тип DatabaseServices.ObjectId.
 Описание
 Метод позволяет удалить указанный объект из данной группы.
 Ссылки
 Teigha.DatabaseServices.Group, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!