Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.OriginalFileSavedByMaintenanceVersion
 Послать отзыв
 Синтаксис
C#
Visual Basic
public DatabaseServices::MaintenanceReleaseVersion OriginalFileSavedByMaintenanceVersion;
Public Property OriginalFileSavedByMaintenanceVersion() As DatabaseServices.MaintenanceReleaseVersion
 Описание
 Возвращает минорную (maintenance) версию, в которой был последний раз сохранен файл чертежа, не считая текущую сессию.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!