Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MText.ColumnAutoHeight
 Послать отзыв
 Свойство определяет, должны ли динамические столбцы использовать высоту MText или высоту, заданную пользователем для каждого столбца (каждой колонки текста).
 Синтаксис
C#
Visual Basic
Копировать Код
public bool ColumnAutoHeight;
Копировать Код
Public Property ColumnAutoHeight As Boolean
 Возвращает
 Возвращает true, если динамические столбцы настроены на автоматическое использование высоты объекта MText. В противном случае возвращает false.
 Описание
 Свойство определяет, должны ли динамические столбцы использовать высоту MText или высоту, заданную пользователем для каждого столбца (каждой колонки текста). Применимо только к динамическим столбцам.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MText, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!