Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MlineStyleElementCollectionEnumerator.Current
 Послать отзыв
 Свойство представляет текущий элемент перечислителя.
 Синтаксис
C#
Visual Basic
Копировать Код
public MlineStyleElement Current;
Копировать Код
Public ReadOnly Property Current As MlineStyleElement
 Возвращает
 Возвращает текущий элемент перечислителя. Тип MlineStyleElement.
 Описание
 Свойство представляет текущий элемент перечислителя.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.MlineStyleElementCollectionEnumerator, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!