Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AbstractViewTableRecord.SetViewDirection
 Послать отзыв
 Метод переопределяет направление камеры вида для записи таблицы видов или видовых экранов в соответствии с указанным вариантом ортогонального вида из перечисления OrthographicView.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetViewDirection( OrthographicView view );
Копировать Код
Public Sub SetViewDirection( view As OrthographicView )
 Параметры
 Параметры
 Описание
 view
 Вариант ориентации ортогонального вида, связанной с ПСК. Значение из перечисления OrthographicView.
 Описание
 Метод переопределяет направление камеры вида для записи таблицы видов или видовых экранов в соответствии с указанным вариантом ортогонального вида из перечисления OrthographicView.
 Ссылки
 Teigha.DatabaseServices.AbstractViewTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!