Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Transaction.Abort
 Послать отзыв
 Этот метод прерывает текущую открытую транзакцию.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void Abort();
Копировать Код
Public virtual Sub Abort()
 Описание
 Этот метод прерывает текущую открытую транзакцию. Он инициирует откат всех изменений в объектах с момента начала транзакции.
 Ссылки
 Teigha.DatabaseServices.Transaction, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!