Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.GetBlockAttributeValue
 Послать отзыв
 Метод предназначен для получения значения атрибута блока, используя в качестве ключа идентификатор объекта ObjectId.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual String GetBlockAttributeValue( int row, int col, DatabaseServices.ObjectId attributeDefinitionId );
Копировать Код
Public virtual Function GetBlockAttributeValue( row As Integer, col As Integer, attributeDefinitionId As DatabaseServices.ObjectId ) As String
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 col
 Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
 attributeDefinitionId
 Идентификатор определения атрибута. Тип DatabaseServices.ObjectId.
 Возвращает
 Возвращает значение атрибута блока как объект String.
 Описание
 Метод предназначен для получения значения атрибута блока в ячейке, используя в качестве ключа идентификатор объекта ObjectId. Если значение атрибута не было переопределено, метод возвращает значение атрибута по умолчанию, определенное в исходном объекте AttributeDefinition. Ячейка задается индексами строки и столбца.
 Замечания
 Для получения того же результата предпочтительнее использовать Table.Cells[row,column].Contents[i].GetBlockAttributeValue.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!