Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CircularArc3d.CircularArc3d
 Послать отзыв
 Конструктор по умолчанию класса CircularArc3d. Создает трехмерную единичную окружность в плоскости XY с центром в точке (0,0,0).
 Синтаксис
C#
Visual Basic
Копировать Код
public CircularArc3d();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса CircularArc3d. Создает трехмерную единичную окружность в плоскости XY (вектор нормали (0,0,1)) с центром в точке (0,0,0).
 Ссылки
 Teigha.Geometry.CircularArc3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!