Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.UnderlayLayerCollection.CopyTo
 Послать отзыв
 Метод предназначен для копирования коллекции слоёв подложки в указанный массив, начиная с позиции с указанным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public void CopyTo( ref UnderlayLayer[] arr, int index );
Копировать Код
Public Sub CopyTo( ByRef arr() As UnderlayLayer, index As Integer )
 Параметры
 Параметры
 Описание
 arr
 Массив, в который выполняется копирование элементов данной коллекции. Тип UnderlayLayer[].
 index
 Позиция в массиве, начиная с которой в массив копируются элементы коллекции слоёв. Тип int.
 Описание
 Метод предназначен для копирования данной коллекции в указанный массив, начиная с позиции с указанным индексом.
 Ссылки
 Teigha.DatabaseServices.UnderlayLayerCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!