Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MlineJustification
 Послать отзыв
 Данное перечисление определяет типы расположения мультилинии относительно курсора, которые может иметь объект Mline.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum MlineJustification { Bottom = 2, Top = 0, Zero = 1 }
Копировать Код
Public Enum MlineJustification Bottom = 2 Top = 0 Zero = 1 End Enum
 Члены
 Члены
 Описание
 Top
 Значение: 0. Мультилиния располагается сверху от курсора.
 Zero
 Значение: 1. Мультилиния располагается без смещения относительно курсора (по центру).
 Bottom
 Значение: 2. Мультилиния располагается снизу от курсора.
 Описание
 Данное перечисление определяет типы расположения мультилинии относительно курсора, которые может иметь объект Mline.
 Ваши комментарии по поводу этого топика: Послать отзыв!