Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AttributeReference.SetAttributeFromBlock
 Послать отзыв
 Метод позволяет сформировать свойства атрибута, используя указанный объект определения атрибута, и применить входное геометрическое преобразование для обеспечения требуемого положения, размера и наклона.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetAttributeFromBlock( ref AttributeDefinition definition, Matrix3d blockTransform );
Копировать Код
Public Sub SetAttributeFromBlock( ByRef definition As AttributeDefinition, blockTransform As Matrix3d )
 Параметры
 Параметры
 Описание
 definition
 Входное определения атрибута, используемое в качестве шаблона. Тип AttributeDefinition.
 blockTransform
 Входная матрица геометрического преобразования блока. Тип Matrix3d.
 Описание
 Метод позволяет сначала сформировать свойства атрибута, используя указанный объект определения атрибута, а затем применить входное геометрическое преобразование для обеспечения требуемого положения, размера и наклона (как это было бы сделано с помощью команды INSERT).
 Ссылки
 Teigha.DatabaseServices.AttributeReference, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!