Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FieldEngine.Global
 Послать отзыв
 Свойство Global предоставляет доступ к глобальному и единственному в текущем сеансе движку вычисления полей FieldEngine.
 Синтаксис
C#
Visual Basic
Копировать Код
public static FieldEngine Global;
Копировать Код
Public Shared ReadOnly Property [Global] As FieldEngine
 Возвращает
 Возвращает ссылку на глобальный в текущем сеансе движок вычисления полей. Тип FieldEngine.
 Описание
 Свойство Global предоставляет доступ к глобальному и единственному в текущем сеансе движку вычисления полей FieldEngine.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.FieldEngine, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!