Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.Dimse1
 Послать отзыв
 Свойство управляет подавлением первой выносной линии.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool Dimse1;
Копировать Код
Public Property Dimse1 As Boolean
 Возвращает
 Возвращает true, если подавление включено. В противном случае возвращает false.
 Описание
 Свойство управляет подавлением первой выносной линии.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!