Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FullSubentityPath.GetObjectIds
 Послать отзыв
 Метод позволяет получить массив идентификаторов всех объектов, которые составляют путь к подобъекту.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectId[] GetObjectIds();
Копировать Код
Public Function GetObjectIds() As ObjectId()
 Возвращает
 Возвращает массив идентификаторов объектов. Тип ObjectId[].
 Описание
 Метод позволяет получить массив идентификаторов всех объектов, которые составляют путь к подобъекту.
 Ссылки
 Teigha.DatabaseServices.FullSubentityPath, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!