Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocArrayRectangularParameters.SetColumnCount
 Послать отзыв
 Метод позволяет задать количество столбцов в массиве.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetColumnCount( int count, ref String expression, ref String evaluatorId );
Копировать Код
Public Sub SetColumnCount( count As Integer, ByRef expression As String, ByRef evaluatorId As String )
 Параметры
 Параметры
 Описание
 count
 Количество столбцов. Тип int.
 expression
 Выражение для параметра. Тип String. Строка может быть пустой.
 evaluatorId
 Строковое представление идентификатора вычислителя. Тип String. Строка может быть пустой.
 Описание
 Метод позволяет задать количество столбцов в массиве.
 Если для параметра выражение отсутствует, строки expression и evaluatorId должны быть пустыми.
 Ссылки
 Teigha.DatabaseServices.AssocArrayRectangularParameters, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!