Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DwgFiler.FilerType
 Послать отзыв
 Свойство возвращает тип этого файлера.
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract DatabaseServices.FilerType FilerType;
Копировать Код
Public MustOverride ReadOnly Property FilerType As FilerType
 Возвращает
 Возвращает тип этого файлера как значение из перечисления Teigha.DatabaseServices.FilerType.
 Описание
 Свойство возвращает тип этого файлера.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.DwgFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!