Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Dimtp
 Послать отзыв
 Синтаксис
C#
Visual Basic
public double Dimtp;
Public Property Dimtp() As Double
 Описание
 Возвращает или устанавливает текущее значение DIMTP для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!