Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.Dimsd2
 Послать отзыв
 Свойство управляет подавлением второй размерной линии и стрелки.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool Dimsd2;
Копировать Код
Public Property Dimsd2 As Boolean
 Возвращает
 Возвращает true, если подавление включено. В противном случае возвращает false.
 Описание
 Свойство управляет подавлением второй размерной линии и стрелки.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!