Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Region.IsNull
 Послать отзыв
 Свойство IsNull позволяет проверить факт отсутствия модели ACIS, связанной с этой областью.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual bool IsNull;
Копировать Код
Public Overridable ReadOnly Property IsNull As Boolean
 Возвращает
 Возвращает true, если модель ACIS отсутствует. В противном случае возвращает false.
 Описание
 Свойство IsNull позволяет проверить факт отсутствия модели ACIS, связанной с этой областью.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Region, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!