Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObject.SetFromStyle()
 Послать отзыв
 Метод устанавливает свойство аннотации объекта в соответствии с соответствующим ему стилем, таким как стили текстовых объектов.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool SetFromStyle();
Копировать Код
Public Function SetFromStyle() As bool
 Возвращает
 Возвращает тип данных bool. Возвращает true, если аннотационное свойство объекта изменено
 Описание
 Метод устанавливает аннотационное свойство объекта из его (необязательного) связанного стиля.
 Ссылки
 Teigha.DatabaseServices.DBObject, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!