Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MeshDataCollection.MaterialIdArray
 Послать отзыв
 Свойство представляет коллекцию идентификаторов материалов.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectIdCollection MaterialIdArray;
Копировать Код
Public Property MaterialIdArray As ObjectIdCollection
 Возвращает
 Возвращает массив идентификаторов объектов-материалов. Тип ObjectIdCollection.
 Описание
 Свойство представляет коллекцию идентификаторов материалов.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MeshDataCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!