Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbCurve2dFitData.IsEqualTo
 Послать отзыв
 Проверяет, равны ли интерполяционные данные данной NURBS кривой и указанной NURBS кривой.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsEqualTo( NurbCurve2dFitData a );
Копировать Код
Public Function IsEqualTo( a As NurbCurve2dFitData ) As Boolean
 Параметры
 Параметры
 Описание
 a
 Проверяемый на равенство объект. Тип NurbCurve2dFitData.
 Возвращает
 Возвращает true, если сравниваемые объекты можно считать равными. В противном случае возвращает false.
 Описание
 Проверяет, равны ли интерполяционные данные данной NURBS кривой и указанной NURBS кривой.
 Замечания
 Объекты типа NurbCurve2dFitData считаются равными, если одновременно выполняются следующие условия:
Определяющие точки совпадают;
Степени кривых равны;
Данные о касательных присутствуют или отсутствуют одновременно для обеих кривых;
Начальные векторы касательных равны;
Конечные векторы касательных равны.
 Ссылки
 Teigha.Geometry.NurbCurve2dFitData, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!