Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SubDMesh.ConvertToSurface
 Послать отзыв
 Метод предназначен для создания нового объекта Surface из фрагмента этой сети, который задан идентификатором подобъекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public Surface ConvertToSurface( bool convertAsSmooth, SubentityId subentId );
Копировать Код
Public Function ConvertToSurface( convertAsSmooth As Boolean, subentId As SubentityId ) As Surface
 Параметры
 Параметры
 Описание
 convertAsSmooth
 Флаг, определяющий, следует ли выполнять преобразование в гладкую поверхность. Тип bool. Если задано false, то будет выполнено преобразование в граненую поверхность (faceted surface).
 subentId
 Идентификатор преобразуемого подобъекта. Тип SubentityId.
 Возвращает
 Возвращает объект Surface, преобразованный из заданного подобъекта этого SubDMesh.
 Описание
 Метод предназначен для создания нового объекта Surface из фрагмента этой сети, который задан идентификатором подобъекта.
 Ссылки
 Teigha.DatabaseServices.SubDMesh, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!