Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод BlockReference.ConvertToStaticBlock (String^)
 Послать отзыв
 Синтаксис
C#
Visual Basic
public void ConvertToStaticBlock(ref String newBlockName);
Public Sub ConvertToStaticBlock(ByRef newBlockName As String)
 Параметры
 Параметры
 Описание
 newBlockName
 Имя для нового определения блока
 Описание
 Преобразует экземпляр динамического блока в наследуемый (не динамический) блок. Note При успехе, ссылка на блок фиксирует свойства динамического блока их текущими значениями и он прекращает быть динамическим блоком. Новый блок определяется с именем newBlockName, которое не должно уже существовать в чертеже и должно удовлетворять всем ограничениям именования нормальных ссылок на блоки.
 Ссылки
 Teigha.DatabaseServices.BlockReference, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!