Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.BoundBlock2d.Set
 Послать отзыв
 Метод позволяет задать минимальную и максимальную точки данной граничной рамки.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Set( Point2d firstPoint, Point2d secondPoint );
Копировать Код
Public Sub Set( firstPoint As Point2d, secondPoint As Point2d )
 Параметры
 Параметры
 Описание
 firstPoint
 Новая минимальная точка граничной рамки. Тип Point2d.
 secondPoint
 Новая максимальная точка граничной рамки. Тип Point2d.
 Описание
 Метод позволяет задать минимальную и максимальную точки данной граничной рамки.
 Ссылки
 Teigha.Geometry.BoundBlock2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!