Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Ellipse.GetParameterAtAngle
 Послать отзыв
 Метод позволяет определить значение параметра, соответствующее указанному значению угла.
 Синтаксис
C#
Visual Basic
Копировать Код
public double GetParameterAtAngle( double angle );
Копировать Код
Public Function GetParameterAtAngle( angle As Double ) As Double
 Параметры
 Параметры
 Описание
 angle
 Входное значение угла в радианах. Тип double.
 Возвращает
 Возвращает значение параметра в интервале от 0 до 2PI. Тип double.
 Описание
 Метод позволяет определить значение параметра, соответствующее указанному значению угла.
 Ссылки
 Teigha.DatabaseServices.Ellipse, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!