Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LayoutCopiedEventArgs.Id
 Послать отзыв
 Свойство представляет идентификатор объекта исходного листа.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectId Id;
Копировать Код
Public ReadOnly Property Id As ObjectId
 Возвращает
 Возвращает идентификатор объекта исходного листа. Тип ObjectId.
 Описание
 Свойство представляет идентификатор объекта исходного листа.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.LayoutCopiedEventArgs, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!