Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ContentType
 Послать отзыв
 Данное перечисление определяет допустимые типы содержимого мультивыноски MLeader.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum ContentType { BlockContent = 1, MTextContent = 2, NoneContent = 0, ToleranceContent = 3 }
Копировать Код
Public Enum ContentType BlockContent = 1 MTextContent = 2 NoneContent = 0 ToleranceContent = 3 End Enum
 Члены
 Члены
 Описание
 NoneContent
 Значение: 0. Содержимое не задано.
 BlockContent
 Значение: 1. Содержимым является блок.
 MTextContent
 Значение: 2. Содержимым является многострочный текст.
 ToleranceContent
 Значение: 3. Содержимым является допуск.
 Описание
 Данное перечисление определяет допустимые типы содержимого мультивыноски MLeader.
 Ваши комментарии по поводу этого топика: Послать отзыв!