Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.NurbSurface.IsPointOnSurface
 Послать отзыв
 Метод позволяет проверить, располагается ли указанная точка на данной поверхности.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsPointOnSurface( Point3d point );
Копировать Код
Public Function IsPointOnSurface( point As Point3d ) As Boolean
 Параметры
 Параметры
 Описание
 point
 Входная проверяемая точка. Тип Point3d.
 Возвращает
 Возвращает true, если точка принадлежит поверхности. В противном случае возвращает false.
 Описание
 Метод позволяет проверить, располагается ли указанная точка на данной поверхности. Если поверхность не содержит никакой NURBS информации, метод выбрасывает исключение eFail.
 Ссылки
 Teigha.DatabaseServices.NurbSurface, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!