Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Entity.VisualStyleId
 Послать отзыв
 Свойство предназначено для получения или установки идентификатора полного визуального стиля, применяемого к геометрическому объекту, что определяет его внешний вид при трёхмерной визуализации.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectId VisualStyleId;
Копировать Код
Public Property VisualStyleId() As ObjectId
 Возвращает
 Возвращает значение типа ObjectId, представляющее собой ссылку на объект визуального стиля (VisualStyle), который задаёт параметры отображения объекта, такие как освещение, затенение, контуры и текстуры.
 Описание
 Свойство обеспечивает доступ к идентификатору визуального стиля объекта.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Entity, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!