Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Surface.ChamferEdges
 Послать отзыв
 Метод предназначен для создания ассоциативных фасок на указанных ребрах данной поверхности.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void ChamferEdges( ref SubentityId[] subentityIds, SubentityId baseSubentityId, double baseDist, double otherDist );
Копировать Код
Public Overridable Sub ChamferEdges( ByRef subentityIds() As SubentityId, baseSubentityId As SubentityId, baseDist As Double, otherDist As Double )
 Параметры
 Параметры
 Описание
 subentityIds
 Массив идентификаторов подобъектов ребер, к которым применяется данная операция. Тип SubentityId[].
 baseSubentityId
 Идентификатор подобъекта базовой грани, на ребрах которой создаются фаски. Тип SubentityId.
 baseDist
 Расстояние от ребра для построения фаски на базовой грани. Тип double.
 otherDist
 Расстояние от ребра для построения фасок на других гранях. Тип double.
 Описание
 Метод предназначен для создания ассоциативных фасок на указанных ребрах данной поверхности.
 Замечания
 Этот метод реализован только в среде пространственного моделирования Spatial Modeler.
 Ссылки
 Teigha.DatabaseServices.Surface, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!