Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FormattedTableData.FormattedTableData
 Послать отзыв
 Конструктор по умолчанию класса FormattedTableData.
 Синтаксис
C#
Visual Basic
Копировать Код
public FormattedTableData();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса FormattedTableData.
 Ссылки
 Teigha.DatabaseServices.FormattedTableData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!