Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Cshadow
 Послать отзыв
 Синтаксис
C#
Visual Basic
public int Cshadow;
Public Property Cshadow() As Integer
 Описание
 Возвращает или устанавливает текущее значение CSHADOW для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!