Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Делегат Teigha.DatabaseServices.LayoutCopiedEventHandler
 Послать отзыв
 This is type Teigha::DatabaseServices::LayoutCopiedEventHandler.
 Синтаксис
C#
Visual Basic
public delegate LayoutCopiedEventHandler();
Public Delegate Sub LayoutCopiedEventHandler()
 Ваши комментарии по поводу этого топика: Послать отзыв!