Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.EllipticalArc2d.IntersectWith
 Послать отзыв
 Метод вычисляет точки пересечения данного объекта с указанным линейным объектом, используя заданную геометрическую точность.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point2d[] IntersectWith( ref LinearEntity2d line, Tolerance tolerance );
Копировать Код
Public Function IntersectWith( ByRef line As LinearEntity2d, tolerance As Tolerance ) As Point2d()
 Параметры
 Параметры
 Описание
 line
 Линейный объект, точки пересечения с которым требуется вычислить. Тип LinearEntity2d.
 tolerance
 Заданная геометрическая точность. Тип Tolerance.
 Возвращает
 Возвращает массив из двух элементов. Тип Point2d[]. Первый элемент соответствует первой точке пересечения (если она существует), а второй элемент соответствует второй точке пересечения (если она существует).
 Описание
 Метод вычисляет точки пересечения данного объекта с указанным линейным объектом, используя заданную геометрическую точность. Результатом является массив точек пересечения (если они существуют).
 Замечания
 В случае отсутствия точек пересечения метод возвращает null.
 Ссылки
 Teigha.Geometry.EllipticalArc2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!