Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MText.BlockEnd
 Послать отзыв
 Свойство представляет строку окончания блока "}".
 Синтаксис
C#
Visual Basic
Копировать Код
public static String BlockEnd;
Копировать Код
Public Shared ReadOnly Property BlockEnd As String
 Возвращает
 Возвращает строку окончания блока. Тип String.
 Описание
 Свойство представляет строку окончания блока "}". Может использоваться вместо строковой константы "}", чтобы сделать код более понятным. При использовании в строке, возвращаемой из MText.Contents, "}" указывает на окончание блока.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.MText, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!