Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FitData.IsEqualTo
 Послать отзыв
 Метод предназначен для сравнения этого объекта с другим объектом FitData в пределах заданного допуска.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsEqualTo( FitData other, Tolerance tolerance );
Копировать Код
Public Function IsEqualTo( other As FitData, tolerance As Tolerance ) As Boolean
 Параметры
 Параметры
 Описание
 other
 Сравниваемый объект. Тип FitData.
 tolerance
 Допуск для сравнения на равенство. Тип Tolerance.
 Возвращает
 Возвращает true, если сравниваемые объекты совпадают в пределах заданного допуска. В противном случае возвращает false.
 Описание
 Метод предназначен для сравнения этого объекта с другим объектом FitData в пределах заданного допуска Tolerance.
 Ссылки
 Teigha.DatabaseServices.FitData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!