Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.PlanarEquationCoefficients.C
 Послать отзыв
 Свойство C представляет коэффициент c в общем уравнении плоскости.
 Синтаксис
C#
Visual Basic
Копировать Код
public double C;
Копировать Код
Public ReadOnly Property C As Double
 Возвращает
 Возвращает коэффициент c в общем уравнении плоскости. Тип double.
 Описание
 Свойство C представляет коэффициент c в общем уравнении плоскости.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.PlanarEquationCoefficients, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!