Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Database.DxfIn
 Послать отзыв
 Синтаксис
C#
Visual Basic
public void DxfIn(ref String fileName, ref String logFilename);
Public Sub DxfIn(ByRef fileName As String, ByRef logFilename As String)
 Параметры
 Параметры
 Описание
 fileName
 Полный путь к файлу DXF, который должен быть прочитан в базу данных
 logFilename
 Имя файла для записи всех ошибок и предупреждений при чтении файла DXF
 Описание
 Функция читает файл DXF, связанный с объектом базы данных.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!