Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObjectReferenceCollection.IndexOf
 Послать отзыв
 Метод позволяет выяснить индекс элемента коллекции, который соответствует указанной объектной ссылке.
 Синтаксис
C#
Visual Basic
Копировать Код
public int IndexOf( DBObjectReference value );
Копировать Код
Public Function IndexOf( value As DBObjectReference ) As Integer
 Параметры
 Параметры
 Описание
 value
 Входная объектная ссылка. Тип DBObjectReference.
 Возвращает
 Возвращает индекс найденного элемента коллекции. Тип int. В случае отсутствия искомого элемента метод возвращает значение -1.
 Описание
 Метод позволяет выяснить индекс элемента коллекции, который соответствует указанной объектной ссылке value.
 Ссылки
 Teigha.DatabaseServices.DBObjectReferenceCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!