Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LinkedTableData.NumberOfColumns
 Послать отзыв
 Свойство представляет количество столбцов в данной таблице.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual int NumberOfColumns;
Копировать Код
Public Overridable ReadOnly Property NumberOfColumns As Integer
 Возвращает
 Возвращает количество столбцов. Тип int.
 Описание
 Свойство представляет количество столбцов в данной таблице.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.LinkedTableData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!