Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ObjectIdCollection.Count
 Послать отзыв
 Свойство представляет общее количество идентификаторов объектов в этой коллекции.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual int Count;
Копировать Код
Public Overridable ReadOnly Property Count As Integer
 Возвращает
 Возвращает общее количество элементов в коллекции. Тип int.
 Описание
 Свойство представляет общее количество идентификаторов объектов в этой коллекции.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.ObjectIdCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!