Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 BlockTableRecord.IncludingErased
 Послать отзыв
 Свойство предназначено для получения копии определения блока, включающей удаленные из него примитивы.
 Синтаксис
C#
Visual Basic
Копировать Код
public BlockTableRecord IncludingErased { get; }
Копировать Код
Public ReadOnly Property IncludingErased As BlockTableRecord
 Возвращает
 Возвращает определение блока BlockTableRecord, значение свойства IncludingErased.
 Описание
 В свойстве хранится копия определения блока, включающая удаленные из этого определения примитивы.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.BlockTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!