Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ResultBuffer.GetHashCode
 Послать отзыв
 Метод предназначен для получения хэш-кода этого объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public int GetHashCode();
Копировать Код
Public Function GetHashCode() As Integer
 Возвращает
 Возвращает хэш-код этого объекта, тип int.
 Описание
 Метод предназначен для получения хэш-кода этого объекта.
 Подробные сведения см. в документации Microsoft .NET API.
 Ссылки
 Teigha.DatabaseServices.ResultBuffer, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!