Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LayerStateManager.CompareLayerStateToDb
 Послать отзыв
 Сравнивает значения слоя, сохраненные в состоянии слоя, со значениями текущего слоя в чертеже.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool CompareLayerStateToDb( ref String name, DatabaseServices.ObjectId idVp );
Копировать Код
Public Function CompareLayerStateToDb( ByRef name As String, idVp As DatabaseServices.ObjectId ) As Boolean
 Параметры
 Параметры
 Описание
 name
 Имя состояния слоя, которое необходимо сравнить с состоянием слоя в чертеже, тип String.
 idVp
 Идентификатор ObjectId видового экрана, настройки VPLAYER которого должны использоваться при сравнении.
 Возвращает
 Возвращает true, если состояние слоя соответствует состоянию слоя в чертеже, и false в противном случае.
 Описание
 Сравнивает значения слоя, сохраненные в состоянии слоя, со значениями текущего слоя в чертеже. Этот метод сравнивает все значения, за исключением описания слоя. Метод может также использовать VPLAYER и переопределять настройки видового экрана для сравнения видимости и переопределяемых свойств. Чтобы игнорировать настройки видового экрана, укажите Null для аргумента idVp.
 Ссылки
 Teigha.DatabaseServices.LayerStateManager, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!