Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.LineSegment2d.LineSegment2d
 Послать отзыв
 Конструктор по умолчанию класса LineSegment2d.
 Синтаксис
C#
Visual Basic
Копировать Код
public LineSegment2d();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса LineSegment2d. Строит линейный сегмент с концами в точках (0,0) и (1,0).
 Ссылки
 Teigha.Geometry.LineSegment2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!