Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Filters.IndexUpdateData.SetIdFlags
 Послать отзыв
 Этот метод позволяет задать флаги, связанные указанным идентификатором объекта ObjectId.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetIdFlags( ObjectId id, unsigned char flags );
Копировать Код
Public Sub SetIdFlags( id As ObjectId, flags As unsigned char )
 Параметры
 Параметры
 Описание
 id
 Входной идентификатор объекта, с которым связаны флаги flags. Тип ObjectId.
 flags
 Флаги, связанные с идентификатором id. Тип unsigned char.
 Описание
 Этот метод позволяет задать флаги, связанные указанным идентификатором объекта ObjectId.
 Ссылки
 Teigha.DatabaseServices.Filters.IndexUpdateData, Teigha.DatabaseServices.Filters
 Ваши комментарии по поводу этого топика: Послать отзыв!