Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.UcsTableRecord.GetUcsBaseOrigin
 Послать отзыв
 Метод позволяет получить трехмерную точку начала пользовательской системы координат (UCS) для указанного ортогонального вида, при условии, что в системной переменной UCSBASE сохранено имя данной UCS.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d GetUcsBaseOrigin( DatabaseServices.OrthographicView view );
Копировать Код
Public Function GetUcsBaseOrigin( view As DatabaseServices.OrthographicView ) As Point3d
 Параметры
 Параметры
 Описание
 view
 Тип ортогонального вида из перечисления DatabaseServices.OrthographicView.
 Возвращает
 Возвращает точку начала пользовательской системы координат. Тип Point3d.
 Описание
 Метод позволяет получить трехмерную точку начала пользовательской системы координат (UCS) для указанного ортогонального вида, при условии, что в системной переменной UCSBASE сохранено имя данной UCS. Координаты начала предоставляются в мировой системе координат (WCS, МСК).
 Ссылки
 Teigha.DatabaseServices.UcsTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!