Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.SuppressZeroFeet
 Послать отзыв
 Свойство управляет подавлением отображения нулевого значения целых футов в размере формата футы-дюймы, если футы и дюймы являются основными единицами измерения.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool SuppressZeroFeet;
Копировать Код
Public Property SuppressZeroFeet As Boolean
 Возвращает
 Возвращает true, если подавление включено. В противном случае возвращает false.
 Описание
 Свойство управляет подавлением отображения нулевого значения целых футов в размере формата футы-дюймы, если футы и дюймы являются основными единицами измерения.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!