Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Surface.BooleanSubtract
 Послать отзыв
 Метод предназначен для выполнения операции логического вычитания указанного твердого тела из данной поверхности.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual Surface BooleanSubtract( ref Solid3d solid );
Копировать Код
Public Overridable Function BooleanSubtract( ByRef solid As Solid3d ) As Surface
 Параметры
 Параметры
 Описание
 solid
 Трехмерное твердое тело, которое вычитается из данного объекта. Тип Solid3d.
 Возвращает
 Возвращает поверхность, являющуюся результатом логического вычитания. Тип Surface.
 Описание
 Метод реализует операцию логического вычитания указанного твердого тела из данной поверхности.
 Если получившаяся поверхность не является производной от класса Surface, результат сохраняется в данном объекте. В противном случае данный объект не изменяется, и метод возвращает результирующую поверхность.
 В случае отсутствия пересечения поверхности с телом метод выбрасывает исключение eNoIntersections, возвращает NULL и данный объект не изменяется. Если операцию логического вычитания успешно завершить не удается, метод возвращает NULL, и данный объект не изменяется.
 Замечания
 Данный метод реализован только в ModelerGeometry и в среде пространственного моделирования Spatial Modeler.
 Ссылки
 Teigha.DatabaseServices.Surface, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!