Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ExtrudedSurface.Height
 Послать отзыв
 Свойство Height обеспечивает доступ к длине экструзии.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Height;
Копировать Код
Public Property Height As Double
 Возвращает
 Возвращает длину экструзии. Тип double.
 Описание
 Свойство Height обеспечивает доступ к длине экструзии.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.ExtrudedSurface, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!