Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MTextFragment.CapsHeight
 Послать отзыв
 Свойство возвращает высоту текста.
 Синтаксис
C#
Visual Basic
Копировать Код
public double CapsHeight;
Копировать Код
Public ReadOnly Property CapsHeight As Double
 Возвращает
 Возвращает высоту текста. Тип double.
 Описание
 Свойство возвращает высоту текста.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.MTextFragment, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!