Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Entity.ExplodeGeometryToOwnerSpace()
 Послать отзыв
 Метод разбивает этот объект на набор более простых объектов и добавляет их в блок-владелец исходного объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public void ExplodeGeometryToOwnerSpace();
Копировать Код
Public Sub ExplodeGeometryToOwnerSpace()
 Описание
 Метод разбивает объект на более простые подобъекты и добавляет их в тот же блок (BlockTableRecord), которому принадлежит исходный объект. Созданные объекты могут являться или не являться резидентами базы данных в зависимости от владельца блока исходного объекта. Если запись таблицы блоков/блок является резидентом базы данных, то созданные объекты также будут резидентами базы данных. Если запись таблицы блоков не является резидентом базы данных, то созданные объекты также не будут резидентами базы данных.
 Ссылки
 Teigha.DatabaseServices.Entity, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!