Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Shape.Oblique
 Послать отзыв
 Свойство Oblique представляет угол наклона данного объекта в интервале [-85 .. +85] градусов.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Oblique;
Копировать Код
Public Property Oblique As Double
 Возвращает
 Возвращает угол наклона объекта в радианах. Тип double.
 Описание
 Свойство Oblique представляет угол наклона данного объекта. Диапазон значений свойства представлен интервалом [-1,48335 .. 1,48335] радиан или [-85 .. +85] градусов.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Shape, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!