Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ObjectContextCollectionEnumerator.MoveNext
 Послать отзыв
 Метод обеспечивает переход перечислителя к следующему объекту ObjectContext в данной коллекции.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual bool MoveNext();
Копировать Код
Public Overridable Function MoveNext() As Boolean
 Возвращает
 Возвращает true, если переход к следующему объекту ObjectContext выполнен успешно. Если достигнут конец коллекции, возвращает false.
 Описание
 Метод обеспечивает переход перечислителя к следующему объекту ObjectContext в данной коллекции.
 Ссылки
 Teigha.DatabaseServices.ObjectContextCollectionEnumerator, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!