Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotSettings.CustomPrintScale
 Послать отзыв
 Свойство CustomPrintScale представляет пользовательский масштаб печати для данного объекта PlotSettings.
 Синтаксис
C#
Visual Basic
Копировать Код
public CustomScale CustomPrintScale;
Копировать Код
Public ReadOnly Property CustomPrintScale As CustomScale
 Возвращает
 Возвращает объект пользовательского масштаба. Тип CustomScale.
 Описание
 Свойство CustomPrintScale представляет пользовательский масштаб печати для данного объекта PlotSettings. Пользовательский масштаб печати всегда отражает тот масштаб, который реально будет использоваться при печати, т.е. отношение единиц на бумажном носителе к единицам исходного пространства.
 Замечания
 См. также свойство UseStandardScale.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.PlotSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!