Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LoftedSurface.Closed
 Послать отзыв
 Свойство предоставляет возможность проверить замкнутость полученной вытянутой поверхности.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool Closed;
Копировать Код
Public Property Closed As Boolean
 Возвращает
 Возвращает true, если поверхность является замкнутой. В противном случае возвращает false.
 Описание
 Свойство предоставляет возможность проверить замкнутость полученной вытянутой поверхности.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.LoftedSurface, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!