Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.EllipticalCone.GetHeightAt
 Послать отзыв
 Метод предоставляет высоту данного эллиптического конуса, соответствующую указанному значению параметра U.
 Синтаксис
C#
Visual Basic
Копировать Код
public double GetHeightAt( double parameter );
Копировать Код
Public Function GetHeightAt( parameter As Double ) As Double
 Параметры
 Параметры
 Описание
 parameter
 Значение параметра U эллиптического конуса. Тип double.
 Возвращает
 Возвращает высоту эллиптического конуса для переданного в метод значения параметра U. Тип double.
 Описание
 Метод предоставляет высоту данного эллиптического конуса, соответствующую указанному значению параметра U (указанному положению на параметрической оси U конуса).
 Ссылки
 Teigha.Geometry.EllipticalCone, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!