Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.GeoDataLonLatAltInfo.GeoDataLonLatAltInfo
 Послать отзыв
 Конструктор структуры GeoDataLonLatAltInfo. Создает новый экземпляр структуры с указанными значениями долготы, широты и высоты.
 Синтаксис
C#
Visual Basic
Копировать Код
public GeoDataLonLatAltInfo( double dbLong, double dbLat, double dbAlt );
Копировать Код
Public Sub New( dbLong As Double, dbLat As Double, dbAlt As Double )
 Параметры
 Параметры
 Описание
 dbLong
 Долгота в градусах. Тип double.
 dbLat
 Широта в градусах. Тип double.
 dbAlt
 Высота над уровнем моря в метрах. Тип double.
 Описание
 Конструктор структуры GeoDataLonLatAltInfo. Создает новый экземпляр структуры с указанными значениями долготы, широты и высоты.
 Замечания
 Эта структура удобна для хранения и передачи геопространственных данных.
 Ссылки
 Teigha.Geometry.GeoDataLonLatAltInfo, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!