Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector2dCollection.Clear
 Послать отзыв
 Метод удаляет из коллекции все элементы.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Clear();
Копировать Код
Public Sub Clear()
 Описание
 Метод удаляет из коллекции все элементы. После завершения метода свойство Count коллекции возвращает значение 0.
 Ссылки
 Teigha.Geometry.Vector2dCollection, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!