Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObject.SetObjectIdsInFlux()
 Послать отзыв
 Метод вызывается для вновь созданного клонированного объекта, чтобы указать, что его идентификатор объекта недействителен.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetObjectIdsInFlux();
Копировать Код
Public Sub SetObjectIdsInFlux()
 Описание
 Этот метод должен быть вызван для любого только созданного в методах DBObject.DeepClone или DBObject.WblockClone объекта. В этом случае Id ссылочных объектов еще не указывает на корректные объекты. Ссылки должны быть преобразованы, только когда операция DeepClone полностью завершится.
 Ссылки
 Teigha.DatabaseServices.DBObject, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!