Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.SurfaceSurfaceIntersector.IntersectParameterCurve
 Послать отзыв
 Метод позволяет получить параметрическую 2D-кривую, представляющую на выбранной поверхности пересечение с указанным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public Curve2d IntersectParameterCurve( int number, bool isExternal, bool isFirst );
Копировать Код
Public Function IntersectParameterCurve( number As Integer, isExternal As Boolean, isFirst As Boolean ) As Curve2d
 Параметры
 Параметры
 Описание
 number
 Индекс кривой пересечения. Индексация начинается с нуля. Тип int.
 isExternal
 Флаг, указывающий, следует ли возвращать дескриптор внешней кривой (не реализован). Тип bool.
 isFirst
 Если данный флаг принимает значение true, метод возвращает кривую на первой поверхности, в противном случае возвращает кривую на второй поверхности. Тип bool.
 Возвращает
 Возвращает параметрическую 2D-кривую на указанной поверхности, представляющую пересечение с индексом number. Тип Curve2d.
 Описание
 Метод позволяет получить параметрическую 2D-кривую, представляющую на выбранной поверхности пересечение с указанным индексом.
 Замечания
 Метод выбрасывает следующие исключения:
kXXIndexOutOfRange, если указанный индекс выходит за пределы диапазона допустимых значений;
kXXWrongDimensionAtIndex в случае неверной размерности указанного пересечения;
kXXUnknown, если данный объект пересечения не инициализирован.
 Ссылки
 Teigha.Geometry.SurfaceSurfaceIntersector, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!