Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.PolylineCurve3d.SetFitPointAt
 Послать отзыв
 Метод переопределяет определяющую точку сплайна с указанным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetFitPointAt( int i, Point3d point );
Копировать Код
Public Sub SetFitPointAt( i As Integer, point As Point3d )
 Параметры
 Параметры
 Описание
 i
 Входной индекс определяющей точки. Тип int.
 point
 Новые координаты определяющей точки с указанным индексом. Тип Point3d.
 Описание
 Метод переопределяет координаты определяющей точки сплайна с индексом i.
 Ссылки
 Teigha.Geometry.PolylineCurve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!