Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FeatureControlFrame.SetOrientation
 Послать отзыв
 Метод позволяет задать векторы ориентации данного объекта FeatureControlFrame.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetOrientation( Vector3d norm, Vector3d dir );
Копировать Код
Public Overridable Sub SetOrientation( norm As Vector3d, dir As Vector3d )
 Параметры
 Параметры
 Описание
 norm
 Вектор нормали плоскости данного символа допусков. Тип Vector3d.
 dir
 Направляющий вектор оси X данного символа допусков в указанной плосткости. Тип Vector3d.
 Описание
 Метод позволяет задать векторы ориентации этого объекта FeatureControlFrame.
 Ссылки
 Teigha.DatabaseServices.FeatureControlFrame, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!