Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotSettingsValidator.SetPlotCentered
 Послать отзыв
 Метод предназначен для управления центрированием чертежа на листе бумаги с учетом настроек печати PlotSettings.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetPlotCentered( ref PlotSettings plotSet, bool isCentered );
Копировать Код
Public Sub SetPlotCentered( ByRef plotSet As PlotSettings, isCentered As Boolean )
 Параметры
 Параметры
 Описание
 plotSet
 Входной объект PlotSettings с настройками печати.
 isCentered
 Входной флаг, управляющий центрированием при печати на листе. Тип bool. В случае значения true поля печати на бумаге вычисляются автоматически так, чтобы расположить чертеж по центру листа.
 Описание
 Метод предназначен для управления центрированием чертежа на листе бумаги с учетом настроек печати PlotSettings.
 Ссылки
 Teigha.DatabaseServices.PlotSettingsValidator, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!