Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbSurface.Weights
 Послать отзыв
 Свойство Weights представляет массив весов.
 Синтаксис
C#
Visual Basic
Копировать Код
public DoubleCollection Weights;
Копировать Код
Public ReadOnly Property Weights As DoubleCollection
 Возвращает
 Возвращает массив весов. Тип DoubleCollection.
 Описание
 Свойство Weights представляет массив весов.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.NurbSurface, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!