Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.LinearEntity3d.Overlap
 Послать отзыв
 Метод позволяет определить область перекрытия данного объекта и указанного линейного объекта, вычисленную с некоторой заданной точностью.
 Синтаксис
C#
Visual Basic
Копировать Код
public LinearEntity3d Overlap( ref LinearEntity3d line, Tolerance tolerance );
Копировать Код
Public Function Overlap( ByRef line As LinearEntity3d, tolerance As Tolerance ) As LinearEntity3d
 Параметры
 Параметры
 Описание
 line
 Входной линейный объект. Тип LinearEntity3d.
 tolerance
 Входная геометрическая точность. Тип Tolerance.
 Возвращает
 Возвращает объект, который представляет область перекрытия. Тип LinearEntity3d.
 Описание
 Метод позволяет определить с некоторой заданной точностью, перекрывается ли данный объект с указанным линейным объектом, и если да, возвращает линейный объект, который представляет область их перекрытия.
 В зависимости от типов проверяемых линейных объектов возвращаемая область перекрытия может быть объектом любого класса, производного от класса LinearEnt3d.
 Ссылки
 Teigha.Geometry.LinearEntity3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!