Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeader.TextAttachmentType
 Послать отзыв
 Свойство представляет вариант расположения точки прикрепления выносной линии к многострочному тексту.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.TextAttachmentType TextAttachmentType;
Копировать Код
Public Property TextAttachmentType As DatabaseServices.TextAttachmentType
 Возвращает
 Возвращает вариант расположения точки прикрепления. Перечисление DatabaseServices.TextAttachmentType.
 Описание
 Свойство представляет вариант расположения точки прикрепления выносной линии к многострочному тексту.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MLeader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!