Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Light.Intensity
 Послать отзыв
 Свойство представляет интенсивность данного источника света.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Intensity;
Копировать Код
Public Property Intensity As Double
 Возвращает
 Возвращает интенсивность источника света. Тип double.
 Описание
 Свойство представляет интенсивность данного источника света. Значение 0.0 означает, что источник выключен.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Light, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!