Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CellRange
 Послать отзыв
 Этот класс представляет диапазоны ячеек таблицы.
 Иерархия классов
Teigha::DatabaseServices::CellRange
 Синтаксис
C#
Visual Basic
Копировать Код
[DefaultMember("Item")] [Wrapper("AcCellRange")] public class CellRange : ISubObject, System.Collections.IEnumerable;
Копировать Код
<DefaultMember("Item")> <Wrapper("AcCellRange")> Public Class CellRange Inherits ISubObject Inherits System.Collections.IEnumerable
 Описание
 Этот класс представляет диапазоны ячеек таблицы.
 Топики
 Имя
 Описание
 CellRange Методы
 Ниже перечислены методы класса CellRange.
 CellRange Операторы
 Ниже перечислены операторы класса CellRange.
 CellRange Свойства
 Ниже перечислены свойства класса CellRange.
 Ссылки
 CellRange Методы, CellRange Операторы, CellRange Свойства, Топики, CellRange Методы, CellRange Операторы, CellRange Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!