Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve2d.BoundBlock
 Послать отзыв
 Свойство BoundBlock представляет ориентированную двумерную граничную рамку для данной кривой. Стороны такой граничной рамки не обязаны быть параллельными осям системы координат.
 Синтаксис
C#
Visual Basic
Копировать Код
public BoundBlock2d BoundBlock;
Копировать Код
Public ReadOnly Property BoundBlock As BoundBlock2d
 Возвращает
 Возвращает двумерную граничную рамку для данной кривой. Тип BoundBlock2d.
 Описание
 Свойство BoundBlock представляет ориентированную двумерную граничную рамку для данной кривой. Стороны такой граничной рамки не обязаны быть параллельными осям системы координат.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.Curve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!