Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotSettings.ShadePlotResLevel
 Послать отзыв
 Свойство ShadePlotResLevel представляет уровень разрешения при тонированной печати, предусмотренный данным объектом PlotSettings.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.ShadePlotResLevel ShadePlotResLevel;
Копировать Код
Public Property ShadePlotResLevel As DatabaseServices.ShadePlotResLevel
 Возвращает
 Возвращает уровень разрешения при печати. Значение из перечисления Teigha.DatabaseServices.ShadePlotResLevel.
 Описание
 Свойство ShadePlotResLevel представляет уровень разрешения при тонированной печати, предусмотренный данным объектом PlotSettings (черновая печать, предварительный просмотр, нормальная печать и т.д.).
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.PlotSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!