Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObject.ObjectBirthVersion
 Послать отзыв
 Свойство предоставляет набор параметров объекта в исходной версии.
 Синтаксис
C#
Visual Basic
Копировать Код
public FullDwgVersion ObjectBirthVersion;
Копировать Код
Public Property ObjectBirthVersion() As FullDwgVersion
 Возвращает
 Возвращает набор параметров объекта, тип FullDwgVersion.
 Описание
 Свойство предоставляет данные начальной версии объекта. Начальная версия объекта — это версия, в которой класс был введен. Эта информация требуется для определения того, когда класс был зарегистрирован в nanoCAD.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.DBObject, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!