Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SubentityOverrule.GetSubentPathsAtGsMarker
 Послать отзыв
 Данный метод переопределяет метод Entity.GetSubentityPathsAtGraphicsMarker() и вызывает его в случае реализации по умолчанию.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual FullSubentityPath[] GetSubentPathsAtGsMarker( ref Entity entity, SubentityType type, IntPtr gsMark, Point3d pickPoint, Matrix3d viewXform, ref ObjectId[] entAndInsertStack );
Копировать Код
Public virtual Function GetSubentPathsAtGsMarker( ByRef entity As Entity, type As SubentityType, gsMark As IntPtr, pickPoint As Point3d, viewXform As Matrix3d, ByRef entAndInsertStack As ObjectId() ) As FullSubentityPath()
 Параметры
 Параметры
 Описание
 entity
 Объект чертежа, тип Entity.
 gsMark
 Маркер GS, представляющий конкретный подобъект. Тип IntPtr.
 pickPoint
 Координаты точки, выделенной во время выбора объекта. Тип Point3d в мировой системе координат (WCS).
 viewXform
 Матрица преобразования из мировой системы координат (WCS) в систему координат дисплея (DCS). Тип Matrix3d.
 entAndInsertStack
 Массив идентификаторов ObjectId объектов, которые являются вложенными контейнерами подобъекта. Тип ObjectId[].
 type
 Тип подобъекта, SubentityType.
 Возвращает
 Возвращает массив полных путей подобъектов, которые найдены с использованием GS маркера. Тип FullSubentityPath[].
 Описание
 Данный метод переопределяет метод Entity.GetSubentityPathsAtGraphicsMarker() и вызывает его при реализации по умолчанию.
 Метод Entity.GetSubentityPathsAtGraphicsMarker() в реализации по умолчанию возвращает массив полных путей подобъектов, которые найдены с использованием GS маркера. Метод GetSubentityPathsAtGraphicsMarker() настоящего класса позволяет переопределить этот механизм.
 Ссылки
 Teigha.DatabaseServices.SubentityOverrule, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!