Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.RevolveOptionsCheckRevolveCurveOut.Planar
 Послать отзыв
 Свойство Planar позволяет определить, является ли профиль плоской кривой.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool Planar;
Копировать Код
Public ReadOnly Property Planar As Boolean
 Возвращает
 Возвращает true, если профиль является плоским. В противном случае возвращает false.
 Описание
 Свойство Planar позволяет определить, является ли профиль плоской кривой.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.RevolveOptionsCheckRevolveCurveOut, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!