Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeader.getOverridedMLeaderStyle
 Послать отзыв
 Метод предоставляет набор свойств данной мультивыноски, включая значения переопределений.
 Синтаксис
C#
Visual Basic
Копировать Код
public void getOverridedMLeaderStyle( ref MLeaderStyle mleaderStyle );
Копировать Код
Public Sub getOverridedMLeaderStyle( ByRef mleaderStyle As MLeaderStyle )
 Параметры
 Параметры
 Описание
 mleaderStyle
 Возвращаемые свойства объекта MLeader. Тип MLeaderStyle.
 Описание
 Метод предоставляет набор свойств данной мультивыноски, включая значения переопределений.
 Ссылки
 Teigha.DatabaseServices.MLeader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!