Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Light.FalloffAngle
 Послать отзыв
 Свойство представляет полный угол светового конуса, геометрически определяющий спад освещенности для данного источника света.
 Синтаксис
C#
Visual Basic
Копировать Код
public double FalloffAngle;
Копировать Код
Public ReadOnly Property FalloffAngle As Double
 Возвращает
 Возвращает полный угол светового конуса (в радианах). Тип double.
 Описание
 Свойство представляет полный угол светового конуса, геометрически определяющий спад освещенности для данного источника света.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Light, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!