Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DataTable.NumRows
 Послать отзыв
 Свойство предоставляет доступ к текущему количеству строк в таблице.
 Синтаксис
C#
Visual Basic
Копировать Код
public int NumRows;
Копировать Код
Public Property NumRows() As Integer
 Возвращает
 Возвращает текущее количество строк в таблице. Тип int.
 Описание
 Свойство предоставляет доступ к текущему количеству строк в таблице.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.DataTable, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!