Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbCurve2dFitData.StartTangent
 Послать отзыв
 Свойство StartTangent представляет направление касательной в начальной точке кривой.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector2d StartTangent;
Копировать Код
Public ReadOnly Property StartTangent As Vector2d
 Возвращает
 Возвращает касательный вектор в начальной точке кривой. Тип Vector2d.
 Описание
 Свойство StartTangent представляет направление касательной в начальной точке кривой.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.NurbCurve2dFitData, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!