Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.SurfaceSurfaceIntersector.Tolerance
 Послать отзыв
 Свойство Tolerance представляет текущее значение геометрической точности, которая используется данным объектом для вычисления пересечений.
 Синтаксис
C#
Visual Basic
Копировать Код
public Geometry.Tolerance Tolerance;
Копировать Код
Public ReadOnly Property Tolerance As Geometry.Tolerance
 Возвращает
 Возвращает текущее значение геометрической точности. Тип Geometry.Tolerance.
 Описание
 Свойство Tolerance представляет текущее значение геометрической точности, которая используется данным объектом для вычисления пересечений.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.SurfaceSurfaceIntersector, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!