Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Line2dCollection.CopyTo
 Послать отзыв
 Метод копирует элементы данной коллекции в указанный массив по указанному индексу.
 Синтаксис
C#
Visual Basic
Копировать Код
public void CopyTo( ref Line2d[] array, int index );
Копировать Код
Public Sub CopyTo( ByRef array As Line2d(), index As Integer )
 Параметры
 Параметры
 Описание
 array
 Целевой массив, в который требуется скопировать элементы данной коллекции. Тип Line2d[].
 index
 Индекс в массиве, начиная с которого в массиве сохраняются элементы коллекции. Тип int.
 Описание
 Метод копирует элементы данной коллекции в указанный массив по указанному индексу.
 Ссылки
 Teigha.Geometry.Line2dCollection, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!