Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.RowType
 Послать отзыв
 Данное перечисление определяет все поддерживаемые типы строк в таблицах.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum RowType { UnknownRow = 0, DataRow = 1, TitleRow = 2, HeaderRow = 4 }
Копировать Код
Public Enum RowType UnknownRow = 0 DataRow = 1 TitleRow = 2 HeaderRow = 4 End Enum
 Члены
 Члены
 Описание
 UnknownRow
 Значение: 0. Тип строки не задан.
 DataRow
 Значение: 1. Строка, которая не является ни строкой наименования таблицы, ни строкой заголовков столбцов (строка для данных).
 TitleRow
 Значение: 2. Строка с наименованием таблицы. Может быть как самой верхней, так и самой нижней строкой таблицы в зависимости от заданного направления таблицы.
 HeaderRow
 Значение: 4. Строка заголовков столбцов. Следует непосредственно за строкой наименования таблицы.
 Описание
 Данное перечисление определяет все поддерживаемые типы строк в таблицах.
 Ваши комментарии по поводу этого топика: Послать отзыв!