Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SectionSettings.SetHatchVisibility
 Послать отзыв
 Метод позволяет управлять видимостью штриховки для геометрии указанного типа.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetHatchVisibility( SectionType nSecType, SectionGeometry nGeometry, bool bVisible );
Копировать Код
Public Sub SetHatchVisibility( nSecType As SectionType, nGeometry As SectionGeometry, bVisible As Boolean )
 Параметры
 Параметры
 Описание
 nSecType
 Тип сечения. Перечисление SectionType.
 nGeometry
 Типы элементов геометрии сечения. Перечисление SectionGeometry.
 bVisible
 Входной флаг видимости штриховки. Тип bool. Передать значение true, если штриховка должна быть видимой. В противном случае передать false.
 Описание
 Метод позволяет управлять видимостью штриховки для геометрии указанного типа.
 Ссылки
 Teigha.DatabaseServices.SectionSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!