Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DwgFiler.WriteHardPointerId
 Послать отзыв
 Метод предназначен для записи заданного идентификатора жесткой ссылки на указатель (HardPointerId) в этот объект Filer.
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract void WriteHardPointerId( ObjectId value );
Копировать Код
Public MustOverride Sub WriteHardPointerId( value As ObjectId )
 Параметры
 Параметры
 Описание
 value
 Записываемый в Filer идентификатор жесткой ссылки на указатель. Тип ObjectId.
 Описание
 Метод предназначен для записи заданного идентификатора жесткой ссылки на указатель (HardPointerId) в этот объект Filer.
 Ссылки
 Teigha.DatabaseServices.DwgFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!