Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ScaleEstimationMethod
 Послать отзыв
 Данное перечисление определяет поддерживаемые алгоритмы компенсации искажений масштабного коэффициента сетки, которые вносит проецирование, используемое в конкретных типах систем координат сеток.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum ScaleEstimationMethod { ScaleEstMethodPrismoidal = 4, ScaleEstMethodReferencePoint = 3, ScaleEstMethodUnity = 1, ScaleEstMethodUserDefined = 2 }
Копировать Код
Public Enum ScaleEstimationMethod ScaleEstMethodPrismoidal = 4 ScaleEstMethodReferencePoint = 3 ScaleEstMethodUnity = 1 ScaleEstMethodUserDefined = 2 End Enum
 Члены
 Члены
 Описание
 ScaleEstMethodPrismoidal
 Значение: 4. Этот алгоритм корректирует искажение масштаба сетки, оценивая искажение масштаба сетки в каждой точке локальной системы координат. Важно: использование этого алгоритма подразумевает, что проекционное отображение, на котором основана указанная сетка, является конформным.
 ScaleEstMethodReferencePoint
 Значение: 3. Этот алгоритм использует масштабный коэффициент сетки референцной системы координат, определенный в реперной точке локальной системы координат. Важно: использование этого алгоритма подразумевает, что проекционное отображение, на котором основана указанная сетка, является конформным.
 ScaleEstMethodUnity
 Значение: 1. Данный алгоритм не делает ничего в предположении, что с точки зрения искажения масштаба сетки проектные координаты совпадают с координатами сетки.
 ScaleEstMethodUserDefined
 Значение: 2. Данный алгоритм использует некоторый пользовательский постоянный масштабный коэффициент для коррекции искажений масштаба сетки, вносимых проецированием, на котором основана система координат сетки.
 Описание
 Данное перечисление определяет поддерживаемые алгоритмы компенсации искажений масштабного коэффициента сетки, которые вносит проецирование, используемое в конкретных типах систем координат сеток.
 Ваши комментарии по поводу этого топика: Послать отзыв!