Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Plane
 Послать отзыв
 Класс Plane представляет параметризованную бесконечную плоскость в трехмерном пространстве.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Geometry::Entity3d Teigha::Geometry::Surface Teigha::Geometry::PlanarEntity Teigha::Geometry::Plane
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdGePlane")] public sealed class Plane : PlanarEntity
Копировать Код
<Wrapper("OdGePlane")> Public NotInheritable Class Plane Inherits PlanarEntity
 Описание
 Класс Plane представляет параметризованную бесконечную плоскость в трехмерном пространстве.
 Методы
 Конструкторы
 Teigha.Geometry.Plane
 Имя
 Описание
 Plane
 Это обзор перегрузок Plane.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Geometry.Entity3d
 Имя
 Описание
 Entity3d Методы
 Ниже перечислены методы класса Entity3d.
 Teigha.Geometry.Surface
 Имя
 Описание
 Surface Методы
 Ниже перечислены методы класса Surface.
 Surface Свойства
 Ниже перечислены свойства класса Surface.
 Teigha.Geometry.PlanarEntity
 Имя
 Описание
 PlanarEntity Методы
 Ниже перечислены методы класса PlanarEntity.
 PlanarEntity Свойства
 Ниже перечислены свойства класса PlanarEntity.
 Teigha.Geometry.Plane
 Имя
 Описание
 Plane Методы
 Ниже перечислены методы класса Plane.
 Ссылки
 Plane Конструктор, Plane Методы, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!