Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.BoundBlock2d.BoundBlock2d
 Послать отзыв
 Конструктор класса BoundBlock2d. Создает прямоугольную граничную рамку, ориентированную по осям системы координат, с указанными минимальной и максимальной точками.
 Синтаксис
C#
Visual Basic
Копировать Код
public BoundBlock2d( Point2d point1, Point2d point2 );
Копировать Код
Public Sub New( point1 As Point2d, point2 As Point2d )
 Параметры
 Параметры
 Описание
 point1
 Входная минимальная точка прямоугольной рамки. Тип Point2d.
 point2
 Входная максимальная точка прямоугольной рамки. Тип Point2d.
 Описание
 Конструктор класса BoundBlock2d. Создает прямоугольную граничную рамку, ориентированную по осям системы координат, с указанными минимальной и максимальной точками.
 Ссылки
 Teigha.Geometry.BoundBlock2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!