Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DxfFiler.WritePoint3d
 Послать отзыв
 Метод записывает в данный объект Filer указанную трехмерную точку.
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract void WritePoint3d( DxfCode opCode, Point3d value, int precision );
Копировать Код
Public MustOverride Sub WritePoint3d( opCode As DxfCode, value As Point3d, precision As Integer )
 Параметры
 Параметры
 Описание
 opCode
 Групповой код DXF. Тип DxfCode.
 value
 3D-точка, которую следует записать. Тип Point3d.
 precision
 Количество цифр после запятой в интервале от 0 до 16. Тип int. Параметр используется для представления координат точки.
 Описание
 Метод записывает в данный объект Filer указанные групповой код DXF, трехмерную точку и точность представления координат точки.
 Ссылки
 Teigha.DatabaseServices.DxfFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!