Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SectionSettings.SetHatchPatternType
 Послать отзыв
 Метод позволяет задать тип образца штриховки геометрии сечения указанного типа.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetHatchPatternType( SectionType nSecType, SectionGeometry nGeometry, HatchPatternType nPatternType );
Копировать Код
Public Sub SetHatchPatternType( nSecType As SectionType, nGeometry As SectionGeometry, nPatternType As HatchPatternType )
 Параметры
 Параметры
 Описание
 nSecType
 Тип сечения. Перечисление SectionType.
 nGeometry
 Типы элементов геометрии сечения. Перечисление SectionGeometry.
 nPatternType
 Тип образца штриховки. Перечисление HatchPatternType.
 Описание
 Метод позволяет задать тип образца штриховки геометрии сечения указанного типа как значение из перечисления HatchPatternType.
 Ссылки
 Teigha.DatabaseServices.SectionSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!