Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ObjectContextCollection.CurrentContext
 Послать отзыв
 Свойство представляет текущий контекст в коллекции контекстов.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual ObjectContext CurrentContext;
Копировать Код
Public Overridable Property CurrentContext As ObjectContext
 Возвращает
 Возвращает текущий контекст. Тип ObjectContext.
 Описание
 Свойство представляет текущий контекст в коллекции контекстов.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.ObjectContextCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!