Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Scale2d.ExtractScale
 Послать отзыв
 Метод предоставляет вектор масштабирования, который соответствует длинам вектор-столбцов матрицы геометрического преобразования.
 Синтаксис
C#
Visual Basic
Копировать Код
public static Scale2d ExtractScale( Matrix2d mat );
Копировать Код
Public Shared Function ExtractScale( mat As Matrix2d ) As Scale2d
 Параметры
 Параметры
 Описание
 mat
 Входная матрица геометрического преобразования. Тип Matrix2d.
 Возвращает
 Возвращает вектор масштабирования, представленный преобразованием mat. Тип Scale2d.
 Описание
 Метод предоставляет вектор масштабирования, который соответствует длинам вектор-столбцов матрицы геометрического преобразования mat.
 Ссылки
 Teigha.Geometry.Scale2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!