Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 ViewportTableRecord.GridIncrements
 Послать отзыв
 Свойство предназначено для настройки размера ячейки сетки.
 Синтаксис
C#
Visual Basic
public Point2d GridIncrements;
Public Property GridIncrements() As Point2d
 Возвращает
 Возвращает тип данных Point2d.
 Описание
 С помощью свойства можно изменять размер ячейки сетки. В интерфейсе свойство настраивается через диалоговое окно «Режимы черчения» для каждого видового экрана отдельно. Окно «Режимы черчения» можно открыть либо командой DDRMODES, DDSETTINGS, либо через меню Сервис -> Режимы черчения…
 Условия
 Чтение и запись.
 Ссылки
 ViewportTableRecord Класс, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!