Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.TableStyle.IsHeaderSuppressed
 Послать отзыв
 Свойство IsHeaderSuppressed представляет состояние флага подавления строки заголовков столбцов.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual bool IsHeaderSuppressed;
Копировать Код
Public Overridable Property IsHeaderSuppressed As Boolean
 Возвращает
 Возвращает true, если строка заголовков столбцов подавлена. В противном случае возвращает false.
 Описание
 Свойство IsHeaderSuppressed представляет состояние флага подавления строки заголовков столбцов.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.TableStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!