Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LayoutEventArgs.Name
 Послать отзыв
 Свойство представляет имя измененного листа.
 Синтаксис
C#
Visual Basic
Копировать Код
public String Name;
Копировать Код
Public ReadOnly Property Name As String
 Возвращает
 Возвращает имя измененного листа. Тип String.
 Описание
 Свойство представляет имя измененного листа.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.LayoutEventArgs, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!