Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Cylinder.Radius
 Послать отзыв
 Свойство Radius представляет радиус данного цилиндра.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Radius;
Копировать Код
Public Property Radius As Double
 Возвращает
 Возвращает радиус цилиндра. Тип double.
 Описание
 Свойство Radius представляет радиус данного цилиндра.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.Geometry.Cylinder, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!