Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.IdMapping.IdMapping
 Послать отзыв
 Конструктор по умолчанию класса IdMapping.
 Синтаксис
C#
Visual Basic
Копировать Код
public IdMapping();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса IdMapping.
 Ссылки
 Teigha.DatabaseServices.IdMapping, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!