Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FileDependencyInfo
 Послать отзыв
 Класс FileDependencyInfo представляет записи в разделе .dwg списка зависимостей файлов.
 Иерархия классов
Teigha::DatabaseServices::FileDependencyInfo
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdFileDependencyInfo")] public struct FileDependencyInfo
Копировать Код
<Wrapper("OdFileDependencyInfo")> Public Structure FileDependencyInfo
 Описание
 Класс FileDependencyInfo представляет записи в разделе .dwg списка зависимостей файлов.
 Топики
 Имя
 Описание
 FileDependencyInfo Методы
 Ниже перечислены методы класса FileDependencyInfo.
 FileDependencyInfo Свойства
 Ниже перечислены свойства класса FileDependencyInfo.
 Ссылки
 FileDependencyInfo Методы, FileDependencyInfo Свойства, Топики, FileDependencyInfo Методы, FileDependencyInfo Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!