Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector3d.IsParallelTo
 Послать отзыв
 Метод позволяет проверить, параллелен ли данный вектор входному вектору.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsParallelTo( Vector3d vector );
Копировать Код
Public Function IsParallelTo( vector As Vector3d ) As Boolean
 Параметры
 Параметры
 Описание
 vector
 Входной вектор для сравнения. Тип Vector3d.
 Возвращает
 В случае параллельности векторов возвращает true. В противном случае возвращает false.
 Описание
 Метод позволяет проверить, параллелен ли данный вектор входному вектору vector.
 Реализация использует вызов метода Vector3d.IsParallelTo(Vector3d vector, Tolerance tolerance) со значением аргумента tolerance, равным Tolerance.Global. Метод возвращает true, если это условие выполнено, и false в противном случае.
 Ссылки
 Teigha.Geometry.Vector3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!