Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FaceRef.FaceRef
 Послать отзыв
 Конструктор класса FaceRef. Создает экземпляр класса на базе указанного составного объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public FaceRef( ref CompoundObjectId compoundObjectId );
Копировать Код
Public Sub New( ByRef compoundObjectId As CompoundObjectId )
 Параметры
 Параметры
 Описание
 compoundObjectId
 Идентификатор составного объекта, на основе которого создается новый экземпляр класса FaceRef. Тип CompoundObjectId.
 Описание
 Конструктор класса FaceRef. Создает экземпляр класса на базе указанного составного объекта.
 Ссылки
 Teigha.DatabaseServices.FaceRef, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!