Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор AssocEvaluationCallback.AssocEvaluationCallback
 Послать отзыв
 This is AssocEvaluationCallback, a member of class AssocEvaluationCallback.
 Синтаксис
C#
Visual Basic
internal AssocEvaluationCallback(System.IntPtr unmanagedObjPtr, bool autoDelete);
Friend Sub New(unmanagedObjPtr As System.IntPtr, autoDelete As bool)
 Ссылки
 Teigha.DatabaseServices.AssocEvaluationCallback, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!