Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ItemLocator
 Послать отзыв
 Класс ItemLocator представляет индекс {i, j, k} элемента в прямоугольном массиве.
 Иерархия классов
Teigha::DatabaseServices::ItemLocator
 Синтаксис
C#
Visual Basic
Копировать Код
[StructLayout(LayoutKind.Sequential), Wrapper("AcDbItemLocator")] public class ItemLocator;
Копировать Код
<StructLayout(LayoutKind.Sequential), Wrapper("AcDbItemLocator")> Public Class ItemLocator
 Описание
 Класс ItemLocator представляет индекс {i, j, k} элемента в прямоугольном массиве.
 Методы
 Конструкторы
 Имя
 Описание
 ItemLocator
 Конструктор класса ItemLocator. Инициализирует индексы этой структуры указанными значениями.
 Топики
 Имя
 Описание
 ItemLocator Свойства
 Ниже перечислены свойства класса ItemLocator.
 Ссылки
 ItemLocator Свойства, Методы, Топики, ItemLocator Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!