Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Viewport.GridAdaptive
 Послать отзыв
 Свойство GridAdaptive позволяет определить, является ли сетка в данном видовом экране адаптивной.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool GridAdaptive;
Копировать Код
Public Property GridAdaptive As Boolean
 Возвращает
 Возвращает true, если сетка в данном видовом экране является адаптивной. В противном случае возвращает false.
 Описание
 Свойство GridAdaptive определяет, является ли сетка в данном видовом экране адаптивной. Адаптивная сетка позволяет избежать слишком плотной или слишком разреженной сетки при изменении масштаба отображения в видовом экране независимо от текущего значения системной переменной GRIDUNIT.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Viewport, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!