Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.MLeaderstyle
 Послать отзыв
 Синтаксис
C#
Visual Basic
public DatabaseServices::ObjectId MLeaderstyle;
Public Property MLeaderstyle() As DatabaseServices.ObjectId
 Описание
 Возвращает или устанавливает Id стиля мультивыносок, определенных текущим значением CMLEADERSTYLE базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!