Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CellBorder.LineStyle
 Послать отзыв
 Свойство LineStyle представляет стиль линии, используемый объектом границы ячейки.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.GridLineStyle? LineStyle;
Копировать Код
Public Property LineStyle As DatabaseServices.GridLineStyle?
 Возвращает
 Возвращает стиль линии границы ячейки. Тип DatabaseServices.GridLineStyle?.
 Описание
 Свойство LineStyle представляет стиль линии, используемый объектом границы ячейки.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.CellBorder, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!