Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Leader.DimensionStyle
 Послать отзыв
 Синтаксис
C#
Visual Basic
public DatabaseServices::ObjectId DimensionStyle;
Public Property DimensionStyle() As DatabaseServices.ObjectId
 Описание
 Возвращает или устанавливает Id объекта размерного стиля, на который ссылается выноска.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Leader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!