Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.EllipticalCylinder.IsOuterNormal
 Послать отзыв
 Свойство IsOuterNormal позволяет определить, направлена ли нормаль цилиндрической поверхности данного объекта наружу от тела цилиндра.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsOuterNormal;
Копировать Код
Public Property IsOuterNormal As Boolean
 Возвращает
 Возвращает true, если нормаль направлена наружу от тела цилиндра. В противном случае возвращает false.
 Описание
 Свойство IsOuterNormal позволяет определить, направлена ли нормаль цилиндрической поверхности данного объекта наружу от тела цилиндра.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.Geometry.EllipticalCylinder, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!