Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.HyperLink.DisplayString
 Послать отзыв
 Свойство возвращает отображаемую строку вида "— ", связанную с этим объектом HyperLink.
 Синтаксис
C#
Visual Basic
Копировать Код
public String DisplayString;
Копировать Код
Public ReadOnly Property DisplayString As String
 Возвращает
 Возвращает отображаемую строку. Тип String.
 Описание
 Свойство возвращает отображаемую строку, связанную с этим объектом HyperLink. Эта строка имеет вид "— ", если описание было задано через свойство Description.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.HyperLink, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!