Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.SplineEntity3d
 Послать отзыв
 Класс SplineEntity3d представляет различные сплайновые объекты в трехмерном пространстве. В текущей версии не реализован.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Geometry::Entity3d Teigha::Geometry::Curve3d Teigha::Geometry::SplineEntity3d
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdGeSplineEnt3d")] public abstract class SplineEntity3d : Curve3d
Копировать Код
<Wrapper("OdGeSplineEnt3d")> Public MustInherit Class SplineEntity3d Inherits Curve3d
 Описание
 Класс SplineEntity3d представляет различные сплайновые объекты в трехмерном пространстве. В текущей версии не реализован.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Geometry.Entity3d
 Имя
 Описание
 Entity3d Методы
 Ниже перечислены методы класса Entity3d.
 Teigha.Geometry.Curve3d
 Имя
 Описание
 Curve3d Методы
 Ниже перечислены методы класса Curve3d.
 Curve3d Свойства
 Ниже перечислены свойства класса Curve3d.
 Teigha.Geometry.SplineEntity3d
 Имя
 Описание
 SplineEntity3d Методы
 Ниже перечислены методы класса SplineEntity3d.
 SplineEntity3d Свойства
 Ниже перечислены свойства класса SplineEntity3d.
 Ссылки
 SplineEntity3d Методы, SplineEntity3d Свойства, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!