Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Plane.Set
 Послать отзыв
 Метод переопределяет коэффициенты в общем уравнении данной плоскости.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Set( double a, double b, double c, double d );
Копировать Код
Public Sub Set( a As Double, b As Double, c As Double, d As Double )
 Параметры
 Параметры
 Описание
 a
 Коэффициент a в общем уравнении плоскости. Тип double.
 b
 Коэффициент b в общем уравнении плоскости. Тип double.
 c
 Коэффициент c в общем уравнении плоскости. Тип double.
 d
 Коэффициент d в общем уравнении плоскости. Тип double.
 Описание
 Метод переопределяет коэффициенты a, b, c и d в общем уравнении данной плоскости.
 Ссылки
 Teigha.Geometry.Plane, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!