Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocAction.GetActionBody
 Послать отзыв
 Метод позволяет получить ObjectId тела ассоциативного действия.
 Синтаксис
C#
Visual Basic
Копировать Код
public Teigha.DatabaseServices.ObjectId GetActionBody( Teigha.DatabaseServices.ObjectId actionId );
Копировать Код
Public Function GetActionBody( actionId As Teigha.DatabaseServices.ObjectId ) As Teigha.DatabaseServices.ObjectId
 Параметры
 Параметры
 Описание
 actionId
 Идентификатор ассоциативного действия. Тип Teigha.DatabaseServices.ObjectId.
 Возвращает
 Возвращает идентификатор тела действия. Тип Teigha.DatabaseServices.ObjectId.
 Описание
 Метод позволяет получить ObjectId тела ассоциативного действия.
 Ссылки
 Teigha.DatabaseServices.AssocAction, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!