Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbSurface.IsRationalInV
 Послать отзыв
 Свойство IsRationalInV позволяет проверить, является ли данная поверхность рациональной в направлении V.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsRationalInV;
Копировать Код
Public ReadOnly Property IsRationalInV As Boolean
 Возвращает
 Возвращает true, если поверхность является рациональной в направлении V. В противном случае возвращает false.
 Описание
 Свойство IsRationalInV позволяет проверить, является ли данная поверхность рациональной в направлении V.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.NurbSurface, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!