Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Viewport.SnapOn
 Послать отзыв
 Свойство SnapOn позволяет определить, включен ли режим шаговой привязки в данном видовом экране.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool SnapOn;
Копировать Код
Public Property SnapOn As Boolean
 Возвращает
 Возвращает true, если режим шаговой привязки включен. В противном случае возвращает false.
 Описание
 Свойство SnapOn позволяет определить, включен ли режим шаговой привязки в данном видовом экране.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Viewport, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!