Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.SetDataLink
 Послать отзыв
 Метод позволяет установить ссылку на данные для диапазона ячеек.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetDataLink( ref CellRange range, DatabaseServices.ObjectId dataLinkId, bool bUpdate );
Копировать Код
Public virtual Sub SetDataLink( ByRef range As CellRange, dataLinkId As DatabaseServices.ObjectId, bUpdate As Boolean )
 Параметры
 Параметры
 Описание
 range
 Диапазон, для которого задаётся ссылка на данные. Если принимает значение NULL, метод получает все ссылки на данные в таблице. Тип CellRange.
 dataLinkId
 Идентификатор ссылки на данные. Тип DatabaseServices.ObjectId.
 bUpdate
 Флаг обновления ссылки на данные после установки (значение true) или значение false, если такое обновление не требуется.
 Описание
 Метод позволяет установить ссылку на данные для диапазона ячеек.
 Вся информация, содержащаяся в ячейках диапазона до установки ссылки на данные, будет удалена. Если верхняя левая ячейка диапазона range – это верхняя левая ячейка существующего диапазона, связанного с данными, этот метод заменит старую ссылку на новую. Если диапазон range перекрывается с ячейками любого другого диапазона, связанного с данными, метод завершит работу с ошибкой.
 Этот метод не обновляет данные автоматически. Для обновления данных следует вызвать метод UpdateDataLink().
 Замечания
 Для получения того же результата предпочтительнее использовать CellRange.SetDataLink.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!