Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Viewport.Thumbnail
 Послать отзыв
 Свойство Thumbnail представляет изображение предварительного просмотра этого видового экрана.
 Синтаксис
C#
Visual Basic
Копировать Код
public System.Drawing.Bitmap Thumbnail;
Копировать Код
Public Property Thumbnail As System.Drawing.Bitmap
 Возвращает
 Возвращает изображение предварительного просмотра видового экрана. Тип System.Drawing.Bitmap.
 Описание
 Свойство Thumbnail представляет изображение предварительного просмотра этого видового экрана.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Viewport, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!