Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MentalRayRenderSettings.FinalGatheringMode
 Послать отзыв
 Свойство FinalGatheringMode представляет текущий режим финальной сборки. Не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public GraphicsInterface.FinalGatheringMode FinalGatheringMode;
Копировать Код
Public Property FinalGatheringMode As GraphicsInterface.FinalGatheringMode
 Возвращает
 Возвращает режим финальной сборки. Тип GraphicsInterface.FinalGatheringMode.
 Описание
 Свойство FinalGatheringMode представляет текущий режим финальной сборки. В текущей версии данное свойство не реализовано.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MentalRayRenderSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!