Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство DBText.VerticalMode
 Послать отзыв
 Синтаксис
C#
Visual Basic
public DatabaseServices::TextVerticalMode VerticalMode;
Public Property VerticalMode() As DatabaseServices.TextVerticalMode
 Описание
 Обеспечивает доступ к вертикальному режиму текста.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.DBText, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!