Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Solid3d.RecordHistory
 Послать отзыв
 Свойство RecordHistory позволяет определить, записывает ли данное твердое тело историю своих операций.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual bool RecordHistory;
Копировать Код
Public Overridable Property RecordHistory As Boolean
 Возвращает
 Возвращает true, если история операций сохраняется. В противном случае возвращает false.
 Описание
 Свойство RecordHistory позволяет определить, записывает ли данное твердое тело историю своих операций.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Solid3d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!