Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 LayerTableRecord.HasViewportOverrides(ObjectId viewportId)
 Послать отзыв
 Метод показывает, есть ли у слоя переопределения в видовом экране пространства листа.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool HasViewportOverrides(ObjectId viewportId);
Копировать Код
Public Function HasViewportOverrides(viewportId As ObjectId) As Boolean
 Параметры
 Параметры
 Описание
 viewportId
 ObjectId видового экрана
 Возвращает
 Возвращает тип данных bool.
 Описание
 В видовых экранах пространства листа можно переопределять цвет, тип линии, вес линии, прозрачность слоя. После переопределения параметров слоя в видовом экране будут применены новые параметры, а в остальных останутся старые.
 С помощью метода можно получить информацию о том, есть ли у слоя переопределения в видовом экране.
 Ссылки
 Teigha.DatabaseServices.LayerTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!