Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.MinimumRowHeight
 Послать отзыв
 Метод позволяет получить минимальную высоту для указанной строки в данной таблице.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual double MinimumRowHeight( int row );
Копировать Код
Public virtual Function MinimumRowHeight( row As Integer ) As double
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 Возвращает
 Возвращает минимальную высоту строки, тип double.
 Описание
 Метод позволяет получить минимальную высоту для указанной строки в данной таблице.
 Замечания
 Для получения того же результата предпочтительнее использовать Table.Rows[col].MinimumHeight.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!