Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SectionSettings.SectionSettings
 Послать отзыв
 Конструктор по умолчанию класса SectionSettings.
 Синтаксис
C#
Visual Basic
Копировать Код
public SectionSettings();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса SectionSettings.
 Ссылки
 Teigha.DatabaseServices.SectionSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!