Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.EllipticalCone.GetAngles
 Послать отзыв
 Метод предоставляет текущие значения начального и конечного углов данного эллиптического конуса.
 Синтаксис
C#
Visual Basic
Копировать Код
public double[] GetAngles();
Копировать Код
Public Function GetAngles() As Double()
 Возвращает
 Возвращает двухэлементный массив углов. Первый элемент соответствует начальному углу, а второй элемент - конечному углу эллиптического конуса. Тип double[].
 Описание
 Метод предоставляет текущие значения начального и конечного углов данного эллиптического конуса с виде массива из двух элементов. Первый элемент соответствует начальному углу эллиптического конуса (смещение угла, от которого строятся сегменты эллиптического конуса), а второй элемент соответствует конечному углу эллиптического конуса (смещение угла, до которого строятся сегменты эллиптического конуса).
 Ссылки
 Teigha.Geometry.EllipticalCone, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!