Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Database.SetDimstyleData
 Послать отзыв
 Синтаксис
C#
Visual Basic
public void SetDimstyleData(ref DimStyleTableRecord style);
Public Sub SetDimstyleData(ByRef style As DimStyleTableRecord)
 Параметры
 Параметры
 Описание
 style
 Указатель на DimStyleTableRecord, из которой копируются значения переменных размеров
 Описание
 Метод копирует информацию о переменных размеров, которая содержится в параметре style, в базу данных, в которой этот метод выполняется, делая эти значения переменных размеров текущими в базе данных.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!