Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 LayerTableRecord.ViewportVisibilityDefault
 Послать отзыв
 Свойство предназначено для управления заморозкой слоёв в новых видовых экранах пространства листа.
 Синтаксис
C#
Visual Basic
public bool ViewportVisibilityDefault;
Public Property ViewportVisibilityDefault() As bool
 Возвращает
 Возвращает тип данных bool:
true – слой будет заморожен в новых видовых экранах пространства листа;
false – слой не будет заморожен в новых видовых экранах пространства листа.
 Описание
 С помощью свойства можно управлять заморозкой слоя в новых видовых экранах пространства листа. В пространстве модели свойство не работает.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.LayerTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!