Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Делегат Teigha.DatabaseServices.PlotStyleTableChangedEventHandler
 Послать отзыв
 This is type Teigha::DatabaseServices::PlotStyleTableChangedEventHandler.
 Синтаксис
C#
Visual Basic
public delegate PlotStyleTableChangedEventHandler();
Public Delegate Sub PlotStyleTableChangedEventHandler()
 Ваши комментарии по поводу этого топика: Послать отзыв!