Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Torus.SetAnglesInV
 Послать отзыв
 Метод позволяет переопределить начальную и конечную широту для данного тора.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetAnglesInV( double startAngle, double endAngle );
Копировать Код
Public Sub SetAnglesInV( startAngle As Double, endAngle As Double )
 Параметры
 Параметры
 Описание
 startAngle
 Начальная широта V. Тип double.
 endAngle
 Конечная широта V. Тип double.
 Описание
 Метод позволяет переопределить начальный и конечный углы дуги на образующей окружности (начальную и конечную широту) для данного тора.
 Ссылки
 Teigha.Geometry.Torus, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!