Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CurveCurveIntersector3d.Curve1
 Послать отзыв
 Свойство Curve1 представляет указатель на первую кривую в данном объекте.
 Синтаксис
C#
Visual Basic
Копировать Код
public Geometry.Curve3d Curve1;
Копировать Код
Public ReadOnly Property Curve1 As Geometry.Curve3d
 Возвращает
 Возвращает первую кривую. Тип Geometry.Curve3d.
 Описание
 Свойство Curve1 представляет указатель на первую кривую в данном объекте.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.CurveCurveIntersector3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!