Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство OrdinateDimension.origin
 Послать отзыв
 This is origin, a member of class OrdinateDimension.
 Синтаксис
C#
Visual Basic
public set origin;
Public Property origin() As set
 Ссылки
 OrdinateDimension Класс, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!