Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.BulgeVertex.Bulge
 Послать отзыв
 Свойство обеспечивает доступ к значению прогиба данного объекта BulgeVertex.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Bulge;
Копировать Код
Public Property Bulge() As Double
 Возвращает
 Возвращает выличину прогиба дугового сегмента. Тип double.
 Описание
 Свойство обеспечивает доступ к значению прогиба данного объекта BulgeVertex.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.BulgeVertex, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!