Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SubDMesh.SetWedge
 Послать отзыв
 Метод создает сеть-клин.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetWedge( double xLen, double yLen, double zLen, int divLength, int divWidth, int divHeight, int divSlope, int divCap, int smoothLevel );
Копировать Код
Public Sub SetWedge( xLen As double, yLen As double, zLen As double, divLength As Integer, divWidth As Integer, divHeight As Integer, divSlope As Integer, divCap As Integer, smoothLevel As Integer )
 Параметры
 Параметры
 Описание
 xLen
 Глубина клина, double.
 yLen
 Ширина клина, double.
 zLen
 Высота клина, double.
 divLength
 Количество разделений в направлении глубины, int.
 divWidth
 Количество разделений в направлении ширины, int.
 divHeight
 Количество разделений в направлении высоты, int.
 divSlope
 Количество разделений в направлении наклона, int.
 divCap
 Количество радиальных разделений для базовой грани, int.
 smoothLevel
 Степень сглаженности сети, int.
 Описание
 Метод создает сеть-клин.
 Ссылки
 Teigha.DatabaseServices.SubDMesh, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!