Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Ole2Frame.UserType
 Послать отзыв
 Свойство представляет определяемое пользователем наименование типа OLE-объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual String UserType;
Копировать Код
Public Overridable ReadOnly Property UserType As String
 Возвращает
 Возвращает пользовательское наименование типа OLE-объекта. Тип String.
 Описание
 Свойство представляет определяемое пользователем наименование типа OLE-объекта. Примеры: "Word Document", "Excel Chart".
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Ole2Frame, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!