Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve3d.IsLinear
 Послать отзыв
 Метод проверяет, является ли данная кривая линейной.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsLinear( out Line3d line );
Копировать Код
Public Function IsLinear( line As out Line3d ) As Boolean
 Параметры
 Параметры
 Описание
 line
 Линия, с которой совпадает кривая в случае ее прямолинейности. Тип Line3d.
 Возвращает
 Возвращает true, если кривая является линейной, и false в противном случае.
 Описание
 Метод проверяет, является ли данная кривая линейной. Параметр line содержит значимые данные только в том случае, если метод возвращает значение true.
 Реализация метода использует вызов Curve3d.IsLinear(out Line3d line, Tolerance tolerance) с допуском, равным Tolerance.Global.
 Ссылки
 Teigha.Geometry.Curve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!