Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SymbolUtilityServices.LinetypeByLayerName
 Послать отзыв
 Свойство LinetypeByLayerName представляет предопределенную запись символа для имени типа линий "ByLayer".
 Синтаксис
C#
Visual Basic
Копировать Код
public static String LinetypeByLayerName;
Копировать Код
Public Shared ReadOnly Property LinetypeByLayerName As String
 Возвращает
 Возвращает предопределенное имя типа линий "ByLayer". Тип String.
 Описание
 Свойство LinetypeByLayerName представляет предопределенную запись символа для имени типа линий "ByLayer". Не может быть ни NULL, ни пустой строкой.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.SymbolUtilityServices, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!