Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 BlockTableRecord.GetXrefDatabase(bool incrementUnresolved)
 Послать отзыв
 Метод предназначен для внешних блоков и позволяет получить базу данных, в которой есть определение внешнего блока.
 Синтаксис
C#
Visual Basic
Копировать Код
public Database GetXrefDatabase(bool incrementUnresolved);
Копировать Код
Public Function GetXrefDatabase(incrementUnresolved As Boolean ) As Database
 Параметры
 Параметры
 Описание
 incrementUnresolved
 Признак того, что нужно открыть базу данных даже, если ссылка на блок является неразрешенной, то есть такой, по которой невозможно найти нужный объект в той базе данных. Данный параметр применим только если ссылка является неразрешенной по любой причине, кроме невозможности найти по ней нужный файл.
 Возвращает
 Метод возвращает тип данных Database.
 Описание
 Метод применим для внешних блоков, то есть блоков, вставленных из других чертежей и возвращает базу данных, в которой есть определение данного блока.
 Ссылки
 Teigha.DatabaseServices.BlockTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!