Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SectionSettings.Layer
 Послать отзыв
 Метод позволяет получить имя слоя для геометрии указанного типа.
 Синтаксис
C#
Visual Basic
Копировать Код
public String Layer( SectionType nSecType, SectionGeometry nGeometry );
Копировать Код
Public Function Layer( nSecType As SectionType, nGeometry As SectionGeometry ) As String
 Параметры
 Параметры
 Описание
 nSecType
 Тип сечения. Перечисление SectionType.
 nGeometry
 Типы элементов геометрии сечения. Перечисление SectionGeometry.
 Возвращает
 Возвращает имя слоя. Тип String.
 Описание
 Метод позволяет получить имя слоя, на котором располагается геометрия указанного типа.
 Ссылки
 Teigha.DatabaseServices.SectionSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!