Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DatabaseSummaryInfoBuilder.DatabaseSummaryInfoBuilder
 Послать отзыв
 Конструктор по умолчанию класса DatabaseSummaryInfoBuilder.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseSummaryInfoBuilder();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса DatabaseSummaryInfoBuilder.
 Ссылки
 Teigha.DatabaseServices.DatabaseSummaryInfoBuilder, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!