Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 DimStyleTableRecord.Dimtol
 Послать отзыв
 Свойство отвечает за отображение текста допуска в измерениях.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual bool Dimtol { get; set; }
Копировать Код
Public Overridable Property Dimtol As Boolean
 Возвращает
 Возвращает тип данных bool.
 Описание
 В свойстве хранится текущая настройка отображения текста допуска в измерениях. В качестве значения свойства доступны следующие:
false – не отображать текст допуска (по умолчанию);
true – отображать текст допуска (симметричный).
 Свойство также доступно через системную переменную DIMTOL и пользовательское меню в окне изменения/создания размерного стиля:
  При изменении системной переменной DIMTOL будет создан новый размерный стиль под названием <переопределение> на основе текущего с новым значением DIMTOL.
 Условия
 Чтение и запись.
 Пример
 Пример изменения настройки отображения текста допуска в измерениях (значения свойства Dimtol) в размерном стиле Standard:
C#
 Копировать Код
public partial class Commands { [Teigha.Runtime.CommandMethod("DimtolChange")] public void DimtolStandardDimStyle() { // Получение ссылки на активный документ HostMgd.ApplicationServices.Document doc = HostMgd.ApplicationServices.Application.DocumentManager.MdiActiveDocument; // Получение ссылки на редактор документа HostMgd.EditorInput.Editor ed = doc.Editor; // Получение ссылки на базу данных документа Teigha.DatabaseServices.Database db = doc.Database; // Начало транзакции с базой данных документа using (Teigha.DatabaseServices.Transaction trans = db.TransactionManager.StartTransaction()) { // Открываем таблицу размерных стилей для чтения Teigha.DatabaseServices.DimStyleTable dimStyleTable = trans.GetObject(db.DimStyleTableId, Teigha.DatabaseServices.OpenMode.ForRead) as Teigha.DatabaseServices.DimStyleTable; // Находим в таблице размерных стилей ObjectId нужного стиля по его названию Teigha.DatabaseServices.ObjectId styleId = dimStyleTable["Standard"]; // Открываем таблицу размерного стиля для изменений Teigha.DatabaseServices.DimStyleTableRecord obj = trans.GetObject(styleId, Teigha.DatabaseServices.OpenMode.ForWrite) as Teigha.DatabaseServices.DimStyleTableRecord; ed.WriteMessage($"nDimtol before: {obj.Dimtol}"); // Изменяем признак отображения допусков obj.Dimtol = true; ed.WriteMessage($"nDimtol after: {obj.Dimtol}"); trans.Commit(); } } }
 Результат работы команды DimtolChange:
 Было:
 Стало:
 Ссылки
 Teigha.DatabaseServices.DimStyleTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!