Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Solid3d.Solid3d
 Послать отзыв
 Конструктор по умолчанию класса Solid3d.
 Синтаксис
C#
Visual Basic
Копировать Код
public Solid3d();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса Solid3d.
 Ссылки
 Teigha.DatabaseServices.Solid3d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!