Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Spline.ElevateDegree
 Послать отзыв
 Метод позволяет увеличить степень данного сплайна до указанного значения.
 Синтаксис
C#
Visual Basic
Копировать Код
public void ElevateDegree( int newDegree );
Копировать Код
Public Sub ElevateDegree( newDegree As Integer )
 Параметры
 Параметры
 Описание
 newDegree
 Новое значение степени сплайна. Тип int.
 Описание
 Метод позволяет увеличить степень данного сплайна до указанного значения newDegree.
 Степень сплайна на единицу меньше его порядка. После увеличения степени сплайна уменьшить ее нельзя. Диапазон допустимых значений - от текущего значения степени до 25.
 Ссылки
 Teigha.DatabaseServices.Spline, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!