Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.XrefGraph.MarkUnresolvedTrees
 Послать отзыв
 Метод позволяет пометить флагом GraphNode.UnresTree все неразрешимые внешние ссылки и их вложенные внешние ссылки. Не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool MarkUnresolvedTrees();
Копировать Код
Public Function MarkUnresolvedTrees() As Boolean
 Возвращает
 Возвращает true, если граф содержит неразрешимые внешние ссылки. В противном случае возвращает false (значение по умолчанию).
 Описание
 Метод позволяет пометить флагом GraphNode.UnresTree все неразрешимые внешние ссылки и их вложенные внешние ссылки. Возвращает значение true, если граф содержит неразрешимые внешние ссылки.
 В текущей версии не реализован.
 Ссылки
 Teigha.DatabaseServices.XrefGraph, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!