Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CellContent.TextHeight
 Послать отзыв
 Свойство TextHeight контролирует высоту текста содержимого ячейки таблицы.
 Синтаксис
C#
Visual Basic
Копировать Код
public double TextHeight;
Копировать Код
Public Property TextHeight As Double
 Возвращает
 Возвращает высоту текста содержимого ячейки. Тип double.
 Описание
 Свойство TextHeight контролирует высоту текста содержимого ячейки таблицы.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.CellContent, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!