Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Ellipse.EndParam
 Послать отзыв
 Свойство EndParam обеспечивает доступ к конечному значению параметра данного эллипса.
 Синтаксис
C#
Visual Basic
Копировать Код
public override double EndParam;
Копировать Код
Public Property EndParam As double
 Возвращает
 Возвращает конечный параметр эллипса. Тип double.
 Описание
 Свойство EndParam обеспечивает доступ к конечному значению параметра данного эллипса.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Ellipse, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!