Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Xrecord.MergeStyle
 Послать отзыв
 Данное свойство задает стиль слияния для операций вставки.
 Синтаксис
C#
Visual Basic
Копировать Код
public Teigha.DatabaseServices.DuplicateRecordCloning MergeStyle;
Копировать Код
Public Property MergeStyle() As Teigha.DatabaseServices.DuplicateRecordCloning
 Возвращает
 Возвращает стиль слияния из перечисления Teigha.DatabaseServices.DuplicateRecordCloning.
 Описание
 Данное свойство задает стиль слияния для операций вставки.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Xrecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!