Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Событие Database.ObjectModified
 Послать отзыв
 Синтаксис
C#
Visual Basic
public event ObjectEventHandler ObjectModified;
Public Event ObjectModified As ObjectEventHandler
 Описание
 Событие показывает, что объект изменен.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!