Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.Dimtad
 Послать отзыв
 Свойство позволяет выбирать вариант вертикального выравнивания размерного текста относительно размерной линии.
 Синтаксис
C#
Visual Basic
Копировать Код
public int Dimtad;
Копировать Код
Public Property Dimtad As Integer
 Возвращает
 Возвращает вариант вертикального выравнивания размерного текста. Тип int.
 Описание
 Свойство позволяет выбирать вариант вертикального выравнивания размерного текста относительно размерной линии из следующего списка:
 Значение
 Описание
 0
 "По центру" - размерный текст центрируется между выносными линиями.
 1
 "Над линией" - размерный текст размещается над размерной линией, кроме случая, когда размерная линия не горизонтальна, а текст между выносными линиями выровнен горизонтально.
 2
 "Снаружи" - размерный текст размещается рядом с размерной линией со стороны, наиболее удаленной от первой определяющей точки.
 3
 "Согласно JIS " - размерный текст размещается согласно требованиям промышленных стандартов Японии JIS (Japanese Industrial Standards).
 4
 "Под линией" - размерный текст размещается под размерной линией.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!