Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CubicSplineCurve3d.CubicSplineCurve3d
 Послать отзыв
 Конструктор класса CubicSplineCurve3d. Создает экземпляр класса с указанными определяющими точками, узловым вектором и первыми производными в определяющих точках.
 Синтаксис
C#
Visual Basic
Копировать Код
public CubicSplineCurve3d( ref KnotCollection knots, ref Point3dCollection fitPoints, ref Vector3dCollection firstDerivatives, bool periodic );
Копировать Код
Public Sub New( ByRef knots As KnotCollection, ByRef fitPoints As Point3dCollection, ByRef firstDerivatives As Vector3dCollection, periodic As Boolean )
 Параметры
 Параметры
 Описание
 knots
 Входной узловой вектор. Тип KnotCollection.
 fitPoints
 Входная коллекция определяющих точек. Тип Point3dCollection.
 firstDerivatives
 Входная коллекция векторов первых производных. Тип Vector3dCollection.
 periodic
 Флаг, указывающий, что сплайн должен быть периодическим (замкнутым). Тип bool.
 Описание
 Конструктор класса CubicSplineCurve3d. Создает экземпляр класса с заданными определяющими точками, первыми производными в них и узловым вектором. Дополнительно можно потребовать построение периодического (замкнутого) сплайна.
 Ссылки
 Teigha.Geometry.CubicSplineCurve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!