Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 DimStyleTableRecord.Dimtolj
 Послать отзыв
 Свойство отвечает за вертикальное выравнивание текста допуска по отношению к тексту размера.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual int Dimtolj { get; set; }
Копировать Код
Public Overridable Property Dimtolj As Integer
 Возвращает
 Возвращает тип данных int.
 Описание
 В свойстве хранится текущая настройка вертикального выравнивания текста допуска по отношению к тексту размера. В качестве значения свойства доступны следующие:
0 – внизу;
1 – по середине (по умолчанию)
2 – вверху.
 Свойство также доступно через системную переменную DIMTOLJ и пользовательское меню в окне изменения/создания размерного стиля:
  При изменении системной переменной DIMTOLJ будет создан новый размерный стиль под названием <переопределение> на основе текущего с новым значением DIMTOLJ.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.DimStyleTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!