Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ObjectContextCollection.Name
 Послать отзыв
 Свойство представляет имя данной коллекции контекстов.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual String Name;
Копировать Код
Public Overridable ReadOnly Property Name As String
 Возвращает
 Возвращает имя коллекции. Тип String.
 Описание
 Свойство представляет имя данной коллекции контекстов.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.ObjectContextCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!