Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Viewport.GridIncrement
 Послать отзыв
 Свойство GridIncrement представляет шаг сетки вдоль осей X и Y ПСК в данном видовом экране.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector2d GridIncrement;
Копировать Код
Public Property GridIncrement As Vector2d
 Возвращает
 Возвращает объект типа Vector2d, компоненты которого представляют шаг сетки вдоль соответствующей оси системы координат.
 Описание
 Свойство GridIncrement представляет текущие значения шага сетки вдоль осей X и Y пользовательской системы координат (в единицах чертежа) в данном видовом экране.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Viewport, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!