Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.OleDvAspect
 Послать отзыв
 Данное перечисление определяет желаемые данные или аспект представления объекта при отрисовке или получении данных.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum OleDvAspect { Content = 1, DocPrint = 8, Icon = 4, Thumbnail = 2 }
Копировать Код
Public Enum OleDvAspect Content = 1 DocPrint = 8 Icon = 4 Thumbnail = 2 End Enum
 Члены
 Члены
 Описание
 Content
 Значение: 1. Представление объекта, позволяющее его отображение в качестве встроенного объекта в некотором контейнере. Это значение обычно указывается для составных объектов документа. Представление может быть ориентировано как на дисплей, так и на принтер.
 Thumbnail
 Значение: 2. Представление объекта в виде миниатюры, позволяющее этому объекту отображаться в инструменте просмотра. Миниатюра представляет собой аппаратно-независимое растровое изображение, возможно, вставленное в метафайл. Рекомендуется использовать 16 цветов, характерный размер - примерно 120 х 120 пикселей.
 Icon
 Значение: 4. Значок, отображение объекта в виде значка.
 DocPrint
 Значение: 8. Представление объекта на экране так, как если бы он был распечатан на принтере с помощью команды "Печать" из меню "Файл". Отображаемые данные могут представлять собой последовательность страниц.
 Описание
 Данное перечисление определяет желаемые данные или аспект представления объекта при отрисовке или получении данных.
 Ваши комментарии по поводу этого топика: Послать отзыв!