Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SymbolUtilityServices.BlockModelSpaceName
 Послать отзыв
 Свойство BlockModelSpaceName представляет предопределенную запись символа для имени пространства модели.
 Синтаксис
C#
Visual Basic
Копировать Код
public static String BlockModelSpaceName;
Копировать Код
Public Shared ReadOnly Property BlockModelSpaceName As String
 Возвращает
 Возвращает предопределенное имя пространства модели. Тип String.
 Описание
 Свойство BlockModelSpaceName представляет предопределенную запись символа для имени пространства модели. Не может быть ни NULL, ни пустой строкой.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.SymbolUtilityServices, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!