Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.SurfaceSurfaceIntersectorConfigurations.IntersectionType
 Послать отзыв
 Свойство IntersectionType представляет тип пересечения двух поверхностей.
 Синтаксис
C#
Visual Basic
Копировать Код
public SurfaceSurfaceIntersectorType IntersectionType;
Копировать Код
Public ReadOnly Property IntersectionType As SurfaceSurfaceIntersectorType
 Возвращает
 Возвращает тип пересечения двух поверхностей. Значение из перечисления SurfaceSurfaceIntersectorType.
 Описание
 Свойство IntersectionType представляет тип пересечения двух поверхностей (некасательное пересечение, касательное пересечение с сонаправленными нормалями двух поверхностей или касательное пересечение с противонаправленными нормалями двух поверхностей).
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.SurfaceSurfaceIntersectorConfigurations, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!