Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.EllipticalCone.Set
 Послать отзыв
 Метод переопределяет у данного объекта косинус и синус половинного угла, точку начала координат, малый и большой радиусы, направляющие векторы оси симметрии и большой оси конуса, интервал высоты, а также начальный и конечный углы.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Set( double cosineAngle, double sineAngle, Point3d baseCenter, double minorRadius, double majorRadius, Vector3d axisOfSymmetry, Vector3d refAxis, ref Interval height, double startAngle, double endAngle );
Копировать Код
Public Sub [Set]( cosineAngle As Double, sineAngle As Double, baseCenter As Point3d, minorRadius As Double, majorRadius As Double, axisOfSymmetry As Vector3d, refAxis As Vector3d, ByRef height As Interval, startAngle As Double, endAngle As Double )
 Параметры
 Параметры
 Описание
 cosineAngle
 Косинус половинного угла. Тип double.
 sineAngle
 Синус половинного угла. Тип double.
 baseCenter
 Начало координат в основании конуса. Тип Point3d.
 minorRadius
 Малый радиус эллиптического конуса. Тип double.
 majorRadius
 Большой радиус эллиптического конуса. Тип double.
 axisOfSymmetry
 Направляющий вектор оси (симметрии) конуса. Тип Vector3d.
 height
 Интервал высоты конуса. Тип Interval.
 startAngle
 Начальный угол конуса. Тип double.
 endAngle
 Конечный угол конуса. Тип double.
 refAxis
 Направляющий вектор большой оси эллиптического конуса. Тип Vector3d.
 Описание
 Метод позволяет переопределить у данного объекта косинус и синус половинного угла, точку начала координат, малый и большой радиусы, направляющие векторы оси симметрии и большой оси конуса, интервал высоты, а также начальный и конечный углы.
 Ссылки
 Teigha.Geometry.EllipticalCone, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!