Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GroundPlaneBackground.ColorGroundPlaneFar
 Послать отзыв
 Свойство предоставляет доступ к цвету фона на дальнем плане (ближе к горизонту).
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual EntityColor ColorGroundPlaneFar;
Копировать Код
Public Overridable Property ColorGroundPlaneFar As EntityColor
 Возвращает
 Возвращает цвет объекта. Тип EntityColor.
 Описание
 Свойство предоставляет доступ к цвету фона на дальнем плане (ближе к горизонту).
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.GroundPlaneBackground, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!