Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Entity.ExplodeGeometry(DBObjectCollection)
 Послать отзыв
 Метод предназначен для разбиения данного объекта на набор более простых геометрических объектов.
 Синтаксис
C#
Visual Basic
Копировать Код
public void ExplodeGeometry(DBObjectCollection entitySet);
Копировать Код
Public Sub ExplodeGeometry(entitySet As DBObjectCollection)
 Параметры
 Параметры
 Описание
 entitySet
 Параметр для записи новых объектов, получившихся после разбиения данного. Может содержать элементы до выполнения метода. В этом случае новые элементы добавляются в конец коллекции. Тип DBObjectCollection
 Описание
 Метод разбивает данный объект на набор более простых объектов.
 Объекты, полученные в результате разбиения, добавляются в коллекцию entitySet. Вновь созданные сущности не являются резидентами базы данных. Стандартная реализация этой функции вызывает subWorldDraw() и создает сущности из геометрии, сгенерированной subWorldDraw(). Этот метод может быть переопределен в пользовательских классах.
 Ссылки
 Teigha.DatabaseServices.Entity, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!