Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Matrix3d.IsScaledOrtho
 Послать отзыв
 Метод позволяет проверить, перпендикулярны ли друг другу векторы-столбцы линейной части данной матрицы в пределах заданного допуска.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsScaledOrtho( Tolerance tolerance );
Копировать Код
Public Function IsScaledOrtho( tolerance As Tolerance ) As Boolean
 Параметры
 Параметры
 Описание
 tolerance
 Допуск, определяющий точность сравнения. Тип Tolerance.
 Возвращает
 Возвращает true, если трехмерные векторы, которые представлены столбцами линейной части этой матрицы, перпендикулярны друг другу в пределах заданного допуска. В противном случае возвращает false.
 Описание
 Метод позволяет проверить, перпендикулярны ли друг другу векторы-столбцы линейной части данной матрицы. Проверка выполняется с учетом заданного допуска tolerance.
 Ссылки
 Teigha.Geometry.Matrix3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!