Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Entity.CastShadows
 Послать отзыв
 Свойство предназначено для получения или установки флага, определяющего, будет ли геометрический объект участвовать в отбрасывании тени при визуализации сцены.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool CastShadows;
Копировать Код
Public Property CastShadows() As bool
 Возвращает
 Возвращает значение типа bool, где true указывает, что объект отбрасывает тень, а false — что не отбрасывает.
 Описание
 Свойство обеспечивает доступ к признаку отбрасывания тени геометрическим объектом.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Entity, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!