Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Spline.GetFitPointAt
 Послать отзыв
 Метод предоставляет указанную по индексу определяющую точку данного сплайна.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d GetFitPointAt( int index );
Копировать Код
Public Function GetFitPointAt( index As Integer ) As Point3d
 Параметры
 Параметры
 Описание
 index
 Индекс точки в массиве определяющих точек сплайна. Тип int.
 Возвращает
 Возвращает определяющую точку с указанным индексом. Тип Point3d.
 Описание
 Метод предоставляет указанную по индексу определяющую точку данного сплайна.
 Ссылки
 Teigha.DatabaseServices.Spline, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!