Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Viewport.GetPreviousBackground
 Послать отзыв
 Метод позволяет получить ранее заданный фон вида. Не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.ObjectId GetPreviousBackground( GraphicsInterface.DrawableType type );
Копировать Код
Public Function GetPreviousBackground( type As GraphicsInterface.DrawableType ) As DatabaseServices.ObjectId
 Параметры
 Параметры
 Описание
 type
 Тип объекта предыдущего фона. Перечисление GraphicsInterface.DrawableType.
 Возвращает
 Возвращает идентификатор объекта предыдущего фона. Тип DatabaseServices.ObjectId.
 Описание
 Метод позволяет получить ранее заданный фон вида. В текущей версии не реализован.
 Ссылки
 Teigha.DatabaseServices.Viewport, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!