Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocDependency.Status
 Послать отзыв
 Свойство получает и устанавливает текущий статус AssocStatus данной зависимости.
 Синтаксис
C#
Visual Basic
Копировать Код
public AssocStatus Status;
Копировать Код
Public Property Status() As AssocStatus
 Возвращает
 Возвращает статус зависимости как значение из перечисления AssocStatus.
 Описание
 Свойство получает и устанавливает текущий статус данной зависимости как значение из перечисления AssocStatus.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.AssocDependency, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!