Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FieldCodeWithChildren.FieldCode
 Послать отзыв
 Свойство FieldCode обеспечивает доступ к коду поля данного объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public String FieldCode;
Копировать Код
Public Property FieldCode As String
 Возвращает
 Возвращает код поля. Тип String.
 Описание
 Свойство FieldCode обеспечивает доступ к коду поля данного объекта.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.FieldCodeWithChildren, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!