Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Matrix3d.Translation
 Послать отзыв
 Свойство возвращает трансляционную часть данной матрицы в виде вектора.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d Translation;
Копировать Код
Public Property Translation() As Vector3d
 Возвращает
 Возвращает объект Vector3d.
 Описание
 Свойство возвращает трансляционную часть данной матрицы как вектор Vector3d.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.Matrix3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!