Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotSettings.PlotConfigurationName
 Послать отзыв
 Свойство PlotConfigurationName представляет имя системного принтера или файла конфигурации печати для этого объекта PlotSettings.
 Синтаксис
C#
Visual Basic
Копировать Код
public String PlotConfigurationName;
Копировать Код
Public ReadOnly Property PlotConfigurationName As String
 Возвращает
 Возвращает имя системного принтера или файла конфигурации печати. Тип String.
 Описание
 Свойство PlotConfigurationName представляет имя системного принтера или файла конфигурации печати для этого объекта PlotSettings.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.PlotSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!