Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SweepOptions.StartDraftDist
 Послать отзыв
 Свойство StartDraftDist представляет расстояние, на котором начинается сужение/расширение вытягиваемого объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public double StartDraftDist;
Копировать Код
Public ReadOnly Property StartDraftDist As Double
 Возвращает
 Возвращает расстояние, на котором начинается сужение/расширение вытягиваемого объекта. Тип double.
 Описание
 Свойство StartDraftDist представляет расстояние, на котором начинается сужение/расширение вытягиваемого объекта.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.SweepOptions, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!