Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 BlockTableRecord.XrefStatus
 Послать отзыв
 Свойство предназначено для внешних блоков и хранит информацию о состоянии ссылки.
 Синтаксис
C#
Visual Basic
Копировать Код
public XrefStatus XrefStatus { get; }
Копировать Код
Public ReadOnly Property XrefStatus As XrefStatus
 Возвращает
 Тип данных XrefStatus.
 Описание
 Свойство предназначено для внешних блоков, то есть блоков, вставленных в чертеж из других чертежей, и хранит в себе информацию о состоянии ссылки на этот внешний блок, которая может принимать одно из значений перечисления XrefStatus.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.BlockTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!