Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector3d.GetPerpendicularVector
 Послать отзыв
 Метод создает единичный 3D-вектор, который перпендикулярен данному.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d GetPerpendicularVector();
Копировать Код
Public Function GetPerpendicularVector() As Vector3d
 Возвращает
 Возвращает 3D-вектор единичной длины. Тип Vector3d.
 Описание
 Метод создает единичный 3D-вектор, который перпендикулярен данному.
 Если абсолютные значения координат x и y исходного вектора одновременно оказываются менее 1/64, то перпендикулярный вектор имеет координаты (vec.z, 0, -vec.x). В противном случае создается вектор (-vec.y, vec.x, 0). Результат нормируется на единицу.
 Ссылки
 Teigha.Geometry.Vector3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!