Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Image
 Послать отзыв
 Данный класс является базовым классом для растровых объектов, включая RasterImage.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::GraphicsInterface::Drawable Teigha::DatabaseServices::DBObject Teigha::DatabaseServices::Entity Teigha::DatabaseServices::Image
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("AcDbImage")] public class Image : Entity;
Копировать Код
<Wrapper("AcDbImage")> Public Class Image Inherits Entity
 Описание
 Данный класс является базовым классом для растровых объектов, включая RasterImage.
 Методы
 Конструкторы
 Teigha.GraphicsInterface.Drawable
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 Drawable
 Конструктор класса Teigha.GraphicsInterface.Drawable. (Унаследован от Drawable)
 Teigha.DatabaseServices.DBObject
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 DBObject
 Конструктор. (Унаследован от DBObject)
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.GraphicsInterface.Drawable
 Имя
 Описание
 Drawable Методы
 Ниже перечислены методы класса Drawable.
 Drawable Свойства
 Ниже перечислены свойства класса Drawable.
 Teigha.DatabaseServices.DBObject
 Имя
 Описание
 DBObject Методы
 Ниже перечислены методы класса DBObject.
 DBObject Свойства
 Ниже перечислены свойства класса DBObject.
 DBObject События
 Ниже перечислены события класса DBObject.
 Teigha.DatabaseServices.Entity
 Имя
 Описание
 Entity Методы
 Ниже перечислены методы класса Entity.
 Entity Свойства
 Ниже перечислены свойства класса Entity.
 Ссылки
 Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства, DBObject События
 Ваши комментарии по поводу этого топика: Послать отзыв!