Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.HighlightOverrule.SetNoFilter
 Послать отзыв
 Отключает при переопределении использование всех методов предварительной фильтрации объектов (SetCustomFilter, SetExtensionDictionaryEntryFilter, SetIdFilter, SetXDataFilter), а также метода IsApplicable() базового класса Overrule.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetNoFilter();
Копировать Код
Public Sub SetNoFilter()
 Описание
 Отключает при переопределении использование всех методов предварительной фильтрации объектов (SetCustomFilter, SetExtensionDictionaryEntryFilter, SetIdFilter, SetXDataFilter), а также метода IsApplicable() базового класса Overrule.
 Ссылки
 Teigha.DatabaseServices.HighlightOverrule, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!