Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeader.SetLeaderLineTypeId
 Послать отзыв
 Метод позволяет задать новый тип линии для линии выноски с указанным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetLeaderLineTypeId( int leaderLineIndex, DatabaseServices.ObjectId leaderLineTypeId );
Копировать Код
Public Sub SetLeaderLineTypeId( leaderLineIndex As Integer, leaderLineTypeId As DatabaseServices.ObjectId )
 Параметры
 Параметры
 Описание
 leaderLineIndex
 Индекс линии выноски. Тип int.
 leaderLineTypeId
 Идентификатор нового типа линии. Тип DatabaseServices.ObjectId.
 Описание
 Метод позволяет задать новый тип линии для линии выноски с указанным индексом.
 Ссылки
 Teigha.DatabaseServices.MLeader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!