Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.OffsetSurface.OffsetSurface
 Послать отзыв
 Конструктор класса OffsetSurface. Создает поверхность, являющуюся точным смещением указанной базовой поверхности на заданное расстояние.
 Синтаксис
C#
Visual Basic
Копировать Код
public OffsetSurface( ref Surface baseSurface, double offsetDistance );
Копировать Код
Public Sub New( ByRef baseSurface As Surface, offsetDistance As Double )
 Параметры
 Параметры
 Описание
 baseSurface
 Входная базовая поверхность. Тип Surface.
 offsetDistance
 Величина смещения (со знаком). Тип double.
 Описание
 Конструктор класса OffsetSurface. Создает поверхность, являющуюся точным смещением базовой поверхности baseSurface на расстояние offsetDistance.
 Ссылки
 Teigha.Geometry.OffsetSurface, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!