Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Solid.Solid
 Послать отзыв
 Конструктор по умолчанию класса Solid.
 Синтаксис
C#
Visual Basic
Копировать Код
public Solid();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса Solid.
 Ссылки
 Teigha.DatabaseServices.Solid, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!