Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Layout.AnnoAllVisible
 Послать отзыв
 Свойство обеспечивает доступ к текущему значению системной переменной ANNOALLVISIBLE для базы данных.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool AnnoAllVisible;
Копировать Код
Public Property AnnoAllVisible() As Boolean
 Возвращает
 Возвращает true, если отображаются все аннотативные объекты, и false, если отображаются только те аннотативные объекты, которые поддерживают текущий аннотативный масштаб.
 Описание
 Свойство обеспечивает доступ к текущему значению системной переменной ANNOALLVISIBLE для базы данных.
 Это функция запроса переменных заголовка базы данных.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Layout, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!