Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.KnotCollection.GetInterval
 Послать отзыв
 Метод находит ненулевой узловой интервал, в который попадает точка с указанным значением параметра.
 Синтаксис
C#
Visual Basic
Копировать Код
public int GetInterval( int order, double parameter, out Interval interval );
Копировать Код
Public Function GetInterval( order As Integer, parameter As Double, ByRef interval As Interval ) As Integer
 Параметры
 Параметры
 Описание
 order
 Входной порядок сплайна. Тип int.
 parameter
 Входное значение параметра, определяющее точку в коллекции узлов. Тип double.
 interval
 Найденный узловой интервал. Тип Interval.
 Возвращает
 Возвращает индекс найденного узлового интервала interval. Тип int.
 Описание
 Метод вычисляет ненулевой узловой интервал, в который попадает точка, определяемая параметром parameter. Значение параметра должно находиться между узлами с индексами (order - 1) и (length() - order), где order представляет порядок сплайна.
 Ссылки
 Teigha.Geometry.KnotCollection, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!