Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbCurve3d.NurbCurve3d
 Послать отзыв
 Конструктор класса NurbCurve3d. Создает трехмерную NURBS кривую, которая с заданной точностью интерполирует указанный массив трехмерных точек.
 Синтаксис
C#
Visual Basic
Копировать Код
public NurbCurve3d( ref Point3dCollection fitPoints, Tolerance fitTolerance );
Копировать Код
Public Sub New( ByRef fitPoints As Point3dCollection, fitTolerance As Tolerance )
 Параметры
 Параметры
 Описание
 fitPoints
 Входная коллекция определяющих точек. Тип Point3dCollection.
 fitTolerance
 Входная точность интерполяции. Тип Tolerance. Ограничивает максимальное отклонение интерполирующей кривой от определяющих точек.
 Описание
 Создает трехмерную NURBS кривую, которая с заданной точностью интерполирует указанный массив трехмерных точек.
 Ссылки
 Teigha.Geometry.NurbCurve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!