Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CellContent.DataFormat
 Послать отзыв
 Свойство DataFormat представляет строку форматирования содержимого ячейки таблицы.
 Синтаксис
C#
Visual Basic
Копировать Код
public String DataFormat;
Копировать Код
Public Property DataFormat As String
 Возвращает
 Возвращает строку форматирования содержимого ячейки. Тип String.
 Описание
 Свойство DataFormat представляет строку форматирования содержимого ячейки таблицы.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.CellContent, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!