Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DwgFiler.WriteInt32
 Послать отзыв
 Метод предназначен для записи заданного 32-разрядного целого числа со знаком (тип int) в этот объект Filer.
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract void WriteInt32( int value );
Копировать Код
Public MustOverride Sub WriteInt32( value As Integer )
 Параметры
 Параметры
 Описание
 value
 Записываемое в Filer значение. Тип int.
 Описание
 Метод предназначен для записи заданного 32-разрядного целого числа со знаком (тип int) в этот объект Filer.
 Ссылки
 Teigha.DatabaseServices.DwgFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!