Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SectionSettings.HatchSpacing
 Послать отзыв
 Метод позволяет получить интервал штриховки для геометрии указанного типа.
 Синтаксис
C#
Visual Basic
Копировать Код
public double HatchSpacing( SectionType nSecType, SectionGeometry nGeometry );
Копировать Код
Public Function HatchSpacing( nSecType As SectionType, nGeometry As SectionGeometry ) As Double
 Параметры
 Параметры
 Описание
 nSecType
 Тип сечения. Перечисление SectionType.
 nGeometry
 Типы элементов геометрии сечения. Перечисление SectionGeometry.
 Возвращает
 Возвращает значение интервала штриховки. Тип double.
 Описание
 Метод позволяет получить значение интервала штриховки для геометрии указанного типа.
 Ссылки
 Teigha.DatabaseServices.SectionSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!