Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GripDataCollection.IsReadOnly
 Послать отзыв
 Свойство IsReadOnly позволяет проверить, что коллекция доступна только на чтение.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual bool IsReadOnly;
Копировать Код
Public Overridable ReadOnly Property IsReadOnly As Boolean
 Возвращает
 Возвращает true, если коллекция доступна только на чтение. В противном случае возвращает false.
 Описание
 Свойство IsReadOnly позволяет проверить, доступна ли коллекция только на чтение.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.GripDataCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!