Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Sphere.NorthAxis
 Послать отзыв
 Свойство NorthAxis представляет направление на северный полюс данной сферы.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d NorthAxis;
Копировать Код
Public ReadOnly Property NorthAxis As Vector3d
 Возвращает
 Возвращает направление на северный полюс данной сферы. Тип Vector3d.
 Описание
 Свойство NorthAxis представляет направление на северный полюс данной сферы.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.Sphere, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!