Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.Dimtzin
 Послать отзыв
 Свойство управляет подавлением нулей при отображении допусков.
 Синтаксис
C#
Visual Basic
Копировать Код
public int Dimtzin;
Копировать Код
Public Property Dimtzin As Integer
 Возвращает
 Возвращает вариант отображения нулей в значениях допусков. Тип int.
 Описание
 Свойство позволяет получить или задать вариант отображения нулей в значениях допусков.
 Кодировка режимов имеет следующий вид:
 Значение
 Описание
 0
 Подавляет нулевые значения для целых футов и дюймов.
 1
 Отображает нулевые значения целых для футов и дюймов.
 2
 Отображает нулевые значения для футов и подавляет нулевые значения для дюймов.
 3
 Подавляет нулевые значения для футов и отображает для дюймов.
 4
 Подавляет ведущие нули в десятичных размерах (например, 0,5000 записывается как ,5000).
 8
 Подавляет замыкающие нули в десятичных размерах (например, 12,5000 записывается как 12,5).
 12
 Подавляет как ведущие, так и замыкающие нули (например, 0,5000 записывается как ,5).
 Свойство Dimtzin учитывается, только если отображение допусков включено (т.е., свойство Dimtol имеет значение true).
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!