Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Database.Save
 Послать отзыв
 This is Save, a member of class Database.
 Синтаксис
C#
Visual Basic
public void Save();
Public Sub Save()
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!