Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.TableHitTestInfo
 Послать отзыв
 Класс TableHitTestInfo представляет данные, получаемые от метода Table.HitTest().
 Иерархия классов
Teigha::DatabaseServices::TableHitTestInfo
 Синтаксис
C#
Visual Basic
Копировать Код
public struct TableHitTestInfo
Копировать Код
Public Structure TableHitTestInfo
 Описание
 Класс TableHitTestInfo представляет данные, получаемые от метода Table.HitTest().
 Топики
 Имя
 Описание
 TableHitTestInfo Методы
 Ниже перечислены методы класса TableHitTestInfo.
 TableHitTestInfo Свойства
 Ниже перечислены свойства класса TableHitTestInfo.
 Ссылки
 TableHitTestInfo Методы, TableHitTestInfo Свойства, Топики, TableHitTestInfo Методы, TableHitTestInfo Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!