Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SubDMesh.NumberOfVertices
 Послать отзыв
 Свойство предоставляет доступ к количеству вершин на базовом уровне сети.
 Синтаксис
C#
Visual Basic
Копировать Код
public int NumberOfVertices;
Копировать Код
Public Property NumberOfVertices() As Integer
 Возвращает
 Свойство возвращает количество вершин, int.
 Описание
 Свойство предоставляет доступ к количеству вершин на базовом уровне сети.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.SubDMesh, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!