Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Dimtfillclr
 Послать отзыв
 Синтаксис
C#
Visual Basic
public Colors::Color Dimtfillclr;
Public Property Dimtfillclr() As Colors.Color
 Описание
 Возвращает или устанавливает текущий размерный цвет фона (если dimtfill установлен в 1).
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!