Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LinkedTableData.SetCellState
 Послать отзыв
 Метод позволяет задать состояние указанной ячейки.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetCellState( int row, int column, CellStates value );
Копировать Код
Public Overridable Sub SetCellState( row As Integer, column As Integer, value As CellStates )
 Параметры
 Параметры
 Описание
 row
 Индекс строки. Тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 column
 Индекс столбца. Тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице.
 value
 Состояние ячейки. Перечисление CellStates.
 Описание
 Метод позволяет задать состояние указанной ячейки.
 Замечания
 Метод выбрасывает исключение eInvalidInput, если индексы строки и/или столбца выходят за допустимые пределы.
 Ссылки
 Teigha.DatabaseServices.LinkedTableData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!