Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FitData.StartTangent
 Послать отзыв
 Свойство возвращает направление касательной в начале сплайна.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d StartTangent;
Копировать Код
Public ReadOnly Property StartTangent As Vector3d
 Возвращает
 Возвращает направление касательной. Тип Vector3d.
 Описание
 Свойство возвращает направление касательной в начале сплайна.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.FitData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!