Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 DimStyleTableRecord.Dimtfill
 Послать отзыв
 Свойство отвечает за настройку фоновой заливки размерного текста.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual int Dimtfill { get; set; }
Копировать Код
Public Overridable Property Dimtfill As Integer
 Возвращает
 Возвращает тип данных int.
 Описание
 В свойстве хранится настройка фоновой заливки размерного текста. Свойство принимает в качестве значения целое число. Возможны следующие значения:
0 – без заливки (по умолчанию);
1 – цвета фона рисования;
2 – цвет указан в Dimtfillclr.
 Свойство также доступно через системную переменную DIMTFILL и пользовательское меню в окне изменения/создания размерного стиля:
  При изменении системной переменной DIMTFILL будет создан новый размерный стиль под названием <переопределение> на основе текущего с новым значением DIMTFILL.
 Условия
 Чтение и запись.
 Пример
 Пример изменения фоновой заливки размерного текста (значения свойства Dimtfill) в размерном стиле Standard:
C#
 Копировать Код
public partial class Commands { [Teigha.Runtime.CommandMethod("DimtfillChange")] public void DimtfillStandardDimStyle() { // Получение ссылки на активный документ HostMgd.ApplicationServices.Document doc = HostMgd.ApplicationServices.Application.DocumentManager.MdiActiveDocument; // Получение ссылки на редактор документа HostMgd.EditorInput.Editor ed = doc.Editor; // Получение ссылки на базу данных документа Teigha.DatabaseServices.Database db = doc.Database; // Начало транзакции с базой данных документа using (Teigha.DatabaseServices.Transaction trans = db.TransactionManager.StartTransaction()) { // Открываем таблицу размерных стилей для чтения Teigha.DatabaseServices.DimStyleTable dimStyleTable = trans.GetObject(db.DimStyleTableId, Teigha.DatabaseServices.OpenMode.ForRead) as Teigha.DatabaseServices.DimStyleTable; // Находим в таблице размерных стилей ObjectId нужного стиля по его названию Teigha.DatabaseServices.ObjectId styleId = dimStyleTable["Standard"]; // Открываем таблицу размерного стиля для изменений Teigha.DatabaseServices.DimStyleTableRecord obj = trans.GetObject(styleId, Teigha.DatabaseServices.OpenMode.ForWrite) as Teigha.DatabaseServices.DimStyleTableRecord; ed.WriteMessage($"nDimtfill before: {obj.Dimtfill}"); // Изменяем цвет заливки размерного текста obj.Dimtfill = 2; ed.WriteMessage($"nDimtfill after: {obj.Dimtfill}"); trans.Commit(); } } }
 Результат работы команды DimtfillChange:
 Было:
 Стало:
 Ссылки
 Teigha.DatabaseServices.DimStyleTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!