Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Matrix3dBuilder
 Послать отзыв
 Класс Matrix3dBuilder используется для создания экземпляров класса Teigha.Geometry.Matrix3d, который является неизменяемым типом.
 Иерархия классов
Teigha::Geometry::Matrix3dBuilder
 Синтаксис
C#
Visual Basic
Копировать Код
[DefaultMember("ElementAt")] public class Matrix3dBuilder
Копировать Код
<DefaultMember("ElementAt")> Public Class Matrix3dBuilder
 Описание
 Класс Matrix3dBuilder используется для создания экземпляров класса Teigha.Geometry.Matrix3d, который является неизменяемым типом.
 Методы
 Конструкторы
 Имя
 Описание
 Matrix3dBuilder
 Это обзор перегрузок Matrix3dBuilder.
 Топики
 Имя
 Описание
 Matrix3dBuilder Методы
 Ниже перечислены методы класса Matrix3dBuilder.
 Matrix3dBuilder Свойства
 Ниже перечислены свойства класса Matrix3dBuilder.
 Ссылки
 Matrix3dBuilder Конструктор, Matrix3dBuilder Методы, Matrix3dBuilder Свойства, Методы, Топики, Matrix3dBuilder Методы, Matrix3dBuilder Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!