Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.TableStyle.IsBackgroundColorNone
 Послать отзыв
 Метод позволяет проверить, отображается ли цвет фона в строках указанного типа.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual bool IsBackgroundColorNone( RowType rowType );
Копировать Код
Public Overridable Function IsBackgroundColorNone( rowType As RowType ) As Boolean
 Параметры
 Параметры
 Описание
 rowType
 Тип строки. Перечисление RowType.
 Возвращает
 Возвращает true, если цвет фона не отображается. В противном случае возвращает false.
 Описание
 Метод позволяет проверить, отображается ли цвет фона в строках указанного типа.
 Ссылки
 Teigha.DatabaseServices.TableStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!