Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.PlanarEntity.IntersectWith
 Послать отзыв
 Метод вычисляет точку пересечения данной плоской поверхности с указанной линией, используя предписанную точность.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d[] IntersectWith( ref LinearEntity3d linearEntity, Tolerance tolerance );
Копировать Код
Public Function IntersectWith( ByRef linearEntity As LinearEntity3d, tolerance As Tolerance ) As Point3d()
 Параметры
 Параметры
 Описание
 linearEntity
 Входной линейный объект. Тип LinearEntity3d.
 tolerance
 Заданная точность для вычисления точки пересечения. Тип Tolerance.
 Возвращает
 Возвращает массив, в котором содержится единственная точка пересечения (если она существует). Тип Point3d[].
 Описание
 Метод вычисляет точку пересечения данной плоской поверхности с линейным объектом linearEntity, используя точность tolerance.
 Ссылки
 Teigha.Geometry.PlanarEntity, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!