Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeader.LeaderLineColor
 Послать отзыв
 Свойство представляет цвет линии выноски у данного объекта MLeader.
 Синтаксис
C#
Visual Basic
Копировать Код
public Teigha.Colors.Color LeaderLineColor;
Копировать Код
Public Property LeaderLineColor As Teigha.Colors.Color
 Возвращает
 Возвращает цвет линии выноски. Тип Teigha.Colors.Color.
 Описание
 Свойство представляет цвет линии выноски у данного объекта MLeader.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MLeader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!