Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CurveCurveIntersector3d.OverlapDirection
 Послать отзыв
 Метод позволяет проверить взаимную ориентацию кривых на участке их перекрытия.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool OverlapDirection();
Копировать Код
Public Function OverlapDirection() As Boolean
 Возвращает
 Возвращает true, если две кривые ориентированы в одном направлении на участке их перекрытия. В случае противоположной ориентации перекрывающихся кривых возвращает значение false. Тип bool.
 Описание
 Метод позволяет проверить взаимную ориентацию кривых на участке их перекрытия.
 Замечания
 Полученное значение имеет смысл, только если метод OverlapCount() возвращает положительное значение, т.е. только при наличии перекрытий.
 Ссылки
 Teigha.Geometry.CurveCurveIntersector3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!