Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CellRange.ClearStyleOverrides
 Послать отзыв
 Метод удаляет из ячеек переопределения стиля таблицы.
 Синтаксис
C#
Visual Basic
Копировать Код
public void ClearStyleOverrides();
Копировать Код
Public Sub ClearStyleOverrides()
 Описание
 Метод удаляет из ячеек переопределения стиля таблицы.
 Ссылки
 Teigha.DatabaseServices.CellRange, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!