Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeader.HasContent
 Послать отзыв
 Метод позволяет проверить, определено ли содержимое в данном объекте MLeader.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool HasContent();
Копировать Код
Public Function HasContent() As Boolean
 Возвращает
 Возвращает true, если содержимое определено. В противном случае возвращает false.
 Описание
 Метод позволяет проверить, определено ли содержимое в данном объекте MLeader.
 Ссылки
 Teigha.DatabaseServices.MLeader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!