Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CompoundObjectId.DwgInFields
 Послать отзыв
 Метод предназначен для чтения данных этого объекта из файла .dwg.
 Синтаксис
C#
Visual Basic
Копировать Код
public void DwgInFields( ref DwgFiler filer, int ownerVersion );
Копировать Код
Public Sub DwgInFields( ByRef filer As DwgFiler, ownerVersion As Integer )
 Параметры
 Параметры
 Описание
 filer
 Входной DWG-файлер. Тип DwgFiler.
 ownerVersion
 Версия владельца. Тип int. Клиентский код должен передавать значение 0.
 Описание
 Метод предназначен для чтения данных этого объекта из файла .dwg с использованием переданного в метод объекта DwgFiler.
 Ссылки
 Teigha.DatabaseServices.CompoundObjectId, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!