Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbCurve3dFitData.EndTangent
 Послать отзыв
 Свойство EndTangent представляет конечный вектор касательной.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d EndTangent;
Копировать Код
Public ReadOnly Property EndTangent As Vector3d
 Возвращает
 Возвращает конечный вектор касательной. Тип Vector3d.
 Описание
 Свойство EndTangent представляет конечный вектор касательной.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.NurbCurve3dFitData, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!