Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство RasterImageDef.SourceFileName
 Послать отзыв
 Синтаксис
C#
Visual Basic
public String SourceFileName;
Public Property SourceFileName() As String
 Описание
 Обеспечивает доступ к пути имени файла изображения, который расположен отдельно. Это имя файла сохраняется в файле формата .dwg. Требует, чтобы объект RasterImageDef был открыт на чтение.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.RasterImageDef, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!