Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Viewport.ViewCenter
 Послать отзыв
 Свойство ViewCenter представляет точку центра вида в данном видовом экране в системе координат дисплея.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point2d ViewCenter;
Копировать Код
Public Property ViewCenter As Point2d
 Возвращает
 Возвращает точку центра вида в данном видовом экране. Тип Point2d.
 Описание
 Свойство ViewCenter представляет точку центра вида в данном видовом экране в системе координат дисплея (DCS).
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Viewport, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!