Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Helix.TotalLength
 Послать отзыв
 Свойство возвращает текущее значение полной длины спирали.
 Синтаксис
C#
Visual Basic
Копировать Код
public double TotalLength;
Копировать Код
Public ReadOnly Property TotalLength As Double
 Возвращает
 Возвращает полную длину спирали. Тип double.
 Описание
 Свойство возвращает текущее значение полной длины спирали.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Helix, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!