Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ObjectContextManager.RegisterContextCollection
 Послать отзыв
 Метод позволяет зарегистрировать в данном менеджере контекстов коллекцию контекстов под указанным именем.
 Синтаксис
C#
Visual Basic
Копировать Код
public void RegisterContextCollection( ref String collectionName, ref ObjectContextCollection collection );
Копировать Код
Public Sub RegisterContextCollection( ByRef collectionName As String, ByRef collection As ObjectContextCollection )
 Параметры
 Параметры
 Описание
 collectionName
 Имя для регистрации коллекции контекстов. Тип String.
 collection
 Коллекция контекстов. Тип ObjectContextCollection.
 Описание
 Метод позволяет зарегистрировать в данном менеджере контекстов коллекцию контекстов под указанным именем.
 Ссылки
 Teigha.DatabaseServices.ObjectContextManager, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!