Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 DimStyleTableRecord.Dimexe
 Послать отзыв
 Свойство отвечает величину удлинения выносных линий за размерные.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual double Dimexe { get; set; }
Копировать Код
Public Overridable Property Dimexe As Double
 Возвращает
 Возвращает тип данных double.
 Описание
 В свойстве хранится величина удлинения выносных линий за размерные в виде числа double. Свойство может принимать только положительные числа. Значение по умолчанию 2.0.
 Свойство также доступно через системную переменную DIMEXE и пользовательское меню в окне изменения/создания размерного стиля:
  При изменении системной переменной DIMEXE будет создан новый размерный стиль под названием <переопределение> на основе текущего с новым значением DIMEXE.
 Условия
 Чтение и запись.
 Пример
 Пример изменения удлинения выносных линий за размерные (значения свойства Dimexe) в размерном стиле Standard:
C#
 Копировать Код
public partial class Commands { [Teigha.Runtime.CommandMethod("DimexeChange")] public void DimexeStandardDimStyle() { // Получение ссылки на активный документ HostMgd.ApplicationServices.Document doc = HostMgd.ApplicationServices.Application.DocumentManager.MdiActiveDocument; // Получение ссылки на редактор документа HostMgd.EditorInput.Editor ed = doc.Editor; // Получение ссылки на базу данных документа Teigha.DatabaseServices.Database db = doc.Database; // Начало транзакции с базой данных документа using (Teigha.DatabaseServices.Transaction trans = db.TransactionManager.StartTransaction()) { // Открываем таблицу размерных стилей для чтения Teigha.DatabaseServices.DimStyleTable dimStyleTable = trans.GetObject(db.DimStyleTableId, Teigha.DatabaseServices.OpenMode.ForRead) as Teigha.DatabaseServices.DimStyleTable; // Находим в таблице размерных стилей ObjectId нужного стиля по его названию Teigha.DatabaseServices.ObjectId styleId = dimStyleTable["Standard"]; // Открываем таблицу размерного стиля для изменений Teigha.DatabaseServices.DimStyleTableRecord obj = trans.GetObject(styleId, Teigha.DatabaseServices.OpenMode.ForWrite) as Teigha.DatabaseServices.DimStyleTableRecord; ed.WriteMessage($"nDimexe before: {obj.Dimexe}"); // Изменяем величину выступа выносных линий за размерные obj.Dimexe = 3; ed.WriteMessage($"nDimexe after: {obj.Dimexe}"); trans.Commit(); } } }
 Результат работы команды DimexeChange:
 Было:
 Стало:
 Ссылки
 Teigha.DatabaseServices.DimStyleTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!