Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 DimStyleTableRecord.DimStyleTableRecord()
 Послать отзыв
 Конструктор класса
 Синтаксис
C#
Visual Basic
public DimStyleTableRecord(); public DimStyleTableRecord(IntPtr obj, bool autoDelete);
Public Sub New() Public Sub New(obj As IntPtr, autoDelete As bool)
 Описание
 Конструктор класса.
 Ссылки
 Teigha.DatabaseServices.DimStyleTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!