Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Rectangle3d.LowerRight
 Послать отзыв
 Свойство LowerRight представляет правую нижнюю вершину прямоугольника.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d LowerRight;
Копировать Код
Public ReadOnly Property LowerRight As Point3d
 Возвращает
 Возвращает указанную вершину прямоугольника. Тип Point3d.
 Описание
 Свойство LowerRight представляет правую нижнюю вершину прямоугольника.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Rectangle3d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!