Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CoordinateSystem2d.IsEqualTo
 Послать отзыв
 Метод позволяет проверить, совпадает ли переданная в метод координатная система CoordinateSystem2d с данным объектом.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsEqualTo( CoordinateSystem2d a );
Копировать Код
Public Function IsEqualTo( a As CoordinateSystem2d ) As Boolean
 Параметры
 Параметры
 Описание
 a
 Входная система координат, которая сравнивается с данной. Тип CoordinateSystem2d.
 Возвращает
 Возвращает true, если переданная система координат a не является нулевой и имеет те же начальную точку и направляющие векторы осей X и Y. В противном случае возвращает false.
 Описание
 Метод позволяет проверить, совпадает ли переданная в метод координатная система CoordinateSystem2d с данным объектом. Используется вызов метода CoordinateSystem2d.IsEqualTo(CoordinateSystem2d a, Tolerance tolerance) с точностью, равной Tolerance.Global.
 Ссылки
 Teigha.Geometry.CoordinateSystem2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!