Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.Columns
 Послать отзыв
 Данное свойство предоставляет доступ к коллекции столбцов объекта Table.
 Синтаксис
C#
Visual Basic
Копировать Код
public ColumnsCollection Columns;
Копировать Код
Public Property Columns() As ColumnsCollection
 Возвращает
 Возвращает коллекцию столбцов объекта Table. Тип ColumnsCollection.
 Описание
 Данное свойство предоставляет доступ к коллекции столбцов объекта Table.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!