Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Dimtmove
 Послать отзыв
 Синтаксис
C#
Visual Basic
public int Dimtmove;
Public Property Dimtmove() As Integer
 Описание
 Возвращает или устанавливает текущее значение DIMTMOVE для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!