Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocArrayPolarParameters.StartAngle
 Послать отзыв
 Свойство обеспечивает доступ к углу первого элемента кругового массива.
 Синтаксис
C#
Visual Basic
Копировать Код
public double StartAngle;
Копировать Код
Public Property StartAngle() As Double
 Возвращает
 Возвращает угол в радианах базовой точки первого элемента кругового массива. Тип double.
 Описание
 Свойство обеспечивает доступ к углу в радианах базовой точки первого элемента кругового массива.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.AssocArrayPolarParameters, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!