Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Cylinder.ReferenceAxis
 Послать отзыв
 Свойство ReferenceAxis предоставляет доступ к направлению отсчета углов в основании данного цилиндра.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d ReferenceAxis;
Копировать Код
Public ReadOnly Property ReferenceAxis As Vector3d
 Возвращает
 Возвращает направление отсчета углов в основании цилиндра. Тип Vector3d.
 Описание
 Свойство ReferenceAxis предоставляет доступ к направлению, от которого отсчитываются углы в основании данного цилиндра.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.Cylinder, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!