Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Sphere.Set
 Послать отзыв
 Метод позволяет переопределить точку центра и радиус данной сферы.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Set( double radius, Point3d center );
Копировать Код
Public Sub Set( radius As Double, center As Point3d )
 Параметры
 Параметры
 Описание
 radius
 Новое значение радиуса сферы. Тип double.
 center
 Новая точка центра сферы. Тип Point3d.
 Описание
 Метод позволяет переопределить точку центра и радиус данной сферы.
 Ссылки
 Teigha.Geometry.Sphere, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!