Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.PlanarEntity.IsParallelTo
 Послать отзыв
 Метод позволяет проверить параллельность данного объекта и указанной плоской поверхности в пределах точности по умолчанию.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsParallelTo( ref PlanarEntity otherPlanarEntity );
Копировать Код
Public Function IsParallelTo( ByRef otherPlanarEntity As PlanarEntity ) As Boolean
 Параметры
 Параметры
 Описание
 otherPlanarEntity
 Проверяемая на параллельность плоская поверхность. Тип PlanarEntity.
 Возвращает
 Возвращает true, если в пределах точности по умолчанию сравниваемые плоские объекты можно считать параллельными. В противном случае возвращает false.
 Описание
 Метод позволяет проверить параллельность данного объекта и плоской поверхности otherPlanarEntity в пределах точности по умолчанию.
 Используется вызов PlanarEntity.IsParallelTo(ref PlanarEntity otherPlanarEntity, Tolerance tolerance) с точностью, равной Tolerance.Global.
 Ссылки
 Teigha.Geometry.PlanarEntity, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!