Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Viewport.SnapIsoPair
 Послать отзыв
 Свойство SnapIsoPair представляет плоскость изометрии для данного видового экрана.
 Синтаксис
C#
Visual Basic
Копировать Код
public int SnapIsoPair;
Копировать Код
Public Property SnapIsoPair As Integer
 Возвращает
 Возвращает код плоскости изометрии. Тип int.
 Описание
 Свойство SnapIsoPair представляет плоскость изометрии для данного видового экрана. Допустимые значения:
 Значение
 Описание
 0
 Левая изоплоскость.
 1
 Верхняя изоплоскость.
 2
 Правая изоплоскость.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Viewport, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!