Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.OpenModeAttribute.OpenMode
 Послать отзыв
 Свойство представляет режим открытия объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.OpenMode OpenMode;
Копировать Код
Public ReadOnly Property OpenMode As DatabaseServices.OpenMode
 Возвращает
 Возвращает режим открытия объекта. Значение из перечисления DatabaseServices.OpenMode.
 Описание
 Свойство представляет режим открытия объекта.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.OpenModeAttribute, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!