Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBDictionaryEntry.ToString
 Послать отзыв
 Возвращает строковое представление данного объекта в виде экземпляра String. Формат получаемой строки определяется настройками языка и региональных параметров. Подробнее см. в документации Microsoft .NET API.
 Синтаксис
C#
Visual Basic
Копировать Код
public String ToString( ref IFormatProvider provider );
Копировать Код
Public Function ToString( ByRef provider As IFormatProvider ) As String
 Параметры
 Параметры
 Описание
 provider
 Входной аргумент типа System.IFormatProvider.
 Возвращает
 Возвращает экземпляр String.
 Описание
 Возвращает строковое представление данного объекта в виде экземпляра String. Формат получаемой строки определяется настройками языка и региональных параметров. Подробнее см. в документации Microsoft .NET API.
 Ссылки
 Teigha.DatabaseServices.DBDictionaryEntry, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!