Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Position2d.Set
 Послать отзыв
 Метод переопределяет координаты данного объекта позиции, используя указанные значения (x,y).
 Синтаксис
C#
Visual Basic
Копировать Код
public void Set( double x, double y );
Копировать Код
Public Sub [Set]( x As Double, y As Double )
 Параметры
 Параметры
 Описание
 x
 Входная координата по оси X. Тип double.
 y
 Входная координата по оси Y. Тип double.
 Описание
 Метод переопределяет координаты данного объекта позиции, используя указанные значения (x,y).
 Ссылки
 Teigha.Geometry.Position2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!