Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ObjectContextCollectionEnumerator.IEnumerator_get_Current
 Послать отзыв
 Метод позволяет получить текущий элемент коллекции.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual Object IEnumerator_get_Current();
Копировать Код
Public Overridable Function IEnumerator_get_Current() As Object Implements IEnumerator.get_Current
 Возвращает
 Возвращает элемент коллекции. Тип Object.
 Описание
 Метод позволяет получить текущий элемент коллекции.
 Ссылки
 Teigha.DatabaseServices.ObjectContextCollectionEnumerator, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!