Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CellContent.TextStyleId
 Послать отзыв
 Свойство TextStyleId представляет ObjectId текстового стиля содержимого ячейки.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectId TextStyleId;
Копировать Код
Public Property TextStyleId As ObjectId
 Возвращает
 Возвращает идентификатор объекта текстового стиля. Тип ObjectId.
 Описание
 Свойство TextStyleId представляет идентификатор объекта текстового стиля содержимого ячейки.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.CellContent, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!