Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.HostApplicationServices.ReleaseMajorVersion
 Послать отзыв
 Свойство возвращает основную версию релиза клиентского приложения.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual int ReleaseMajorVersion;
Копировать Код
Public Overridable ReadOnly Property ReleaseMajorVersion As Integer
 Возвращает
 Возвращает основную версию релиза клиентского приложения. Тип int.
 Описание
 Свойство возвращает основную версию релиза клиентского приложения.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.HostApplicationServices, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!