Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 ViewportTableRecord.UpperRightCorner
 Послать отзыв
 Свойство предназначено для хранения координат правой верхней точки видового экрана пространства модели.
 Синтаксис
C#
Visual Basic
public Point2d UpperRightCorner;
Public Property UpperRightCorner() As Point2d
 Возвращает
 Возвращает тип данных Point2d.
 Описание
 Свойство предназначено для хранения координат правой верхней точки видового экрана пространства модели. По умолчанию, пространство модели имеет один видовой экран, правый верхний угол которого имеет значение этого свойства (1,1). Если разбить пространство модели на несколько видовых экранов по горизонтали, то координаты этой точки у каждого из видовых экранов будут отличаться координатой Y.
 Свойство в основном используется при программном разбиении пространства модели на несколько видовых экранов.
 Условия
 Чтение и запись.
 Ссылки
 ViewportTableRecord Класс, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!