Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.EllipticalArc2d.MajorAxis
 Послать отзыв
 Свойство MajorAxis представляет направление большой оси данной эллиптической дуги.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector2d MajorAxis;
Копировать Код
Public ReadOnly Property MajorAxis As Vector2d
 Возвращает
 Возвращает направление большой оси эллиптической дуги. Тип Vector2d.
 Описание
 Свойство MajorAxis представляет направление большой оси данной эллиптической дуги.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.EllipticalArc2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!