Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Matrix2dInfo.IsMirror
 Послать отзыв
 Свойство IsMirror позволяет проверить наличие в матрице компоненты зеркального отражения.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsMirror;
Копировать Код
Public ReadOnly Property IsMirror As Boolean
 Возвращает
 Возвращает true, если в преобразовании присутствует компонента зеркального отражения. В противном случае возвращает false.
 Описание
 Свойство IsMirror позволяет проверить наличие в матрице компоненты зеркального отражения.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.Matrix2dInfo, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!