Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.PointOnCurve2d.Parameter
 Послать отзыв
 Свойство Parameter обеспечивает доступ к значению параметра точки на кривой, которую представляет данный объект.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Parameter;
Копировать Код
Public Property Parameter As Double
 Возвращает
 Возвращает значение параметра точки на кривой. Тип double.
 Описание
 Свойство Parameter обеспечивает доступ к значению параметра точки на кривой, которую представляет данный объект.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.Geometry.PointOnCurve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!