Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocArrayCommonParameters.SetLevelSpacing
 Послать отзыв
 Метод позволяет задать расстояние между уровнями ассоциативного массива.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetLevelSpacing( double spacing, ref String expression, ref String evaluatorId );
Копировать Код
Public Sub SetLevelSpacing( spacing As Double, ByRef expression As String, ByRef evaluatorId As String )
 Параметры
 Параметры
 Описание
 spacing
 Входное расстояние между уровнями ассоциативного массива. Тип double.
 expression
 Выражение для параметра. Тип String. Строка может быть пустой.
 evaluatorId
 Строковое представление идентификатора вычислителя. Тип String. Строка может быть пустой.
 Описание
 Метод позволяет задать расстояние между уровнями ассоциативного массива.
 Если для параметра выражение отсутствует, строки expression и evaluatorId должны быть пустыми.
 Ссылки
 Teigha.DatabaseServices.AssocArrayCommonParameters, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!