Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotStyleTable.Lineweights
 Послать отзыв
 Свойство Lineweights представляет список толщин линий, использование которых предусмотрено данным объектом PlotStyleTable.
 Синтаксис
C#
Visual Basic
Копировать Код
public DoubleCollection Lineweights;
Копировать Код
Public WriteOnly Property Lineweights As DoubleCollection
 Возвращает
 Возвращает коллекцию весов (толщин) линий. Тип DoubleCollection.
 Описание
 Свойство Lineweights представляет список толщин линий, использование которых предусмотрено данным объектом PlotStyleTable.
 Условия
 Только запись.
 Ссылки
 Teigha.DatabaseServices.PlotStyleTable, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!