Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.LineSegment2d
 Послать отзыв
 Класс LineSegment2d представляет линейные сегменты в двумерном пространстве.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Geometry::Entity2d Teigha::Geometry::Curve2d Teigha::Geometry::LinearEntity2d Teigha::Geometry::LineSegment2d
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdGeLineSeg2d")] public sealed class LineSegment2d : LinearEntity2d
Копировать Код
<Wrapper("OdGeLineSeg2d")> Public NotInheritable Class LineSegment2d Inherits LinearEntity2d
 Описание
 Класс LineSegment2d представляет линейные сегменты (прямолинейные отрезки) в двумерном пространстве.
 Методы
 Конструкторы
 Teigha.Geometry.LineSegment2d
 Имя
 Описание
 LineSegment2d
 Это обзор перегрузок LineSegment2d.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Geometry.Entity2d
 Имя
 Описание
 Entity2d Методы
 Ниже перечислены методы класса Entity2d.
 Teigha.Geometry.Curve2d
 Имя
 Описание
 Curve2d Методы
 Ниже перечислены методы класса Curve2d.
 Curve2d Свойства
 Ниже перечислены свойства класса Curve2d.
 Teigha.Geometry.LinearEntity2d
 Имя
 Описание
 LinearEntity2d Методы
 Ниже перечислены методы класса LinearEntity2d.
 LinearEntity2d Свойства
 Ниже перечислены свойства класса LinearEntity2d.
 Teigha.Geometry.LineSegment2d
 Имя
 Описание
 LineSegment2d Методы
 Ниже перечислены методы класса LineSegment2d.
 LineSegment2d Свойства
 Ниже перечислены свойства класса LineSegment2d.
 Ссылки
 LineSegment2d Конструктор, LineSegment2d Методы, LineSegment2d Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!