Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocManager.EvaluateTopLevelNetwork
 Послать отзыв
 Метод обновляет ассоциативную сеть верхнего уровня (представленную объектом AssocNetwork) указанной базы данных, используя обратный вызов глобального обновления.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool EvaluateTopLevelNetwork( ref Teigha.DatabaseServices.Database database, ref Object callback, int callbackOrder );
Копировать Код
Public Function EvaluateTopLevelNetwork( ByRef database As Teigha.DatabaseServices.Database, ByRef callback As Object, callbackOrder As Integer ) As Boolean
 Параметры
 Параметры
 Описание
 database
 База данных, ассоциативную сеть верхнего уровня требуется обновить (перевычислить). Тип Teigha.DatabaseServices.Database.
 callback
 Пользовательский обратный вызов, на который будет ссылаться объект AssocEvaluationMultiCallback. Тип Object.
 callbackOrder
 Порядок выполнения пользовательских обратных вызовов. Чем меньше значение порядка, тем раньше выполняется обратный вызов. Тип int.
 Возвращает
 Возвращает true, если обновление ассоциативной сети завершается успешно. В противном случае возвращает false.
 Описание
 Метод обновляет ассоциативную сеть верхнего уровня (представленную объектом AssocNetwork) указанной базы данных, используя обратный вызов глобального обновления.
 В большинстве случаев клиентскому коду не требуется явно обновлять ассоциативную сеть верхнего уровня. Это происходит автоматически при изменении режима блокировки документа, а также в ходе операций перетаскивания.
 Ссылки
 Teigha.DatabaseServices.AssocManager, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!