Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.EllipticalArc2d.Set
 Послать отзыв
 Метод позволяет переопределить данный объект, используя указанную круглую дугу.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Set( ref CircularArc2d arc );
Копировать Код
Public Sub Set( ByRef arc As CircularArc2d )
 Параметры
 Параметры
 Описание
 arc
 Входная круглая дуга. Тип CircularArc2d.
 Описание
 Метод позволяет переопределить данный объект, используя указанную круглую дугу.
 Ссылки
 Teigha.Geometry.EllipticalArc2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!