Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.LensLength
 Послать отзыв
 Синтаксис
C#
Visual Basic
public double LensLength;
Public Property LensLength() As Double
 Описание
 Возвращает или устанавливает значение системной переменной LENSLENGTH.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!