Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector2dCollection.Add
 Послать отзыв
 Метод добавляет в коллекцию указанный объект Vector2d.
 Синтаксис
C#
Visual Basic
Копировать Код
public int Add( Vector2d value );
Копировать Код
Public Function Add( value As Vector2d ) As Integer
 Параметры
 Параметры
 Описание
 value
 Входной объект для добавления в коллекцию. Тип Vector2d.
 Возвращает
 Возвращает количество элементов в коллекции после добавления объекта value. Тип int.
 Описание
 Метод добавляет в коллекцию новый элемент, используя указанный объект Vector2d.
 Ссылки
 Teigha.Geometry.Vector2dCollection, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!