Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Solid3d.OffsetFaces
 Послать отзыв
 Метод позволяет смещать указанные грани твердого тела на заданное расстояние.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void OffsetFaces( ref SubentityId[] subentityIds, double offsetDistance );
Копировать Код
Public Overridable Sub OffsetFaces( ByRef subentityIds() As SubentityId, offsetDistance As Double )
 Параметры
 Параметры
 Описание
 subentityIds
 Массив идентификаторов подобъектов граней. Тип SubentityId[].
 offsetDistance
 Величина смещения. Тип double.
 Описание
 Метод позволяет смещать указанные грани твердого тела на заданное расстояние.
 Грани с поверхностями, которые невозможно сместить, удаляются, а тело залечивается, если это возможно. Применяются следующие ограничения:
Количество граней, указанных в массиве subentityIds должно быть больше нуля.
offsetDistance >= минус половина максимальной стороны габаритного бокса данного твердого тела.
offsetDistance| >= 1e-6.
 Этот метод реализован только в среде пространственного моделирования.
 Ссылки
 Teigha.DatabaseServices.Solid3d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!