Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Light.IsOn
 Послать отзыв
 Свойство позволяет проверить, включен ли данный источник света.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsOn;
Копировать Код
Public Property IsOn As Boolean
 Возвращает
 Возвращает true, если источник света включен. В противном случае возвращает false.
 Описание
 Свойство позволяет проверить, включен ли данный источник света.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Light, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!