Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Solid3d.Revolve
 Послать отзыв
 Метод позволяет создать трехмерное твердое тело вращением указанной области на заданный угол вокруг заданной оси.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void Revolve( ref Region region, Point3d axisPoint, Vector3d axisDir, double angleOfRevolution );
Копировать Код
Public Overridable Sub Revolve( ByRef region As Region, axisPoint As Point3d, axisDir As Vector3d, angleOfRevolution As Double )
 Параметры
 Параметры
 Описание
 region
 Вращаемая область. Тип Region.
 axisPoint
 Точка на линии, проекция которой дает ось вращения. Тип Point3d.
 axisDir
 Направляющий вектор линии, проекция которой дает ось вращения. Тип Vector3d.
 angleOfRevolution
 Угол вращения в радианах по модулю 2*Pi. Тип double.
 Описание
 Метод позволяет создать трехмерное твердое тело вращением указанной области на заданный угол вокруг оси вращения.
 Ось вращения определяется проекцией линии, заданной точкой и вектором, на плоскость области region параллельно ее нормали. Таким образом, вращаемая область и ось вращения всегда компланарны.
 Область поворачивается на угол angleOfRevolution по модулю 2*Pi в радианах вокруг оси вращения. Положительное направление отсчета углов определяется правилом правой руки - по часовой стрелке, если смотреть вдоль оси вращения.
 Ось вращения должна быть допустимой для вращения области region:
Направление axisDir не может быть перпендикулярно плоскости области region,
Проекция оси вращения не может пересекать переданную в метод область region.
 Действуют следующие ограничения:
Угол поворота, который по модулю меньше 1e-6, считается равным нулю.
 Этот метод реализован только в среде пространственного моделирования.
 Ссылки
 Teigha.DatabaseServices.Solid3d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!