Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство LinetypeTableRecord.Comments
 Послать отзыв
 Синтаксис
C#
Visual Basic
public String Comments;
Public Property Comments() As String
 Описание
 Обеспечивает доступ к строке, используемой объектом LinetypeTableRecord для описания типа линии в виде такого же простого ASCII текста, который вы можете найти в файле описания типа линии (в поле "Описание").
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.LinetypeTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!