Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AttributeDefinition.Tag
 Послать отзыв
 Свойство позволяет получить или задать строку тега данного объекта AttributeDefinition.
 Синтаксис
C#
Visual Basic
Копировать Код
public String Tag;
Копировать Код
Public Property Tag() As String
 Возвращает
 Возвращает строку тега. Тип String.
 Описание
 Свойство позволяет получить или задать строку тега данного объекта AttributeDefinition.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.AttributeDefinition, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!