Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MTextFragment.LineBreak
 Послать отзыв
 Свойство позволяет проверить, завершается ли данный фрагмент символом разрыва строки.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool LineBreak;
Копировать Код
Public ReadOnly Property LineBreak As Boolean
 Возвращает
 Возвращает true, если фрагмент завершается разрывом строки. В противном случае возвращает false.
 Описание
 Свойство позволяет проверить, завершается ли данный фрагмент символом разрыва строки.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.MTextFragment, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!