Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Hatch.PatternName
 Послать отзыв
 Синтаксис
C#
Visual Basic
public String PatternName;
Public Property PatternName() As String
 Описание
 Возвращает имя образца для объекта заливки.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.Hatch, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!