Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.DimStyleTableId
 Послать отзыв
 Синтаксис
C#
Visual Basic
public DatabaseServices::ObjectId DimStyleTableId;
Public Property DimStyleTableId() As DatabaseServices.ObjectId
 Описание
 Возвращает Id объекта DimStyleTable базы данных.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!