Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Leader.RemoveLastVertex
 Послать отзыв
 Синтаксис
C#
Visual Basic
public void RemoveLastVertex();
Public Sub RemoveLastVertex()
 Описание
 Удаляет последнюю вершину (вершину завершения аннотации) из списка вершин. Note Метод сбрасывает установленные ассоциативности.
 Ссылки
 Teigha.DatabaseServices.Leader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!