Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Cylinder.GetHeightAt
 Послать отзыв
 Метод вычисляет высоту цилиндра, которая соответствует переданному значению параметра U.
 Синтаксис
C#
Visual Basic
Копировать Код
public double GetHeightAt( double parameter );
Копировать Код
Public Function GetHeightAt( parameter As Double ) As Double
 Параметры
 Параметры
 Описание
 parameter
 Значение параметра U из области определения цилиндра. Тип double.
 Возвращает
 Возвращает значение высоты, которая соответствует переданному значению parameter. Тип double.
 Описание
 Метод вычисляет высоту цилиндра, которая соответствует переданному значению параметра U.
 Ссылки
 Teigha.Geometry.Cylinder, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!