Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SymbolUtilityServices.GetInsertPathNameFromBlockName
 Послать отзыв
 Метод позволяет извлечь путь из имени блока.
 Синтаксис
C#
Visual Basic
Копировать Код
public static String GetInsertPathNameFromBlockName( ref String blockName );
Копировать Код
Public Shared Function GetInsertPathNameFromBlockName( ByRef blockName As String ) As String
 Параметры
 Параметры
 Описание
 blockName
 Имя блока, для которого требуется получить путь. Тип String.
 Возвращает
 Возвращает строку с именем блока или пустую строку, если blockName имеет значение NULL. Тип String.
 Описание
 Метод позволяет извлечь путь из имени блока. Если полученное имя пути не имеет расширения, в конец строки добавляется расширение ".dwg".
 Ссылки
 Teigha.DatabaseServices.SymbolUtilityServices, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!