Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.ToleranceSuppressLeadingZeros
 Послать отзыв
 Свойство позволяет управлять подавлением ведущих нулей в значениях отклонений размеров, выраженных в основных единицах.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool ToleranceSuppressLeadingZeros;
Копировать Код
Public Property ToleranceSuppressLeadingZeros As Boolean
 Возвращает
 Возвращает true, если подавление включено. В противном случае возвращает false.
 Описание
 Свойство позволяет управлять подавлением ведущих нулей в значениях отклонений размеров, выраженных в основных единицах.
 Это свойство действует только в случае, когда для свойства Dimtol установлено значение true.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!