Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MText.SetDynamicColumns
 Послать отзыв
 Метод задает столбцу (колонке текста) тип DynamicColumns с заданными шириной, просветом между столбцами и значением флага автоподбора высоты столбца.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetDynamicColumns( double width, double gutter, bool auto_height );
Копировать Код
Public Sub SetDynamicColumns( width As Double, gutter As Double, auto_height As Boolean )
 Параметры
 Параметры
 Описание
 width
 Ширина столбца. Тип double.
 gutter
 Расстояние между столбцами текста (column gutter). Тип double.
 auto_height
 Флаг автоподбора высоты столбцов. Тип bool. Значение true включает режим автоматического подбора высоты столбца.
 Описание
 Метод задает столбцу (колонке текста) тип DynamicColumns с заданными шириной, просветом между столбцами и значением флага автоподбора высоты столбца.
 Ссылки
 Teigha.DatabaseServices.MText, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!