Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Событие Database.BeginWblockSelectedObjects
 Послать отзыв
 Синтаксис
C#
Visual Basic
public event BeginWblockSelectedObjectsEventHandler BeginWblockSelectedObjects;
Public Event BeginWblockSelectedObjects As BeginWblockSelectedObjectsEventHandler
 Описание
 Событие показывает, что операция клонирования wblock начала выполняться над множеством геометрических объектов базы данных чертежа.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!