Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.Dimlwe
 Послать отзыв
 Свойство задает или возвращает толщину (вес) обеих выносных линий.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.LineWeight Dimlwe;
Копировать Код
Public Property Dimlwe As DatabaseServices.LineWeight
 Возвращает
 Возвращает вес линий как объект типа DatabaseServices.LineWeight.
 Описание
 Свойство задает или возвращает толщину (вес) обеих выносных линий.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!