Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObject.Unappended
 Послать отзыв
 Событие происходит каждый раз, когда обрабатывается отмена добавления объекта в базу данных.
 Синтаксис
C#
Visual Basic
Копировать Код
public event EventHandler Unappended;
Копировать Код
Public Event Unappended As EventHandler
 Возвращает
 Тип данных EventHandler, представляющий обработчик события.
 Описание
 Событие происходит каждый раз, когда обрабатывается отмена добавления объекта в базу данных.
 Ссылки
 Teigha.DatabaseServices.DBObject, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!