Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DxfFiler.AtSubclassData
 Послать отзыв
 Метод проверяет, является ли текущим элементом этого файлера маркер данных подкласса с указанным именем подкласса.
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract bool AtSubclassData( ref String value );
Копировать Код
Public MustOverride Function AtSubclassData( ByRef value As String ) As Boolean
 Параметры
 Параметры
 Описание
 value
 Имя подкласса. Тип String.
 Возвращает
 Возвращает true, если текущим элементом файлера является маркер данных подкласса с именем value. В противном случае возвращает false.
 Описание
 Метод проверяет, является ли текущим элементом этого файлера маркер данных подкласса (DxfCode Subclass) с именем подкласса, которое передано методу в параметре value. Если это так, то файлер перемещает указатель файла на следующий элемент и возвращает true. В противном случае указатель файла остается в на прежнем месте и возвращается false.
 Ссылки
 Teigha.DatabaseServices.DxfFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!