Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PaperOrientationStates
 Послать отзыв
 Перечисление PaperOrientationStates определяет текущее значение свойства ориентации бумаги для аннотативного объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum PaperOrientationStates { True = 0, False = 1, NotApplicable = 2 }
Копировать Код
Public Enum PaperOrientationStates True = 0 False = 1 NotApplicable = 2 End Enum
 Члены
 Члены
 Описание
 True
 Значение: 0. Объект в данный момент уже связан с ориентацией бумаги.
 False
 Значение: 1. Объект в данный момент не связан с ориентацией бумаги.
 NotApplicable
 Значение: 2. Свойство неприменимо, т.к. ориентация бумаги не задана.
 Описание
 Перечисление PaperOrientationStates определяет текущее значение свойства ориентации бумаги для аннотативного объекта.
 Ваши комментарии по поводу этого топика: Послать отзыв!