Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeaderStyle.DrawLeaderOrderType
 Послать отзыв
 Свойство представляет последовательность отрисовки сегментов выносных линий объектов MLeader, предусмотренный данным стилем.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.DrawLeaderOrderType DrawLeaderOrderType;
Копировать Код
Public Property DrawLeaderOrderType As DatabaseServices.DrawLeaderOrderType
 Возвращает
 Возвращает последовательность отрисовки сегментов выносных линий. Тип DatabaseServices.DrawLeaderOrderType.
 Описание
 Свойство представляет последовательность отрисовки сегментов выносных линий объектов MLeader, предусмотренный данным стилем.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MLeaderStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!