Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Solid3d.ImprintEntity
 Послать отзыв
 Метод реализует операцию клеймения данного твердого тела указанным объектом.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void ImprintEntity( ref Entity entity );
Копировать Код
Public Overridable Sub ImprintEntity( ByRef entity As Entity )
 Параметры
 Параметры
 Описание
 entity
 Объект для клеймения на данном твердом теле. Тип Entity.
 Описание
 Метод позволяет построить пересечение указанного объекта entity с данным твердым телом и добавить в 3D-тело новую фасетную грань путем клеймения.
 Типы объектов, клеймение которых на 3D теле допускается данным методом:
Curve,
Solid3d,
Body,
Region,
Trace,
Solid.
Face.
 Этот метод реализован только в среде пространственного моделирования.
 Ссылки
 Teigha.DatabaseServices.Solid3d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!