Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CircularArc2d.CircularArc2d
 Послать отзыв
 Конструктор по умолчанию класса CircularArc2d. Создает единичную окружность с центром (0,0).
 Синтаксис
C#
Visual Basic
Копировать Код
public CircularArc2d();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса CircularArc2d. Создает единичную окружность с центром (0,0).
 Ссылки
 Teigha.Geometry.CircularArc2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!