Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Body.NumChanges
 Послать отзыв
 Свойство возвращает количество изменений, произошедших с этим телом с момента его создания.
 Синтаксис
C#
Visual Basic
Копировать Код
public int NumChanges;
Копировать Код
Public Property NumChanges() As Integer
 Возвращает
 Возвращает количество изменений в данном теле. Тип int.
 Описание
 Свойство возвращает количество изменений, произошедших с этим телом с момента его создания.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Body, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!