Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.UnderlayReference.Path
 Послать отзыв
 Свойство Path представляет полный путь к файлу подложки.
 Синтаксис
C#
Visual Basic
Копировать Код
public String Path;
Копировать Код
Public Property Path As String
 Возвращает
 Возвращает полный путь к файлу подложки. Тип String.
 Описание
 Свойство Path представляет полный путь к файлу подложки.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.UnderlayReference, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!