Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DwgFiler.ReadBoolean
 Послать отзыв
 Метод предназначен для получения логического значения из текущего элемента этого объекта Filer.
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract bool ReadBoolean();
Копировать Код
Public MustOverride Function ReadBoolean() As Boolean
 Возвращает
 Возвращает логическое значение из текущего элемента этого объекта Filer.
 Описание
 Метод предназначен для получения логического значения из текущего элемента этого объекта Filer.
 Ссылки
 Teigha.DatabaseServices.DwgFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!