Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector2d.IsParallelTo
 Послать отзыв
 Метод позволяет проверить, параллелен ли входной вектор данному вектору в пределах заданной точности.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsParallelTo( Vector2d vector, Tolerance tolerance );
Копировать Код
Public Function IsParallelTo( vector As Vector2d, tolerance As Tolerance ) As Boolean
 Параметры
 Параметры
 Описание
 vector
 Проверяемый вектор. Тип Vector2d.
 tolerance
 Заданная точность сравнения. Тип Tolerance.
 Возвращает
 Возвращает true, если в пределах указанной точности оба вектора можно считать параллельными. В противном случае возвращает false.
 Описание
 Метод позволяет проверить, параллелен ли входной вектор vector данному вектору в пределах заданной точности tolerance.
 Замечания
 Реализация приводит оба вектора к единичной длине. В случае отрицательного скалярного произведения векторов, изменяет направление входного вектора на противоположное. Затем выполняется проверка на совпадение полученных векторов в пределах заданной точности tolerance.
 Ссылки
 Teigha.Geometry.Vector2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!