Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GeoLocationData.ReferencePoint
 Послать отзыв
 Свойство обеспечивает доступ к координатам текущей геоточки данного объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d ReferencePoint;
Копировать Код
Public Property ReferencePoint As Point3d
 Возвращает
 Возвращает геоточку. Тип Point3d.
 Описание
 Свойство обеспечивает доступ к координатам текущей геоточки данного объекта.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.GeoLocationData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!