Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Poly3dType
 Послать отзыв
 Перечисление Poly3dType определяет поддерживаемые типы 3D-полилиний.
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdDb.Poly3dType")] public enum Poly3dType { SimplePoly = 0, QuadSplinePoly = 1, CubicSplinePoly = 2 }
Копировать Код
<Wrapper("OdDb.Poly3dType")> Public Enum Poly3dType SimplePoly = 0 QuadSplinePoly = 1 CubicSplinePoly = 2 End Enum
 Члены
 Члены
 Описание
 SimplePoly
 Значение: 0. Простая полилиния.
 QuadSplinePoly
 Значение: 1. Полилиния, аппроксимирующая кривую квадратичным B-сплайном.
 CubicSplinePoly
 Значение: 2. Полилиния, аппроксимирующая кривую кубическим B-сплайном.
 Описание
 Перечисление Poly3dType определяет поддерживаемые типы 3D-полилиний.
 Ваши комментарии по поводу этого топика: Послать отзыв!