Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbCurve3dData.!=
 Послать отзыв
 Оператор неравенства структуры NurbCurve3dData.
 Синтаксис
C#
Visual Basic
Копировать Код
public static bool operator !=( NurbCurve3dData a, NurbCurve3dData b );
Копировать Код
Public Shared Operator <>( a As NurbCurve3dData, b As NurbCurve3dData ) As Boolean
 Параметры
 Параметры
 Описание
 a
 Левый операнд. Тип NurbCurve3dData.
 b
 Правый операнд. Тип NurbCurve3dData.
 Возвращает
 Возвращает true, если операнды не равны друг другу. В противном случае возвращает false.
 Описание
 Оператор неравенства структуры NurbCurve3dData.
 Замечания
 Объекты типа NurbCurve3dData считаются неравными, если нарушается хотя бы одно из следующих условий:
Обе кривые являются рациональными (назначены веса) или обе являются нерациональными (веса не используются);
Обе кривые являются периодическими (замкнутыми) или обе являются непериодическими (незамкнутыми);
Управляющие вершины совпадают;
Коллекции узлов совпадают;
Значения весов равны.
 Ссылки
 Teigha.Geometry.NurbCurve3dData, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!