Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocArray.GetItemTransform
 Послать отзыв
 Метод извлекает матрицу преобразования, которая применяется к элементу ассоциативного массива с указанным локатором ItemLocator.
 Синтаксис
C#
Visual Basic
Копировать Код
public Matrix3d GetItemTransform( ItemLocator index );
Копировать Код
Public Function GetItemTransform( index As ItemLocator ) As Matrix3d
 Параметры
 Параметры
 Описание
 index
 Локатор элемента ассоциативного массива. Тип ItemLocator.
 Возвращает
 Возвращает матрицу геометрического преобразования для указанного элемента массива. Тип Matrix3d.
 Описание
 Метод извлекает матрицу преобразования, которая применяется к элементу ассоциативного массива с указанным локатором ItemLocator.
 Ссылки
 Teigha.DatabaseServices.AssocArray, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!