Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CollisionType
 Послать отзыв
 Перечисление CollisionType определяет интерпретацию объекта в процессе обнаружения коллизий.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum CollisionType { None = 0, Solid = 1 }
Копировать Код
Public Enum CollisionType None = 0 Solid = 1 End Enum
 Члены
 Члены
 Описание
 None
 Значение: 0. Объект не участвует в обнаружении коллизий.
 Solid
 Значение: 1. Объект принимает участие в обнаружении коллизий, и в этом процессе интерпретируется как твердое тело.
 Описание
 Перечисление CollisionType определяет интерпретацию объекта в процессе обнаружения коллизий. Он может игнорироваться в этом процессе, либо рассматриваться как твердое тела в конкретных границах.
 Ваши комментарии по поводу этого топика: Послать отзыв!