Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.LayerStateManager
 Послать отзыв
 This is LayerStateManager, a member of class Database.
 Синтаксис
C#
Visual Basic
public DatabaseServices::LayerStateManager LayerStateManager;
Public Property LayerStateManager() As DatabaseServices.LayerStateManager
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!