Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.ExternalBoundedSurface.GetContours
 Послать отзыв
 Метод предоставляет доступ к геометрии криволинейной границы на поверхности.
 Синтаксис
C#
Visual Basic
Копировать Код
public CurveBoundary[] GetContours();
Копировать Код
Public Function GetContours() As CurveBoundary()
 Возвращает
 Возвращает массив контуров криволинейной границы. Тип CurveBoundary[].
 Описание
 Метод обеспечивает доступ к геометрии криволинейной границы на поверхности. Результат представляется в виде массива экземпляров CurveBoundary. Чтобы получить размер массива, используется свойство NumContours.
 Каждый из этих экземпляров в общем случае включает массив ориентированных 3D-кривых и/или 3D-позиций и массив соответствующих ориентированных кривых в параметрическом пространстве. Вообще говоря, у конкретного 3D-объекта некоторая кривая в параметрическом пространстве может и отсутствовать. У такого объекта соответствующий элемент в массиве кривых в параметрическом пространстве будет равен NULL.
 Для каждого экземпляра CurveBoundary могут иметь место следующие ситуации.
Значение numContours = 1 и единственный экземпляр CurveBoundary, который представлен одной позицией в 3D-пространстве и необязательной кривой в параметрическом пространстве. Этот случай представляет контур на поверхности, который вырожден в точку. Если кривая в параметрическом пространстве всё же присутствует, она вычисляется по поверхности для единственной позиции в 3D-пространстве.
Общий случай, когда геометрия в трехмерном пространстве представляет собой набор экземпляров Curve3d и экземпляров Position3d. Наличие объекта Position3d указывает на сегмент контура, который выродился в точку трехмерного пространства. Логическая ориентация 3D-кривой согласуется с ориентацией набора точек в трехмерном пространстве, полученного при вычислении кривой в параметрическом пространстве по поверхности (с учетом логической ориентации кривой в параметрическом пространстве).
 Ссылки
 Teigha.Geometry.ExternalBoundedSurface, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!