Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Entity.Explode(DBObjectCollection)
 Послать отзыв
 Метод предназначен для получения коллекции указателей на нерезидентные геометрические объекты, представляющие части исходного объекта при его разбиении, с возможностью добавления новых элементов в существующую коллекцию без изменения базы данных.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Explode(DBObjectCollection entitySet);
Копировать Код
Public Sub Explode(entitySet As DBObjectCollection)
 Параметры
 Параметры
 Описание
 entitySet
 Коллекция указателей на новые геометрические объекты; этот массив уже может содержать указатели, полученные при применении методов explode() для других геометрических объектов
 Описание
 Этот метод может использоваться в приложениях для получения коллекции указателей на не резидентные в базе данных геометрические объекты, которые представляют части геометрического объекта при его разбиении.
 При вызове метода, коллекция entitySet не обязана быть пустой. Метод добавит элементы в коллекцию, и указатели на объекты, которые метод добавляет, могут быть использованы на своих местах как результаты "разбиения".
 Разработка метода в производных классах
 Этот метод должен динамически создавать (используя оператор new) те примитивы, которые подходят для графической замены исходного геометрического объекта после выполнения операции разбиения. Указатели на эти геометрические объекты добавляются в коллекцию entitySet. Note Данная функция не должна добавлять новые геометрические объекты в базу данных и не должна очищать геометрические объекты из базы.
 Пользовательские геометрические объекты
 При использовании пользовательских геометрических объектов, вы должны определить метод разбиения для того, чтобы команды nanoCAD BHATCH и EXPLODE могли работать. Ваш метод разбиения должен разбить ваш геометрический объект на менее сложные геометрические объекты.
 Ссылки
 Teigha.DatabaseServices.Entity, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!