Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.TableEnumerator.Reset
 Послать отзыв
 Метод реинициализирует перечислитель, сбрасывая его текущий индекс в значение -1.
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract void Reset();
Копировать Код
Public MustOverride Sub Reset()
 Описание
 Метод реинициализирует перечислитель, сбрасывая его текущий индекс в значение -1.
 Ссылки
 Teigha.DatabaseServices.TableEnumerator, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!