Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.SplineEntity3d.EndParameter
 Послать отзыв
 Свойство EndParameter представляет максимальное значение параметра у данного сплайна. Не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public double EndParameter;
Копировать Код
Public ReadOnly Property EndParameter As Double
 Возвращает
 Возвращает максимальное значение параметра у данного сплайна. Тип double.
 Описание
 Свойство EndParameter представляет максимальное значение параметра у данного сплайна. Не реализовано.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.SplineEntity3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!