Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство BlockReference.BlockTableRecord
 Послать отзыв
 Синтаксис
C#
Visual Basic
public DatabaseServices::ObjectId BlockTableRecord;
Public Property BlockTableRecord() As DatabaseServices.ObjectId
 Описание
 Возвращает или устанавливает Id объекта BlockTableRecord, на который ссылается ссылка на блок.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.BlockReference, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!