Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AbstractViewTableRecord.Elevation
 Послать отзыв
 Свойство Elevation представляет возвышение плоскости ПСК (UCS) данного видового экрана.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Elevation;
Копировать Код
Public Property Elevation As Double
 Возвращает
 Возвращает возвышение плоскости ПСК (UCS) видового экрана. Тип double.
 Описание
 Свойство Elevation представляет возвышение плоскости ПСК (UCS) данного видового экрана.
 Замечания
 Возвышение - это расстояние от начала мировой системы координат (МСК, WCS) до плоскости ПСК объекта.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.AbstractViewTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!