Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Spline.UpdateFitData
 Послать отзыв
 Метод обновляет данные аппроксимации сплайна.
 Синтаксис
C#
Visual Basic
Копировать Код
public void UpdateFitData();
Копировать Код
Public Sub UpdateFitData()
 Описание
 Метод обновляет данные аппроксимации сплайна. Если допуск аппроксимации равен нулю, то сплайн перестраивается; в противном случае данные аппроксимации удаляются.
 Ссылки
 Teigha.DatabaseServices.Spline, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!