Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LoftOptions.CheckPathCurve
 Послать отзыв
 Метод позволяет проверить, допустима ли указанная траектория для успешного выполнения данной операции лофта.
 Синтаксис
C#
Visual Basic
Копировать Код
public void CheckPathCurve( ref Entity pathCurve, bool displayErrorMessages );
Копировать Код
Public Sub CheckPathCurve( ByRef pathCurve As Entity, displayErrorMessages As Boolean )
 Параметры
 Параметры
 Описание
 pathCurve
 Кривая траектории для вытягивания по сечениям. Тип Entity.
 displayErrorMessages
 Флаг, определяющий, требуется ли отображать сообщения об ошибках. Тип bool. Значение по умолчанию - false.
 Описание
 Метод позволяет проверить, допустима ли указанная траектория для успешного выполнения данной операции лофта. Метод выбрасывает исключение eInvalidInput, если кривые недопустимы.
 Ссылки
 Teigha.DatabaseServices.LoftOptions, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!