Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Polyline2d.Polyline2d
 Послать отзыв
 Конструктор по умолчанию.
 Синтаксис
C#
Visual Basic
Копировать Код
public Polyline2d();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию. Создает незамкнутую полилинию с отключенной генерацией типа линии. Инициализирует начальную и конечную ширину равными 0.0, прогиб — 0.0, уровень — 0.0, тип — SimplePoly, нормаль — (0,0,1) и толщину — 0.0.
 Ссылки
 Teigha.DatabaseServices.Polyline2d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!