Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GridPropertyParameter.Visibility
 Послать отзыв
 Свойство представляет видимость линий сетки.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.Visibility Visibility;
Копировать Код
Public Visibility As DatabaseServices.Visibility
 Возвращает
 Возвращает видимость линий сетки. Тип DatabaseServices.Visibility.
 Описание
 Свойство представляет видимость линий сетки.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.GridPropertyParameter, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!