Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Элемент данных FieldEvaluationStatusResult.errorMessage
 Послать отзыв
 This is errorMessage, a member of class FieldEvaluationStatusResult.
 Синтаксис
C#
Visual Basic
private String errorMessage;
Private errorMessage As String
 Ссылки
 Teigha.DatabaseServices.FieldEvaluationStatusResult, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!