Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocArrayPolarParameters.GetItemCount
 Послать отзыв
 Метод позволяет получить текущее количество элементов в круговом массиве.
 Синтаксис
C#
Visual Basic
Копировать Код
public int GetItemCount( out String expression, out String evaluatorId );
Копировать Код
Public Function GetItemCount( ByRef expression As String, ByRef evaluatorId As String ) As Integer
 Параметры
 Параметры
 Описание
 expression
 Выражение для параметра. Тип String. Строка может быть пустой.
 evaluatorId
 Строковое представление идентификатора вычислителя. Тип String. Строка может быть пустой
 Возвращает
 Возвращает количество элементов в круговом массиве. Тип int.
 Описание
 Метод позволяет получить текущее количество элементов в круговом массиве.
 Если для параметра выражение отсутствует, то после выполнения метода строки expression и evaluatorId остаются пустыми.
 Ссылки
 Teigha.DatabaseServices.AssocArrayPolarParameters, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!