Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotSettingsValidator.SetZoomToPaperOnUpdate
 Послать отзыв
 Метод управляет настройкой «Масштабировать в размер листа бумаги при обновлении» для указанного объекта PlotSettings.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetZoomToPaperOnUpdate( ref PlotSettings plotSet, bool doZoom );
Копировать Код
Public Sub SetZoomToPaperOnUpdate( ByRef plotSet As PlotSettings, doZoom As Boolean )
 Параметры
 Параметры
 Описание
 plotSet
 Входной объект PlotSettings с настройками печати.
 doZoom
 Флаг масштабирования. Тип bool. Если данный флаг принимает значение true, должно применяться масштабирование.
 Описание
 Метод управляет настройкой «Масштабировать в размер листа бумаги при обновлении» для указанного объекта PlotSettings.
 Ссылки
 Teigha.DatabaseServices.PlotSettingsValidator, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!