Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DimAssoc.Post
 Послать отзыв
 Метод публикует данный объект DimAssoc в базе данных и устанавливает реактор между ним и соответствующим размером.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Post( DatabaseServices.ObjectId dimId, DatabaseServices.ObjectId dimAssocId );
Копировать Код
Public Sub Post( dimId As DatabaseServices.ObjectId, dimAssocId As DatabaseServices.ObjectId )
 Параметры
 Параметры
 Описание
 dimId
 Входной идентификатор объекта размера, который будет связан с данным объектом DimAssoc. Тип DatabaseServices.ObjectId.
 dimAssocId
 Получаемый идентификатор объекта DimAssoc после его добавления в базу данных. Тип DatabaseServices.ObjectId.
 Описание
 Метод публикует данный объект DimAssoc в базе данных и устанавливает реактор между ним и соответствующим размером.
 Ссылки
 Teigha.DatabaseServices.DimAssoc, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!