Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.ViewportScaleDefault
 Послать отзыв
 Синтаксис
C#
Visual Basic
public double ViewportScaleDefault;
Public Property ViewportScaleDefault() As Double
 Описание
 Обеспечивает доступ к значению по умолчанию масштаба видового экрана базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!