Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DwgFiler.ReadDouble
 Послать отзыв
 Метод предназначен для получения значения типа double из текущего элемента данного объекта Filer.
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract double ReadDouble();
Копировать Код
Public MustOverride Function ReadDouble() As Double
 Возвращает
 Возвращает значения типа double из текущего элемента данного объекта Filer.
 Описание
 Метод предназначен для получения значения типа double из текущего элемента данного объекта Filer.
 Ссылки
 Teigha.DatabaseServices.DwgFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!