Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.EllipticalArc2d.IsClockWise
 Послать отзыв
 Свойство IsClockWise представляет направление данной эллиптической дуги (по часовой стрелке или против).
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsClockWise;
Копировать Код
Public ReadOnly Property IsClockWise As Boolean
 Возвращает
 Возвращает true, если эллиптическая дуга имеет направление по часовой стрелке. В противном случае возвращает false.
 Описание
 Свойство IsClockWise представляет направление данной эллиптической дуги (по часовой стрелке или против).
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.EllipticalArc2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!