Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MTextFragment.Location
 Послать отзыв
 Свойство возвращает точку вставки текста.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d Location;
Копировать Код
Public ReadOnly Property Location As Point3d
 Возвращает
 Возвращает точку вставки текста. Тип Point3d.
 Описание
 Свойство возвращает точку вставки текста.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.MTextFragment, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!