Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CompoundObjectId.Equals
 Послать отзыв
 Метод предназначен для проверки совпадения объектов.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool Equals( ref Object obj );
Копировать Код
Public Function Equals( ByRef obj As Object ) As Boolean
 Параметры
 Параметры
 Описание
 obj
 Объект, который проверяется на совпадение. Тип Object.
 Возвращает
 Возвращает true, если объекты не являются нулевыми и совпадают. В противном случае возвращает false.
 Описание
 Метод предназначен для проверки входного объекта obj на совпадение с данным объектом.
 Замечания
 Переопределение методов Equals и GetHashCode должно выполняться согласованно с сохранением общей логики. Если Equals возвращает true, хеш-коды обязаны совпадать. Обратное не гарантируется - совпадение хэш-кодов не всегда означает совпадение объектов вследствие возможных коллизий. Хэш-коды должны формироваться с использованием полей, на которых основано равенство объектов.
 Ссылки
 Teigha.DatabaseServices.CompoundObjectId, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!