Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Transaction.Transaction
 Послать отзыв
 Конструктор.
 Синтаксис
C#
Visual Basic
Копировать Код
public Transaction( IntPtr unmanagedPointer, bool autoDelete );
Копировать Код
Public Sub New( unmanagedPointer As IntPtr, autoDelete As Boolean )
 Параметры
 Параметры
 Описание
 unmanagedPointer
 Неуправляемый указатель на исходный объект. Тип IntPtr.
 autoDelete
 Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.
 Описание
 Конструктор.
 Ссылки
 Teigha.DatabaseServices.Transaction, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!