Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Torus.Set
 Послать отзыв
 Метод позволяет переопределить у данного объекта точку центра, ось симметрии и оба радиуса.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Set( double majorRadius, double minorRadius, Point3d origin, Vector3d axisOfSymmetry );
Копировать Код
Public Sub Set( majorRadius As Double, minorRadius As Double, origin As Point3d, axisOfSymmetry As Vector3d )
 Параметры
 Параметры
 Описание
 majorRadius
 Большой радиус тора (радиус направляющей окружности тора). Тип double.
 minorRadius
 Малый радиус тора (радиус образующей окружности тора). Тип double.
 origin
 Точка центра тора (начало координат тора). Тип Point3d.
 axisOfSymmetry
 Ось симметрии тора (ось вращения тора). Тип Vector3d.
 Описание
 Метод позволяет переопределить у данного объекта точку центра, ось симметрии и оба радиуса.
 Ссылки
 Teigha.Geometry.Torus, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!