Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlaneSurface.PlaneSurface
 Послать отзыв
 Конструктор по умолчанию класса PlaneSurface.
 Синтаксис
C#
Visual Basic
Копировать Код
public PlaneSurface();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса PlaneSurface.
 Ссылки
 Teigha.DatabaseServices.PlaneSurface, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!