Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.RotatedDimension
 Послать отзыв
 Класс RotatedDimension представляет тип размера между двумя точками в пространстве, которые располагаются на линии, ориентированной под определенным углом к горизонту в плоскости размера (угол поворота).
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::GraphicsInterface::Drawable Teigha::DatabaseServices::DBObject Teigha::DatabaseServices::Entity Teigha::DatabaseServices::Dimension Teigha::DatabaseServices::RotatedDimension
 Синтаксис
C#
Visual Basic
Копировать Код
public class RotatedDimension : Dimension;
Копировать Код
Public Class RotatedDimension Inherits Dimension
 Описание
 Класс RotatedDimension представляет тип размера между двумя точками в пространстве, которые располагаются на линии, ориентированной под определенным углом к горизонту в плоскости размера (угол поворота).
 «Горизонтальный» размер представляет размер с углом поворота, равным углу между осью X OCS размера и осью X UCS, определяющей «горизонтальное» направление.
 «Вертикальный» размер — это размер с углом поворота, котрый на pi/2 рад (90 градусов) больше угла поворота «горизонтального» размера.
 Замечания
 При первом закрытии вновь созданного объекта размера автоматически создается анонимный блок (запись BlockTableRecord с префиксом имени блока *D, содержащая все используемые линии, дуги, сплошные стрелки, текст и т.д.), на который можно ссылаться для отображения размера на чертеже.
 Если положение размерного текста должно отличаться от положения по умолчанию (когда используется метод Dimension.UsingDefaultTextPosition) и значение системной переменной DIMFIT не равно 4, то положение размерного текста имеет приоритет над настройкой dimLine при размещении размерной линии так, чтобы линия совпадала с положением текста.
 Методы
 Конструкторы
 Teigha.GraphicsInterface.Drawable
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 Drawable
 Конструктор класса Teigha.GraphicsInterface.Drawable. (Унаследован от Drawable)
 Teigha.DatabaseServices.DBObject
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 DBObject
 Конструктор. (Унаследован от DBObject)
 Teigha.DatabaseServices.RotatedDimension
 Имя
 Описание
 RotatedDimension
 Это обзор перегрузок RotatedDimension.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.GraphicsInterface.Drawable
 Имя
 Описание
 Drawable Методы
 Ниже перечислены методы класса Drawable.
 Drawable Свойства
 Ниже перечислены свойства класса Drawable.
 Teigha.DatabaseServices.DBObject
 Имя
 Описание
 DBObject Методы
 Ниже перечислены методы класса DBObject.
 DBObject Свойства
 Ниже перечислены свойства класса DBObject.
 DBObject События
 Ниже перечислены события класса DBObject.
 Teigha.DatabaseServices.Entity
 Имя
 Описание
 Entity Методы
 Ниже перечислены методы класса Entity.
 Entity Свойства
 Ниже перечислены свойства класса Entity.
 Teigha.DatabaseServices.Dimension
 Имя
 Описание
 Dimension Методы
 Ниже перечислены методы класса Dimension.
 Dimension Свойства
 Ниже перечислены свойства класса Dimension.
 Teigha.DatabaseServices.RotatedDimension
 Имя
 Описание
 RotatedDimension Свойства
 Ниже перечислены свойства класса RotatedDimension.
 Ссылки
 RotatedDimension Конструктор, RotatedDimension Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства, DBObject События
 Ваши комментарии по поводу этого топика: Послать отзыв!