Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GraphNode.IsMarkedAs
 Послать отзыв
 Метод позволяет проверить, что все указанные битовые флаги в этом объекте GraphNode установлены.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsMarkedAs( int flag );
Копировать Код
Public Function IsMarkedAs( flag As Integer ) As Boolean
 Параметры
 Параметры
 Описание
 flag
 Битовые флаги. Тип int.
 Возвращает
 Возвращает true, только если в этом объекте GraphNode установлены все указанные битовые флаги. В противном случае возвращает false.
 Описание
 Метод позволяет проверить, что все указанные битовые флаги в этом объекте GraphNode установлены.
 Аргумент flag должен представлять собой комбинацию следующих битовых флагов:
 Имя бита
 Значение
 Описание
 kNone
 0x00
 Значение не задано.
 kVisited
 0x01
 Используется внутренним механизмом метода FindCycles() и в процессе обхода циклического графа.
 kOutsideRefed
 0x02
 Используется в процессе отключения внешних ссылок Xref.
 kSelected
 0x04
 Выделение пользователем. Устанавливается в методе GetOutgoing().
 kInList
 0x08
 Присутствует в списке. Устанавливается в методе GetOutgoing().
 kListAll
 0x0E
 Используется для очистки флагов kSelected, kInList, kOutsideRefed.
 kFirstLevel
 0x10
 Узел первого уровня, связан с корневым узлом графа. Только для чтения.
 kUnresTree
 0x20
 Дерево не разрешимо.
 kAll
 0x2F
 Используется для очистки всех флагов, кроме kFirstLevel.
 Ссылки
 Teigha.DatabaseServices.GraphNode, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!