Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Scale3d.Scale3d
 Послать отзыв
 Конструктор структуры Scale3d. Создает экземпляр структуры, который представляет равномерное преобразование масштаба вдоль осей X, Y и Z с указанным коэффициентом.
 Синтаксис
C#
Visual Basic
Копировать Код
public Scale3d( double factor );
Копировать Код
Public Sub New( factor As Double )
 Параметры
 Параметры
 Описание
 factor
 Масштабный множитель, одинаковый для всех трех осей. Тип double.
 Описание
 Конструктор структуры Scale3d. Создает экземпляр структуры, который представляет равномерное преобразование масштаба вдоль осей X, Y и Z с указанным коэффициентом factor.
 Ссылки
 Teigha.Geometry.Scale3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!