Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve3d.GetNormalPoint
 Послать отзыв
 Метод позволяет найти точку на кривой, в которой нормаль к кривой проходит через заданную точку в пределах указанного допуска.
 Синтаксис
C#
Visual Basic
Копировать Код
public PointOnCurve3d GetNormalPoint( Point3d point, Tolerance tolerance );
Копировать Код
Public Function GetNormalPoint( point As Point3d, tolerance As Tolerance ) As PointOnCurve3d
 Параметры
 Параметры
 Описание
 point
 Точка в пространстве, через которую должна пройти нормаль к кривой. Тип Point3d.
 tolerance
 Точность вычислений. Тип Tolerance.
 Возвращает
 Возвращает точку на кривой. Тип PointOnCurve3d.
 Описание
 Метод позволяет найти точку на кривой, в которой нормаль к кривой проходит через заданную точку в пределах указанного допуска.
 Возвращаемая точка лежит в плоскости, которая проходит через точку на кривой и перпендикулярна касательной к кривой в этой точке. Кривая не обязана быть плоской. Если кривая плоская, переданная в метод точка не обязана лежать в плоскости кривой.
 В случае, если условию удовлетворяют несколько точек на кривой, метод вернет точку, ближайшую к заданной.
 Ссылки
 Teigha.Geometry.Curve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!