Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Light.PhysicalIntensity
 Послать отзыв
 Свойство представляет физическую интенсивность источника света.
 Синтаксис
C#
Visual Basic
Копировать Код
public double PhysicalIntensity;
Копировать Код
Public Property PhysicalIntensity As Double
 Возвращает
 Возвращает физическую интенсивность источника света. Тип double.
 Описание
 Свойство представляет физическую интенсивность источника света. Используемые единицы измерения зависят от выбора метода расчета физической интенсивности, заданного в свойстве Light.PhysicalIntensityMethod (т.е. кандела для PeakIntensity, люмен для Flux и люкс для Illuminance).
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Light, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!