Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SweepOptionsCheckSweepCurveOut.Point
 Послать отзыв
 Свойство Point представляет точку на вытягиваемом объекте, если он плоский, или точку на линии, если объект линейный.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d Point;
Копировать Код
Public ReadOnly Property Point As Point3d
 Возвращает
 Возвращает точку на вытягиваемом объекте. Тип Point3d.
 Описание
 Свойство Point представляет точку на вытягиваемом объекте, если он плоский (Planarity.Planar), или точку на линии, если объект линейный (Planarity.Linear).
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.SweepOptionsCheckSweepCurveOut, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!