Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Matrix2d.IsUniscaledOrtho
 Послать отзыв
 Метод позволяет проверить, являются ли векторы в линейной части матрицы равными по длине и перпендикулярными друг другу.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsUniscaledOrtho();
Копировать Код
Public Function IsUniscaledOrtho() As Boolean
 Возвращает
 Возвращает true, если в пределах используемой точности векторы в линейной части матрицы можно считать равными по длине и перпендикулярными друг другу. В противном случае возвращает false.
 Описание
 Метод позволяет проверить, являются ли векторы в линейной части матрицы равными по длине и перпендикулярными друг другу. Используется вызов метода Matrix2d.IsUniscaledOrtho(Tolerance tolerance) с точностью по умолчанию, равной Tolerance.Global.
 Ссылки
 Teigha.Geometry.Matrix2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!