Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Point2d.MultiplyBy
 Послать отзыв
 Метод умножает координаты данной точки на заданное значение.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point2d MultiplyBy( double value );
Копировать Код
Public Function MultiplyBy( value As Double ) As Point2d
 Параметры
 Параметры
 Описание
 value
 Входной множитель. Тип double.
 Возвращает
 Возвращает 2D-точку, координаты которой получены умножением координат этой точки на значение value. Тип Point2d.
 Описание
 Метод возвращает 2D-точку, координаты которой получены умножением координат этой точки на значение value.
 Ссылки
 Teigha.Geometry.Point2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!