Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.ExternalSurface.IsEllipCylinder
 Послать отзыв
 Свойство IsEllipCylinder позволяет проверить, является ли данная внешняя поверхность эллиптическим цилиндром.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsEllipCylinder;
Копировать Код
Public ReadOnly Property IsEllipCylinder As Boolean
 Возвращает
 Возвращает true, если данная внешняя поверхность является эллиптическим цилиндром. В противном случае возвращает false.
 Описание
 Свойство IsEllipCylinder определяет тип данной внешней поверхности и возвращает true, если она является эллиптическим цилиндром.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.ExternalSurface, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!