Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DwgFiler.ReadString
 Послать отзыв
 Метод предназначен для получения текстовой строки из текущего элемента данного объекта Filer.
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract String ReadString();
Копировать Код
Public MustOverride Function ReadString() As String
 Возвращает
 Возвращает строку. Тип String.
 Описание
 Метод предназначен для получения текстовой строки из текущего элемента данного объекта Filer.
 Ссылки
 Teigha.DatabaseServices.DwgFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!