Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.PlanarEquationCoefficients.PlanarEquationCoefficients
 Послать отзыв
 Конструктор структуры PlanarEquationCoefficients. Создает экземпляр структуры с указанными параметрами.
 Синтаксис
C#
Visual Basic
Копировать Код
public PlanarEquationCoefficients( double a, double b, double c, double d );
Копировать Код
Public Sub New( a As Double, b As Double, c As Double, d As Double )
 Параметры
 Параметры
 Описание
 a
 Коэффициент a в общем уравнении плоскости. Тип double.
 b
 Коэффициент b в общем уравнении плоскости. Тип double.
 c
 Коэффициент c в общем уравнении плоскости. Тип double.
 d
 Коэффициент d в общем уравнении плоскости. Тип double.
 Описание
 Конструктор структуры PlanarEquationCoefficients. Создает экземпляр структуры с указанными параметрами.
 Ссылки
 Teigha.Geometry.PlanarEquationCoefficients, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!