Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MTextFragment.StackTop
 Послать отзыв
 Свойство позволяет проверить, представляет ли данный фрагмент числитель дробного текста.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool StackTop;
Копировать Код
Public ReadOnly Property StackTop As Boolean
 Возвращает
 Возвращает true, если данный фрагмент представляет числитель дробного текста. В противном случае возвращает false.
 Описание
 Свойство позволяет проверить, представляет ли данный фрагмент числитель дробного текста.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.MTextFragment, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!