Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Transaction.TransactionManager
 Послать отзыв
 Свойство предоставляет доступ к менеджеру транзакций, с которым связана данная транзакция.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual DatabaseServices.TransactionManager TransactionManager;
Копировать Код
Public virtual Property TransactionManager() As DatabaseServices.TransactionManager
 Возвращает
 Возвращает объект DatabaseServices.TransactionManager.
 Описание
 Свойство предоставляет доступ к менеджеру транзакций, с которым связана данная транзакция.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Transaction, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!