Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство TableRegion.FirstRow
 Послать отзыв
 This is FirstRow, a member of class TableRegion.
 Синтаксис
C#
Visual Basic
public int FirstRow;
Public Property FirstRow() As Integer
 Ссылки
 TableRegion Класс, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!