Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.OffsetSurface.OffsetSurface
 Послать отзыв
 Конструктор по умолчанию класса OffsetSurface. Создает новый объект без каких-либо реальных данных (нулевой указатель базовой поверхности и нулевое смещение).
 Синтаксис
C#
Visual Basic
Копировать Код
public OffsetSurface();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса OffsetSurface. Инициализирует указатель базовой поверхности значением NULL, а расстояние смещения — значением 0.0.
 Ссылки
 Teigha.Geometry.OffsetSurface, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!