Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PolyFaceMesh
 Послать отзыв
 Класс PolyFaceMesh представляет специальный тип полилинии PolyFaceMesh в nanoCAD.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::GraphicsInterface::Drawable Teigha::DatabaseServices::DBObject Teigha::DatabaseServices::Entity Teigha::DatabaseServices::PolyFaceMesh
 Синтаксис
C#
Visual Basic
Копировать Код
public class PolyFaceMesh : Entity, System.Collections.IEnumerable;
Копировать Код
Public Class PolyFaceMesh Inherits Entity Inherits System.Collections.IEnumerable
 Описание
 Класс PolyFaceMesh представляет специальный тип полилинии PolyFaceMesh в nanoCAD.
 Замечания
 Объект PolyFaceMesh состоит из списка вершин PolyFaceMeshVertex (координаты вершин) и записей FaceRecord, которые в совокупности определяют множество 3D-граней. Точки вершин идут в списке первыми, за ними следуют все записи FaceRecord.
 Предупреждение
 Никогда не используйте наследование от этого класса. В противном случае ваше приложение приведет к аварийному завершению приложения nanoCAD.
 Методы
 Конструкторы
 Teigha.GraphicsInterface.Drawable
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 Drawable
 Конструктор класса Teigha.GraphicsInterface.Drawable. (Унаследован от Drawable)
 Teigha.DatabaseServices.DBObject
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 DBObject
 Конструктор. (Унаследован от DBObject)
 Teigha.DatabaseServices.PolyFaceMesh
 Имя
 Описание
 PolyFaceMesh
 Конструктор по умолчанию. Инициализирует счетчики граней и вершин нулями.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.GraphicsInterface.Drawable
 Имя
 Описание
 Drawable Методы
 Ниже перечислены методы класса Drawable.
 Drawable Свойства
 Ниже перечислены свойства класса Drawable.
 Teigha.DatabaseServices.DBObject
 Имя
 Описание
 DBObject Методы
 Ниже перечислены методы класса DBObject.
 DBObject Свойства
 Ниже перечислены свойства класса DBObject.
 DBObject События
 Ниже перечислены события класса DBObject.
 Teigha.DatabaseServices.Entity
 Имя
 Описание
 Entity Методы
 Ниже перечислены методы класса Entity.
 Entity Свойства
 Ниже перечислены свойства класса Entity.
 Teigha.DatabaseServices.PolyFaceMesh
 Имя
 Описание
 PolyFaceMesh Методы
 Ниже перечислены методы класса PolyFaceMesh.
 PolyFaceMesh Свойства
 Ниже перечислены свойства класса PolyFaceMesh.
 Ссылки
 PolyFaceMesh Методы, PolyFaceMesh Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства, DBObject События
 Ваши комментарии по поводу этого топика: Послать отзыв!