Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.UnderlayLayerCollection.Item
 Послать отзыв
 Свойство Item представляет слой подложки с указанным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public UnderlayLayer this[int index];
Копировать Код
Default Public Property Item( index As Integer ) As UnderlayLayer
 Параметры
 Параметры
 Описание
 index
 Индекс искомого слоя подложки. Тип int.
 Возвращает
 Возвращает слой подложки с индексом index. Тип UnderlayLayer.
 Описание
 Свойство Item представляет слой подложки, хранящийся в данной коллекции под указанным индексом.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.UnderlayLayerCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!