Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Solid3d.CreateWedge
 Послать отзыв
 Метод создает трехмерный твердотельный клин, выровненный по осям мировой системы координат (WCS).
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void CreateWedge( double lengthAlongX, double lengthAlongY, double lengthAlongZ );
Копировать Код
Public Overridable Sub CreateWedge( lengthAlongX As Double, lengthAlongY As Double, lengthAlongZ As Double )
 Параметры
 Параметры
 Описание
 lengthAlongX
 Размер тела в направлении оси x (WCS). Тип double.
 lengthAlongY
 Размер тела в направлении оси y (WCS). Тип double.
 lengthAlongZ
 Размер тела в направлении оси z (WCS). Тип double.
 Описание
 Метод создает трехмерный твердотельный клин, выровненный по осям мировой системы координат (WCS). Направление сужения клина совпадает с положительным направление оси x.
 Наклонная грань определяется точками:
 ( lengthAlongX/2, -lengthAlongY/2, -lengthAlongZ/2) (-lengthAlongX/2, -lengthAlongY/2, lengthAlongZ/2) ( lengthAlongX/2, lengthAlongY/2, -lengthAlongZ/2) (-lengthAlongX/2, lengthAlongY/2, lengthAlongZ/2)
 Действуют следующие размерные ограничения:
lengthAlongX >= 1e-6;
lengthAlongY >= 1e-6;
lengthAlongZ >= 1e-6.
 Ссылки
 Teigha.DatabaseServices.Solid3d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!