Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Database.StartUndoRecord
 Послать отзыв
 This is StartUndoRecord, a member of class Database.
 Синтаксис
C#
Visual Basic
public void StartUndoRecord();
Public Sub StartUndoRecord()
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!