Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LayerStateRenameEventArgs.NewName
 Послать отзыв
 Свойство NewName представляет новое имя слоя.
 Синтаксис
C#
Visual Basic
Копировать Код
public String NewName;
Копировать Код
Public ReadOnly Property NewName As String
 Возвращает
 Возвращает новое имя слоя. Тип String.
 Описание
 Свойство NewName представляет новое имя слоя.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.LayerStateRenameEventArgs, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!