Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.TableStyle.SetTextHeight
 Послать отзыв
 Метод позволяет задать высоту текста для строк указанного типа.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetTextHeight( double height, int rowTypes );
Копировать Код
Public Overridable Sub SetTextHeight( height As Double, rowTypes As Integer )
 Параметры
 Параметры
 Описание
 height
 Высота текста. Тип double.
 rowTypes
 Тип строки таблицы (или логическая комбинация нескольких типов). Тип int. См. перечисление RowType.
 Описание
 Метод позволяет задать высоту текста для строк указанного типа. Допускаются комбинации различных типов строк с использованием логического оператора OR.
 Ссылки
 Teigha.DatabaseServices.TableStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!