Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SectionSettings.SetHatchPatternName
 Послать отзыв
 Метод позволяет задать имя образцу штриховки геометрии сечения указанного типа.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetHatchPatternName( SectionType nSecType, SectionGeometry nGeometry, ref String sNewName );
Копировать Код
Public Sub SetHatchPatternName( nSecType As SectionType, nGeometry As SectionGeometry, ByRef sNewName As String )
 Параметры
 Параметры
 Описание
 nSecType
 Тип сечения. Перечисление SectionType.
 nGeometry
 Типы элементов геометрии сечения. Перечисление SectionGeometry.
 sNewName
 Имя образца штриховки. Тип String.
 Описание
 Метод позволяет задать имя образцу штриховки геометрии сечения указанного типа.
 Ссылки
 Teigha.DatabaseServices.SectionSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!