Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeaderStyle.TextAttachmentDirection
 Послать отзыв
 Свойство представляет ориентацию полки выносных линий, предусмотренную данным стилем.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.TextAttachmentDirection TextAttachmentDirection;
Копировать Код
Public Property TextAttachmentDirection As DatabaseServices.TextAttachmentDirection
 Возвращает
 Возвращает ориентацию полки выносной линии. Значение из перечисления DatabaseServices.TextAttachmentDirection.
 Описание
 Свойство представляет ориентацию полки выносных линий, предусмотренную данным стилем.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MLeaderStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!