Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Matrix3dBuilder.Matrix3dBuilder
 Послать отзыв
 Конструктор по умолчанию класса Matrix3dBuilder.
 Синтаксис
C#
Visual Basic
Копировать Код
public Matrix3dBuilder();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса Matrix3dBuilder.
 Ссылки
 Teigha.Geometry.Matrix3dBuilder, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!