Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Group.SetLinetype
 Послать отзыв
 Метод позволяет задать иной тип линий для всех объектов в этой группе.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetLinetype( DatabaseServices.ObjectId value );
Копировать Код
Public Sub SetLinetype( value As DatabaseServices.ObjectId )
 Параметры
 Параметры
 Описание
 value
 Идентификатор типа линий LinetypeTableRecord. Тип DatabaseServices.ObjectId.
 Описание
 Метод позволяет назначить всем объектам этой группы тип линий LinetypeTableRecord с указанным идентификатором ObjectId.
 Ссылки
 Teigha.DatabaseServices.Group, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!