Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector2dCollection
 Послать отзыв
 Класс Vector2dCollection представляет коллекцию двумерных векторов.
 Иерархия классов
Teigha::Geometry::Vector2dCollection
 Синтаксис
C#
Visual Basic
Копировать Код
[DefaultMember("Item")] [Wrapper("OdGeVector2dArray")] public sealed class Vector2dCollection : IList
Копировать Код
<DefaultMember("Item")> <Wrapper("OdGeVector2dArray")> Public NotInheritable Class Vector2dCollection Implements IList
 Описание
 Класс Vector2dCollection представляет коллекцию объектов Vector2d.
 Методы
 Конструкторы
 Имя
 Описание
 Vector2dCollection
 Это обзор перегрузок Vector2dCollection.
 Топики
 Имя
 Описание
 Vector2dCollection Данные
 Ниже перечислены данные класса Vector2dCollection.
 Vector2dCollection Методы
 Ниже перечислены методы класса Vector2dCollection.
 Vector2dCollection Свойства
 Ниже перечислены свойства класса Vector2dCollection.
 Ссылки
 Vector2dCollection Конструктор, Vector2dCollection Данные, Vector2dCollection Методы, Vector2dCollection Свойства, Методы, Топики, Vector2dCollection Данные, Vector2dCollection Методы, Vector2dCollection Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!