Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SequenceEnd.SequenceEnd
 Послать отзыв
 Конструктор по умолчанию класса SequenceEnd.
 Синтаксис
C#
Visual Basic
Копировать Код
public SequenceEnd();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса SequenceEnd.
 Ссылки
 Teigha.DatabaseServices.SequenceEnd, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!