Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AttributeDefinition.Prompt
 Послать отзыв
 Свойство позволяет получить или задать строку подсказки данного объекта AttributeDefinition.
 Синтаксис
C#
Visual Basic
Копировать Код
public String Prompt;
Копировать Код
Public Property Prompt() As String
 Возвращает
 Возвращает строку подсказки. Тип String.
 Описание
 Свойство позволяет получить или задать строку подсказки данного объекта AttributeDefinition.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.AttributeDefinition, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!