Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Assoc2dConstraintGroup
 Послать отзыв
 Класс Assoc2dConstraintGroup представляет совокупность геометрических и размерных зависимостей между подобъектами геометрических объектов. Все связанные элементы геометрии должны лежать в одной плоскости.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::GraphicsInterface::Drawable Teigha::DatabaseServices::DBObject Teigha::DatabaseServices::AssocAction Teigha::DatabaseServices::Assoc2dConstraintGroup
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("AcDbAssoc2dConstraintGroup")] public class Assoc2dConstraintGroup : AssocAction;
Копировать Код
<Wrapper("AcDbAssoc2dConstraintGroup")> Public Class Assoc2dConstraintGroup Inherits AssocAction
 Описание
 Класс Assoc2dConstraintGroup представляет совокупность геометрических и размерных зависимостей, связывающих между собой подобъекты геометрических объектов. Все участвующие элементы геометрии должны лежать в одной плоскости.
 Объект Assoc2dConstraintGroup владеет ограничениями, производными от класса GeometricalConstraint, и «прокси»-объектами участвующей в ограничениях геометрии, которые унаследованы от класса ConstrainedGeometry. Экземпляры класса ConstrainedGeometry часто представляют подобъекты геометрических объектов, а объект Assoc2dConstraintGroup владеет экземплярами класса AssocGeomDepedency, которые представляют в этих объектах геометрические зависимости. Он также владеет экземплярами AssocValueDependency в объектах AssocVariables, которые представляют текущие значения размеров в размерных ограничениях (они описываются классами, производными от ExplicitConstraint).
 Если размерное ограничение имеет графическое представление, например, в виде объекта Dimension, то объект ExplicitConstraint владеет также объектом AssocDependency, который в свою очередь владеет объектом, производным от AssocDimDependencyBody. Последний обеспечивает взаимодействие между объектом ExplicitConstraint, объектом AssocVariable, который сохраняет значение размерного ограничения, и объектом Dimension (или другим объектом), который отвечает за графическое представление размерного ограничения.
 Метод evaluate() принимает текущие свойства участвующей геометрии и текущие значения переменных, на которые ссылаются объекты ExplicitConstraint. Затем он вызывает решатель ограничений, который находит такие новые положения и формы связанной зависимостями геометрии, чтобы удовлетворялись наложенные ограничения. После этого задействованная геометрия обновляется, отражая новые положения и формы. Вызов метода evaluate() может завершиться неудачей, если ему не удастся найти решение, удовлетворяющее всем наложенным ограничениям.
 Методы
 Конструкторы
 Teigha.GraphicsInterface.Drawable
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 Drawable
 Конструктор класса Teigha.GraphicsInterface.Drawable. (Унаследован от Drawable)
 Teigha.DatabaseServices.DBObject
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 DBObject
 Конструктор. (Унаследован от DBObject)
 Teigha.DatabaseServices.AssocAction
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 AssocAction
 Конструктор по умолчанию. (Унаследован от AssocAction)
 Teigha.DatabaseServices.Assoc2dConstraintGroup
 Имя
 Описание
 Assoc2dConstraintGroup
 Конструктор по умолчанию.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.GraphicsInterface.Drawable
 Имя
 Описание
 Drawable Методы
 Ниже перечислены методы класса Drawable.
 Drawable Свойства
 Ниже перечислены свойства класса Drawable.
 Teigha.DatabaseServices.DBObject
 Имя
 Описание
 DBObject Методы
 Ниже перечислены методы класса DBObject.
 DBObject Свойства
 Ниже перечислены свойства класса DBObject.
 DBObject События
 Ниже перечислены события класса DBObject.
 Teigha.DatabaseServices.AssocAction
 Имя
 Описание
 AssocAction Методы
 Ниже перечислены методы класса AssocAction.
 AssocAction Свойства
 Ниже перечислены свойства класса AssocAction.
 Teigha.DatabaseServices.Assoc2dConstraintGroup
 Имя
 Описание
 Assoc2dConstraintGroup Методы
 Ниже перечислены методы класса Assoc2dConstraintGroup.
 Assoc2dConstraintGroup Свойства
 Ниже перечислены свойства класса Assoc2dConstraintGroup.
 Ссылки
 Assoc2dConstraintGroup Методы, Assoc2dConstraintGroup Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства, DBObject События
 Ваши комментарии по поводу этого топика: Послать отзыв!