Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.Direction
 Послать отзыв
 Данное свойство предоставляет доступ к единичному вектору горизонтального направления данной таблицы
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d Direction;
Копировать Код
Public Property Direction() As Vector3d
 Возвращает
 Возвращает единичный вектор горизонтального направления таблицы. Тип Vector3d.
 Описание
 Данное свойство предоставляет доступ к единичному вектору горизонтального направления данной таблицы. Направление задается вектором Vector3d в мировой системе координат (WCS).
 Условия
 Чтение и запись.
 Returns the direction that the table follows from its start to its finish. Possible values for FlowDirection are TopToBottom (top to bottom) and BottomToTop (bottom to top).
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!