Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.OffsetCurve3d.OffsetDistance
 Послать отзыв
 Свойство OffsetDistance представляет расстояние со знаком, которое определяет текущее смещение данной кривой относительно её базовой кривой.
 Синтаксис
C#
Visual Basic
Копировать Код
public double OffsetDistance;
Копировать Код
Public Property OffsetDistance As Double
 Возвращает
 Возвращает величину смещения со знаком. Тип double.
 Описание
 Свойство OffsetDistance представляет расстояние со знаком, которое определяет текущее смещение данной кривой относительно её базовой кривой.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.Geometry.OffsetCurve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!