Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve2d.GetSplitCurves
 Послать отзыв
 Метод позволяет получить два сегмента этой кривой, делящие данную кривую в точке с указанным значением параметра.
 Синтаксис
C#
Visual Basic
Копировать Код
public Curve2d[] GetSplitCurves( double value );
Копировать Код
Public Function GetSplitCurves( value As Double ) As Curve2d()
 Параметры
 Параметры
 Описание
 value
 Входное значение параметра для точки разделения кривой на два сегмента. Тип double.
 Возвращает
 Возвращает массив из двух кривых, полученных разбиением данной кривой в заданной точке. Тип Curve2d[].
 Описание
 Метод позволяет получить два сегмента этой кривой, делящие данную кривую в точке с указанным значением параметра.
 Ссылки
 Teigha.Geometry.Curve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!