Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Database.SaveAs (String^, DwgVersion)
 Послать отзыв
 Синтаксис
C#
Visual Basic
public void SaveAs(ref String fileName, DwgVersion version);
Public Sub SaveAs(ByRef fileName As String, version As DwgVersion)
 Параметры
 Параметры
 Описание
 fileName
 Имя файла или URL, куда записывается информация базы данных
 version
 Версия формата .dwg, в которой сохраняется файл
 Описание
 Запускает процесс сохранения в базе данных и записывает информацию чертежа в файл, указанный в fileName. Аргумент fileName берется так, как он есть. Если расширения файла нет, .dwg не подставляется.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!