Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.RevolvedSurface.RevolveAngle
 Послать отзыв
 Свойство RevolveAngle представляет угол поворота данного объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public double RevolveAngle;
Копировать Код
Public Property RevolveAngle As Double
 Возвращает
 Возвращает угол поворота для данной поверхности. Тип double.
 Описание
 Свойство RevolveAngle представляет угол поворота данного объекта (в радианах). Положительное направление отсчета углов - против часовой стрелки, если смотреть навстречу направляющему вектору оси вращения.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.RevolvedSurface, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!