Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.PlanarEntity.IntersectWith
 Послать отзыв
 Метод вычисляет точку пересечения данной плоской поверхности с указанной линией с использованием точности по умолчанию.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d[] IntersectWith( ref LinearEntity3d linearEntity );
Копировать Код
Public Function IntersectWith( ByRef linearEntity As LinearEntity3d ) As Point3d()
 Параметры
 Параметры
 Описание
 linearEntity
 Входной линейный объект. Тип LinearEntity3d.
 Возвращает
 Возвращает массив, в котором содержится единственная точка пересечения (если она существует). Тип Point3d[].
 Описание
 Метод вычисляет точку пересечения данной плоской поверхности с линейным объектом linearEntity.
 Используется метод PlanarEntity.Point3d[] IntersectWith(ref LinearEntity3d linearEntity, Tolerance tolerance) с точностью, равной Tolerance.Global.
 Ссылки
 Teigha.Geometry.PlanarEntity, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!