Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObject.MergeStyle
 Послать отзыв
 Свойство позволяет установить нужный стиль слияния словарей.
 Синтаксис
C#
Visual Basic
Копировать Код
public DuplicateRecordCloning MergeStyle;
Копировать Код
Public Property MergeStyle() As DuplicateRecordCloning
 Возвращает
 Возвращает установленный стиль слияния. Тип данных DuplicateRecordCloning
 Описание
 Свойство обеспечивает доступ к настройке стиля слияния словарей.
 Условия
 Чтение и запись
 Ссылки
 Teigha.DatabaseServices.DBDictionary, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!