Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AttachmentPoint
 Послать отзыв
 Данное перечисление определяет положения точки присоединения текстового объекта MText.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum AttachmentPoint { BaseAlign = 13, BaseCenter = 11, BaseFit = 17, BaseLeft = 10, BaseMid = 21, BaseRight = 12, BottomAlign = 14, BottomCenter = 8, BottomFit = 18, BottomLeft = 7, BottomMid = 22, BottomRight = 9, MiddleAlign = 15, MiddleCenter = 5, MiddleFit = 19, MiddleLeft = 4, MiddleMid = 23, MiddleRight = 6, TopAlign = 16, TopCenter = 2, TopFit = 20, TopLeft = 1, TopMid = 24, TopRight = 3 }
Копировать Код
Public Enum AttachmentPoint BaseAlign = 13 BaseCenter = 11 BaseFit = 17 BaseLeft = 10 BaseMid = 21 BaseRight = 12 BottomAlign = 14 BottomCenter = 8 BottomFit = 18 BottomLeft = 7 BottomMid = 22 BottomRight = 9 MiddleAlign = 15 MiddleCenter = 5 MiddleFit = 19 MiddleLeft = 4 MiddleMid = 23 MiddleRight = 6 TopAlign = 16 TopCenter = 2 TopFit = 20 TopLeft = 1 TopMid = 24 TopRight = 3 End Enum
 Члены
 Члены
 Описание
 BaseAlign
 Значение: 13. Выравнивание относительно базовой линии. Зарезервировано для использования в будущих версиях.
 BaseCenter
 Значение: 11. Выравнивание по центру относительно базовой линии. Зарезервировано для использования в будущих версиях.
 BaseFit
 Значение: 17. Выравнивание по ширине относительно базовой линии. Зарезервировано для использования в будущих версиях.
 BaseLeft
 Значение: 10. Выравнивание по левому краю базовой линии. Зарезервировано для использования в будущих версиях.
 BaseMid
 Значение: 21. Выравнивание посередине базовой линии. Зарезервировано для использования в будущих версиях.
 BaseRight
 Значение: 12. Выравнивание по правому краю базовой линии. Зарезервировано для использования в будущих версиях.
 BottomAlign
 Значение: 14. Выравнивание относительно нижней точки текста. Зарезервировано для использования в будущих версиях.
 BottomCenter
 Значение: 8. Выравнивание по центру относительно нижней точки текста.
 BottomFit
 Значение: 18. Выравнивание по ширине относительно нижней точки текста. Зарезервировано для использования в будущих версиях.
 BottomLeft
 Значение: 7. Выравнивание по левому краю относительно нижней точки текста.
 BottomMid
 Значение: 22. Выравнивание посередине внизу относительно нижней точки текста. Зарезервировано для использования в будущих версиях.
 BottomRight
 Значение: 9. Выравнивание по правому краю относительно нижней точки текста.
 MiddleAlign
 Значение: 15. Выравнивание относительно средней точки текста. Зарезервировано для использования в будущих версиях.
 MiddleCenter
 Значение: 5. Выравнивание по центру относительно средней точки текста.
 MiddleFit
 Значение: 19. Выравнивание по ширине относительно средней точки текста. Зарезервировано для использования в будущих версиях.
 MiddleLeft
 Значение: 4. Выравнивание по левому краю относительно средней точки текста.
 MiddleMid
 Значение: 23. Выравнивание посередине относительно средней точки текста. Зарезервировано для использования в будущих версиях.
 MiddleRight
 Значение: 6. Выравнивание по правому краю относительно средней точки текста.
 TopAlign
 Значение: 16. Выравнивание относительно верхней части текста. Зарезервировано для использования в будущих версиях.
 TopCenter
 Значение: 2. Выравнивание по центру относительно верхней части текста.
 TopFit
 Значение: 20. Выравнивание по ширине относительно верхней части текста. Зарезервировано для использования в будущих версиях.
 TopLeft
 Значение: 1. Выравнивание по левому краю относительно верхней части текста
 TopMid
 Значение: 24. Выравнивание посередине относительно верхней части текста. Зарезервировано для использования в будущих версиях.
 TopRight
 Значение: 3. Выравнивание по правому краю относительно верхней части текста
 Описание
 Данное перечисление определяет положения точки присоединения текстового объекта MText.
 Ваши комментарии по поводу этого топика: Послать отзыв!