Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Filters.FilteredBlockIterator.Accepts
 Послать отзыв
 Метод предоставляет возможность проверить, проходит ли указанный объект запрос объекта Filter.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool Accepts( ObjectId id );
Копировать Код
Public Function Accepts( id As ObjectId ) As Boolean
 Параметры
 Параметры
 Описание
 id
 Входной идентификатор проверяемого объекта. Тип ObjectId.
 Возвращает
 Возвращает true тогда и только тогда, когда указанный объект удовлетворяет запросу. В противном случае возвращает false.
 Описание
 Метод предоставляет возможность проверить, проходит ли указанный объект запрос объекта Filter.
 Ссылки
 Teigha.DatabaseServices.Filters.FilteredBlockIterator, Teigha.DatabaseServices.Filters
 Ваши комментарии по поводу этого топика: Послать отзыв!