Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Interval.Interval
 Послать отзыв
 Конструктор класса Interval. Создает экземпляр класса, являющийся копией указанного интервала.
 Синтаксис
C#
Visual Basic
Копировать Код
public Interval( ref Interval other );
Копировать Код
Public Sub New( ByRef other As Interval )
 Параметры
 Параметры
 Описание
 other
 Входной интервал, копию которого требуется создать. Тип Interval.
 Описание
 Конструктор класса Interval. Создает экземпляр класса, являющийся копией указанного интервала.
 Ссылки
 Teigha.Geometry.Interval, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!