Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DatabaseSummaryInfoBuilder.CustomPropertyTable
 Послать отзыв
 Свойство обеспечивает доступ к таблице пользовательских свойств.
 Синтаксис
C#
Visual Basic
Копировать Код
public System.Collections.IDictionary CustomPropertyTable;
Копировать Код
Public Property CustomPropertyTable() As System.Collections.IDictionary
 Возвращает
 Возвращает словарь типа System.Collections.IDictionary.
 Описание
 Свойство обеспечивает доступ к таблице пользовательских свойств.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.DatabaseSummaryInfoBuilder, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!