Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Scale2d.*
 Послать отзыв
 Оператор умножения структуры Scale2d. Реализует векторное умножение двух векторов масштабирования.
 Синтаксис
C#
Visual Basic
Копировать Код
public static Scale2d Scale2d *( Scale2d a, Scale2d b );
Копировать Код
Public Shared Operator *( a As Scale2d, b As Scale2d ) As Scale2d
 Параметры
 Параметры
 Описание
 a
 Левый операнд. Тип Scale2d.
 b
 Правый операнд. Тип Scale2d.
 Возвращает
 Возвращает результат умножения (a * b) двух операндов a и b. Тип Scale2d.
 Описание
 Оператор умножения структуры Scale2d. Реализует умножение (a * b) двух векторов масштабирования a и b.
 Ссылки
 Teigha.Geometry.Scale2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!