Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CurveCurveIntersector2d.GetIntersectionPoint
 Послать отзыв
 Метод предоставляет 2D-точку пересечения с указанным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point2d GetIntersectionPoint( int number );
Копировать Код
Public Function GetIntersectionPoint( number As Integer ) As Point2d
 Параметры
 Параметры
 Описание
 number
 Порядковый индекс искомой точки пересечения. Тип int.
 Возвращает
 Возвращает 2D-точку пересечения с индексом number. Тип Point2d.
 Описание
 Метод предоставляет 2D-точку пересечения с указанным индексом.
 Ссылки
 Teigha.Geometry.CurveCurveIntersector2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!