Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CellContent.Overrides
 Послать отзыв
 Свойство Overrides предоставляет доступ к типу переопределения содержимого ячейки таблицы.
 Синтаксис
C#
Visual Basic
Копировать Код
public CellProperties Overrides;
Копировать Код
Public Property [Overrides] As CellProperties
 Возвращает
 Возвращает тип переопределенияе содержимого ячейки таблицы. Перечисление CellProperties.
 Описание
 Свойство Overrides предоставляет доступ к типу переопределения содержимого ячейки таблицы.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.CellContent, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!