Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LineAngularDimension2.LineAngularDimension2
 Послать отзыв
 Конструктор по умолчанию класса LineAngularDimension2.
 Синтаксис
C#
Visual Basic
Копировать Код
public LineAngularDimension2();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса LineAngularDimension2. Создает объект углового размера с центром дуги и начальными точками обеих выносных линий в координатах (0,0,0).
 Ссылки
 Teigha.DatabaseServices.LineAngularDimension2, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!