Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Entity.SetPropertiesFrom(Entity)
 Послать отзыв
 Метод копирует значения таких свойств, как цвет, слой, тип линии, масштаб линии и видимость, из указанного геометрического объекта entityPointer в текущий объект. Этот метод позволяет быстро передать графические параметры от одного объекта к другому.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetPropertiesFrom(Entity entityPointer);
Копировать Код
Public Sub SetPropertiesFrom(entityPointer As Entity)
 Параметры
 Параметры
 Описание
 entityPointer
 Геометрический объект, из которого копируются свойства. Тип Entity
 Описание
 Этот метод копирует
Color (цвет);
Layer (слой);
Linetype (тип линий);
Linetype scale (масштаб типа линий);
Visibility (видимость).
 значения из геометрического объекта entityPointer в данный объект.
 Ссылки
 Teigha.DatabaseServices.Entity, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!