Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FieldEvaluationStatusResult
 Послать отзыв
 Этот класс предназначен для хранения кодов, представляющих результаты вычисления поля.
 Иерархия классов
Teigha::DatabaseServices::FieldEvaluationStatusResult
 Синтаксис
C#
Visual Basic
Копировать Код
[StructLayout(LayoutKind.Sequential)] public class FieldEvaluationStatusResult;
Копировать Код
<StructLayout(LayoutKind.Sequential)> Public Class FieldEvaluationStatusResult
 Описание
 Этот класс предназначен для хранения кодов, представляющих результаты вычисления поля.
 Методы
 Конструкторы
 Имя
 Описание
 FieldEvaluationStatusResult
 Конструктор класса FieldEvaluationStatusResult. Только для внутреннего использования.
 Топики
 Имя
 Описание
 FieldEvaluationStatusResult Данные
 Ниже перечислены данные класса FieldEvaluationStatusResult.
 FieldEvaluationStatusResult Свойства
 Ниже перечислены свойства класса FieldEvaluationStatusResult.
 Ссылки
 FieldEvaluationStatusResult Данные, FieldEvaluationStatusResult Свойства, Методы, Топики, FieldEvaluationStatusResult Данные, FieldEvaluationStatusResult Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!