Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FrameSetting
 Послать отзыв
 Данное перечисление определяет режимы отображения рамки изображения.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum FrameSetting { ImageFrameOff = 0, ImageFrameAbove = 1, ImageFrameBelow = 2, ImageFrameOnNoPlot = 3, ImageFrameInvalid = -1 }
Копировать Код
Public Enum FrameSetting ImageFrameOff = 0 ImageFrameAbove = 1 ImageFrameBelow = 2 ImageFrameOnNoPlot = 3 ImageFrameInvalid = -1 End Enum
 Члены
 Члены
 Описание
 ImageFrameInvalid
 Значение: -1. Рамка недействительна.
 ImageFrameOff
 Значение: 0. Рамка не отображается и не выводится на печать. Контур рамки временно подсвечивается при предварительном просмотре выбранного изображения.
 ImageFrameAbove
 Значение: 1. Рамка отображается перед изображением.
 ImageFrameBelow
 Значение: 2. Рамка отображается позади изображения.
 ImageFrameOnNoPlot
 Значение: 3. Рамка отображается, но не выводится на печать.
 Описание
 Данное перечисление определяет режимы отображения рамки изображения.
 Ваши комментарии по поводу этого топика: Послать отзыв!