Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.FingerprintGuid
 Послать отзыв
 Синтаксис
C#
Visual Basic
public String FingerprintGuid;
Public Property FingerprintGuid() As String
 Описание
 Устанавливает или возвращает заголовок переменной fingerprintguid базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!