Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LayoutManager.GetNonRectangularViewportIdFromClipId
 Послать отзыв
 Метод определяет ObjectId непрямоугольного видового экрана, связанного с указанным clipId. Возвращает NULL, если данный объект не является допустимым контуром подрезки.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectId GetNonRectangularViewportIdFromClipId( ObjectId clipId );
Копировать Код
Public Function GetNonRectangularViewportIdFromClipId( clipId As ObjectId ) As ObjectId
 Параметры
 Параметры
 Описание
 clipId
 name
 ObjectId контура подрезки, из которого нужно получить идентификатор непрямоугольного видового экрана, тип ObjectId.
 Возвращает
 Возвращает ObjectId для непрямоугольного видового экрана, ассоциированного с указанным clipId.
 Описание
 Метод определяет ObjectId непрямоугольного видового экрана, связанного с указанным clipId.
 Возвращает NULL, если данный объект не является допустимым контуром подрезки.
 Ссылки
 Teigha.DatabaseServices.LayoutManager, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!