Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObject.AcadObject
 Послать отзыв
 Свойство предоставляет доступ к COM-объекту.
 Синтаксис
C#
Visual Basic
Копировать Код
public AnnotativeStates Annotative;
Копировать Код
Public Property Annotative() As AnnotativeStates
 Возвращает
 Тип данных object.
 Описание
 Свойство предоставляет доступ к COM-объекту.
 Условия
 Только чтение
 Ссылки
 Teigha.DatabaseServices.DBObject, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!