Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Curve.GetDistAtPoint
 Послать отзыв
 Метод возвращает расстояние от кривой до заданной точки.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual double GetDistAtPoint( Point3d point );
Копировать Код
Public virtual Function GetDistAtPoint( point As Point3d ) As double
 Параметры
 Параметры
 Описание
 point
 Входной аргумент типа Point3d, представляющий точку.
 Возвращает
 Метод возвращает значение типа double - расстояние от кривой до заданной точки.
 Описание
 Метод GetDistAtPoint возвращает расстояние от кривой до заданной точки.
 Ссылки
 Teigha.DatabaseServices.Curve, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!