Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbCurve3d.AddKnot
 Послать отзыв
 Метод добавляет новый узел в узловой вектор сплайна.
 Синтаксис
C#
Visual Basic
Копировать Код
public void AddKnot( double newKnot );
Копировать Код
Public Sub AddKnot( newKnot As Double )
 Параметры
 Параметры
 Описание
 newKnot
 Новый узел. Тип double.
 Описание
 Метод добавляет новый узел в узловой вектор сплайна. Если значение newKnot уже является узлом, то этот метод не делает ничего.
 Ссылки
 Teigha.Geometry.NurbCurve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!