Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CoordinateSystem2d.Yaxis
 Послать отзыв
 Свойство Yaxis представляет направляющий вектор оси Y данной системы координат.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector2d Yaxis;
Копировать Код
Public ReadOnly Property Yaxis As Vector2d
 Возвращает
 Возвращает направляющий вектор оси Y данной системы координат. Тип Vector2d.
 Описание
 Свойство Yaxis представляет направляющий вектор оси Y данной системы координат.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.CoordinateSystem2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!