Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 BlockTableRecord.AssumeOwnershipOf(ObjectCollection entitesToMove)
 Послать отзыв
 Метод предназначен для передачи блоку права собственности на объекты и обеспечения безопасного перемещения этих объектов между блоками.
 Синтаксис
C#
Visual Basic
Копировать Код
public void AssumeOwnershipOf(ObjectIdCollection entitiesToMove)
Копировать Код
Public Sub AssumeOwnershipOf(entitiesToMove As ObjectIdCollection)
 Параметры
 Параметры
 Описание
 entitiesToMove
 Коллекция ObjectId примитивов, которым нужно изменить принадлежность к блоку.
 Описание
 Метод передает блоку права собственности на все объекты, перечисленные в параметре entitiesToMove и обеспечивает безопасное пермещение этих объектов между блоками.
 Изменение принадлежности объектов блоку возможно только при выполнении всех перечисленных ниже условий:
метод может открыть все объекты, перечисленные в параметре entitiesToMove для записи;
все объекты, перечисленные в параметре entitiesToMove расположены в той же базе данных, что и блок;
текущими владельцами примитивов являются все экземпляры блока.
 Если все условия соблюдены, то принадлежность всех примитивов изменится, примитивы будут отмечены в базе данных, как измененные. Операция изменения принадлежности примитивов относится к типу «все или ничего». Если хоть один примитив из коллекции примитивов entitiesToMove не может быть перемещен в другой блок, то ни один примтив не будет перемещен.
 Если какой-то из примитивов во время перемещения уже открыт для записи, это может привести к завершению работы программы.
 Ссылки
 Teigha.DatabaseServices.BlockTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!