Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObject.IsTransactionResident
 Послать отзыв
 Свойство предоставляет информацию об участии объекта в транзакции.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsTransactionResident;
Копировать Код
Public Property IsTransactionResident() As bool
 Возвращает
 Возвращает тип данных bool. Возвращает true, если объект в данный момент является частью транзакции.
 Описание
 Свойство предоставляет информацию об участии объекта в транзакции.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.DBObject, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!