Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.HostApplicationServices.ReleaseMinorVersion
 Послать отзыв
 Свойство возвращает дополнительную версию клиентского приложения.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual int ReleaseMinorVersion;
Копировать Код
Public Overridable ReadOnly Property ReleaseMinorVersion As Integer
 Возвращает
 Возвращает дополнительную версию клиентского приложения. Тип int.
 Описание
 Свойство возвращает дополнительную версию клиентского приложения.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.HostApplicationServices, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!