Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.Dimazin
 Послать отзыв
 Свойство управляет подавлением нулей в угловых размерах и допусках.
 Синтаксис
C#
Visual Basic
Копировать Код
public int Dimazin;
Копировать Код
Public Property Dimazin As Integer
 Возвращает
 Возвращает вариант подавления нулей. Тип int.
 Описание
 Свойство управляет подавлением нулей в угловых размерах и допусках.
 Значение
 Описание
 0
 Отображаются все ведущие и замыкающие нули.
 1
 Подавляются ведущие нули в десятичных размерах (напр., 0,3000 записывается как ,3000).
 2
 Подавляются замыкающие нули в десятичных размерах (напр., 22,3000 записывается как 22,3).
 3
 Подавляются ведущие и замыкающие нули (напр., 0,3000 записывается как ,3).
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!