Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Событие Database.WblockAborted
 Послать отзыв
 Синтаксис
C#
Visual Basic
public event EventHandler WblockAborted;
Public Event WblockAborted As EventHandler
 Описание
 Событие показывает, что операция wblock, выполняемая над чертежом, снята и не выполнена.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!