Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Interval
 Послать отзыв
 Класс Interval представляет конечный, бесконечный или полубесконечный интервал на действительной оси, границы которого определены с некоторой заданной точностью.
 Иерархия классов
Teigha::Geometry::Interval
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdGeInterval")] public sealed class Interval : DisposableWrapper
Копировать Код
<Wrapper("OdGeInterval")> Public NotInheritable Class Interval Inherits DisposableWrapper
 Описание
 Класс Interval представляет конечный, бесконечный или полубесконечный интервал на действительной оси, границы которого определены с некоторой заданной точностью.
 Методы
 Конструкторы
 Имя
 Описание
 Interval
 Это обзор перегрузок Interval.
 Топики
 Имя
 Описание
 Interval Методы
 Ниже перечислены методы класса Interval.
 Interval Свойства
 Ниже перечислены свойства класса Interval.
 Ссылки
 Interval Конструктор, Interval Методы, Interval Свойства, Методы, Топики, Interval Методы, Interval Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!