Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbCurve2d.GetFitPointAt
 Послать отзыв
 Метод предоставляет определяющую точку с указанным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point2d GetFitPointAt( int index );
Копировать Код
Public Function GetFitPointAt( index As Integer ) As Point2d
 Параметры
 Параметры
 Описание
 index
 Индекс определяющей точки. Тип int.
 Возвращает
 Возвращает определяющую точку с индексом index. Тип Point2d.
 Описание
 Метод предоставляет определяющую точку с указанным индексом.
 Ссылки
 Teigha.Geometry.NurbCurve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!