Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Latitude
 Послать отзыв
 Синтаксис
C#
Visual Basic
public double Latitude;
Public Property Latitude() As Double
 Описание
 Возвращает или устанавливает широту модели, в градусах. Допустимые значения от -90 до +90 градусов, а положительные значения соответствуют северной широте.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!