Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DataCell.SetObjectId
 Послать отзыв
 Метод устанавливает для этой ячейки значение типа ObjectId.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetObjectId( DatabaseServices.ObjectId value );
Копировать Код
Public Sub SetObjectId( value As DatabaseServices.ObjectId )
 Параметры
 Параметры
 Описание
 value
 Входное значение для ячейки. Тип DatabaseServices.ObjectId.
 Описание
 Метод устанавливает для этой ячейки значение типа ObjectId, заданное входным аргументом value.
 Ссылки
 Teigha.DatabaseServices.DataCell, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!