Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DynamicBlockReferenceProperty.Value
 Послать отзыв
 Свойство Value представляет текущее значение данного свойства у вхождения динамического блока.
 Синтаксис
C#
Visual Basic
Копировать Код
public object Value;
Копировать Код
Public Property Value As Object
 Возвращает
 Возвращает текущее значение данного свойства. Тип Object.
 Описание
 Свойство Value представляет текущее значение данного свойства у вхождения динамического блока.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.DynamicBlockReferenceProperty, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!