Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.UcsTableId
 Послать отзыв
 Синтаксис
C#
Visual Basic
public DatabaseServices::ObjectId UcsTableId;
Public Property UcsTableId() As DatabaseServices.ObjectId
 Описание
 Возвращает Id таблицы пользовательских координат базы данных.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!