Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeader.GetLeaderLineType
 Послать отзыв
 Метод позволяет получить тип линии выноски с указанным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.LeaderType GetLeaderLineType( int leaderLineIndex );
Копировать Код
Public Function GetLeaderLineType( leaderLineIndex As Integer ) As DatabaseServices.LeaderType
 Параметры
 Параметры
 Описание
 leaderLineIndex
 Индекс линии выноски. Тип int.
 Возвращает
 Возвращает тип линии выноски. Перечисление Teigha.DatabaseServices.LeaderType.
 Описание
 Метод позволяет получить тип линии выноски с указанным индексом (видимая, прямая, сплайн).
 Ссылки
 Teigha.DatabaseServices.MLeader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!