Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AlignedDimension.AlignedDimension
 Послать отзыв
 Данный конструктор создает новый объект AlignedDimension с использованием переданных в конструктор параметров (опорные точки, размерный текст, размерный стиль и т.д.).
 Синтаксис
C#
Visual Basic
Копировать Код
public AlignedDimension( Point3d line1Point, Point3d line2Point, Point3d dimensionLinePoint, ref String dimensionText, DatabaseServices.ObjectId dimensionStyle );
Копировать Код
Sub New( line1Point As Point3d, line2Point As Point3d, dimensionLinePoint As Point3d, ByRef dimensionText As String, dimensionStyle As DatabaseServices.ObjectId )
Public
 Параметры
 Параметры
 Описание
 line1Point
 Первая опорная точка размера, от которой измеряется длина. В ней начинается первая выносная линия. Тип Point3d.
 line2Point
 Вторая опорная точка размера, до которой измеряется длина. В ней начинается вторая выносная линия. Тип Point3d.
 dimensionLinePoint
 Точка, лежащая на размерной линии. Тип Point3d.
 dimensionText
 Текст на размере, заменяет текстовое представление измеренного значения. Тип String.
 dimensionStyle
 Идентификатор ObjectId размерного стиля, который используется для отображения объекта AlignedDimension.
 Описание
 Данный конструктор создает новый объект AlignedDimension, у которого задаются две опорные точки, между которыми измеряется расстояние, точка на размерной линии, текст на размере и идентификатор ObjectId стиля размера.
 Ссылки
 Teigha.DatabaseServices.AlignedDimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!