Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 DimStyleTableRecord.Dimtm
 Послать отзыв
 Свойство отвечает за настройку минимального (нижнего) значения предела допуска.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual double Dimtm { get; set; }
Копировать Код
Public Overridable Property Dimtm As Double
 Возвращает
 Возвращает тип данных double.
 Описание
 В свойстве хранится текущая настройка минимального (нижнего) значения предела допуска. В качестве значения свойства доступны вещественные числа.
 Свойство также доступно через системную переменную DIMTM и пользовательское меню в окне изменения/создания размерного стиля:
  При изменении системной переменной DIMTM будет создан новый размерный стиль под названием <переопределение> на основе текущего с новым значением DIMTM.
 Условия
 Чтение и запись.
 Пример
 Пример изменения минимального (нижнего) значения предела допуска (значения свойства Dimtm) в размерном стиле Standard:
C#
 Копировать Код
public partial class Commands { [Teigha.Runtime.CommandMethod("DimtmChange")] public void DimtmStandardDimStyle() { // Получение ссылки на активный документ HostMgd.ApplicationServices.Document doc = HostMgd.ApplicationServices.Application.DocumentManager.MdiActiveDocument; // Получение ссылки на редактор документа HostMgd.EditorInput.Editor ed = doc.Editor; // Получение ссылки на базу данных документа Teigha.DatabaseServices.Database db = doc.Database; // Начало транзакции с базой данных документа using (Teigha.DatabaseServices.Transaction trans = db.TransactionManager.StartTransaction()) { // Открываем таблицу размерных стилей для чтения Teigha.DatabaseServices.DimStyleTable dimStyleTable = trans.GetObject(db.DimStyleTableId, Teigha.DatabaseServices.OpenMode.ForRead) as Teigha.DatabaseServices.DimStyleTable; // Находим в таблице размерных стилей ObjectId нужного стиля по его названию Teigha.DatabaseServices.ObjectId styleId = dimStyleTable["Standard"]; // Открываем таблицу размерного стиля для изменений Teigha.DatabaseServices.DimStyleTableRecord obj = trans.GetObject(styleId, Teigha.DatabaseServices.OpenMode.ForWrite) as Teigha.DatabaseServices.DimStyleTableRecord; if (obj.Dimtol == false) obj.Dimtol = true; ed.WriteMessage($"nDimtm before: {obj.Dimtm}"); obj.Dimtp = 0.5; // Изменяем нижнюю границу допуска obj.Dimtm = 0.5; ed.WriteMessage($"nDimtm after: {obj.Dimtm}"); trans.Commit(); } } }
 Результат работы команды DimtmChange:
 Было:
 Стало:
 Ссылки
 Teigha.DatabaseServices.DimStyleTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!