Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CircularArc2d.CircularArc2d
 Послать отзыв
 Конструктор класса CircularArc2d. Создает круглую дугу с заданными концами и величиной прогиба.
 Синтаксис
C#
Visual Basic
Копировать Код
public CircularArc2d( Point2d startPoint, Point2d endPoint, double bulge, bool bulgeFlag );
Копировать Код
Public Sub New( startPoint As Point2d, endPoint As Point2d, bulge As Double, bulgeFlag As Boolean )
 Параметры
 Параметры
 Описание
 startPoint
 Начальная точка дуги. Тип Point2d.
 endPoint
 Конечная точка дуги. Тип Point2d.
 bulge
 Величина прогиба дуги. Тип double.
 bulgeFlag
 Флаг интерпретации прогиба. Тип bool.
 Описание
 Конструктор класса CircularArc2d. Создает круглую дугу с заданными концами и величиной прогиба.
 Замечания
 Этот конструктор всегда создает дугу и не может использоваться для построения окружности. Дуга строится против часовой стрелки.
 Прогиб определяется расстоянием от средней точки дуги до стягивающей дугу хорды. Если аргумент bulgeFlag равен true, прогиб интерпретируется в единицах длины как максимальное расстояние между дугой и хордой. Если аргумент bulgeFlag имеет значение false, прогиб интерпретируется в относительных единицах как отношение высоты сегмента дуги к половине длины хорды, стягивающей эту дугу. В этом случае прогиб численно равен тангенсу одной четвертой центрального угла дуги.
 Ссылки
 Teigha.Geometry.CircularArc2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!