Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FieldEngine.UnregisterEvaluatorLoader
 Послать отзыв
 Метод отменяет в движке FieldEngine регистрацию загрузчика вычислителя полей.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void UnregisterEvaluatorLoader( ref FieldEvaluatorLoader pLoader );
Копировать Код
Public Overridable Sub UnregisterEvaluatorLoader( ByRef pLoader As FieldEvaluatorLoader )
 Параметры
 Параметры
 Описание
 pLoader
 Загрузчик вычислителя, регистрация которого отменяется. Тип FieldEvaluatorLoader.
 Описание
 Метод отменяет в движке FieldEngine регистрацию загрузчика вычислителя полей.
 Замечания
 Модули вычислителей полей должны отменять регистрацию загрузчика вычислителя на этапе выгрузки модуля перед удалением объекта загрузчика.
 Ссылки
 Teigha.DatabaseServices.FieldEngine, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!