Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.PointOnSurface.GetMixedPartial
 Послать отзыв
 Метод вычисляет смешанную частную производную указанной поверхности в параметрически заданной точке. В текущей версии не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public static Vector3d GetMixedPartial( ref Surface surf, Point2d point );
Копировать Код
Public Shared Function GetMixedPartial( ByRef surf As Surface, point As Point2d ) As Vector3d
 Параметры
 Параметры
 Описание
 surf
 Входная поверхность. Тип Surface.
 point
 Точка поверхности, заданная параметрически. Тип Point2d. Координата point.x определяет значение параметра точки по оси u, а координата point.y - значение параметра по оси v.
 Возвращает
 Возвращает вектор смешанной частной производной в точке point поверхности surf. Тип Vector3d.
 Описание
 Метод вычисляет смешанную частную производную поверхности surf в параметрически заданной точке point. В текущей версии не реализован.
 Ссылки
 Teigha.Geometry.PointOnSurface, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!