Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Line2dCollection.RemoveAt
 Послать отзыв
 Метод удаляет из коллекции элемент с указанным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public void RemoveAt( int index );
Копировать Код
Public Sub RemoveAt( index As Integer )
 Параметры
 Параметры
 Описание
 index
 Индекс удаляемого элемента. Тип int.
 Описание
 Метод удаляет из коллекции элемент с указанным индексом.
 Замечания
 В случае некорректного значения индекса метод выбрасывает исключение ArgumentOutOfRangeException.
 Ссылки
 Teigha.Geometry.Line2dCollection, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!