Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Tablestyle
 Послать отзыв
 Синтаксис
C#
Visual Basic
public DatabaseServices::ObjectId Tablestyle;
Public Property Tablestyle() As DatabaseServices.ObjectId
 Описание
 Обеспечивает доступ к Id таблицы стилей, определенной текущим значением CTABLESTYLE для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!