Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ObjectId.IsNull
 Послать отзыв
 Свойство возвращает true, если ObjectId данного объекта является нулевым.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsNull;
Копировать Код
Public Property IsNull() As Boolean
 Возвращает
 Возвращает true, если ObjectId данного объекта имеет значение Null, иначе - false.
 Описание
 Свойство возвращает true, если ObjectId данного объекта имеет значение Null.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.ObjectId, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!