Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObjectReference.Kind
 Послать отзыв
 Свойство Kind представляет вид объектной ссылки для данного объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public int Kind;
Копировать Код
Public ReadOnly Property Kind As Integer
 Возвращает
 Возвращает вид объектной ссылки. Тип int.
 Описание
 Свойство Kind представляет вид объектной ссылки для данного объекта (код DXF).
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.DBObjectReference, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!