Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotStyleData.Screening
 Послать отзыв
 Свойство Screening представляет текущее значение скрининга в данном объекте.
 Синтаксис
C#
Visual Basic
Копировать Код
public int Screening;
Копировать Код
Public Property Screening As Integer
 Возвращает
 Возвращает текущее значение скрининга. Тип int.
 Описание
 Свойство Screening представляет текущее значение скрининга в данном объекте.
 Диапазон допустимых значений этого свойства: [0.0 .. 100.0].
0 соответствует белому цвету.
100 означает использование цветов в их полной интенсивности.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.PlotStyleData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!