Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Surface.GetSubentityMaterialMapper
 Послать отзыв
 Метод позволяет получить для указанного подобъекта объект Mapper, который обеспечивает сопоставление материалов.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual Mapper GetSubentityMaterialMapper( SubentityId subEntityId );
Копировать Код
Public Overridable Function GetSubentityMaterialMapper( subEntityId As SubentityId ) As Mapper
 Параметры
 Параметры
 Описание
 subEntityId
 Идентификатор подобъекта. Тип SubentityId.
 Возвращает
 Возвращает объект Mapper для сопоставления материалов подобъекта.
 Описание
 Метод позволяет получить для указанного подобъекта объект Mapper, который обеспечивает сопоставление материалов.
 Ссылки
 Teigha.DatabaseServices.Surface, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!