Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.EllipticalCylinder
 Послать отзыв
 Класс EllipticalCylinder представляет эллиптические цилиндры.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Geometry::Entity3d Teigha::Geometry::Surface Teigha::Geometry::EllipticalCylinder
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdGeEllipCylinder")] public sealed class EllipticalCylinder : Surface
Копировать Код
<Wrapper("OdGeEllipCylinder")> Public NotInheritable Class EllipticalCylinder Inherits Surface
 Описание
 Класс EllipticalCylinder представляет эллиптические цилиндры (цилиндры с эллиптическим поперечным сечением).
 Эллиптический цилиндр определяется:
большим и малым радиусами,
началом координат (располагается на оси симметрии),
осью симметрии,
большой осью,
высотой,
масштабом параметра U.
 Замечания
 Направляющей эллиптического цилиндра является эллипс. Образующими эллиптического цилиндра являются прямые, проходящие через каждую точку этого эллипса параллельно оси симметрии цилиндра.
 Интервал высот эллиптического цилиндра определяется относительно его начала. Высота увеличивается в направлении оси симметрии. Интервал высот может быть неограниченным.
 Параметр V определяет угол вращения вокруг оси симметрии цилиндра, измеряемый от большой оси. Для замкнутого эллиптического цилиндра параметр V определен на интервале [-PI, +PI). Положительное направление изменения параметра V определяется правилом правой руки при вращательном движении вдоль оси симметрии цилиндра.
 Параметр U изменяется вдоль образующей цилиндра. U является безразмерным, измеряется в масштабе параметра U (который по умолчанию равен большому радиусу). Значение параметра U увеличивается в направлении оси симметрии, если масштаб положительный. Однако, если масштаб параметра U отрицателен, U уменьшается в направлении оси симметрии. Нулевое значение U соответствует основанию эллиптического цилиндра.
 Боковая поверхность цилиндра периодична по V с периодом 2PI.
 Параметрическая область [umin, umax] x [vmin, vmax] определяет четырехсторонний участок цилиндрической поверхности, ограниченный двумя прямыми линиями (соответствуют параметрам vmin и vmax) и двумя дугами (соответствуют параметрам umin и umax).
 Определение эллиптического цилиндра предполагает соблюдение следующих ограничений:
umin < umax;
vmax - vmin| <= 2PI;
majorRadius > 0.0;
minorRadius > 0.0.
 Угол точки на эллипсе измеряется путем проецирования этой точки перпендикулярно большой оси на окружность, лежащую в той же плоскости, центр которой совпадает с центром эллипса, а радиус равен большому радиусу этого эллипса.
 Угол между большой осью эллипса и вектором из центра эллипса в спроецированную точку на окружности, измеренный против часовой стрелки, является углом этой точки на эллипсе.
 Методы
 Конструкторы
 Teigha.Geometry.EllipticalCylinder
 Имя
 Описание
 EllipticalCylinder
 Это обзор перегрузок EllipticalCylinder.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Geometry.Entity3d
 Имя
 Описание
 Entity3d Методы
 Ниже перечислены методы класса Entity3d.
 Teigha.Geometry.Surface
 Имя
 Описание
 Surface Методы
 Ниже перечислены методы класса Surface.
 Surface Свойства
 Ниже перечислены свойства класса Surface.
 Teigha.Geometry.EllipticalCylinder
 Имя
 Описание
 EllipticalCylinder Методы
 Ниже перечислены методы класса EllipticalCylinder.
 EllipticalCylinder Свойства
 Ниже перечислены свойства класса EllipticalCylinder.
 Ссылки
 EllipticalCylinder Конструктор, EllipticalCylinder Методы, EllipticalCylinder Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!