Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.UnderlayLayerState
 Послать отзыв
 Данное перечисление определяет состояние слоя подложки - является ли он разблокированным или заблокированным.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum UnderlayLayerState { Off = 0, On = 1 }
Копировать Код
Public Enum UnderlayLayerState Off = 0 On = 1 End Enum
 Члены
 Члены
 Описание
 Off
 Значение: 0. Слой является заблокированным (disabled).
 On
 Значение: 1. Слой является разблокированным (enabled).
 Описание
 Данное перечисление определяет состояние слоя подложки - является ли он разблокированным или заблокированным.
 Ваши комментарии по поводу этого топика: Послать отзыв!