Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.BlockScaling
 Послать отзыв
 Перечисление BlockScaling определяет тип масштабирования для вхождений блока, связанного с записью таблицы блоков.
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdDbBlockTableRecord.BlockScaling")] public enum BlockScaling { Any = 0, Uniform = 1 }
Копировать Код
<Wrapper("OdDbBlockTableRecord.BlockScaling")> Public Enum BlockScaling Any = 0 Uniform = 1 End Enum
 Члены
 Члены
 Описание
 Any
 Значение: 0. Масштабирование вхождений блока может быть неравномерным.
 Uniform
 Значение: 1. Масштабирование вхождений блока может быть только равномерным.
 Описание
 Перечисление BlockScaling определяет тип масштабирования для вхождений блока, связанного с записью таблицы блоков (произвольное или равномерное).
 Ваши комментарии по поводу этого топика: Послать отзыв!