Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.NurbSurface.VKnots
 Послать отзыв
 Свойство представляет узловой вектор данной поверхности в направлении v.
 Синтаксис
C#
Visual Basic
Копировать Код
public KnotCollection VKnots;
Копировать Код
Public ReadOnly Property VKnots As KnotCollection
 Возвращает
 Возвращает узловой вектор поверхности. Тип KnotCollection.
 Описание
 Свойство представляет узловой вектор данной поверхности в направлении v.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.NurbSurface, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!