Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObject.CloseAndPage(bool)
 Послать отзыв
 Метод закрывает объект и выводит его на страницу. Все изменения, внесенные в объект с момента его открытия, фиксируются в базе данных, и отправляется уведомление о том, что объект теперь "закрыт". В настоящее время не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
[Obsolete( "Use Transaction instead" )] public void CloseAndPage(bool onlyWhenClean);
Копировать Код
<Obsolete( "Use Transaction instead" )> Public Sub CloseAndPage(onlyWhenClean As bool)
 Параметры
 Параметры
 Описание
 onlyWhenClean
 Признак, указывающий, нужно ли удалять информацию из буфера Undo
 Описание
 Закрывает объект и выгружает его, если объект можеть быть выгружен. Все изменения, сделанные с объектом с момента открытия, фиксируются в базе данных, и формируется событие "закрыт" (так же, как и, в соответствующих случаях, события "изменен", "очищен" и т.д.).
 Ссылки
 Teigha.DatabaseServices.DBObject, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!