Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Solid3d.SeparateBody
 Послать отзыв
 Метод позволяет разделить данное 3D-тело на массив твердых тел, представляющих дополнительные непересекающиеся объемы.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual Solid3d[] SeparateBody();
Копировать Код
Public Overridable Function SeparateBody() As Solid3d()
 Возвращает
 Возвращает массив твердых тел с непересекающимися объемами. Тип Solid3d[].
 Описание
 Метод позволяет разделить данное 3D-тело на массив твердых тел, представляющих дополнительные непересекающиеся объемы. Данный объект редуцируется в одно из этих твердых тел. Для сохранения других тел массива ваше приложение должно добавить их в базу данных документа.
 Этот метод реализован только в среде пространственного моделирования.
 Ссылки
 Teigha.DatabaseServices.Solid3d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!