Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 BlockTableRecord.IsFromOverlayReference
 Послать отзыв
 Свойство предназначено для изменения типа ссылки на внешний блок.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsFromOverlayReference { get; set; }
Копировать Код
Public Property IsFromOverlayReference As Boolean
 Возвращает
 Возвращает тип данных bool:
true - блок является внешним для
 документа, то есть вставлен из другого документа, и тип ссылки на вставку этого блока – наложенная;
false - блок является внешним для документа и тип
 ссылки на вставку этого блока - вложенная.
 Note Значение свойства используется для 3-его бита
 группового кода 70 DXF.
 Описание
 Свойство меняет тип ссылки на определение блока. Возможны два типа ссылок: наложенная и вложенная.
 Если ссылка наложенная, то при использовании данного определения блока в другом чертеже, блок с наложенной ссылкой в этом чертеже не отобразится и не загрузится в него.
 Если ссылка вложенная, то при использовании данного определения блока в другом чертеже, блок с вложенной ссылкой добавится в этот чертеж, как часть другого блока.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.BlockTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!