Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbCurve2d.NurbCurve2d
 Послать отзыв
 Конструктор класса NurbCurve2d. Создает двумерную NURBS кривую, которая интерполирует указанную двумерную эллиптическую дугу.
 Синтаксис
C#
Visual Basic
Копировать Код
public NurbCurve2d( ref EllipticalArc2d ellipse );
Копировать Код
Public Sub New( ByRef ellipse As EllipticalArc2d )
 Параметры
 Параметры
 Описание
 ellipse
 Входная эллиптическая дуга. Тип EllipticalArc2d.
 Описание
 Конструктор класса NurbCurve2d. Создает двумерную NURBS кривую, которая интерполирует указанную двумерную эллиптическую дугу.
 Ссылки
 Teigha.Geometry.NurbCurve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!