Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Section.GetVertices
 Послать отзыв
 Метод позволяет получить все вершины секущей плоскости.
 Синтаксис
C#
Visual Basic
Копировать Код
public void GetVertices( ref Point3dCollection pts );
Копировать Код
Public Sub GetVertices( ByRef pts As Point3dCollection )
 Параметры
 Параметры
 Описание
 pts
 Коллекция вершин. Тип Point3dCollection.
 Описание
 Метод позволяет получить все вершины секущей плоскости.
 Ссылки
 Teigha.DatabaseServices.Section, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!