Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocArrayPolarParameters.FillAngle
 Послать отзыв
 Свойство обеспечивает доступ к углу между первым и последним элементами кругового массива.
 Синтаксис
C#
Visual Basic
Копировать Код
public double FillAngle;
Копировать Код
Public Property FillAngle() As Double
 Возвращает
 Возвращает угол в радианах между первым и последним элементами кругового массива. Тип double.
 Описание
 Свойство обеспечивает доступ к углу в радианах между базовыми точками первого и последнего элементов кругового массива.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.AssocArrayPolarParameters, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!