Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Assoc2dConstraintGroup.TransformActionBy
 Послать отзыв
 Метод применяет заданное геометрическое преобразование к рабочей плоскости данной группы ограничений.
 Синтаксис
C#
Visual Basic
Копировать Код
public void TransformActionBy( Teigha.Geometry.Matrix3d transform );
Копировать Код
Public Sub TransformActionBy( transform As Teigha.Geometry.Matrix3d )
 Параметры
 Параметры
 Описание
 transform
 Входная матрица геометрического преобразования. Тип Geometry.Matrix3d.
 Описание
 Метод применяет заданное геометрическое преобразование к рабочей плоскости данной группы ограничений. Геометрические зависимости сохраняются, если преобразование ограничивается параллельным переносом и вращением.
 Если матрица преобразования предполагает равномерное масштабирование, будут удалены все узлы ExplicitConstraint. В случае преобразования общего вида будут удалены все узлы GeometricalConstraint.
 Ссылки
 Teigha.DatabaseServices.Assoc2dConstraintGroup, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!