Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Matrix3d.Matrix3d
 Послать отзыв
 Конструктор создает 3D-матрицу на основе значений в переданном массиве.
 Синтаксис
C#
Visual Basic
Копировать Код
public Matrix3d( ref double[] data );
Копировать Код
Public Sub New( ByRef data As double() )
 Параметры
 Параметры
 Описание
 data
 Массив элементов матрицы. Тип double[].
 Описание
 Конструктор создает 3D-матрицу на основе значений в переданном массиве.
 Матрице присваиваются первые 16 элементов исходного массива. Элементы матрицы задаются построчно (data11, data12 ... data44).
 Ссылки
 Teigha.Geometry.Matrix3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!