Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Surface.SetSubentityColor
 Послать отзыв
 Метод позволяет задать цвет указанному подобъекту данной поверхности.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetSubentityColor( SubentityId subEntityId, ref Teigha.Colors.Color color );
Копировать Код
Public Overridable Sub SetSubentityColor( subEntityId As SubentityId, ByRef color As Teigha.Colors.Color )
 Параметры
 Параметры
 Описание
 subEntityId
 Идентификатор подобъекта. Тип SubentityId.
 color
 Новый цвет подобъекта. Тип Teigha.Colors.Color.
 Описание
 Метод позволяет задать цвет указанному подобъекту данной поверхности.
 Ссылки
 Teigha.DatabaseServices.Surface, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!