Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 BlockTableRecord.Origin
 Послать отзыв
 Свойство предназначено для хранения данных о базовой точке блока.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d Origin { get; set; }
Копировать Код
Public Property Origin As Point3d
 Возвращает
 Возвращает точку Point3d с тремя координатами расположения базовой точки блока.
 Note Точка всегда имеет координаты (0, 0, 0). Не рекомендуется менять её значение.
 Описание
 Базовая точка блока, или точка его вставки в WCS (World Coordinate System). Точка является началом системы координат MCS (локальная система мировых координат для геометрических объектов в записи таблицы блоков).
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.BlockTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!