Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.EllipticalCone.Height
 Послать отзыв
 Свойство Height представляет интервал для значений высоты данного конуса.
 Синтаксис
C#
Visual Basic
Копировать Код
public Interval Height;
Копировать Код
Public Property Height As Interval
 Возвращает
 Возвращает интервал высоты данного конуса. Тип Interval.
 Описание
 Свойство Height представляет интервал для значений высоты данного конуса.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.Geometry.EllipticalCone, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!