Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DwgFiler.WriteInt64
 Послать отзыв
 Метод предназначен для записи заданного 64-разрядного целого числа со знаком (тип long long) в этот объект Filer.
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract void WriteInt64( long long value );
Копировать Код
Public MustOverride Sub WriteInt64( value As Long Long )
 Параметры
 Параметры
 Описание
 value
 Записываемое в Filer значение. Тип long long.
 Описание
 Метод предназначен для записи заданного 64-разрядного целого числа со знаком (тип long long) в этот объект Filer.
 Ссылки
 Teigha.DatabaseServices.DwgFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!