Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.GridVisibility
 Послать отзыв
 Метод позволяет определить видимость сетки с указанной стороны ячейки.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual bool GridVisibility( int row, int col, CellEdgeMasks edge );
Копировать Код
Public virtual Function GridVisibility( row As Integer, col As Integer, edge As CellEdgeMasks ) As Boolean
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 col
 Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
 edge
 Сторона ячейки из перечисления CellEdgeMasks.
 Возвращает
 Возвращает true, если видимость включена, и false в противном случае.
 Описание
 Метод позволяет определить видимость сетки с указанной стороны ячейки.
 Замечания
 Для получения того же результата предпочтительнее использовать Table.Cells[row,column].{Top,Bottom,Left,Right}Edge.Visibility.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!