Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GeoLocationData.ResetMeshPointMaps
 Послать отзыв
 Этот метод позволяет сбросить сеть GeoMesh в состояние NULL.
 Синтаксис
C#
Visual Basic
Копировать Код
public void ResetMeshPointMaps();
Копировать Код
Public Sub ResetMeshPointMaps()
 Описание
 Этот метод позволяет сбросить сеть GeoMesh в состояние NULL.
 Ссылки
 Teigha.DatabaseServices.GeoLocationData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!