Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBVisualStyle.SetTrait
 Послать отзыв
 Метод позволяет задать значение типа Variant указанному свойству данного визуального стиля.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetTrait( VisualStyleProperty vsProp, ref Variant val, VisualStyleOperation vsOp );
Копировать Код
Public Sub SetTrait( vsProp As VisualStyleProperty, ByRef val As Variant, vsOp As VisualStyleOperation )
 Параметры
 Параметры
 Описание
 vsProp
 Свойство визуального стиля, которое необходимо установить. Значение из перечисления VisualStyleProperty.
 val
 Значение свойства, которое требуется задать. Тип Variant.
 vsOp
 Операция, используемая для установки свойства. Значение из перечисления VisualStyleOperation.
 Описание
 Метод позволяет задать значение типа Variant указанному свойству данного визуального стиля.
 Ссылки
 Teigha.DatabaseServices.DBVisualStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!