Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.BoundBlock2d.IsBox
 Послать отзыв
 Свойство IsBox позволяет проверить, представлена ли граничная рамка прямоугольником, который ориентирован вдоль осей системы координат.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsBox;
Копировать Код
Public Property IsBox As Boolean
 Возвращает
 Возвращает true, если граничная рамка представлена прямоугольником, который ориентирован по осям системы координат. В противном случае возвращает false.
 Описание
 Свойство IsBox позволяет проверить, представлена ли граничная рамка прямоугольником, который ориентирован вдоль осей системы координат.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.Geometry.BoundBlock2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!