Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство RasterImage.ClipBoundaryType
 Послать отзыв
 Синтаксис
C#
Visual Basic
public DatabaseServices::ClipBoundaryType ClipBoundaryType;
Public Property ClipBoundaryType() As DatabaseServices.ClipBoundaryType
 Описание
 Возвращает тип текущего контура изображения.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.RasterImage, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!