Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.Dimsd1
 Послать отзыв
 Свойство управляет подавлением первой размерной линии и стрелки.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool Dimsd1;
Копировать Код
Public Property Dimsd1 As Boolean
 Возвращает
 Возвращает true, если подавление включено. В противном случае возвращает false.
 Описание
 Свойство управляет подавлением первой размерной линии и стрелки.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!