Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.XrefStatus
 Послать отзыв
 Данное перечисление определяет статусы объектов внешних ссылок.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum XrefStatus { NotAnXref = 0, Resolved = 1, Unloaded = 2, Unreferenced = 3, FileNotFound = 4, Unresolved = 5 }
Копировать Код
Public Enum XrefStatus NotAnXref = 0 Resolved = 1 Unloaded = 2 Unreferenced = 3 FileNotFound = 4 Unresolved = 5 End Enum
 Члены
 Члены
 Описание
 NotAnXref
 Значение: 0. Обнаруженный файл не является внешней ссылкой.
 Resolved
 Значение: 1. Внешняя ссылка разрешена согласно записи таблицы блоков.
 Unloaded
 Значение: 2. Внешняя ссылка выгружена из записи таблицы блоков.
 Unreferenced
 Значение: 3. Xref не имеет ссылки. Анонимные блоки, на которые нет ссылок, удаляются из таблицы блоков каждый раз, когда nanoCAD открывает новый чертеж.
 FileNotFound
 Значение: 4. Файл внешней ссылки не найден.
 Unresolved
 Значение: 5. Запись таблицы блоков внешней ссылки разрешить не удалось.
 Описание
 Данное перечисление определяет статусы объектов внешних ссылок.
 Ваши комментарии по поводу этого топика: Послать отзыв!