Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ResultBufferEnumerator.Current
 Послать отзыв
 Свойство Current представляет текущее типизированное значение данного перечислителя.
 Синтаксис
C#
Visual Basic
Копировать Код
public TypedValue Current;
Копировать Код
Public ReadOnly Property Current As TypedValue
 Возвращает
 Возвращает текущее типизированное значение. Тип TypedValue.
 Описание
 Свойство Current представляет текущее типизированное значение данного перечислителя.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.ResultBufferEnumerator, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!