Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Viewport.Contrast
 Послать отзыв
 Свойство Contrast представляет значение контрастности, влияющее на интенсивность рассеянного освещения от других источников света в данном видовом экране.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Contrast;
Копировать Код
Public Property Contrast As Double
 Возвращает
 Возвращает значение контраста. Тип double.
 Описание
 Свойство Contrast представляет значение контрастности, влияющее на интенсивность рассеянного освещения от других источников света в данном видовом экране.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Viewport, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!