Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Line.StartPoint
 Послать отзыв
 Синтаксис
C#
Visual Basic
public Point3d StartPoint;
Public Property StartPoint() As Point3d
 Описание
 Обеспечивает доступ к координатам начальной точки линии в мировых координатах.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Line, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!