Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocArray.getItemLocators
 Послать отзыв
 Метод извлекает список локаторов элементов для указанного списка путей подобъектов данного ассоциативного массива.
 Синтаксис
C#
Visual Basic
Копировать Код
public ItemLocator[] getItemLocators( ref FullSubentityPath[] subPaths );
Копировать Код
Public Function getItemLocators( ByRef subPaths As FullSubentityPath() ) As ItemLocator()
 Параметры
 Параметры
 Описание
 subPaths
 Массив полных путей подъобъектов в ассоциативном массиве. Тип FullSubentityPath[].
 Возвращает
 Возвращает массив локаторов элементов ассоциативного массива. Тип ItemLocator[].
 Описание
 Метод извлекает список локаторов элементов ItemLocator для заданного списка путей подобъектов ассоциативного массива. Каждый элемент списка путей должен представлять полный путь подобъекта в элементе массива.
 Ссылки
 Teigha.DatabaseServices.AssocArray, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!