Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.XrefComandeeredEventArgs
 Послать отзыв
 Класс XrefComandeeredEventArgs представляет данные для события XrefComandeered в базе данных.
 Иерархия классов
Teigha::DatabaseServices::XrefComandeeredEventArgs
 Синтаксис
C#
Visual Basic
Копировать Код
public sealed class XrefComandeeredEventArgs : EventArgs
Копировать Код
Public NotInheritable Class XrefComandeeredEventArgs Inherits EventArgs
 Описание
 Класс XrefComandeeredEventArgs представляет данные для события XrefComandeered в базе данных.
 Топики
 Имя
 Описание
 XrefComandeeredEventArgs Свойства
 Ниже перечислены свойства класса XrefComandeeredEventArgs.
 Ссылки
 XrefComandeeredEventArgs Свойства, Топики, XrefComandeeredEventArgs Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!