Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.OpenCloseTransaction.Commit
 Послать отзыв
 Метод фиксирует изменения в объектах, открытых в рамках транзакции OpenCloseTransaction, а затем закрывает эти объекты.
 Синтаксис
C#
Visual Basic
Копировать Код
public override void Commit();
Копировать Код
Public Overrides Sub Commit()
 Описание
 Метод фиксирует в базе данных изменения в объектах, открытых в рамках транзакции OpenCloseTransaction, а затем закрывает эти объекты.
 Ссылки
 Teigha.DatabaseServices.OpenCloseTransaction, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!