Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve3d.GetClosestPointTo
 Послать отзыв
 Метод позволяет найти ближайшие точки между данной кривой и кривой, переданной в аргументе.
 Синтаксис
C#
Visual Basic
Копировать Код
public PointOnCurve3d[] GetClosestPointTo( ref Curve3d curve3d );
Копировать Код
Public Function GetClosestPointTo( ByRef curve3d As Curve3d ) As PointOnCurve3d()
 Параметры
 Параметры
 Описание
 curve3d
 Кривая, на которой следует искать ближайшие точки. Тип Curve3d.
 Возвращает
 Возвращает массив точек. Тип PointOnCurve3d[].
 Описание
 Метод позволяет найти ближайшие точки между данной кривой и кривой, переданной в аргументе. Вызывается метод Curve3d.GetClosestPointTo(Curve3d curve, Tolerance tolerance) с допуском, равным Global.
 Ссылки
 Teigha.Geometry.Curve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!