Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Entity.GetGripPoints(GripDataCollection
 Послать отзыв
 Метод предназначен для добавления координат ручек (точек управления) геометрического объекта в существующий массив gripPoints.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool GetGripPoints(GripDataCollection grips, double curViewUnitSize, int gripSize, Vector3d curViewDir, GetGripPointsFlags bitFlags);
Копировать Код
Public Function GetGripPoints(grips As GripDataCollection, curViewUnitSize As Double, gripSize As Integer, curViewDir As Vector3d, bitFlags As GetGripPointsFlags) As bool
 Параметры
 Параметры
 Описание
 grips
 Заранее существующий массив, куда добавляются координаты ручек. В результат к массиву добавляются координаты ручек данного геометрического объекта. Тип GripDataCollection
 curViewUnitSize
 Размер единичного пикселя в мировых координатах для текущего представления. Используется для корректного масштабирования ручек на экране. Тип double
 gripSize
 Размер ручки в пикселях, используемый для определения области, в которой пользователь может выбрать ручку. Тип int
 curViewDir
 Направление взгляда камеры (вектор направления текущего вида). Используется для правильной ориентации ручек относительно пользователя. Тип Vector3d
 bitFlags
 Флаги, задающие дополнительные параметры извлечения точек управления. Тип GetGripPointsFlags
 Возвращает
 Возвращает тип данных bool: true, если ручки были успешно добавлены, и false — в случае ошибки или отсутствия доступных ручек.
 Описание
 Метод добавляет точки управления (ручки) для геометрического объекта с учётом текущего вида и параметров отображения. Используется при работе с интерактивным редактированием объектов через пользовательский интерфейс.
 Ссылки
 Teigha.DatabaseServices.Entity, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!