Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.OffsetCurve3d
 Послать отзыв
 Класс OffsetCurve3d представляет трехмерную кривую, получаемую операцией смещения исходной (базовой) кривой.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Geometry::Entity3d Teigha::Geometry::Curve3d Teigha::Geometry::OffsetCurve3d
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdGeOffsetCurve3d")] public sealed class OffsetCurve3d : Curve3d
Копировать Код
<Wrapper("OdGeOffsetCurve3d")> Public NotInheritable Class OffsetCurve3d Inherits Curve3d
 Описание
 Класс OffsetCurve3d представляет трехмерную кривую, получаемую операцией смещения исходной (базовой) кривой.
 Объект этого класса хранит указатель на базовую кривую, соответственно, любое изменение базовой кривой вызывает изменение кривой смещения. Поскольку эта кривая является точным смещением, она может быть самопересекающейся, даже если базовая кривая самопересечений не имеет. Кривая смещения без самопересечений создается методом Curve2d.GetTrimmedOffset().
 Положительное направление смещения в каждой точке базовой кривой перпендикулярно вектору касательной в этой точке. Таким образом, если касательный вектор в точке базовой кривой равен (x,y), то положительным направлением смещения будет (-y,x). Базовая кривая может быть смещена в любом из двух направлений путем указания положительного или отрицательного значения величины смещения. Допустимо и нулевое смещение, в этом случае смещенная кривая является просто копией базовой кривой.
 Замечания
 Методы, которые изменяют кривую смещения, такие как TransformBy(), GetReverseParameterCurve() и SetInterval(), базовую кривую не изменяют.
 Если вызвать метод GetReverseParameterCurve() для кривой смещения, то направление результирующей кривой смещения будет противоположным направлению базовой кривой.
 Если для кривой смещения вызвать метод SetInterval(), то кривая смещения будет представлять смещение указанного параметрического интервала базовой кривой. Это позволяет создавать семейство кривых смещения, каждая из которых строится на своем параметрическом интервале одной и той же базовой кривой. Например, если из одной базовой кривой с параметрическим интервалом [0, 1] построить три изначально совпадающие кривые смещения, то затем для каждой из них можно вызвать метод SetInterval(), чтобы изменить их интервалы "происхождения" на что-то вроде [0.1, 0.3], [0.5, 0.6] и [0.7, 0.9]. В дальнейшем любую из этих кривых смещения можно преобразовать или обратить, не затрагивая другие кривые смещения или саму базовую кривую. Если величину смещения сделать равной 0, то все эти кривые смещения будут геометрически совпадать с соответствующими участками базовой кривой.
 В случае ненулевой величины смещения класс гладкости кривой смещения будет на единицу меньше класса гладкости базовой кривой. Так, если базовая кривая имеет непрерывные первую и вторую производные, но не третью (класс гладкости C2), то кривая смещения будет иметь непрерывной только первую производную (класс гладкости C1). Если базовая кривая сама по себе непрерывна, но имеет разрывы в первой производной (класс C0), то кривая смещения может вообще не быть непрерывной. Таким образом, для гарантии, что кривая смещения будет представлять собой допустимую кривую, базовая кривая должна быть непрерывной по крайней мере в первой производной (класс C1).
 Методы
 Конструкторы
 Teigha.Geometry.OffsetCurve3d
 Имя
 Описание
 OffsetCurve3d
 Конструктор класса OffsetCurve3d. Создает кривую, которая является точным смещением на заданное расстояние указанной базовой кривой, располагающейся в указанной плоскости.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Geometry.Entity3d
 Имя
 Описание
 Entity3d Методы
 Ниже перечислены методы класса Entity3d.
 Teigha.Geometry.Curve3d
 Имя
 Описание
 Curve3d Методы
 Ниже перечислены методы класса Curve3d.
 Curve3d Свойства
 Ниже перечислены свойства класса Curve3d.
 Teigha.Geometry.OffsetCurve3d
 Имя
 Описание
 OffsetCurve3d Методы
 Ниже перечислены методы класса OffsetCurve3d.
 OffsetCurve3d Свойства
 Ниже перечислены свойства класса OffsetCurve3d.
 Ссылки
 OffsetCurve3d Методы, OffsetCurve3d Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!