Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.Dimtfill
 Послать отзыв
 Свойство управляет фоном размерного текста.
 Синтаксис
C#
Visual Basic
Копировать Код
public int Dimtfill;
Копировать Код
Public Property Dimtfill As Integer
 Возвращает
 Возвращает код варианта отображения фона размерного текста. Тип int.
 Описание
 Свойство задает или возвращает код варианта отображения фона размерного текста.
 Значение
 Описание
 0
 Фон отсутствует.
 1
 Цвет фона чертежа.
 2
 Фон задан свойством Dimtfillclr.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!