Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocEvaluationCallback
 Послать отзыв
 Класс предоставляет ассоциативным действиям механизмы реализации уведомлений о ходе обновления ассоциативных связей, сообщений о результатах вычислений, уведомлений о задействованных и измененных объектах, механизмы, позволяющие клиенту прервать и отменить обновление, и т.д.
 Иерархия классов
Teigha::DatabaseServices::AssocEvaluationCallback
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("AcDbAssocEvaluationCallback")] public class AssocEvaluationCallback : DisposableWrapper;
Копировать Код
<Wrapper("AcDbAssocEvaluationCallback")> Public Class AssocEvaluationCallback Inherits DisposableWrapper
 Описание
 Класс предоставляет ассоциативным действиям (класс AssocAction) механизмы реализации уведомлений о ходе обновления ассоциативных связей, сообщений о результатах вычислений, уведомлений о задействованных и измененных объектах, механизмы, позволяющие клиенту прервать и отменить обновление, и т.д.
 Методы
 Конструкторы
 ПоказатьInternal
 Нет совпадений по текущему фильтру
 Имя
 Описание
 AssocEvaluationCallback
 This is AssocEvaluationCallback, a member of class AssocEvaluationCallback.
 Топики
 Имя
 Описание
 AssocEvaluationCallback Методы
 Ниже перечислены методы класса AssocEvaluationCallback.
 Ссылки
 AssocEvaluationCallback Методы, Методы, Топики, AssocEvaluationCallback Методы
 Ваши комментарии по поводу этого топика: Послать отзыв!