Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SymbolUtilityServices.RepairSymbolName
 Послать отзыв
 Метод обеспечивает "восстановление" входной строки - приведение её к виду, когда она гарантированно содержит только допустимые символы в соответствии с требованиями к расширенным именам символов.
 Синтаксис
C#
Visual Basic
Копировать Код
public static String RepairSymbolName( ref String oldName, bool allowVerticalBar );
Копировать Код
Public Shared Function RepairSymbolName( ByRef oldName As String, allowVerticalBar As Boolean ) As String
 Параметры
 Параметры
 Описание
 oldName
 Исходное имя символа, подлежащее восстановлению. Тип String.
 allowVerticalBar
 Флаг, определяющий, допускается ли в имени символа знак вертикальной черты ("|"). Тип bool.
 Возвращает
 Возвращает восстановленное имя символа. Тип String.
 Описание
 Метод обеспечивает "восстановление" входной строки - приведение её к виду, когда она гарантированно содержит только допустимые символы в соответствии с требованиями к расширенным именам символов. В случае обнаружения недопустимых знаков они заменяются допустимыми. Обработка входной строки выполняется аналогично методу ValidateSymbolName().
 Ссылки
 Teigha.DatabaseServices.SymbolUtilityServices, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!