Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.Dimlfac
 Послать отзыв
 Свойство задает или возвращает масштабный коэффициент для значений линейных размеров.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Dimlfac;
Копировать Код
Public Property Dimlfac As Double
 Возвращает
 Возвращает масштабный коэффициент для линейных размеров. Тип double.
 Описание
 Свойство задает или возвращает масштабный коэффициент для значений линейных размеров. Этот коэффициент представляет собой положительное число с плавающей точкой двойной точности, которое влияет на значение размера, но не влияет на значение допуска.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!