Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector3d.*
 Послать отзыв
 Оператор реализует умножение матрицы преобразования на 3D-вектор.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d operator * ( Matrix3d a, Vector3d b );
Копировать Код
Public Operator * ( a As Matrix3d, b As Vector3d )
 Параметры
 Параметры
 Описание
 a
 Левый операнд. Тип Matrix3d.
 b
 Правый операнд. Тип Vector3d.
 Возвращает
 Возвращает вектор, являющийся результатом геометрического преобразования. Тип Vector3d.
 Описание
 Оператор возвращает вектор, равный произведению матрицы a и вектора b, представленного в виде столбца.
 Ссылки
 Teigha.Geometry.Vector3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!