Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SweepOptionsBuilder.ScaleFactor
 Послать отзыв
 Свойство ScaleFactor представляет масштабный коэффициент операции вытягивания по траектории.
 Синтаксис
C#
Visual Basic
Копировать Код
public double ScaleFactor;
Копировать Код
Public Property ScaleFactor As Double
 Возвращает
 Возвращает масштабный коэффициент. Тип double.
 Описание
 Свойство ScaleFactor представляет масштабный коэффициент операции вытягивания по траектории.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.SweepOptionsBuilder, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!