Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Leader
 Послать отзыв
 Класс Leader представляет типовой геометрический объект "выноска".
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::GraphicsInterface::Drawable Teigha::DatabaseServices::DBObject Teigha::DatabaseServices::Entity Teigha::DatabaseServices::Curve Teigha::DatabaseServices::Leader
 Синтаксис
C#
Visual Basic
[TypeDescriptionProvider("Teigha.ComponentModel.TypeDescriptionProvider`1[[Teigha.DatabaseServices.Leader, TD_Mgd]], TD_Mgd"),Wrapper("AcDbLeader")] public class Leader : Curve;
<TypeDescriptionProvider("Teigha.ComponentModel.TypeDescriptionProvider`1[[Teigha.DatabaseServices.Leader, TD_Mgd]], TD_Mgd"),Wrapper("AcDbLeader")> Public Class Leader Inherits Curve
 Описание
 Класс Leader представляет типовой геометрический объект "выноска". Эти выноски следует отличать от выноск, доступных для создания пользователю nanoCAD, которые являются объектами библиотеки MultiCAD API. Выноски класса Leader воспринимаются в большинстве CAD-систем как стандартный объект "выноска", в то время как выноски MultiCAD API, при открытии в сторонних CAD-системах, часто преобразуются в прокси-объекты.
 Данные выноски считаются объектами, аналогичными размерам в nanoCAD, что означает, что они контролируются установками переменных размеров и размерными стилями.
 Данный класс содержит динамический массив точек, которые являются вершинами линии выноски. Первая точка массива является точкой начала выноски. Если выноска имеет наконечник в виде стрелки, то он располагается в этой точке. Если длина первого сегмента выноски меньше, чем двойной размер стрелки, стрелка подавляется. Если выноска имеет ассоциированный аннотационный объект, последняя точка выноски располагается около него.
 По умолчанию выноска состоит из сегментов прямых линий, но она может быть установлена соответствующей сплайну с этими же вершинами.
 Для обновления положения конечной точки выноски, относящейся к соответствующей аннотации, используйте метод EvaluateLeader(). Note Данный класс переопределяет метод Entity.SubSetDatabaseDefaults(), чтобы установить размерный стиль объекта к текущему стилю базы данных. Обычно объекты класса инициализируются с помощью вызова метода SetDatabaseDefaults() , следующему за вызовом SetDimstyleData(), используя данные, полученные при вызове метода DatabaseGetDimstyleData().
 Если выноска ассоциирована с аннотационным объектом, конечная точка выноски располагается так, чтобы присоединить аннотацию, поэтому заданная конечная точка массива игнорируется. Вы можете также заставить использовать указанную точку с помощью метода Leader.EvaluateLeader().
 Методы
 Конструкторы
 Teigha.GraphicsInterface.Drawable
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 Drawable
 Конструктор класса Teigha.GraphicsInterface.Drawable. (Унаследован от Drawable)
 Teigha.DatabaseServices.DBObject
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 DBObject
 Конструктор. (Унаследован от DBObject)
 Teigha.DatabaseServices.Leader
 Имя
 Описание
 Leader
 Это обзор перегрузок Leader.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.GraphicsInterface.Drawable
 Имя
 Описание
 Drawable Методы
 Ниже перечислены методы класса Drawable.
 Drawable Свойства
 Ниже перечислены свойства класса Drawable.
 Teigha.DatabaseServices.DBObject
 Имя
 Описание
 DBObject Методы
 Ниже перечислены методы класса DBObject.
 DBObject Свойства
 Ниже перечислены свойства класса DBObject.
 DBObject События
 Ниже перечислены события класса DBObject.
 Teigha.DatabaseServices.Entity
 Имя
 Описание
 Entity Методы
 Ниже перечислены методы класса Entity.
 Entity Свойства
 Ниже перечислены свойства класса Entity.
 Teigha.DatabaseServices.Curve
 Имя
 Описание
 Curve Методы
 Ниже перечислены методы класса Curve.
 Curve Свойства
 Ниже перечислены свойства класса Curve.
 Teigha.DatabaseServices.Leader
 Имя
 Описание
 Leader Методы
 Ниже перечислены методы класса Leader.
 Leader Свойства
 Ниже перечислены свойства класса Leader.
 Ссылки
 Leader Конструктор, Leader Методы, Leader Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства, DBObject События
 Ваши комментарии по поводу этого топика: Послать отзыв!