Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод LinetypeTableRecord.SetShapeNumberAt
 Послать отзыв
 Синтаксис
C#
Visual Basic
public void SetShapeNumberAt(int index, int shapeNumber);
Public Sub SetShapeNumberAt(index As Integer, shapeNumber As Integer)
 Параметры
 Параметры
 Описание
 index
 Индекс (начинающийся с 0) строки, для которой производится установка формы
 shapeNumber
 Идентификационный номер формы для вставляемой в строку формы
 Описание
 Этот метод задает для строки со значением индекса index встроенную форму с номером, заданным параметром shapeNumber (shapeNumber из файла формы). Если в строке не должна использоваться форма, значение shapeNumber должно быть равно 0.
 Значение index должно быть больше или равно 0, но меньше чем значение, возвращаемое LinetypeTableRecord.NumDashes. index представляет собой индекс, начинающийся с нуля, (формы и текстовые строки имеют тот же самый индекс, как и штриховка, предшествующая им в определении типа линии) с первым элементом типа линии, соответствующим индексу, равному 0.
 Для получения дополнительной информации об определении типа линии и длины штриховки, смотри раздел "Типы линий" в Инструкции пользователя по nanoCAD.
 Ссылки
 Teigha.DatabaseServices.LinetypeTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!