Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbCurve3d.MakeOpen
 Послать отзыв
 Метод делает замкнутый сплайн незамкнутым.
 Синтаксис
C#
Visual Basic
Копировать Код
public void MakeOpen();
Копировать Код
Public Sub MakeOpen()
 Описание
 Метод делает замкнутый сплайн незамкнутым.
 Возможны два варианта.
Если сплайн построен методом определяющих точек, он размыкается за счет удаления крайних определяющих точек.
Если сплайн построен методом управляющих вершин, он размыкается за счет удаления крайних управляющих вершин.
 Ссылки
 Teigha.Geometry.NurbCurve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!