Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CellRange.IsLinked
 Послать отзыв
 Свойство позволяет проверить наличие в ячейках диапазона внешних ссылок.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool? IsLinked;
Копировать Код
Public ReadOnly Property IsLinked As Boolean?
 Возвращает
 Возвращает true, если содержимое ячеек диапазона определяется внешними ссылками. В противном случае возвращает false.
 Описание
 Свойство позволяет проверить наличие в ячейках диапазона внешних ссылок.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.CellRange, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!