Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 ViewportTableRecord.IconEnabled
 Послать отзыв
 Свойство предназначено для изменения видимости значка системы координат в пространстве модели.
 Синтаксис
C#
Visual Basic
public bool IconEnabled;
Public Property IconEnabled() As bool
 Возвращает
 Возвращает тип данных bool:
true – значок системы координат отображается;
false – значок системы координат не отображается.
 Описание
 Свойство предназначено для изменения видимости значка системы координат в пространстве модели. Через интерфейс значение свойства можно изменить либо с помощью системной переменной UCSICON, либо с помощью команды UCSICON.
 Условия
 Чтение и запись.
 Ссылки
 ViewportTableRecord Класс, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!