Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Shape.Thickness
 Послать отзыв
 Свойство Thickness представляет толщину данного объекта как глубину выдавливания по нормали к плоскости объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Thickness;
Копировать Код
Public Property Thickness As Double
 Возвращает
 Возвращает толщину данного объекта. Тип double.
 Описание
 Свойство Thickness представляет толщину данного объекта как глубину выдавливания по нормали к плоскости объекта.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Shape, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!