Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Scale2d.X
 Послать отзыв
 Свойство X представляет масштабный коэффициент по оси X.
 Синтаксис
C#
Visual Basic
Копировать Код
public double X;
Копировать Код
Public ReadOnly Property X As Double
 Возвращает
 Возвращает значение масштабного коэффициента по оси X. Тип double.
 Описание
 Свойство X представляет масштабный коэффициент по оси X.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.Scale2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!