Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Solid3dMassProperties
 Послать отзыв
 Структура Solid3dMassProperties представляет массо-центровочные свойства трехмерного твёрдого тела.
 Иерархия классов
Teigha::DatabaseServices::Solid3dMassProperties
 Синтаксис
C#
Visual Basic
Копировать Код
[DefaultMember("PrincipalAxes")] public struct Solid3dMassProperties
Копировать Код
<DefaultMember("PrincipalAxes")> Public Structure Solid3dMassProperties
 Описание
 Структура Solid3dMassProperties представляет массо-центровочные свойства трехмерного твёрдого тела. Экземпляр этой структуры возвращает свойство Solid3d.MassProperties.
 Методы
 Конструкторы
 Имя
 Описание
 Solid3dMassProperties
 Конструктор класса Solid3dMassProperties.
 Топики
 Имя
 Описание
 Solid3dMassProperties Свойства
 Ниже перечислены свойства класса Solid3dMassProperties.
 Ссылки
 Solid3dMassProperties Свойства, Методы, Топики, Solid3dMassProperties Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!