Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CellRange.IsMergeAllEnabled
 Послать отзыв
 Свойство позволяет проверить, включен ли режим слияния всех ячеек диапазона.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool? IsMergeAllEnabled;
Копировать Код
Public Property IsMergeAllEnabled As Boolean?
 Возвращает
 Возвращает true, если режим слияния всех ячеек диапазона включен. В противном случае возвращает false.
 Описание
 Свойство позволяет проверить, включен ли режим слияния всех ячеек диапазона.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.CellRange, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!