Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Dimtih
 Послать отзыв
 Синтаксис
C#
Visual Basic
public bool Dimtih;
Public Property Dimtih() As bool
 Описание
 Возвращает или устанавливает текущее значение DIMTIH для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!