Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Arc.StartAngle
 Послать отзыв
 Свойство предназначено для хранения величины начального угла дуги в радианах.
 Синтаксис
C#
Visual Basic
public double StartAngle;
Public Property StartAngle() As Double
 Возвращает
 Тип данных double.
 Описание
 Устанавливает или возвращает начальный угол дуги, который должен быть в радианах.
 Замечания
 Угол отсчитывается от оси X OCS и является положительным при движении против часовой стрелки, если смотреть вниз по оси Z по направлению к центру системы координат. Ось X OCS определяется с использованием нормали к дуге, оси Z WCS и с помощью специального алгоритма задания осей nanoCAD.
 Если угол содержит отрицательное значение, дуга все еще рисуется против часовой стрелки, но рассчитывается в противоположном направлении. Например, дуга, заданная с углом в 4,7124 радиана (270 градусов) это тот же угол, что и -1,5708 (-90 градусов).
 Величина начального угла используется для DXF группового кода 50.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Arc, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!