Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.RasterImageDef
 Послать отзыв
 Класс является неграфической частью объекта "изображение" на чертеже.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::GraphicsInterface::Drawable Teigha::DatabaseServices::DBObject Teigha::DatabaseServices::RasterImageDef
 Синтаксис
C#
Visual Basic
[Wrapper("AcDbImage")] public class RasterImageDef : DBObject;
<Wrapper("AcDbImage")> Public Class RasterImageDef Inherits DBObject
 Описание
 Объект RasterImageDef (или "объект - определение изображения"), работает вместе с геометрическим объектом RasterImage (или "объект - изображение") для использования растровых изображений внутри nanoCAD. Отношение между двумя этими классами наиболее похоже на отношение между определением блока nanoCAD и геометрическим объектом, вставленным в блок.
 Объект - определение изображения играет "закулисную" роль определения блока, управляет связями с исходным изображением и управляет операциями низкого уровня с изображением, требуемыми для отображения и прорисовки изображения.
 Объекты - определение изображения хранятся в специальном словаре nanoCAD с именем ISM_RASTER_IMAGE_DICT. Они не являются геометрическими объектами nanoCAD, поэтому они не могут отображаться или выбираться конечными пользователями. Они понимают только 2D координаты, поэтому все запросы на обработку изображений отображаются как 2D операции.
 Операции обработки изображений, так же как масштабирование и поворот изображений при отображении, выполняются специальной компонентой nanoCAD (OdGiRasterImage). Эта компонента имеет свое собственное API , в котором могут быть реализованы сложные приложения редактирования изображений.
 Методы
 Конструкторы
 Teigha.GraphicsInterface.Drawable
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 Drawable
 Конструктор класса Teigha.GraphicsInterface.Drawable. (Унаследован от Drawable)
 Teigha.DatabaseServices.DBObject
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 DBObject
 Конструктор. (Унаследован от DBObject)
 Teigha.DatabaseServices.RasterImageDef
 Имя
 Описание
 RasterImageDef
 Это обзор перегрузок RasterImageDef.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.GraphicsInterface.Drawable
 Имя
 Описание
 Drawable Методы
 Ниже перечислены методы класса Drawable.
 Drawable Свойства
 Ниже перечислены свойства класса Drawable.
 Teigha.DatabaseServices.DBObject
 Имя
 Описание
 DBObject Методы
 Ниже перечислены методы класса DBObject.
 DBObject Свойства
 Ниже перечислены свойства класса DBObject.
 DBObject События
 Ниже перечислены события класса DBObject.
 Teigha.DatabaseServices.RasterImageDef
 Имя
 Описание
 RasterImageDef Методы
 Ниже перечислены методы класса RasterImageDef.
 RasterImageDef Свойства
 Ниже перечислены свойства класса RasterImageDef.
 Ссылки
 RasterImageDef Конструктор, RasterImageDef Методы, RasterImageDef Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства, DBObject События
 Ваши комментарии по поводу этого топика: Послать отзыв!