Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotSettings.PlotPaperMargins
 Послать отзыв
 Свойство PlotPaperMargins представляет поля бумаги, настроенные для этого объекта PlotSettings.
 Синтаксис
C#
Visual Basic
Копировать Код
public Extents2d PlotPaperMargins;
Копировать Код
Public ReadOnly Property PlotPaperMargins As Extents2d
 Возвращает
 Возвращает размеры полей бумаги. Тип Extents2d.
 Описание
 Свойство PlotPaperMargins представляет поля бумаги, настроенные для этого объекта PlotSettings. Поля измеряются от соответствующих краев физического носителя до области печати и не зависят от поворота при печати. Все расстояния представлены в миллиметрах независимо от единиц и текущего масштаба чертежа.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.PlotSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!