Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve3d.IsClosed
 Послать отзыв
 Метод проверяет, является ли данная кривая замкнутой в пределах заданного допуска.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsClosed( Tolerance tolerance );
Копировать Код
Public Function IsClosed( tolerance As Tolerance ) As Boolean
 Параметры
 Параметры
 Описание
 tolerance
 Допуск, в пределах которого проверяется совпадение концов кривой. Тип Tolerance.
 Возвращает
 Возвращает true, если кривая является замкнутой, и false в противном случае.
 Описание
 Метод проверяет,является ли данная кривая замкнутой в пределах заданного допуска. Фактически метод проверяет, совпадают ли начальная и конечная точки кривой в пределах заданного допуска.
 Ссылки
 Teigha.Geometry.Curve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!