Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CompoundObjectId.DxfOutFields
 Послать отзыв
 Метод предназначен для записи данных этого объекта в файл .dxf.
 Синтаксис
C#
Visual Basic
Копировать Код
public void DxfOutFields( ref DxfFiler filer, ref Database hostDatabase );
Копировать Код
Public Sub DxfOutFields( ByRef filer As DxfFiler, ByRef hostDatabase As Database )
 Параметры
 Параметры
 Описание
 filer
 Входной DXF-файлер, в который производится запись данных. Тип DxfFiler.
 hostDatabase
 Главная база данных. Тип Database.
 Описание
 Метод предназначен для записи данных этого объекта в файл .dxf с использованием переданного в метод объекта DxfFiler.
 Ссылки
 Teigha.DatabaseServices.CompoundObjectId, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!