Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DxfFiler.Database
 Послать отзыв
 Свойство предоставляет доступ к базе данных, связанной с данным объектом DxfFiler.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual DatabaseServices.Database Database;
Копировать Код
Public Overridable ReadOnly Property Database As DatabaseServices.Database
 Возвращает
 Возвращает базу данных. Тип DatabaseServices.Database.
 Описание
 Свойство предоставляет доступ к базе данных, связанной с данным объектом DxfFiler.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.DxfFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!