Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Dimgap
 Послать отзыв
 Синтаксис
C#
Visual Basic
public double Dimgap;
Public Property Dimgap() As Double
 Описание
 Возвращает или устанавливает текущее значение DIMGAP для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!