Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.Value
 Послать отзыв
 Метод позволяет получить тип содержимого указанной ячейки.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual Object Value( int row, int col );
Копировать Код
Public virtual Function Value( row As Integer, col As Integer ) As Object
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 col
 Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
 Возвращает
 Возвращает тип содержимого указанной ячейки. Тип Object.
 Описание
 Метод позволяет получить тип содержимого указанной ячейки. Ячейка задается индексами строки и столбца.
 Замечания
 Для получения того же результата предпочтительнее использовать Table.Cells[row,column].Contents(i).Value.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!