Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.TableStyle.BackgroundColor
 Послать отзыв
 Метод позволяет определить цвет фона в строке указанного типа.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual Teigha.Colors.Color BackgroundColor( RowType rowType );
Копировать Код
Public Overridable Function BackgroundColor( rowType As RowType ) As Teigha.Colors.Color
 Параметры
 Параметры
 Описание
 rowType
 Тип строки. Перечисление Тип RowType.
 Возвращает
 Возвращает цвет фона в строке. Тип Teigha.Colors.Color.
 Описание
 Метод позволяет определить цвет фона в строке указанного типа.
 Ссылки
 Teigha.DatabaseServices.TableStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!