Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.BackgroundColor
 Послать отзыв
 Метод определяет цвет фона ячеек в строках указанного типа.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual Color BackgroundColor( RowType type );
Копировать Код
Public virtual Function BackgroundColor( type As RowType ) As Color
 Параметры
 Параметры
 Описание
 type
 Тип строки из перечисления RowType.
 Возвращает
 Возвращает цвет фона ячейки в виде экземпляра класса Color.
 Описание
 Метод определяет цвет фона ячеек в строках указанного типа (строка наименования таблицы, строка с заголовками столбцов, строка данных). Если тип строки не указан, то по умолчанию используется тип DataRow - строка данных.
 Замечания
 Для получения того же результата предпочтительнее использовать функционал объекта Cell.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!