Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.dragvs
 Послать отзыв
 Синтаксис
C#
Visual Basic
public DatabaseServices::ObjectId dragvs;
Public Property dragvs() As DatabaseServices.ObjectId
 Описание
 Возвращает или устанавливает Id визуального стиля, заданного в DRAGVS для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!