Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.SurfaceSurfaceIntersectorConfigurations.==
 Послать отзыв
 Оператор равенства структуры SurfaceSurfaceIntersectorConfigurations.
 Синтаксис
C#
Visual Basic
Копировать Код
public static bool operator ==( SurfaceSurfaceIntersectorConfigurations a, SurfaceSurfaceIntersectorConfigurations b );
Копировать Код
Public Shared Operator =( a As SurfaceSurfaceIntersectorConfigurations, b As SurfaceSurfaceIntersectorConfigurations ) As Boolean
 Параметры
 Параметры
 Описание
 a
 Левый операнд. Тип SurfaceSurfaceIntersectorConfigurations.
 b
 Правый операнд. Тип SurfaceSurfaceIntersectorConfigurations.
 Возвращает
 Возвращает true, если выполняется условие равенства левого и правого операндов. В противном случае возвращает false.
 Описание
 Оператор равенства структуры SurfaceSurfaceIntersectorConfigurations.
 Замечания
 Условием равенства двух экземпляров данной структуры является одновременное выполнение всех перечисленных ниже условий:
Конфигурации для первых поверхностей слева от пересечений равны;
Конфигурации для первых поверхностей справа от пересечений равны;
Конфигурации для вторых поверхностей слева от пересечений равны;
Конфигурации для вторых поверхностей справа от пересечений равны;
Типы пересечений совпадают;
Размерности объектов пересечений совпадают.
 Ссылки
 Teigha.Geometry.SurfaceSurfaceIntersectorConfigurations, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!