Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Runtime.CommandMethodAttribute
 Послать отзыв
 Этот класс помечает экземпляр или статическую функцию как команду.
 Иерархия классов
Teigha::Runtime::CommandMethodAttribute
 Синтаксис
C#
Visual Basic
Копировать Код
[AttributeUsage(AttributeTargets.Method, AllowMultiple=true, Inherited=false)] public class CommandMethodAttribute : Attribute, ICommandLineCallable;
Копировать Код
<AttributeUsage(AttributeTargets.Method, AllowMultiple=true, Inherited=false)> Public Class CommandMethodAttribute Inherits Attribute Inherits ICommandLineCallable
 Описание
 Этот класс помечает экземпляр или статическую функцию как команду.
 Пример
 В качестве примера приведен командный метод CommandMethodAttributeExample(), который будет вызываться в nanoCAD по имени MyCommandMethod:
C#
 Копировать Код
// Класс, в котором располагается командный метод public partial class Commands { // Атрибут командного метода, где "MyCommandMethod" - имя команды, по которой метод будет вызван в nanoCAD. [Teigha.Runtime.CommandMethodAttribute("MyCommandMethod")] /* [Teigha.Runtime.CommandMethod("MyCommandMethod")] - также будет работать */ // Командный метод должен быть публичным и не должен ничего возвращать public void CommandMethodAttributeExample() { // Получение ссылки на активный документ HostMgd.ApplicationServices.Document doc = HostMgd.ApplicationServices.Application.DocumentManager.MdiActiveDocument; // Получение ссылки на редактор документа HostMgd.EditorInput.Editor ed = doc.Editor; // Вывод надписи в командную строку nanoCAD ed.WriteMessage("Hello, command method!"); } }
 В результате вызова команды можно будет увидеть в командной строке следующий результат:
 Методы
 Конструкторы
 Имя
 Описание
 CommandMethodAttribute
 Это обзор перегрузок CommandMethodAttribute.
 Топики
 Имя
 Описание
 CommandMethodAttribute Свойства
 Ниже перечислены свойства класса CommandMethodAttribute.
 Ссылки
 CommandMethodAttribute Конструктор, CommandMethodAttribute Свойства, Методы, Топики, CommandMethodAttribute Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!