Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Делегат Teigha.DatabaseServices.BeginInsertEventHandler
 Послать отзыв
 This is type Teigha::DatabaseServices::BeginInsertEventHandler.
 Синтаксис
C#
Visual Basic
public delegate BeginInsertEventHandler();
Public Delegate Sub BeginInsertEventHandler()
 Ваши комментарии по поводу этого топика: Послать отзыв!