Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DxfFiler.DwgVersion
 Послать отзыв
 Свойство обеспечивает доступ к текущей версии чертежа.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual FullDwgVersion DwgVersion;
Копировать Код
Public Overridable ReadOnly Property DwgVersion As FullDwgVersion
 Возвращает
 Возвращает версию чертежа. Тип FullDwgVersion.
 Описание
 Свойство обеспечивает доступ к текущей версии чертежа.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.DxfFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!