Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbCurve3d.GetFitPointAt
 Послать отзыв
 Метод предоставляет определяющую точку с указанным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d GetFitPointAt( int index );
Копировать Код
Public Function GetFitPointAt( index As Integer ) As Point3d
 Параметры
 Параметры
 Описание
 index
 Индекс определяющей точки. Тип int.
 Возвращает
 Возвращает определяющую точку с индексом index. Тип Point3d.
 Описание
 Метод предоставляет определяющую точку с указанным индексом.
 Ссылки
 Teigha.Geometry.NurbCurve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!