Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MeshFaceterData.FaceterGridRatio
 Послать отзыв
 Свойство представляет максимальное соотношение сторон у четырехугольников сети.
 Синтаксис
C#
Visual Basic
Копировать Код
public double FaceterGridRatio;
Копировать Код
Public Property FaceterGridRatio As Double
 Возвращает
 Возвращает максимальное соотношение сторон у четырехугольников сети. Тип double.
 Описание
 Свойство представляет максимальное соотношение сторон у четырехугольников сети (grid quads).
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MeshFaceterData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!