Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Entity2d.IsEqualTo
 Послать отзыв
 Метод позволяет проверить равен ли данный объект указанному объекту. Используется точность по умолчанию.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsEqualTo( ref Entity2d entity );
Копировать Код
Public Function IsEqualTo( ByRef entity As Entity2d ) As Boolean
 Параметры
 Параметры
 Описание
 entity
 Входной объект, с которым выполняется сравнение. Тип Entity2d.
 Возвращает
 Возвращает true в случае равенства объектов, т.е. оба объекта имеют один тип, совпадающие наборы точек в пределах указанной точности и одинаковую параметризацию. В противном случае возвращает false.
 Описание
 Метод позволяет проверить равен ли данный объект указанному объекту. Вызывается метод Entity2d.IsEqualTo(Entity2d entity, Tolerance tolerance) с использованием точности по умолчанию, которая равна Tolerance.Global.
 Ссылки
 Teigha.Geometry.Entity2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!