Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve3dCollection.Item
 Послать отзыв
 Свойство Item представляет элемент коллекции с указанным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public Curve3d this[int index];
Копировать Код
Default Public Property Item( Param As Integer ) As Curve3d
 Параметры
 Параметры
 Описание
 index
 Входной индекс элемента коллекции. Тип int.
 Возвращает
 Возвращает элемент коллекции с указанным индексом. Тип Curve3d.
 Описание
 Свойство Item представляет элемент коллекции с указанным индексом.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.Geometry.Curve3dCollection, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!