Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Viewport.BackClipDistance
 Послать отзыв
 Свойство BackClipDistance представляет расстояние до задней плоскости отсечения для данного видового экрана.
 Синтаксис
C#
Visual Basic
Копировать Код
public double BackClipDistance;
Копировать Код
Public Property BackClipDistance As Double
 Возвращает
 Возвращает расстояние до задней плоскости отсечения. Тип double.
 Описание
 Свойство BackClipDistance представляет расстояние до задней плоскости отсечения для данного видового экрана. В случае использования этой плоскости всякая геометрия позади задней плоскости отсечения не отображается.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Viewport, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!