Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AbstractViewTableRecord.UcsOrthographic
 Послать отзыв
 Свойство UcsOrthographic представляет ортогональный вид, связанный с UCS.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.OrthographicView UcsOrthographic;
Копировать Код
Public ReadOnly Property UcsOrthographic As DatabaseServices.OrthographicView
 Возвращает
 Возвращает ортогональный вид, связанный с UCS. Значение из перечисления DatabaseServices.OrthographicView.
 Описание
 Свойство UcsOrthographic представляет ортогональный вид, связанный с пользовательской системой координат (ПСК, UCS).
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.AbstractViewTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!