Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve2d.IsLinear
 Послать отзыв
 Метод проверяет линейность данной кривой с указанной геометрической точностью.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsLinear( out Line2d line, Tolerance tolerance );
Копировать Код
Public Function IsLinear( ByRef line As Line2d, tolerance As Tolerance ) As Boolean
 Параметры
 Параметры
 Описание
 line
 Выходная линия, совпадающая с данной кривой. Тип Line2d. Содержит значимый объект, только если метод возвращает true.
 tolerance
 Заданная геометрическая точность. Тип Tolerance.
 Возвращает
 Возвращает true, если в пределах указанной точности tolerance данную кривую можно считать линейной. В противном случае возвращает false.
 Описание
 Метод проверяет, можно ли считать данную кривую линейной в пределах указанной геометрической точности. В случае линейности кривой метод возвращает совпадающую с кривой линию.
 Ссылки
 Teigha.Geometry.Curve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!