Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Group.Group
 Послать отзыв
 Конструктор по умолчанию класса Group.
 Синтаксис
C#
Visual Basic
Копировать Код
public Group();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса Group.
 Ссылки
 Teigha.DatabaseServices.Group, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!