Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.EllipticalArc3d.MajorAxis
 Послать отзыв
 Свойство MajorAxis представляет направление большой оси данной эллиптической дуги.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d MajorAxis;
Копировать Код
Public ReadOnly Property MajorAxis As Vector3d
 Возвращает
 Возвращает направление большой оси эллиптической дуги. Тип Vector3d.
 Описание
 Свойство MajorAxis представляет направление большой оси данной эллиптической дуги.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.EllipticalArc3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!