Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Surface.DistanceTo
 Послать отзыв
 Метод вычисляет минимальное расстояние от заданной точки до этой поверхности с заданной точностью.
 Синтаксис
C#
Visual Basic
Копировать Код
public double DistanceTo( Point3d point, Tolerance tolerance );
Копировать Код
Public Function DistanceTo( point As Point3d, tolerance As Tolerance ) As Double
 Параметры
 Параметры
 Описание
 point
 Входная точка, минимальное расстояние до которой требуется определить. Тип Point3d.
 tolerance
 Заданная геометрическая точность. Тип Tolerance.
 Возвращает
 Возвращает минимальное расстояние от точки point до данной поверхности. Тип double.
 Описание
 Метод вычисляет минимальное расстояние между заданной точкой point и этой поверхностью. Используется переданная в метод точность tolerance.
 Ссылки
 Teigha.Geometry.Surface, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!