Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Polyline
 Послать отзыв
 Класс представляет объект "полилиния" на чертеже.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::GraphicsInterface::Drawable Teigha::DatabaseServices::DBObject Teigha::DatabaseServices::Entity Teigha::DatabaseServices::Curve Teigha::DatabaseServices::Polyline
 Синтаксис
C#
Visual Basic
[TypeDescriptionProvider("Teigha.ComponentModel.TypeDescriptionProvider`1[[Teigha.DatabaseServices.Polyline, TD_Mgd]], TD_Mgd"),Wrapper("AcDbPolyline")] public class Polyline : Curve;
<TypeDescriptionProvider("Teigha.ComponentModel.TypeDescriptionProvider`1[[Teigha.DatabaseServices.Polyline, TD_Mgd]], TD_Mgd"),Wrapper("AcDbPolyline")> Public Class Polyline Inherits Curve
 Описание
 Полилинию часто называют легкой полилинией из-за эффективного использования памяти этим классом. Класс Polyline обеспечивает высокую производительность и уменьшение накладных расходов по сравнению с классом Polyline2d. Представление класса Polyline в базе данных является более эффективным из-за хранения единого объекта со своим единственным именем, типом, слоями, шириной и т.д.
 "Легкая" полилиния — это:
сегменты прямых линий;
сегменты дуг;
постоянная или изменяемая ширина;
толщина.
 Функциональность и использование в командах при работе с "легкой" полилинией не включает в себя:
данных для сглаживания дуг кривой;
данных для проведение сплайна;
данных для проведения касательной.
 "Легкая" полилиния создается командой PLINE и редактируется командой PEDIT. При создании или редактировании полилинии, командные опции для команд PLINE или PEDIT остаются теми же, что и для предыдущих версий.
 Команда PEDIT редактирует "Легкие" полилинии так же, как и Polyline2d в предыдущих версиях. Если опции «Сплайн» или «Сглаживание» включены, то "легкая" полилиния преобразуется в Polyline2d для продолжения редактирования. Дескриптор всегда поддерживается и не меняется. Просто дескриптор "легкой" полилинии становится дескриптором Polyline2d (заголовок геометрического объекта для старого стиля геометрических объектов полилиний, которые содержат подобъекты).
 Поведение ручек аналогично поведению ручек для Polyline2d. Поведение команд редактирования nanoCAD также остается таким же.
 Свойства "легких" полилиний включают цвет, слой, тип линии, линейный масштаб, ширину, толщину. Все свойства применяются к объекту целиком и не могут меняться между отдельными сегментами. Note Класс Polyline переопределяет метод Entity.SaveAs(). Метод Polyline.SaveAs() не вызывает метод WorldDraw() геометрического объекта и не рисует графику для прокси. Поэтому, вы должны разработать свой собственный метод для создания графики, когда nanoCAD получает прокси-графику для любых объектов вашего класса.
 Количество вершин "легкой" полилинии должно быть больше одной. Полилиния с 0 или 1 вершинами не может быть отправлена или оставлена в базе данных.
 Методы
 Конструкторы
 Teigha.GraphicsInterface.Drawable
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 Drawable
 Конструктор класса Teigha.GraphicsInterface.Drawable. (Унаследован от Drawable)
 Teigha.DatabaseServices.DBObject
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 DBObject
 Конструктор. (Унаследован от DBObject)
 Teigha.DatabaseServices.Polyline
 Имя
 Описание
 Polyline
 Это обзор перегрузок Polyline.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.GraphicsInterface.Drawable
 Имя
 Описание
 Drawable Методы
 Ниже перечислены методы класса Drawable.
 Drawable Свойства
 Ниже перечислены свойства класса Drawable.
 Teigha.DatabaseServices.DBObject
 Имя
 Описание
 DBObject Методы
 Ниже перечислены методы класса DBObject.
 DBObject Свойства
 Ниже перечислены свойства класса DBObject.
 DBObject События
 Ниже перечислены события класса DBObject.
 Teigha.DatabaseServices.Entity
 Имя
 Описание
 Entity Методы
 Ниже перечислены методы класса Entity.
 Entity Свойства
 Ниже перечислены свойства класса Entity.
 Teigha.DatabaseServices.Curve
 Имя
 Описание
 Curve Методы
 Ниже перечислены методы класса Curve.
 Curve Свойства
 Ниже перечислены свойства класса Curve.
 Teigha.DatabaseServices.Polyline
 Имя
 Описание
 Polyline Методы
 Ниже перечислены методы класса Polyline.
 Polyline Свойства
 Ниже перечислены свойства класса Polyline.
 Ссылки
 Polyline Конструктор, Polyline Методы, Polyline Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства, DBObject События
 Ваши комментарии по поводу этого топика: Послать отзыв!