Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Light.ResultingColor
 Послать отзыв
 Метод позволяет получить окончательный цвет источника света как результат смешивания цвета лампы и цвета фильтра.
 Синтаксис
C#
Visual Basic
Копировать Код
public Colors.Color ResultingColor();
Копировать Код
Public Function ResultingColor() As Colors.Color
 Возвращает
 Возвращает итоговый цвет источника света. Тип Colors.Color.
 Описание
 Метод позволяет получить окончательный цвет источника света как результат смешивания цвета лампы и цвета фильтра.
 Ссылки
 Teigha.DatabaseServices.Light, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!