Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Entity2d.Mirror
 Послать отзыв
 Метод выполняет зеркальное отображение данного объекта относительно указанной 2D-линии.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Mirror( ref Line2d line );
Копировать Код
Public Sub Mirror( ByRef line As Line2d )
 Параметры
 Параметры
 Описание
 line
 Ось зеркального отображения. Тип Line2d.
 Описание
 Метод выполняет зеркальное отображение данного объекта относительно указанной 2D-линии.
 Ссылки
 Teigha.Geometry.Entity2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!