Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocArrayRectangularParameters.YAxisDirection
 Послать отзыв
 Свойство обеспечивает доступ к направлению столбцов массива.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d YAxisDirection;
Копировать Код
Public Property YAxisDirection() As Vector3d
 Возвращает
 Возвращает направление столбцов массива. Тип Vector3d.
 Описание
 Свойство обеспечивает доступ к направлению столбцов массива (направление оси Y массива).
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.AssocArrayRectangularParameters, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!