Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Sphere.SetAnglesInU
 Послать отзыв
 Метод переопределяет параметрический диапазон данной сферической поверхности по долготе (параметр U).
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetAnglesInU( double startAngle, double endAngle );
Копировать Код
Public Sub SetAnglesInU( startAngle As Double, endAngle As Double )
 Параметры
 Параметры
 Описание
 startAngle
 Новое значение начальной долготы, которая определяется параметром U. Тип double. В случае полной (замкнутой) сферы этот угол должен быть равен -PI/2 .
 endAngle
 Новое значение конечной долготы, которая определяется параметром U. Тип double. В случае полной (замкнутой) сферы этот угол должен быть равен +PI/2 .
 Описание
 Метод переопределяет параметрический диапазон данной сферической поверхности по долготе (параметр U).
 Ссылки
 Teigha.Geometry.Sphere, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!