Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CellRange.SetDataLink
 Послать отзыв
 Метод позволяет задать внешнюю ссылку для ячеек этого диапазона.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetDataLink( ObjectId dataLinkId, bool bUpdate );
Копировать Код
Public Sub SetDataLink( dataLinkId As ObjectId, bUpdate As Boolean )
 Параметры
 Параметры
 Описание
 dataLinkId
 Идентификатор объекта внешней ссылки. Тип ObjectId.
 bUpdate
 Флаг, определяющий, следует ли после установки обновить данные по этой внешней ссылке. Тип bool.
 Описание
 Метод позволяет задать внешнюю ссылку для ячеек этого диапазона.
 Ссылки
 Teigha.DatabaseServices.CellRange, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!