Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CubicSplineCurve2d.Create
 Послать отзыв
 Метод создает объект CubicSplineCurve2d на основе переданного указателя.
 Синтаксис
C#
Visual Basic
Копировать Код
public static CubicSplineCurve2d Create( IntPtr unmanagedPointer, bool autoDelete );
Копировать Код
Public Shared Function Create( unmanagedPointer As IntPtr, autoDelete As Boolean ) As CubicSplineCurve2d
 Параметры
 Параметры
 Описание
 unmanagedPointer
 Неуправляемый указатель на исходный объект. Тип IntPtr.
 autoDelete
 Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.
 Возвращает
 Возвращает созданный двумерный кубический сплайн. Тип CubicSplineCurve2d.
 Описание
 Метод создает объект CubicSplineCurve2d на основе переданного указателя.
 Ссылки
 Teigha.Geometry.CubicSplineCurve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!