Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Splframe
 Послать отзыв
 Синтаксис
C#
Visual Basic
public bool Splframe;
Public Property Splframe() As bool
 Описание
 Обеспечивает доступ к текущему значению SPLFRAME для базы данных. Значение false соответствует 0. Значение true — 1.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!