Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotSettings.PlotViewportBorders
 Послать отзыв
 Свойство PlotViewportBorders позволяет определить, должны ли отображаться границы видового экрана согласно настройкам этого объекта PlotSettings.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool PlotViewportBorders;
Копировать Код
Public Property PlotViewportBorders As Boolean
 Возвращает
 Возвращает true, если границы отображаться должны. В противном случае возвращает false.
 Описание
 Свойство PlotViewportBorders позволяет определить, должны ли отображаться границы видового экрана согласно настройкам этого объекта PlotSettings.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.PlotSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!