Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DwgFiler.ReadHardPointerId
 Послать отзыв
 Метод предназначен для получения идентификатора жесткого указателя (HardPointerId) из текущего элемента данного объекта Filer.
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract ObjectId ReadHardPointerId();
Копировать Код
Public MustOverride Function ReadHardPointerId() As ObjectId
 Возвращает
 Возвращает идентификатор жесткого указателя (HardPointerId). Тип ObjectId.
 Описание
 Метод предназначен для получения идентификатора жесткого указателя (HardPointerId) из текущего элемента данного объекта Filer.
 Ссылки
 Teigha.DatabaseServices.DwgFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!