Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Mline.RemoveLastSegment
 Послать отзыв
 Метод удаляет текущую последнюю вершину данной мультилинии, что приводит к удалению последнего сегмента объекта Mline, и возвращает новую последнюю вершину мультилинии.
 Синтаксис
C#
Visual Basic
Копировать Код
public void RemoveLastSegment( out Point3d lastVertex );
Копировать Код
Public Sub RemoveLastSegment( ByRef lastVertex As [Out] Point3d )
 Параметры
 Параметры
 Описание
 lastVertex
 Точка новой последней вершины мультилинии. Тип Point3d.
 Описание
 Метод удаляет текущую последнюю вершину данной мультилинии, что приводит к удалению последнего сегмента объекта Mline, и возвращает новую последнюю вершину мультилинии.
 Ссылки
 Teigha.DatabaseServices.Mline, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!