Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbCurve2d.NurbCurve2d
 Послать отзыв
 Конструктор класса NurbCurve2d. Создает двумерную полиномиальную кривую, которая в пределах указанной точности интерполирует заданный массив двумерных определяющих точек.
 Синтаксис
C#
Visual Basic
Копировать Код
public NurbCurve2d( ref Point2dCollection fitPoints, ref Vector2dCollection fitTangents, Tolerance fitTolerance, bool periodic );
Копировать Код
Public Sub New( ByRef fitPoints As Point2dCollection, ByRef fitTangents As Vector2dCollection, fitTolerance As Tolerance, periodic As Boolean )
 Параметры
 Параметры
 Описание
 fitPoints
 Массив определяющих двумерных точек, которые подлежат интерполяции. Тип Point2dCollection.
 fitTangents
 Векторы, интерполирующие производные кривой в определяющих точках. Тип Vector2dCollection.
 fitTolerance
 Входная точность интерполяции. Тип Tolerance.
 periodic
 Флаг, определяющий, должна ли создаваемая кривая быть периодической (замкнутой). Тип bool.
 Описание
 Создает двумерную полиномиальную кривую, которая в пределах указанной точности интерполирует заданный массив двумерных определяющих точек. Кривая опционально может быть замкнутой.
 Замечания
 Если флаг periodic равен true, должны совпадать первая и последняя определяющие точки в коллекции fitPoints, а также первый и последний векторы производных в коллекции fitTangents.
 Ссылки
 Teigha.Geometry.NurbCurve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!