Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Interval.UpperBound
 Послать отзыв
 Свойство UpperBound представляет верхнюю границу данного интервала.
 Синтаксис
C#
Visual Basic
Копировать Код
public double UpperBound;
Копировать Код
Public ReadOnly Property UpperBound As Double
 Возвращает
 Возвращает верхнюю границу данного интервала. Тип double.
 Описание
 Свойство UpperBound представляет верхнюю границу данного интервала.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.Interval, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!