Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Viewport.SetUcs
 Послать отзыв
 Метод позволяет задать пользовательскую систему координат, связанную с этим видовым экраном.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetUcs( DatabaseServices.ObjectId userCoordinateSystemId );
Копировать Код
Public Sub SetUcs( userCoordinateSystemId As DatabaseServices.ObjectId )
 Параметры
 Параметры
 Описание
 userCoordinateSystemId
 Идентификатор объекта UCS. Тип DatabaseServices.ObjectId.
 Описание
 Метод позволяет задать пользовательскую систему координат (ПСК, UCS), связанную с этим видовым экраном.
 Ссылки
 Teigha.DatabaseServices.Viewport, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!