Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Lunits
 Послать отзыв
 Синтаксис
C#
Visual Basic
public int Lunits;
Public Property Lunits() As Integer
 Описание
 Возвращает или устанавливает текущее значение LUNITS для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!