Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод LinetypeTableRecord.SetShapeOffsetAt
 Послать отзыв
 Синтаксис
C#
Visual Basic
public void SetShapeOffsetAt(int index, Vector2d offset);
Public Sub SetShapeOffsetAt(index As Integer, offset As Vector2d)
 Параметры
 Параметры
 Описание
 index
 Индекс (начинающийся с 0) строки, для которой производится установка смещения
 offset
 Вектор, значения X и Y которого являются WCS координатами X и Y смещения формы
 Описание
 Этот метод устанавливает для строки LinetypeTableRecord со значением индекса index значения смещения X и Y для формы (или текстовой строки) из координат X и Y параметра offset. Если в строке не должна использоваться форма, значения X и Y параметра offset должны быть 0.0.
 Значение index должно быть больше или равно 0, но меньше чем значение, возвращаемое LinetypeTableRecord.NumDashes. index представляет собой индекс, начинающийся с нуля (формы и текстовые строки имеют тот же самый индекс, как и штриховка, предшествующая им в определении типа линии) с первым элементом типа линии, соответствующим индексу, равному 0.
 Для получения дополнительной информации об определении типа линии и длины штриховки, смотри раздел "Типы линий" в Инструкции пользователя по nanoCAD.
 Ссылки
 Teigha.DatabaseServices.LinetypeTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!