Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Wipeout.SetFrom
 Послать отзыв
 Метод позволяет задать ориентацию и границу данной маски.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetFrom( ref Point2dCollection points, Vector3d normal );
Копировать Код
Public Sub SetFrom( ByRef points As Point2dCollection, normal As Vector3d )
 Параметры
 Параметры
 Описание
 points
 Коллекция 2D-точек, которые определяют новую границу данной маски. Тип Point2dCollection.
 normal
 Вектор нормали плоскости границы. Тип Vector3d.
 Описание
 Метод позволяет задать ориентацию и границу данной маски. Граница определяется массивом двумерных вершин, а ориентация - вектором нормали плоскости границы.
 Ссылки
 Teigha.DatabaseServices.Wipeout, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!