Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.PointOnSurface.GetPoint
 Послать отзыв
 Метод переопределяет параметрические 2D-координаты связанной с данным объектом точки поверхности и возвращает соответствующую точку в 3D-пространстве моделирования.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d GetPoint( Point2d point );
Копировать Код
Public Function GetPoint( point As Point2d ) As Point3d
 Параметры
 Параметры
 Описание
 point
 Новые параметрические координаты точки на поверхности. Тип Point2d. Координата point.x определяет значение параметра точки по оси u, а координата point.y - значение параметра по оси v.
 Возвращает
 Возвращает точку в 3D-пространстве моделирования, которой соответствует точка point в пространстве параметров. Тип Point3d.
 Описание
 Метод переопределяет параметрические 2D-координаты связанной с данным объектом точки поверхности и возвращает соответствующую точку в 3D-пространстве моделирования.
 Ссылки
 Teigha.Geometry.PointOnSurface, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!