Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocArrayPolarParameters.AngleBetweenItems
 Послать отзыв
 Свойство обеспечивает доступ к углу между соседними элементами кругового массива.
 Синтаксис
C#
Visual Basic
Копировать Код
public double AngleBetweenItems;
Копировать Код
Public Property AngleBetweenItems() As Double
 Возвращает
 Возвращает угол в радианах между соседними элементами кругового массива. Тип double.
 Описание
 Свойство обеспечивает доступ к углу в радианах между базовыми точками соседних элементов кругового массива.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.AssocArrayPolarParameters, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!