Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.TableEnumerator
 Послать отзыв
 Класс TableEnumerator представляет перечислитель для таблицы.
 Иерархия классов
Teigha::DatabaseServices::TableEnumerator
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract class TableEnumerator : IEnumerator
Копировать Код
Public MustInherit Class TableEnumerator Implements IEnumerator
 True if the current enumerator item is in the table (its index does not exceed the table), false if it is out of table bounds.
 Описание
 Класс TableEnumerator представляет перечислитель для таблицы.
 Топики
 Имя
 Описание
 TableEnumerator Методы
 Ниже перечислены методы класса TableEnumerator.
 Ссылки
 TableEnumerator Методы, Топики, TableEnumerator Методы
 Ваши комментарии по поводу этого топика: Послать отзыв!