Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.Dimadec
 Послать отзыв
 Свойство позволяет задать или получить количество десятичных знаков после запятой в значениях угловых размеров и угловых отклонений.
 Синтаксис
C#
Visual Basic
Копировать Код
public int Dimadec;
Копировать Код
Public Property Dimadec As Integer
 Возвращает
 Возвращает количество десятичных знаков после запятой в значениях угловых размеров и угловых отклонений. Тип int.
 Описание
 Свойство позволяет задать или получить количество десятичных знаков после запятой в значениях угловых размеров и угловых отклонений.
 Значение
 Описание
 0-8
 Задает количество десятичных знаков после запятой в угловых размерах (независимо от текущего значения свойства Dimdec).
 -1
 Количество десятичных знаков после запятой в угловых размерах определяется свойством Dimdec.
 Это свойство действует только в том случае, если для свойства Dimtol установлено значение true.
 Замечания
 См. также Teigha.DatabaseServices.Dimension.Dimdec.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!