Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Filters.SpatialFilterDefinition.Normal
 Послать отзыв
 Свойство Normal возвращает положительное направление выдавливания 2D-контура области фильтра.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d Normal;
Копировать Код
Public ReadOnly Property Normal As Vector3d
 Возвращает
 Возвращает вектор направления выдавливания. Тип Vector3d.
 Описание
 Свойство Normal возвращает положительное направление выдавливания 2D-контура области фильтра.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Filters.SpatialFilterDefinition, Teigha.DatabaseServices.Filters
 Ваши комментарии по поводу этого топика: Послать отзыв!