Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.XrefGraph.HostDrawing
 Послать отзыв
 Свойство HostDrawing представляет корневой узел графа внешних ссылок, связанный с главным чертежом.
 Синтаксис
C#
Visual Basic
Копировать Код
public XrefGraphNode HostDrawing;
Копировать Код
Public ReadOnly Property HostDrawing As XrefGraphNode
 Возвращает
 Возвращает корневой узел графа внешних ссылок, связанный с главным чертежом. Тип XrefGraphNode.
 Описание
 Свойство HostDrawing представляет корневой узел графа внешних ссылок, связанный с главным чертежом.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.XrefGraph, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!