Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.XrefFullSubentityPath.DwgIn
 Послать отзыв
 Метод считывает данные для этого объекта в формате .dwg из указанного файлера.
 Синтаксис
C#
Visual Basic
Копировать Код
public void DwgIn( ref DatabaseServices.DwgFiler inputFiler );
Копировать Код
Public Sub DwgIn( ByRef inputFiler As DatabaseServices.DwgFiler )
 Параметры
 Параметры
 Описание
 inputFiler
 Файлер, из которого считываются данные. Тип DatabaseServices.DwgFiler.
 Описание
 Метод считывает данные для этого объекта в формате .dwg из указанного файлера.
 Ссылки
 Teigha.DatabaseServices.XrefFullSubentityPath, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!