Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.PointOnCurve2d.PointOnCurve2d
 Послать отзыв
 Конструктор по умолчанию класса PointOnCurve2d.
 Синтаксис
C#
Visual Basic
Копировать Код
public PointOnCurve2d();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса PointOnCurve2d. Создает экземпляр класса с точкой, которая не лежит ни на одной кривой и имеет значение параметра 0.
 Ссылки
 Teigha.Geometry.PointOnCurve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!