Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve3d.GetArea
 Послать отзыв
 Метод вычисляет площадь под кривой на заданном параметрическом интервале.
 Синтаксис
C#
Visual Basic
Копировать Код
public double GetArea( double startingParameter, double endingParameter );
Копировать Код
Public Function GetArea( startingParameter As Double, endingParameter As Double ) As Double
 Параметры
 Параметры
 Описание
 startingParameter
 Значение параметра начальной точки интервала. Тип double.
 endingParameter
 Значение параметра конечной точки интервала (должно превышать значение startParameter). Тип double.
 Возвращает
 Возвращает площадь под кривой. Тип double.
 Описание
 Метод вычисляет площадь, которая определяется параметрическим интервалом кривой с указанными параметрами начальной и конечной точек кривой. Используется вызов Curve3d.GetArea(Double startParameter, Double endParameter, Tolerance tolerance) с допуском, равным Global.
 Ссылки
 Teigha.Geometry.Curve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!