Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MText.LineBreak
 Послать отзыв
 Свойство возвращает строку разрыва строки "p".
 Синтаксис
C#
Visual Basic
Копировать Код
public static String LineBreak;
Копировать Код
Public Shared ReadOnly Property LineBreak As String
 Возвращает
 Возвращает строку, означающую разрыв строки. Тип String.
 Описание
 Свойство возвращает строку разрыва строки "p". Может использоваться вместо строковой константы "p", чтобы сделать код более понятным. При использовании в строке, возвращаемой свойством MText.Contents, "p" означает разрыв строки.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.MText, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!