Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 BlockTableRecord.PreviewIcon
 Послать отзыв
 Свойство предназначено для хранения иконки предпросмотра блока.
 Синтаксис
C#
Visual Basic
Копировать Код
public System.Drawing.Bitmap PreviewIcon { get; set; }
Копировать Код
Public Property PreviewIcon As System.Drawing.Bitmap
 Возвращает
 Тип данных System.Drawing.Bitmap
 Описание
 Иконка предпросмотра блока.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.BlockTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!