Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SymbolUtilityServices.ValidateCompatibleSymbolName
 Послать отзыв
 Метод позволяет проверить, удовлетворяет ли заданная строка требованиям, предъявляемым к имени символа (в частности, приемлема ли её длина).
 Синтаксис
C#
Visual Basic
Копировать Код
public static ErrorStatus ValidateCompatibleSymbolName( ref String name, bool isNewName, bool allowVerticalBar, bool compatibilityMode );
Копировать Код
Public Shared Function ValidateCompatibleSymbolName( ByRef name As String, isNewName As Boolean, allowVerticalBar As Boolean, compatibilityMode As Boolean ) As ErrorStatus
 Параметры
 Параметры
 Описание
 name
 Проверяемое имя. Тип String.
 isNewName
 Флаг, определяющий, следует ли рассматривать name как имя нового символа или как имя уже существующего. Тип bool.
 allowVerticalBar
 Флаг, определяющий, допускается ли в имени символа знак вертикальной черты ("|"). Тип bool.
 compatibilityMode
 Флаг, определяющий, должно ли входное имя name проверяться на соответствие расширенным или устаревшим правилам. Тип bool.
 Возвращает
 Возвращает ErrorStatus.OK, если проверка прошла успешно, или соответствующий код ошибки в противном случае. Тип ErrorStatus.
 Описание
 Метод позволяет проверить, удовлетворяет ли заданная строка требованиям, предъявляемым к имени символа. В частности, проверяется, не превышена ли длина имени.
 Если isNewName имеет значение true, имя проверяется на соответствие требованиям к имени нового символа. В противном случае оно проверяется на соответствие требованиям существующего имени символа.
 Если compatibilityMode имеет значение true, то используются правила для расширенного имени символа. В противном случае проверяется старый формат имен (т.е. 31 символ без пробелов, буквы, цифры, знаки доллара, подчеркивания и дефиса).
 Заметим, что применяемые правила определяются текущим значением системной переменной EXTNAMES. Если EXTNAMES=1, используются расширенные правила, а если EXTNAMES=0, то старые правила.
 Если allowVerticalBar имеет значение true, в имени символа разрешен знак вертикальной черты.
 Ссылки
 Teigha.DatabaseServices.SymbolUtilityServices, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!