Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MeshFaceterData.FaceterMeshType
 Послать отзыв
 Свойство представляет геометрический тип граней сети (треугольные, четырехугольные, гибридный (смешанный) тип).
 Синтаксис
C#
Visual Basic
Копировать Код
public short FaceterMeshType;
Копировать Код
Public Property FaceterMeshType As Short
 Возвращает
 Возвращает геометрический тип граней сети. Тип short.
 Описание
 Свойство представляет геометрический тип граней сети:
0 - Только четырехугольные грани.
1 - Гибридный (смешанный) тип, когда допускаются как треугольные, так и четырехугольные грани.
2 - Только треугольные грани.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MeshFaceterData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!