Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.StandardScaleType
 Послать отзыв
 Данное перечисление определяет типы стандартных масштабов для объекта настроек печати.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum StandardScaleType { ScaleToFit = 0, CustomScale = 1, Scale1To1 = 2, Scale1To2 = 3, Scale1To4 = 4, Scale1To5 = 5, Scale1To8 = 6, Scale1To10 = 7, Scale1To16 = 8, Scale1To20 = 9, Scale1To30 = 10, Scale1To40 = 11, Scale1To50 = 12, Scale1To100 = 13, Scale2To1 = 14, Scale4To1 = 15, Scale8To1 = 16, Scale10To1 = 17, Scale100To1 = 18, Scale1To128inAnd1ft = 19, Scale1To64inchAnd1ft = 20, Scale1To32inchAnd1ft = 21, Scale1To16inchAnd1ft = 22, Scale3To32inchAnd1ft = 23, Scale1To8inchAnd1ft = 24, Scale3To16inchAnd1ft = 25, Scale1To4inchAnd1ft = 26, Scale3To8inchAnd1ft = 27, Scale1To2inchAnd1ft = 28, Scale3To4inchAnd1ft = 29, Scale1inAnd1ft = 30, Scale3inAnd1ft = 32, Scale6inAnd1ft = 33, Scale1ftAnd1ft = 34 }
Копировать Код
Public Enum StandardScaleType ScaleToFit = 0 CustomScale = 1 Scale1To1 = 2 Scale1To2 = 3 Scale1To4 = 4 Scale1To5 = 5 Scale1To8 = 6 Scale1To10 = 7 Scale1To16 = 8 Scale1To20 = 9 Scale1To30 = 10 Scale1To40 = 11 Scale1To50 = 12 Scale1To100 = 13 Scale2To1 = 14 Scale4To1 = 15 Scale8To1 = 16 Scale10To1 = 17 Scale100To1 = 18 Scale1To128inAnd1ft = 19 Scale1To64inchAnd1ft = 20 Scale1To32inchAnd1ft = 21 Scale1To16inchAnd1ft = 22 Scale3To32inchAnd1ft = 23 Scale1To8inchAnd1ft = 24 Scale3To16inchAnd1ft = 25 Scale1To4inchAnd1ft = 26 Scale3To8inchAnd1ft = 27 Scale1To2inchAnd1ft = 28 Scale3To4inchAnd1ft = 29 Scale1inAnd1ft = 30 Scale3inAnd1ft = 32 Scale6inAnd1ft = 33 Scale1ftAnd1ft = 34 End Enum
 Члены
 Члены
 Описание
 CustomScale
 Значение: 1. Масштаб не является стандартным.
 Scale100To1
 Значение: 18. Масштаб 100:1.
 Scale10To1
 Значение: 17. Масштаб 10:1.
 Scale1ftAnd1ft
 Значение: 34. Масштаб 1' = 1' в британских единицах.
 Scale1inAnd1ft
 Значение: 30. Масштаб 1" = 1' в британских единицах.
 Scale1To1
 Значение: 2. Масштаб 1:1.
 Scale1To10
 Значение: 7. Масштаб 1:10.
 Scale1To100
 Значение: 13. Масштаб 1:100.
 Scale1To128inAnd1ft
 Значение: 19. Масштаб 1/128" = 1' в британских единицах.
 Scale1To16
 Значение: 8. Масштаб 1:16.
 Scale1To16inchAnd1ft
 Значение: 22. Масштаб 1/16" = 1' в британских единицах.
 Scale1To2
 Значение: 3. Масштаб 1:2.
 Scale1To20
 Значение: 9. Масштаб 1:20.
 Scale1To2inchAnd1ft
 Значение: 28. Масштаб 1/2" = 1' в британских единицах.
 Scale1To30
 Значение: 10. Масштаб 1:30.
 Scale1To32inchAnd1ft
 Значение: 21. Масштаб 1/32" = 1' в британских единицах.
 Scale1To4
 Значение: 4. Масштаб 1:4.
 Scale1To40
 Значение: 11. Масштаб 1:40.
 Scale1To4inchAnd1ft
 Значение: 26. Масштаб 1/4" = 1' в британских единицах.
 Scale1To5
 Значение: 5. Масштаб 1:5.
 Scale1To50
 Значение: 12. Масштаб 1:50.
 Scale1To64inchAnd1ft
 Значение: 20. Масштаб 1/64" = 1' в британских единицах.
 Scale1To8
 Значение: 6. Масштаб 1:8.
 Scale1To8inchAnd1ft
 Значение: 24. Масштаб 1/8" = 1' в британских единицах.
 Scale2To1
 Значение: 14. Масштаб 2:1.
 Scale3inAnd1ft
 Значение: 32. Масштаб 3" = 1' в британских единицах.
 Scale3To16inchAnd1ft
 Значение: 25. Масштаб 3/16" = 1' в британских единицах.
 Scale3To32inchAnd1ft
 Значение: 23. Масштаб 3/32" = 1' в британских единицах.
 Scale3To4inchAnd1ft
 Значение: 29. Масштаб 3/4" = 1' в британских единицах.
 Scale3To8inchAnd1ft
 Значение: 27. Масштаб 3/8" = 1' в британских единицах.
 Scale4To1
 Значение: 15. Масштаб 4:1.
 Scale6inAnd1ft
 Значение: 33. Масштаб 6" = 1' в британских единицах.
 Scale8To1
 Значение: 16. Масштаб 8:1.
 ScaleToFit
 Значение: 0. Масштабирование в размер.
 Описание
 Данное перечисление определяет типы стандартных масштабов печати для объекта настроек печати. Они используются вместе с другой информацией (например, размеры области печати), для вычисления PlotSettings.CustomPrintScale, когда свойство PlotSettings.UseStandardScale имеет значение true.
 Ваши комментарии по поводу этого топика: Послать отзыв!