Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LinkedTableData.SetColumnName
 Послать отзыв
 Метод позволяет задать имя столбца.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetColumnName( int index, ref String name );
Копировать Код
Public Overridable Sub SetColumnName( index As Integer, ByRef name As String )
 Параметры
 Параметры
 Описание
 index
 Индекс столбца. Тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице.
 name
 Новое имя столбца. Тип String. Может быть пустым.
 Описание
 Метод позволяет задать имя столбца.
 Ссылки
 Teigha.DatabaseServices.LinkedTableData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!