Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ObjectOverrule.DeepClone
 Послать отзыв
 Метод вызывает соответствующий метод OdDbObjectOverrule.DeepClone().
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual DBObject DeepClone( ref DBObject dbObject, ref DBObject ownerObject, ref IdMapping idMap, bool isPrimary );
Копировать Код
Public virtual Function DeepClone( ByRef dbObject As DBObject, ByRef ownerObject As DBObject, ByRef idMap As IdMapping, isPrimary As Boolean ) As DBObject
 Параметры
 Параметры
 Описание
 dbObject
 Объект DBObject базы данных, к которому применяется переопределение.
 ownerObject
 Объект DBObject базы данных, к которому следует добавить клоны.
 idMap
 Текущий идентификатор мэппинга IdMapping.
 isPrimary
 Флаг, указывающий, является ли данный объект первичным или дочерним. Тип bool.
 Возвращает
 Возвращает склонированный объект базы данных, тип DBObject.
 Описание
 Метод вызывает соответствующий метод OdDbObjectOverrule.DeepClone().
 Ссылки
 Teigha.DatabaseServices.ObjectOverrule, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!