Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Cell.Cell
 Послать отзыв
 Конструктор класса Cell. Создает ячейку в указанной таблице в заданных строке и столбце.
 Синтаксис
C#
Visual Basic
Копировать Код
public Cell( ref Table table, int row, int column );
Копировать Код
Public Sub New( ByRef table As Table, row As Integer, column As Integer )
 Параметры
 Параметры
 Описание
 table
 Таблица, в которой создается ячейка. Тип Table.
 row
 Индекс строки таблицы. Тип int.
 column
 Индекс столбца таблицы. Тип int.
 Описание
 Конструктор класса Cell. Создает ячейку в указанной таблице в заданных строке и столбце.
 Ссылки
 Teigha.DatabaseServices.Cell, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!