Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.RenderGlobal.ProcedureAndDestination
 Послать отзыв
 Свойство ProcedureAndDestination представляет тип контента и направление вывода для рендеринга.
 Синтаксис
C#
Visual Basic
Копировать Код
public ProcedureAndDestinationParameter ProcedureAndDestination;
Копировать Код
Public Property ProcedureAndDestination As ProcedureAndDestinationParameter
 Возвращает
 Возвращает текущее значение свойства как объект типа ProcedureAndDestinationParameter.
 Описание
 Свойство ProcedureAndDestination представляет тип контента и направление вывода для рендеринга.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.RenderGlobal, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!