Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MentalRayRenderSettings.EnergyMultiplier
 Послать отзыв
 Свойство EnergyMultiplier представляет энергетический множитель для управления величиной непрямого освещения.
 Синтаксис
C#
Visual Basic
Копировать Код
public float EnergyMultiplier;
Копировать Код
Public Property EnergyMultiplier As Single
 Возвращает
 Возвращает текущее значение энергетического множителя. Тип float.
 Описание
 Свойство EnergyMultiplier представляет текущее значение энергетического множителя для управления величиной непрямого освещения.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MentalRayRenderSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!