Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MlineStyle.StartAngle
 Послать отзыв
 Свойство представляет угол скоса торцевого ограничителя на начальном торце мультилинии.
 Синтаксис
C#
Visual Basic
Копировать Код
public double StartAngle;
Копировать Код
Public Property StartAngle As Double
 Возвращает
 Возвращает угол скоса торцевого ограничителя (в радианах). Тип double.
 Описание
 Свойство представляет угол скоса торцевого ограничителя на начальном торце мультилинии. Измеряется в радианах. Значение по умолчанию равно pi/2 рад.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MlineStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!