Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FileDependencyInfo.IsModified
 Послать отзыв
 Свойство IsModified позволяет проверить, была ли изменена база данных с момента последнего сохранения файла.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsModified;
Копировать Код
Public ReadOnly Property IsModified As Boolean
 Возвращает
 Возвращает true, если база данных была изменена с момента последнего сохранения файла. В противном случае возвращает false.
 Описание
 Свойство IsModified позволяет проверить, была ли изменена база данных с момента последнего сохранения файла.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.FileDependencyInfo, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!