Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.Dimaltrnd
 Послать отзыв
 Свойство позволяет задать или получить действительное число, используемое для округления линейных размеров в альтернативных единицах измерения (но не допусков).
 Синтаксис
C#
Visual Basic
Копировать Код
public double Dimaltrnd;
Копировать Код
Public Property Dimaltrnd As double
 Возвращает
 Возвращает единицу округления размеров. Тип double.
 Описание
 Свойство позволяет задать или получить действительное число, используемое для округления линейных размеров в альтернативных единицах измерения (но не допусков). Работает при условии, что свойство Dimalt возвращает значение true.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!