Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MentalRayRenderSettings.PhotonTraceDepth
 Послать отзыв
 Свойство PhotonTraceDepth представляет максимальную глубину (уровень рекурсии) при трассировке фотонов.
 Синтаксис
C#
Visual Basic
Копировать Код
public MentalRayRenderSettingsTraitsTraceParameter PhotonTraceDepth;
Копировать Код
Public Property PhotonTraceDepth As MentalRayRenderSettingsTraitsTraceParameter
 Возвращает
 Возвращает максимальную глубину (уровень рекурсии) при трассировке фотонов. Тип MentalRayRenderSettingsTraitsTraceParameter.
 Описание
 Свойство PhotonTraceDepth представляет максимальную глубину (уровень рекурсии) при трассировке фотонов.
 Параметр MentalRayRenderSettingsTraitsTraceParameter хранит значения для максимальных уровней рекурсии фотонов отражения, фотонов преломления, а также суммарно фотонов отражения и преломления.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MentalRayRenderSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!