Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Entity.IntersectWith(Entity
 Послать отзыв
 Метод IntersectWith находит точки пересечения между текущим геометрическим объектом и указанным объектом entityPointer, учитывая тип пересечения intersectType и проекционную плоскость. Найденные точки добавляются в коллекцию points в мировых координатах (WCS), а параметры thisGraphicSystemMarker и otherGraphicSystemMarker позволяют ограничить поиск пересечений конкретными подобъектами (или игнорируются, если установлены в 0).
 Синтаксис
C#
Visual Basic
Копировать Код
[Obsolete("Use the overload taking IntPtr instead.")] public void IntersectWith(Entity entityPointer, Intersect intersectType, Plane projectionPlane, Point3dCollection points, int thisGraphicSystemMarker, int otherGraphicSystemMarker);
Копировать Код
<Obsolete("Use the overload taking IntPtr instead.")> Public Sub IntersectWith(entityPointer As Entity, intersectType As Intersect, points As Point3dCollection, thisGraphicSystemMarker As Integer, otherGraphicSystemMarker As Integer)
 Параметры
 Параметры
 Описание
 entityPointer
 Геометрический объект, пересечения с которым ищутся для текущего объекта. Тип Entity
 intersectType
 Тип пересечения. Тип Intersect
 projectionPlane
 Плоскость проекции, используемая при вычислении пересечений. Тип Plane
 points
 Массив, в который добавляются точки пересечения. Тип Point3dCollection
 thisGraphicSystemMarker
 GS маркер геометрических подобъектов "данного" объекта, которые участвуют в операции пересечения. Используйте 0 по умолчанию, если этот параметр не требуется. Тип int
 otherGraphicSystemMarker
 GS маркер геометрических подобъектов объекта entityPointer, которые участвуют в операции пересечения. Используйте 0 по умолчанию, если этот параметр не требуется. Тип int
 Описание
 Использование метода
 Этот метод ищет пересечение точек геометрического объекта entityPointer и всех ребер ограничивающего параллелепипеда данного геометрического объекта.
 Параметр intersectType предназначен для того, чтобы определить, использовать ли продолжение геометрических объектов для расчета пересечений.
 Любые найденные точки пересечений добавляются в массив точек. Все точки записываются в WCS координатах.
 Параметры thisGraphicSystemMarker и otherGraphicSystemMarker предназначены для обеспечения метода информацией, позволяющей ограничить поиск пересечений определенными графическими подобъектами.
 Этот метод не требует использования всех этих параметров (большинство, если не все, классов для встроенных геометрический объектов nanoCAD этого не делают). При вызове данного метода, один или оба параметра могут быть установлены в 0 для указания того, что они не должны использоваться.
 Выполнение метода в производных классах
 Этот метод должен сделать все, что нужно для нахождения точек пересечения геометрического объекта, из которого он вызван и геометрическим объектом entityPointer. Все найденные точки пересечений добавляются в массив точек. Все точки записываются в WCS координатах.
 При разработке порядка вычисления пересечений в методе вы должны внимательно посмотреть графические классы, чтобы найти полезную функциональность, помогающую в поиске пересечений на основе геометрических примитивов, составляющих геометрический объект, для которого вызывается метод и/или составляющих entityPointer.
 Например, класс Curve3d содержит метод IsOn(), который показывает, находится ли точка на кривой, а класс CircularArc3d содержит несколько методов IntersectWith() для нахождения пересечений с другими графическими типами.
 Если геометрический объект entityPointer имеет тип, не определяемый этим методом, является довольно разумным вызывать метод IntersectWith() геометрического объекта entityPointer, передав ему в качестве параметра указатель на данный объект как "entityPointer" и передав ему все остальные параметры данного вызова (не забудьте, если это необходимо, конвертировать тип параметра intType), чтобы попробовать найти точки пересечения. Это именно то, что делают встроенные в nanoCAD классы.
 Также, не забывайте принимать во внимание значение параметра intersectType. Этот параметр определяет, какой, никакой или оба из геометрических объектов могут быть расширены для нахождения "допустимых" пересечений. Не является обязательным поддержка таких пересечений.
 Параметры thisGraphicSystemMarker и otherGraphicSystemMarker позволяют методу точно определить, какие геометрические подобъекты участвуют в операции пересечения (например, если этот метод вызван nanoCAD как часть для операции объектной привязки пересечением, эти параметры показывают, какие геометрические подобъекты есть внутри границ объектной привязки). Для этих параметров значения, меньшие или равные 0 указывают, что они не используются.
 Ссылки
 Teigha.DatabaseServices.Entity, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!