Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.RecomputeTableBlock
 Послать отзыв
 Данный метод обновляет запись блока таблицы, на которую ссылается объект Table, чтобы отразить любые изменения, внесенные в объект Table с момента последнего обновления этой записи в базе данных документа.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void RecomputeTableBlock( bool forceUpdate );
Копировать Код
Public virtual Sub RecomputeTableBlock( forceUpdate As Boolean )
 Параметры
 Параметры
 Описание
 forceUpdate
 Флаг принудительного обновления записи блока таблицы в базе данных документа.
 Описание
 Данный метод обновляет запись блока таблицы, на которую ссылается объект Table, чтобы отразить любые изменения, внесенные в объект Table с момента последнего обновления этой записи в базе данных документа.
 Если аргумент forceUpdate принимает значение true, то запись блока таблицы будет обновлена независимо от того, произошли ли какие-либо изменения в объекте Table с момента последнего обновления этой записи. Если же forceUpdate имеет значение false, то запись блока таблицы будет обновлена только в том случае, если объект Table был изменён с момента его открытия, в настоящее время не стёрт и не находится в процессе операции отмены изменений.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!