Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Point3d.!=
 Послать отзыв
 Оператор неравенства класса Point3d. Возвращает true в случае несовпадения координат сравниваемых точек.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool operator != ( Point3d a, Point3d b );
Копировать Код
Public Operator != ( a As Point3d, b As Point3d )
 Параметры
 Параметры
 Описание
 a
 Левый операнд. Тип Point3d.
 b
 Правый операнд. Тип Point3d.
 Возвращает
 Возвращает true в случае несовпадения координат сравниваемых точек, иначе - false.
 Описание
 Оператор неравенства класса Point3d. Возвращает true в случае несовпадения координат сравниваемых точек.
 Ссылки
 Teigha.Geometry.Point3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!