Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.CurrentMeasurement
 Послать отзыв
 Свойство возвращает величину данного размера в указанных единицах измерения как значение с плавающей точкой двойной точности.
 Синтаксис
C#
Visual Basic
Копировать Код
public double CurrentMeasurement;
Копировать Код
Public Property CurrentMeasurement As Double
 Возвращает
 Возвращает текущее значение размера. Тип double.
 Описание
 Свойство возвращает величину данного размера в указанных единицах измерения как значение с плавающей точкой двойной точности. Для линейных размеров — это длина, для угловых размеров — это угол.
 Замечания
 Это значение изменять нельзя. Объекты Dimension лишь возвращают его, но не пересчитывают.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!