Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AbstractViewTableRecord.Width
 Послать отзыв
 Свойство Width представляет ширину объекта TableRecord в координатах дисплея (DCS).
 Синтаксис
C#
Visual Basic
Копировать Код
public double Width;
Копировать Код
Public Property Width As Double
 Возвращает
 Возвращает ширину объекта TableRecord в координатах DCS. Тип double.
 Описание
 Свойство Width представляет ширину объекта TableRecord в координатах дисплея (DCS).
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.AbstractViewTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!