Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AttributeReference.MTextAttribute
 Послать отзыв
 Свойство позволяет получить или задать значение объекта MText, который представляет многострочный атрибут.
 Синтаксис
C#
Visual Basic
Копировать Код
public MText MTextAttribute;
Копировать Код
Public Property MTextAttribute() As MText
 Возвращает
 Возвращает объект MText многострочного атрибута.
 Описание
 Свойство позволяет получить или задать значение объекта MText, который представляет многострочный атрибут.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.AttributeReference, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!