Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Ellipse.MajorRadius
 Послать отзыв
 Свойство MajorRadius возвращает длину большой полуоси эллипса или эллиптической дуги.
 Синтаксис
C#
Visual Basic
Копировать Код
public double MajorRadius;
Копировать Код
Public ReadOnly Property MajorRadius As Double
 Возвращает
 Возвращает длину большой полуоси эллипса. Тип double.
 Описание
 Свойство MajorRadius возвращает длину большой полуоси эллипса или эллиптической дуги.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Ellipse, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!