Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AbstractViewPE.SetViewport
 Послать отзыв
 Метод переопределяет координаты левого нижнего и правого верхнего углов связанного видового экрана.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetViewport( Point2d lowerLeft, Point2d upperRight );
Копировать Код
Public Sub SetViewport( lowerLeft As Point2d, upperRight As Point2d )
 Параметры
 Параметры
 Описание
 lowerLeft
 Координаты левого нижнего угла. Тип Point2d.
 upperRight
 Координаты правого верхнего угла. Тип Point2d.
 Описание
 Метод переопределяет координаты левого нижнего и правого верхнего углов связанного видового экрана.
 Замечания
Точка (0.0, 0.0) соответствует левому нижнему углу графической области.
Точка (1.0, 1.0) соответствует правому верхнему углу графической области.
 Ссылки
 Teigha.DatabaseServices.AbstractViewPE, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!