Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeader.GetDogleg
 Послать отзыв
 Метод предоставляет направление полки для указанного кластера выносной линии.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d GetDogleg( int leaderIndex );
Копировать Код
Public Function GetDogleg( leaderIndex As Integer ) As Vector3d
 Параметры
 Параметры
 Описание
 leaderIndex
 индекс кластера выносной линии. Тип int.
 Возвращает
 Возвращает направление полки. Тип Vector3d.
 Описание
 Метод предоставляет направление полки для кластера выносной линии с указанным индексом.
 Ссылки
 Teigha.DatabaseServices.MLeader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!