Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FieldEvaluationStatusResult.FieldEvaluationStatusResult
 Послать отзыв
 Конструктор класса FieldEvaluationStatusResult. Только для внутреннего использования.
 Синтаксис
C#
Visual Basic
Копировать Код
public FieldEvaluationStatusResult( FieldEvaluationStatus s, int e, ref String m );
Копировать Код
Public Sub New( s As FieldEvaluationStatus, e As Integer, ByRef m As String )
 Параметры
 Параметры
 Описание
 s
 Статус вычисления поля. Значение из перечисления FieldEvaluationStatus.
 e
 Код ошибки. Тип int.
 m
 Сообщение об ошибке. Тип String.
 Описание
 Конструктор класса FieldEvaluationStatusResult. Только для внутреннего использования.
 Ссылки
 Teigha.DatabaseServices.FieldEvaluationStatusResult, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!