Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.LineSegment3d.LineSegment3d
 Послать отзыв
 Конструктор класса LineSegment3d. Создает экземпляр класса с указанными параметрами. Создает линейный сегмент с началом в указанной точке, направление и длина которого определяются заданным вектором.
 Синтаксис
C#
Visual Basic
Копировать Код
public LineSegment3d( Point3d point1, Vector3d vector );
Копировать Код
Public Sub New( point1 As Point3d, vector As Vector3d )
 Параметры
 Параметры
 Описание
 point1
 Начальная точка линейного сегмента. Тип Point3d.
 vector
 Направляющий вектор линейного сегмента. Тип Vector3d. Определяет как направление, так и конечную точку линейного сегмента. Не может быть нулевой длины.
 Описание
 Конструктор класса LineSegment3d. Создает экземпляр класса с указанными параметрами. Создает линейный сегмент с началом в указанной точке, направление и длина которого определяются заданным вектором.
 Ссылки
 Teigha.Geometry.LineSegment3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!