Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Interval.Length
 Послать отзыв
 Свойство Length возвращает длину данного интервала, если он ограничен, и -1 в противном случае.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Length;
Копировать Код
Public ReadOnly Property Length As Double
 Возвращает
 Возвращает длину данного интервала, если он ограничен, и -1 в противном случае. Тип double.
 Описание
 Свойство Length возвращает длину данного интервала, если он ограничен, и -1 в противном случае.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.Interval, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!