Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Entity.MaterialMapper
 Послать отзыв
 Свойство предназначено для получения или установки объекта-маппера, который определяет, как текстура материала отображается на поверхности геометрического объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public Mapper MaterialMapper;
Копировать Код
Public Property MaterialMapper() As Mapper
 Возвращает
 Возвращает экземпляр класса Mapper, задающий параметры проекции текстуры материала на объект — такие как масштаб, смещение и ориентация.
 Описание
 Свойство предназначено для получения или установки объекта-маппера, который определяет, как текстура материала отображается на поверхности геометрического объекта.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Entity, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!