Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Database.AttachXref
 Послать отзыв
 Синтаксис
C#
Visual Basic
public ObjectId AttachXref(ref String fileName, ref String blockName);
Public Function AttachXref(ByRef fileName As String, ByRef blockName As String) As ObjectId
 Параметры
 Параметры
 Описание
 fileName
 Путь файла внешней ссылки
 blockName
 Имя блока, используемое для файла внешней ссылки
 Описание
 Присоединяет файл внешней ссылки, определяемый параметром fileName в базу данных, после чего создает новую запись в BlockTableRecord для внешней ссылки. Имя новой записи таблицы блоков задается в параметре blockName. Возвращается Id объекта.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!