Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Делегат Teigha.DatabaseServices.IdMappingEventHandler
 Послать отзыв
 This is type Teigha::DatabaseServices::IdMappingEventHandler.
 Синтаксис
C#
Visual Basic
public delegate IdMappingEventHandler();
Public Delegate Sub IdMappingEventHandler()
 Ваши комментарии по поводу этого топика: Послать отзыв!