Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbSurface.SingularityInU
 Послать отзыв
 Свойство SingularityInU представляет одно из значений NurbSurfaceProperties, которое является характеристикой сингулярности поверхности в направлении U.
 Синтаксис
C#
Visual Basic
Копировать Код
public int SingularityInU;
Копировать Код
Public ReadOnly Property SingularityInU As Integer
 Возвращает
 Возвращает значение NurbSurfaceProperties, являющееся характеристикой сингулярности поверхности в направлении U. Тип int.
 Описание
 Свойство SingularityInU представляет одно из значений NurbSurfaceProperties, которое является характеристикой сингулярности поверхности в направлении U.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.NurbSurface, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!