Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AbstractViewPE.Elevation
 Послать отзыв
 Свойство Elevation представляет возвышение плоскости ПСК (UCS) для связанного видового экрана.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Elevation;
Копировать Код
Public Property Elevation As Double
 Возвращает
 Возвращает возвышение для видового экрана. Тип double.
 Описание
 Свойство Elevation представляет возвышение плоскости ПСК (UCS) для связанного видового экрана.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.AbstractViewPE, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!