Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод LinetypeTableRecord.ShapeScaleAt
 Послать отзыв
 Синтаксис
C#
Visual Basic
public double ShapeScaleAt(int index);
Public Function ShapeScaleAt(index As Integer) As Double
 Параметры
 Параметры
 Описание
 index
 Индекс (начинающийся с 0) строки, для которой производится определение масштаба
 Описание
 Этот метод возвращает используемый масштаб для строки LinetypeTableRecord со значением индекса index. Если в строке нет формы, то масштаб должен быть 1.0.
 Ссылки
 Teigha.DatabaseServices.LinetypeTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!