Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotStyleDescriptor
 Послать отзыв
 Данный класс инкапсулирует значение перечисления PlotStyleNameType и идентификатор объекта связанной записи в словаре имен стилей печати.
 Иерархия классов
Teigha::DatabaseServices::PlotStyleDescriptor
 Синтаксис
C#
Visual Basic
Копировать Код
[StructLayout(LayoutKind.Sequential)] public class PlotStyleDescriptor;
Копировать Код
<StructLayout(LayoutKind.Sequential)> Public Class PlotStyleDescriptor
 Описание
 Данный класс инкапсулирует значение перечисления PlotStyleNameType и идентификатор объекта связанной записи в словаре имен стилей печати.
 Методы
 Конструкторы
 Имя
 Описание
 PlotStyleDescriptor
 Конструктор. Создает новый объект PlotStyleDescriptor.
 Топики
 Имя
 Описание
 PlotStyleDescriptor Методы
 Ниже перечислены методы класса PlotStyleDescriptor.
 PlotStyleDescriptor Операторы
 Ниже перечислены операторы класса PlotStyleDescriptor.
 PlotStyleDescriptor Свойства
 Ниже перечислены свойства класса PlotStyleDescriptor.
 Ссылки
 PlotStyleDescriptor Методы, PlotStyleDescriptor Операторы, PlotStyleDescriptor Свойства, Методы, Топики, PlotStyleDescriptor Методы, PlotStyleDescriptor Операторы, PlotStyleDescriptor Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!