Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Circle.Center
 Послать отзыв
 Синтаксис
C#
Visual Basic
public Point3d Center;
Public Property Center() As Point3d
 Описание
 Возвращает или устанавливает точку центра.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Circle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!