Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.HatchLoop.Polyline
 Послать отзыв
 Свойство возвращает полилинию, которая образует данный контур штриховки.
 Синтаксис
C#
Visual Basic
Копировать Код
public BulgeVertexCollection Polyline;
Копировать Код
Public ReadOnly Property Polyline As BulgeVertexCollection
 Возвращает
 Возвращает полилинию в виде коллекции типа BulgeVertexCollection.
 Описание
 Свойство возвращает полилинию, которая образует данный контур штриховки.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.HatchLoop, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!