Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GripData.ModeKeywordsDisabled
 Послать отзыв
 Свойство предоставляет возможность отключить активацию ключевых слов.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool ModeKeywordsDisabled;
Копировать Код
Public Property ModeKeywordsDisabled As Boolean
 Возвращает
 Возвращает true, если активация ключевых слов отключена. В противном случае возвращает false.
 Описание
 Свойство предоставляет возможность отключить активацию ключевых слов.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.GripData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!