Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.RenderGlobal.Procedure
 Послать отзыв
 Данное перечисление определяет доступные для рендеринга типы визуального контента (процедуры рендеринга).
 Синтаксис
C#
Visual Basic
Копировать Код
public enum Procedure { View = 0, Crop = 1, Selected = 2 }
Копировать Код
Public Enum Procedure View = 0 Crop = 1 Selected = 2 End Enum
 Члены
 Члены
 Описание
 View
 Значение: 0. Рендерится вид целиком.
 Crop
 Значение: 1. Рендерится только вырезанная пользователем прямоугольная область на виде.
 Selected
 Значение: 2. Рендерится только множество выделенных на виде объектов.
 Описание
 Данное перечисление определяет доступные для рендеринга типы визуального контента (процедуры рендеринга).
 Ваши комментарии по поводу этого топика: Послать отзыв!