Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LayerStateManager.RenameLayerState
 Послать отзыв
 Метод переименовывает состояние слоя.
 Синтаксис
C#
Visual Basic
Копировать Код
public void RenameLayerState( ref String name, ref String newName );
Копировать Код
Public Function RenameLayerState( ByRef name As String, ByRef newName As String )
 Параметры
 Параметры
 Описание
 name
 Имя существующего состояния слоя, String.
 newName
 Новое имя состояния слоя, String.
 Описание
 Метод переименовывает состояние слоя. Состоянию слоя с именем name присваивается новое имя newName.
 Ссылки
 Teigha.DatabaseServices.LayerStateManager, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!