Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.ExternalBoundedSurface.ExternalSurfaceDefinition
 Послать отзыв
 Свойство ExternalSurfaceDefinition представляет определение внешней поверхности, связанной с данным объектом.
 Синтаксис
C#
Visual Basic
Копировать Код
public IntPtr ExternalSurfaceDefinition;
Копировать Код
Public ReadOnly Property ExternalSurfaceDefinition As IntPtr
 Возвращает
 Возвращает указатель на определение внешней поверхности. Тип IntPtr.
 Описание
 Свойство ExternalSurfaceDefinition представляет определение внешней поверхности, связанной с данным объектом.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.ExternalBoundedSurface, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!