Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SubDMesh.SetPyramid
 Послать отзыв
 Метод предназначен для создания сети в виде пирамиды.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetPyramid( double radius, double height, int divLength, int divHeight, int divCap, int nSides, double radiusRatio, int smoothLevel );
Копировать Код
Public Sub SetPyramid( radius As double, height As double, divLength As Integer, divHeight As Integer, divCap As Integer, nSides As Integer, radiusRatio As double, smoothLevel As Integer )
 Параметры
 Параметры
 Описание
 radius
 Радиус окружности, вписанной в основание пирамиды, double.
 height
 Высота пирамиды, double.
 divLength
 Определяет количество разделений в направлении длины, int.
 divHeight
 Определяет количество разделений в направлении высоты пирамиды, int.
 divCap
 Определяет количество разделений в базовой грани, int.
 nSides
 Количество граней у пирамиды, int.
 radiusRatio
 Отношение большого радиуса к малому, double.
 smoothLevel
 Степень сглаживания сети, int.
 Описание
 Метод предназначен для создания сети в виде пирамиды.
 Ссылки
 Teigha.DatabaseServices.SubDMesh, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!