Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.RevolvedSurface.RevolvedSurface
 Послать отзыв
 Конструктор по умолчанию класса RevolvedSurface.
 Синтаксис
C#
Visual Basic
Копировать Код
public RevolvedSurface();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса RevolvedSurface.
 Ссылки
 Teigha.DatabaseServices.RevolvedSurface, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!