Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeader.LeaderCount
 Послать отзыв
 Свойство представляет количество выносных линий у этой мультивыноски. В текущей версии не реализовано. Рекомендуется использовать метод GetLeaderIndexes.
 Синтаксис
C#
Visual Basic
Копировать Код
[Obsolete( "Use GetLeaderIndexes instead" )] public int LeaderCount;
Копировать Код
<Obsolete( "Use GetLeaderIndexes instead" )> Public ReadOnly Property LeaderCount As Integer
 Возвращает
 Возвращает количество выносных линий. Тип int.
 Описание
 Свойство представляет количество выносных линий у этой мультивыноски. В текущей версии не реализовано. Рекомендуется использовать метод GetLeaderIndexes
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.MLeader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!