Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotStyleTableChangedEventArgs.Id
 Послать отзыв
 Свойство Id представляет идентификатор объекта изменённого листа.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectId Id;
Копировать Код
Public ReadOnly Property Id As ObjectId
 Возвращает
 Возвращает идентификатор объекта изменённого листа. Тип ObjectId.
 Описание
 Свойство Id представляет идентификатор объекта изменённого листа.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.PlotStyleTableChangedEventArgs, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!