Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ObjectIdCollection.Add
 Послать отзыв
 Метод позволяет добавить в коллекцию указанный идентификатор объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public int Add( ObjectId value );
Копировать Код
Public Function Add( value As ObjectId ) As Integer
 Параметры
 Параметры
 Описание
 value
 Добавляемый идентификатор объекта. Тип ObjectId.
 Возвращает
 Возвращает индекс вновь добавленного элемента коллекции. Тип int.
 Описание
 Метод позволяет добавить в коллекцию указанный идентификатор объекта.
 Ссылки
 Teigha.DatabaseServices.ObjectIdCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!