Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DxfFiler.Precision
 Послать отзыв
 Свойство задает или возвращает точность представления чисел с плавающей точкой в представлении ASCII DXF. Точность задается как количество десятичных знаков после разделителя в диапазоне от 0 до 16.
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract int Precision;
Копировать Код
Public MustOverride Property Precision As Integer
 Возвращает
 Возвращает количество десятичных знаков после разделителя. Тип int.
 Описание
 Свойство задает или возвращает точность представления чисел с плавающей точкой в представлении ASCII DXF. Точность задается как количество десятичных знаков после разделителя в диапазоне от 0 до 16.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.DxfFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!