Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObject.IsUndoing
 Послать отзыв
 Свойство предоставляет информацию об участии объекта в операции Undo.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsUndoing;
Копировать Код
Public Property IsUndoing() As bool
 Возвращает
 Возвращает тип данных bool. Возвращает true, если объект участвует в операции Undo в данный момент времени.
 Описание
 Свойство предоставляет информацию об участии объекта в операции Undo.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.DBObject, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!