Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Ray2d
 Послать отзыв
 Класс Ray2d представляет двумерный луч, полубесконечную линию в двумерном пространстве.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Geometry::Entity2d Teigha::Geometry::Curve2d Teigha::Geometry::LinearEntity2d Teigha::Geometry::Ray2d
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdGeRay2d")] public sealed class Ray2d : LinearEntity2d
Копировать Код
<Wrapper("OdGeRay2d")> Public NotInheritable Class Ray2d Inherits LinearEntity2d
 Описание
 Класс Ray2d представляет двумерный луч, полубесконечную линию в двумерном пространстве. Объект Ray2d имеет начальную точку, но не имеет конечной.
 Методы
 Конструкторы
 Teigha.Geometry.Ray2d
 Имя
 Описание
 Ray2d
 Это обзор перегрузок Ray2d.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Geometry.Entity2d
 Имя
 Описание
 Entity2d Методы
 Ниже перечислены методы класса Entity2d.
 Teigha.Geometry.Curve2d
 Имя
 Описание
 Curve2d Методы
 Ниже перечислены методы класса Curve2d.
 Curve2d Свойства
 Ниже перечислены свойства класса Curve2d.
 Teigha.Geometry.LinearEntity2d
 Имя
 Описание
 LinearEntity2d Методы
 Ниже перечислены методы класса LinearEntity2d.
 LinearEntity2d Свойства
 Ниже перечислены свойства класса LinearEntity2d.
 Teigha.Geometry.Ray2d
 Имя
 Описание
 Ray2d Методы
 Ниже перечислены методы класса Ray2d.
 Ссылки
 Ray2d Конструктор, Ray2d Методы, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!