Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.JoinStyle
 Послать отзыв
 Перечисление JoinStyle определяет поддерживаемые стили отрисовки концов соединяющихся линий.
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdDb.JoinStyle")] public enum JoinStyle { StyleNone = 0, StyleRound = 1, StyleAngle = 2, StyleFlat = 3 }
Копировать Код
<Wrapper("OdDb.JoinStyle")> Public Enum JoinStyle StyleNone = 0 StyleRound = 1 StyleAngle = 2 StyleFlat = 3 End Enum
 Члены
 Члены
 Описание
 StyleNone
 Значение: 0. Стиль соединения не задан.
 StyleRound
 Значение: 1. Скругленный стиль соединения.
 StyleAngle
 Значение: 2. Угловой стиль соединения.
 StyleFlat
 Значение: 3. Плоский стиль соединения.
 Описание
 Перечисление JoinStyle определяет поддерживаемые стили отрисовки концов соединяющихся линий.
 Ваши комментарии по поводу этого топика: Послать отзыв!