Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.ExternalSurface.IsTorus
 Послать отзыв
 Свойство IsTorus позволяет проверить, является ли данная внешняя поверхность тором.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsTorus;
Копировать Код
Public ReadOnly Property IsTorus As Boolean
 Возвращает
 Возвращает true, если данная внешняя поверхность является тором. В противном случае возвращает false.
 Описание
 Свойство IsTorus определяет тип данной внешней поверхности и возвращает true, если она является тором.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.ExternalSurface, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!