Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Polyline3d.ConvertToPolyType
 Послать отзыв
 Метод предназначен для преобразования полилинии в тип, указанный значением аргумента newVal.
 Синтаксис
C#
Visual Basic
Копировать Код
public void ConvertToPolyType( Poly3dType newVal );
Копировать Код
Public Function ConvertToPolyType( newVal As Poly3dType ) As void
 Параметры
 Параметры
 Описание
 newVal
 Новый тип полилинии из перечисления Poly3dType.
 Описание
 Метод предназначен для преобразования полилинии в тип, указанный значением аргумента newVal. Используется метод SplineFit(). DXF-код группы 75 заменяется на 6.
 Ссылки
 Teigha.DatabaseServices.Polyline3d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!