Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Interval.IntersectWith
 Послать отзыв
 Метод позволяет получить интервал, являющийся пересечением данного и указанного интервалов с учетом настроенной точности определения границ.
 Синтаксис
C#
Visual Basic
Копировать Код
public Interval IntersectWith( ref Interval otherInterval );
Копировать Код
Public Function IntersectWith( ByRef otherInterval As Interval ) As Interval
 Параметры
 Параметры
 Описание
 otherInterval
 Входной интервал. Тип Interval.
 Возвращает
 Возвращает интервал, являющийся пересечением данного интервала и интервала otherInterval. Тип Interval. В случае непересекающихся интервалов возвращает NULL.
 Описание
 Метод позволяет получить интервал, являющийся пересечением данного объекта с интервалом otherInterval. Результат вычисляется с использованием настроенной в данном объекте точности задания границ.
 Ссылки
 Teigha.Geometry.Interval, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!