Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MText.AlignChange
 Послать отзыв
 Свойство представляет строку изменения выравнивания "A".
 Синтаксис
C#
Visual Basic
Копировать Код
public static String AlignChange;
Копировать Код
Public Shared ReadOnly Property AlignChange As String
 Возвращает
 Возвращает строку изменения выравнивания. Тип String.
 Описание
 Свойство представляет строку изменения выравнивания "A". Может использоваться вместо "A", чтобы сделать код более понятным.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.MText, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!