Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.SurfaceCurve2dTo3d.Create
 Послать отзыв
 Метод создает управляемый объект SurfaceCurve2dTo3d на основе переданного неуправляемого указателя.
 Синтаксис
C#
Visual Basic
Копировать Код
public static SurfaceCurve2dTo3d Create( IntPtr unmanagedPointer, bool autoDelete );
Копировать Код
Public Shared Function Create( unmanagedPointer As IntPtr, autoDelete As Boolean ) As SurfaceCurve2dTo3d
 Параметры
 Параметры
 Описание
 unmanagedPointer
 Входной неуправляемый указатель на исходный объект. Тип IntPtr.
 autoDelete
 Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.
 Возвращает
 Возвращает созданный объект. Тип SurfaceCurve2dTo3d.
 Описание
 Метод создает управляемый объект SurfaceCurve2dTo3d на основе переданного неуправляемого указателя.
 Ссылки
 Teigha.Geometry.SurfaceCurve2dTo3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!