Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Polyline2d.AppendVertex
 Послать отзыв
 Метод добавляет новую вершину Vertex2d в список вершин полилинии.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.ObjectId AppendVertex( ref Vertex2d vertexToAppend );
Копировать Код
Public Function AppendVertex( ByRef vertexToAppend As Vertex2d ) As DatabaseServices.ObjectId
 Параметры
 Параметры
 Описание
 vertexToAppend
 Добавляемая вершина, тип Vertex2d.
 Возвращает
 Возвращает ObjectId новой вершины полилинии.
 Описание
 Метод добавляет объект Vertex2d в список вершин полилинии, делает полилинию владельцем вершины и добавляет вершину в базу данных, в которой содержится полилиния. Чтобы метод отработал успешно, полилиния должна быть резидентной в этой базе данных. Метод возвращает ObjectId добавленной вершины.
 Добавленная вершина должна быть явно закрыта вызывающим приложением после возврата из метода AppendVertex().
 Ссылки
 Teigha.DatabaseServices.Polyline2d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!