Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.LineWeightDisplay
 Послать отзыв
 Синтаксис
C#
Visual Basic
public bool LineWeightDisplay;
Public Property LineWeightDisplay() As bool
 Описание
 Возвращает или устанавливает статус ширины отображаемой линии.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!