Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbSurfaceDefinition.ControlPoints
 Послать отзыв
 Свойство ControlPoints представляет массив управляющих вершин NURBS поверхности.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3dCollection ControlPoints;
Копировать Код
Public ReadOnly Property ControlPoints As Point3dCollection
 Возвращает
 Возвращает массив управляющих вершин сплайна. Тип Point3dCollection.
 Описание
 Свойство ControlPoints представляет массив управляющих вершин NURBS поверхности.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.NurbSurfaceDefinition, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!