Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Polyline2d.SplineFit
 Послать отзыв
 Метод выполняет аппроксимацию полилинии сплайном с указанием его типа и количества сегментов сплайна.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SplineFit( Poly2dType value, int segments );
Копировать Код
Public Sub SplineFit( value As Poly2dType, segments As Integer )
 Параметры
 Параметры
 Описание
 value
 Тип нового сплайна из перечисления Poly2dType.
 segments
 Количество сегментов аппроксимирующего сплайна.
 Описание
 Метод выполняет аппроксимацию полилинии сплайном с указанием типа сплайна и количества его сегментов. Он преобразует все простые вершины в контрольные вершины сплайна и на их основе создает новые вершины аппроксимирующего сплайна указанного типа с учетом требуемого количества сегментов.
 Ссылки
 Teigha.DatabaseServices.Polyline2d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!