Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Graph.BreakCycleEdge
 Послать отзыв
 Метод предназначен для разрыва цикла на конкретном ребре графа с последующим обновлением информации о циклах в данном графе.
 Синтаксис
C#
Visual Basic
Копировать Код
public void BreakCycleEdge( ref GraphNode from, ref GraphNode toPointer );
Копировать Код
Public Sub BreakCycleEdge( ByRef from As GraphNode, ByRef toPointer As GraphNode )
 Параметры
 Параметры
 Описание
 from
 Узел в начале удаляемого ребра. Тип GraphNode.
 toPointer
 Узел на конце удаляемого ребра. Тип GraphNode.
 Описание
 Метод предназначен для удаления из графа конкретного ребра, заданного узлами на его концах. В завершение вызывается метод FindCycles() для обновления информации о циклах в связи с внесенными изменениями.
 Ссылки
 Teigha.DatabaseServices.Graph, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!