Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.HasSubSelection
 Послать отзыв
 Данное свойство позволяет определить, имеется ли в данной таблице подвыборка.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual bool HasSubSelection;
Копировать Код
Public virtual Property HasSubSelection() As Boolean
 Возвращает
 Возвращает true, если в таблице есть подвыборка. В противном случае возвращает false.
 Описание
 Данное свойство возвращает true, если в таблице есть подвыборка. В противном случае возвращает false.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!