Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Database.BindXrefs
 Послать отзыв
 Синтаксис
C#
Visual Basic
public void BindXrefs(ref ObjectIdCollection xrefIds, bool insertBind);
Public Sub BindXrefs(ByRef xrefIds As ObjectIdCollection, insertBind As bool)
 Параметры
 Параметры
 Описание
 xrefIds
 Коллекция ObjectIds для BlockTableRecord файлов внешних ссылок для связывания
 insertBind
 Признак, указывающий, нужно ли конвертировать символы внешних ссылок
 Описание
 Эта функция связывает внешние ссылки, чьи Id таблицы BlockTableRecord указаны в первом параметре метода. Если insertBind установлен в true, то имена записей в таблице символов будут преобразованы из имен внешних ссылок в имена обычных вставленных блоков.
 Все Id в параметре xrefIds должны быть из базы данных и должны быть действительными.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!