Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObject.Erase(bool)
 Послать отзыв
 Метод помечает этот объект, как удалённый или убирает отметку об удалении, но не удаляет из базы данных.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Erase(bool erasing);
Копировать Код
Public Sub Erase(erasing As bool)
 Параметры
 Параметры
 Описание
 erasing
 Флаг, указывающий убрать или добавить пометку об удалении. Тип bool. Значение true - пометить как удалённый, false - убрать пометку об удалении
 Описание
 Метод устанавливает признак удаления ли восстановления объекта.
 Ссылки
 Teigha.DatabaseServices.DBObject, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!