Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.EllipticalArc2d.MinorRadius
 Послать отзыв
 Свойство MinorRadius предоставляет доступ к значению малого радиуса данной эллиптической дуги.
 Синтаксис
C#
Visual Basic
Копировать Код
public double MinorRadius;
Копировать Код
Public Property MinorRadius As Double
 Возвращает
 Возвращает значение малого радиуса данной эллиптической дуги. Тип double.
 Описание
 Свойство MinorRadius предоставляет доступ к значению малого радиуса данной эллиптической дуги.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.Geometry.EllipticalArc2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!