Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.PlanarEquationCoefficients
 Послать отзыв
 Структура PlanarEquationCoefficients представляет коэффициенты общего уравнения плоскости в трехмерном пространстве.
 Иерархия классов
Teigha::Geometry::PlanarEquationCoefficients
 Синтаксис
C#
Visual Basic
Копировать Код
public struct PlanarEquationCoefficients
Копировать Код
Public Structure PlanarEquationCoefficients
 Описание
 Структура PlanarEquationCoefficients представляет коэффициенты общего уравнения плоскости в трехмерном пространстве.
 Замечания
 Общее уравнение плоскости имеет вид:
 Копировать Код
 a * X + b * Y + c * Z + d = 0
 где a, b, c, d - некоторые действительные константы, удовлетворяющие условию невырожденности плоскости a^2 + b^2 + c^2 != 0 (т.е., a, b и c не могут равняться нулю одновременно). Величины a, b, c служат компонентами вектора нормали этой плоскости.
 Методы
 Конструкторы
 Имя
 Описание
 PlanarEquationCoefficients
 Конструктор структуры PlanarEquationCoefficients. Создает экземпляр структуры с указанными параметрами.
 Топики
 Имя
 Описание
 PlanarEquationCoefficients Свойства
 Ниже перечислены свойства класса PlanarEquationCoefficients.
 Ссылки
 PlanarEquationCoefficients Свойства, Методы, Топики, PlanarEquationCoefficients Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!