Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeader.SetLastVertex
 Послать отзыв
 Метод позволяет изменить положение последней вершины указанной линии выноски.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetLastVertex( int leaderLineIndex, Point3d point );
Копировать Код
Public Sub SetLastVertex( leaderLineIndex As Integer, point As Point3d )
 Параметры
 Параметры
 Описание
 leaderLineIndex
 Индекс линии выноски. Тип int.
 point
 Новое положение вершины линии выноски. Тип Point3d.
 Описание
 Метод позволяет изменить положение последней вершины линии выноски с указанным индексом. Новых вершин этот метод не создает.
 Ссылки
 Teigha.DatabaseServices.MLeader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!