Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocArrayRectangularParameters.GetAxesAngle
 Послать отзыв
 Метод позволяет получить угол между первым рядом и первым столбцом массива.
 Синтаксис
C#
Visual Basic
Копировать Код
public double GetAxesAngle( out String expression, out String evaluatorId );
Копировать Код
Public Function GetAxesAngle( ByRef expression As String, ByRef evaluatorId As String ) As Double
 Параметры
 Параметры
 Описание
 expression
 Выражение для параметра. Тип String. Строка может быть пустой.
 evaluatorId
 Строковое представление идентификатора вычислителя. Тип String. Строка может быть пустой.
 Возвращает
 Возвращает угол наклона столбцов массива в радианах. Тип double.
 Описание
 Метод позволяет получить угол в радианах между первым рядом и первым столбцом массива.
 Если для параметра выражение отсутствует, то после выполнения метода строки expression и evaluatorId остаются пустыми.
 Ссылки
 Teigha.DatabaseServices.AssocArrayRectangularParameters, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!