Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObject.IsPersistent
 Послать отзыв
 Свойство предоставляет информацию о том, является ли объект резидентом базы данных чертежа.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsPersistent;
Копировать Код
Public Property IsPersistent() As bool
 Возвращает
 Возвращает тип данных bool. Возвращает true, если отображаемый объект является резидентом базы данных (относится к модели, которая требует использования функций открытия и закрытия).
 Описание
 Свойство предоставляет информацию о том, является ли объект резидентом базы данных чертежа.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.DBObject, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!