Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Curve.GetFirstDerivative
 Послать отзыв
 Метод предназначен для получения вектора первой производной кривой в заданной точке кривой.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual Vector3d GetFirstDerivative( Point3d point );
Копировать Код
Public virtual Function GetFirstDerivative( point As Point3d ) As Vector3d
 Параметры
 Параметры
 Описание
 point
 Объект типа Point3d, представляющий точку, в которой вычисляется вектор касательной.
 Возвращает
 Возвращает вектор Vector3d первой производной кривой в точке point на кривой.
 Описание
 Метод предназначен для получения вектора первой производной кривой в заданной точке кривой.
 Ссылки
 Teigha.DatabaseServices.Curve, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!