Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Событие Database.AbortDxfOut
 Послать отзыв
 Синтаксис
C#
Visual Basic
public event EventHandler AbortDxfOut;
Public Event AbortDxfOut As EventHandler
 Описание
 Это событие показывает, что база данных чертежа начала изменяться при операции записи в DXF, но эта операция была снята до завершения.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!