Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Circle.Thickness
 Послать отзыв
 Синтаксис
C#
Visual Basic
public double Thickness;
Public Property Thickness() As Double
 Описание
 Задает или возвращает толщину линии окружности.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Circle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!