Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Leader.NumVertices
 Послать отзыв
 Синтаксис
C#
Visual Basic
public int NumVertices;
Public Property NumVertices() As Integer
 Описание
 Возвращает количество вершин выноски.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.Leader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!