Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeaderStyle.ArrowSymbolId
 Послать отзыв
 Свойство представляет идентификатор объекта символа стрелки, предусмотренный данным стилем.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.ObjectId ArrowSymbolId;
Копировать Код
Public Property ArrowSymbolId As DatabaseServices.ObjectId
 Возвращает
 Возвращает идентификатор символа стрелки. Тип DatabaseServices.ObjectId.
 Описание
 Свойство представляет идентификатор объекта символа стрелки, предусмотренный данным стилем.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MLeaderStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!