Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Database.Purge (ObjectIdCollection^)
 Послать отзыв
 Синтаксис
C#
Visual Basic
public void Purge(ref ObjectIdCollection ids);
Public Sub Purge(ByRef ids As ObjectIdCollection)
 Параметры
 Параметры
 Описание
 ids
 Входная коллекция Id объектов
 Описание
 Эта функция просматривает базу данных и ищет жесткие ссылки на объекты, Id которых есть в массиве ids. Если такие объекты обнаружены, то метод удаляет Id соответствующих объектов из массива ids. Таким образом, при завершении работы метода массив ids будет содержать только Id геометрических объектов, на которые нет жестких ссылок и которые, следовательно, могут быть удалены.
 Если база данных частично открыта, то Id геометрических объектов, которые не были созданы в текущей сессии редактора, все равно удаляются из коллекции ids. Note Метод не изменяет базу данных.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!