Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство TextStyleTableRecord.XScale
 Послать отзыв
 Синтаксис
C#
Visual Basic
public double XScale;
Public Property XScale() As Double
 Описание
 Это свойство обеспечивает доступ к фактору ширины (также называемому относительным фактором X-масштаба) для TextStyleTableRecord.
 widthFactor применяется к ширине текста, чтобы ширина могла определяться в зависимости от высоты. Например, если widthFactor имеет значение 0.8, то текст отображается с шириной, равной 0.8 от нормальной "непривязанной" ширины.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.TextStyleTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!