Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GripData.AppData
 Послать отзыв
 Свойство возвращает данные приложения, связанные с этим объектом ручки.
 Синтаксис
C#
Visual Basic
Копировать Код
public IntPtr AppData;
Копировать Код
Public ReadOnly Property AppData As IntPtr
 Возвращает
 Возвращает указатель на данные этой ручки. Тип IntPtr.
 Описание
 Свойство возвращает данные приложения, связанные с этим объектом ручки.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.GripData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!