Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AbstractViewTableRecord.ViewTwist
 Послать отзыв
 Свойство ViewTwist предоставляет доступ к углу поворота вида в видовом экране.
 Синтаксис
C#
Visual Basic
Копировать Код
public double ViewTwist;
Копировать Код
Public Property ViewTwist As Double
 Возвращает
 Возвращает угол поворота вида (в радианах). Тип double.
 Описание
 Свойство ViewTwist предоставляет доступ к величине угла поворота (в радианах) вида в видовом экране.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.AbstractViewTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!