Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.HatchLoop.IsPolyline
 Послать отзыв
 Свойство позволяет определить, имеет ли этот контур штриховки тип HatchLoopTypes.Polyline.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsPolyline;
Копировать Код
Public ReadOnly Property IsPolyline As Boolean
 Возвращает
 Возвращает true, если данный контур штриховки представлен полилинией и, соответственно, имеет тип HatchLoopTypes.Polyline. В противном случае возвращает false.
 Описание
 Свойство позволяет определить, имеет ли этот контур штриховки тип HatchLoopTypes.Polyline.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.HatchLoop, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!