Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.Dimtfac
 Послать отзыв
 Свойство задает или возвращает масштабный коэффициент для высоты текста допусков в размерах.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Dimtfac;
Копировать Код
Public Property Dimtfac As Double
 Возвращает
 Возвращает масштабный коэффициент для высоты текста. Тип double.
 Описание
 Свойство задает или возвращает масштабный коэффициент для высоты текста допусков в размерах.
 Замечания
 См. также свойство Teigha.DatabaseServices.Dimension.Dimtxt.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!