Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Entity.DeleteSubentityPaths(FullSubentityPath[])
 Послать отзыв
 Метод предназначен для удаления одного или нескольких подобъектов из геометрического объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public void DeleteSubentityPaths(FullSubentityPath[] subPaths);
Копировать Код
Public Sub DeleteSubentityPaths(subPaths As FullSubentityPath[])
 Параметры
 Параметры
 Описание
 subPaths
 Массив, определяющий удаляемые элементы. Тип FullSubentityPath[]
 Описание
 Метод удаляет один или несколько подобъектов из геометрического объекта.
 Пользовательские объекты, которые представляют поведение геометрических подобъектов, могут переопределить этот метод для поддержки очистки геометрического подобъекта из главного объекта.
 Ссылки
 Teigha.DatabaseServices.Entity, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!