Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve2d.GetBoundBlockOf
 Послать отзыв
 Метод позволяет получить двумерную граничную рамку для этой кривой на указанном параметрическом подынтервале. Граничная рамка ориентирована по осям системы координат.
 Синтаксис
C#
Visual Basic
Копировать Код
public BoundBlock2d GetBoundBlockOf( ref Interval range );
Копировать Код
Public Function GetBoundBlockOf( ByRef range As Interval ) As BoundBlock2d
 Параметры
 Параметры
 Описание
 range
 Входной параметрический интервал. Тип Interval.
 Возвращает
 Возвращает двумерную граничную рамку. Тип BoundBlock2d.
 Описание
 Метод позволяет получить двумерную граничную рамку для этой кривой на указанном параметрическом подынтервале. Граничная рамка ориентирована по осям системы координат.
 Ссылки
 Teigha.Geometry.Curve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!