Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBVisualStyle.DBVisualStyle
 Послать отзыв
 Конструктор класса DBVisualStyle.
 Синтаксис
C#
Visual Basic
Копировать Код
public DBVisualStyle( IntPtr unmanagedPointer, bool autoDelete );
Копировать Код
Public Sub New( unmanagedPointer As IntPtr, autoDelete As Boolean )
 Параметры
 Параметры
 Описание
 unmanagedPointer
 Неуправляемый указатель на исходный объект. Тип IntPtr.
 autoDelete
 Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.
 Описание
 Конструктор класса DBVisualStyle.
 Ссылки
 Teigha.DatabaseServices.DBVisualStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!