Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DimAssoc.IsAllGeomErased
 Послать отзыв
 Метод позволяет проверить, удалена ли вся геометрия в опорных точках данного объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsAllGeomErased();
Копировать Код
Public Function IsAllGeomErased() As Boolean
 Возвращает
 Возвращает true, если вся геометрия в опорных точках удалена. В противном случае возвращает false.
 Описание
 Метод позволяет проверить, удалена ли вся геометрия в опорных точках данного объекта.
 Ссылки
 Teigha.DatabaseServices.DimAssoc, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!