Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.StepSize
 Послать отзыв
 Синтаксис
C#
Visual Basic
public double StepSize;
Public Property StepSize() As Double
 Описание
 Обеспечивает доступ к текущему значению STEPSIZE для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!