Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MText.UnderlineOff
 Послать отзыв
 Свойство возвращает строку отмены подчеркивания текста "l".
 Синтаксис
C#
Visual Basic
Копировать Код
public static String UnderlineOff;
Копировать Код
Public Shared ReadOnly Property UnderlineOff As String
 Возвращает
 Возвращает строку отмены подчеркивания текста. Тип String.
 Описание
 Свойство возвращает строку отмены подчеркивания текста "l". Может использоваться вместо строковой константы "l", чтобы сделать код более понятным. При использовании в строке, возвращаемой свойством MText.Contents, "l" означает отмену подчеркивания текста.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.MText, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!