Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SymbolTableEnumerator.Reset
 Послать отзыв
 Метод выполняет реинициализацию перечислителя, сбрасывая его текущий индекс на -1.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void Reset();
Копировать Код
Public Overridable Sub Reset()
 Описание
 Метод выполняет реинициализацию перечислителя, сбрасывая его текущий индекс на -1.
 Ссылки
 Teigha.DatabaseServices.SymbolTableEnumerator, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!