Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DataLinkGetSourceContext
 Послать отзыв
 Перечисление DataLinkGetSourceContext определяет типы исходного контекста источника связанных данных.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum DataLinkGetSourceContext { Unknown = 0, Etransmit = 1, XrefManager = 2, FileWatcher = 3, Other = 4, OrignalPath = 256 }
Копировать Код
Public Enum DataLinkGetSourceContext Unknown = 0 Etransmit = 1 XrefManager = 2 FileWatcher = 3 Other = 4 OrignalPath = 256 End Enum
 Члены
 Члены
 Описание
 Etransmit
 Значение: 1. Контекст полного комплекта чертежа eTransmit.
 FileWatcher
 Значение: 3. Контекст отслеживания изменений в файловой системе.
 Other
 Значение: 4. Прочие контексты.
 Unknown
 Значение: 0. Контекст неизвестен.
 XrefManager
 Значение: 2. Контекст менеджера внешних ссылок.
 OrignalPath
 Значение: 256. Эту опцию можно объединить с контекстом, чтобы получить исходное расположение связанных данных.
 Описание
 Перечисление DataLinkGetSourceContext определяет типы исходного контекста источника связанных данных.
 Ваши комментарии по поводу этого топика: Послать отзыв!