Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AttributeDefinition.IsMTextAttributeDefinition
 Послать отзыв
 Свойство предоставляет доступ на изменение к флагу, который определяет, является ли данный объект AttributeDefinition определением многострочного атрибута.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsMTextAttributeDefinition;
Копировать Код
Public Property IsMTextAttributeDefinition() As Boolean
 Возвращает
 Возвращает true, если определение атрибута является многострочным. В противном случае возвращает false.
 Описание
 Свойство предоставляет доступ на изменение к флагу, который определяет, является ли данный объект AttributeDefinition определением многострочного атрибута.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.AttributeDefinition, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!