Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotSettings.ScaleLineweights
 Послать отзыв
 Свойство ScaleLineweights позволяет определить, масштабируются ли толщины (веса) линий у этого объекта PlotSettings.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool ScaleLineweights;
Копировать Код
Public Property ScaleLineweights As Boolean
 Возвращает
 Возвращает true, если толщины (веса) линий масштабируются. В противном случае возвращает false.
 Описание
 Свойство ScaleLineweights позволяет определить, масштабируются ли толщины (веса) линий у этого объекта PlotSettings.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.PlotSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!