Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocArrayPathParameters.SetItemSpacing
 Послать отзыв
 Метод задает расстояние между элементами массива по траектории.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetItemSpacing( double spacing, ref String expression, ref String evaluatorId );
Копировать Код
Public Sub SetItemSpacing( spacing As Double, ByRef expression As String, ByRef evaluatorId As String )
 Параметры
 Параметры
 Описание
 spacing
 Расстояние между элементами массива по траектории. Тип double.
 expression
 Выражение для параметра. Тип String. Строка может быть пустой.
 evaluatorId
 Строковое представление идентификатора вычислителя. Тип String. Строка может быть пустой.
 Описание
 Метод задает расстояние между элементами массива по траектории. Если для параметра выражение отсутствует, строки expression и evaluatorId должны быть пустыми.
 Ссылки
 Teigha.DatabaseServices.AssocArrayPathParameters, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!