Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SecurityParameters.GetHashCode
 Послать отзыв
 Метод предоставляет хеш-код данного объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public sealed override int GetHashCode();
Копировать Код
Public NotOverridable Overrides Function GetHashCode() As Integer
 Возвращает
 Возвращает хеш-код данного объекта. Тип int.
 Описание
 Метод предоставляет хеш-код данного объекта.
 Замечания
 Переопределение методов Equals и GetHashCode должно выполняться совместно, чтобы не нарушать логику - если Equals возвращает true, хеш-коды сравниваемых объектов обязаны совпадать. Обратное не гарантируется - совпадение хэш-кодов не всегда означает совпадение объектов вследствие возможных коллизий. Хеш-коды следует формировать для полей, на которых основано равенство сравниваемых объектов.
 Иногда используется метод Equals() из объекта C++, но поскольку сравниваются указатели, вы по-прежнему можете использовать данный GetHashCode(), в то время как метод Equals() может быть переопределен в производном классе.
 Ссылки
 Teigha.DatabaseServices.SecurityParameters, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!