Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Point3d.GetAsVector
 Послать отзыв
 Метод преобразует данную 3D-точку в 3D-вектор с тем же набором координат и возвращает экземпляр Vector3d.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d GetAsVector();
Копировать Код
Public Function GetAsVector() As Vector3d
 Возвращает
 Возвращает вектор с теми же координатами, что и у данной точки. Тип Vector3d.
 Описание
 Метод преобразует данную 3D-точку в 3D-вектор с тем же набором координат и возвращает экземпляр Vector3d.
 Ссылки
 Teigha.Geometry.Point3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!