Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Region.Region
 Послать отзыв
 Конструктор по умолчанию класса Region.
 Синтаксис
C#
Visual Basic
Копировать Код
public Region();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса Region.
 Ссылки
 Teigha.DatabaseServices.Region, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!