Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AuditInfo.IncNumEntities
 Послать отзыв
 Метод увеличивает на единицу количество ошибок, которые в данном объекте AuditInfo учтены как обработанные.
 Синтаксис
C#
Visual Basic
Копировать Код
public void IncNumEntities();
Копировать Код
Public Sub IncNumEntities()
 Описание
 Метод увеличивает на единицу количество ошибок, которые в данном объекте AuditInfo учтены как обработанные.
 Ссылки
 Teigha.DatabaseServices.AuditInfo, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!