Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GeoLocationData.SeaLevelElevation
 Послать отзыв
 Свойство обеспечивает доступ к значению высоты над уровнем моря.
 Синтаксис
C#
Visual Basic
Копировать Код
public double SeaLevelElevation;
Копировать Код
Public Property SeaLevelElevation As Double
 Возвращает
 Возвращает значение высоты над уровнем моря. Тип double.
 Описание
 Свойство обеспечивает доступ к значению высоты над уровнем моря.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.GeoLocationData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!