Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbCurve3dFitData.StartTangent
 Послать отзыв
 Свойство StartTangent представляет начальный вектор касательной.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d StartTangent;
Копировать Код
Public ReadOnly Property StartTangent As Vector3d
 Возвращает
 Возвращает начальный вектор касательной. Тип Vector3d.
 Описание
 Свойство StartTangent представляет начальный вектор касательной.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.NurbCurve3dFitData, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!