Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.LineSegment3d
 Послать отзыв
 Класс LineSegment3d представляет линейные сегменты в трехмерном пространстве.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Geometry::Entity3d Teigha::Geometry::Curve3d Teigha::Geometry::LinearEntity3d Teigha::Geometry::LineSegment3d
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdGeLineSeg3d")] public sealed class LineSegment3d : LinearEntity3d
Копировать Код
<Wrapper("OdGeLineSeg3d")> Public NotInheritable Class LineSegment3d Inherits LinearEntity3d
 Описание
 Класс LineSegment3d представляет линейные сегменты в трехмерном пространстве.
 Методы
 Конструкторы
 Teigha.Geometry.LineSegment3d
 Имя
 Описание
 LineSegment3d
 Это обзор перегрузок LineSegment3d.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Geometry.Entity3d
 Имя
 Описание
 Entity3d Методы
 Ниже перечислены методы класса Entity3d.
 Teigha.Geometry.Curve3d
 Имя
 Описание
 Curve3d Методы
 Ниже перечислены методы класса Curve3d.
 Curve3d Свойства
 Ниже перечислены свойства класса Curve3d.
 Teigha.Geometry.LinearEntity3d
 Имя
 Описание
 LinearEntity3d Методы
 Ниже перечислены методы класса LinearEntity3d.
 LinearEntity3d Свойства
 Ниже перечислены свойства класса LinearEntity3d.
 Teigha.Geometry.LineSegment3d
 Имя
 Описание
 LineSegment3d Методы
 Ниже перечислены методы класса LineSegment3d.
 LineSegment3d Свойства
 Ниже перечислены свойства класса LineSegment3d.
 Ссылки
 LineSegment3d Конструктор, LineSegment3d Методы, LineSegment3d Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!