Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AbstractViewPE.UpVector
 Послать отзыв
 Свойство UpVector представляет направление вверх камеры вида.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d UpVector;
Копировать Код
Public ReadOnly Property UpVector As Vector3d
 Возвращает
 Возвращает вектор, определяющий направление вверх для вида. Тип Vector3d.
 Описание
 Свойство UpVector представляет направление вверх камеры вида.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.AbstractViewPE, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!