Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Polyline2d.InsertVertexAt
 Послать отзыв
 Эта функция вставляет объект Vertex2d, заданный аргументом newVertex, в список вершин полилинии непосредственно после вершины indexVertex.
 Синтаксис
C#
Visual Basic
Копировать Код
public void InsertVertexAt( ref Vertex2d indexVertex, ref Vertex2d newVertex );
Копировать Код
Public Sub InsertVertexAt( ByRef indexVertex As Vertex2d, ByRef newVertex As Vertex2d )
 Параметры
 Параметры
 Описание
 indexVertex
 Вершина полилинии Vertex2d, после которой должна быть вставлена новая вершина. Чтобы вставить новую вершину в начало полилинии, в аргументе indexVertex следует передать Null.
 newVertex
 Вставляемая вершина, тип Vertex2d.
 Описание
 Эта функция вставляет объект Vertex2d, заданный аргументом newVertex, в список вершин полилинии непосредственно после вершины indexVertex.
 Если полилиния является резидентной в базе данных, то вершина будет добавлена в ту же базу данных. Если же полилиния не является резидентной, то вершина будет добавлена в базу данных, как только в базу данных будет добавлена сама полилиния.
 Чтобы вставить вершину в начало полилинии, следует передать NULL в аргументе indexVertex.
 Если полилиния является резидентной, то вставленная вершина должна быть явно закрыта вызывающим приложением после возврата из метода InsertVertexAt(). Если же полилиния не является резидентной, то нет необходимости закрывать вершину, так как она еще не была добавлена в базу данных.
 Ссылки
 Teigha.DatabaseServices.Polyline2d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!