Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.BooleanOperationType
 Послать отзыв
 Данное перечисление определяет типы логических операций с геометрическими объектами.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum BooleanOperationType { BoolUnite = 0, BoolIntersect = 1, BoolSubtract = 2 }
Копировать Код
Public Enum BooleanOperationType BoolUnite = 0 BoolIntersect = 1 BoolSubtract = 2 End Enum
 Члены
 Члены
 Описание
 BoolUnite
 Значение: 0. Логическая операция объединения двух геометрических объектов.
 BoolIntersect
 Значение: 1. Логическая операция пересечения двух геометрических объектов.
 BoolSubtract
 Значение: 2. Логическая операция вычитания одного геометрического объекта из другого.
 Описание
 Данное перечисление определяет типы логических операций с геометрическими объектами.
 Ваши комментарии по поводу этого топика: Послать отзыв!