Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CurveCurveIntersector3d
 Послать отзыв
 Класс CurveCurveIntersector3d представляет геометрию пересечений 3D-кривых общего вида.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Geometry::Entity3d Teigha::Geometry::CurveCurveIntersector3d
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdGeCurveCurveInt3d")] public sealed class CurveCurveIntersector3d : Entity3d
Копировать Код
<Wrapper("OdGeCurveCurveInt3d")> Public NotInheritable Class CurveCurveIntersector3d Inherits Entity3d
 Описание
 Класс CurveCurveIntersector3d представляет геометрию пересечений 3D-кривых общего вида.
 В классах LinearEntity3d, CircularArc3d и AcGeEllipticArc3d предусмотрены специальные методы IntersectWith() для поиска точек пересечения двух линий, линии и дуги, двух дуг или линии и эллипса. Однако нет обобщенного метода для поиска точек пересечения двух 3D-кривых общего вида. Эту задачу решают объекты класса CurveCurveIntersector3d.
 Создание объектов этого класса сопровождается указанием двух кривых, пересечения которых требуется вычислить. Указатели на входные кривые сохраняются в элементах данных класса. Для поиска пересечений возможно дополнительно конкретизировать параметрические интервалы для каждой из кривых.
 Класс содержит методы запросов, которые возвращают точки пересечения и/или интервалы перекрытия двух кривых. Предусмотрены также методы, которые предоставляют информацию о каждой точке пересечения, например, является ли конкретное пересечение тангенциальным или трансверсальным. Чтобы найти точки самопересечения кривой, достаточно в качестве входных кривых передать в конструктор одну и ту же кривую.
 Замечания
 Если одна из связанных кривых удалена, объект этого класса должен быть перевычислен.
 Методы
 Конструкторы
 Teigha.Geometry.CurveCurveIntersector3d
 Имя
 Описание
 CurveCurveIntersector3d
 Это обзор перегрузок CurveCurveIntersector3d.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Geometry.Entity3d
 Имя
 Описание
 Entity3d Методы
 Ниже перечислены методы класса Entity3d.
 Teigha.Geometry.CurveCurveIntersector3d
 Имя
 Описание
 CurveCurveIntersector3d Методы
 Ниже перечислены методы класса CurveCurveIntersector3d.
 CurveCurveIntersector3d Свойства
 Ниже перечислены свойства класса CurveCurveIntersector3d.
 Ссылки
 CurveCurveIntersector3d Конструктор, CurveCurveIntersector3d Методы, CurveCurveIntersector3d Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!