Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SweepOptions.DraftAngle
 Послать отзыв
 Свойство DraftAngle представляет угол сужения (расширения), на который профиль будет сужаться по мере вытягивания вдоль траектории.
 Синтаксис
C#
Visual Basic
Копировать Код
public double DraftAngle;
Копировать Код
Public ReadOnly Property DraftAngle As Double
 Возвращает
 Возвращает угол сужения (в радианах). Тип double.
 Описание
 Свойство DraftAngle представляет угол сужения (расширения), на который профиль будет сужаться по мере вытягивания вдоль траектории.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.SweepOptions, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!