Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.AltToleranceSuppressLeadingZeros
 Послать отзыв
 Свойство позволяет управлять подавлением ведущих нулей в значениях отклонений размеров, выраженных в альтернативных размерных единицах.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool AltToleranceSuppressLeadingZeros;
Копировать Код
Public Property AltToleranceSuppressLeadingZeros As Boolean
 Возвращает
 Возвращает true, если подавление включено. В противном случае возвращает false.
 Описание
 Свойство позволяет включить или отключить подавление ведущих нулей в значениях отклонений размеров, выраженных в альтернативных единицах.
 Это свойство действует только в том случае, если для свойств Dimalt и Dimtol установлено значение true.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!