Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Surface.IsOn
 Послать отзыв
 Метод проверяет принадлежность указанной 3D-точки данной поверхности в пределах точности по умолчанию. Для точки на поверхности метод вычисляет соответствующую ей параметрическую 2D-точку (U, V) в параметрическом пространстве поверхности.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsOn( Point3d point, out Point2d parameterPoint );
Копировать Код
Public Function IsOn( point As Point3d, ByRef parameterPoint As Point2d ) As Boolean
 Параметры
 Параметры
 Описание
 point
 Входная точка в пространстве моделирования. Тип Point3d.
 parameterPoint
 Выходная точка. Тип Point2d. Представляет в пространстве параметров входную точку point, если та в пределах используемой точности принадлежит данной поверхности.
 Возвращает
 Возвращает true, если в пределах используемой точности точка point лежит на данной поверхности. В противном случае возвращает false.
 Описание
 Метод проверяет принадлежность указанной 3D-точки данной поверхности в пределах точности по умолчанию. Для точки на поверхности метод вычисляет соответствующую ей параметрическую 2D-точку (U, V) в параметрическом пространстве поверхности.
 Замечания
 Используется вызов метода Surface.IsOn(Point3d point, Point2d parameterPoint, Tolerance tolerance) с точностью по умолчанию Tolerance.Global.
 Ссылки
 Teigha.Geometry.Surface, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!