Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FullDwgVersion.MinorVersion
 Послать отзыв
 Свойство возвращает второстепенную (minor) версию DWG.
 Синтаксис
C#
Visual Basic
Копировать Код
public MaintenanceReleaseVersion MinorVersion;
Копировать Код
Public ReadOnly Property MinorVersion As MaintenanceReleaseVersion
 Возвращает
 Возвращает версию технического релиза DWG. Значение из перечисления MaintenanceReleaseVersion.
 Описание
 Свойство возвращает второстепенную (minor) версию DWG.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.FullDwgVersion, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!