Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Light.LampColorType
 Послать отзыв
 Свойство представляет тип цвета лампы, который определяет, как именно задается цвет лампы (цветовая температура в Кельвинах или предустановленный цвет лампы).
 Синтаксис
C#
Visual Basic
Копировать Код
public LampColorType LampColorType;
Копировать Код
Public Property LampColorType As LampColorType
 Возвращает
 Возвращает тип цвета лампы. Перечисление LampColorType.
 Описание
 Свойство представляет тип цвета лампы, который определяет, как именно задается цвет лампы (цветовая температура в Кельвинах или предустановленный цвет лампы).
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Light, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!