Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector2d.!=
 Послать отзыв
 Оператор неравенства для класса Vector2d.
 Синтаксис
C#
Visual Basic
Копировать Код
public static bool operator !=( Vector2d a, Vector2d b );
Копировать Код
Public Shared Operator <>( a As Vector2d, b As Vector2d ) As Boolean
 Параметры
 Параметры
 Описание
 a
 Левый операнд. Тип Vector2d.
 b
 Правый операнд. Тип Vector2d.
 Возвращает
 Возвращает true, если соответствующие координаты векторов не совпадают. В противном случае возвращает false.
 Описание
 Оператор неравенства для класса Vector2d.
 Ссылки
 Teigha.Geometry.Vector2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!