Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeader.RemoveLeaderLine
 Послать отзыв
 Метод удаляет линию выноски с указанным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public void RemoveLeaderLine( int leaderLineIndex );
Копировать Код
Public Sub RemoveLeaderLine( leaderLineIndex As Integer )
 Параметры
 Параметры
 Описание
 leaderLineIndex
 Индекс удаляемой линии выноски. Тип int.
 Описание
 Метод удаляет линию выноски с указанным индексом. Удаление всех линий выноски приводит также к удалению кластера выноски.
 Ссылки
 Teigha.DatabaseServices.MLeader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!