Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 DimStyleTableRecord.Dimalttd
 Послать отзыв
 Свойство предназначено для настройки количества десятичных знаков в значениях допуска в альтернативных измерениях в размерах.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual int Dimalttd { get; set; }
Копировать Код
Public Overridable Property Dimalttd As Integer
 Возвращает
 Возвращает тип данных int.
 Описание
 В свойстве хранится количество разрядов после запятой в значениях допуска альтернативных измерений в размерах. В качестве значений свойства доступны целые числа в диапазоне от 0 до 8.
 Свойство также доступно через системную переменную DIMALTTD и пользовательское меню в окне изменения/создания размерного стиля:
  При изменении системной переменной DIMALTTD будет создан новый размерный стиль под названием <переопределение> на основе текущего с новым значением DIMALTTD.
 Условия
 Чтение и запись.
 Пример
 В качестве примера работы со свойством Dimalttd можно рассмотреть пример, приведенный в описании свойства Dimaltd, заменив в нем Dimaltd на Dimalttd.
 Ссылки
 Teigha.DatabaseServices.DimStyleTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!