Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocArrayCommonParameters.BasePlane
 Послать отзыв
 Свойство обеспечивает доступ к геометрии базовой плоскости.
 Синтаксис
C#
Visual Basic
Копировать Код
public FaceRef BasePlane;
Копировать Код
Public Property BasePlane() As FaceRef
 Возвращает
 Возвращает объект FaceRef.
 Описание
 Свойство обеспечивает доступ к геометрии базовой плоскости.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.AssocArrayCommonParameters, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!