Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Xrecord.XlateReferences
 Послать отзыв
 Данное свойство предоставляет доступ к логическому значению, которое указывает, требуется ли трансляция ссылок.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool XlateReferences;
Копировать Код
Public Property XlateReferences() As Boolean
 Возвращает
 Возвращает или задает логическое значение, которое определяет необходимость трансляции ссылок. Тип bool.
 Описание
 Данное свойство предоставляет доступ к логическому значению, которое указывает, требуется ли трансляция ссылок.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Xrecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!