Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ObjectId.GetObject
 Послать отзыв
 Возвращает объект, связанный с данным ObjectId.
 Синтаксис
C#
Visual Basic
Копировать Код
public DBObject GetObject( OpenMode mode );
Копировать Код
Public Function GetObject( mode As OpenMode ) As DBObject
 Параметры
 Параметры
 Описание
 mode
 Режим обращения к объекту из перечисления Teigha.DatabaseServices.OpenMode.
 Возвращает
 Возвращает экземпляр класса DBObject
 Описание
 Возвращает объект, связанный с данным ObjectId.
 Пример
 В примере приведен фрагмент кода, демонстрирующий открытие объекта из базы данных. По завершении работы с объектом, открытым таким образом, его необходимо принудительно удалить из памяти, чтобы избежать ошибок в работе платформы и вашего приложения.
С#
 Копировать Код
using Teigha.DatabaseServices; using HostMgd.ApplicationServices; public partial class Commands { private void WorkWithoutTransactions() { // Открываем таблицу блоков без транзакции BlockTable blockTable = Application.DocumentManager.MdiActiveDocument.Database.BlockTableId.GetObject(OpenMode.ForRead) as BlockTable; // действия с таблицей блоков // Принудительно удаляем объект из памяти по завершении работы с ним blockTable.Dispose(); } }
 Ссылки
 Teigha.DatabaseServices.ObjectId, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!