Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GradientBackground.ColorBottom
 Послать отзыв
 Свойство обеспечивает доступ к нижнему цвету градиентного фона.
 Синтаксис
C#
Visual Basic
Копировать Код
public EntityColor ColorBottom;
Копировать Код
Public Property ColorBottom As EntityColor
 Возвращает
 Возвращает нижний цвет градиента. Тип Teigha.Colors.EntityColor.
 Описание
 Свойство обеспечивает доступ к нижнему цвету градиентного фона.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.GradientBackground, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!