Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SymbolUtilityServices.IsBlockModelSpaceName
 Послать отзыв
 Метод позволяет проверить, соответствует ли переданное имя имени основного блока пространства модели.
 Синтаксис
C#
Visual Basic
Копировать Код
public static bool IsBlockModelSpaceName( ref String name );
Копировать Код
Public Shared Function IsBlockModelSpaceName( ByRef name As String ) As Boolean
 Параметры
 Параметры
 Описание
 name
 Проверяемое имя. Тип String.
 Возвращает
 Возвращает true, если указанное имя соответствует имени блока пространства модели. В противном случае возвращает false.
 Описание
 Метод позволяет проверить, соответствует ли переданное имя имени основного блока пространства модели. Перед сравнением строка нормализуется.
 В версии ACAD12 имя пространства модели — "*Model_Space", а для всех остальных версий имя пространства модели — "$Model_Space".
 Ссылки
 Teigha.DatabaseServices.SymbolUtilityServices, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!