Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector3dCollection.Vector3dCollection
 Послать отзыв
 Конструктор по умолчанию класса Vector3dCollection.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3dCollection();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса Vector3dCollection. Создает пустую коллекцию с ёмкостью по умолчанию, которая определяется константой Vector3dCollection.DefaultSize.
 Ссылки
 Teigha.Geometry.Vector3dCollection, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!