Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод RasterImage.EnableReactors
 Послать отзыв
 Синтаксис
C#
Visual Basic
public void EnableReactors(bool enable);
Public Sub EnableReactors(enable As bool)
 Параметры
 Параметры
 Описание
 enable
 Признак установки доступности (или ее отключения) для реактора
 Описание
 Устанавливает, должен или нет быть реактор доступен.
 Ссылки
 Teigha.DatabaseServices.RasterImage, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!