Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Структура Teigha.DatabaseServices.IdPair
 Послать отзыв
 This is class Teigha::DatabaseServices::IdPair.
 Синтаксис
C#
Visual Basic
[StructLayout(LayoutKind.Explicit, Pack=8), Wrapper("OdDbIdPair")] public struct IdPair { }
<StructLayout(LayoutKind.Explicit, Pack=8), Wrapper("OdDbIdPair")> Public Structure IdPair End Structure
 Методы
 Конструкторы
 Имя
 Описание
 IdPair
 This is IdPair, a member of class IdPair.
 Топики
 Имя
 Описание
 IdPair Методы
 Ниже перечислены методы класса IdPair.
 IdPair Операторы
 Ниже перечислены операторы класса IdPair.
 IdPair Свойства
 Ниже перечислены свойства класса IdPair.
 Ссылки
 IdPair Методы, IdPair Операторы, IdPair Свойства, Методы, Топики, IdPair Методы, IdPair Операторы, IdPair Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!