Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Background.GetBackgroundDictionaryId
 Послать отзыв
 Метод позволяет получить идентификатор словаря фонов в указанной базе данных.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.ObjectId GetBackgroundDictionaryId( ref DatabaseServices.Database database, bool createIfNotPresent );
Копировать Код
Public Function GetBackgroundDictionaryId( ByRef database As DatabaseServices.Database, createIfNotPresent As Boolean ) As DatabaseServices.ObjectId
 Параметры
 Параметры
 Описание
 database
 База данных, в которой следует получить доступ к словарю фонов. Тип DatabaseServices.Database.
 createIfNotPresent
 Предать true, если словарь должен быть создан в случае его отсутствия. В противном случае передать false. Тип bool.
 Возвращает
 Возвращает идентификатор словаря фонов. Тип DatabaseServices.ObjectId.
 Описание
 Метод предоставляет возможность получить идентификатор словаря фонов в указанной базе данных. Параметр createIfNotPresent позволяет создать словарь, если в базе данных его пока нет.
 Ссылки
 Teigha.DatabaseServices.Background, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!