Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MeshPointMaps.DestPonints
 Послать отзыв
 Свойство DestPonints представляет коллекцию точек назначения.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point2dCollection DestPonints;
Копировать Код
Public Property DestPonints As Point2dCollection
 Возвращает
 Возвращает коллекцию точек назначения. Тип Point2dCollection.
 Описание
 Свойство DestPonints представляет коллекцию точек назначения.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MeshPointMaps, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!