Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AbstractViewPE.GetPlotExtents
 Послать отзыв
 Метод предоставляет границы печати в системе координат камеры связанного видового экрана.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool GetPlotExtents( ref BoundBlock3d extents );
Копировать Код
Public Function GetPlotExtents( ByRef extents As BoundBlock3d ) As Boolean
 Параметры
 Параметры
 Описание
 extents
 Выходные границы печати. Тип BoundBlock3d.
 Возвращает
 Возвращает true в случае успешного завершения метода. В противном случае возвращает false.
 Описание
 Метод предоставляет границы печати в системе координат камеры связанного видового экрана. Компоненты границ обрезаются до диапазона [-10e100..10e100].
 Ссылки
 Teigha.DatabaseServices.AbstractViewPE, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!