Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод LinetypeTableRecord.ShapeRotationAt
 Послать отзыв
 Синтаксис
C#
Visual Basic
public double ShapeRotationAt(int index);
Public Function ShapeRotationAt(index As Integer) As Double
 Параметры
 Параметры
 Описание
 index
 Индекс (начинающийся с 0) строки, для которой производится определение угла поворота
 Описание
 Этот метод возвращает значение угла поворота (в радианах) формы (текстовой строки) для строки LinetypeTableRecord со значением индекса index. Если бит isUcsOriented установлен в inetypeTableRecord, то угол относится к текущему UCS. В противном случае он отсчитывается от линии направления. Положительный угол считается против часовой стрелки при взгляде сверху вниз по нормали к плоскости, содержащей текст (или нормали UCS, если isUcsOriented установлен в 1). Если в строке LinetypeTableRecord нет формы (текстовой строки), возвращается 0.
 Ссылки
 Teigha.DatabaseServices.LinetypeTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!