Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.SplineEntity2d.Knots
 Послать отзыв
 Свойство Knots представляет узловой вектор данного сплайна. Не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public KnotCollection Knots;
Копировать Код
Public ReadOnly Property Knots As KnotCollection
 Возвращает
 Возвращает узловой вектор сплайна. Тип KnotCollection.
 Описание
 Свойство Knots представляет узловой вектор данного сплайна. Не реализовано.
 Замечания
 Интервалы между двумя последовательными узлами разбивают сплайн на полиномиальные или рациональные участки.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.SplineEntity2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!