Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Matrix3d.Mirroring
 Послать отзыв
 Метод формирует матрицу преобразования, соответствующего зеркальному отражению относительно заданной плоскости.
 Синтаксис
C#
Visual Basic
Копировать Код
public Matrix3d Mirroring( ref Plane plane );
Копировать Код
Public Function Mirroring( ByRef plane As Plane ) As Matrix3d
 Параметры
 Параметры
 Описание
 plane
 Плоскость симметрии. Тип Plane.
 Возвращает
 Возвращает матрицу преобразования. Тип Matrix3d.
 Описание
 Метод формирует матрицу преобразования, соответствующего зеркальному отражению относительно заданной плоскости.
 Ссылки
 Teigha.Geometry.Matrix3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!