Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FileDependencyInfo.VersionGuid
 Послать отзыв
 Свойство VersionGuid представляет GUID версии файла.
 Синтаксис
C#
Visual Basic
Копировать Код
public String VersionGuid;
Копировать Код
Public ReadOnly Property VersionGuid As String
 Возвращает
 Возвращает GUID версии файла. Тип String.
 Описание
 Свойство VersionGuid представляет GUID версии файла.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.FileDependencyInfo, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!