Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.IndexCreation
 Послать отзыв
 Перечисление IndexCreation определяет константы для настройки переменной заголовка INDEXCTL.
 Синтаксис
C#
Visual Basic
Копировать Код
[Flags] public enum IndexCreation { NoIndex = 0, IndexByLayer = 1, IndexSpatially = 2 }
Копировать Код
<Flags> Public Enum IndexCreation NoIndex = 0 IndexByLayer = 1 IndexSpatially = 2 End Enum
 Члены
 Члены
 Описание
 IndexByLayer
 Значение: 1. Включено слоевое индексирование.
 IndexSpatially
 Значение: 2. Включено пространственное индексирование.
 NoIndex
 Значение: 0. Не создаются никакие индексы - ни слоевые, ни пространственные.
 Описание
 Перечисление IndexCreation представляет константы для настройки переменной заголовка INDEXCTL.
 Переменная INDEXCTL определяет варианты индексирования в базе данных (слоевое или пространственное индексирование). Константы могут комбинироваться с использованием побитового OR.
 Ваши комментарии по поводу этого топика: Послать отзыв!