Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.NurbSurface.NumberOfControlPointsInU
 Послать отзыв
 Свойство представляет количество управляющих вершин данной поверхности в направлении u.
 Синтаксис
C#
Visual Basic
Копировать Код
public int NumberOfControlPointsInU;
Копировать Код
Public ReadOnly Property NumberOfControlPointsInU As Integer
 Возвращает
 Возвращает количество управляющих вершин поверхности. Тип int.
 Описание
 Свойство представляет количество управляющих вершин данной поверхности в направлении u.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.NurbSurface, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!