Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.EllipticalArc2d.StartAngle
 Послать отзыв
 Свойство StartAngle представляет значение начального угла данной эллиптической дуги.
 Синтаксис
C#
Visual Basic
Копировать Код
public double StartAngle;
Копировать Код
Public ReadOnly Property StartAngle As Double
 Возвращает
 Возвращает значение начального угла эллиптической дуги. Тип double.
 Описание
 Свойство StartAngle представляет значение начального угла данной эллиптической дуги.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.EllipticalArc2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!