Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.IdMappingEventArgs
 Послать отзыв
 Этот класс представляет данные для событий, связанных с сопоставлением (мэппингом) идентификаторов (BeginDeepClone, BeginDeepCloneTranslation, InsertMappingAvailable и WblockMappingAvailable) в базе данных.
 Иерархия классов
Teigha::DatabaseServices::IdMappingEventArgs
 Синтаксис
C#
Visual Basic
Копировать Код
public class IdMappingEventArgs : System.EventArgs;
Копировать Код
Public Class IdMappingEventArgs Inherits System.EventArgs
 Описание
 Этот класс представляет данные для событий, связанных с сопоставлением (мэппингом) идентификаторов (BeginDeepClone, BeginDeepCloneTranslation, InsertMappingAvailable и WblockMappingAvailable) в базе данных.
 Топики
 Имя
 Описание
 IdMappingEventArgs Свойства
 Ниже перечислены свойства класса IdMappingEventArgs.
 Ссылки
 IdMappingEventArgs Свойства, Топики, IdMappingEventArgs Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!