Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.EllipticalCone.MajorRadius
 Послать отзыв
 Свойство MajorRadius представляет текущее значение большого радиуса данного эллиптического конуса.
 Синтаксис
C#
Visual Basic
Копировать Код
public double MajorRadius;
Копировать Код
Public Property MajorRadius As Double
 Возвращает
 Возвращает значение большого радиуса эллиптического конуса. Тип double.
 Описание
 Свойство MajorRadius представляет текущее значение большого радиуса данного эллиптического конуса.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.Geometry.EllipticalCone, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!