Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Point3dCollection.SyncRoot
 Послать отзыв
 Свойство предоставляет объект, который можно использовать для синхронизации доступа к этой коллекции.
 Синтаксис
C#
Visual Basic
Копировать Код
public Object SyncRoot;
Копировать Код
Public Property SyncRoot() As Object
 Возвращает
 Возвращает объект, используемый для синхронизации доступа к коллекции. Тип Object.
 Описание
 Свойство предоставляет объект, который можно использовать для синхронизации доступа к этой коллекции.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.Point3dCollection, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!