Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GripData.ViewportDraw
 Послать отзыв
 Метод предоставляет указатель на обратный вызов, который отвечает за отрисовку пользовательской графики глифа ручки, зависящей от видового экрана. Возвращаемое значение может быть нулевым.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool ViewportDraw( ref GraphicsInterface.ViewportDraw worldDraw, ObjectId entityId, DrawType t, Point3d? imageGripPoint, int gripSizeInPixels );
Копировать Код
Public Function ViewportDraw( ByRef worldDraw As GraphicsInterface.ViewportDraw, entityId As ObjectId, t As DrawType, imageGripPoint As Point3d?, gripSizeInPixels As Integer ) As Boolean
 Параметры
 Параметры
 Описание
 worldDraw
 Входной интерфейс Teigha.GraphicsInterface.ViewportDraw.
 entityId
 Идентификатор объекта чертежа. Тип ObjectId.
 t
 Тип отображения ручки. Перечисление GripData.DrawType.
 imageGripPoint
 Точка привязки изображения ручки. Тип Point3d?.
 gripSizeInPixels
 Размер ручки в пикселях. Тип int.
 Возвращает
 Возвращает true в случае успешного завершения операции. В противном случае возвращает false.
 Описание
 Метод предоставляет указатель на обратный вызов, который отвечает за отрисовку пользовательской графики глифа ручки, зависящей от видового экрана. Возвращаемое значение может быть нулевым.
 Ссылки
 Teigha.DatabaseServices.GripData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!