Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.TransactionManager.QueueForGraphicsFlush
 Послать отзыв
 Этот метод формирует очередь графического обновления всех измененных объектов-резидентов любых транзакций этого менеджера транзакций.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void QueueForGraphicsFlush();
Копировать Код
Public virtual Sub QueueForGraphicsFlush()
 Описание
 Этот метод формирует очередь графического обновления всех измененных объектов-резидентов любых транзакций этого менеджера транзакций.
 Ссылки
 Teigha.DatabaseServices.TransactionManager, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!