Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MText.ColumnType
 Послать отзыв
 Свойство представляет тип текстовых колонок у данного объекта MText.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.ColumnType ColumnType;
Копировать Код
Public Property ColumnType As DatabaseServices.ColumnType
 Возвращает
 Возвращает текущий тип текстовых колонок. Перечисление DatabaseServices.ColumnType.
 Описание
 Свойство представляет тип текстовых колонок (динамические / статические) у данного объекта MText.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MText, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!