Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DataCell.SetString
 Послать отзыв
 Метод устанавливает для этой ячейки значение типа String.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetString( ref String value );
Копировать Код
Public Sub SetString( ByRef value As String )
 Параметры
 Параметры
 Описание
 value
 Входное значение для ячейки. Тип String.
 Описание
 Метод устанавливает для этой ячейки значение типа String, заданное входным аргументом value.
 Ссылки
 Teigha.DatabaseServices.DataCell, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!