Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DrawOrderTable.FirstEntityIsDrawnBeforeSecond
 Послать отзыв
 Метод предназначен для проверки, отображается ли первый объект раньше второго согласно последовательности, предусмотренной данным объектом DrawOrderTable.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool FirstEntityIsDrawnBeforeSecond( DatabaseServices.ObjectId first, DatabaseServices.ObjectId second );
Копировать Код
Public Function FirstEntityIsDrawnBeforeSecond( first As DatabaseServices.ObjectId, second As DatabaseServices.ObjectId ) As Boolean
 Параметры
 Параметры
 Описание
 first
 Идентификатор первого объекта. Тип DatabaseServices.ObjectId.
 second
 Идентификатор второго объекта. Тип DatabaseServices.ObjectId.
 Возвращает
 Возвращает true, если данный экземпляр DrawOrderTable предполагает отрисовку сначала первого объекта, а потом второго. В противном случае возвращает false.
 Описание
 Метод предназначен для проверки, отображается ли первый объект раньше второго согласно последовательности, предусмотренной данным объектом DrawOrderTable.
 Ссылки
 Teigha.DatabaseServices.DrawOrderTable, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!