Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Curve.GetGeCurve
 Послать отзыв
 Метод GetGeCurve, член класса Curve. Возвращает для данной кривой объект Curve3d, вычисленный с заданной точностью tolerance.
 Синтаксис
C#
Visual Basic
Копировать Код
public Curve3d GetGeCurve( Tolerance tolerance );
Копировать Код
Public Function GetGeCurve( tolerance As Tolerance ) As Curve3d
 Параметры
 Параметры
 Описание
 tolerance
 Заданная точность вычисления кривой, тип Tolerance.
 Возвращает
 Метод возвращает экземпляр класса Curve3d для данной кривой.
 Описание
 Метод GetGeCurve, член класса Curve. Возвращает объект Curve3d для данной кривой, вычисленный с заданной точностью tolerance.
 Ссылки
 Teigha.DatabaseServices.Curve, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!