Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CellRange.GetCustomData
 Послать отзыв
 Метод возвращает значение пользовательских данных из текущей ячейки данного диапазона.
 Синтаксис
C#
Visual Basic
Копировать Код
public Object GetCustomData( ref String key );
Копировать Код
Public Function GetCustomData( ByRef key As String ) As Object
 Параметры
 Параметры
 Описание
 key
 Ключ, используемый для доступа к пользовательским данным. Тип String.
 Возвращает
 Возвращает пользовательские данные. Тип Object.
 Описание
 Метод возвращает значение пользовательских данных из текущей ячейки данного диапазона.
 Ссылки
 Teigha.DatabaseServices.CellRange, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!