Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Перечисление Teigha.DatabaseServices.AssocStatus
 Послать отзыв
 This is record Teigha::DatabaseServices::AssocStatus.
 Синтаксис
C#
Visual Basic
[Wrapper("AcDbAssocStatus")] public enum AssocStatus { IsUpToDateAssocStatus = 0, ChangedDirectlyAssocStatus = 1, ChangedTransitivelyAssocStatus = 2, ChangedNoDifferenceAssocStatus = 3, FailedToEvaluateAssocStatus = 4, ErasedAssocStatus = 5, SuppressedAssocStatus = 6 }
<Wrapper("AcDbAssocStatus")> Public Enum AssocStatus IsUpToDateAssocStatus = 0 ChangedDirectlyAssocStatus = 1 ChangedTransitivelyAssocStatus = 2 ChangedNoDifferenceAssocStatus = 3 FailedToEvaluateAssocStatus = 4 ErasedAssocStatus = 5 SuppressedAssocStatus = 6 End Enum
 Ваши комментарии по поводу этого топика: Послать отзыв!