Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.EllipticalCone.IsOuterNormal
 Послать отзыв
 Свойство IsOuterNormal позволяет проверить, направлена ли нормаль конической поверхности наружу от тела конуса.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsOuterNormal;
Копировать Код
Public ReadOnly Property IsOuterNormal As Boolean
 Возвращает
 Возвращает true, если нормаль направлена наружу от тела конуса. В противном случае возвращает false.
 Описание
 Свойство IsOuterNormal позволяет проверить, направлена ли нормаль конической поверхности наружу от тела конуса.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.EllipticalCone, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!