Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.HaloGap
 Послать отзыв
 Синтаксис
C#
Visual Basic
public int HaloGap;
Public Property HaloGap() As Integer
 Описание
 Возвращает или устанавливает текущее значение HALOGAP для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!