Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Surface.IsClosedInU
 Послать отзыв
 Метод позволяет проверить, является ли данная поверхность замкнутой в направлении U.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsClosedInU();
Копировать Код
Public Function IsClosedInU() As Boolean
 Возвращает
 Возвращает true, если в пределах точности Tolerance.Global данную поверхность можно считать замкнутой в направлении U. В противном случае возвращает false.
 Описание
 Метод позволяет проверить, является ли данная поверхность замкнутой в направлении U. Предполагает реализацию в производных классах.
 Замечания
 Используется вызов метода Surface.IsClosedInU(Tolerance tolerance) с точностью по умолчанию Tolerance.Global.
 Ссылки
 Teigha.Geometry.Surface, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!