Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MTextFragment.TrackingFactor
 Послать отзыв
 Свойство возвращает коэффициент трекинга в данном фрагменте.
 Синтаксис
C#
Visual Basic
Копировать Код
public double TrackingFactor;
Копировать Код
Public ReadOnly Property TrackingFactor As Double
 Возвращает
 Возвращает коэффициент трекинга. Тип double.
 Описание
 Свойство возвращает коэффициент трекинга в данном фрагменте. Этот безразмерный коэффициент отражает изменение межбуквенного расстояния.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.MTextFragment, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!