Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve2d.GetSamplePoints
 Послать отзыв
 Метод позволяет получить массив точек на кривой на заданном параметрическом подынтервале. Шаг между любыми двумя последовательными точками ограничен сверху указанным предельным прогибом кривой над соединяющим точки линейным сегментом.
 Синтаксис
C#
Visual Basic
Копировать Код
public PointOnCurve2d[] GetSamplePoints( double fromParameter, double toParameter, double approxEps );
Копировать Код
Public Function GetSamplePoints( fromParameter As Double, toParameter As Double, approxEps As Double ) As PointOnCurve2d()
 Параметры
 Параметры
 Описание
 fromParameter
 Начало параметрического подынтервала. Тип double.
 toParameter
 Конец параметрического подынтервала. Тип double.
 approxEps
 Предельный прогиб кривой между любыми двумя последовательными точками массива. Тип double.
 Возвращает
 Возвращает массив точек на кривой. Тип PointOnCurve2d[].
 Описание
 Метод позволяет получить массив точек на кривой на параметрическом подынтервале от fromParameter до toParameter. Шаг между любыми двумя последовательными точками ограничен сверху предельным прогибом approxEps кривой над соединяющим точки линейным сегментом.
 Ссылки
 Teigha.Geometry.Curve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!