Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotStyleTable
 Послать отзыв
 Класс PlotStyleTable реализует таблицы стилей печати.
 Иерархия классов
Teigha::DatabaseServices::PlotStyleTable
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdPsPlotStyleTable")] public class PlotStyleTable : RXObject
Копировать Код
<Wrapper("OdPsPlotStyleTable")> Public Class PlotStyleTable Inherits RXObject
 Описание
 Класс PlotStyleTable реализует таблицы стилей печати.
 Топики
 Имя
 Описание
 PlotStyleTable Методы
 Ниже перечислены методы класса PlotStyleTable.
 PlotStyleTable Свойства
 Ниже перечислены свойства класса PlotStyleTable.
 Ссылки
 PlotStyleTable Методы, PlotStyleTable Свойства, Топики, PlotStyleTable Методы, PlotStyleTable Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!