Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Cone.Cone
 Послать отзыв
 Конструктор класса Cone. Создает полный конус с заданными центром и радиусом основания, осью конуса и углом при вершине.
 Синтаксис
C#
Visual Basic
Копировать Код
public Cone( double cosineAngle, double sineAngle, Point3d baseOrigin, double baseRadius, Vector3d axisOfSymmetry );
Копировать Код
Public Sub New( cosineAngle As Double, sineAngle As Double, baseOrigin As Point3d, baseRadius As Double, axisOfSymmetry As Vector3d )
 Параметры
 Параметры
 Описание
 cosineAngle
 Косинус угла между осью конуса и его образующей. Тип double.
 sineAngle
 Синус угла между осью конуса и его образующей. Тип double.
 baseOrigin
 Центр окружности в основании конуса. Тип Point3d.
 baseRadius
 Радиус основания конуса. Тип double.
 axisOfSymmetry
 Направление оси конуса. Тип Vector3d.
 Описание
 Конструктор класса Cone. Создает полный конус с заданными центром и радиусом основания, осью конуса и углом при вершине.
 Ссылки
 Teigha.Geometry.Cone, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!