Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.OffsetSurface.ConstructionSurface
 Послать отзыв
 Свойство ConstructionSurface представляет базовую поверхность данного объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public Geometry.Surface ConstructionSurface;
Копировать Код
Public ReadOnly Property ConstructionSurface As Geometry.Surface
 Возвращает
 Возвращает базовую поверхность. Тип Geometry.Surface.
 Описание
 Свойство ConstructionSurface представляет базовую поверхность данного объекта.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.OffsetSurface, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!