Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Database.Wblock ()
 Послать отзыв
 Синтаксис
C#
Visual Basic
public Database Wblock();
Public Function Wblock() As Database
 Описание
 Создает новый объект типа база данных, и затем использует механизм wblockClone для записи содержимого геометрических объектов базы данных, из которой вызывается метод, в новую базу данных.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!