Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.BeginWblockObjectsEventArgs
 Послать отзыв
 Класс представляет данные для события BeginWblockObjects базы данных.
 Иерархия классов
Teigha::DatabaseServices::BeginWblockObjectsEventArgs
 Синтаксис
C#
Visual Basic
Копировать Код
public class BeginWblockObjectsEventArgs : System.EventArgs;
Копировать Код
Public Class BeginWblockObjectsEventArgs Inherits System.EventArgs
 Описание
 Класс представляет данные для события BeginWblockObjects базы данных.
 Методы
 Конструкторы
 ПоказатьInternal
 Нет совпадений по текущему фильтру
 Имя
 Описание
 BeginWblockObjectsEventArgs
 This is BeginWblockObjectsEventArgs, a member of class BeginWblockObjectsEventArgs.
 Топики
 Имя
 Описание
 BeginWblockObjectsEventArgs Свойства
 Ниже перечислены свойства класса BeginWblockObjectsEventArgs.
 Ссылки
 BeginWblockObjectsEventArgs Свойства, Методы, Топики, BeginWblockObjectsEventArgs Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!