Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Hatch.PatternScale
 Послать отзыв
 Синтаксис
C#
Visual Basic
public double PatternScale;
Public Property PatternScale() As Double
 Описание
 Обеспечивает доступ к масштабу образца для объекта заливки.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Hatch, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!