Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Curve.Spline
 Послать отзыв
 Возвращает указатель на аппроксимацию данной кривой сплайном.
 Синтаксис
C#
Visual Basic
Копировать Код
public Teigha.DatabaseServices.Spline Spline;
Копировать Код
Public Property Spline() As Teigha.DatabaseServices.Spline
 Возвращает
 Указатель на объект Spline.
 Описание
 Возвращает указатель на аппроксимацию данной кривой сплайном.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Curve, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!