Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Usrtimer
 Послать отзыв
 Синтаксис
C#
Visual Basic
public bool Usrtimer;
Public Property Usrtimer() As bool
 Описание
 Возвращает текущее значение переменной USRTIMER базы данных. Значение false соответствует выключенному положение, а true — включенному положению.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!