Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Hatch.NumberOfLoops
 Послать отзыв
 Синтаксис
C#
Visual Basic
public int NumberOfLoops;
Public Property NumberOfLoops() As Integer
 Описание
 Возвращает общее количество петель контура в объекте заливки. Петли контура определяют области, которые будут заливаться.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.Hatch, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!