Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CompoundObjectId.DwgOutFields
 Послать отзыв
 Метод предназначен для записи данных этого объекта в файл .dwg.
 Синтаксис
C#
Visual Basic
Копировать Код
public void DwgOutFields( ref DwgFiler filer, ref Database hostDatabase );
Копировать Код
Public Sub DwgOutFields( ByRef filer As DwgFiler, ByRef hostDatabase As Database )
 Параметры
 Параметры
 Описание
 filer
 Входной DWG-файлер, в который производится запись данных. Тип DwgFiler.
 hostDatabase
 Главная база данных. Тип Database.
 Описание
 Метод предназначен для записи данных этого объекта в файл .dwg с использованием переданного в метод объекта DwgFiler.
 Ссылки
 Teigha.DatabaseServices.CompoundObjectId, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!