Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FullSubentityPath.Equals
 Послать отзыв
 Метод предназначен для проверки идентичности данного объекта указанному объекту.
 Синтаксис
C#
Visual Basic
Копировать Код
public sealed override bool Equals( ref Object obj );
Копировать Код
Public NotOverridable Overrides Function Equals( ByRef obj As Object ) As Boolean
 Параметры
 Параметры
 Описание
 obj
 Объект, по отношению к которому выполняется проверка на идентичность. Тип Object.
 Возвращает
 Возвращает true, если данный объект идентичен объекту obj. В противном случае возвращает false.
 Описание
 Метод предназначен для проверки идентичности данного объекта FullSubentityPath указанному объекту obj.
 Ссылки
 Teigha.DatabaseServices.FullSubentityPath, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!