Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Viewport.On
 Послать отзыв
 Свойство On позволяет определить состояние данного видового экрана (включен или выключен).
 Синтаксис
C#
Visual Basic
Копировать Код
public bool On;
Копировать Код
Public Property On As Boolean
 Возвращает
 Возвращает true, если видового экрана включен. В противном случае возвращает false.
 Описание
 Свойство On позволяет определить состояние данного видового экрана (включен или выключен).
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Viewport, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!