Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CubicSplineCurve3d.CubicSplineCurve3d
 Послать отзыв
 Конструктор класса CubicSplineCurve3d. Создает кубический сплайн, интерполирующий переданную кривую с заданной точностью интерполяции.
 Синтаксис
C#
Visual Basic
Копировать Код
public CubicSplineCurve3d( ref Curve3d curve, double epsilon );
Копировать Код
Public Sub New( ByRef curve As Curve3d, epsilon As Double )
 Параметры
 Параметры
 Описание
 curve
 Кривая, для которой следует создать интерполирующий ее кубический сплайн. Тип Curve3d.
 epsilon
 Заданная точность интерполяции. Тип double.
 Описание
 Конструктор класса CubicSplineCurve3d. Создает кубический сплайн, интерполирующий переданную кривую с заданной точностью интерполяции epsilon.
 Ссылки
 Teigha.Geometry.CubicSplineCurve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!