Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SubentityOverrule.DeleteSubentPaths
 Послать отзыв
 Данный метод переопределяет метод Entity.DeleteSubentPaths() и вызывает его при реализации по умолчанию.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void DeleteSubentPaths( ref Entity entity, ref FullSubentityPath[] paths );
Копировать Код
Public virtual Sub DeleteSubentPaths( ByRef entity As Entity, ByRef paths As FullSubentityPath[] )
 Параметры
 Параметры
 Описание
 entity
 Объект чертежа, тип Entity.
 paths
 Массив полных путей подобъектов FullSubentityPath[], которые идентифицируют подобъекты, предполагаемые к удалению из объекта entity.
 Описание
 Данный метод переопределяет метод Entity.DeleteSubentPaths() и вызывает его при реализации по умолчанию.
 Метод Entity.DeleteSubentityPaths() в реализации по умолчанию удаляет из геометрического объекта один или несколько подобъектов. С помощью метода DeleteSubentPaths() настоящего класса можно переопределить этот механизм работы метода.
 Ссылки
 Teigha.DatabaseServices.SubentityOverrule, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!