Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBDictionary.Remove
 Послать отзыв
 Метод удаляет из словаря запись c заданным идентификатором объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Remove( ObjectId objId );
Копировать Код
Public Sub Remove( objId As ObjectId )
 Параметры
 Параметры
 Описание
 objId
 Идентификатор ObjectId удаляемого объекта.
 Описание
 Метод Remove удаляет из словаря запись c заданным идентификатором объекта.
 Ссылки
 Teigha.DatabaseServices.DBDictionary, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!