Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.OpenCloseTransaction.GetObject
 Послать отзыв
 Метод обеспечивает доступ к объекту с указанным идентификатором в указанном режиме доступа. Дополнительный аргумент позволяет управлять опцией доступа к ранее удаленным объектам.
 Синтаксис
C#
Visual Basic
Копировать Код
public override DBObject GetObject( ObjectId id, OpenMode mode, bool openErased );
Копировать Код
Public Overrides Function GetObject( id As ObjectId, mode As OpenMode, openErased As Boolean ) As DBObject
 Параметры
 Параметры
 Описание
 id
 Идентификатор объекта, к которому требуется получить доступ. Тип ObjectId.
 mode
 Требуемый режим доступа к объекту. Перечисление OpenMode.
 openErased
 Данный флаг определяет, следует ли получать доступ к объекту, если он был удалён. Тип bool.
 Возвращает
 Возвращает дескриптор полученного объекта. Тип DBObject.
 Описание
 Метод обеспечивает доступ к объекту с указанным идентификатором в указанном режиме доступа. Аргумент openErased делает возможным доступ к удаленным объектам, если передать с ним значение true. Если передать значение false, попытка доступа к удалённому объекту приведёт к получению кода ошибки.
 Используется обращение к методу Open() транзакции верхнего уровня с передачей ему всех полученных аргументов. Доступ к объектам возможен только в рамках транзакции верхнего уровня, поэтому этот метод избавляет от необходимости сохранять указатель на транзакцию верхнего уровня или использовать для этого свойство TransactionManager.TopTransaction. Рекомендуется проверять валидность полученного объекта.
 Ссылки
 Teigha.DatabaseServices.OpenCloseTransaction, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!