Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Scale2d.==
 Послать отзыв
 Оператор равенства структуры Scale2d.
 Синтаксис
C#
Visual Basic
Копировать Код
public static bool operator ==( Scale2d a, Scale2d b );
Копировать Код
Public Shared Operator =( a As Scale2d, b As Scale2d ) As Boolean
 Параметры
 Параметры
 Описание
 a
 Левый операнд. Тип Scale2d.
 b
 Правый операнд. Тип Scale2d.
 Возвращает
 Возвращает true в случае равенства левого и правого операндов. В противном случае возвращает false.
 Описание
 Оператор равенства структуры Scale2d.
 Два экземпляра структуры Scale2d считаются равными, если в пределах используемой точности одновременно выполняются следующие условия:
масштабные коэффициенты по оси X равны;
масштабные коэффициенты по оси Y равны.
 Ссылки
 Teigha.Geometry.Scale2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!