Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GraphNode.NumCycleOut
 Послать отзыв
 Свойство возвращает количество исходящих циклических ссылок в данном узле графа.
 Синтаксис
C#
Visual Basic
Копировать Код
public int NumCycleOut;
Копировать Код
Public ReadOnly Property NumCycleOut As Integer
 Возвращает
 Возвращает количество исходящих циклических ссылок. Тип int.
 Описание
 Свойство возвращает количество исходящих циклических ссылок в данном узле графа.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.GraphNode, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!