Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.TextStyle
 Послать отзыв
 Метод позволяет получить ObjectId текстового стиля указанной ячейки.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual DatabaseServices.ObjectId TextStyle( int row, int col );
Копировать Код
Public virtual Function TextStyle( row As Integer, col As Integer ) As DatabaseServices.ObjectId
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 col
 Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
 Возвращает
 Возвращает идентификатор текстового стиля. Тип DatabaseServices.ObjectId.
 Описание
 Метод позволяет получить ObjectId текстового стиля указанной ячейки.
 Замечания
 Для получения того же результата предпочтительнее использовать метод Table.Cells[row,column].TextStyleId.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!