Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 ViewportTableRecord.GetPreviousBackground(DrawableType)
 Послать отзыв
 Метод не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectId GetPreviousBackground(DrawableType type)
Копировать Код
Public Function GetPreviousBackground(type As DrawableType) As ObjectId
 Ссылки
 ViewportTableRecord Класс, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!