Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector2d
 Послать отзыв
 Структура Vector2d представляет векторы в двумерном пространстве.
 Иерархия классов
Teigha::Geometry::Vector2d
 Синтаксис
C#
Visual Basic
Копировать Код
[DefaultMember("Coordinate")] [Wrapper("OdGeVector2d")] public struct Vector2d : IFormattable
Копировать Код
<DefaultMember("Coordinate")> <Wrapper("OdGeVector2d")> Public Structure Vector2d Implements IFormattable
 Описание
 Структура Vector2d представляет векторы в двумерном пространстве. Её экземпляры можно рассматривать как двухэлементный массив[2] чисел двойной точности.
 Методы
 Конструкторы
 Имя
 Описание
 Vector2d
 Это обзор перегрузок Vector2d.
 Топики
 Имя
 Описание
 Vector2d Методы
 Ниже перечислены методы класса Vector2d.
 Vector2d Операторы
 Ниже перечислены операторы класса Vector2d.
 Vector2d Свойства
 Ниже перечислены свойства класса Vector2d.
 Ссылки
 Vector2d Конструктор, Vector2d Методы, Vector2d Операторы, Vector2d Свойства, Методы, Топики, Vector2d Методы, Vector2d Операторы, Vector2d Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!