Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LinkedTableData.IsLinked
 Послать отзыв
 Метод позволяет проверить, связана ли указанная ячейка с источником данных.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual bool IsLinked( int row, int column );
Копировать Код
Public Overridable Function IsLinked( row As Integer, column As Integer ) As Boolean
 Параметры
 Параметры
 Описание
 row
 Индекс строки. Тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 column
 Индекс столбца. Тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице.
 Возвращает
 Возвращает true, если ячейка связана с источником данных. В противном случае возвращает false.
 Описание
 Метод позволяет проверить, связана ли указанная ячейка с источником данных.
 Ссылки
 Teigha.DatabaseServices.LinkedTableData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!