Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.LinearEntity3d.IsParallelTo
 Послать отзыв
 Метод позволяет проверить параллельность данного объекта и указанного линейного объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsParallelTo( ref LinearEntity3d line );
Копировать Код
Public Function IsParallelTo( ByRef line As LinearEntity3d ) As Boolean
 Параметры
 Параметры
 Описание
 line
 Входной линейный объект. Тип LinearEntity3d.
 Возвращает
 Возвращает true, если данный объект можно считать параллельным объекту line. В противном случае возвращает false.
 Описание
 Метод позволяет проверить параллельность данного объекта и указанного линейного объекта. Используется вызов метода LinearEntity3d.IsParallelTo(LinearEntity3d line, Tolerance tolerance) с точностью, равной Tolerance.Global.
 Ссылки
 Teigha.Geometry.LinearEntity3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!