Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 BlockTableRecord.LayoutId
 Послать отзыв
 Свойство предназначено для хранения ObjectId листа документа, к которому на текущий момент относится блок.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectId LayoutId { get; set; }
Копировать Код
Public Property LayoutId As ObjectId
 Возвращает
 Возвращает ObjectId
 Описание
 В свойстве хранится ObjectId листа документа, к которому в текущий момент относится определение блока.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.BlockTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!