Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbCurve3dFitData.KnotParam
 Послать отзыв
 Свойство KnotParam представляет использованный метод узловой параметризации сплайна.
 Синтаксис
C#
Visual Basic
Копировать Код
public KnotParameterizationEnum KnotParam;
Копировать Код
Public ReadOnly Property KnotParam As KnotParameterizationEnum
 Возвращает
 Возвращает метод узловой параметризации сплайна. Перечисление KnotParameterizationEnum.
 Описание
 Свойство KnotParam представляет использованный метод узловой параметризации сплайна.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.NurbCurve3dFitData, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!