Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Xline.UnitDir
 Послать отзыв
 Свойство UnitDir обеспечивает доступ к направляющему единичному вектору объекта Xline.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d UnitDir;
Копировать Код
Public Property UnitDir() As Vector3d
 Возвращает
 Возвращает или задает направляющий единичный вектор данного объекта Xline. Тип Vector3d.
 Описание
 Свойство UnitDir обеспечивает доступ к направляющему единичному вектору объекта Xline.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Xline, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!