Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CurveCurveIntersector2d.OrderWithRegardsTo1
 Послать отзыв
 Метод сортирует точки пересечения по возрастанию значений параметра первой кривой.
 Синтаксис
C#
Visual Basic
Копировать Код
public void OrderWithRegardsTo1();
Копировать Код
Public Sub OrderWithRegardsTo1()
 Описание
 Метод сортирует точки пересечения по возрастанию значений параметра первой кривой.
 Ссылки
 Teigha.Geometry.CurveCurveIntersector2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!