Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LinkedTableData.GetDataLink
 Послать отзыв
 Метод позволяет получить идентификатор объекта внешней ссылки из указанной ячейки.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual DatabaseServices.ObjectId GetDataLink( int row, int column );
Копировать Код
Public Overridable Function GetDataLink( row As Integer, column As Integer ) As DatabaseServices.ObjectId
 Параметры
 Параметры
 Описание
 row
 Индекс строки. Тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 column
 Индекс столбца. Тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице.
 Возвращает
 Возвращает идентификатор объекта внешней ссылки. Тип DatabaseServices.ObjectId.
 Описание
 Метод позволяет получить идентификатор объекта внешней ссылки из указанной ячейки. В случае отсутствия в ячейке внешней ссылки возвращает нулевой идентификатор.
 Ссылки
 Teigha.DatabaseServices.LinkedTableData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!