Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector2d.LengthSqrd
 Послать отзыв
 Свойство LengthSqrd представляет квадрат длины данного вектора.
 Синтаксис
C#
Visual Basic
Копировать Код
public double LengthSqrd;
Копировать Код
Public ReadOnly Property LengthSqrd As Double
 Возвращает
 Возвращает квадрат евклидовой длины данного вектора. Тип double.
 Описание
 Свойство LengthSqrd представляет квадрат евклидовой длины данного вектора.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.Vector2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!