Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DataCell
 Послать отзыв
 Класс DataCell реализует единообразный подход к представлению следующих типов данных: Boolean, integer, double, char*, Point3d, ObjectId, HardOwnershipId, SoftOwnershipId, HardPointerId и SoftPointerId.
 Иерархия классов
Teigha::DatabaseServices::DataCell
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdDbDataCell")] public class DataCell : RXObject;
Копировать Код
<Wrapper("OdDbDataCell")> Public Class DataCell Inherits RXObject
 Описание
 Класс DataCell реализует единообразный подход к представлению следующих типов данных: Boolean, integer, double, char*, Point3d, ObjectId, HardOwnershipId, SoftOwnershipId, HardPointerId и SoftPointerId.
 Класс предоставляет полный набор конструкторов, операторов присваивания и приведения, которые упрощают и делают безопасным использование ячеек DataCell в качестве базового типа.
 Методы
 Конструкторы
 Имя
 Описание
 DataCell
 Это обзор перегрузок DataCell.
 Топики
 Имя
 Описание
 DataCell Методы
 Ниже перечислены методы класса DataCell.
 DataCell Свойства
 Ниже перечислены свойства класса DataCell.
 Ссылки
 DataCell Конструктор, DataCell Методы, DataCell Свойства, Методы, Топики, DataCell Методы, DataCell Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!