Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SecurityParameters.Password
 Послать отзыв
 Свойство Password представляет строку пароля.
 Синтаксис
C#
Visual Basic
Копировать Код
public String Password;
Копировать Код
Public Property Password As String
 Возвращает
 Возвращает пароль. Тип String.
 Описание
 Свойство Password представляет строку пароля.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.SecurityParameters, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!