Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObject.Modified
 Послать отзыв
 Cобытие происходит каждый раз, когда объект открывается для изменений, в режиме OpenMode.ForWrite, изменяется и закрывается с изменениями.
 Синтаксис
C#
Visual Basic
Копировать Код
public event EventHandler Modified;
Копировать Код
Public Event Modified As EventHandler
 Возвращает
 Тип данных EventHandler, представляющий обработчик события.
 Описание
 Cобытие происходит каждый раз, когда объект открывается для изменений, в режиме OpenMode.ForWrite, вызывается функция, которая может изменить содержимое этого объекта, и этот объект в настоящее время закрывается.
 Ссылки
 Teigha.DatabaseServices.DBObject, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!