Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.OffsetSurface.OffsetDist
 Послать отзыв
 Свойство OffsetDist представляет величину смещения (со знаком).
 Синтаксис
C#
Visual Basic
Копировать Код
public double OffsetDist;
Копировать Код
Public ReadOnly Property OffsetDist As Double
 Возвращает
 Возвращает величину смещения (со знаком). Тип double.
 Описание
 Свойство OffsetDist представляет величину смещения (со знаком).
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.OffsetSurface, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!