Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CoordinateSystem3d
 Послать отзыв
 Структура CoordinateSystem3d представляет трехмерную систему координат, которая определяется точкой начала и направлениями осей X, Y и Z.
 Иерархия классов
Teigha::Geometry::CoordinateSystem3d
 Синтаксис
C#
Visual Basic
Копировать Код
public struct CoordinateSystem3d : IFormattable
Копировать Код
Public Structure CoordinateSystem3d Implements IFormattable
 Описание
 Структура CoordinateSystem3d представляет трехмерную систему координат, которая определяется точкой начала и направлениями осей X, Y и Z.
 Методы
 Конструкторы
 Имя
 Описание
 CoordinateSystem3d
 Конструктор класса CoordinateSystem3d. Создает экземпляр класса с указанными параметрами.
 Топики
 Имя
 Описание
 CoordinateSystem3d Методы
 Ниже перечислены методы класса CoordinateSystem3d.
 CoordinateSystem3d Операторы
 Ниже перечислены операторы класса CoordinateSystem3d.
 CoordinateSystem3d Свойства
 Ниже перечислены свойства класса CoordinateSystem3d.
 Ссылки
 CoordinateSystem3d Методы, CoordinateSystem3d Операторы, CoordinateSystem3d Свойства, Методы, Топики, CoordinateSystem3d Методы, CoordinateSystem3d Операторы, CoordinateSystem3d Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!