Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Событие Database.DxfOutComplete
 Послать отзыв
 Синтаксис
C#
Visual Basic
public event EventHandler DxfOutComplete;
Public Event DxfOutComplete As EventHandler
 Описание
 Событие показывает, что операция записи, произошедшая с базой данных чертежа, успешно выполнена.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!