Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Light.SetHotspotAndFalloff
 Послать отзыв
 Метод определяет световое пятно и спад освещенности конуса направленного света.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetHotspotAndFalloff( double hotspot, double falloff );
Копировать Код
Public Overridable Sub SetHotspotAndFalloff( hotspot As Double, falloff As Double )
 Параметры
 Параметры
 Описание
 hotspot
 Угол светового конуса в радианах. Тип double. Определяет наиболее яркую часть светового пучка.
 falloff
 Угол поля направленного света, в радианах. Тип double. Определяет полный световой конус.
 Описание
 Метод определяет световое пятно и спад освещенности конуса направленного света.
 Ссылки
 Teigha.DatabaseServices.Light, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!