Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Matrix3d.AlignCoordinateSystem
 Послать отзыв
 Метод формирует матрицу для преобразования из одной системы координат в другую.
 Синтаксис
C#
Visual Basic
Копировать Код
public Matrix3d AlignCoordinateSystem( Point3d fromOrigin, Vector3d fromXAxis, Vector3d fromYAxis, Vector3d fromZAxis, Point3d toOrigin, Vector3d toXAxis, Vector3d toYAxis, Vector3d toZAxis );
Копировать Код
Public Function AlignCoordinateSystem( fromOrigin As Point3d, fromXAxis As Vector3d, fromYAxis As Vector3d, fromZAxis As Vector3d, toOrigin As Point3d, toXAxis As Vector3d, toYAxis As Vector3d, toZAxis As Vector3d ) As Matrix3d
 Параметры
 Параметры
 Описание
 fromOrigin
 Точка начала исходной системы координат. Тип Point3d.
 fromXAxis
 Вектор, задающий направление оси X исходной СК. Тип Vector3d.
 fromYAxis
 Вектор, задающий направление оси Y исходной СК. Тип Vector3d.
 fromZAxis
 Вектор, задающий направление оси Z исходной СК. Тип Vector3d.
 toOrigin
 Точка начала целевой системы координат. Тип Point3d.
 toXAxis
 Вектор, задающий направление оси X целевой СК. Тип Vector3d.
 toYAxis
 Вектор, задающий направление оси Y целевой СК. Тип Vector3d.
 toZAxis
 Вектор, задающий направление оси Z целевой СК. Тип Vector3d.
 Возвращает
 Возвращает матрицу преобразования из исходной СК в целевую СК. Тип Matrix3d.
 Описание
 Метод формирует матрицу, которая обеспечивает преобразование из исходной системы координат с началом в точке fromOrigin и координатными осями fromXAxis, fromYAxis и fromZAxis в целевую систему координат с началом в точке toOrigin и координатными осями toXAxis, toYAxis и toZAxis.
 Ссылки
 Teigha.Geometry.Matrix3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!