Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Viewport.SetShadePlot
 Послать отзыв
 Метод позволяет задать тип отображения теней при выводе на печать данного видового экрана.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetShadePlot( ShadePlotType type, DatabaseServices.ObjectId shadePlotId );
Копировать Код
Public Sub SetShadePlot( type As ShadePlotType, shadePlotId As DatabaseServices.ObjectId )
 Параметры
 Параметры
 Описание
 type
 Тип отображения теней. Перечисление ShadePlotType.
 shadePlotId
 Идентификатор объекта VisualStyle или RenderSettings, которые будут использоваться для управления отображением теней. Тип DatabaseServices.ObjectId.
 Описание
 Метод позволяет задать тип отображения теней при выводе на печать данного видового экрана. Используемый для этого объект отображения теней представляет собой визуальный стиль или набор настроек рендеринга, который определяет, как будет отображаться текущий видовой экран при выводе на печать.
 Если для типа отображения теней установлено значение AsDisplayed или Rendered, параметр shadePlotId игнорируется, а для идентификатора объекта отображения теней автоматически устанавливается значение Null. Если для режима отображения теней установлено значение VisualStyle или RenderPreset, идентификатор объекта отображения теней shadePlotId должен указывать на допустимый объект VisualStyle или RenderSettings.
 Ссылки
 Teigha.DatabaseServices.Viewport, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!