Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Viewport.GridFollow
 Послать отзыв
 Свойство GridFollow определяет, реагирует ли сетка на динамические изменения ПСК (UCS) в этом видовом экране.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool GridFollow;
Копировать Код
Public Property GridFollow As Boolean
 Возвращает
 Возвращает true, если сетка динамически перестраивается в соответствии с изменениями ориентации пользовательской системы координат. В противном случае возвращает false.
 Описание
 Свойство GridFollow определяет, реагирует ли сетка в данном видовом экране на динамические изменения пользовательской системы координат (ПСК, UCS).
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Viewport, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!