Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Curve
 Послать отзыв
 Класс Curve является базовым классом для всех классов сущностей, представляющих различные виды геометрических кривых (дуга, окружность, эллипс, сплайн и др.). Обеспечивает общую для кривых функциональность.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::GraphicsInterface::Drawable Teigha::DatabaseServices::DBObject Teigha::DatabaseServices::Entity Teigha::DatabaseServices::Curve
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("AcDbCurve")] public class Curve : Entity;
Копировать Код
<Wrapper("AcDbCurve")> Public Class Curve Inherits Entity
 Описание
 Класс Curve является базовым классом для всех классов сущностей, представляющих различные виды кривых, таких как дуга, окружность, эллипс, сплайн и др. Как базовый класс, он предоставляет общую для кривых функциональность, например, вычисление параметров точки на кривой, построение кривых со смещением (offset), определение проекций кривой на плоскость и т.д.
 Методы
 Конструкторы
 Teigha.GraphicsInterface.Drawable
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 Drawable
 Конструктор класса Teigha.GraphicsInterface.Drawable. (Унаследован от Drawable)
 Teigha.DatabaseServices.DBObject
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 DBObject
 Конструктор. (Унаследован от DBObject)
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.GraphicsInterface.Drawable
 Имя
 Описание
 Drawable Методы
 Ниже перечислены методы класса Drawable.
 Drawable Свойства
 Ниже перечислены свойства класса Drawable.
 Teigha.DatabaseServices.DBObject
 Имя
 Описание
 DBObject Методы
 Ниже перечислены методы класса DBObject.
 DBObject Свойства
 Ниже перечислены свойства класса DBObject.
 DBObject События
 Ниже перечислены события класса DBObject.
 Teigha.DatabaseServices.Entity
 Имя
 Описание
 Entity Методы
 Ниже перечислены методы класса Entity.
 Entity Свойства
 Ниже перечислены свойства класса Entity.
 Teigha.DatabaseServices.Curve
 Имя
 Описание
 Curve Методы
 Ниже перечислены методы класса Curve.
 Curve Свойства
 Ниже перечислены свойства класса Curve.
 Ссылки
 Curve Методы, Curve Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства, DBObject События
 Ваши комментарии по поводу этого топика: Послать отзыв!