Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DwfDefinition
 Послать отзыв
 Этот класс представляет определения подложек DWF на чертеже.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::GraphicsInterface::Drawable Teigha::DatabaseServices::DBObject Teigha::DatabaseServices::UnderlayDefinition Teigha::DatabaseServices::DwfDefinition
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("AcDbDwfDefinition")] public class DwfDefinition : UnderlayDefinition;
Копировать Код
<Wrapper("AcDbDwfDefinition")> Public Class DwfDefinition Inherits UnderlayDefinition
 Описание
 Этот класс представляет определения подложек DWF на чертеже. Подложки аналогичны растровым изображениям, за исключением того, что их контент допускает объектные привязки.
 Методы
 Конструкторы
 Teigha.GraphicsInterface.Drawable
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 Drawable
 Конструктор класса Teigha.GraphicsInterface.Drawable. (Унаследован от Drawable)
 Teigha.DatabaseServices.DBObject
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 DBObject
 Конструктор. (Унаследован от DBObject)
 Teigha.DatabaseServices.DwfDefinition
 Имя
 Описание
 DwfDefinition
 Это обзор перегрузок DwfDefinition.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.GraphicsInterface.Drawable
 Имя
 Описание
 Drawable Методы
 Ниже перечислены методы класса Drawable.
 Drawable Свойства
 Ниже перечислены свойства класса Drawable.
 Teigha.DatabaseServices.DBObject
 Имя
 Описание
 DBObject Методы
 Ниже перечислены методы класса DBObject.
 DBObject Свойства
 Ниже перечислены свойства класса DBObject.
 DBObject События
 Ниже перечислены события класса DBObject.
 Teigha.DatabaseServices.UnderlayDefinition
 Имя
 Описание
 UnderlayDefinition Методы
 Ниже перечислены методы класса UnderlayDefinition.
 UnderlayDefinition Свойства
 Ниже перечислены свойства класса UnderlayDefinition.
 Teigha.DatabaseServices.DwfDefinition
 Имя
 Описание
 DwfDefinition Свойства
 Ниже перечислены свойства класса DwfDefinition.
 Ссылки
 DwfDefinition Конструктор, DwfDefinition Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства, DBObject События
 Ваши комментарии по поводу этого топика: Послать отзыв!