Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.CurrentViewportTableRecordId
 Послать отзыв
 Синтаксис
C#
Visual Basic
public DatabaseServices::ObjectId CurrentViewportTableRecordId;
Public Property CurrentViewportTableRecordId() As DatabaseServices.ObjectId
 Описание
 Возвращает Id текущей ViewportTableRecord для данной базы данных.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!