Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CustomScale.!=
 Послать отзыв
 Оператор неравенства для класса CustomScale.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool operator !=( CustomScale a, CustomScale b );
Копировать Код
Public Operator !=( a As CustomScale, b As CustomScale )
 Параметры
 Параметры
 Описание
 a
 Левый операнд. Тип CustomScale.
 b
 Правый операнд. Тип CustomScale.
 Возвращает
 Возвращает true, если не выполняется хотя бы одно из перечисленных ниже условий:
Числители объектов a и b равны;
Знаменатели объектов a и b равны.
 Описание
 Оператор неравенства для класса CustomScale. Позволяет проверить, равны ли указанные объекты.
 Ссылки
 Teigha.DatabaseServices.CustomScale, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!