Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 BlockTableRecord.UpdateAnonymousBlocks()
 Послать отзыв
 Метод обновляет анонимные блоки, созданные на основе данного динамического блока, чтобы отобразить изменения в определении блока.
 Синтаксис
C#
Visual Basic
Копировать Код
public void UpdateAnonymousBlocks();
Копировать Код
Public Sub UpdateAnonymousBlocks()
 Описание
 Метод обновляет анонимные блоки, созданные на основе данного динамического блока, чтобы отобразить изменения в определении блока.
 Вызов этого метода после изменений в определении динамического блока заменяет все определения анонимных блоков, созданные на основе данного динамического блока, на новые определения анонимных блоков. Обновление сохраняет значения свойств динамического блока в ссылках, где это возможно, добавляя вновь созданные свойства и удаляя те свойства, которые больше не существуют.
 Ссылки
 Teigha.DatabaseServices.BlockTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!