Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.Cells
 Послать отзыв
 Данное свойство предоставляет доступ к ячейкам объекта Table.
 Синтаксис
C#
Visual Basic
Копировать Код
public CellRange Cells;
Копировать Код
Public Property Cells() As CellRange
 Возвращает
 Возвращает диапазон ячеек, тип CellRange.
 Описание
 Данное свойство предоставляет доступ к ячейкам объекта Table.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!