Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotSettings.PlotRotation
 Послать отзыв
 Свойство PlotRotation представляет поворот при печати в настройках этого объекта PlotSettings.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.PlotRotation PlotRotation;
Копировать Код
Public ReadOnly Property PlotRotation As DatabaseServices.PlotRotation
 Возвращает
 Возвращает поворот при печати. Значение из перечисления Teigha.DatabaseServices.PlotRotation.
 Описание
 Свойство PlotRotation представляет поворот при печати в настройках этого объекта PlotSettings.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.PlotSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!