Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MText.TextHeight
 Послать отзыв
 Свойство представляет номинальную высоту текста в данном объекте MText.
 Синтаксис
C#
Visual Basic
Копировать Код
public double TextHeight;
Копировать Код
Public Property TextHeight As Double
 Возвращает
 Возвращает номинальную высоту текста. Тип double.
 Описание
 Свойство представляет номинальную высоту текста в данном объекте MText.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MText, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!