Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.SetBackgroundColorNone
 Послать отзыв
 Метод позволяет включить или отключить цвет фона в строке указанного типа.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetBackgroundColorNone( bool value, int rowTypes );
Копировать Код
Public virtual Sub SetBackgroundColorNone( value As Boolean, rowTypes As Integer )
 Параметры
 Параметры
 Описание
 value
 Флаг, указывающий, следует ли включить цвет фона для строки указанного типа.
 rowTypes
 Тип строки, int. См. перечисление RowType.
 Описание
 Метод позволяет включить или отключить цвет фона в строке указанного типа.
 Допустимые типы строк: DataRow, TitleRow и HeaderRow (cм. перечисление RowType). Можно комбинировать разные типы строк. Если тип строки не указан, этот метод распространяет свое действие на все возможные типы строк.
 Замечания
 Для получения того же результата предпочтительнее использовать функционал объекта Cell.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!