Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Scale2d.GetMatrix
 Послать отзыв
 Метод предоставляет матрицу геометрического преобразования, которое эквивалентно данному вектору масштабирования.
 Синтаксис
C#
Visual Basic
Копировать Код
public Matrix2d GetMatrix();
Копировать Код
Public Function GetMatrix() As Matrix2d
 Возвращает
 Возвращает матрицу геометрического преобразования. Тип Matrix2d.
 Описание
 Метод предоставляет матрицу геометрического преобразования, которое эквивалентно данному вектору масштабирования.
 Ссылки
 Teigha.Geometry.Scale2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!