Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PolygonMesh.AppendVertex
 Послать отзыв
 Метод предназначен для добавления вершины PolygonMeshVertex в список вершин сети PolygonMesh.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.ObjectId AppendVertex( ref PolygonMeshVertex toAppend );
Копировать Код
Public Function AppendVertex( ByRef toAppend As PolygonMeshVertex ) As DatabaseServices.ObjectId
 Параметры
 Параметры
 Описание
 toAppend
 Вершина PolygonMeshVertex, добавляемая в сеть.
 Возвращает
 Возвращает ObjectId вершины.
 Описание
 Этот метод добавляет к списку вершин PolygonMesh объект PolygonMeshVertex, указанный аргументом toAppend, устанавливает сеть PolygonMesh в качестве владельца вершины и добавляет новую вершину в базу данных, которой принадлежит PolygonMesh.
 Чтобы этот метод мог выполняться успешно, сеть PolygonMesh должна быть резидентной в базе данных.
 Добавленная вершина должна быть явно закрыта вызывающим приложением после возврата из метода AppendVertex().
 Ссылки
 Teigha.DatabaseServices.PolygonMesh, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!