Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Surface.BooleanIntersect
 Послать отзыв
 Метод предназначен для выполнения операции логического пересечения данной поверхности с указанной трехмерной поверхностью.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual Entity[] BooleanIntersect( ref Surface surface2 );
Копировать Код
Public Overridable Function BooleanIntersect( ByRef surface2 As Surface ) As Entity()
 Параметры
 Параметры
 Описание
 surface2
 Входная поверхность, пересекающаяся с данной поверхностью. Тип Surface.
 Возвращает
 Возвращает массив объектов, представляющих пересечение двух поверхностей. Тип Entity[].
 Описание
 Метод реализует операцию логического пересечения данной поверхности с указанной трехмерной поверхностью.
 Если результат пересечения не является поверхностью, все кривые и точки пересечения сохраняются в выходном массиве, а данная поверхность не изменяется.
 Если результатом пересечения является поверхность, кривые пересечения или точки не извлекаются. Если эта поверхность не является производной от класса Surface, результирующая поверхность сохраняется в данной поверхности. В противном случае данный объект остается без изменений, а результат сохраняется в выходном массиве тел пересечений.
 Если поверхности не пересекаются, метод выдает исключение eNoIntersections, а данная поверхность остается без изменений. Если операцию пересечения успешно завершить не удается, данная поверхность не изменяется.
 Замечания
 Данный метод реализован только в ModelerGeometry и в среде пространственного моделирования Spatial Modeler.
 Ссылки
 Teigha.DatabaseServices.Surface, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!