Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Matrix3dBuilder.ToMatrix3d
 Послать отзыв
 Метод предоставляет трехмерную матрицу, связанную с данным объектом.
 Синтаксис
C#
Visual Basic
Копировать Код
public Matrix3d ToMatrix3d();
Копировать Код
Public Function ToMatrix3d() As Matrix3d
 Возвращает
 Возвращает матрицу, связанную с данным объектом. Тип Matrix3d.
 Описание
 Метод предоставляет трехмерную матрицу, связанную с данным объектом.
 Ссылки
 Teigha.Geometry.Matrix3dBuilder, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!