Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод IdPair.ToString (IFormatProvider^)
 Послать отзыв
 This is ToString, a member of class IdPair.
 Синтаксис
C#
Visual Basic
public String ToString(ref IFormatProvider provider);
Public Function ToString(ByRef provider As IFormatProvider) As String
 Ссылки
 IdPair Структура, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!