Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.RevolvedSurface.StartAngle
 Послать отзыв
 Свойство StartAngle представляет начальный угол операции вращения.
 Синтаксис
C#
Visual Basic
Копировать Код
public double StartAngle;
Копировать Код
Public ReadOnly Property StartAngle As Double
 Возвращает
 Возвращает начальный угол операции вращения (в радианах). Тип double.
 Описание
 Свойство StartAngle представляет начальный угол операции вращения (в радианах).
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.RevolvedSurface, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!