Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод BlockReference.ResetBlock
 Послать отзыв
 Синтаксис
C#
Visual Basic
public void ResetBlock();
Public Sub ResetBlock()
 Описание
 Переустанавливает BlockReference к состоянию по умолчанию динамического блока.
 Ссылки
 Teigha.DatabaseServices.BlockReference, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!