Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocDependency.AssocDependency
 Послать отзыв
 Конструктор класса по умолчанию.
 Синтаксис
C#
Visual Basic
Копировать Код
public AssocDependency();
Копировать Код
Public Sub New()
 Описание
 Конструктор класса по умолчанию.
 Ссылки
 Teigha.DatabaseServices.AssocDependency, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!