Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Solid3d.GetSubentityColor
 Послать отзыв
 Метод позволяет получить цвет указанного подобъекта данного твердого тела.
 Синтаксис
C#
Visual Basic
Копировать Код
public Teigha.Colors.Color GetSubentityColor( SubentityId subEntityId );
Копировать Код
Public Function GetSubentityColor( subEntityId As SubentityId ) As Teigha.Colors.Color
 Параметры
 Параметры
 Описание
 subEntityId
 Идентификатор подобъекта (ребра или грани). Тип SubentityId.
 Возвращает
 Возвращает цвет интересующего подобъекта. Тип Teigha.Colors.Color.
 Описание
 Метод позволяет получить цвет указанного подобъекта данного твердого тела.
 Ссылки
 Teigha.DatabaseServices.Solid3d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!