Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.ExternalCurve3d.NativeCurve
 Послать отзыв
 Свойство NativeCurve обеспечивает доступ к нативному представлению данной внешней кривой в геометрической библиотеке платформы.
 Синтаксис
C#
Visual Basic
Копировать Код
public Curve3d NativeCurve;
Копировать Код
Public ReadOnly Property NativeCurve As Curve3d
 Возвращает
 Возвращает нативное представление данной внешней кривой в геометрической библиотеке платформы. Тип Curve3d.
 Описание
 Свойство NativeCurve обеспечивает доступ к нативному представлению данной внешней кривой в геометрической библиотеке платформы.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.ExternalCurve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!