Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotStyleTable.ScaleFactor
 Послать отзыв
 Свойство ScaleFactor представляет глобальный масштабный коэффициент, применяемый к не-ISO типам линий в данном объекте PlotStyleTable.
 Синтаксис
C#
Visual Basic
Копировать Код
public double ScaleFactor;
Копировать Код
Public Property ScaleFactor As Double
 Возвращает
 Возвращает значение глобального масштабного коэффициента. Тип double.
 Описание
 Свойство ScaleFactor представляет глобальный масштабный коэффициент, применяемый к не-ISO типам линий в данной таблице стилей печати PlotStyleTable.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.PlotStyleTable, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!