Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbCurve2dData
 Послать отзыв
 Структура NurbCurve2dData предназначена для хранения данных, которые определяют объект NurbCurve2d.
 Иерархия классов
Teigha::Geometry::NurbCurve2dData
 Синтаксис
C#
Visual Basic
Копировать Код
public struct NurbCurve2dData
Копировать Код
Public Structure NurbCurve2dData
 Описание
 Структура NurbCurve2dData предназначена для хранения данных, которые определяют объект NurbCurve2d.
 Замечания
 Если сплайн NurbCurve2d является периодическим, длина узлового вектора будет больше длины массива управляющих вершин на 1. В противном случае длина узлового вектора будет на degree + 1 больше длины массива управляющих вершин.
 Топики
 Имя
 Описание
 NurbCurve2dData Методы
 Ниже перечислены методы класса NurbCurve2dData.
 NurbCurve2dData Операторы
 Ниже перечислены операторы класса NurbCurve2dData.
 NurbCurve2dData Свойства
 Ниже перечислены свойства класса NurbCurve2dData.
 Ссылки
 NurbCurve2dData Методы, NurbCurve2dData Операторы, NurbCurve2dData Свойства, Топики, NurbCurve2dData Методы, NurbCurve2dData Операторы, NurbCurve2dData Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!