Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.KnotCollection.Reverse
 Послать отзыв
 Метод изменяет порядок узлов в данной коллекции на обратный.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Reverse();
Копировать Код
Public Sub Reverse()
 Описание
 Метод изменяет порядок узлов в данной коллекции на обратный.
 Ссылки
 Teigha.Geometry.KnotCollection, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!