Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DataLink.DataLink
 Послать отзыв
 Конструктор по умолчанию класса DataLink.
 Синтаксис
C#
Visual Basic
Копировать Код
public DataLink();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса DataLink.
 Ссылки
 Teigha.DatabaseServices.DataLink, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!