Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Hatch.GetHatchLinesData
 Послать отзыв
 This is GetHatchLinesData, a member of class Hatch.
 Синтаксис
C#
Visual Basic
public Line2dCollection GetHatchLinesData();
Public Function GetHatchLinesData() As Line2dCollection
 Ссылки
 Teigha.DatabaseServices.Hatch, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!