Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство RasterImage.ImageTransparency
 Послать отзыв
 Синтаксис
C#
Visual Basic
public bool ImageTransparency;
Public Property ImageTransparency() As bool
 Описание
 Обеспечивает доступ к признаку того, является ли изображение прозрачным.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.RasterImage, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!