Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Entity3d.RotateBy
 Послать отзыв
 Метод поворачивает данный объект на указанный угол вокруг заданной оси, определяемой точкой и вектором.
 Синтаксис
C#
Visual Basic
Копировать Код
public void RotateBy( double angle, Vector3d vector, Point3d point );
Копировать Код
Public Sub RotateBy( angle As Double, vector As Vector3d, point As Point3d )
 Параметры
 Параметры
 Описание
 angle
 Угол поворота. Тип double.
 vector
 Направление оси вращения. Тип Vector3d.
 point
 Точка на оси вращения. Тип Point3d.
 Описание
 Метод поворачивает данный объект на указанный угол вокруг заданной оси, определяемой точкой и вектором.
 Ссылки
 Teigha.Geometry.Entity3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!