Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CellRange.SetCustomData
 Послать отзыв
 Метод позволяет задать значение пользовательских данных для ячеек этого диапазона.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetCustomData( ref String key, ref Object value );
Копировать Код
Public Sub SetCustomData( ByRef key As String, ByRef value As Object )
 Параметры
 Параметры
 Описание
 key
 Ключ для доступа к пользовательским данным. Тип String.
 value
 Значение пользовательских данных. Тип Object.
 Описание
 Метод позволяет задать значение пользовательских данных для ячеек этого диапазона.
 Ссылки
 Teigha.DatabaseServices.CellRange, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!