Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FullDwgVersion
 Послать отзыв
 Этот класс представляет основные и второстепенные версии DWG.
 Иерархия классов
Teigha::DatabaseServices::FullDwgVersion
 Синтаксис
C#
Visual Basic
Копировать Код
[StructLayout(LayoutKind.Sequential)] public class FullDwgVersion;
Копировать Код
<StructLayout(LayoutKind.Sequential)> Public Class FullDwgVersion
 Описание
 Этот класс представляет основные (major) и второстепенные (minor) версии DWG.
 Методы
 Конструкторы
 Имя
 Описание
 FullDwgVersion
 Конструктор класса FullDwgVersion. Создает объект с заданными настройками версии (major/minor).
 Топики
 Имя
 Описание
 FullDwgVersion Методы
 Ниже перечислены методы класса FullDwgVersion.
 FullDwgVersion Операторы
 Ниже перечислены операторы класса FullDwgVersion.
 FullDwgVersion Свойства
 Ниже перечислены свойства класса FullDwgVersion.
 Ссылки
 FullDwgVersion Методы, FullDwgVersion Операторы, FullDwgVersion Свойства, Методы, Топики, FullDwgVersion Методы, FullDwgVersion Операторы, FullDwgVersion Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!