Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Entity.LinetypeScale
 Послать отзыв
 Свойство предназначено для получения или установки масштаба типа линии геометрического объекта, который определяет, как будет отображаться повторяющийся узор линии (например, пунктир) на чертеже.
 Синтаксис
C#
Visual Basic
Копировать Код
public double LinetypeScale;
Копировать Код
Public Property LinetypeScale() As Double
 Возвращает
 Возвращает значение типа double, представляющее текущий масштаб типа линии. Чем больше значение, тем крупнее отображается узор линии.
 Описание
 Свойство устанавливает или возвращает масштаб типа линий геометрического объекта.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Entity, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!