Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AbstractViewPE.ZoomExtents
 Послать отзыв
 Метод зуммирует связанный видовой экран так, чтобы он соответствовал указанным границам в системе координат камеры.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool ZoomExtents();
Копировать Код
Public Function ZoomExtents() As Boolean
 Возвращает
 Возвращает true в случае успешного завершения метода. В противном случае возвращает false.
 Описание
 Метод зуммирует связанный видовой экран так, чтобы он соответствовал указанным границам в системе координат камеры.
 Ссылки
 Teigha.DatabaseServices.AbstractViewPE, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!