Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LinkedTableData.AppendRow
 Послать отзыв
 Метод добавляет в данную таблицу указанное количество строк.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual int AppendRow( int rowsNumber );
Копировать Код
Public Overridable Function AppendRow( rowsNumber As Integer ) As Integer
 Параметры
 Параметры
 Описание
 rowsNumber
 Количество добавляемых строк. Тип int.
 Возвращает
 Возвращает индекс первой добавленной строки. Тип int.
 Описание
 Метод добавляет в данную таблицу указанное количество строк.
 Замечания
 Если аргумент rowsNumber меньше или равен нулю, метод выбрасывает исключение eInvalidInput.
 Ссылки
 Teigha.DatabaseServices.LinkedTableData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!