Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Line2d
 Послать отзыв
 Класс Line2d представляет бесконечную линию в двумерном пространстве.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Geometry::Entity2d Teigha::Geometry::Curve2d Teigha::Geometry::LinearEntity2d Teigha::Geometry::Line2d
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdGeLine2d")] public sealed class Line2d : LinearEntity2d
Копировать Код
<Wrapper("OdGeLine2d")> Public NotInheritable Class Line2d Inherits LinearEntity2d
 Описание
 Класс Line2d представляет бесконечную линию в двумерном пространстве.
 Методы
 Конструкторы
 Teigha.Geometry.Line2d
 Имя
 Описание
 Line2d
 Это обзор перегрузок Line2d.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Geometry.Entity2d
 Имя
 Описание
 Entity2d Методы
 Ниже перечислены методы класса Entity2d.
 Teigha.Geometry.Curve2d
 Имя
 Описание
 Curve2d Методы
 Ниже перечислены методы класса Curve2d.
 Curve2d Свойства
 Ниже перечислены свойства класса Curve2d.
 Teigha.Geometry.LinearEntity2d
 Имя
 Описание
 LinearEntity2d Методы
 Ниже перечислены методы класса LinearEntity2d.
 LinearEntity2d Свойства
 Ниже перечислены свойства класса LinearEntity2d.
 Teigha.Geometry.Line2d
 Имя
 Описание
 Line2d Методы
 Ниже перечислены методы класса Line2d.
 Ссылки
 Line2d Конструктор, Line2d Методы, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!