Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SubDMesh.VertexColorArray
 Послать отзыв
 Свойство предоставляет доступ к массиву цветов вершин сети.
 Синтаксис
C#
Visual Basic
Копировать Код
public Colors.EntityColor[] VertexColorArray;
Копировать Код
Public Property VertexColorArray As Colors.EntityColor[]
 Возвращает
 Возвращает цвета вершин сети в виде массива Colors.EntityColor[].
 Описание
 Свойство предоставляет доступ к массиву цветов вершин сети.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.SubDMesh, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!