Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.LinearEntity3d.IsColinearTo
 Послать отзыв
 Метод позволяет проверить, является ли данный объект коллинеарным указанному линейному объекту в пределах некоторой заданной точности.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsColinearTo( ref LinearEntity3d line, Tolerance tolerance );
Копировать Код
Public Function IsColinearTo( ByRef line As LinearEntity3d, tolerance As Tolerance ) As Boolean
 Параметры
 Параметры
 Описание
 line
 Проверяемый линейный объект. Тип LinearEntity3d.
 tolerance
 Заданная геометрическая точность. Тип Tolerance.
 Возвращает
 Возвращает true, если в пределах указанной точности объекты можно считать коллинеарными. В противном случае возвращает false.
 Описание
 Метод позволяет проверить, является ли данный объект коллинеарным указанному линейному объекту в пределах заданной точности.
 Ссылки
 Teigha.Geometry.LinearEntity3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!