Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор BeginWblockBlockEventArgs.BeginWblockBlockEventArgs
 Послать отзыв
 This is BeginWblockBlockEventArgs, a member of class BeginWblockBlockEventArgs.
 Синтаксис
C#
Visual Basic
internal BeginWblockBlockEventArgs(ref Database from, ObjectId blockid);
Friend Sub New(ByRef from As Database, blockid As ObjectId)
 Ссылки
 Teigha.DatabaseServices.BeginWblockBlockEventArgs, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!