Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GraphNode.DisconnectAll
 Послать отзыв
 Метод предназначен для удаления всех входящих и исходящих ссылок этого объекта GraphNode.
 Синтаксис
C#
Visual Basic
Копировать Код
public void DisconnectAll();
Копировать Код
Public Sub DisconnectAll()
 Описание
 Метод предназначен для удаления всех входящих и исходящих ссылок этого объекта GraphNode.
 Этот метод всегда вызывается в деструкторе. Удаляются все ссылки между этим узлом и любыми узлами In() или Out() или узлами CycleIn() и CycleOut(), т.е. любые указатели на данный объект.
 Ссылки
 Teigha.DatabaseServices.GraphNode, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!