Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AttributeDefinition
 Послать отзыв
 Класс AttributeDefinition представляет определения атрибутов (ATTDEF) в экземпляре базы данных.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::GraphicsInterface::Drawable Teigha::DatabaseServices::DBObject Teigha::DatabaseServices::Entity Teigha::DatabaseServices::DBText Teigha::DatabaseServices::AttributeDefinition
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("AcDbAttributeDefinition")] public class AttributeDefinition : DBText;
Копировать Код
<Wrapper("AcDbAttributeDefinition")> Public Class AttributeDefinition Inherits DBText
 Описание
 Класс AttributeDefinition представляет определения атрибутов (ATTDEF) в экземпляре базы данных.
 Определения атрибутов используются определениями блоков (BlockTableRecord) в качестве шаблонов для новых объектов атрибутов (ATTRIB) при создании вхождения блока (экземпляра BlockReference), ссылающегося на родительское определение блока.
 Замечания
 Для задания свойств атрибута, которые не являются специфичными для AttributeReference, такие как текстовая строка, высота текста, поворот текста и т.д., следует использовать методы, унаследованные от класса DBText.
 Методы
 Конструкторы
 Teigha.GraphicsInterface.Drawable
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 Drawable
 Конструктор класса Teigha.GraphicsInterface.Drawable. (Унаследован от Drawable)
 Teigha.DatabaseServices.DBObject
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 DBObject
 Конструктор. (Унаследован от DBObject)
 Teigha.DatabaseServices.DBText
 Имя
 Описание
 DBText
 Это обзор перегрузок DBText.
 Teigha.DatabaseServices.AttributeDefinition
 Имя
 Описание
 AttributeDefinition
 Это обзор перегрузок AttributeDefinition.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.GraphicsInterface.Drawable
 Имя
 Описание
 Drawable Методы
 Ниже перечислены методы класса Drawable.
 Drawable Свойства
 Ниже перечислены свойства класса Drawable.
 Teigha.DatabaseServices.DBObject
 Имя
 Описание
 DBObject Методы
 Ниже перечислены методы класса DBObject.
 DBObject Свойства
 Ниже перечислены свойства класса DBObject.
 DBObject События
 Ниже перечислены события класса DBObject.
 Teigha.DatabaseServices.Entity
 Имя
 Описание
 Entity Методы
 Ниже перечислены методы класса Entity.
 Entity Свойства
 Ниже перечислены свойства класса Entity.
 Teigha.DatabaseServices.DBText
 Имя
 Описание
 DBText Методы
 Ниже перечислены методы класса DBText.
 DBText Свойства
 Ниже перечислены свойства класса DBText.
 Teigha.DatabaseServices.AttributeDefinition
 Имя
 Описание
 AttributeDefinition Методы
 Ниже перечислены методы класса AttributeDefinition.
 AttributeDefinition Свойства
 Ниже перечислены свойства класса AttributeDefinition.
 Ссылки
 AttributeDefinition Конструктор, AttributeDefinition Методы, AttributeDefinition Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства, DBObject События
 Ваши комментарии по поводу этого топика: Послать отзыв!