Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.PolylineCurve2d
 Послать отзыв
 Класс PolylineCurve2d представляет кусочно-линейные сплайны в двумерном пространстве.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Geometry::Entity2d Teigha::Geometry::Curve2d Teigha::Geometry::SplineEntity2d Teigha::Geometry::PolylineCurve2d
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdGePolyline2d")] public sealed class PolylineCurve2d : SplineEntity2d
Копировать Код
<Wrapper("OdGePolyline2d")> Public NotInheritable Class PolylineCurve2d Inherits SplineEntity2d
 Описание
 Класс PolylineCurve2d представляет кусочно-линейные сплайны в двумерном пространстве.
 Методы
 Конструкторы
 Teigha.Geometry.PolylineCurve2d
 Имя
 Описание
 PolylineCurve2d
 Это обзор перегрузок PolylineCurve2d.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Geometry.Entity2d
 Имя
 Описание
 Entity2d Методы
 Ниже перечислены методы класса Entity2d.
 Teigha.Geometry.Curve2d
 Имя
 Описание
 Curve2d Методы
 Ниже перечислены методы класса Curve2d.
 Curve2d Свойства
 Ниже перечислены свойства класса Curve2d.
 Teigha.Geometry.SplineEntity2d
 Имя
 Описание
 SplineEntity2d Методы
 Ниже перечислены методы класса SplineEntity2d.
 SplineEntity2d Свойства
 Ниже перечислены свойства класса SplineEntity2d.
 Teigha.Geometry.PolylineCurve2d
 Имя
 Описание
 PolylineCurve2d Методы
 Ниже перечислены методы класса PolylineCurve2d.
 PolylineCurve2d Свойства
 Ниже перечислены свойства класса PolylineCurve2d.
 Ссылки
 PolylineCurve2d Конструктор, PolylineCurve2d Методы, PolylineCurve2d Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!