Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObject.Handle
 Послать отзыв
 Свойство предоставляет идентификатор Handle данного объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public Handle Handle;
Копировать Код
Public Property Handle() As Handle
 Возвращает
 Возвращает тип данных Handle.
 Описание
 Свойство предоставляет идентификатор Handle данного объекта.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.DBObject, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!