Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SymbolUtilityServices.IsBlockPaperSpaceName
 Послать отзыв
 Метод позволяет проверить, соответствует ли переданное имя имени основного блока пространства листа.
 Синтаксис
C#
Visual Basic
Копировать Код
public static bool IsBlockPaperSpaceName( ref String name );
Копировать Код
Public Shared Function IsBlockPaperSpaceName( ByRef name As String ) As Boolean
 Параметры
 Параметры
 Описание
 name
 Проверяемое имя. Тип String.
 Возвращает
 Возвращает true, если указанное имя соответствует имени пространства листа. В противном случае возвращает false.
 Описание
 Метод позволяет проверить, соответствует ли переданное имя имени основного блока пространства листа. Перед сравнением строка нормализуется.
 Ссылки
 Teigha.DatabaseServices.SymbolUtilityServices, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!