Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Solid3d.ChamferEdges
 Послать отзыв
 Метод предназначен для создания фасок на ребрах данного твердого тела.
 Синтаксис
C#
Visual Basic
Копировать Код
public void ChamferEdges( ref SubentityId[] subentityIds, SubentityId baseSubentityId, double baseDist, double otherDist );
Копировать Код
Public Sub ChamferEdges( ByRef subentityIds() As SubentityId, baseSubentityId As SubentityId, baseDist As Double, otherDist As Double )
 Параметры
 Параметры
 Описание
 subentityIds
 Массив идентификаторов объектов ребер данного твердого тела. Тип SubentityId[].
 baseSubentityId
 Идентификатор объекта основной грани, на ребрах которой создаются фаски. Тип SubentityId.
 baseDist
 Расстояние от ребра для построения фаски на основной грани. Тип double.
 otherDist
 Расстояние от ребра для построения фасок на других гранях. Тип double.
 Описание
 Метод предназначен для создания фасок на ребрах данного твердого тела. Этот метод реализован только в среде пространственного моделирования.
 Ссылки
 Teigha.DatabaseServices.Solid3d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!