Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Point2d.*
 Послать отзыв
 Оператор умножения класса Point2d. Реализует умножение координат точки на вещественный множитель.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point2d operator * ( Point2d a, double value );
Копировать Код
Public Operator * ( a As Point2d, value As Double )
 Параметры
 Параметры
 Описание
 a
 Левый операнд. Тип Point2d.
 value
 Правый операнд. Тип double.
 Возвращает
 Возвращает точку Point2d в новых координатах.
 Описание
 Оператор умножения класса Point2d. Реализует умножение координат точки a на вещественный множитель value.
 Ссылки
 Teigha.Geometry.Point2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!