Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MentalRayRenderSettings.DiagnosticMode
 Послать отзыв
 Свойство DiagnosticMode представляет текущий режим диагностической визуализации.
 Синтаксис
C#
Visual Basic
Копировать Код
public GraphicsInterface.DiagnosticMode DiagnosticMode;
Копировать Код
Public Property DiagnosticMode As GraphicsInterface.DiagnosticMode
 Возвращает
 Возвращает режим диагностической визуализации. Значение из перечисления GraphicsInterface.DiagnosticMode.
 Описание
 Свойство DiagnosticMode представляет текущий режим диагностической визуализации.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MentalRayRenderSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!