Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CellOption
 Послать отзыв
 Перечисление CellOption определяет опциональные параметры ячеек, используемые при выполнении ряда операций.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum CellOption { None = 0, InheritCellFormat = 1 }
Копировать Код
Public Enum CellOption None = 0 InheritCellFormat = 1 End Enum
 Члены
 Члены
 Описание
 None
 Значение: 0. Опции не заданы.
 InheritCellFormat
 Значение: 1. При выполнении операции должен наследоваться формат ячейки.
 Описание
 Перечисление CellOption определяет опциональные параметры ячеек, используемые при выполнении ряда операций.
 Ваши комментарии по поводу этого топика: Послать отзыв!