Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AbstractViewPE.Direction
 Послать отзыв
 Свойство Direction представляет направление камеры для связанного видового экрана.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d Direction;
Копировать Код
Public ReadOnly Property Direction As Vector3d
 Возвращает
 Возвращает направление видового экрана. Тип Vector3d.
 Описание
 Свойство Direction представляет направление камеры для связанного видового экрана.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.AbstractViewPE, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!