Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector3d.*
 Послать отзыв
 Оператор реализует умножение заданного масштабного множителя на указанный 3D-вектор.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d operator * ( double factor, Vector3d a );
Копировать Код
Public Operator * ( factor As Double, a As Vector3d )
 Параметры
 Параметры
 Описание
 factor
 Левый операнд. Тип double.
 a
 Правый операнд. Тип Vector3d.
 Возвращает
 Возвращает результат умножения входного масштабного множителя на входной 3D-вектор. Тип Vector3d.
 Описание
 Оператор реализует умножение масштабного множителя factor на указанный 3D-вектор.
 Ссылки
 Teigha.Geometry.Vector3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!