Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.PointOnSurface.GetTangentVector
 Послать отзыв
 Метод вычисляет 3D-вектор в плоскости, касательной к поверхности в заданной точке, которому соответствует указанный 2D-вектор в пространстве параметров. В текущей версии этот метод не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d GetTangentVector( Vector2d vector, Point2d point );
Копировать Код
Public Function GetTangentVector( vector As Vector2d, point As Point2d ) As Vector3d
 Параметры
 Параметры
 Описание
 vector
 Входной 2D-вектор в пространстве параметров. Тип Vector2d.
 point
 Входная 2D-точка в пространстве параметров. Тип Point2d.
 Возвращает
 Возвращает 3D-вектор в касательной плоскости, который соответствует параметрически заданному 2D-вектору vector. Тип Vector3d.
 Описание
 Метод вычисляет 3D-вектор в плоскости, касательной к поверхности в параметрически заданной 2D-точке point, которому соответствует указанный 2D-вектор vector в пространстве параметров. Возвращаемый вектор имеет вид:
 Копировать Код
tangentVector = GetUDerivative(1) * vector.x + GetVDerivative(1) * vector.y
 В текущей версии этот метод не реализован.
 Ссылки
 Teigha.Geometry.PointOnSurface, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!