Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Viewport.NonRectClipEntityId
 Послать отзыв
 Свойство NonRectClipEntityId представляет идентификатор объекта чертежа, который послужил инструментом обрезки в данном видовом экране.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.ObjectId NonRectClipEntityId;
Копировать Код
Public Property NonRectClipEntityId As DatabaseServices.ObjectId
 Возвращает
 Возвращает идентификатор объекта чертежа. Тип DatabaseServices.ObjectId.
 Описание
 Свойство NonRectClipEntityId представляет идентификатор объекта чертежа, который послужил инструментом обрезки в данном видовом экране.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Viewport, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!