Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LoftOptionsBuilder.LoftOptionsBuilder
 Послать отзыв
 Конструктор по умолчанию класса LoftOptionsBuilder.
 Синтаксис
C#
Visual Basic
Копировать Код
public LoftOptionsBuilder();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса LoftOptionsBuilder.
 Ссылки
 Teigha.DatabaseServices.LoftOptionsBuilder, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!