Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbSurface.DegreeInU
 Послать отзыв
 Свойство DegreeInU представляет степень сплайна в направлении U.
 Синтаксис
C#
Visual Basic
Копировать Код
public int DegreeInU;
Копировать Код
Public ReadOnly Property DegreeInU As Integer
 Возвращает
 Возвращает степень сплайна в направлении U. Тип int.
 Описание
 Свойство DegreeInU представляет степень сплайна в направлении U.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.NurbSurface, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!