Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Light.UseLimits
 Послать отзыв
 Свойство позволяет проверить, используются ли пределы в расчетах затухания света от источника.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool UseLimits;
Копировать Код
Public Property UseLimits As Boolean
 Возвращает
 Возвращает true, если пределы используются в расчетах затухания света. В противном случае возвращает false.
 Описание
 Свойство позволяет проверить, используются ли пределы в расчетах затухания света от источника.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Light, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!