Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.PointOnSurface.GetPoint
 Послать отзыв
 Метод переопределяет связанную с данным объектом поверхность и параметрические 2D-координаты точки на этой поверхности и возвращает соответствующую точку в 3D-пространстве моделирования.
 Синтаксис
C#
Visual Basic
Копировать Код
public static Point3d GetPoint( ref Surface surface, Point2d point );
Копировать Код
Public Shared Function GetPoint( ByRef surface As Surface, point As Point2d ) As Point3d
 Параметры
 Параметры
 Описание
 surface
 Новая 3D-поверхность. Тип Surface.
 point
 Новые параметрические координаты точки на поверхности. Тип Point2d. Координата point.x определяет значение параметра точки по оси u, а координата point.y - значение параметра по оси v.
 Возвращает
 Возвращает точку на поверхности surface в 3D-пространстве моделирования, которой соответствует точка point в пространстве параметров. Тип Point3d.
 Описание
 Метод переопределяет связанную с данным объектом 3D-поверхность и параметрические 2D-координаты точки на этой поверхности и возвращает соответствующую точку в 3D-пространстве моделирования.
 Ссылки
 Teigha.Geometry.PointOnSurface, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!