Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Useri5
 Послать отзыв
 Синтаксис
C#
Visual Basic
public int Useri5;
Public Property Useri5() As Integer
 Описание
 Обеспечивает доступ к текущему значению USERI5 для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!