Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DiametricDimension
 Послать отзыв
 Класс представляет объект диаметрального размера.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::GraphicsInterface::Drawable Teigha::DatabaseServices::DBObject Teigha::DatabaseServices::Entity Teigha::DatabaseServices::Dimension Teigha::DatabaseServices::DiametricDimension
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("AcDbDiametricDimension"),TypeDescriptionProvider("Teigha.ComponentModel.TypeDescriptionProvider`1[[Teigha.DatabaseServices.DiametricDimension, TD_Mgd]], TD_Mgd")] public class DiametricDimension : Dimension;
Копировать Код
<Wrapper("AcDbDiametricDimension"),TypeDescriptionProvider("Teigha.ComponentModel.TypeDescriptionProvider`1[[Teigha.DatabaseServices.DiametricDimension, TD_Mgd]], TD_Mgd")> Public Class DiametricDimension Inherits Dimension
 Описание
 Класс представляет объект диаметрального размера в nanoCAD.
 Замечания
 Для этого типа размеров требуются две точки, определяющие хорду диаметра на измеряемой кривой, чтобы можно было провести размерную линию от одной точки хорды к другой. Кроме того, если текст расположен за пределами образмериваемой кривой, то значение LeaderLength определяет, насколько далеко размерная линия выходит за пределы кривой, прежде чем отобразить полку (при необходимости) для текста размера.
 Методы
 Конструкторы
 Teigha.GraphicsInterface.Drawable
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 Drawable
 Конструктор класса Teigha.GraphicsInterface.Drawable. (Унаследован от Drawable)
 Teigha.DatabaseServices.DBObject
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 DBObject
 Конструктор. (Унаследован от DBObject)
 Teigha.DatabaseServices.DiametricDimension
 Имя
 Описание
 DiametricDimension
 Это обзор перегрузок DiametricDimension.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.GraphicsInterface.Drawable
 Имя
 Описание
 Drawable Методы
 Ниже перечислены методы класса Drawable.
 Drawable Свойства
 Ниже перечислены свойства класса Drawable.
 Teigha.DatabaseServices.DBObject
 Имя
 Описание
 DBObject Методы
 Ниже перечислены методы класса DBObject.
 DBObject Свойства
 Ниже перечислены свойства класса DBObject.
 DBObject События
 Ниже перечислены события класса DBObject.
 Teigha.DatabaseServices.Entity
 Имя
 Описание
 Entity Методы
 Ниже перечислены методы класса Entity.
 Entity Свойства
 Ниже перечислены свойства класса Entity.
 Teigha.DatabaseServices.Dimension
 Имя
 Описание
 Dimension Методы
 Ниже перечислены методы класса Dimension.
 Dimension Свойства
 Ниже перечислены свойства класса Dimension.
 Teigha.DatabaseServices.DiametricDimension
 Имя
 Описание
 DiametricDimension Свойства
 Ниже перечислены свойства класса DiametricDimension.
 Ссылки
 DiametricDimension Конструктор, DiametricDimension Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства, DBObject События
 Ваши комментарии по поводу этого топика: Послать отзыв!