Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBDictionary.GetAt
 Послать отзыв
 Метод предназначен для поиска в словаре записи с заданным ключом.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual DatabaseServices.ObjectId GetAt( ref String entryName );
Копировать Код
Public virtual Function GetAt( ByRef entryName As String ) As DatabaseServices.ObjectId
 Параметры
 Параметры
 Описание
 entryName
 Строка с именем ключа искомой записи.
 Возвращает
 Возвращает ObjectId искомой записи.
 Описание
 Метод GetAt ищет в словаре запись с ключом entryName и в случае успеха возвращает ее ObjectId.
 Ссылки
 Teigha.DatabaseServices.DBDictionary, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!