Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Line2dCollection.IndexOf
 Послать отзыв
 Метод вычисляет индекс элемента коллекции, который соответствует указанному объекту Line2d.
 Синтаксис
C#
Visual Basic
Копировать Код
public int IndexOf( ref Line2d value );
Копировать Код
Public Function IndexOf( ByRef value As Line2d ) As Integer
 Параметры
 Параметры
 Описание
 value
 Проверяемая линия. Тип Line2d.
 Возвращает
 Возвращает индекс элемента коллекции, который соответствует проверяемой линии. Тип int. Если элемент не найден, возвращает -1.
 Описание
 Метод вычисляет индекс элемента коллекции, который соответствует указанному объекту Line2d.
 Замечания
 Индексация элементов в данной коллекции начинается с нуля.
 Ссылки
 Teigha.Geometry.Line2dCollection, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!