Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.Alignment
 Послать отзыв
 Данный метод позволяет определить выравнивание текста или блока в указанной ячейке таблицы.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual CellAlignment Alignment( int row, int col );
Копировать Код
Public virtual Function Alignment( row As Integer, col As Integer ) As CellAlignment
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int.
 col
 Индекс столбца, тип int.
 Возвращает
 Возвращает значение для выравнивания из перечисления Teigha.DatabaseServices.CellAlignment.
 Описание
 Данный метод позволяет определить выравнивание текста или блока в указанной ячейке таблицы. Ячейка задается индексами строки и столбца.
 Замечания
 Для получения того же результата предпочтительнее использовать функционал объекта Cell.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!