Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Matrix2d.IsEqualTo
 Послать отзыв
 Метод реализует проверку равенства двух матриц с использованием указанной точности.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsEqualTo( Matrix2d a, Tolerance tolerance );
Копировать Код
Public Function IsEqualTo( a As Matrix2d, tolerance As Tolerance ) As Boolean
 Параметры
 Параметры
 Описание
 a
 Входная матрица, которая сравнивается с данной. Тип Matrix2d.
 tolerance
 Входная геометрическая точность. Тип Tolerance.
 Возвращает
 Возвращает true, если в пределах заданной точности каждый элемент данной матрицы равен соответствующему элементу матрицы a, соответственно, обе матрицы можно считать равными. В противном случае возвращает false.
 Описание
 Метод позволяет проверить равенство данной матрицы и указанной матрицы с использованием заданной точности.
 Ссылки
 Teigha.Geometry.Matrix2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!