Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.SurfaceCurve2dTo3d
 Послать отзыв
 Класс SurfaceCurve2dTo3d обеспечивает трехмерное представление кривых, определенных в двумерном параметрическом пространстве поверхности.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Geometry::Entity3d Teigha::Geometry::Curve3d Teigha::Geometry::SurfaceCurve2dTo3d
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdGeSurfaceCurve2dTo3d")] public sealed class SurfaceCurve2dTo3d : Curve3d
Копировать Код
<Wrapper("OdGeSurfaceCurve2dTo3d")> Public NotInheritable Class SurfaceCurve2dTo3d Inherits Curve3d
 Описание
 Объект SurfaceCurve2dTo3d представляет собой трехмерную кривую, и всякая точка этой кривой может быть вычислена из точки UV-кривой при соответствующем значении параметра.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Geometry.Entity3d
 Имя
 Описание
 Entity3d Методы
 Ниже перечислены методы класса Entity3d.
 Teigha.Geometry.Curve3d
 Имя
 Описание
 Curve3d Методы
 Ниже перечислены методы класса Curve3d.
 Curve3d Свойства
 Ниже перечислены свойства класса Curve3d.
 Teigha.Geometry.SurfaceCurve2dTo3d
 Имя
 Описание
 SurfaceCurve2dTo3d Методы
 Ниже перечислены методы класса SurfaceCurve2dTo3d.
 SurfaceCurve2dTo3d Свойства
 Ниже перечислены свойства класса SurfaceCurve2dTo3d.
 Ссылки
 SurfaceCurve2dTo3d Методы, SurfaceCurve2dTo3d Свойства, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!