Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Делегат Teigha.DatabaseServices.LayoutEventHandler
 Послать отзыв
 This is type Teigha::DatabaseServices::LayoutEventHandler.
 Синтаксис
C#
Visual Basic
public delegate LayoutEventHandler();
Public Delegate Sub LayoutEventHandler()
 Ваши комментарии по поводу этого топика: Послать отзыв!