Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Cone.Cone
 Послать отзыв
 Конструктор по умолчанию для класса Cone. Создает прямой круговой конус с параметрами по умолчанию.
 Синтаксис
C#
Visual Basic
Копировать Код
public Cone();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию для класса Cone.
 Создает прямой круговой конус со следующими параметрами:
центр основания (0, 0, 0);
ось конуса (0, 1, 0);
радиус основания 2.0;
угол раствора конуса (угол при вершине) 90°;
направление отсчета углов (1, 0, 0).
 Ссылки
 Teigha.Geometry.Cone, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!