Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector2d.DivideBy
 Послать отзыв
 Метод реализует деление компонент данного вектора на переданное вещественное значение.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector2d DivideBy( double value );
Копировать Код
Public Function DivideBy( value As Double ) As Vector2d
 Параметры
 Параметры
 Описание
 value
 Входное значение делителя. Тип double.
 Возвращает
 Возвращает результат деления вектора на вещественное число. Тип Vector2d.
 Описание
 Метод реализует деление компонент данного вектора на переданное вещественное значение.
 Ссылки
 Teigha.Geometry.Vector2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!