Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство RasterImage.Path
 Послать отзыв
 Синтаксис
C#
Visual Basic
public String Path;
Public Property Path() As String
 Описание
 Возвращает имя файла изображения.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.RasterImage, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!