Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.HostApplicationServices.FontMapFileName
 Послать отзыв
 Свойство возвращает имя файла сопоставления (мэппинга) шрифтов. Реализация по умолчанию возвращает пустую строку.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual String FontMapFileName;
Копировать Код
Public Overridable ReadOnly Property FontMapFileName As String
 Возвращает
 Возвращает имя файла сопоставления (мэппинга) шрифтов. Тип String.
 Описание
 Свойство возвращает имя файла сопоставления (мэппинга) шрифтов. Такие файлы содержат список имен шрифтов и шрифтов для их замены. Реализация по умолчанию возвращает пустую строку.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.HostApplicationServices, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!