Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocAction.HasDependencyCachedValue
 Послать отзыв
 Метод позволяет определить имеет ли указанная зависимость кэшированное значение.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool HasDependencyCachedValue( ref AssocDependency dependency );
Копировать Код
Public Function HasDependencyCachedValue( ByRef dependency As AssocDependency ) As Boolean
 Параметры
 Параметры
 Описание
 dependency
 Входная зависимость, у которой проверяется наличие кэшированного значения. Тип AssocDependency. Должна быть открыта как минимум для чтения.
 Возвращает
 Возвращает true, если у входной зависимости имеется кэшированное значение. В противном случае возвращает false.
 Описание
 Метод позволяет определить имеет ли указанная зависимость кэшированное значение.
 Метод делегирован из предиката AssocDependency.HasCachedValue() принадлежащей зависимости. Это позволяет действию-владельцу, а не самой зависимости, решать, имеет ли зависимость кэшированное значение. Реализация по умолчанию просто возвращает false.
 Таким образом, кэшированное значение может храниться либо в самой зависимости, либо в действии, которому она принадлежит, в зависимости от того, что удобнее для конкретных типов действий или зависимостей.
 Если действию принадлежит объект AssocActionBody с переопределенным предикатом HasDependencyCachedValueOverride(), вместо реализации по умолчанию вызывается именно этот переопределенный предикат.
 Ссылки
 Teigha.DatabaseServices.AssocAction, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!