Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод RasterImageDef.GetImageDictionary
 Послать отзыв
 Синтаксис
C#
Visual Basic
public DatabaseServices::ObjectId GetImageDictionary(ref DatabaseServices::Database database);
Public Function GetImageDictionary(ByRef database As DatabaseServices.Database) As DatabaseServices.ObjectId
 Параметры
 Параметры
 Описание
 database
 База данных, в которой надо найти словарь
 Описание
 Возвращает Id словаря изображений для в указанной базе данных чертежа или 0, если словарь изображений в базе данных не найден.
 Ссылки
 Teigha.DatabaseServices.RasterImageDef, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!