Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.IdMapping
 Послать отзыв
 Класс IdMapping используется в операциях глубокого клонирования для сопоставления (мэппинга) идентификаторов исходных объектов и идентификаторов их клонов. Пары идентификаторов (ID исходного объекта - ID его клона) реализуются объектами IdPair.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::DatabaseServices::IdMapping
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdDbIdMapping"), DefaultMember("Item")] public class IdMapping : RXObject, System.Collections.IEnumerable;
Копировать Код
<Wrapper("OdDbIdMapping"), DefaultMember("Item")> Public Class IdMapping Inherits RXObject Inherits System.Collections.IEnumerable
 Описание
 Класс IdMapping используется в операциях глубокого клонирования для сопоставления (мэппинга) идентификаторов исходных объектов и идентификаторов их клонов. Пары идентификаторов (ID исходного объекта - ID его клона) реализуются объектами IdPair.
 Не существует механизма очистки всех сопоставлений в экземпляре IdMapping, поэтому для каждой операции глубокого клонирования необходимо создавать новый экземпляр IdMapping. Экземпляры IdPair, добавленные в экземпляр IdMapping, уничтожаются вместе с этим экземпляром.
 Методы
 Конструкторы
 Teigha.DatabaseServices.IdMapping
 Имя
 Описание
 IdMapping
 Конструктор по умолчанию класса IdMapping.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.DatabaseServices.IdMapping
 Имя
 Описание
 IdMapping Методы
 Ниже перечислены методы класса IdMapping.
 IdMapping Свойства
 Ниже перечислены свойства класса IdMapping.
 Ссылки
 IdMapping Методы, IdMapping Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!