Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DataCell.CellType
 Послать отзыв
 Свойство возвращает тип данных, установленный для этой ячейки.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.CellType CellType;
Копировать Код
Public Property CellType() As DatabaseServices.CellType
 Возвращает
 Возвращает значение из перечисления DatabaseServices.CellType.
 Описание
 Свойство возвращает тип данных, установленный для этой ячейки.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.DataCell, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!