Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Group.GetAllEntityIds
 Послать отзыв
 Метод позволяет получить массив идентификаторов объектов чертежа, принадлежащих данной группе.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectId[] GetAllEntityIds();
Копировать Код
Public Function GetAllEntityIds() As ObjectId()
 Возвращает
 Возвращает массив идентификаторов объектов-членов данной группы. Тип ObjectId[].
 Описание
 Метод позволяет получить массив идентификаторов объектов чертежа, принадлежащих данной группе.
 Ссылки
 Teigha.DatabaseServices.Group, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!