Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Оператор IdPair.!=
 Послать отзыв
 This is !=, a member of class IdPair.
 Синтаксис
C#
Visual Basic
public bool operator !=(IdPair a, IdPair b);
Public Operator !=(a As IdPair, b As IdPair)
 Ссылки
 IdPair Структура, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!