Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Matrix2d.Transpose
 Послать отзыв
 Метод выполняет транспонирование данной матрицы.
 Синтаксис
C#
Visual Basic
Копировать Код
public Matrix2d Transpose();
Копировать Код
Public Function Transpose() As Matrix2d
 Возвращает
 Возвращает транспонированную матрицу. Тип Matrix2d.
 Описание
 Метод выполняет транспонирование данной матрицы.
 Ссылки
 Teigha.Geometry.Matrix2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!