Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FileDependencyManager
 Послать отзыв
 Класс FileDependencyManager предназначен для управления записями в разделе .dwg списка файловых зависимостей.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::DatabaseServices::FileDependencyManager
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdFileDependencyManager")] public sealed class FileDependencyManager : DisposableWrapper
Копировать Код
<Wrapper("OdFileDependencyManager")> Public NotInheritable Class FileDependencyManager Inherits DisposableWrapper
 Описание
 Класс FileDependencyManager предназначен для управления записями в разделе .dwg списка файловых зависимостей.
 Замечания
 Каждый экземпляр базы данных имеет постоянную связь с экземпляром класса FileDependencyManager.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.DatabaseServices.FileDependencyManager
 Имя
 Описание
 FileDependencyManager Методы
 Ниже перечислены методы класса FileDependencyManager.
 FileDependencyManager Свойства
 Ниже перечислены свойства класса FileDependencyManager.
 Ссылки
 FileDependencyManager Методы, FileDependencyManager Свойства, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!