Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SymbolUtilityServices.RegAppAcadName
 Послать отзыв
 Свойство RegAppAcadName представляет предопределенную запись символа для имени зарегистрированного приложения.
 Синтаксис
C#
Visual Basic
Копировать Код
public static String RegAppAcadName;
Копировать Код
Public Shared ReadOnly Property RegAppAcadName As String
 Возвращает
 Возвращает имя зарегистрированного приложения. Тип String.
 Описание
 Свойство RegAppAcadName представляет предопределенную запись символа для имени зарегистрированного приложения. Не может быть ни NULL, ни пустой строкой.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.SymbolUtilityServices, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!