Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.EllipticalArc3d.Set
 Послать отзыв
 Метод позволяет переопределить данную дугу, используя новые центр, оси и радиусы.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Set( Point3d center, Vector3d majorAxis, Vector3d minorAxis, double majorRadius, double minorRadius );
Копировать Код
Public Sub Set( center As Point3d, majorAxis As Vector3d, minorAxis As Vector3d, majorRadius As Double, minorRadius As Double )
 Параметры
 Параметры
 Описание
 center
 Центр эллипса. Тип Point3d.
 majorAxis
 Большая ось эллипса. Тип Vector3d.
 minorAxis
 Малая ось эллипса. Тип Vector3d.
 majorRadius
 Большой радиус эллипса. Тип double.
 minorRadius
 Малый радиус эллипса. Тип double.
 Описание
 Метод позволяет переопределить данную дугу, используя новые точку центра, большую и малую оси, большой и малый радиусы.
 Ссылки
 Teigha.Geometry.EllipticalArc3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!