Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.NorthDirection
 Послать отзыв
 Синтаксис
C#
Visual Basic
public double NorthDirection;
Public Property NorthDirection() As Double
 Описание
 Возвращает или устанавливает угол, определяющий направление на Север, базирующееся на ориентации модели чертежа в WCS координатах.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!