Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GridProperties
 Послать отзыв
 Данное перечисление определяет типы свойств линий сетки таблицы.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum GridProperties { Color = 8, DoubleLineSpacing = 32, Invalid = 0, LineStyle = 1, Linetype = 4, LineWeight = 2, Visibility = 16 }
Копировать Код
Public Enum GridProperties Color = 8 DoubleLineSpacing = 32 Invalid = 0 LineStyle = 1 Linetype = 4 LineWeight = 2 Visibility = 16 End Enum
 Члены
 Члены
 Описание
 Invalid
 Значение: 0. Неизвестное свойство линий сетки.
 LineStyle
 Значение: 1. Стиль линий сетки.
 LineWeight
 Значение: 2. Толщина линий сетки.
 Linetype
 Значение: 4. Тип линий сетки.
 Color
 Значение: 8. Цвет линий сетки.
 Visibility
 Значение: 16. Видимость линий сетки.
 DoubleLineSpacing
 Значение: 32. Двойной интервал между линиями сетки.
 Описание
 Данное перечисление определяет типы свойств линий сетки таблицы.
 Ваши комментарии по поводу этого топика: Послать отзыв!