Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.Dimltex2
 Послать отзыв
 Свойство задает или возвращает тип второй выносной линии.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.ObjectId Dimltex2;
Копировать Код
Public Property Dimltex2 As DatabaseServices.ObjectId
 Возвращает
 Возвращает идентификатор объекта типа линии. Тип DatabaseServices.ObjectId.
 Описание
 Свойство задает или возвращает тип второй выносной линии.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!