Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CellRange.TextHeight
 Послать отзыв
 Свойство позволяет управлять высотой текста в ячейках диапазона.
 Синтаксис
C#
Visual Basic
Копировать Код
public double? TextHeight;
Копировать Код
Public Property TextHeight As Double?
 Возвращает
 Возвращает высоту текста в ячейках диапазона. Тип double.
 Описание
 Свойство позволяет управлять высотой текста в ячейках диапазона.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.CellRange, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!