Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.GetValue
 Послать отзыв
 Метод позволяет определить значение элемента содержимого ячейки, заданного по его индексу. При формировании строки учитываются опции, заданные в параметре formatOption.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual Object GetValue( int row, int column, int contentIndex, FormatOption formatOption );
Копировать Код
Public virtual Function GetValue( row As Integer, column As Integer, contentIndex As Integer, formatOption As FormatOption ) As Object
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 contentIndex
 Индекс элемента содержимого ячейки, тип int. Индекс должен быть больше или равен нулю и меньше количества элементов содержимого в ячейке.
 formatOption
 Опции формирования значения из перечисления FormatOption.
 col
 Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
 Возвращает
 Возвращает значение элемента содержимого ячейки. Тип Object.
 Описание
 Метод позволяет определить значение элемента содержимого ячейки, заданного по его индексу. При формировании значения учитываются опции, заданные в параметре formatOption.
 Замечания
 Для получения того же результата предпочтительнее использовать Table.Cells[row,column].Content[i].GetValue.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!