Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DataTable.TableName
 Послать отзыв
 Свойство предоставляет доступ к имени таблицы.
 Синтаксис
C#
Visual Basic
Копировать Код
public String TableName;
Копировать Код
Public Property TableName() As String
 Возвращает
 Возвращает имя таблицы. Тип String.
 Описание
 Свойство предоставляет доступ к имени таблицы.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.DataTable, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!