Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Point2d.Subtract
 Послать отзыв
 Метод позволяет получить точку, координаты которой определяются разностью координат данной точки и соответствующих компонент заданного вектора.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point2d Subtract( Vector2d value );
Копировать Код
Public Function Subtract( value As Vector2d ) As Point2d
 Параметры
 Параметры
 Описание
 value
 Вычитаемое значение. Тип Vector2d.
 Возвращает
 Возвращает точку Point2d, которая является результатом вычитания.
 Описание
 Метод позволяет получить точку, координаты которой определяются разностью координат данной точки и соответствующих компонент вектора value.
 Ссылки
 Teigha.Geometry.Point2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!