Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LayoutManager.LayoutToBeRenamed
 Послать отзыв
 Cобытие создается перед переименованием листа.
 Синтаксис
C#
Visual Basic
Копировать Код
public event LayoutRenamedEventHandler LayoutToBeRenamed;
Копировать Код
Public Event LayoutToBeRenamed As LayoutRenamedEventHandler
 Описание
 Cобытие создается перед переименованием листа.
 Ссылки
 Teigha.DatabaseServices.LayoutManager, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!