Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Matrix2d.Translation
 Послать отзыв
 Свойство Translation представляет трансляционную часть данной матрицы преобразования.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector2d Translation;
Копировать Код
Public ReadOnly Property Translation As Vector2d
 Возвращает
 Возвращает вектор переноса, который представлен трансляционной частью матрицы. Тип Vector2d.
 Описание
 Свойство Translation представляет трансляционную часть данной матрицы преобразования.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.Matrix2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!