Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GripStatus
 Послать отзыв
 Перечисление предоставляет значения состояний, относящихся к операциям с ручками.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum GripStatus { GripsDone, GripsToBeDeleted, DimDataToBeDeleted }
Копировать Код
Public Enum GripStatus GripsDone GripsToBeDeleted DimDataToBeDeleted End Enum
 Члены
 Члены
 Описание
 GripsDone
 Ручки объекта были удалены в главном приложении, так что объект более не участвует ни в каких операциях редактирования ручек.
 GripsToBeDeleted
 Ручки объекта будут удалены в главном приложении.
 DimDataToBeDeleted
 Приложение должно удалить все связанные с объектом DynamicDimensionData данные приложения, поскольку объект удаляется системой nanoCAD.
 Описание
 Перечисление предоставляет значения состояний, относящихся к операциям с ручками.
 Ваши комментарии по поводу этого топика: Послать отзыв!