Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DwgFiler.WriteSoftPointerId
 Послать отзыв
 Метод предназначен для записи в этот Filer указанного идентификатора мягкой ссылки на указатель SoftPointerId.
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract void WriteSoftPointerId( ObjectId value );
Копировать Код
Public MustOverride Sub WriteSoftPointerId( value As ObjectId )
 Параметры
 Параметры
 Описание
 value
 Записываемое в Filer значение. Тип ObjectId.
 Описание
 Метод предназначен для записи в этот Filer указанного идентификатора мягкой ссылки на указатель SoftPointerId.
 Ссылки
 Teigha.DatabaseServices.DwgFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!