Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.RevolvedSurface.AxisDirection
 Послать отзыв
 Свойство AxisDirection представляет направляющий вектор оси вращения данного объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d AxisDirection;
Копировать Код
Public Property AxisDirection As Vector3d
 Возвращает
 Возвращает направляющий вектор оси вращения. Тип Vector3d.
 Описание
 Свойство AxisDirection представляет направляющий вектор оси вращения данного объекта.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.RevolvedSurface, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!