Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DwgFiler.ReadVector2d
 Послать отзыв
 Метод предназначен для получения двумерного вектора из текущего элемента данного объекта Filer.
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract Vector2d ReadVector2d();
Копировать Код
Public MustOverride Function ReadVector2d() As Vector2d
 Возвращает
 Возвращает двумерный вектор. Тип Vector2d.
 Описание
 Метод предназначен для получения двумерного вектора из текущего элемента данного объекта Filer.
 Ссылки
 Teigha.DatabaseServices.DwgFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!