Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Userr2
 Послать отзыв
 Синтаксис
C#
Visual Basic
public double Userr2;
Public Property Userr2() As Double
 Описание
 Обеспечивает доступ к текущему значению USERR2 для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!