Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.RasterVariables.UserScale
 Послать отзыв
 Свойство UserScale представляет единицы измерения в реальном пространстве, соответствующие единицам чертежа.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual Unit UserScale;
Копировать Код
Public Overridable Property UserScale As Unit
 Возвращает
 Возвращает единицы измерения в реальном пространстве. Значение из перечисления Unit.
 Описание
 Свойство UserScale представляет единицы измерения в реальном пространстве, соответствующие единицам чертежа.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.RasterVariables, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!