Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.ExternalCurve3d.IsEllipticalArc
 Послать отзыв
 Свойство IsEllipticalArc позволяет проверить, представляет ли данный объект эллиптическую дугу.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsEllipticalArc;
Копировать Код
Public ReadOnly Property IsEllipticalArc As Boolean
 Возвращает
 Возвращает true, если данный объект представляет эллиптическую дугу. В противном случае возвращает false.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.ExternalCurve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!