Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.PlanarEntity
 Послать отзыв
 Класс PlanarEntity является абстрактным базовым классом для всех типов плоских поверхностей в трехмерном пространстве.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Geometry::Entity3d Teigha::Geometry::Surface Teigha::Geometry::PlanarEntity
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdGePlanarEnt")] public abstract class PlanarEntity : Surface
Копировать Код
<Wrapper("OdGePlanarEnt")> Public MustInherit Class PlanarEntity Inherits Surface
 Описание
 Класс PlanarEntity является абстрактным базовым классом для всех типов плоских поверхностей в трехмерном пространстве.
 Всякая плоская поверхность S параметризуется следующим образом.
 Параметризация плоской поверхности S реализуется так, что всякая параметрическая точка с координатами u,v отображается в точку S(u,v) пространства моделирования по формуле
 Копировать Код
S(u,v) = originOfPlanarEntity + (u * uAxis) + (v * vAxis)
 В принципе, векторы uAxis и vAxis не обязательно должны быть нормированными или взаимно перпендикулярными, но они обязаны быть неколлинеарными.
 На любой плоской поверхности определена каноническая ортонормированная система координат, связанная с плоскостью следующим образом:
 Параметр
 Описание
 Вычисляется как
 origin
 Точка начала на плоскости.
 origin
 axis1
 Единичный вектор в плоскости.
 uAxis.normal()
 axis2
 Единичный вектор, перпендикулярный плоскости.
 uAxis.crossProduct(vAxis).normal()
 Общее уравнение плоскости имеет вид:
 Копировать Код
 a * X + b * Y + c * Z + d = 0
 где a, b, c, d - некоторые действительные константы, удовлетворяющие условию невырожденности плоскости a^2 + b^2 + c^2 != 0 (т.е., они не могут равняться нулю одновременно). Величины a, b, c служат компонентами вектора нормали этой плоскости.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Geometry.Entity3d
 Имя
 Описание
 Entity3d Методы
 Ниже перечислены методы класса Entity3d.
 Teigha.Geometry.Surface
 Имя
 Описание
 Surface Методы
 Ниже перечислены методы класса Surface.
 Surface Свойства
 Ниже перечислены свойства класса Surface.
 Teigha.Geometry.PlanarEntity
 Имя
 Описание
 PlanarEntity Методы
 Ниже перечислены методы класса PlanarEntity.
 PlanarEntity Свойства
 Ниже перечислены свойства класса PlanarEntity.
 Ссылки
 PlanarEntity Методы, PlanarEntity Свойства, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!