Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.LinearEntity3d.IsParallelTo
 Послать отзыв
 Метод позволяет проверить параллельность данного объекта и указанной плоскости.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsParallelTo( ref PlanarEntity plane );
Копировать Код
Public Function IsParallelTo( ByRef plane As PlanarEntity ) As Boolean
 Параметры
 Параметры
 Описание
 plane
 Входная плоскость. Тип PlanarEntity.
 Возвращает
 Возвращает true, если данный объект и плоскость plane параллельны друг другу. В противном случае возвращает false.
 Описание
 Метод позволяет проверить параллельность данного объекта и указанной плоскости. Используется вызов метода LinearEntity3d.IsParallelTo(PlanarEntity plane, Tolerance tolerance) с точностью, равной Tolerance.Global.
 Ссылки
 Teigha.Geometry.LinearEntity3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!