Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.TableStyleOverride
 Послать отзыв
 Перечисление TableStyleOverride определяет поддерживаемые настройки стиля таблицы.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum TableStyleOverride { TitleSuppressed = 1, HeaderSuppressed = 2, FlowDirection = 3, HorizontalCellMargin = 4, VerticalCellMargin = 5, TitleRowColor = 6, HeaderRowColor = 7, DataRowColor = 8, TitleRowFillNone = 9, HeaderRowFillNone = 10, DataRowFillNone = 11, TitleRowFillColor = 12, HeaderRowFillColor = 13, DataRowFillColor = 14, TitleRowAlignment = 15, HeaderRowAlignment = 16, DataRowAlignment = 17, TitleRowTextStyle = 18, HeaderRowTextStyle = 19, DataRowTextStyle = 20, TitleRowTextHeight = 21, HeaderRowTextHeight = 22, DataRowTextHeight = 23, TitleRowDataType = 24, HeaderRowDataType = 25, DataRowDataType = 26, TitleHorizontalTopColor = 40, TitleHorizontalInsideColor = 41, TitleHorizontalBottomColor = 42, TitleVerticalLeftColor = 43, TitleVerticalInsideColor = 44, TitleVerticalRightColor = 45, HeaderHorizontalTopColor = 46, HeaderHorizontalInsideColor = 47, HeaderHorizontalBottomColor = 48, HeaderVerticalLeftColor = 49, HeaderVerticalInsideColor = 50, HeaderVerticalRightColor = 51, DataHorizontalTopColor = 52, DataHorizontalInsideColor = 53, DataHorizontalBottomColor = 54, DataVerticalLeftColor = 55, DataVerticalInsideColor = 56, DataVerticalRightColor = 57, TitleHorizontalTopLineWeight = 70, TitleHorizontalInsideLineWeight = 71, TitleHorizontalBottomLineWeight = 72, TitleVerticalLeftLineWeight = 73, TitleVerticalInsideLineWeight = 73, TitleVerticalRightLineWeight = 75, HeaderHorizontalTopLineWeight = 76, HeaderHorizontalInsideLineWeight = 77, HeaderHorizontalBottomLineWeight = 78, HeaderVerticalLeftLineWeight = 79, HeaderVerticalInsideLineWeight = 80, HeaderVerticalRightLineWeight = 81, DataHorizontalTopLineWeight = 82, DataHorizontalInsideLineWeight = 83, DataHorizontalBottomLineWeight = 84, DataVerticalLeftLineWeight = 85, DataVerticalInsideLineWeight = 86, DataVerticalRightLineWeight = 87, TitleHorizontalTopVisibility = 100, TitleHorizontalInsideVisibility = 101, TitleHorizontalBottomVisibility = 102, TitleVerticalLeftVisibility = 103, TitleVerticalInsideVisibility = 104, TitleVerticalRightVisibility = 105, HeaderHorizontalTopVisibility = 106, HeaderHorizontalInsideVisibility = 107, HeaderHorizontalBottomVisibility = 108, HeaderVerticalLeftVisibility = 109, HeaderVerticalInsideVisibility = 110, HeaderVerticalRightVisibility = 111, DataHorizontalTopVisibility = 112, DataHorizontalInsideVisibility = 113, DataHorizontalBottomVisibility = 114, DataVerticalLeftVisibility = 115, DataVerticalInsideVisibility = 116, DataVerticalRightVisibility = 117, CellAlignment = 130, CellBackgroundFillNone = 131, CellBackgroundColor = 132, CellContentColor = 133, CellTextStyle = 134, CellTextHeight = 135, CellTopGridColor = 136, CellRightGridColor = 137, CellBottomGridColor = 138, CellLeftGridColor = 139, CellTopGridLineWeight = 140, CellRightGridLineWeight = 141, CellBottomGridLineWeight = 142, CellLeftGridLineWeight = 143, CellTopVisibility = 144, CellRightVisibility = 145, CellBottomVisibility = 146, CellLeftVisibility = 147, CellDataType = 148 }
Копировать Код
Public Enum TableStyleOverride TitleSuppressed = 1 HeaderSuppressed = 2 FlowDirection = 3 HorizontalCellMargin = 4 VerticalCellMargin = 5 TitleRowColor = 6 HeaderRowColor = 7 DataRowColor = 8 TitleRowFillNone = 9 HeaderRowFillNone = 10 DataRowFillNone = 11 TitleRowFillColor = 12 HeaderRowFillColor = 13 DataRowFillColor = 14 TitleRowAlignment = 15 HeaderRowAlignment = 16 DataRowAlignment = 17 TitleRowTextStyle = 18 HeaderRowTextStyle = 19 DataRowTextStyle = 20 TitleRowTextHeight = 21 HeaderRowTextHeight = 22 DataRowTextHeight = 23 TitleRowDataType = 24 HeaderRowDataType = 25 DataRowDataType = 26 TitleHorizontalTopColor = 40 TitleHorizontalInsideColor = 41 TitleHorizontalBottomColor = 42 TitleVerticalLeftColor = 43 TitleVerticalInsideColor = 44 TitleVerticalRightColor = 45 HeaderHorizontalTopColor = 46 HeaderHorizontalInsideColor = 47 HeaderHorizontalBottomColor = 48 HeaderVerticalLeftColor = 49 HeaderVerticalInsideColor = 50 HeaderVerticalRightColor = 51 DataHorizontalTopColor = 52 DataHorizontalInsideColor = 53 DataHorizontalBottomColor = 54 DataVerticalLeftColor = 55 DataVerticalInsideColor = 56 DataVerticalRightColor = 57 TitleHorizontalTopLineWeight = 70 TitleHorizontalInsideLineWeight = 71 TitleHorizontalBottomLineWeight = 72 TitleVerticalLeftLineWeight = 73 TitleVerticalInsideLineWeight = 73 TitleVerticalRightLineWeight = 75 HeaderHorizontalTopLineWeight = 76 HeaderHorizontalInsideLineWeight = 77 HeaderHorizontalBottomLineWeight = 78 HeaderVerticalLeftLineWeight = 79 HeaderVerticalInsideLineWeight = 80 HeaderVerticalRightLineWeight = 81 DataHorizontalTopLineWeight = 82 DataHorizontalInsideLineWeight = 83 DataHorizontalBottomLineWeight = 84 DataVerticalLeftLineWeight = 85 DataVerticalInsideLineWeight = 86 DataVerticalRightLineWeight = 87 TitleHorizontalTopVisibility = 100 TitleHorizontalInsideVisibility = 101 TitleHorizontalBottomVisibility = 102 TitleVerticalLeftVisibility = 103 TitleVerticalInsideVisibility = 104 TitleVerticalRightVisibility = 105 HeaderHorizontalTopVisibility = 106 HeaderHorizontalInsideVisibility = 107 HeaderHorizontalBottomVisibility = 108 HeaderVerticalLeftVisibility = 109 HeaderVerticalInsideVisibility = 110 HeaderVerticalRightVisibility = 111 DataHorizontalTopVisibility = 112 DataHorizontalInsideVisibility = 113 DataHorizontalBottomVisibility = 114 DataVerticalLeftVisibility = 115 DataVerticalInsideVisibility = 116 DataVerticalRightVisibility = 117 CellAlignment = 130 CellBackgroundFillNone = 131 CellBackgroundColor = 132 CellContentColor = 133 CellTextStyle = 134 CellTextHeight = 135 CellTopGridColor = 136 CellRightGridColor = 137 CellBottomGridColor = 138 CellLeftGridColor = 139 CellTopGridLineWeight = 140 CellRightGridLineWeight = 141 CellBottomGridLineWeight = 142 CellLeftGridLineWeight = 143 CellTopVisibility = 144 CellRightVisibility = 145 CellBottomVisibility = 146 CellLeftVisibility = 147 CellDataType = 148 End Enum
 Члены
 Члены
 Описание
 TitleSuppressed
 Значение: 1. Переопределение табличного стиля предписывает подавление заголовка (наименования) таблицы.
 HeaderSuppressed
 Значение: 2. Переопределение табличного стиля предписывает подавление заголовков столбцов таблицы.
 FlowDirection
 Значение: 3. Переопределение направления заполнения таблицы.
 HorizontalCellMargin
 Значение: 4. Переопределение горизонтальных полей ячеек таблицы.
 VerticalCellMargin
 Значение: 5. Переопределение вертикальных полей ячеек.
 TitleRowColor
 Значение: 6. Переопределение цвета в строке заголовка таблицы.
 HeaderRowColor
 Значение: 7. Переопределение цвета в строке заголовков столбцов таблицы.
 DataRowColor
 Значение: 8. Переопределение цвета в строках данных таблицы.
 TitleRowFillNone
 Значение: 9. Переопределение табличного стиля с отключением заливки в строке заголовка таблицы (строке наименования).
 HeaderRowFillNone
 Значение: 10. Переопределение табличного стиля с отключением заливки в строке заголовков столбцов таблицы.
 DataRowFillNone
 Значение: 11. Переопределение табличного стиля с отключением заливки в строках данных таблицы.
 TitleRowFillColor
 Значение: 12. Переопределение цвета заливки в строке заголовка таблицы.
 HeaderRowFillColor
 Значение: 13. Переопределение цвета заливки в строке заголовков столбцов таблицы.
 DataRowFillColor
 Значение: 14. Переопределение цвета заливки в строках данных таблицы.
 TitleRowAlignment
 Значение: 15. Переопределение стиля выравнивания в строке заголовка таблицы.
 HeaderRowAlignment
 Значение: 16 = 0x10. Переопределение стиля выравнивания в строке заголовков столбцов таблицы.
 DataRowAlignment
 Значение: 17 = 0x11. Переопределение стиля выравнивания в строках данных таблицы.
 TitleRowTextStyle
 Значение: 18 = 0x12. Переопределение текстового стиля в строке заголовка таблицы.
 HeaderRowTextStyle
 Значение: 19 = 0x13. Переопределение текстового стиля в строке заголовков столбцов таблицы.
 DataRowTextStyle
 Значение: 20 = 0x14. Переопределение текстового стиля в строках данных таблицы.
 TitleRowTextHeight
 Значение: 21 = 0x15. Переопределение высоты текста в строке заголовка таблицы.
 HeaderRowTextHeight
 Значение: 22 = 0x16. Переопределение высоты текста в строке заголовков столбцов таблицы.
 DataRowTextHeight
 Значение: 23 = 0x17. Переопределение высоты текста в строках данных таблицы.
 TitleRowDataType
 Значение: 24 = 0x18. Тип данных строки заголовка таблицы. Только для внутреннего использования.
 HeaderRowDataType
 Значение: 25 = 0x19. Тип данных строки заголовков столбцов таблицы. Только для внутреннего использования.
 DataRowDataType
 Значение: 26 = 0x1A. Тип данных для строк данных таблицы.
 TitleHorizontalTopColor
 Значение: 40 = 0x28. Переопределение цвета верхней горизонтальной линии сетки в заголовке таблицы.
 TitleHorizontalInsideColor
 Значение: 41 = 0x29. Переопределение цвета внутренних горизонтальных линий сетки в заголовке таблицы.
 TitleHorizontalBottomColor
 Значение: 42 = 0x2a. Переопределение цвета нижней горизонтальной линии сетки в заголовке таблицы.
 TitleVerticalLeftColor
 Значение: 43 = 0x2b. Переопределение цвета левой вертикальной линии сетки в заголовке таблицы.
 TitleVerticalInsideColor
 Значение: 44 = 0x2c. Переопределение цвета внутренних вертикальных линий сетки в заголовке таблицы.
 TitleVerticalRightColor
 Значение: 45 = 0x2d. Переопределение цвета правой вертикальной линии сетки в заголовке таблицы.
 HeaderHorizontalTopColor
 Значение: 46 = 0x2e. Переопределение цвета верхней горизонтальной линии сетки в строке заголовков столбцов таблицы.
 HeaderHorizontalInsideColor
 Значение: 47 = 0x2f. Переопределение цвета внутренних горизонтальных линий сетки в заголовках столбцов таблицы.
 HeaderHorizontalBottomColor
 Значение: 48 = 0x30. Переопределение цвета нижней горизонтальной линии сетки в строке заголовков столбцов таблицы.
 HeaderVerticalLeftColor
 Значение: 49 = 0x31. Переопределение цвета левой вертикальной линии сетки в строке заголовков столбцов таблицы.
 HeaderVerticalInsideColor
 Значение: 50 = 0x32. Переопределение цвета внутренних вертикальных линий сетки в строке заголовков столбцов таблицы.
 HeaderVerticalRightColor
 Значение: 51 = 0x33. Переопределение цвета правой вертикальной линии сетки в строке заголовков столбцов таблицы.
 DataHorizontalTopColor
 Значение: 52 = 0x34. Переопределение цвета верхней горизонтальной линии сетки в строках данных таблицы.
 DataHorizontalInsideColor
 Значение: 53 = 0x35. Переопределение цвета внутренних горизонтальных линий сетки в строках данных таблицы.
 DataHorizontalBottomColor
 Значение: 54 = 0x36. Переопределение цвета нижней горизонтальной линии сетки в строках данных таблицы.
 DataVerticalLeftColor
 Значение: 55 = 0x37. Переопределение цвета левой вертикальной линии сетки в строках данных таблицы.
 DataVerticalInsideColor
 Значение: 56 = 0x38. Переопределение цвета внутренних вертикальных линий сетки в строках данных таблицы.
 DataVerticalRightColor
 Значение: 57 = 0x39. Переопределение цвета правой вертикальной линии сетки в строках данных таблицы.
 TitleHorizontalTopLineWeight
 Значение: 70 = 0x46. Переопределение толщины верхней горизонтальной линии сетки в строке заголовка таблицы.
 TitleHorizontalInsideLineWeight
 Значение: 71 = 0x47. Переопределение толщины внутренних горизонтальных линий сетки в строках заголовка таблицы.
 TitleHorizontalBottomLineWeight
 Значение: 72 = 0x48. Переопределение толщины нижней горизонтальной линии сетки в строке заголовка таблицы.
 TitleVerticalLeftLineWeight
 Значение: 73 = 0x49. Переопределение толщины левой вертикальной линии сетки в заголовке таблицы.
 TitleVerticalInsideLineWeight
 Значение: 73 = 0x4a. Переопределение толщины внутренних вертикальных линий сетки в строках заголовка таблицы.
 TitleVerticalRightLineWeight
 Значение: 75 = 0x4b. Переопределение толщины правой вертикальной линии сетки в заголовке таблицы.
 HeaderHorizontalTopLineWeight
 Значение: 76 = 0x4c. Переопределение толщины верхней горизонтальной линии сетки в строке заголовков столбцов таблицы.
 HeaderHorizontalInsideLineWeight
 Значение: 77 = 0x4d. Переопределение толщины внутренних горизонтальных линий сетки в строках заголовков столбцов таблицы.
 HeaderHorizontalBottomLineWeight
 Значение: 78 = 0x4e. Переопределение толщины нижней горизонтальной линии сетки в строке заголовков столбцов таблицы.
 HeaderVerticalLeftLineWeight
 Значение: 79 = 0x4f. Переопределение толщины левой вертикальной линии сетки в строке заголовков столбцов таблицы.
 HeaderVerticalInsideLineWeight
 Значение: 80 = 0x50. Переопределение толщины внутренних вертикальных линий сетки в строках заголовков столбцов таблицы.
 HeaderVerticalRightLineWeight
 Значение: 81 = 0x51. Переопределение толщины правой вертикальной линии сетки в строке заголовков столбцов таблицы.
 DataHorizontalTopLineWeight
 Значение: 82 = 0x52. Переопределение толщины верхней горизонтальной линии сетки в строках данных таблицы.
 DataHorizontalInsideLineWeight
 Значение: 83 = 0x53. Переопределение толщины внутренних горизонтальных линий сетки в строках данных таблицы.
 DataHorizontalBottomLineWeight
 Значение: 84 = 0x54. Переопределение толщины нижней горизонтальной линии сетки в строках данных таблицы.
 DataVerticalLeftLineWeight
 Значение: 85 = 0x55. Переопределение толщины левой вертикальной линии сетки в строках данных таблицы.
 DataVerticalInsideLineWeight
 Значение: 86 = 0x56. Переопределение толщины внутренних вертикальных линий сетки в строках данных таблицы.
 DataVerticalRightLineWeight
 Значение: 87 = 0x57. Переопределение толщины правой вертикальной линии сетки в строках данных таблицы.
 TitleHorizontalTopVisibility
 Значение: 100 = 0x64. Переопределение видимости верхней горизонтальной линии сетки в строке заголовка таблицы.
 TitleHorizontalInsideVisibility
 Значение: 101 = 0x65. Переопределение видимости внутренних горизонтальных линий сетки в заголовке таблицы.
 TitleHorizontalBottomVisibility
 Значение: 102 = 0x66. Переопределение видимости нижней горизонтальной линии сетки в строке заголовка таблицы.
 TitleVerticalLeftVisibility
 Значение: 103 = 0x67. Переопределение видимости левой вертикальной линии сетки в строке заголовка таблицы.
 TitleVerticalInsideVisibility
 Значение: 104 = 0x68. Переопределение видимости внутренних вертикальных линий сетки в строке заголовка таблицы.
 TitleVerticalRightVisibility
 Значение: 105 = 0x69. Переопределение видимости правой вертикальной линии сетки в строке заголовка таблицы.
 HeaderHorizontalTopVisibility
 Значение: 106 = 0x6a. Переопределение видимости верхней горизонтальной линии сетки в строке заголовков столбцов таблицы.
 HeaderHorizontalInsideVisibility
 Значение: 107 = 0x6b. Переопределение видимости внутренних горизонтальных линий сетки в строках заголовков столбцов таблицы.
 HeaderHorizontalBottomVisibility
 Значение: 108 = 0x6c. Переопределение видимости нижней горизонтальной линии сетки в строке заголовков столбцов таблицы.
 HeaderVerticalLeftVisibility
 Значение: 109 = 0x6d. Переопределение видимости левой вертикальной линии сетки в строке заголовков столбцов таблицы.
 HeaderVerticalInsideVisibility
 Значение: 110 = 0x6e. Переопределение видимости внутренних вертикальных линий сетки в строках заголовков столбцов таблицы.
 HeaderVerticalRightVisibility
 Значение: 111 = 0x6f. Переопределение видимости правой вертикальной линии сетки в строке заголовков столбцов таблицы.
 DataHorizontalTopVisibility
 Значение: 112 = 0x70. Переопределение видимости верхней горизонтальной линии сетки в строке данных таблицы.
 DataHorizontalInsideVisibility
 Значение: 113 = 0x71. Переопределение видимости внутренних горизонтальных линий сетки в строке данных таблицы.
 DataHorizontalBottomVisibility
 Значение: 114 = 0x72. Переопределение видимости нижней горизонтальной линии сетки в строке данных таблицы.
 DataVerticalLeftVisibility
 Значение: 115 = 0x73. Переопределение видимости левой вертикальной линии сетки в строке данных таблицы.
 DataVerticalInsideVisibility
 Значение: 116 = 0x74. Переопределение видимости внутренних вертикальных линий сетки в строке данных таблицы.
 DataVerticalRightVisibility
 Значение: 117 = 0x75. Переопределение видимости правой вертикальной линии сетки в строке данных таблицы.
 CellAlignment
 Значение: 130 = 0x82. Переопределение выравнивания в ячейке таблицы.
 CellBackgroundFillNone
 Значение: 131 = 0x83. Переопределение табличного стиля с отключением фоновой заливки в ячейках таблицы.
 CellBackgroundColor
 Значение: 132 = 0x84. Переопределение цвета фона в ячейках таблицы.
 CellContentColor
 Значение: 133 = 0x85. Переопределение цвета содержимого в ячейках таблицы.
 CellTextStyle
 Значение: 134 = 0x86. Переопределение текстового стиля в ячейках таблицы.
 CellTextHeight
 Значение: 135 = 0x87. Переопределение высоты текста в ячейках таблицы.
 CellTopGridColor
 Значение: 136 = 0x88. Переопределение цвета сетки на верхнем крае ячейки таблицы.
 CellRightGridColor
 Значение: 137 = 0x89. Переопределение цвета сетки на правом крае ячейки таблицы.
 CellBottomGridColor
 Значение: 138 = 0x8a. Переопределение цвета сетки на нижнем крае ячейки таблицы.
 CellLeftGridColor
 Значение: 139 = 0x8b. Переопределение цвета сетки на левом крае ячейки таблицы.
 CellTopGridLineWeight
 Значение: 140 = 0x8c. Переопределение толщины линии сетки на верхнем крае ячейки таблицы.
 CellRightGridLineWeight
 Значение: 141 = 0x8d. Переопределение толщины линии сетки на правом крае ячейки таблицы.
 CellBottomGridLineWeight
 Значение: 142 = 0x8e. Переопределение толщины линии сетки на нижнем крае ячейки таблицы.
 CellLeftGridLineWeight
 Значение: 143 = 0x8f. Переопределение толщины линии сетки на левом крае ячейки таблицы.
 CellTopVisibility
 Значение: 144 = 0x90. Переопределение видимости сетки на верхнем крае ячейки таблицы.
 CellRightVisibility
 Значение: 145 = 0x91. Переопределение видимости сетки на правом крае ячейки таблицы.
 CellBottomVisibility
 Значение: 146 = 0x92. Переопределение видимости сетки на нижнем крае ячейки таблицы.
 CellLeftVisibility
 Значение: 147 = 0x93. Переопределение видимости сетки на левом крае ячейки таблицы.
 CellDataType
 Значение: 148 = 0x94. Тип данных в ячейке.
 Описание
 Перечисление TableStyleOverride определяет поддерживаемые переопределения настроек стиля таблицы.
 Ваши комментарии по поводу этого топика: Послать отзыв!