Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeaderStyle.Annotative
 Послать отзыв
 Свойство представляет предусмотренное стилем состояние аннотаций.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.AnnotativeStates Annotative;
Копировать Код
Public Property Annotative As DatabaseServices.AnnotativeStates
 Возвращает
 Возвращает состояние аннотаций. Перечисление DatabaseServices.AnnotativeStates.
 Описание
 Свойство представляет предусмотренное стилем состояние аннотаций.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MLeaderStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!