Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.ExternalCurve3d.IsCircularArc
 Послать отзыв
 Свойство IsCircularArc позволяет проверить, представляет ли данный объект круглую дугу.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsCircularArc;
Копировать Код
Public ReadOnly Property IsCircularArc As Boolean
 Возвращает
 Возвращает true, если внешняя кривая представлена нативным определением в геометрической библиотеке платформы nanoCAD. В противном случае возвращает false.
 Описание
 Свойство IsCircularArc позволяет проверить, представляет ли данный объект круглую дугу.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.ExternalCurve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!