Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Событие Database.SaveComplete
 Послать отзыв
 Синтаксис
C#
Visual Basic
public event DatabaseIOEventHandler SaveComplete;
Public Event SaveComplete As DatabaseIOEventHandler
 Описание
 Событие показывает, что база данных сохранена в файл.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!