Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Polyline.Plinegen
 Послать отзыв
 Синтаксис
C#
Visual Basic
public bool Plinegen;
Public Property Plinegen() As bool
 Описание
 Если true, то линии полилинии отображаются поверх ее вершин.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Polyline, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!