Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Limmin
 Послать отзыв
 Синтаксис
C#
Visual Basic
public Point2d Limmin;
Public Property Limmin() As Point2d
 Описание
 Возвращает или устанавливает текущее значение LIMMIN пространства модели для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!