Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.Dimtix
 Послать отзыв
 Свойство Dimtix позволяет контролировать размещение размерного текста между выносными линиями.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool Dimtix;
Копировать Код
Public Property Dimtix As Boolean
 Возвращает
 Возвращает true в случае принудительного размещения между выносными линиями. Возвращает false в случае размещения между выносными линиями только при наличии достаточного свободного места.
 Описание
 Свойство позволяет переключаться между двумя вариантами размещения размерного текста между выносными линиями.
 Если свойство Dimtix имеет значение true, размерный текст обязательно размещается между выносными линиями. В случае значения false поле размерного текста размещается между выносными линиями только в том случае, если для него имеется достаточно свободного места.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!