Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DbHomeView.==
 Послать отзыв
 Оператор равенства класса DbHomeView.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool operator ==( ref DbHomeView lhvw, ref DbHomeView rhvw );
Копировать Код
Public Operator ==( ByRef lhvw As DbHomeView, ByRef rhvw As DbHomeView )
 Параметры
 Параметры
 Описание
 lhvw
 Левый операнд. Тип DbHomeView.
 rhvw
 Правый операнд. Тип DbHomeView.
 Возвращает
 Возвращает true в случае равенства операндов. В противном случае возвращает false.
 Описание
 Оператор равенства класса DbHomeView.
 Ссылки
 Teigha.DatabaseServices.DbHomeView, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!