Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AbstractViewPE.OrthoUcs
 Послать отзыв
 Свойство OrthoUcs позволяет определить используемый вариант ортогонального вида относительно пользовательской системы координат.
 Синтаксис
C#
Visual Basic
Копировать Код
public OrthographicView OrthoUcs;
Копировать Код
Public Property OrthoUcs As OrthographicView
 Возвращает
 Возвращает тип ортогонального вида относительно ПСК. Значение из перечисления OrthographicView.
 Описание
 Свойство OrthoUcs позволяет определить используемый вариант ортогонального вида относительно пользовательской системы координат.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.AbstractViewPE, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!