Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Vertex2d.StartWidth
 Послать отзыв
 Свойство StartWidth представляет начальную ширину сегмента полилинии, следующего за этой вершиной.
 Синтаксис
C#
Visual Basic
Копировать Код
public double StartWidth;
Копировать Код
Public Property StartWidth As Double
 Возвращает
 Возвращает начальную ширину сегмента полилинии. Тип double.
 Описание
 Свойство StartWidth представляет начальную ширину сегмента полилинии, следующего за этой вершиной.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Vertex2d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!