Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DataCell.SetSoftPointerId
 Послать отзыв
 Метод устанавливает для этой ячейки идентификатор мягкой ссылки на указатель на зависимый объект.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetSoftPointerId( DatabaseServices.ObjectId value );
Копировать Код
Public Sub SetSoftPointerId( value As DatabaseServices.ObjectId )
 Параметры
 Параметры
 Описание
 value
 Входное значение для ячейки. Тип DatabaseServices.ObjectId.
 Описание
 Метод устанавливает для этой ячейки идентификатор мягкой ссылки на указатель на зависимый объект, заданный входным аргументом value.
 Ссылки
 Teigha.DatabaseServices.DataCell, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!