Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MText.GetColumnHeight
 Послать отзыв
 Метод предоставляет высоту указанного столбца данного объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public double GetColumnHeight( int index );
Копировать Код
Public Function GetColumnHeight( index As Integer ) As Double
 Параметры
 Параметры
 Описание
 index
 Индекс столбца. Тип int.
 Возвращает
 Возвращает высоту столбца. Тип double.
 Описание
 Метод предоставляет высоту указанного столбца (колонки текста) данного объекта.
 Ссылки
 Teigha.DatabaseServices.MText, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!