Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Polyline2d.Polyline2d
 Послать отзыв
 Конструктор.
 Синтаксис
C#
Visual Basic
Копировать Код
public Polyline2d( Poly2dType type, ref Point3dCollection vertices, double elevation, bool closed, double startWidth, double endWidth, ref DoubleCollection bulges );
Копировать Код
Public Sub New( type As Poly2dType, ByRef vertices As Point3dCollection, elevation As double, closed As Boolean, startWidth As double, endWidth As double, ByRef bulges As DoubleCollection )
 Параметры
 Параметры
 Описание
 type
 Тип полилинии из перечисления Poly2dType.
 vertices
 Коллекция вершин полилинии, тип Point3dCollection.
 elevation
 Уровень полилинии, тип double.
 closed
 Замкнутость полилинии, тип bool. Если замкнутая, равен true, в противном случае - false.
 startWidth
 Начальная толщина, тип double.
 endWidth
 Конечная толщина, тип double.
 bulges
 Коллекция прогибов, тип DoubleCollection.
 Описание
 Конструктор.
 Ссылки
 Teigha.DatabaseServices.Polyline2d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!