Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PatternDefinition.BaseX
 Послать отзыв
 Свойство представляет x-координату базовой точки.
 Синтаксис
C#
Visual Basic
Копировать Код
public double BaseX;
Копировать Код
Public ReadOnly Property BaseX As Double
 Возвращает
 Возвращает x-координату базовой точки. Тип double.
 Описание
 Свойство представляет x-координату базовой точки (точки привязки).
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.PatternDefinition, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!