Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DuplicateRecordCloning
 Послать отзыв
 Данное перечисление определяет варианты действий в случаях, когда при глубоком клонировании объектов обнаруживается, что в целевой базе данных уже присутствуют дубликаты их клонов.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum DuplicateRecordCloning { Ignore = 1, MangleName = 4, NotApplicable = 0, RefMangleName = 3, Replace = 2, UnmangleName = 5 }
Копировать Код
Public Enum DuplicateRecordCloning Ignore = 1 MangleName = 4 NotApplicable = 0 RefMangleName = 3 Replace = 2 UnmangleName = 5 End Enum
 Члены
 Члены
 Описание
 NotApplicable
 Значение: 0. Неприменимо.
 Ignore
 Значение: 1. Если обнаружено дублирование, новый клон игнорируется и продолжается использование существующей записи в целевой базе данных. Именно так работают команда INSERT и Database.Insert().
 Replace
 Значение: 2. Обнаруженный дубликат заменяется новой клонированной записью.
 RefMangleName
 Значение: 3. Имена всех входящих ссылок изменяются с использованием $0$.
 MangleName
 Значение: 4. Имена всех входящих записей изменяются с использованием $0$.
 UnmangleName
 Значение: 5. В основном используется в RefEdit при возвращении записей в исходную базу данных. Любое изменение, внесенное MangleName, отменяется, а затем устанавливается значение по умолчанию "Ignore". Другими словами, если дубликат обнаружен после удаления искажения, nanoCAD продолжает использовать существующую запись и игнорирует клонированную.
 Описание
 Данное перечисление определяет варианты действий в случаях, когда при глубоком клонировании объектов обнаруживается, что в целевой базе данных уже присутствуют дубликаты их клонов.
 Ваши комментарии по поводу этого топика: Послать отзыв!