Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.EllipticalArc3d.Normal
 Послать отзыв
 Свойство Normal представляет единичный вектор нормали плоскости данного объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d Normal;
Копировать Код
Public ReadOnly Property Normal As Vector3d
 Возвращает
 Возвращает направление нормали плоскости данного объекта. Тип Vector3d.
 Описание
 Свойство Normal представляет направление нормали плоскости данного объекта. Эллипс ориентирован против часовой стрелки вокруг этого вектора. Возвращаемый вектор является единичным.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.EllipticalArc3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!