Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор BeginWblockEntireDatabaseEventArgs.BeginWblockEntireDatabaseEventArgs
 Послать отзыв
 This is BeginWblockEntireDatabaseEventArgs, a member of class BeginWblockEntireDatabaseEventArgs.
 Синтаксис
C#
Visual Basic
internal BeginWblockEntireDatabaseEventArgs(ref Database from);
Friend Sub New(ByRef from As Database)
 Ссылки
 Teigha.DatabaseServices.BeginWblockEntireDatabaseEventArgs, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!