Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.TimeZone
 Послать отзыв
 Перечисление TimeZone определяет часовые пояса и их смещения относительно UTC (всемирное координированное время).
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdDb.TimeZone")] public enum TimeZone { InternationalDateLine = -12000, MidwayIsland = -11000, Hawaii = -10000, Alaska = -9000, Pacific = -8000, Mazatlan = -7002, Arizona = -7001, Mountain = -7000, Saskatchewan = -6003, MexicoCity = -6002, CentralAmerica = -6001, Central = -6000, Bogota = -5002, Indiana = -5001, Eastern = -5000, Santiago = -4002, Caracas = -4001, AtlanticCanada = -4000, Newfoundland = -3300, Greenland = -3002, BuenosAires = -3001, Brasilia = -3000, MidAtlantic = -2000, CapeVerde = -1001, Azores = -1000, UTC = 0, GMT = 1, Monrovia = 2, Berlin = 1000, Paris = 1001, Prague = 1002, Sarajevo = 1003, WestCentralAfrica = 1004, Athens = 2000, EasternEurope = 2001, Cairo = 2002, Harare = 2003, Helsinki = 2004, Jerusalem = 2005, Moscow = 3000, Riyadh = 3001, Baghdad = 3002, EastAfrica = 3003, Tehran = 3300, AbuDhabi = 4000, Caucasus = 4001, Kabul = 4300, Ekaterinburg = 5000, Islamabad = 5001, Kolkata = 5300, Kathmandu = 5450, Almaty = 6000, Dhaka = 6001, SriLanka = 6002, Rangoon = 6300, Bangkok = 7000, Krasnoyarsk = 7001, Beijing = 8000, Singapore = 8001, Taipei = 8002, Irkutsk = 8003, Perth = 8004, Tokyo = 9000, Seoul = 9001, Yakutsk = 9002, Adelaide = 9300, Darwin = 9301, Sydney = 10000, Guam = 10001, Brisbane = 10002, Hobart = 10003, Vladivostock = 10004, Magadan = 11000, Wellington = 12000, Fiji = 12001, Tonga = 13000 }
Копировать Код
<Wrapper("OdDb.TimeZone")> Public Enum TimeZone InternationalDateLine = -12000 MidwayIsland = -11000 Hawaii = -10000 Alaska = -9000 Pacific = -8000 Mazatlan = -7002 Arizona = -7001 Mountain = -7000 Saskatchewan = -6003 MexicoCity = -6002 CentralAmerica = -6001 Central = -6000 Bogota = -5002 Indiana = -5001 Eastern = -5000 Santiago = -4002 Caracas = -4001 AtlanticCanada = -4000 Newfoundland = -3300 Greenland = -3002 BuenosAires = -3001 Brasilia = -3000 MidAtlantic = -2000 CapeVerde = -1001 Azores = -1000 UTC = 0 GMT = 1 Monrovia = 2 Berlin = 1000 Paris = 1001 Prague = 1002 Sarajevo = 1003 WestCentralAfrica = 1004 Athens = 2000 EasternEurope = 2001 Cairo = 2002 Harare = 2003 Helsinki = 2004 Jerusalem = 2005 Moscow = 3000 Riyadh = 3001 Baghdad = 3002 EastAfrica = 3003 Tehran = 3300 AbuDhabi = 4000 Caucasus = 4001 Kabul = 4300 Ekaterinburg = 5000 Islamabad = 5001 Kolkata = 5300 Kathmandu = 5450 Almaty = 6000 Dhaka = 6001 SriLanka = 6002 Rangoon = 6300 Bangkok = 7000 Krasnoyarsk = 7001 Beijing = 8000 Singapore = 8001 Taipei = 8002 Irkutsk = 8003 Perth = 8004 Tokyo = 9000 Seoul = 9001 Yakutsk = 9002 Adelaide = 9300 Darwin = 9301 Sydney = 10000 Guam = 10001 Brisbane = 10002 Hobart = 10003 Vladivostock = 10004 Magadan = 11000 Wellington = 12000 Fiji = 12001 Tonga = 13000 End Enum
 Члены
 Члены
 Описание
 InternationalDateLine
 Значение: -12000. (GMT-12:00) Международная линия перемены дат Запад (International Date Line).
 MidwayIsland
 Значение: -11000. (GMT-11:00) Мидуэй (США), Самоа (Океания).
 Hawaii
 Значение: -10000. (GMT-10:00) Гавайи (США).
 Alaska
 Значение: -9000. (GMT-09:00) Аляска (США).
 Pacific
 Значение: -8000. (GMT-08:00) Тихоокеанское время (США и Канада); Тихуана (Мексика).
 Mountain
 Значение: -7000. (GMT-07:00) Североамериканское Горное Стандартное Время (MST)
 Arizona
 Значение: -7001. (GMT-07:00) Аризона (США)
 Mazatlan
 Значение: -7002. (GMT-07:00) Чиуауа, Масатлан (Мексика).
 Central
 Значение: -6000. (GMT-06:00) Центральное время (Central Time, CT). (США и Канада).
 CentralAmerica
 Значение: -6001. (GMT-06:00) Центральноамериканское время (Central Standard Time, CST).
 MexicoCity
 Значение: -6002. (GMT-06:00) Гвадалахара, Мехико, Монтеррей (Мексика).
 Saskatchewan
 Значение: -6003. (GMT-06:00) Саскачеван (Канада).
 Eastern
 Значение: -5000. (GMT-05:00) Североамериканское восточное время, EST (США и Канада).
 Indiana
 Значение: -5001. (GMT-05:00) Восточная Индиана (США).
 Bogota
 Значение: -5002. (GMT-05:00) Богота (Колумбия), Лима (Перу), Кито (Эквадор).
 AtlanticCanada
 Значение: -4000. (GMT-04:00) Атлантическое время (Канада).
 Caracas
 Значение: -4001. (GMT-04:00) Каракас (Венесуэла), Ла-Пас (Боливия).
 Santiago
 Значение: -4002. (GMT-04:00) Сантьяго (Чили).
 Newfoundland
 Значение: -3300. (GMT-03:30) Ньюфаундленд (Канада).
 Brasilia
 Значение: -3000. (GMT-03:00) Бразилия.
 BuenosAires
 Значение: -3001. (GMT-03:00) Буэнос-Айрес (Аргентина), Джорджтаун (Гайана).
 Greenland
 Значение: -3002. (GMT-03:00) Гренландия.
 MidAtlantic
 Значение: -2000. (GMT-02:00) Среднеатлантическое время.
 Azores
 Значение: -1000. (GMT-01:00) Азорские острова.
 CapeVerde
 Значение: -1001. (GMT-01:00) Республика Кабо-Верде.
 UTC
 Значение: 0. (UTC) Всемирное координированное время (англ., Universal Coordinated Time)
 GMT
 Значение: 1. (GMT) Среднее время по Гринвичу: Дублин (Ирландия), Эдинбург (Шотландия), Лиссабон (Португалия), Лондон (Великобритания).
 Monrovia
 Значение: 2. (GMT) Касабланка (Марокко), Монровия (Либерия).
 Berlin
 Значение: 1000. (GMT+01:00) Центральноевропейское время (CET). Амстердам (Нидерланды), Берлин (ФРГ), Берн (Швейцария), Рим (Италия), Стокгольм (Швеция), Вена (Австрия).
 Paris
 Значение: 1001. (GMT+01:00) Брюссель (Бельгия), Копенгаген (Дания), Мадрид (Испания), Париж (Франция).
 Prague
 Значение: 1002. (GMT+01:00) Белград (Сербия), Братислава (Словакия), Будапешт (Венгрия), Любляна (Словения), Прага (Чехия).
 Sarajevo
 Значение: 1003. (GMT+01:00) Сараево (Босния и Герцеговина), Скопье (Македония), Варшава (Польша), Загреб (Хорватия).
 WestCentralAfrica
 Значение: 1004. (GMT+01:00) Часовой пояс западной и центральной Африки (WAT).
 Athens
 Значение: 2000. (GMT+02:00) Афины (Греция), Бейрут (Ливан), Стамбул (Турция), Минск (Беларусь).
 EasternEurope
 Значение: 2001. (GMT+02:00) Восточноевропейское стандартное время (EET), Бухарест (Румыния).
 Cairo
 Значение: 2002. (GMT+02:00) Каир (Египет).
 Harare
 Значение: 2003. (GMT+02:00) Хараре (Зимбабве), Претория (ЮАР).
 Helsinki
 Значение: 2004. (GMT+02:00) Хельсинки (Финляндия), Киев (Украина), Рига (Латвия), София (Болгария), Таллин (Эстония), Вильнюс (Литва).
 Jerusalem
 Значение: 2005. (GMT+02:00) Иерусалим (Израиль).
 Moscow
 Значение: 3000. (GMT+03:00) Москва, Санкт-Петербург, Волгоград (РФ).
 Riyadh
 Значение: 3001. (GMT+03:00) Кувейт, Эр-Рияд (Саудовская Аравия).
 Baghdad
 Значение: 3002. (GMT+03:00) Багдад (Иран).
 EastAfrica
 Значение: 3003. (GMT+03:00) Восточноафриканское время, Найроби (Кения).
 Tehran
 Значение: 3300. (GMT+03:30) Тегеран (Иран).
 AbuDhabi
 Значение: 4000. (GMT+04:00) Абу Даби (ОАЭ), Маскат (Оман).
 Caucasus
 Значение: 4001. (GMT+04:00) Баку (Азербайджан), Тбилиси (Грузия), Ереван (Армения).
 Kabul
 Значение: 4300. (GMT+04:30) Кабул (Афганистан).
 Ekaterinburg
 Значение: 5000. (GMT+05:00) Екатеринбург (РФ).
 Islamabad
 Значение: 5001. (GMT+05:00) Исламабад (Пакистан), Карачи (Пакистан), Ташкент (Узбекистан).
 Kolkata
 Значение: 5300. (GMT+05:30) Калькутта, Ченнай, Мумбаи, Нью-Дели (Индия).
 Kathmandu
 Значение: 5450. (GMT+05:45) Катманду (Непал).
 Almaty
 Значение: 6000. (GMT+06:00) Алматы (Казахстан), Новосибирск (РФ)
 Dhaka
 Значение: 6001. (GMT+06:00) Астана (Казахстан), Дакка (Бангладеш).
 SriLanka
 Значение: 6002. (GMT+06:00) Шри-Джаяварденепура-Котте (Шри-Ланка).
 Rangoon
 Значение: 6300. (GMT+06:30) Янгон (Мьянма).
 Bangkok
 Значение: 7000. (GMT+07:00) Бангкок (Таиланд), Ханой (Вьетнам), Джакарта (Индонезия).
 Krasnoyarsk
 Значение: 7001. (GMT+07:00) Красноярск (РФ).
 Beijing
 Значение: 8000. (GMT+08:00) Китайское стандартное время. Пекин, Чунцин, Гонконг, Урумчи (КНР).
 Singapore
 Значение: 8001. (GMT+08:00) Куала-Лумпур (Малайзия), Сингапур.
 Taipei
 Значение: 8002. (GMT+08:00) Тайбэй (Тайвань).
 Irkutsk
 Значение: 8003. (GMT+08:00) Иркутск (РФ), Улан-Батор (Монголия).
 Perth
 Значение: 8004. (GMT+08:00) Перт (Австралия).
 Tokyo
 Значение: 9000. (GMT+09:00) Осака, Саппоро, Токио (Япония).
 Seoul
 Значение: 9001. (GMT+09:00) Сеул (Южная Корея).
 Yakutsk
 Значение: 9002. (GMT+09:00) Якутск (РФ).
 Adelaide
 Значение: 9300. (GMT+09:30) Аделаида (Австралия).
 Darwin
 Значение: 9301. (GMT+09:30) Дарвин (Австралия).
 Sydney
 Значение: 10000. (GMT+10:00) Канберра, Мельбурн, Сидней (Австралия).
 Guam
 Значение: 10001. (GMT+10:00) Гуам (США), Порт-Морсби (Папуа Новая Гвинея).
 Brisbane
 Значение: 10002. (GMT+10:00) Брисбен (Австралия).
 Hobart
 Значение: 10003. (GMT+10:00) Хобарт (Австралия).
 Vladivostock
 Значение: 10004. (GMT+10:00) Владивосток (РФ).
 Magadan
 Значение: 11000. (GMT+11:00) Магадан (РФ), Соломоновы острова (Океания), Новая Каледония (Франция).
 Wellington
 Значение: 12000. (GMT+12:00) Окленд, Веллингтон (Новая Зеландия).
 Fiji
 Значение: 12001. (GMT+12:00) Фиджи (Океания), Камчатка (РФ), Маршалловы острова (Океания).
 Tonga
 Значение: 13000. (GMT+13:00) Нукуалофа (Тонга)
 Описание
 Перечисление TimeZone определяет часовые пояса и их смещения относительно UTC (всемирное координированное время, Coordinated Universal Time).
 Ваши комментарии по поводу этого топика: Послать отзыв!