Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeader.PostMLeaderToDb
 Послать отзыв
 Метод предназначен для добавления этого объекта MLeader в блок пространства модели указанной базы данных.
 Синтаксис
C#
Visual Basic
Копировать Код
public void PostMLeaderToDb( ref DatabaseServices.Database db );
Копировать Код
Public Sub PostMLeaderToDb( ByRef db As DatabaseServices.Database )
 Параметры
 Параметры
 Описание
 db
 База данных, в которую следует добавить мультивыноску MLeader. Тип DatabaseServices.Database.
 Описание
 Метод предназначен для добавления этого объекта MLeader в блок пространства модели указанной базы данных db.
 Ссылки
 Teigha.DatabaseServices.MLeader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!