Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GradientColor.get_Color
 Послать отзыв
 Метод предназначен для получения цвета градиента, представленного данным объектом GradientColor.
 Синтаксис
C#
Visual Basic
Копировать Код
public Teigha.Colors.Color get_Color();
Копировать Код
Public Function get_Color() As Teigha.Colors.Color
 Возвращает
 Возвращает цвет градиента. Тип Teigha.Colors.Color.
 Описание
 Метод предназначен для получения цвета градиента, представленного данным объектом GradientColor.
 Ссылки
 Teigha.DatabaseServices.GradientColor, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!