Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.AttachmentPoint
 Послать отзыв
 Метод предназначен для получения точки присоединения заданной ячейки.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual Point3d AttachmentPoint( int row, int col );
Копировать Код
Public virtual Function AttachmentPoint( row As Integer, col As Integer ) As Point3d
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int.
 col
 Индекс столбца, тип int.
 Возвращает
 Возвращает точку присоединения, тип Point3d.
 Описание
 Метод предназначен для получения точки присоединения ячейки, заданной индексами строки и столбца.
 Замечания
 Для получения того же результата предпочтительнее использовать Table.Cells[row,column].AttachmentPoint.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!