Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LinkedTableData.UnitType
 Послать отзыв
 Метод позволяет получить тип единиц измерения для данных в первом элементе содержимого указанной ячейки таблицы.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual UnitType UnitType( int row, int column );
Копировать Код
Public Overridable Function UnitType( row As Integer, column As Integer ) As UnitType
 Параметры
 Параметры
 Описание
 row
 Индекс строки. Тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 column
 Индекс столбца. Тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице.
 Возвращает
 Возвращает тип единиц измерения. Перечисление UnitType.
 Описание
 Метод позволяет получить тип единиц измерения для данных в первом элементе содержимого указанной ячейки таблицы.
 Ссылки
 Teigha.DatabaseServices.LinkedTableData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!