Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.HitTest
 Послать отзыв
 Метод позволяет проверить попадание в таблицу для указанной точки и заданного направления взгляда.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual TableHitTestInfo HitTest( Point3d point, Vector3d viewVector );
Копировать Код
Public virtual Function HitTest( point As Point3d, viewVector As Vector3d ) As TableHitTestInfo
 Параметры
 Параметры
 Описание
 point
 Проверяемая точка, тип Point3d.
 viewVector
 Направление взгляда, тип Vector3d.
 Возвращает
 Возвращает результат проверки в виде экземпляра класса TableHitTestInfo.
 Описание
 Метод позволяет проверить попадание в таблицу для указанной точки и заданного направления взгляда.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!