Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GradientBackground.GradientBackground
 Послать отзыв
 Конструктор по умолчанию класса GradientBackground.
 Синтаксис
C#
Visual Basic
Копировать Код
public GradientBackground();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса GradientBackground.
 Ссылки
 Teigha.DatabaseServices.GradientBackground, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!