Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AbstractViewTableRecord.Contrast
 Послать отзыв
 Свойство Contrast предоставляет доступ к коэффициенту контрастности для видового экрана.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Contrast;
Копировать Код
Public Property Contrast As Double
 Возвращает
 Возвращает значение коэффициента контрастности для видового экрана. Тип double.
 Описание
 Свойство Contrast предоставляет доступ к коэффициенту контрастности для видового экрана.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.AbstractViewTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!