Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Dimlwe
 Послать отзыв
 Синтаксис
C#
Visual Basic
public DatabaseServices::LineWeight Dimlwe;
Public Property Dimlwe() As DatabaseServices.LineWeight
 Описание
 Возвращает или устанавливает текущее значение DIMLWE для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!