Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Spline.ToPolyline
 Послать отзыв
 Метод предназначен для аппроксимации данного сплайна полилинией. Аргумент метода позволяет ограничить сверху количество вершин создаваемой полилинии.
 Синтаксис
C#
Visual Basic
Копировать Код
public Curve ToPolyline( unsigned int numOfVertices );
Копировать Код
Public Function ToPolyline( numOfVertices As unsigned int ) As Curve
 Параметры
 Параметры
 Описание
 numOfVertices
 Ограничение сверху на количество вершин у создаваемой полилинии. Тип unsigned int. Передаваемое значение не может быть меньше количества определяющих точек сплайна.
 Возвращает
 Возвращает результат аппроксимации сплайна полилинией. Тип Curve.
 Описание
 Метод предназначен для аппроксимации данного сплайна полилинией. Аргумент numOfVertices позволяет ограничить сверху количество вершин создаваемой полилинии. Увеличение количества вершин полилинии обеспечивает более точную аппроксимацию сплайна ценой снижения скорости отрисовки полилинии.
 Результирующая кривая может иметь тип Polyline, Polyline2d или Polyline3d. Если хотя бы одна из точек сплайна не лежит в плоскости XY, то создается полилиния типа Polyline3d, состоящая всегда только из линейных сегментов.
 Ссылки
 Teigha.DatabaseServices.Spline, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!