Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GraphNode.RemoveRefTo
 Послать отзыв
 Метод предназначен для удаления в данном узле исходящей ссылки на указанный объект GraphNode.
 Синтаксис
C#
Visual Basic
Копировать Код
public void RemoveRefTo( ref GraphNode nodeToRemoveReference );
Копировать Код
Public Sub RemoveRefTo( ByRef nodeToRemoveReference As GraphNode )
 Параметры
 Параметры
 Описание
 nodeToRemoveReference
 Удаляемая исходящая ссылка. Тип GraphNode.
 Описание
 Метод предназначен для удаления в данном узле исходящей ссылки на указанный узел nodeToRemoveReference.
 Метод также удаляет в узле nodeToRemoveReference входящую ссылку на данный узел. Узел nodeToRemoveReference должен быть частью того же графа, что и данный объект GraphNode, в противном случае генерируется ошибка eInvalidOwnerObject.
 Ссылки
 Teigha.DatabaseServices.GraphNode, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!