Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AttributeReference.Invisible
 Послать отзыв
 Свойство позволяет получить или установить флаг видимости объекта AttributeReference.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool Invisible;
Копировать Код
Public Property Invisible() As Boolean
 Возвращает
 Возвращает true, если атрибут является видимым. В противном случае возвращает false.
 Описание
 Свойство позволяет получить или установить флаг видимости объекта AttributeReference.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.AttributeReference, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!