Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DynamicBlockReferencePropertyUnitsType
 Послать отзыв
 Данное перечисление определяет единицы измерения свойств динамического блока.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum DynamicBlockReferencePropertyUnitsType { Angular = 1, Area = 3, Distance = 2, NoUnits = 0 }
Копировать Код
Public Enum DynamicBlockReferencePropertyUnitsType Angular = 1 Area = 3 Distance = 2 NoUnits = 0 End Enum
 Члены
 Члены
 Описание
 Angular
 Значение: 1. Свойство представляет угол между двумя векторами.
 Area
 Значение: 3. Свойство представляет площадь двумерной поверхности.
 Distance
 Значение: 2. Свойство представляет расстояние между двумя точками (длина).
 NoUnits
 Значение: 0. Единицы не заданы.
 Описание
 Данное перечисление определяет единицы измерения свойств динамического блока (если имеются). Клиентское приложение может воспользоваться этой информацией для форматирования свойства в своем пользовательском интерфейсе.
 Ваши комментарии по поводу этого топика: Послать отзыв!