Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.XrefFullSubentityPath.SubentId
 Послать отзыв
 Свойство SubentId представляет доступ к идентификатору подобъекта SubentId в данном XrefFullSubentityPath.
 Синтаксис
C#
Visual Basic
Копировать Код
public SubentityId SubentId;
Копировать Код
Public Property SubentId As SubentityId
 Возвращает
 Возвращает идентификатор подобъекта. Тип SubentityId.
 Описание
 Свойство SubentId представляет доступ к идентификатору подобъекта SubentId в данном XrefFullSubentityPath.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.XrefFullSubentityPath, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!