Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector3d.*
 Послать отзыв
 Оператор реализует умножение указанного 3D-вектора на заданный масштабный множитель.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d operator * ( Vector3d a, double factor );
Копировать Код
Public Operator * ( a As Vector3d, factor As Double )
 Параметры
 Параметры
 Описание
 a
 Левый операнд. Тип Vector3d.
 factor
 Правый операнд. Тип double.
 Возвращает
 Возвращает результат умножения входного вектора на заданный множитель. Тип Vector3d.
 Описание
 Оператор реализует умножение указанного 3D-вектора a на заданный масштабный множитель factor.
 Ссылки
 Teigha.Geometry.Vector3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!