Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DimAssocPointType
 Послать отзыв
 Перечисление DimAssocPointType определяет типы опорных точек ассоциативных размеров.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum DimAssocPointType { AngLineEnd = 3, AngLineStart = 2, CenterPoint = 1, ChordPoint = 0, DefiningPoint = 1, FarChordPoint = 1, JogPoint = 3, LeaderPoint = 0, OriginPoint = 0, OverrideCenterPoint = 2, VertexPoint = 2, Xline1End = 1, Xline1Point = 0, Xline1Start = 0, Xline2End = 3, Xline2Point = 1, Xline2Start = 2 }
Копировать Код
Public Enum DimAssocPointType AngLineEnd = 3 AngLineStart = 2 CenterPoint = 1 ChordPoint = 0 DefiningPoint = 1 FarChordPoint = 1 JogPoint = 3 LeaderPoint = 0 OriginPoint = 0 OverrideCenterPoint = 2 VertexPoint = 2 Xline1End = 1 Xline1Point = 0 Xline1Start = 0 Xline2End = 3 Xline2Point = 1 Xline2Start = 2 End Enum
 Члены
 Члены
 Описание
 Xline1Point
 Значение: 0. Точка привязки первой выносной линии.
 Xline2Point
 Значение: 1. Точка привязки второй выносной линии.
 OriginPoint
 Значение: 0. Точка начала.
 DefiningPoint
 Значение: 1. Точка определения размерной линии.
 Xline1Start
 Значение: 0. Начальная точка первой выносной линии размера.
 Xline1End
 Значение: 1. Конечная точка первой выносной линии размера.
 Xline2Start
 Значение: 2. Начальная точка второй выносной линии размера.
 Xline2End
 Значение: 3. Конечная точка второй выносной линии размера.
 VertexPoint
 Значение: 2. Точка в вершине.
 ChordPoint
 Значение: 0. Точка на хорде.
 CenterPoint
 Значение: 1. Центральная точка.
 FarChordPoint
 Значение: 1. Дальняя точка хорды.
 OverrideCenterPoint
 Значение: 2. Точка, переопределяющая центральную точку.
 AngLineStart
 Значение: 2. Начальная точка угла.
 JogPoint
 Значение: 3. Точка излома линии выноски.
 AngLineEnd
 Значение: 3. Конечная точка угла.
 LeaderPoint
 Значение: 0. Точка привязки выноски.
 Описание
 Перечисление DimAssocPointType определяет типы опорных точек ассоциативных размеров.
 Ваши комментарии по поводу этого топика: Послать отзыв!