Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.PointOnCurve3d.PointOnCurve3d
 Послать отзыв
 Конструктор по умолчанию для класса PointOnCurve3d.
 Синтаксис
C#
Visual Basic
Копировать Код
public PointOnCurve3d();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию для класса PointOnCurve3d. Создает точку PointOnCurve3d, которая не лежит ни на какой кривой, и имеет значение параметра, равное 0.
 Ссылки
 Teigha.Geometry.PointOnCurve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!