Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotRotation
 Послать отзыв
 Данное перечисление определяет допустимые углы поворота области печати.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum PlotRotation { Degrees000 = 0, Degrees090 = 1, Degrees180 = 2, Degrees270 = 3 }
Копировать Код
Public Enum PlotRotation Degrees000 = 0 Degrees090 = 1 Degrees180 = 2 Degrees270 = 3 End Enum
 Члены
 Члены
 Описание
 Degrees000
 Значение: 0. Поворот отсутствует (нулевой угол).
 Degrees090
 Значение: 1. Поворот области печати на 90 градусов.
 Degrees180
 Значение: 2. Поворот области печати на 180 градусов.
 Degrees270
 Значение: 3. Поворот области печати на 270 градусов.
 Описание
 Данное перечисление определяет допустимые углы поворота области печати.
 Ваши комментарии по поводу этого топика: Послать отзыв!