Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MTextFragment.Underlined
 Послать отзыв
 Свойство позволяет проверить, является ли текст фрагмента подчёркнутым.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool Underlined;
Копировать Код
Public ReadOnly Property Underlined As Boolean
 Возвращает
 Возвращает true, если данный фрагмент представляет подчёркнутый текст. В противном случае возвращает false.
 Описание
 Свойство позволяет проверить, является ли текст фрагмента подчёркнутым.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.MTextFragment, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!