Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GripDataCollection.GetEnumerator
 Послать отзыв
 Метод предоставляет перечислитель для данной коллекции.
 Синтаксис
C#
Visual Basic
Копировать Код
public IEnumerator<GripData> GetEnumerator();
Копировать Код
Public Function GetEnumerator() As IEnumerator(Of GripData)
 Возвращает
 Возвращает перечислитель. Тип IEnumerator.
 Описание
 Метод предоставляет перечислитель для данной коллекции.
 Ссылки
 Teigha.DatabaseServices.GripDataCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!