Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DataCellCollection.IndexOf
 Послать отзыв
 Метод возвращает индекс элемента коллекции, соответствующего входному объекту DataCell.
 Синтаксис
C#
Visual Basic
Копировать Код
public int IndexOf( ref DataCell value );
Копировать Код
Public Function IndexOf( ByRef value As DataCell ) As Integer
 Параметры
 Параметры
 Описание
 value
 Объект типа DataCell, для которого предполагается найти индекс.
 Возвращает
 Возвращает индекс элемента коллекции, если объект value найден. В противном случае возвращает -1.
 Описание
 Метод возвращает индекс элемента коллекции, соответствующего входному объекту DataCell. Индексы элементов в коллекции отсчитываются от нуля.
 Ссылки
 Teigha.DatabaseServices.DataCellCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!