Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Surface.GetClosestPointTo
 Послать отзыв
 Метод находит на поверхности точку, которая в пределах точности по умолчанию является ближайшей к некоторой заданной 3D-точке.
 Синтаксис
C#
Visual Basic
Копировать Код
public PointOnSurface GetClosestPointTo( Point3d point );
Копировать Код
Public Function GetClosestPointTo( point As Point3d ) As PointOnSurface
 Параметры
 Параметры
 Описание
 point
 Входная произвольная точка в пространстве. Тип Point3d.
 Возвращает
 Возвращает точку на поверхности, которую с предписанной точностью можно считать ближайшей к заданной точке point. Тип PointOnSurface.
 Описание
 Метод находит на поверхности точку, которая в пределах точности по умолчанию является ближайшей к некоторой заданной 3D-точке.
 Замечания
 Используется вызов метода Surface.GetClosestPointTo(Point3d point, Tolerance tolerance) с точностью по умолчанию Tolerance.Global.
 Ссылки
 Teigha.Geometry.Surface, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!