Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Spline.ToPolylineWithPrecision
 Послать отзыв
 Метод предназначен для аппроксимации данного сплайна полилинией. Аргументы метода позволяют настраивать точность аппроксимации и управлять типом получаемой полилинии.
 Синтаксис
C#
Visual Basic
Копировать Код
public Curve ToPolylineWithPrecision( int precision, bool bConvertAsArcs, bool bToLWPolyline );
Копировать Код
Public Function ToPolylineWithPrecision( precision As Integer, bConvertAsArcs As Boolean, bToLWPolyline As Boolean ) As Curve
 Параметры
 Параметры
 Описание
 precision
 Входная точность для процедуры аппроксимации. Тип int.
 bConvertAsArcs
 Флаг, определяющий, следует ли сегменты полилинии конвертировать в круглые дуги, если сплайн плоский. Тип bool.
 bToLWPolyline
 Флаг, определяющий, следует ли приводить результат аппроксимации к типу Polyline, если сплайн плоский. Тип bool.
 Возвращает
 Возвращает результат аппроксимации сплайна полилинией. Тип Curve.
 Описание
 Метод предназначен для аппроксимации данного сплайна полилинией.
 Аргумент precision позволяет настраивать точность аппроксимации. Предполагается, что точность находится в диапазоне [0..99], но может быть и выше. Если передать отрицательное значение, его модуль будет использован как максимально допустимая точность, вычисляемая внутри метода. Необоснованно высокие значения точности порождают избыточное количество вершин полилинии, что закономерно снижает производительность отрисовки полилинии.
 Результирующая кривая может иметь тип Polyline, Polyline2d или Polyline3d. Если сплайн не является плоским, то создается 3D-полилиния Polyline3d, состоящая исключительно из линейных сегментов.
 Если сплайн является плоским, и аргумент bConvertAsArcs принимает значение true, то результирующая полилиния состоит из сегментов круглых дуг, иначе - из линейных сегментов.
 Если сплайн является плоским, и аргумент bToLWPolyline принимает значение true, то результирующая полилиния имеет тип Polyline, в противном случае - Polyline2d.
 Ссылки
 Teigha.DatabaseServices.Spline, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!