Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CompositeCurve3d.GetCurves
 Послать отзыв
 Метод позволяет получить массив подкривых, которые составляют данную составную кривую.
 Синтаксис
C#
Visual Basic
Копировать Код
public Curve3d[] GetCurves();
Копировать Код
Public Function GetCurves() As Curve3d()
 Возвращает
 Возвращает массив подкривых, составляющих данный объект. Тип Curve3d[].
 Описание
 Метод позволяет получить массив подкривых, которые составляют данную составную кривую.
 Ссылки
 Teigha.Geometry.CompositeCurve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!