Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DatabaseSummaryInfo
 Послать отзыв
 Класс DatabaseSummaryInfo предназначен для инкапсуляции набора текстовых строк, которые можно использовать для добавления в файл DWG дополнительной информации.
 Иерархия классов
Teigha::DatabaseServices::DatabaseSummaryInfo
 Синтаксис
C#
Visual Basic
Копировать Код
[StructLayout(LayoutKind.Sequential), Wrapper("OdDbDatabaseSummaryInfo")] public class DatabaseSummaryInfo;
Копировать Код
<StructLayout(LayoutKind.Sequential), Wrapper("OdDbDatabaseSummaryInfo")> Public Class DatabaseSummaryInfo
 Описание
 Класс DatabaseSummaryInfo предназначен для добавления в файл DWG дополнительной текстовой информации.
 Помимо изменения значений предопределенных полей можно создавать пользовательские настраиваемые поля. Такие поля хранятся в списке в виде пар (ключ – значение). Доступ к полям реализуется как по имени (по ключу), так и по индексу в списке. Индексация пользовательских полей начинается с 1. Количество создаваемых полей не ограничивается.
 Методы
 Конструкторы
 ПоказатьInternal
 Нет совпадений по текущему фильтру
 Имя
 Описание
 DatabaseSummaryInfo
 This is DatabaseSummaryInfo, a member of class DatabaseSummaryInfo.
 Топики
 Имя
 Описание
 DatabaseSummaryInfo Методы
 Ниже перечислены методы класса DatabaseSummaryInfo.
 DatabaseSummaryInfo Операторы
 Ниже перечислены операторы класса DatabaseSummaryInfo.
 DatabaseSummaryInfo Свойства
 Ниже перечислены свойства класса DatabaseSummaryInfo.
 Ссылки
 DatabaseSummaryInfo Методы, DatabaseSummaryInfo Операторы, DatabaseSummaryInfo Свойства, Методы, Топики, DatabaseSummaryInfo Методы, DatabaseSummaryInfo Операторы, DatabaseSummaryInfo Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!