Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.RevolveOptionsBuilder.DraftAngle
 Послать отзыв
 Свойство DraftAngle представляет угол сужения профиля с увеличением угла поворота вокруг оси вращения.
 Синтаксис
C#
Visual Basic
Копировать Код
public double DraftAngle;
Копировать Код
Public Property DraftAngle As Double
 Возвращает
 Возвращает угол сужения вращаемого профиля в радианах. Тип double.
 Описание
 Свойство DraftAngle представляет угол сужения профиля с увеличением угла поворота вокруг оси вращения. Измеряется в радианах. Работает со связанным объектом RevolveOptions.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.RevolveOptionsBuilder, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!