Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SectionManager.GetSection
 Послать отзыв
 Метод позволяет получить секущую плоскость по указанному имени в базе данных.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.ObjectId GetSection( ref String pszName );
Копировать Код
Public Function GetSection( ByRef pszName As String ) As DatabaseServices.ObjectId
 Параметры
 Параметры
 Описание
 pszName
 Входное имя секущей плоскости. Тип String.
 Возвращает
 Возвращает идентификатор объекта секущей плоскости. Тип DatabaseServices.ObjectId.
 Описание
 Метод позволяет получить секущую плоскость по указанному имени в базе данных.
 Ссылки
 Teigha.DatabaseServices.SectionManager, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!