Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.EraseFlags
 Послать отзыв
 Перечисление EraseFlags представляет флаги, используемые при удалении пустых объектов.
 Синтаксис
C#
Visual Basic
Копировать Код
[Flags] public enum EraseFlags { ZeroLengthCurve = 1, EmptyText = 2, AllEmptyObj = -1 }
Копировать Код
<Flags> Public Enum EraseFlags ZeroLengthCurve = 1 EmptyText = 2 AllEmptyObj = -1 End Enum
 Члены
 Члены
 Описание
 AllEmptyObj
 Значение: -1. Удаляются все пустые объекты.
 EmptyText
 Значение: 2. Удаляются пустые текстовые объекты (текст и многострочный текст).
 ZeroLengthCurve
 Значение: 1. Удаляются кривые нулевой длины (объекты-наследники классов Curve2d и Curve3d, например линии, полилинии и т.п.).
 Описание
 Перечисление EraseFlags представляет флаги, используемые при удалении пустых объектов.
 Ваши комментарии по поводу этого топика: Послать отзыв!