Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DataTable.NumRowsGrowSize
 Послать отзыв
 Свойство возвращает или позволяет задать инкремент физического количества строк в таблице.
 Синтаксис
C#
Visual Basic
Копировать Код
public int NumRowsGrowSize;
Копировать Код
Public Property NumRowsGrowSize() As Integer
 Возвращает
 Возвращает инкремент физического количества строк в таблице. Тип int.
 Описание
 Свойство возвращает или позволяет задать инкремент физического количества строк в таблице.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.DataTable, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!