Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 DimStyleTableRecord.Dimblk1
 Послать отзыв
 Свойство связано со значением свойства Dimblk1s и хранит настройку внешнего вида первого окончания размерной линии в виде ObjectId блока окончания.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectId Dimblk1 { get; set; }
Копировать Код
Public Property Dimblk1 As ObjectId
 Возвращает
 Возвращает тип данных ObjectId.
 Описание
 В свойстве хранится настройка внешнего вида первого окончания линейного размера в формате ObjectId. Свойство связано со значением свойства Dimblk1s. Оба свойства хранят настройку вида первого окончания размерной линии: Dimblk1s хранит название, Dimblk1 хранит ObjectId этого окончания.
 Каждый вид окончания является блоком и в чертеже хранится, как тип данных BlockTableRecord в таблице блоков BlockTable. Коллекция блоков - окончаний размерных линий хранится в шаблоне чертежа и через API недоступна. Отдельные блоки из этой коллекции появляются в таблице блоков чертежа после того, как к ним обратились через свойство Dimblks/Dimblk1s/Dimblk2s или через пользовательский интерфейс:
 При изменении системной переменной DIMBLK1 будет создан новый размерный стиль под названием <переопределение> на основе текущего с новым значением DIMBLK1.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.DimStyleTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!