Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Field.Field
 Послать отзыв
 Конструктор класса Field. Создает объект Field с указанным кодом поля fieldCode. Дополнительно позволяет указать, является ли это поле текстовым.
 Синтаксис
C#
Visual Basic
Копировать Код
public Field( ref String fieldCode, bool textField );
Копировать Код
Public Sub New( ByRef fieldCode As String, textField As Boolean )
 Параметры
 Параметры
 Описание
 fieldCode
 Код поля. Тип String.
 textField
 Флаг, определяющий, является ли это поле текстовым. Тип bool. Если принимает значение true, поле является текстовым. В противном случае аргумент должен принимать значение false.
 Описание
 Конструктор класса Field. Создает объект Field с указанным кодом поля fieldCode. Дополнительно позволяет указать, является ли это поле текстовым.
 Ссылки
 Teigha.DatabaseServices.Field, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!