Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SubDMesh.SetSubentMaterial
 Послать отзыв
 Метод задает материал для заданного подобъекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetSubentMaterial( SubentityId subentId, DatabaseServices.ObjectId matId );
Копировать Код
Public Sub SetSubentMaterial( subentId As SubentityId, matId As DatabaseServices.ObjectId )
 Параметры
 Параметры
 Описание
 subentId
 Идентификатор подобъекта. Тип SubentityId.
 matId
 Идентификатор материала. Тип DatabaseServices.ObjectId.
 Описание
 Метод задает материал для заданного подобъекта.
 Ссылки
 Teigha.DatabaseServices.SubDMesh, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!