Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObject.RemoveContext(ObjectContext)
 Послать отзыв
 Метод предназначен для удаляения контекста из коллекции.
 Синтаксис
C#
Visual Basic
Копировать Код
public void RemoveContext(ObjectContext context);
Копировать Код
Public Sub RemoveContext(context As ObjectContext)
 Параметры
 Параметры
 Описание
 context
 Контекст, который необходимо удалить. Тип ObjectContext
 Описание
 Метод удаляет контекст из коллекции.
 Замечания
 Активный контекст не может быть удален.
 Ссылки
 Teigha.DatabaseServices.DBObject, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!