Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Handle.Value
 Послать отзыв
 Свойство предоставляет доступ к значению данного дескриптора.
 Синтаксис
C#
Visual Basic
Копировать Код
public Int64 Value;
Копировать Код
Public Property Value() As Int64
 Возвращает
 Свойство возвращает значение данного дескриптора, тип Int64.
 Описание
 Свойство предоставляет доступ к значению данного дескриптора.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Handle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!