Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AbstractViewTableRecord.PerspectiveEnabled
 Послать отзыв
 Свойство PerspectiveEnabled позволяет определить, включен ли режим перспективного проецирования для объекта TableRecord
 Синтаксис
C#
Visual Basic
Копировать Код
public bool PerspectiveEnabled;
Копировать Код
Public Property PerspectiveEnabled As Boolean
 Возвращает
 Возвращает true, если режим перспективного проецирования включен. В противном случае возвращает false.
 Описание
 Свойство PerspectiveEnabled позволяет определить, включен ли режим перспективного проецирования для объекта TableRecord
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.AbstractViewTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!