Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.PlanarEntity.IsParallelTo
 Послать отзыв
 Метод позволяет проверить параллельность указанной линии и данной плоской поверхности в пределах предписанной точности.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsParallelTo( ref LinearEntity3d linearEntity, Tolerance tolerance );
Копировать Код
Public Function IsParallelTo( ByRef linearEntity As LinearEntity3d, tolerance As Tolerance ) As Boolean
 Параметры
 Параметры
 Описание
 linearEntity
 Проверяемый линейный объект. Тип LinearEntity3d.
 tolerance
 Входная геометрическая точность. Тип Tolerance.
 Возвращает
 Возвращает true, если в пределах точности tolerance линейный объект linearEntity можно считать параллельным данной плоской поверхности. В противном случае возвращает false.
 Описание
 Метод позволяет проверить параллельность указанного линейного объекта linearEntity и данной плоской поверхности в пределах точности tolerance.
 Ссылки
 Teigha.Geometry.PlanarEntity, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!