Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.EllipticalCone.EllipticalCone
 Послать отзыв
 Конструктор по умолчанию класса EllipticalCone.
 Синтаксис
C#
Visual Basic
Копировать Код
public EllipticalCone.EllipticalCone();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса EllipticalCone. Создает экземпляр эллиптического конуса по умолчанию с косинусом половинного угла, равным cos(PI/4.0), синусом половинного угла, равным -sin(PI/4.0), началом координат конуса в начале мировой системы координат, единичными большим и малым радиусами и осью конуса, ориентированной в направлении оси Y МСК.
 Ссылки
 Teigha.Geometry.EllipticalCone, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!