Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.SetBreakHeight
 Послать отзыв
 Метод позволяет установить высоту разрыва указанной таблицы, когда разбиение таблицы разрешено.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetBreakHeight( int index, double height );
Копировать Код
Public virtual Sub SetBreakHeight( index As Integer, height As double )
 Параметры
 Параметры
 Описание
 index
 Индекс фрагмента таблицы, тип int. Индекс должен быть больше или равен нулю и меньше количества фрагментов, на которые разбита данная таблица.
 height
 Новая высота разрыва, тип double.
 Описание
 Метод позволяет установить высоту разрыва указанной таблицы, когда разбиение таблицы разрешено.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!