Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.Dimltype
 Послать отзыв
 Свойство задает или возвращает тип линии выноски, размерных линий и выносных линий
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.ObjectId Dimltype;
Копировать Код
Public Property Dimltype As DatabaseServices.ObjectId
 Возвращает
 Возвращает идентификатор типа размерных линий. Тип DatabaseServices.ObjectId.
 Описание
 Свойство задает или возвращает тип линии выноски, размерных линий и выносных линий. Это свойство не влияет на границу вокруг поля размерного текста и выносных линий.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!