Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DrawOrderTable.MoveToTop
 Послать отзыв
 Метод помещает все указанные объекты в конец последовательности отрисовки данной таблицы DrawOrderTable.
 Синтаксис
C#
Visual Basic
Копировать Код
public void MoveToTop( ref ObjectIdCollection collection );
Копировать Код
Public Sub MoveToTop( ByRef collection As ObjectIdCollection )
 Параметры
 Параметры
 Описание
 collection
 Идентификаторы объектов, для которых изменяется порядок отрисовки. Тип ObjectIdCollection.
 Описание
 Метод помещает все указанные объекты в конец последовательности отрисовки данной таблицы DrawOrderTable. Относительный порядок отрисовки в пределах группы перемещаемых объектов не изменяется.
 Ссылки
 Teigha.DatabaseServices.DrawOrderTable, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!