Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GripData.OnHover
 Послать отзыв
 Метод предназначен для обработки события подсвечивания этой ручки курсором мыши.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual ReturnValue OnHover( ObjectId entityId, Context contextFlags );
Копировать Код
Public Overridable Function OnHover( entityId As ObjectId, contextFlags As Context ) As ReturnValue
 Параметры
 Параметры
 Описание
 entityId
 Идентификатор объекта чертежа. Тип ObjectId.
 contextFlags
 Флаги контекста ручки. Перечисление Context.
 Возвращает
 Возвращает результат выполнения операции. Перечисление GripData.ReturnValue.
 Описание
 Метод предназначен для обработки события подсвечивания этой ручки курсором мыши.
 Ссылки
 Teigha.DatabaseServices.GripData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!