Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Transaction.GetObject
 Послать отзыв
 Этот метод вызывает метод Open() верхней в стеке транзакции с передачей ему всех полученных аргументов, что избавляет от необходимости явным образом использовать указатель на эту транзакцию.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual DBObject GetObject( ObjectId id, OpenMode mode );
Копировать Код
Public virtual Function GetObject( id As ObjectId, mode As OpenMode ) As DBObject
 Параметры
 Параметры
 Описание
 id
 Идентификатор объекта, тип ObjectId.
 mode
 Режим доступа к объекту из перечисления OpenMode.
 Возвращает
 Возвращает объект DBObject.
 Описание
 Этот метод вызывает метод Open() верхней транзакции с передачей ему всех полученных аргументов. Объекты могут быть получены только в рамках текущей, верхней в стеке транзакции, поэтому данный метод избавляет от необходимости как-то сохранять указатель на эту транзакцию, либо использовать TransactionManager.TopTransaction для его получения.
 Ссылки
 Teigha.DatabaseServices.Transaction, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!