Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SubDMesh.ConvertToSolid
 Послать отзыв
 Метод предназначен для создания на основе данной сети нового объекта Solid3d.
 Синтаксис
C#
Visual Basic
Копировать Код
public Solid3d ConvertToSolid( bool convertAsSmooth, bool optimize );
Копировать Код
Public Function ConvertToSolid( convertAsSmooth As Boolean, optimize As Boolean ) As Solid3d
 Параметры
 Параметры
 Описание
 convertAsSmooth
 Флаг, определяющий, следует ли преобразовать сеть в гладкую поверхность. Тип bool. Если задано false, то сеть преобразуется в граненую поверхность (faceted surface).
 optimize
 Флаг, определяющий, следует ли выполнить преобразование в оптимизированную поверхность. Тип bool.
 Возвращает
 Возвращает объект Solid3d, полученный из данного SubDMesh.
 Описание
 Метод предназначен для создания на основе данной сети нового объекта Solid3d.
 Ссылки
 Teigha.DatabaseServices.SubDMesh, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!