Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Entity.EcsRotation
 Послать отзыв
 Свойство предназначено для получения или установки угла поворота оси X OCS точки относительно оси X WCS, используемого при её отображении в случае, если значение PDMODE задано не как точка.
 Синтаксис
C#
Visual Basic
Копировать Код
public double EcsRotation;
Копировать Код
Public Property EcsRotation() As Double
 Возвращает
 Возвращает значение типа double, представляющее угол поворота оси X OCS (основанной на векторе нормали точки) относительно оси X WCS.
 Описание
 Задает или возвращает угол (в радианах) между осью Х OCS (прежде называемой ECS) для точки (основанной на векторе нормали) и осью Х, которая будет использоваться при отображении точки. Эта величина используется, если значение PDMODE установлено, чтобы отображать точку иначе, чем ".".
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.DBPoint, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!