Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор OrdinateDimension.OrdinateDimension ()
 Послать отзыв
 This is OrdinateDimension, a member of class OrdinateDimension.
 Синтаксис
C#
Visual Basic
public OrdinateDimension();
Public Sub New()
 Ссылки
 OrdinateDimension Класс, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!