Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.HostApplicationServices.RoamableRootFolder
 Послать отзыв
 Свойство возвращает путь к локальному каталогу перемещаемых файлов. Реализация по умолчанию возвращает пустую строку.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual String RoamableRootFolder;
Копировать Код
Public Overridable ReadOnly Property RoamableRootFolder As String
 Возвращает
 Возвращает путь к локальному каталогу. Тип String.
 Описание
 Свойство возвращает путь к локальному каталогу перемещаемых файлов. Реализация по умолчанию возвращает пустую строку.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.HostApplicationServices, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!