Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CurveCurveIntersector3d.CurveCurveIntersector3d
 Послать отзыв
 Конструктор по умолчанию класса CurveCurveIntersector3d.
 Синтаксис
C#
Visual Basic
Копировать Код
public CurveCurveIntersector3d();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса CurveCurveIntersector3d.
 Создает объект с нулевыми указателями на кривые и точностью по умолчанию. Предполагается, что реальные данные будут заданы позднее с использованием одного из методов Set().
 Ссылки
 Teigha.Geometry.CurveCurveIntersector3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!