Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LayoutEventArgs
 Послать отзыв
 Этот класс представляет данные для связанных с листом событий в менеджере листов.
 Иерархия классов
Teigha::DatabaseServices::LayoutEventArgs
 Синтаксис
C#
Visual Basic
Копировать Код
public class LayoutEventArgs : EventArgs;
Копировать Код
Public Class LayoutEventArgs Inherits EventArgs
 Описание
 Этот класс представляет данные для связанных с листом событий в менеджере листов (AbortLayoutCopied, AbortLayoutRemoved, LayoutCreated, LayoutRemoved, LayoutSwitched, LayoutToBeCopied and XrefSubCommandAborted).
 Топики
 Имя
 Описание
 LayoutEventArgs Свойства
 Ниже перечислены свойства класса LayoutEventArgs.
 Ссылки
 LayoutEventArgs Свойства, Топики, LayoutEventArgs Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!