Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.LayerNotify
 Послать отзыв
 Синтаксис
C#
Visual Basic
public int LayerNotify;
Public Property LayerNotify() As Integer
 Описание
 Возвращает или устанавливает текущее значение заголовка LAYERNOTIFY.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!