Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObjectReference
 Послать отзыв
 Структура DBObjectReference содержит идентификатор объекта и групповой код DXF, представляющий тип объекта.
 Иерархия классов
Teigha::DatabaseServices::DBObjectReference
 Синтаксис
C#
Visual Basic
Копировать Код
public struct DBObjectReference
Копировать Код
Public Structure DBObjectReference
 Описание
 Структура DBObjectReference содержит идентификатор объекта и групповой код DXF, представляющий тип объекта.
 Методы
 Конструкторы
 Имя
 Описание
 DBObjectReference
 Конструктор класса DBObjectReference. Создает экземпляр класса с указанными параметрами.
 Топики
 Имя
 Описание
 DBObjectReference Свойства
 Ниже перечислены свойства класса DBObjectReference.
 Ссылки
 DBObjectReference Свойства, Методы, Топики, DBObjectReference Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!