Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbCurve2dData.==
 Послать отзыв
 Оператор равенства структуры NurbCurve2dData.
 Синтаксис
C#
Visual Basic
Копировать Код
public static bool operator ==( NurbCurve2dData a, NurbCurve2dData b );
Копировать Код
Public Shared Operator =( a As NurbCurve2dData, b As NurbCurve2dData ) As Boolean
 Параметры
 Параметры
 Описание
 a
 Левый операнд. Тип NurbCurve2dData.
 b
 Правый операнд. Тип NurbCurve2dData.
 Возвращает
 Возвращает true, если операнды равны друг другу. В противном случае возвращает false.
 Описание
 Оператор равенства структуры NurbCurve2dData.
 Замечания
 Объекты типа NurbCurve2dData считаются равными, если одновременно выполняются следующие условия:
Обе кривые являются рациональными (назначены веса) или обе являются нерациональными (веса не используются);
Обе кривые являются периодическими (замкнутыми) или обе являются непериодическими (незамкнутыми);
Управляющие вершины совпадают;
Коллекции узлов совпадают;
Значения весов совпадают.
 Ссылки
 Teigha.Geometry.NurbCurve2dData, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!