Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство RasterImage.Scale
 Послать отзыв
 Синтаксис
C#
Visual Basic
public Vector2d Scale;
Public Property Scale() As Vector2d
 Описание
 Возвращает эффективный масштаб по XY для изображения геометрического объекта, вычисляемый как размер изображения в пользовательских единицах (как он вставлен и масштабирован в пространстве модели) деленный на исходный размер изображения (полученный из разрешения изображения, заданного в файле).
 Например, если изображение на листе бумаги — 8.5"*11", но было вставлено в чертеж nanoCAD так, что его размеры были 8.50"*110", то масштаб равен 10.
 Исключение.
 Если нет информации о разрешении в файле, или пользователь не определил, что значат единицы измерения nanoCAD (дюймы, метры и т.д., как они определены в RasterVariables.UserScale), то ширина изображения будет принята равной одной единице nanoCAD для целей расчета масштаба.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.RasterImage, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!