Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve3dCollection
 Послать отзыв
 Класс Curve3dCollection представляет коллекцию объектов Curve3d.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Geometry::Curve3dCollection
 Синтаксис
C#
Visual Basic
Копировать Код
[DefaultMember("Item")] public sealed class Curve3dCollection : DisposableWrapper, IList
Копировать Код
<DefaultMember("Item")> Public NotInheritable Class Curve3dCollection Inherits DisposableWrapper Implements IList
 Описание
 Класс Curve3dCollection представляет коллекцию объектов Curve3d.
 Методы
 Конструкторы
 Teigha.Geometry.Curve3dCollection
 Имя
 Описание
 Curve3dCollection
 Конструктор по умолчанию класса Curve3dCollection.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Geometry.Curve3dCollection
 Имя
 Описание
 Curve3dCollection Методы
 Ниже перечислены методы класса Curve3dCollection.
 Curve3dCollection Свойства
 Ниже перечислены свойства класса Curve3dCollection.
 Ссылки
 Curve3dCollection Методы, Curve3dCollection Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!