Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.SplineEntity2d.GetKnotAt
 Послать отзыв
 Метод находит значение узла с указанным индексом. В текущей версии не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public double GetKnotAt( int index );
Копировать Код
Public Function GetKnotAt( index As Integer ) As Double
 Параметры
 Параметры
 Описание
 index
 Входной индекс узла. Тип int.
 Возвращает
 Возвращает значение узла с индексом index. Тип double.
 Описание
 Метод находит значение узла с заданным индексом index.
 Замечания
 В текущей версии этот метод не реализован.
 Ссылки
 Teigha.Geometry.SplineEntity2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!