Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeader.SetVertex
 Послать отзыв
 Метод позволяет переопределить положение конкретной вершины указанной линии выноски.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetVertex( int leaderLineIndex, int index, Point3d point );
Копировать Код
Public Sub SetVertex( leaderLineIndex As Integer, index As Integer, point As Point3d )
 Параметры
 Параметры
 Описание
 leaderLineIndex
 Индекс линии выноски. Тип int.
 index
 Индекс вершины. Тип int.
 point
 Новое положение вершины. Тип Point3d.
 Описание
 Метод позволяет переопределить положение конкретной вершины указанной линии выноски.
 Ссылки
 Teigha.DatabaseServices.MLeader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!