Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector3d.GetAngleTo
 Послать отзыв
 Метод позволяет определить угол в интервале [0, 2*Pi] между данным вектором и входным вектором vector. Результат зависит от взаимной ориентации указанных векторов относительно вспомогательного входного вектора referenceVector.
 Синтаксис
C#
Visual Basic
Копировать Код
public double GetAngleTo( Vector3d vector, Vector3d referenceVector );
Копировать Код
Public Function GetAngleTo( vector As Vector3d, referenceVector As Vector3d ) As Double
 Параметры
 Параметры
 Описание
 vector
 Входной вектор, до которого измеряется угол. Тип Vector3d.
 referenceVector
 Вспомогательный входной вектор. Тип Vector3d.
 Возвращает
 Возвращает угол между векторами (в радианах) в интервале значений [0, 2*Pi]. Тип double.
 Описание
 Метод позволяет определить угол в интервале [0, 2*Pi] между данным вектором и входным вектором vector. Результат зависит от взаимной ориентации указанных векторов относительно вспомогательного входного вектора referenceVector.
 Если скалярное произведение вектора referenceVector на результат векторного произведения данного вектора на входной вектор vector >= 0.0, то возвращаемое значение угла совпадает с результатом метода Vector3d.GetAngleTo(Vector3d). В противном случае искомый угол равен 2*Pi - Vector3d.GetAngleTo(Vector3d).
 Ссылки
 Teigha.Geometry.Vector3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!