Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство RasterImage.ImageHeight
 Послать отзыв
 Синтаксис
C#
Visual Basic
public double ImageHeight;
Public Property ImageHeight() As Double
 Описание
 Обеспечивает доступ к высоте изображения.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.RasterImage, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!