Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 ViewportTableRecord.GridAdaptive
 Послать отзыв
 Свойство предназначено для включения/выключения автоматического масштабирования сетки.
 Синтаксис
C#
Visual Basic
public bool GridAdaptive;
Public Property GridAdaptive() As bool
 Возвращает
 Возвращает тип данных bool:
true – автоматическое масштабирование сетки включено;
false – автоматическое масштабирование сетки выключено.
 Описание
 Свойство предназначено для управления автоматическим масштабированием сетки. Если автоматическое масштабирование отключено, то на экране будет отображаться сетка со всеми линиями. Если автоматическое масштабирование сетки включено, то слишком мелкие ячейки не будут отображаться на экране и появятся только при приближении.
 В интерфейсе свойство настраивается через диалоговое окно «Режимы черчения» для каждого видового экрана отдельно. Окно «Режимы черчения» можно открыть либо командой DDRMODES, DDSETTINGS, либо через меню Сервис -> Режимы черчения…
 Условия
 Чтение и запись.
 Ссылки
 ViewportTableRecord Класс, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!