Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Viewport.SnapIncrement
 Послать отзыв
 Свойство SnapIncrement представляет интервал шаговой привязки в данном видовом экране.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector2d SnapIncrement;
Копировать Код
Public Property SnapIncrement As Vector2d
 Возвращает
 Возвращает интервал шаговой привязки. Тип Vector2d.
 Описание
 Свойство SnapIncrement представляет интервал шаговой привязки в данном видовом экране.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Viewport, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!