Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.UnderlayReference.ContrastLowerLimit
 Послать отзыв
 Свойство ContrastLowerLimit представляет нижний предел возможных значений контраста.
 Синтаксис
C#
Visual Basic
Копировать Код
public static int ContrastLowerLimit;
Копировать Код
Public Shared ReadOnly Property ContrastLowerLimit As Integer
 Возвращает
 Возвращает минимально возможное значение контраста. Тип int.
 Описание
 Свойство ContrastLowerLimit представляет нижний предел возможных значений контраста.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.UnderlayReference, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!