Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.SetBlockTableRecordId
 Послать отзыв
 Метод позволяет задать ObjectId записи табличного блока элементу содержимого с указанным индексом в заданной ячейке.
 Синтаксис
C#
Visual Basic
Копировать Код
public SetBlockTableRecordId( int row, int column, int contentIndex, DatabaseServices.ObjectId blockId, bool autoFit );
Копировать Код
Public Sub SetBlockTableRecordId( row As Integer, column As Integer, contentIndex As Integer, blockId As DatabaseServices.ObjectId, autoFit As Boolean )
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 contentIndex
 Индекс элемента содержимого ячейки, тип int. Индекс должен быть больше или равен нулю и меньше количества элементов содержимого в ячейке.
 blockId
 ObjectId записи табличного блока. Тип DatabaseServices.ObjectId.
 autoFit
 Флаг, указывающий, следует ли автоматически масштабировать вхождение блока в ячейке. Тип bool.
 col
 Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
 Описание
 Метод позволяет задать ObjectId записи табличного блока элементу содержимого с указанным индексом в заданной ячейке.
 Замечания
 Для получения того же результата предпочтительнее использовать Table.Cells[row,column].Contents[i].BlockTableRecordId.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!