Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Matrix3d.Equals
 Послать отзыв
 Метод реализует проверку объектов на равенство.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool Equals( ref Object obj );
Копировать Код
Public Function Equals( ByRef obj As Object ) As Boolean
 Параметры
 Параметры
 Описание
 obj
 Объект, с которым сравнивается данная матрица. Тип Object.
 Возвращает
 Возвращает true, если obj не равен нулю и представляет эквивалентную матрицу.
 Описание
 Метод реализует проверку объектов на равенство.
 Замечания
 Чтобы сохранить консистентность логики, переопределение методов Equals и GetHashCode должно выполняться совместно. Если Equals возвращает значение true, хеш-коды должны совпадать. Вследствие возможных коллизий равенство хеш-кодов не гарантирует совпадение объектов. Хеш-коды следует формировать для полей, на которых основано равенство.
 Иногда используется метод Equals из объекта C++, но поскольку сравниваются указатели, вы по-прежнему можете использовать Matrix3d.GetHashCode, в то время как метод Equals может быть переопределен в производном классе.
 Ссылки
 Teigha.Geometry.Matrix3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!