Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Database.GetSupportedDxfOutVersions
 Послать отзыв
 Синтаксис
C#
Visual Basic
public array<DwgVersion> GetSupportedDxfOutVersions();
Public Function GetSupportedDxfOutVersions() As array<DwgVersion>
 Описание
 Возвращает массив мажорных и минорных версий выходного DXF.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!