Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 LayerTableRecord.IsHidden
 Послать отзыв
 Свойство предназначено для настройки сокрытия слоя.
 Синтаксис
C#
Visual Basic
public bool IsHidden;
Public Property IsHidden() As bool
 Возвращает
 Возвращает тип данных bool:
true – слой скрыт;
false – слой не скрыт.
 Описание
 С помощью свойства можно получить информацию о том, скрыт слой или нет в виде типа данных bool и изменить его значение. Скрытый слой не отображается в диалоговом окне «Слои», но информация о нем и его настройках содержится в чертеже.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.LayerTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!