Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocArrayPolarParameters.Radius
 Послать отзыв
 Свойство обеспечивает доступ к радиусу кругового массива.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Radius;
Копировать Код
Public Property Radius() As Double
 Возвращает
 Возвращает радиусу кругового массива. Тип double.
 Описание
 Свойство обеспечивает доступ к радиусу кругового массива.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.AssocArrayPolarParameters, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!