Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AbstractViewPE
 Послать отзыв
 Класс AbstractViewPE определяет интерфейс классов расширения протокола для объектов View, ViewTableRecord, Viewport и ViewportTableRecord.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::DatabaseServices::AbstractViewPE
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdAbstractViewPE")] public class AbstractViewPE : RXObject
Копировать Код
<Wrapper("OdAbstractViewPE")> Public Class AbstractViewPE Inherits RXObject
 Описание
 Класс AbstractViewPE определяет интерфейс классов расширения протокола для объектов View, ViewTableRecord, Viewport и ViewportTableRecord.
 Методы
 Конструкторы
 Teigha.DatabaseServices.AbstractViewPE
 Имя
 Описание
 AbstractViewPE
 Конструктор класса AbstractViewPE. Создает экземпляр класса на основе указанного видового экрана.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.DatabaseServices.AbstractViewPE
 Имя
 Описание
 AbstractViewPE Методы
 Ниже перечислены методы класса AbstractViewPE.
 AbstractViewPE Свойства
 Ниже перечислены свойства класса AbstractViewPE.
 Ссылки
 AbstractViewPE Методы, AbstractViewPE Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!