Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObject.HandOverTo(DBObject
 Послать отзыв
 Метод заменяет данный объект, являющийся резидентом базы данных (DBPRO), указанным объектом, не являющимся резидентом базы данных (NDBRO), сохраняя при этом ObjectId, дескриптор, владельца и список реакторов данного объекта. "newPointer"> [in] Указатель на объект, которым нужно заменить этот объект в базе данных. "keepXData"> [in] Флаг, указывающий, следует ли сохранять данные этого объекта. Флаг "keepExtDict"> [in], указывающий, следует ли сохранять словарь расширений этого объекта. Этот объект должен быть открыт в режиме ForWrite. Объект замены открывается в режиме ForWrite и должен быть закрыт.
 Синтаксис
C#
Visual Basic
Копировать Код
public void HandOverTo(DBObject newPointer, bool keepXData, bool keepExtensionDictionary);
Копировать Код
Public Sub HandOverTo(newPointer As DBObject, keepXData As bool, keepExtensionDictionary As bool)
 Параметры
 Параметры
 Описание
 newPointer
 Объект для замещения текущего объекта. Тип DBObject
 keepXData
 Признак, указывающий, должна ли производиться передача данных xdata. Тип bool
 keepExtensionDictionary
 Признак, указывающий, должна ли производиться передача расширенного словаря от старого к новому объекту. Передача производится, если признак установлен в true. Тип bool
Note Этот метод не применим для объектов, являющихся резидентами транзакций. Для таких объектов, вызванный метод HandOverTo никаких действий не производит.
 Описание
 Этот метод обеспечивает возможность замены на нерезидентный объект базы данных (NDBRO) резидентного объекта базы данных (DBRO), сохраняя Id объекта, дескриптор и список реакторов DBRO.
 Примером такой ситуации является использование команды BREAK для разбиения окружности на две дуги. Arc является совершенно другим классом, чем Circle, и новый объект типа Arc должен заместить объект Circle на том месте, где этот объект находится, но при этом Arc должен иметь тот же дескриптор и Id объекта, что имел объект Circle.
 При использовании метода handOverTo(), замещаемый объект (в примере — Circle) должен быть открыт как OpenMode.ForWrite (на запись). Метод handOverTo() объекта, вызываемый с параметром newPointer делает объект, указанный в этом параметре, нерезидентным объектом базы данных (в примере — Arc).
 Если keepXData установлен в true, то xdata данные должны быть сохранены (в новом объекте), а, если keepXData установлен в false, то данные xdata будут утеряны.
 Если keepExtensionDictionary установлен в true, то расширенный словарь и его контекстные данные должны быть сохранены (в новом объекте), и, если keepExtensionDictionary установлен в false, то данные расширенного словаря и его контекста будут утеряны.
 Будучи возвращенным данным методом, объект, вставленный на замену (в примере — Arc) открывается в режиме OpenMode.ForWrite (на запись) и должен быть закрыть методом close(), который вызывается для занесения изменений и закрытия буфера Undo. Приложение, вызвавшее HandOverTo() должно удалить старый объект (в примере — Circle) из памяти т.к. он больше не является резидентом базы данных.
 Ссылки
 Teigha.DatabaseServices.DBObject, Teigha.DatabaseServices
 Исключения
 Выбрасывает исключение eIllegalReplacement если этот объект является NDBRO или newPointer является DBRO.
 Ваши комментарии по поводу этого топика: Послать отзыв!