Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.BoundBlock3d.BoundBlock3d
 Послать отзыв
 Конструктор класса BoundBlock3d. Создает граничную рамку в виде параллелепипеда с заданными сторонами и базовой точкой.
 Синтаксис
C#
Visual Basic
Копировать Код
public BoundBlock3d( Point3d point1, Vector3d dir1, Vector3d dir2, Vector3d dir3 );
Копировать Код
Public Sub New( point1 As Point3d, dir1 As Vector3d, dir2 As Vector3d, dir3 As Vector3d )
 Параметры
 Параметры
 Описание
 point1
 Базовая точка граничной рамки. Тип Point3d.
 dir1
 Вектор, определяющий направление и длину первой стороны параллелепипеда. Тип Vector3d.
 dir2
 Вектор, определяющий направление и длину второй стороны параллелепипеда. Тип Vector3d.
 dir3
 Вектор, определяющий направление и длину третьей стороны параллелепипеда. Тип Vector3d.
 Описание
 Конструктор класса BoundBlock3d. Создает граничную рамку в виде параллелепипеда с заданными сторонами и базовой точкой.
 Ссылки
 Teigha.Geometry.BoundBlock3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!