Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeader.LeaderLineWeight
 Послать отзыв
 Свойство представляет толщину (вес) линий, которая используется данным объектом MLeader.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.LineWeight LeaderLineWeight;
Копировать Код
Public Property LeaderLineWeight As DatabaseServices.LineWeight
 Возвращает
 Возвращает толщину (вес) линий из перечисления DatabaseServices.LineWeight.
 Описание
 Свойство представляет толщину (вес) линий, которая используется данным объектом MLeader.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MLeader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!