Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.BoundBlock3d.Swell
 Послать отзыв
 Метод раздвигает стороны данной граничной рамки на заданное расстояние.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Swell( double distance );
Копировать Код
Public Sub Swell( distance As Double )
 Параметры
 Параметры
 Описание
 distance
 Величина смещения сторон граничной рамки. Тип double.
 Описание
 Метод раздвигает стороны данной граничной рамки на заданное расстояние.
 Ссылки
 Teigha.Geometry.BoundBlock3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!