Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DwgFiler.ReadBytes
 Послать отзыв
 Метод предназначен для получения указанного количества байтов из данного объекта Filer.
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract void ReadBytes(unsigned char[] value);
Копировать Код
Public MustOverride Sub ReadBytes(value() As unsigned char)
 Параметры
 Параметры
 Описание
 value
 Массив байтов. Его длина определяет количество считываемых байтов. Тип long long[].
 Описание
 Метод предназначен для получения указанного количества байтов из данного объекта Filer.
 Ссылки
 Teigha.DatabaseServices.DwgFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!