Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.HatchLoop.HatchLoop
 Послать отзыв
 Конструктор класса HatchLoop.
 Синтаксис
C#
Visual Basic
Копировать Код
public HatchLoop( DatabaseServices.HatchLoopTypes loopType );
Копировать Код
Public Sub New( loopType As DatabaseServices.HatchLoopTypes )
 Параметры
 Параметры
 Описание
 loopType
 Тип контура штриховки. Перечисление DatabaseServices.HatchLoopTypes.
 Описание
 Конструктор класса HatchLoop.
 Ссылки
 Teigha.DatabaseServices.HatchLoop, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!