Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Entity.Layer
 Послать отзыв
 Свойство предназначено для получения или установки имени слоя (записи таблицы слоёв LayerTableRecord), с которым связан данный геометрический объект.
 Синтаксис
C#
Visual Basic
Копировать Код
public String Layer;
Копировать Код
Public Property Layer() As String
 Возвращает
 Возвращает строковое значение (String), представляющее имя слоя, на котором находится объект. Это значение может быть изменено для перемещения объекта на другой слой.
 Описание
 Свойство предназначено для получения или установки имени слоя (записи таблицы слоёв LayerTableRecord), с которым связан данный геометрический объект.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Entity, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!