Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector2dCollection.CopyTo
 Послать отзыв
 Метод копирует все элементы данной коллекции в указанный одномерный массив.
 Синтаксис
C#
Visual Basic
Копировать Код
public void CopyTo( ref Vector2d[] array, int index );
Копировать Код
Public Sub CopyTo( ByRef array() As Vector2d, index As Integer )
 Параметры
 Параметры
 Описание
 array
 Целевой массив, в который копируются элементы коллекции. Тип Vector2d[].
 index
 Входной индекс в целевом массиве, начиная с которого в массив копируются элементы коллекции. Тип int.
 Описание
 Метод копирует все элементы данной коллекции в указанный одномерный массив, начиная с указанного индекса в этом массиве.
 Ссылки
 Teigha.Geometry.Vector2dCollection, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!