Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.BlockTableRecordEnumerator
 Послать отзыв
 Этот класс реализует перечислитель для объекта BlockTableRecord.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::DatabaseServices::BlockTableRecordEnumerator
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdDbObjectIterator")] public class BlockTableRecordEnumerator : DisposableWrapper, System.Collections.IEnumerator;
Копировать Код
<Wrapper("OdDbObjectIterator")> Public Class BlockTableRecordEnumerator Inherits DisposableWrapper Inherits System.Collections.IEnumerator
 Описание
 Этот класс реализует перечислитель для объекта BlockTableRecord.
 Методы
 Конструкторы
 Teigha.DatabaseServices.BlockTableRecordEnumerator
 Имя
 Описание
 BlockTableRecordEnumerator
 Конструктор класса BlockTableRecordEnumerator.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.DatabaseServices.BlockTableRecordEnumerator
 Имя
 Описание
 BlockTableRecordEnumerator Методы
 Ниже перечислены методы класса BlockTableRecordEnumerator.
 BlockTableRecordEnumerator Свойства
 Ниже перечислены свойства класса BlockTableRecordEnumerator.
 Ссылки
 BlockTableRecordEnumerator Методы, BlockTableRecordEnumerator Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!