Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.RevolveOptionsBuilder.RevolveOptionsBuilder
 Послать отзыв
 Конструктор класса RevolveOptionsBuilder. Создает экземпляр с заданными настройками операции вращения.
 Синтаксис
C#
Visual Basic
Копировать Код
public RevolveOptionsBuilder( ref RevolveOptions value );
Копировать Код
Public Sub New( ByRef value As RevolveOptions )
 Параметры
 Параметры
 Описание
 value
 Настройки операции вращения. Тип RevolveOptions.
 Описание
 Конструктор класса RevolveOptionsBuilder. Создает экземпляр с настройками операции вращения, которые передаются в конструктор параметром типа RevolveOptions.
 Ссылки
 Teigha.DatabaseServices.RevolveOptionsBuilder, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!