Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.ContinuousLinetype
 Послать отзыв
 Синтаксис
C#
Visual Basic
public DatabaseServices::ObjectId ContinuousLinetype;
Public Property ContinuousLinetype() As DatabaseServices.ObjectId
 Описание
 Возвращает Id типа линии LinetypeTableRecord базы данных.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!