Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Scale3d.*
 Послать отзыв
 Оператор умножения структуры Scale3d. Реализует умножение вектора масштабирования на скалярный множитель.
 Синтаксис
C#
Visual Basic
Копировать Код
public static Scale3d Scale3d *( Scale3d a, double factor );
Копировать Код
Public Shared Operator *( a As Scale3d, factor As Double ) As Scale3d
 Параметры
 Параметры
 Описание
 a
 Левый операнд. Представляет вектор масштабирования. Тип Scale3d.
 factor
 Правый операнд. Представляет скалярный множитель. Тип double.
 Возвращает
 Возвращает результат умножения вектора масштабирования a на скалярный множитель factor. Тип Scale3d.
 Описание
 Оператор умножения структуры Scale3d. Реализует умножение вектора масштабирования a на скалярный множитель factor.
 Ссылки
 Teigha.Geometry.Scale3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!