Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Surftab1
 Послать отзыв
 Синтаксис
C#
Visual Basic
public int Surftab1;
Public Property Surftab1() As Integer
 Описание
 Обеспечивает доступ к текущему значению SURFTAB1 для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!