Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Событие Database.ObjectOpenedForModify
 Послать отзыв
 Синтаксис
C#
Visual Basic
public event ObjectEventHandler ObjectOpenedForModify;
Public Event ObjectOpenedForModify As ObjectEventHandler
 Описание
 Событие возникает перед тем, как объект будет изменен.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!