Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbCurve2d.SetFitData
 Послать отзыв
 Метод пересчитывает сплайн, используя заданные определяющие точки, векторы касательных в начальной и конечной точках.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetFitData( ref Point2dCollection fitPoints, Vector2d startTangent, Vector2d endTangent );
Копировать Код
Public Sub SetFitData( ByRef fitPoints As Point2dCollection, startTangent As Vector2d, endTangent As Vector2d )
 Параметры
 Параметры
 Описание
 fitPoints
 Определяющие точки. Тип Point2dCollection.
 startTangent
 Вектор касательной в начальной точке. Тип Vector2d.
 endTangent
 Вектор касательной в конечной точке. Тип Vector2d.
 Описание
 Метод пересчитывает сплайн, используя заданные определяющие точки, векторы касательных в начальной и конечной точках.
 Используется вызов метода NurbCurve2d.SetFitData(Point2dCollection fitPoints, Vector2d startTangent, Vector2d endTangent, Tolerance fitTolerance) с точностью по умолчанию, равной Tolerance.Global.
 Ссылки
 Teigha.Geometry.NurbCurve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!