Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Leader.DimensionStyleName
 Послать отзыв
 Синтаксис
C#
Visual Basic
public String DimensionStyleName;
Public Property DimensionStyleName() As String
 Описание
 Возвращает или устанавливает ассоциированное имя размерного стиля.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Leader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!