Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Light.PhysicalIntensityMethod
 Послать отзыв
 Свойство представляет способ задания физической интенсивности данного источника света. Он определяет метод вычисления физической интенсивности света (по пиковой интенсивности, по потоку или по освещенности).
 Синтаксис
C#
Visual Basic
Копировать Код
public PhysicalIntensityMethod PhysicalIntensityMethod;
Копировать Код
Public Property PhysicalIntensityMethod As PhysicalIntensityMethod
 Возвращает
 Возвращает метод вычисления физической интенсивности света. Перечисление PhysicalIntensityMethod.
 Описание
 Свойство представляет способ задания физической интенсивности данного источника света. Он определяет метод вычисления физической интенсивности света (по пиковой интенсивности, по потоку или по освещенности).
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Light, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!