Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство RasterImage.Orientation
 Послать отзыв
 Синтаксис
C#
Visual Basic
public CoordinateSystem3d Orientation;
Public Property Orientation() As CoordinateSystem3d
 Описание
 Обеспечивает доступ к положению и ориентации изображения геометрического объекта. Эти вектора располагаются вдоль внешних ребер изображения. Если изображение является клипом, то оно может быть меньше, чем прямоугольник, образованный этими векторами.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.RasterImage, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!