Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LoftOptionsBuilder.Simplify
 Послать отзыв
 Свойство возвращает состояние флага simplify (упрощение), который определяет возможность использования простых типов поверхностей вместо общего там, где это возможно.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool Simplify;
Копировать Код
Public Property Simplify As Boolean
 Возвращает
 Возвращает true, если предписывается использовать простые типы поверхностей. В противном случае возвращает false.
 Описание
 Свойство возвращает состояние флага simplify (упрощение). Если для флага simplify установлено значение true, простые типы поверхностей (плоскость, цилиндр, конус, сфера и тор) создаются всякий раз, когда поперечные сечения допускают такую возможность. Если для флага simplify установлено значение false, создается общий тип поверхности. Значение по умолчанию - true.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.LoftOptionsBuilder, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!