Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector3d.LargestElement
 Послать отзыв
 Свойство возвращает индекс оси с наибольшим значением координаты у данного вектора.
 Синтаксис
C#
Visual Basic
Копировать Код
public double LargestElement;
Копировать Код
Public Property LargestElement() As Double
 Возвращает
 Возвращает индекс оси 0, 1 или 2. Тип double.
 Описание
 Свойство возвращает индекс оси с наибольшим значением координаты у данного вектора. Оси X, Y и Z представлены индексами 0, 1 и 2, соответственно.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.Vector3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!