Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Событие Database.InsertMappingAvailable
 Послать отзыв
 Синтаксис
C#
Visual Basic
public event IdMappingEventHandler InsertMappingAvailable;
Public Event InsertMappingAvailable As IdMappingEventHandler
 Описание
 Событие посылается прямо непосредственно перед посылкой события beginDeepCloneTranslation.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!