Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SubDMesh.SetVertexAt
 Послать отзыв
 Метод задает вершину сети, используя заданный индекс.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetVertexAt( int index, Point3d position );
Копировать Код
Public Sub SetVertexAt( index As Integer, position As Point3d )
 Параметры
 Параметры
 Описание
 index
 Индекс вершины, тип int.
 position
 Положение вершины в пространстве, тип Point3d.
 Описание
 Метод задает вершину сети, используя заданный индекс.
 Ссылки
 Teigha.DatabaseServices.SubDMesh, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!