Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SymbolUtilityServices.GetBlockNameFromInsertPathName
 Послать отзыв
 Метод позволяет извлечь имя блока из указанного имени пути.
 Синтаксис
C#
Visual Basic
Копировать Код
public static String GetBlockNameFromInsertPathName( ref String pathName );
Копировать Код
Public Shared Function GetBlockNameFromInsertPathName( ByRef pathName As String ) As String
 Параметры
 Параметры
 Описание
 pathName
 Имя пути к переданному параметру. Тип String.
 Возвращает
 Возвращает строку, которая представляет имя блока. Тип String.
 Описание
 Метод позволяет извлечь имя блока из указанного имени пути.
 Ссылки
 Teigha.DatabaseServices.SymbolUtilityServices, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!