Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.PlotStyleNameId
 Послать отзыв
 Синтаксис
C#
Visual Basic
public PlotStyleDescriptor PlotStyleNameId;
Public Property PlotStyleNameId() As PlotStyleDescriptor
 Описание
 Обеспечивает доступ к Id входа в словаре имен стилей печати для plotStyleName в записи таблицы слоев.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!