Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MlineStyleElementCollectionEnumerator.MlineStyleElementCollectionEnumerator
 Послать отзыв
 Конструктор класса MlineStyleElementCollectionEnumerator. Создает перечислитель для указанной коллекции объектов MlineStyleElement.
 Синтаксис
C#
Visual Basic
Копировать Код
public MlineStyleElementCollectionEnumerator( ref MlineStyleElementCollection col );
Копировать Код
Public Sub New( ByRef col As MlineStyleElementCollection )
 Параметры
 Параметры
 Описание
 col
 Коллекция объектов MlineStyleElement, для которой создается перечислитель. Тип MlineStyleElementCollection.
 Описание
 Конструктор класса MlineStyleElementCollectionEnumerator. Создает перечислитель для указанной коллекции объектов MlineStyleElement.
 Ссылки
 Teigha.DatabaseServices.MlineStyleElementCollectionEnumerator, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!