Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Mline.SupressEndCaps
 Послать отзыв
 Свойство предоставляет доступ к флагу, который управляет подавлением торцевого ограничителя на конце данной мультилинии.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool SupressEndCaps;
Копировать Код
Public Property SupressEndCaps As Boolean
 Возвращает
 Возвращает true, если торцевой ограничитель на конце мультилинии подавлен. В противном случае возвращает false.
 Описание
 Свойство предоставляет доступ к флагу, который управляет подавлением торцевого ограничителя на конце данной мультилинии.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Mline, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!