Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ObjectEventArgs
 Послать отзыв
 Класс представляет данные для различных событий в базе данных, связанных с объектами.
 Иерархия классов
Teigha::DatabaseServices::ObjectEventArgs
 Синтаксис
C#
Visual Basic
Копировать Код
public class ObjectEventArgs : EventArgs;
Копировать Код
Public Class ObjectEventArgs Inherits EventArgs
 Описание
 Класс представляет данные для различных событий в базе данных, связанных с объектами.
 Топики
 Имя
 Описание
 ObjectEventArgs Свойства
 Ниже перечислены свойства класса ObjectEventArgs.
 Ссылки
 ObjectEventArgs Свойства, Топики, ObjectEventArgs Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!