Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.BlockTableRecordEnumerator.BlockTableRecordEnumerator
 Послать отзыв
 Конструктор класса BlockTableRecordEnumerator.
 Синтаксис
C#
Visual Basic
Копировать Код
public BlockTableRecordEnumerator( IntPtr unmanagedPointer, bool autoDelete, bool skipDeleted );
Копировать Код
Public Sub New( unmanagedPointer As IntPtr, autoDelete As Boolean, skipDeleted As Boolean )
 Параметры
 Параметры
 Описание
 unmanagedPointer
 Неуправляемый указатель на входной объект. Тип IntPtr.
 autoDelete
 Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.
 skipDeleted
 Флаг, определяющий, следует ли пропускать удаленный объект. Тип bool.
 Описание
 Конструктор класса BlockTableRecordEnumerator.
 Ссылки
 Teigha.DatabaseServices.BlockTableRecordEnumerator, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!