Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocArrayPathParameters.PathDirection
 Послать отзыв
 Свойство обеспечивает доступ к флагу направления расстановки элементов массива по траектории.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool PathDirection;
Копировать Код
Public Property PathDirection() As Boolean
 Возвращает
 Возвращает true в случае расстановки элементов от начала к концу траектории. При обратном направлении возвращает false.
 Описание
 Свойство обеспечивает доступ к флагу направления расстановки элементов массива по траектории. Изменение флага меняет направление расстановки на противоположное.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.AssocArrayPathParameters, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!