Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotSettingsValidator.SetPlotPaperUnits
 Послать отзыв
 Метод задает единицы измерения на бумаге, используемые указанным объектом PlotSettings для полей, смещений, размера бумаги и единиц чертежа.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetPlotPaperUnits( ref PlotSettings plotSet, PlotPaperUnit units );
Копировать Код
Public Sub SetPlotPaperUnits( ByRef plotSet As PlotSettings, units As PlotPaperUnit )
 Параметры
 Параметры
 Описание
 plotSet
 Входной объект PlotSettings с настройками печати.
 units
 Единицы измерения из перечисления PlotPaperUnit (миллиметры, дюймы, пиксели).
 Описание
 Метод задает единицы измерения на бумаге, используемые указанным объектом PlotSettings для полей, смещений, размера бумаги и единиц чертежа.
 Ссылки
 Teigha.DatabaseServices.PlotSettingsValidator, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!