Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.ExternalSurface.ExternalSurface
 Послать отзыв
 Конструктор класса ExternalSurface. Создает объект на основе указателя на определение внешней поверхности и сведений о системе, в которой было создано ее определение.
 Синтаксис
C#
Visual Basic
Копировать Код
public ExternalSurface( IntPtr surfaceDefinition, Geometry.ExternalEntityKind surfaceKind );
Копировать Код
Public Sub New( surfaceDefinition As IntPtr, surfaceKind As Geometry.ExternalEntityKind )
 Параметры
 Параметры
 Описание
 surfaceDefinition
 Входное определение внешней поверхности. Тип IntPtr.
 surfaceKind
 Информация о системе, в которой было создано определение внешней поверхности. Перечисление ExternalEntityKind.
 Описание
 Конструктор класса ExternalSurface. Создает объект на основе указателя на определение внешней поверхности и сведений о системе, в которой было создано ее определение.
 Ссылки
 Teigha.Geometry.ExternalSurface, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!