Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SubDMesh.Watertight
 Послать отзыв
 Свойство позволяет определить, является ли сеть непроницаемой.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool Watertight;
Копировать Код
Public Property Watertight() As Boolean
 Возвращает
 Возвращает true, если сеть непроницаемая, и false в противном случае.
 Описание
 Данное свойство позволяет определить, является ли сеть непроницаемой.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.SubDMesh, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!