Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Point3d.Z
 Послать отзыв
 Свойство, представляющее координату Z данной точки.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Z;
Копировать Код
Public Property Z() As Double
 Возвращает
 Возвращает координату Z данной точки.Тип double.
 Описание
 Свойство, представляющее координату Z данной точки.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.Point3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!