Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Событие Database.BeginDeepClone
 Послать отзыв
 Синтаксис
C#
Visual Basic
public event IdMappingEventHandler BeginDeepClone;
Public Event BeginDeepClone As IdMappingEventHandler
 Описание
 Это событие показывает, что операция глубокого клонирования началась в базе данных чертежа.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!