Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GeoLocationData.TypeOfCoordinates
 Послать отзыв
 Свойство обеспечивает доступ к текущему типу проектных координат.
 Синтаксис
C#
Visual Basic
Копировать Код
public Teigha.DatabaseServices.TypeOfCoordinates TypeOfCoordinates;
Копировать Код
Public Property TypeOfCoordinates As Teigha.DatabaseServices.TypeOfCoordinates
 Возвращает
 Возвращает тип координат из перечисления Teigha.DatabaseServices.TypeOfCoordinates.
 Описание
 Свойство обеспечивает доступ к текущему типу проектных координат.
 Замечания
 Текущая реализация поддерживает только типы координат CoordinateTypeGrid и CoordinateTypeGeographic из перечисления Teigha.DatabaseServices.TypeOfCoordinates.
 Корректный пересчет координат обеспечивается лишь при условии, что в качестве единицы измерения на чертеже выбран метр.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.GeoLocationData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!