Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Entity.Hyperlinks
 Послать отзыв
 Свойство предоставляет доступ к коллекции гиперссылок, связанных с текущим геометрическим объектом.
 Синтаксис
C#
Visual Basic
Копировать Код
public HyperLinkCollection Hyperlinks;
Копировать Код
Public Property Hyperlinks() As HyperLinkCollection
 Возвращает
 Возвращает объект типа HyperLinkCollection, содержащий одну или несколько гиперссылок, привязанных к данному объекту. Эта коллекция позволяет просматривать и управлять ссылками, например, открывать веб-страницы или файлы при взаимодействии с объектом.
 Описание
 Свойство предоставляет доступ к коллекции гиперссылок, связанных с текущим геометрическим объектом.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.Entity, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!