Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GraphNode.Out
 Послать отзыв
 Метод позволяет получить указанную по индексу исходящую ссылку данного узла GraphNode.
 Синтаксис
C#
Visual Basic
Копировать Код
public GraphNode Out( int index );
Копировать Код
Public Function Out( index As Integer ) As GraphNode
 Параметры
 Параметры
 Описание
 index
 Индекс искомой ссылки. Тип int.
 Возвращает
 Возвращает исходящую ссылку данного узла. Тип GraphNode. Если индекс недействителен, возвращает нулевой указатель.
 Описание
 Метод позволяет получить указанную по индексу исходящую ссылку данного узла GraphNode.
 Ссылки
 Teigha.DatabaseServices.GraphNode, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!