Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.XrefSubCommandEventArgs.btrNames
 Послать отзыв
 Свойство btrNames представляет массив имён записей таблицы блоков.
 Синтаксис
C#
Visual Basic
Копировать Код
public String[] btrNames;
Копировать Код
Public ReadOnly Property btrNames As String()
 Возвращает
 Возвращает массив имён. Тип String[].
 Описание
 Свойство btrNames представляет массив имён записей таблицы блоков.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.XrefSubCommandEventArgs, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!