Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LayoutManager.LayoutCreated
 Послать отзыв
 Cобытие создается, когда завершается создание нового листа.
 Синтаксис
C#
Visual Basic
Копировать Код
public event LayoutEventHandler LayoutCreated;
Копировать Код
Public Event LayoutCreated As LayoutEventHandler
 Описание
 Cобытие создается, когда завершается создание нового листа.
 Ссылки
 Teigha.DatabaseServices.LayoutManager, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!