Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Событие Database.BeginWblockEntireDatabase
 Послать отзыв
 Синтаксис
C#
Visual Basic
public event BeginWblockEntireDatabaseEventHandler BeginWblockEntireDatabase;
Public Event BeginWblockEntireDatabase As BeginWblockEntireDatabaseEventHandler
 Описание
 Событие показывает, что операция клонирования wblock в базе данных чертежа.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!