Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.HyperLink.Description
 Послать отзыв
 Свойство обеспечивает доступ к описанию, связанному с данным объектом HyperLink.
 Синтаксис
C#
Visual Basic
Копировать Код
public String Description;
Копировать Код
Public Property Description As String
 Возвращает
 Возвращает описание данного объекта. Тип String.
 Описание
 Свойство обеспечивает доступ к описанию, связанному с данным объектом HyperLink.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.HyperLink, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!