Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Shape.Size
 Послать отзыв
 Свойство Size представляет высоту данного объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Size;
Копировать Код
Public Property Size As Double
 Возвращает
 Возвращает высоту данного объекта. Тип double.
 Описание
 Свойство Size представляет высоту данного объекта.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Shape, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!