Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Polyline2d.DefaultStartWidth
 Послать отзыв
 Свойство предосталяет доступ к значению по умолчанию начальной ширины сегмента полилинии. Это значение используется как начальная ширина по умолчанию для всех вершин полилинии.
 Синтаксис
C#
Visual Basic
Копировать Код
public double DefaultStartWidth;
Копировать Код
Public Property DefaultStartWidth() As double
 Возвращает
 Возвращает начальную ширину сегмента полилинии как значение типа double.
 Описание
 Свойство предосталяет доступ к значению по умолчанию начальной ширины сегмента полилинии. Это значение используется как начальная ширина по умолчанию для всех вершин полилинии. Таким образом, в рамках функции DXFOUT вершины с такой начальной шириной, не будут записывать это значение в файл. В случае функции DXFIN вершины без группового кода DXF 40 будут использовать начальную ширину полилинии по умолчанию.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Polyline2d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!