Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Sun.IsOn
 Послать отзыв
 Свойство IsOn представляет состояние флага учета солнечного освещения.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsOn;
Копировать Код
Public Property IsOn As Boolean
 Возвращает
 Возвращает true, если солнечное освещение учитывается. В противном случае возвращает false.
 Описание
 Свойство IsOn представляет состояние флага учета солнечного освещения.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Sun, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!