Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObject.HasFields
 Послать отзыв
 Свойство предоставляет информацию, есть ли у объекта хотя бы одно поле.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool HasFields;
Копировать Код
Public Property HasFields() As bool
 Возвращает
 Возвращает тип данных bool. Возвращает true, если у объекта есть одно или более полей.
 Описание
 Свойство предоставляет информацию, есть ли у объекта хотя бы одно поле.
 Условия
 Только чтение
 Ссылки
 Teigha.DatabaseServices.DBObject, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!