Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve3dCollection.RemoveAt
 Послать отзыв
 Метод предназначен для удаления из коллекции элемента в позиции с указанным индексом, если он существует.
 Синтаксис
C#
Visual Basic
Копировать Код
public void RemoveAt( int index );
Копировать Код
Public Sub RemoveAt( index As Integer )
 Параметры
 Параметры
 Описание
 index
 Индекс удаляемого элемента. Тип int.
 Описание
 Метод предназначен для удаления из коллекции элемента в позиции с указанным индексом index, если он существует.
 Ссылки
 Teigha.Geometry.Curve3dCollection, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!