Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocArray.IsErased
 Послать отзыв
 Метод проверяет, помечен ли как удаленный указанный элемент ассоциативного массива.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsErased( ItemLocator index );
Копировать Код
Public Function IsErased( index As ItemLocator ) As Boolean
 Параметры
 Параметры
 Описание
 index
 Индекс элемента ассоциативного массива. Тип ItemLocator.
 Возвращает
 Возвращает true, если указанный элемент помечен как удаленный. В противном случае возвращает false.
 Описание
 Метод проверяет, помечен ли как удаленный указанный элемент ассоциативного массива.
 Ссылки
 Teigha.DatabaseServices.AssocArray, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!