Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MTextFragment.StackBottom
 Послать отзыв
 Свойство позволяет проверить, представляет ли данный фрагмент знаменатель дробного текста.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool StackBottom;
Копировать Код
Public ReadOnly Property StackBottom As Boolean
 Возвращает
 Возвращает true, если данный фрагмент представляет знаменатель дробного текста. В противном случае возвращает false.
 Описание
 Свойство позволяет проверить, представляет ли данный фрагмент знаменатель дробного текста.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.MTextFragment, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!