Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotStyleData.LinePatternSize
 Послать отзыв
 Свойство LinePatternSize представляет размер шаблона линии в данном объекте.
 Синтаксис
C#
Visual Basic
Копировать Код
public double LinePatternSize;
Копировать Код
Public Property LinePatternSize As Double
 Возвращает
 Возвращает размер используемого шаблона линии. Тип double.
 Описание
 Свойство LinePatternSize представляет размер шаблона линии в данном объекте.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.PlotStyleData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!