Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.TableStyle.SetTextStyle
 Послать отзыв
 Метод позволяет задать текстовый стиль для строк указанного типа.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetTextStyle( DatabaseServices.ObjectId id, int rowTypes );
Копировать Код
Public Overridable Sub SetTextStyle( id As DatabaseServices.ObjectId, rowTypes As Integer )
 Параметры
 Параметры
 Описание
 id
 Идентификатор объекта текстового стиля. Тип DatabaseServices.ObjectId.
 rowTypes
 Тип строки таблицы (или логическая комбинация нескольких типов). Тип int. См. перечисление RowType.
 Описание
 Метод позволяет задать текстовый стиль для строк указанного типа. Допускаются комбинации различных типов строк с использованием логического оператора OR.
 Ссылки
 Teigha.DatabaseServices.TableStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!