Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Plimmin
 Послать отзыв
 Синтаксис
C#
Visual Basic
public Point2d Plimmin;
Public Property Plimmin() As Point2d
 Описание
 Возвращает или устанавливает текущее значение LIMMIN для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!