Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Point2d.ScaleBy
 Послать отзыв
 Метод позволяет получить двумерную точку, которая является результатом масштабирования данной точки относительно заданного центра с заданным масштабным коэффициентом.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point2d ScaleBy( double scaleFactor, Point2d origin );
Копировать Код
Public Function ScaleBy( scaleFactor As double, origin As Point2d ) As Point2d
 Параметры
 Параметры
 Описание
 scaleFactor
 Входной масштабный множитель. Тип double.
 origin
 Центр масштабирования. Тип Point2d.
 Возвращает
 Возвращает 2D-точку, являющуюся результатом операции масштабирования. Тип Point2d.
 Описание
 Метод позволяет получить двумерную точку, которая является результатом масштабирования данной точки относительно заданного центра с заданным масштабным коэффициентом.
 Ссылки
 Teigha.Geometry.Point2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!