Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Body.Body
 Послать отзыв
 Конструктор по умолчанию класса Body.
 Синтаксис
C#
Visual Basic
Копировать Код
public Body();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса Body.
 Ссылки
 Teigha.DatabaseServices.Body, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!