Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство TextStyleTableRecord.BigFontFileName
 Послать отзыв
 Синтаксис
C#
Visual Basic
public String BigFontFileName;
Public Property BigFontFileName() As String
 Описание
 Обеспечивает доступ к строке имени файла, указывающей на имя файла крупного шрифта для данного текстового стиля.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.TextStyleTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!