Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Database.LoadMlineStyleFile
 Послать отзыв
 Синтаксис
C#
Visual Basic
public void LoadMlineStyleFile(ref String mlineStyleName, ref String fileName);
Public Sub LoadMlineStyleFile(ByRef mlineStyleName As String, ByRef fileName As String)
 Параметры
 Параметры
 Описание
 mlineStyleName
 Строка имени типа линии (не может содержать маску на символы)
 fileName
 Путь/имя файла или URL, откуда должен быть загружен файл (путь не является обязательным)
 Описание
 Эта функция загружает стиль мультилинии, определенный в mlineStyleName из файла, указанного в параметре fileName. Если параметр filename не является URL и не содержит полный путь, то путь к файлу ищется в путях поиска nanoCAD.
 mlineStyleName не может содержать маску на символы имени.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!