Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Sun.Sun
 Послать отзыв
 Конструктор по умолчанию класса Sun.
 Синтаксис
C#
Visual Basic
Копировать Код
public Sun();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса Sun.
 Ссылки
 Teigha.DatabaseServices.Sun, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!