Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AbstractViewPE.IsPlotting
 Послать отзыв
 Свойство IsPlotting позволяет проверить, находится ли связанный видовой экран в состоянии печати.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsPlotting;
Копировать Код
Public ReadOnly Property IsPlotting As Boolean
 Возвращает
 Возвращает true, если видовой экран находится в состоянии печати. В противном случае возвращает false.
 Описание
 Свойство IsPlotting позволяет проверить, находится ли связанный видовой экран в состоянии печати.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.AbstractViewPE, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!