Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LinkedTableData.GetValue
 Послать отзыв
 Метод позволяет получить значение указанного элемента содержимого заданной ячейки таблицы.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual Object GetValue( int row, int column, int content, FormatOption formatOption );
Копировать Код
Public Overridable Function GetValue( row As Integer, column As Integer, content As Integer, formatOption As FormatOption ) As Object
 Параметры
 Параметры
 Описание
 row
 Индекс строки. Тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 column
 Индекс столбца. Тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице.
 content
 Индекс элемента содержимого ячейки. Тип int.
 formatOption
 Уточнение формата, в котором требуется получить значение элемента. Тип FormatOption.
 Возвращает
 Возвращает значение элемента содержимого ячейки. Тип Object.
 Описание
 Метод позволяет получить значение указанного по индексу элемента содержимого заданной ячейки таблицы.
 Ссылки
 Teigha.DatabaseServices.LinkedTableData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!