Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DwgFiler.ReadHardOwnershipId
 Послать отзыв
 Метод предназначен для получения идентификатора жесткой ссылки владения объектом HardOwnershipId из текущего элемента данного объекта Filer.
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract ObjectId ReadHardOwnershipId();
Копировать Код
Public MustOverride Function ReadHardOwnershipId() As ObjectId
 Возвращает
 Возвращает идентификатор жесткой ссылки владения объектом HardOwnershipId. Тип ObjectId.
 Описание
 Метод предназначен для получения идентификатора жесткой ссылки владения объектом HardOwnershipId из текущего элемента данного объекта Filer.
 Ссылки
 Teigha.DatabaseServices.DwgFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!