Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LoftedSurface.NumberOfCrossSections
 Послать отзыв
 Свойство возвращает количество используемых поперечных сечений.
 Синтаксис
C#
Visual Basic
Копировать Код
public int NumberOfCrossSections;
Копировать Код
Public ReadOnly Property NumberOfCrossSections As Integer
 Возвращает
 Возвращает количество поперечных сечений. Тип int.
 Описание
 Свойство возвращает количество используемых поперечных сечений.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.LoftedSurface, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!