Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.NurbSurface
 Послать отзыв
 Класс NurbSurface представляет в базе данных поверхности, для математического описания которых используются неоднородные рациональные B-сплайны (NURBS).
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::GraphicsInterface::Drawable Teigha::DatabaseServices::DBObject Teigha::DatabaseServices::Entity Teigha::DatabaseServices::Surface Teigha::DatabaseServices::NurbSurface
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("AcDbNurbSurface"),TypeDescriptionProvider("Teigha.ComponentModel.TypeDescriptionProvider`1[[Teigha.DatabaseServices.NurbSurface, TD_Mgd]], TD_Mgd")] public class NurbSurface : Surface;
Копировать Код
<Wrapper("AcDbNurbSurface"),TypeDescriptionProvider("Teigha.ComponentModel.TypeDescriptionProvider`1[[Teigha.DatabaseServices.NurbSurface, TD_Mgd]], TD_Mgd")> Public Class NurbSurface Inherits Surface
 Описание
 Класс NurbSurface представляет в базе данных поверхности, для математического описания которых используются неоднородные рациональные B-сплайны (NURBS).
 Методы
 Конструкторы
 Teigha.GraphicsInterface.Drawable
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 Drawable
 Конструктор класса Teigha.GraphicsInterface.Drawable. (Унаследован от Drawable)
 Teigha.DatabaseServices.DBObject
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 DBObject
 Конструктор. (Унаследован от DBObject)
 Teigha.DatabaseServices.Surface
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 Surface
 Конструктор по умолчанию класса Surface. (Унаследован от Surface)
 Teigha.DatabaseServices.NurbSurface
 Имя
 Описание
 NurbSurface
 Это обзор перегрузок NurbSurface.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.GraphicsInterface.Drawable
 Имя
 Описание
 Drawable Методы
 Ниже перечислены методы класса Drawable.
 Drawable Свойства
 Ниже перечислены свойства класса Drawable.
 Teigha.DatabaseServices.DBObject
 Имя
 Описание
 DBObject Методы
 Ниже перечислены методы класса DBObject.
 DBObject Свойства
 Ниже перечислены свойства класса DBObject.
 DBObject События
 Ниже перечислены события класса DBObject.
 Teigha.DatabaseServices.Entity
 Имя
 Описание
 Entity Методы
 Ниже перечислены методы класса Entity.
 Entity Свойства
 Ниже перечислены свойства класса Entity.
 Teigha.DatabaseServices.Surface
 Имя
 Описание
 Surface Методы
 Ниже перечислены методы класса Surface.
 Surface Свойства
 Ниже перечислены свойства класса Surface.
 Teigha.DatabaseServices.NurbSurface
 Имя
 Описание
 NurbSurface Методы
 Ниже перечислены методы класса NurbSurface.
 NurbSurface Свойства
 Ниже перечислены свойства класса NurbSurface.
 Ссылки
 NurbSurface Конструктор, NurbSurface Методы, NurbSurface Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства, DBObject События
 Ваши комментарии по поводу этого топика: Послать отзыв!