Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DataTable.NumColsPhysicalSize
 Послать отзыв
 Свойство предоставляет доступ к количеству столбцов, выделенных для таблицы.
 Синтаксис
C#
Visual Basic
Копировать Код
public int NumColsPhysicalSize;
Копировать Код
Public Property NumColsPhysicalSize() As Integer
 Возвращает
 Возвращает физический размер таблицы в столбцах. Тип int.
 Описание
 Свойство предоставляет доступ к количеству столбцов, выделенных для таблицы.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.DataTable, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!