Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Insbase
 Послать отзыв
 Синтаксис
C#
Visual Basic
public Point3d Insbase;
Public Property Insbase() As Point3d
 Описание
 Возвращает или устанавливает текущее значение INSBASE пространства модели базы данных. Точка задается в WCS координатах.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!