Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SubDMesh.GetNumberOfSubDividedFacesAt
 Послать отзыв
 Получает количество гладких граней для заданных граней базовой сети.
 Синтаксис
C#
Visual Basic
Копировать Код
public int GetNumberOfSubDividedFacesAt( ref FullSubentityPath[] paths );
Копировать Код
Public Function GetNumberOfSubDividedFacesAt( ByRef paths As FullSubentityPath[] ) As Integer
 Параметры
 Параметры
 Описание
 paths
 Массив граней. Тип FullSubentityPath[].
 Возвращает
 Возвращает количество гладких граней.
 Описание
 Метод предназначен для получения количества гладких граней для заданных граней базовой сети.
 Ссылки
 Teigha.DatabaseServices.SubDMesh, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!