Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Viewport.Background
 Послать отзыв
 Свойство Background представляет идентификатор объекта фона в данном видовом экране.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.ObjectId Background;
Копировать Код
Public Property Background As DatabaseServices.ObjectId
 Возвращает
 Возвращает идентификатор объекта фона вида. Тип DatabaseServices.ObjectId.
 Описание
 Свойство Background представляет идентификатор объекта фона в данном видовом экране.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Viewport, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!