Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CellRange.Alignment
 Послать отзыв
 Свойство обеспечивает доступ к настройкам выравнивания в ячейках диапазона.
 Синтаксис
C#
Visual Basic
Копировать Код
public CellAlignment? Alignment;
Копировать Код
Public Property Alignment As CellAlignment?
 Возвращает
 Возвращает значение выравнивания из перечисления Тип CellAlignment.
 Описание
 Свойство обеспечивает доступ к настройкам выравнивания в ячейках диапазона.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.CellRange, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!