Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SubDMesh.GetSubentColor
 Послать отзыв
 Метод предназначен для получения цвета заданного подобъекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public Colors.Color GetSubentColor( SubentityId subentId );
Копировать Код
Public Function GetSubentColor( subentId As SubentityId ) As Colors.Color
 Параметры
 Параметры
 Описание
 subentId
 Идентификатор подобъекта. Тип SubentityId.
 Возвращает
 Возвращает цвет Colors.Color подобъекта.
 Описание
 Метод предназначен для получения цвета заданного подобъекта.
 Ссылки
 Teigha.DatabaseServices.SubDMesh, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!