Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve2d.SetInterval
 Послать отзыв
 Метод позволяет переопределить параметрический интервал данной кривой.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetInterval( ref Interval value );
Копировать Код
Public Sub SetInterval( ByRef value As Interval )
 Параметры
 Параметры
 Описание
 value
 Новый параметрический интервал кривой. Тип Interval.
 Описание
 Метод позволяет переопределить параметрический интервал данной кривой.
 Ссылки
 Teigha.Geometry.Curve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!