Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.AugmentedPolylineCurve3d.D1Vectors
 Послать отзыв
 Свойство D1Vectors предоставляет доступ к коллекции касательных векторов в вершинах полилинии.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3dCollection D1Vectors;
Копировать Код
Public ReadOnly Property D1Vectors As Vector3dCollection
 Возвращает
 Возвращает коллекцию касательных векторов в вершинах полилинии. Тип Vector3dCollection.
 Описание
 Свойство D1Vectors предоставляет доступ к коллекции касательных векторов в вершинах полилинии.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.AugmentedPolylineCurve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!