Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.EllipticalArc2d
 Послать отзыв
 Класс EllipticalArc2d представляет эллиптические дуги и полные эллипсы в двумерном пространстве.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Geometry::Entity2d Teigha::Geometry::Curve2d Teigha::Geometry::EllipticalArc2d
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdGeEllipArc2d")] public sealed class EllipticalArc2d : Curve2d
Копировать Код
<Wrapper("OdGeEllipArc2d")> Public NotInheritable Class EllipticalArc2d Inherits Curve2d
 Описание
 Класс EllipticalArc2d представляет эллиптические дуги и полные эллипсы в двумерном пространстве.
 Замечания
 Угол точки на эллипсе измеряется путем проецирования этой точки перпендикулярно большой оси на окружность, центр которой совпадает с центром эллипса, а радиус равен большому радиусу этого эллипса. Угол между большой осью эллипса и вектором из центра эллипса в спроецированную точку на окружности, измеренный против часовой стрелки, является углом этой точки на эллипсе.
 У полного эллипса разница между начальным и конечным углами составляет 2 x Pi.
 Методы
 Конструкторы
 Teigha.Geometry.EllipticalArc2d
 Имя
 Описание
 EllipticalArc2d
 Это обзор перегрузок EllipticalArc2d.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Geometry.Entity2d
 Имя
 Описание
 Entity2d Методы
 Ниже перечислены методы класса Entity2d.
 Teigha.Geometry.Curve2d
 Имя
 Описание
 Curve2d Методы
 Ниже перечислены методы класса Curve2d.
 Curve2d Свойства
 Ниже перечислены свойства класса Curve2d.
 Teigha.Geometry.EllipticalArc2d
 Имя
 Описание
 EllipticalArc2d Методы
 Ниже перечислены методы класса EllipticalArc2d.
 EllipticalArc2d Свойства
 Ниже перечислены свойства класса EllipticalArc2d.
 Ссылки
 EllipticalArc2d Конструктор, EllipticalArc2d Методы, EllipticalArc2d Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!