Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve3d.IsClosed
 Послать отзыв
 Метод проверяет,является ли данная кривая замкнутой.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsClosed();
Копировать Код
Public Function IsClosed() As Boolean
 Возвращает
 Возвращает true, если начальная и конечная точки кривой совпадают. В противном случае возвращает false.
 Описание
 Метод проверяет,является ли данная кривая замкнутой. Фактически метод проверяет совпадение начальной и конечной точек кривой. Реализация метода вызывает Curve3d.IsClosed(Tolerance tolerance) с допуском, равным Tolerance.Global.
 Ссылки
 Teigha.Geometry.Curve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!