Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObject.SwapReferences(IdMapping)
 Послать отзыв
 Этот метод выполняет преобразование ссылок на идентификаторы объектов, аналогичное тому, как происходит в конце глубокого клонирования. В настоящее время не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SwapReferences(IdMapping idMap);
Копировать Код
Public Sub SwapReferences(idMap As IdMapping)
 Параметры
 Параметры
 Описание
 idMap
 Id отображение ссылок. Тип IdMapping
 Описание
 Действие этого метода подобно преобразованию Id объектов для ссылок, выполняемому при завершении клонирования. В ссылках между объектами в рабочем множестве, в которых есть Id объекта, Id преобразуется в Id заменяющих объектов в ссылочных объектах. Не так как в клонировании, это преобразование производится в обоих направлениях. Таким образом, возможно увидеть два разных Id отображения, передаваемых для различных вызовов метода.
 Например, при замене исходного объекта на некоторый новый, должно быть указано отображение всех других исходных объектов, замещаемых на некоторые новые объекты. Поскольку менеджер транзакций собирается стереть эти исходные объекты, является важным, чтобы отношения между объектами были корректными для таких целей, как отправка уведомлений о стирании объектов.
 Новый объект может иметь или не иметь объект, с которым он меняется. В любом случае, ссылки этого объекта должны быть обновлены с использованием отображения от всех новых объектов к их исходным.
 Поведение по умолчанию этого метода в DBObject заключается в преобразовании Id ссылок объекта с использованием параметра idMap таким же способом, что и преобразование, выполняемое при исполнении операции DeepClone().
 Предупреждение
 Пользовательские объекты, которые переопределяют этот метод, должны обратиться к методу родительского объекта. Отсутствие или сбой такого обращения приведет к ошибке времени выполнения.
 Ссылки
 Teigha.DatabaseServices.DBObject, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!