Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.OsnapPointRef.IsGeomErased
 Послать отзыв
 Метод позволяет проверить, удалена ли геометрия данного объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public override bool IsGeomErased();
Копировать Код
Public Overrides Function IsGeomErased() As Boolean
 Возвращает
 Возвращает true, если геометрия данного объекта удалена. В противном случае возвращает false.
 Описание
 Метод позволяет проверить, удалена ли геометрия данного объекта.
 Ссылки
 Teigha.DatabaseServices.OsnapPointRef, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!