Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Filters.IndexUpdateData
 Послать отзыв
 Этот класс предназначен для сопоставления идентификаторов объектов ObjectId с любыми данными или флагами, специфичными для индекса.
 Иерархия классов
Teigha::DatabaseServices::Filters::IndexUpdateData
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("AcDbIndexUpdateData")] public class IndexUpdateData : DisposableWrapper;
Копировать Код
<Wrapper("AcDbIndexUpdateData")> Public Class IndexUpdateData Inherits DisposableWrapper
 Описание
 Этот класс предназначен для сопоставления идентификаторов объектов ObjectId с любыми данными или флагами, специфичными для индекса. Например, в ходе обновления пространственного индекса можно в этом экземпляре индекса связать идентификаторы ObjectId с ограничивающими боксами этих объектов.
 Основная задача методов get и set этого класса — предоставить приложениям не слишком затратный, но при этом достаточно эффективный метод (с временной сложностью, которая асимптотически оценивается как O(1)) связывания флагов и данных с соответствующими идентификаторами объектов в ходе обновления индекса.
 Экземпляр IndexUpdateData напрямую никогда не создается. Он всегда предоставляется в качестве аргумента.
 Топики
 Имя
 Описание
 IndexUpdateData Методы
 Ниже перечислены методы класса IndexUpdateData.
 Ссылки
 IndexUpdateData Методы, Топики, IndexUpdateData Методы
 Ваши комментарии по поводу этого топика: Послать отзыв!