Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Torus.IsOuterNormal
 Послать отзыв
 Свойство IsOuterNormal позволяет проверить, направлена ли нормаль поверхности замкнутого тора наружу.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsOuterNormal;
Копировать Код
Public ReadOnly Property IsOuterNormal As Boolean
 Возвращает
 Возвращает true, если нормаль поверхности замкнутого тора направлена наружу. В противном случае возвращает false.
 Описание
 Свойство IsOuterNormal позволяет проверить, направлена ли нормаль поверхности замкнутого тора наружу.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.Torus, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!