Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SweepOptionsCheckSweepCurveOut
 Послать отзыв
 Класс SweepOptionsCheckSweepCurveOut представляет опции проверки вытянутых кривых.
 Иерархия классов
Teigha::DatabaseServices::SweepOptionsCheckSweepCurveOut
 Синтаксис
C#
Visual Basic
Копировать Код
public class SweepOptionsCheckSweepCurveOut
Копировать Код
Public Class SweepOptionsCheckSweepCurveOut
 Описание
 Класс SweepOptionsCheckSweepCurveOut представляет опции проверки вытянутых кривых.
 Методы
 Конструкторы
 Имя
 Описание
 SweepOptionsCheckSweepCurveOut
 Конструктор по умолчанию класса SweepOptionsCheckSweepCurveOut.
 Топики
 Имя
 Описание
 SweepOptionsCheckSweepCurveOut Свойства
 Ниже перечислены свойства класса SweepOptionsCheckSweepCurveOut.
 Ссылки
 SweepOptionsCheckSweepCurveOut Свойства, Методы, Топики, SweepOptionsCheckSweepCurveOut Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!