Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector3dCollection.AddRange
 Послать отзыв
 Метод добавляет в коллекцию массив объектов Vector3d.
 Синтаксис
C#
Visual Basic
Копировать Код
public void AddRange( ref Vector3d[] range );
Копировать Код
Public Sub AddRange( ByRef range() As Vector3d )
 Параметры
 Параметры
 Описание
 range
 Входной массив объектов, которые добавляются в данную коллекцию. Тип Vector3d[].
 Описание
 Метод добавляет в коллекцию массив объектов Vector3d.
 Ссылки
 Teigha.Geometry.Vector3dCollection, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!