Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Перечисление Teigha.DatabaseServices.SolutionStatusType
 Послать отзыв
 This is record Teigha::DatabaseServices::SolutionStatusType.
 Синтаксис
C#
Visual Basic
public enum SolutionStatusType { WellDefined = 0, UnderConstrained = 1, OverConstrained = 2, Inconsistent = 3, NotEvaluated = 4, NotAvailable = 5, RejectedByClient = 6 }
Public Enum SolutionStatusType WellDefined = 0 UnderConstrained = 1 OverConstrained = 2 Inconsistent = 3 NotEvaluated = 4 NotAvailable = 5 RejectedByClient = 6 End Enum
 Ваши комментарии по поводу этого топика: Послать отзыв!