Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.RevolveOptionsBuilder.TwistAngle
 Послать отзыв
 Свойство TwistAngle представляет угол закручивания профиля при повороте вокруг оси вращения.
 Синтаксис
C#
Visual Basic
Копировать Код
public double TwistAngle;
Копировать Код
Public Property TwistAngle As Double
 Возвращает
 Возвращает угол закручивания в радианах. Тип double.
 Описание
 Свойство TwistAngle представляет угол закручивания профиля при повороте вокруг оси вращения. Измеряется в радианах. Работает со связанным объектом RevolveOptions.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.RevolveOptionsBuilder, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!