Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Pucsydir
 Послать отзыв
 Синтаксис
C#
Visual Basic
public Vector3d Pucsydir;
Public Property Pucsydir() As Vector3d
 Описание
 Возвращает текущее значение UCSYDIR пространства листа базы данных.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!