Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Mline.MoveVertexAt
 Послать отзыв
 Метод перемещает указанную вершину данного объекта MLine в новое положение, определяемое проекцией указанной 3D-точки на плоскость мультилинии.
 Синтаксис
C#
Visual Basic
Копировать Код
public void MoveVertexAt( int index, Point3d newPosition );
Копировать Код
Public Sub MoveVertexAt( index As Integer, newPosition As Point3d )
 Параметры
 Параметры
 Описание
 index
 Индекс перемещаемой вершины. Тип int.
 newPosition
 Точка в мировой системе координат (WCS), проекция которой на плоскость мультилинии задает новое положение вершины с индексом index. Тип Point3d.
 Описание
 Метод перемещает указанную по индексу вершину данного объекта MLine в новое положение, определяемое проекцией указанной 3D-точки newPosition на плоскость мультилинии. Вершины мультилинии индексируются с нуля.
 Ссылки
 Teigha.DatabaseServices.Mline, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!