Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Point2dCollection.Insert
 Послать отзыв
 Метод вставляет в коллекцию заданный объект Point2d по указанному индексу.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Insert( int index, Point2d p );
Копировать Код
Public Sub Insert( index As Integer, p As Point2d )
 Параметры
 Параметры
 Описание
 index
 Входной индекс вставленного в коллекцию элемента. Тип int.
 p
 Входной объект, вставляемый в коллекцию. Тип Point2d.
 Описание
 Метод вставляет в коллекцию заданный объект Point2d по указанному индексу. Индекс должен иметь допустимое значение.
 Ссылки
 Teigha.Geometry.Point2dCollection, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!