Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LoftOptionsBuilder.ArcLengthParam
 Послать отзыв
 Свойство позволяет проверить, применяется ли параметризация по длине дуги.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool ArcLengthParam;
Копировать Код
Public Property ArcLengthParam As Boolean
 Возвращает
 Возвращает true, если параметризация применяется. В противном случае возвращает false.
 Описание
 Свойство позволяет проверить, применяется ли параметризация по длине дуги.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.LoftOptionsBuilder, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!