Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.BlockTableRecord
 Послать отзыв
 Класс предназначен для хранения определения блока.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::GraphicsInterface::Drawable Teigha::DatabaseServices::DBObject Teigha::DatabaseServices::SymbolTableRecord Teigha::DatabaseServices::BlockTableRecord
 Синтаксис
C#
Visual Basic
[Wrapper("AcDbBlockTableRecord")] public class BlockTableRecord : SymbolTableRecord, System.Collections.IEnumerable;
<Wrapper("AcDbBlockTableRecord")> Public Class BlockTableRecord Inherits SymbolTableRecord Inherits System.Collections.IEnumerable
 Описание
 Класс предназначен для хранения определения блока.
 Определение блока является его неграфической частью и содержит полное описание блока: какие объекты в него входят, какие у них значения свойств, и как они расположены относительно друг друга в данном блоке.
 Класс BlockTableRecord позволяет работать с определениями блоков: создавать, изменять, просматривать значения их свойств.
 Примечания
 Объекты класса BlockTableRecord используются как контейнеры
 для геометрических объектов в файле чертежа базы данных.
 Собственниками объектов BlockTableRecord, является объект BlockTable базы данных. BlockTableRecord являются собственниками геометрических объектов, которые в
 ней содержатся.
 Есть две специальные записи BlockTableRecord, которые содержатся в любой
 базе данных. Это *MODEL_SPACE и *PAPER_SPACE, которые
 представляют пространства модели и пространство листа базы
 данных. Любой геометрический объект, который создан в nanoCAD
 внутри пространства модели, принадлежит и содержится в записи
 \*MODEL_SPACE BlockTableRecord. Геометрические объекты, созданные в
 пространстве листа, содержатся в *PAPER_SPACE.
 BlockTableRecord, которые содержат коллекцию геометрических объектов, на
 которую могут быть ссылки при множественных вставках,
 позволяют сохранить память в чертеже, уменьшить время при
 создании чертежа и гарантируют, что все вставки будут
 отображаться одинаково (за исключением, цвета и
 типа линий).
 Пример
 Ниже приведен пример работы с классом. В примере создается новое определение блока, и далее вставка этого блока добавляется в пространство модели чертежа.
C#
 Копировать Код
public partial class Commands { [Teigha.Runtime.CommandMethod("CreateBlockTableRecord")] public void CreateBlockTableRecord() { // Получаем ссылки на активный документ HostMgd.ApplicationServices.Document doc = HostMgd.ApplicationServices.Application.DocumentManager.MdiActiveDocument; // Получаем ссылки на редактор докумена HostMgd.EditorInput.Editor ed = doc.Editor; // Получаем ссылки на базу данных документа Teigha.DatabaseServices.Database db = doc.Database; // Создаем примитивы для нового блока Teigha.DatabaseServices.Circle crcl = new Teigha.DatabaseServices.Circle(); crcl.Center = new Teigha.Geometry.Point3d(100, 100, 100); crcl.Radius = 100; Teigha.DatabaseServices.Polyline pln = new Teigha.DatabaseServices.Polyline(); pln.AddVertexAt(0, new Teigha.Geometry.Point2d(-10, -10),0,0,0); pln.AddVertexAt(1, new Teigha.Geometry.Point2d(210, 210),0, 0, 0); pln.AddVertexAt(2, new Teigha.Geometry.Point2d(210, -10), 0, 0, 0); pln.AddVertexAt(3, new Teigha.Geometry.Point2d(-10, 210), 0, 0, 0); pln.Closed = true; // Создаем новое определение блока Teigha.DatabaseServices.BlockTableRecord newBlock = new Teigha.DatabaseServices.BlockTableRecord(); newBlock.Name = "NewBlock"; // Добавляем примитивы в блок newBlock.AppendEntity(crcl); newBlock.AppendEntity(pln); // Мы создали определение нового блока. Теперь это определение // нужно добавить в базу данных чертежа, чтобы можно было // добавлять на листы чертежа вставки нового блока // Начало транзакции с базой данных документа using (Teigha.DatabaseServices.Transaction trans = db.TransactionManager.StartTransaction()) { // Открываем таблицу блоков для изменения Teigha.DatabaseServices.BlockTable blockTable = trans.GetObject(db.BlockTableId, Teigha.DatabaseServices.OpenMode.ForWrite) as Teigha.DatabaseServices.BlockTable; // Добавляем новое определение блока в таблицу блоков Teigha.DatabaseServices.ObjectId newBlockId =blockTable.Add(newBlock); // Открываем пространство модели для записи, // чтобы добавить в него вставку блока Teigha.DatabaseServices.BlockTableRecord modelSpace = trans.GetObject(blockTable[Teigha.DatabaseServices.BlockTableRecord.ModelSpace], Teigha.DatabaseServices.OpenMode.ForWrite) as Teigha.DatabaseServices.BlockTableRecord; // Создаем вставку нового определения блока Teigha.DatabaseServices.BlockReference newBR = new Teigha.DatabaseServices.BlockReference(new Teigha.Geometry.Point3d(100,100,0),newBlockId); // Добавляем эту вставку в пространство модели и базу данных чертежа modelSpace.AppendEntity(newBR); trans.AddNewlyCreatedDBObject(newBR,true); // Завершаем транзакцию trans.Commit(); } // После того, как мы добавили новое определение блока в базу данных чертежа // и вставку этого блока в пространство модели, мы можем проверить, // появились ли они там // Открываем транзакцию заново, чтобы проверить, как изменилось // содержимое пространства модели и базы данных using (Teigha.DatabaseServices.Transaction trans = db.TransactionManager.StartTransaction()) { // Открываем таблицу блоков для чтения Teigha.DatabaseServices.BlockTable blockTable = trans.GetObject(db.BlockTableId, Teigha.DatabaseServices.OpenMode.ForRead) as Teigha.DatabaseServices.BlockTable; // Открываем пространство модели для чтения из таблицы блоков // (т.к. пространство модели - тоже блок) Teigha.DatabaseServices.BlockTableRecord modelSpace = trans.GetObject(blockTable[Teigha.DatabaseServices.BlockTableRecord.ModelSpace], Teigha.DatabaseServices.OpenMode.ForRead) as Teigha.DatabaseServices.BlockTableRecord; // Перебираем содержимое пространства модели int i = 0; foreach (var b in modelSpace) i++; ed.WriteMessage($"В пространстве модели сейчас {i} объектов") ; foreach (Teigha.DatabaseServices.ObjectId btrId in modelSpace) { // Открываем для чтения каждый объект, входящий в пространство // модели Teigha.DatabaseServices.DBObject obj = trans.GetObject(btrId, Teigha.DatabaseServices.OpenMode.ForRead); // Выводим Id и тип каждого объекта в командную строку if (obj != null) ed.WriteMessage($"{btrId} {obj.GetType()}"); } // Открываем для чтения созданный нами блок Teigha.DatabaseServices.BlockTableRecord btr = trans.GetObject(blockTable[newBlock.Name],Teigha.DatabaseServices.OpenMode.ForRead) as Teigha.DatabaseServices.BlockTableRecord; // Перебираем все его вставки и выводим в командную // строку служебный блок, в котором находится вставка, // имя и положение каждой вставки ed.WriteMessage($"У блока {newBlock.Name} {btr.GetBlockReferenceIds(true, false).Count} вставок"); foreach (Teigha.DatabaseServices.ObjectId brId in btr.GetBlockReferenceIds(true,false)) { Teigha.DatabaseServices.BlockReference br = trans.GetObject(brId, Teigha.DatabaseServices.OpenMode.ForRead) as Teigha.DatabaseServices.BlockReference; ed.WriteMessage($"{br.BlockName} {br.Name} X:{br.Position.X} Y:{br.Position.Y} Z:{br.Position.Z}"); } // Завершаем транзакцию trans.Abort(); } } }
Visual Basic
 Копировать Код
Partial Public Class Commands <Teigha.Runtime.CommandMethod("CreateBlockTableRecord")> Public Sub CreateBlockTableRecord() ' Получаем ссылки на активный документ Dim doc As HostMgd.ApplicationServices.Document = HostMgd.ApplicationServices.Application.DocumentManager.MdiActiveDocument ' Получаем ссылки на редактор докумена Dim ed As HostMgd.EditorInput.Editor = doc.Editor ' Получаем ссылки на базу данных документа Dim db As Teigha.DatabaseServices.Database = doc.Database ' Создаем примитивы для нового блока Dim crcl As Teigha.DatabaseServices.Circle = New Teigha.DatabaseServices.Circle() crcl.Center = New Teigha.Geometry.Point3d(100, 100, 100) crcl.Radius = 100 Dim pln As Teigha.DatabaseServices.Polyline = New Teigha.DatabaseServices.Polyline() pln.AddVertexAt(0, New Teigha.Geometry.Point2d(-10, -10), 0, 0, 0) pln.AddVertexAt(1, New Teigha.Geometry.Point2d(210, 210), 0, 0, 0) pln.AddVertexAt(2, New Teigha.Geometry.Point2d(210, -10), 0, 0, 0) pln.AddVertexAt(3, New Teigha.Geometry.Point2d(-10, 210), 0, 0, 0) pln.Closed = True ' Создаем новое определение блока Dim newBlock As Teigha.DatabaseServices.BlockTableRecord = New Teigha.DatabaseServices.BlockTableRecord() newBlock.Name = "NewBlock" ' Добавляем примитивы в блок newBlock.AppendEntity(crcl) newBlock.AppendEntity(pln) ' Мы создали определение нового блока. Теперь это определение ' нужно добавить в базу данных чертежа, чтобы можно было ' добавлять на листы чертежа вставки нового блока ' Начало транзакции с базой данных документа Using trans As Teigha.DatabaseServices.Transaction = db.TransactionManager.StartTransaction() ' Открываем таблицу блоков для изменения Dim blockTable As Teigha.DatabaseServices.BlockTable = TryCast(trans.GetObject(db.BlockTableId, Teigha.DatabaseServices.OpenMode.ForWrite), Teigha.DatabaseServices.BlockTable) ' Добавляем новое определение блока в таблицу блоков Dim newBlockId As Teigha.DatabaseServices.ObjectId = blockTable.Add(newBlock) ' Открываем пространство модели для записи, чтобы добавить в него вставку блока Dim modelSpace As Teigha.DatabaseServices.BlockTableRecord = TryCast(trans.GetObject(blockTable(Teigha.DatabaseServices.BlockTableRecord.ModelSpace), Teigha.DatabaseServices.OpenMode.ForWrite), Teigha.DatabaseServices.BlockTableRecord) ' Создаем вставку нового определения блока Dim newBR As Teigha.DatabaseServices.BlockReference = New Teigha.DatabaseServices.BlockReference(New Teigha.Geometry.Point3d(100, 100, 0), newBlockId) ' Добавляем эту вставку в пространство модели и базу данных чертежа modelSpace.AppendEntity(newBR) trans.AddNewlyCreatedDBObject(newBR, True) ' Завершаем транзакцию trans.Commit() End Using ' После того, как мы добавили новое определение блока в базу данных чертежа ' и вставку этого блока в пространство модели, мы можем проверить, ' появились ли они там ' Открываем транзакцию заново, чтобы проверить, как изменилось содержимое ' пространства модели и базы данных Using trans As Teigha.DatabaseServices.Transaction = db.TransactionManager.StartTransaction() ' Открываем таблицу блоков для чтения Dim blockTable As Teigha.DatabaseServices.BlockTable = TryCast(trans.GetObject(db.BlockTableId, Teigha.DatabaseServices.OpenMode.ForRead), Teigha.DatabaseServices.BlockTable) ' Открываем пространство модели для чтения из таблицы блоков ' (т.к. пространство модели - тоже блок) Dim modelSpace As Teigha.DatabaseServices.BlockTableRecord = TryCast(trans.GetObject(blockTable(Teigha.DatabaseServices.BlockTableRecord.ModelSpace), Teigha.DatabaseServices.OpenMode.ForRead), Teigha.DatabaseServices.BlockTableRecord) ' Перебираем содержимое пространства модели Dim i As Integer = 0 For Each b In modelSpace i += 1 Next ed.WriteMessage($"В пространстве модели сейчас {i} объектов") For Each btrId As Teigha.DatabaseServices.ObjectId In modelSpace ' Открываем для чтения каждый объект, входящий в пространство ' модели и выводим в командную строку тип этого объекта Dim obj As Teigha.DatabaseServices.DBObject = trans.GetObject(btrId, Teigha.DatabaseServices.OpenMode.ForRead) ' Выводим Id и тип каждого объекта в командную строку If obj IsNot Nothing Then ed.WriteMessage($"{btrId} {obj.[GetType]()}") Next ' Открываем для чтения созданный нами блок Dim btr As Teigha.DatabaseServices.BlockTableRecord = TryCast(trans.GetObject(blockTable(newBlock.Name), Teigha.DatabaseServices.OpenMode.ForRead), Teigha.DatabaseServices.BlockTableRecord) ed.WriteMessage($"У блока {newBlock.Name} {btr.GetBlockReferenceIds(True, False).Count} вставок") ' Перебираем все его вставки и выводим в командную строку ' служебный блок, в котором находится вставка, имя и положение ' каждой вставки For Each brId As Teigha.DatabaseServices.ObjectId In btr.GetBlockReferenceIds(True, False) Dim br As Teigha.DatabaseServices.BlockReference = TryCast(trans.GetObject(brId, Teigha.DatabaseServices.OpenMode.ForRead), Teigha.DatabaseServices.BlockReference) ed.WriteMessage($"{br.BlockName} {br.Name} X:{br.Position.X} Y:{br.Position.Y} Z:{br.Position.Z}") Next ' Завершаем транзакцию trans.Abort() End Using End Sub End Class
 На рисунке ниже приведен пример того, как отработала команда CreateBlockTableRecord в новом пустом документе, где еще не созданы пользовательские блоки. Соответственно, в командной строке отобразится только созданный командой блок и его вставка в пространстве модели.
 Методы
 Конструкторы
 Teigha.GraphicsInterface.Drawable
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 Drawable
 Конструктор класса Teigha.GraphicsInterface.Drawable. (Унаследован от Drawable)
 Teigha.DatabaseServices.DBObject
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 DBObject
 Конструктор. (Унаследован от DBObject)
 Teigha.DatabaseServices.SymbolTableRecord
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 SymbolTableRecord
 This is SymbolTableRecord, a member of class SymbolTableRecord. (Унаследован от SymbolTableRecord)
 Teigha.DatabaseServices.BlockTableRecord
 Имя
 Описание
 BlockTableRecord
 Это обзор перегрузок BlockTableRecord.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.GraphicsInterface.Drawable
 Имя
 Описание
 Drawable Методы
 Ниже перечислены методы класса Drawable.
 Drawable Свойства
 Ниже перечислены свойства класса Drawable.
 Teigha.DatabaseServices.DBObject
 Имя
 Описание
 DBObject Методы
 Ниже перечислены методы класса DBObject.
 DBObject Свойства
 Ниже перечислены свойства класса DBObject.
 DBObject События
 Ниже перечислены события класса DBObject.
 Teigha.DatabaseServices.SymbolTableRecord
 Имя
 Описание
 SymbolTableRecord Свойства
 Ниже перечислены свойства класса SymbolTableRecord.
 Teigha.DatabaseServices.BlockTableRecord
 Имя
 Описание
 BlockTableRecord Данные
 Ниже перечислены данные класса BlockTableRecord.
 BlockTableRecord Методы
 Ниже перечислены методы класса BlockTableRecord.
 BlockTableRecord Свойства
 Ниже перечислены свойства класса BlockTableRecord.
 BlockTableRecord События
 Ниже перечислены события класса BlockTableRecord.
 Ссылки
 BlockTableRecord Конструктор, BlockTableRecord Данные, BlockTableRecord Методы, BlockTableRecord Свойства, BlockTableRecord События, Методы, Топики, BlockTableRecord Данные, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства, DBObject События
 Ваши комментарии по поводу этого топика: Послать отзыв!