Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FieldEvaluationStatusResult.ErrorCode
 Послать отзыв
 Свойство ErrorCode возвращает код ошибки этого объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public int ErrorCode;
Копировать Код
Public ReadOnly Property ErrorCode As Integer
 Возвращает
 Возвращает код ошибки. Тип int.
 Описание
 Свойство ErrorCode возвращает код ошибки этого объекта.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.FieldEvaluationStatusResult, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!