Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство RasterImageDef.ResolutionMMPerPixel
 Послать отзыв
 Синтаксис
C#
Visual Basic
public Vector2d ResolutionMMPerPixel;
Public Property ResolutionMMPerPixel() As Vector2d
 Описание
 Устанавливает или возвращает физический размер одной точки изображения в миллиметрах. Если изображение не имеет разрешения по умолчанию, то функция возвращает высоту и ширину пикселя, равными 1/(ширину изображения в пикселях).
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.RasterImageDef, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!