Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DxfFiler.WriteEmbeddedObjectStart
 Послать отзыв
 Метод записывает в данный объект Filer строковые данные «встроенного объекта» для группового кода DxfCode.EmbeddedObjectStart.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void WriteEmbeddedObjectStart();
Копировать Код
Public Overridable Sub WriteEmbeddedObjectStart()
 Описание
 Метод записывает в данный объект Filer строковые данные «встроенного объекта» для группового кода DxfCode.EmbeddedObjectStart. Реализация этого метода по умолчанию не делает ничего. Метод должен быть переопределен в производных классах.
 Ссылки
 Teigha.DatabaseServices.DxfFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!