Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObjectReferenceCollection.Contains
 Послать отзыв
 Метод позволяет проверить, содержится ли в данной коллекции элемент, соответствующий указанной объектной ссылке DBObjectReference.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool Contains( DBObjectReference value );
Копировать Код
Public Function Contains( value As DBObjectReference ) As Boolean
 Параметры
 Параметры
 Описание
 value
 Входная объектная ссылка. Тип DBObjectReference.
 Возвращает
 Возвращает true, если в коллекции содержится элемент, соответствующий объектной ссылке value. В противном случае возвращает false.
 Описание
 Метод позволяет проверить, содержится ли в данной коллекции элемент, соответствующий указанной объектной ссылке DBObjectReference.
 Ссылки
 Teigha.DatabaseServices.DBObjectReferenceCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!