Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.IsMergedCell
 Послать отзыв
 Метод позволяет определить, принадлежит ли данная ячейка области объединенных ячеек.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsMergedCell( int row, int col, out CellRange range );
Копировать Код
Public Function IsMergedCell( row As Integer, col As Integer, range As [Out]CellRange ) As Boolean
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 col
 Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
 range
 Диапазон объединенных ячеек. Тип CellRange.
 Возвращает
 Возвращает true, если ячейка входит в указанный диапазон, и false, если нет.
 Описание
 Метод позволяет определить, принадлежит ли данная ячейка области объединенных ячеек. Область объединенных ячеек всегда является прямоугольной.
 Замечания
 Для получения того же результата предпочтительнее использовать Table.Cells[row,column].IsMerged.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!