Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.UnderlayFile
 Послать отзыв
 Класс UnderlayFile реализуется хост-приложениями, которым требуется поддержка подложек.
 Иерархия классов
Teigha::DatabaseServices::UnderlayFile
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdDbUnderlayFile")] public sealed class UnderlayFile : DisposableWrapper
Копировать Код
<Wrapper("OdDbUnderlayFile")> Public NotInheritable Class UnderlayFile Inherits DisposableWrapper
 Описание
 Класс UnderlayFile реализуется хост-приложениями, которым требуется поддержка подложек. Используется объектами UnderlayDefinition и UnderlayReference.
 Топики
 Имя
 Описание
 UnderlayFile Свойства
 Ниже перечислены свойства класса UnderlayFile.
 Ссылки
 UnderlayFile Свойства, Топики, UnderlayFile Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!