Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Dimarcsym
 Послать отзыв
 Синтаксис
C#
Visual Basic
public int Dimarcsym;
Public Property Dimarcsym() As Integer
 Описание
 Устанавливает или возвращает значение отображения обозначения дуги в размере длины дуги.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!