Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Point2dCollection.Point2dCollection
 Послать отзыв
 Конструктор класса Point2dCollection. Создает новую коллекцию с заданной ёмкостью.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point2dCollection( int capacity );
Копировать Код
Public Sub New( capacity As Integer )
 Параметры
 Параметры
 Описание
 capacity
 Входное значение емкости создаваемой коллекции. Тип int.
 Описание
 Конструктор класса Point2dCollection. Создает новую коллекцию с заданной ёмкостью capacity.
 Ссылки
 Teigha.Geometry.Point2dCollection, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!