Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MentalRayRenderSettings.ShadowMapsEnabled
 Послать отзыв
 Свойство ShadowMapsEnabled позволяет определить, следует ли активировать теневые карты.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool ShadowMapsEnabled;
Копировать Код
Public Property ShadowMapsEnabled As Boolean
 Возвращает
 Возвращает true, если использование теневых карт включено. В противном случае возвращает false.
 Описание
 Свойство ShadowMapsEnabled позволяет определить, следует ли активировать теневые карты. Влияет только на источники света, использующие теневые карты.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MentalRayRenderSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!