Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.HostApplicationServices.CompanyName
 Послать отзыв
 Свойство возвращает наименование компании, владеющей приложением.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual String CompanyName;
Копировать Код
Public Overridable ReadOnly Property CompanyName As String
 Возвращает
 Возвращает наименование компании. Тип String.
 Описание
 Свойство возвращает наименование
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.HostApplicationServices, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!