Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.UcsTableRecord.UcsTableRecord
 Послать отзыв
 Конструктор по умолчанию класса UcsTableRecord.
 Синтаксис
C#
Visual Basic
Копировать Код
public UcsTableRecord();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса UcsTableRecord.
 Ссылки
 Teigha.DatabaseServices.UcsTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!