Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FeatureControlFrame.Location
 Послать отзыв
 Свойство Location возвращает точку вставки (WCS) данного объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual Point3d Location;
Копировать Код
Public Overridable Property Location As Point3d
 Возвращает
 Возвращает точку вставки данного объекта. Тип Point3d.
 Описание
 Свойство Location возвращает 3D-точку вставки данного объекта. Точка задается в мировой системе координат WCS.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.FeatureControlFrame, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!