Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DwgFiler.ReadPoint2d
 Послать отзыв
 Метод предназначен для получения точки Point2d из текущего элемента данного объекта Filer.
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract Point2d ReadPoint2d();
Копировать Код
Public MustOverride Function ReadPoint2d() As Point2d
 Возвращает
 Возвращает двумерную точку. Тип Point2d.
 Описание
 Метод предназначен для получения точки Point2d из текущего элемента данного объекта Filer.
 Ссылки
 Teigha.DatabaseServices.DwgFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!