Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector3d.Vector3d
 Послать отзыв
 Конструктор создает вектор, используя в качестве его компонент первые три элемента заданного массива.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d( ref double[] xyz );
Копировать Код
Public Sub New( ByRef xyz As Double() )
 Параметры
 Параметры
 Описание
 xyz
 Входной массив компонент создаваемого вектора. Тип double[].
 Описание
 Конструктор создает новый вектор, используя в качестве его компонент первые три элемента заданного массива xyz.
 Ссылки
 Teigha.Geometry.Vector3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!