Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Extents3d.ExpandBy
 Послать отзыв
 Метод позволяет расширить данный объект Extents3d в направлении и на величину, которые определяются указанным 3D-вектором.
 Синтаксис
C#
Visual Basic
Копировать Код
public void ExpandBy( Vector3d vector );
Копировать Код
Public Sub ExpandBy( vector As Vector3d )
 Параметры
 Параметры
 Описание
 vector
 3D-вектор, определяющий расположение новых точек. Тип Vector3d.
 Описание
 Метод позволяет расширить данный объект Extents3d в направлении и на величину, которые определяются указанным 3D-вектором.
 Ссылки
 Teigha.DatabaseServices.Extents3d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!