Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Filters.FilteredBlockIterator.Seek
 Послать отзыв
 Метод Seek() реализует устаревший метод обобщенного обхода индекса, используемый для поддержки эмуляции устаревшей базы данных.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Seek( ObjectId id );
Копировать Код
Public Sub Seek( id As ObjectId )
 Параметры
 Параметры
 Описание
 id
 Идентификатор искомого объекта. Тип ObjectId.
 Описание
 Метод Seek() реализует устаревший метод обобщенного обхода индекса, используемый для поддержки эмуляции устаревшей базы данных.
 Ссылки
 Teigha.DatabaseServices.Filters.FilteredBlockIterator, Teigha.DatabaseServices.Filters
 Ваши комментарии по поводу этого топика: Послать отзыв!