Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Dimalttd
 Послать отзыв
 Синтаксис
C#
Visual Basic
public int Dimalttd;
Public Property Dimalttd() As Integer
 Описание
 Возвращает или устанавливает текущее значение DIMALTTD для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!