Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.ClipBoundary2dData.!=
 Послать отзыв
 Оператор неравенства структуры ClipBoundary2dData.
 Синтаксис
C#
Visual Basic
Копировать Код
public static bool operator !=( ClipBoundary2dData a, ClipBoundary2dData b );
Копировать Код
Public Shared Operator <>( a As ClipBoundary2dData, b As ClipBoundary2dData ) As Boolean
 Параметры
 Параметры
 Описание
 a
 Левый операнд. Тип ClipBoundary2dData.
 b
 Правый операнд. Тип ClipBoundary2dData.
 Возвращает
 Возвращает true, если не выполняется хотя бы одно из следующих условий:
Совпадают обрезанные вершины;
Совпадают исходные метки обрезанных сегментов;
Совпадают условия обрезки.
 В противном случае возвращает false.
 Описание
 Оператор неравенства структуры ClipBoundary2dData.
 Ссылки
 Teigha.Geometry.ClipBoundary2dData, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!