Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Helix.Constrain
 Послать отзыв
 Свойство предоставляет возможность определить вариант ограничения геометрии спирали - по высоте витка, по количеству витков или по общей высоте.
 Синтаксис
C#
Visual Basic
Копировать Код
public ConstrainType Constrain;
Копировать Код
Public Property Constrain As ConstrainType
 Возвращает
 Возвращает вариант ограничения высоты спирали из перечисления ConstrainType.
 Описание
 Свойство предоставляет возможность определить вариант ограничения высоты спирали - по высоте витка, по количеству витков или по общей высоте.
 Ограничения используются для того, чтобы сделать переменный параметр геометрической модели равным некоторой наперёд заданной величине. Например, если установить ограничение высоты спирали, то изменения любых других ее параметров на высоту спирали уже не влияют.
 При использовании ограничения становится существенным порядок, в котором вы задаёте свойства спирали. Скажем, чтобы ограничить количество витков в спирали, следует задать количество витков ДО указания высоты спирали или высоты витка.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Helix, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!