Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Interval.IsUnbounded
 Послать отзыв
 Свойство IsUnbounded позволяет убедиться, что данный интервал является неограниченным по крайней мере с одной из сторон.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsUnbounded;
Копировать Код
Public ReadOnly Property IsUnbounded As Boolean
 Возвращает
 Возвращает true, если интервал не является ограниченным по крайней мере в одном из двух направлений. В противном случае возвращает false.
 Описание
 Свойство IsUnbounded позволяет убедиться, что данный интервал является неограниченным по крайней мере с одной из сторон.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.Interval, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!