Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.RenderEnvironment.EnvironmentImageFileName
 Послать отзыв
 Свойство EnvironmentImageFileName представляет полное имя файла с изображением окружающей среды.
 Синтаксис
C#
Visual Basic
Копировать Код
public String EnvironmentImageFileName;
Копировать Код
Public Property EnvironmentImageFileName As String
 Возвращает
 Возвращает полное имя файла изображения. Тип String.
 Описание
 Свойство EnvironmentImageFileName представляет полное имя файла (включая путь) с изображением окружающей среды.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.RenderEnvironment, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!