Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbSurfaceDefinition.==
 Послать отзыв
 Оператор равенства структуры NurbSurfaceDefinition.
 Синтаксис
C#
Visual Basic
Копировать Код
public static bool operator ==( NurbSurfaceDefinition a, NurbSurfaceDefinition b );
Копировать Код
Public Shared Operator =( a As NurbSurfaceDefinition, b As NurbSurfaceDefinition ) As Boolean
 Параметры
 Параметры
 Описание
 a
 Левый операнд. Тип NurbSurfaceDefinition.
 b
 Правый операнд. Тип NurbSurfaceDefinition.
 Возвращает
 Возвращает true, если операнды равны друг другу. В противном случае возвращает false.
 Описание
 Оператор равенства структуры NurbSurfaceDefinition.
 Замечания
 Два определения NURBS поверхностей считаются равными, если совместно соблюдаются все перечисленные ниже условия:
У обоих сплайнов совпадают степени как в направлении U, так и в направлении V.
У обоих сплайнов совпадают свойства как в направлении U, так и в направлении V.
У обоих сплайнов совпадает количество управляющих вершин как в направлении U, так и в направлении V.
У обоих сплайнов совпадают управляющие вершины.
Значения весов равны.
У обоих сплайнов совпадают узлы как в направлении U, так и в направлении V.
 Ссылки
 Teigha.Geometry.NurbSurfaceDefinition, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!