Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Spline.GetControlPointAt
 Послать отзыв
 Метод предоставляет управляющую вершину данного объекта Spline по её индексу.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d GetControlPointAt( int index );
Копировать Код
Public Function GetControlPointAt( index As Integer ) As Point3d
 Параметры
 Параметры
 Описание
 index
 Индекс управляющей вершины сплайна. Тип int.
 Возвращает
 Возвращает управляющую вершину сплайна. Тип Point3d.
 Описание
 Метод предоставляет управляющую вершину данного объекта Spline по её индексу.
 Ссылки
 Teigha.DatabaseServices.Spline, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!