Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Layout.BlockTableRecordId
 Послать отзыв
 Получает доступ к ObjectId связанной с листом записи BlockTableRecord.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.ObjectId BlockTableRecordId;
Копировать Код
Public Property BlockTableRecordId() As DatabaseServices.ObjectId
 Возвращает
 Возвращает ObjectId связанной с листом записи BlockTableRecord.
 Описание
 Получает доступ к ObjectId связанной с листом записи BlockTableRecord. Соответствующие методы в BlockTableRecord реализуют прямой указатель на лист.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Layout, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!