Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.AlternateSuffix
 Послать отзыв
 Свойство задает или возвращает альтернативный суффикс размерного текста.
 Синтаксис
C#
Visual Basic
Копировать Код
public String AlternateSuffix;
Копировать Код
Public Property AlternateSuffix As String
 Возвращает
 Возвращает альтернативный суффикс. Тип String.
 Описание
 Свойство задает или возвращает альтернативный суффикс размерного текста. Это свойство оказывает влияние только в том случае, если для свойства Dimalt установлено значение true.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!