Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Filters.LayerIndex
 Послать отзыв
 Этот класс представляет собой реализацию индекса для фильтра слоев.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::GraphicsInterface::Drawable Teigha::DatabaseServices::DBObject Teigha::DatabaseServices::Filters::Index Teigha::DatabaseServices::Filters::LayerIndex
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("AcDbLayerIndex")] public class LayerIndex : Index;
Копировать Код
<Wrapper("AcDbLayerIndex")> Public Class LayerIndex Inherits Index
 Описание
 Этот класс представляет собой реализацию индекса для фильтра слоев.
 Методы
 Конструкторы
 Teigha.GraphicsInterface.Drawable
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 Drawable
 Конструктор класса Teigha.GraphicsInterface.Drawable. (Унаследован от Drawable)
 Teigha.DatabaseServices.DBObject
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 DBObject
 Конструктор. (Унаследован от DBObject)
 Teigha.DatabaseServices.Filters.LayerIndex
 Имя
 Описание
 LayerIndex
 Конструктор класса LayerIndex по умолчанию.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.GraphicsInterface.Drawable
 Имя
 Описание
 Drawable Методы
 Ниже перечислены методы класса Drawable.
 Drawable Свойства
 Ниже перечислены свойства класса Drawable.
 Teigha.DatabaseServices.DBObject
 Имя
 Описание
 DBObject Методы
 Ниже перечислены методы класса DBObject.
 DBObject Свойства
 Ниже перечислены свойства класса DBObject.
 DBObject События
 Ниже перечислены события класса DBObject.
 Teigha.DatabaseServices.Filters.Index
 Имя
 Описание
 Index Методы
 Ниже перечислены методы класса Index.
 Index Свойства
 Ниже перечислены свойства класса Index.
 Teigha.DatabaseServices.Filters.LayerIndex
 Имя
 Описание
 LayerIndex Методы
 Ниже перечислены методы класса LayerIndex.
 Ссылки
 LayerIndex Методы, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства, DBObject События
 Ваши комментарии по поводу этого топика: Послать отзыв!