Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Vertex2d.Vertex2d
 Послать отзыв
 Конструктор класса Vertex2d. Создает экземпляр класса с указанными параметрами.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vertex2d( Point3d position, double bulge, double startWidth, double endWidth, double tangent );
Копировать Код
Public Sub New( position As Point3d, bulge As Double, startWidth As Double, endWidth As Double, tangent As Double )
 Параметры
 Параметры
 Описание
 position
 Координаты вершины в системе координат объекта (OCS). Тип Point3d.
 bulge
 Величина прогиба сегмента полилинии, берущего начало в данной вершине. Тип double.
 startWidth
 Начальная ширина сегмента с началом в данной вершине. Тип double.
 endWidth
 Конечная ширина сегмента с началом в данной вершине. Тип double.
 tangent
 Направление касательной к кривой в данной вершине. Тип double.
 Описание
 Конструктор класса Vertex2d. Создает экземпляр класса с указанными параметрами.
 Ссылки
 Teigha.DatabaseServices.Vertex2d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!