Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.NurbSurface.NumberOfKnotsInV
 Послать отзыв
 Свойство представляет количество узлов данной поверхности в направлении v.
 Синтаксис
C#
Visual Basic
Копировать Код
public int NumberOfKnotsInV;
Копировать Код
Public ReadOnly Property NumberOfKnotsInV As Integer
 Возвращает
 Возвращает количество узлов поверхности в заданном направлении. Тип int.
 Описание
 Свойство представляет количество узлов данной поверхности в направлении v.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.NurbSurface, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!