Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeaderStyle.BlockConnectionType
 Послать отзыв
 Свойство представляет предусмотренный данным стилем вариант соединения блока с линиями выноски.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.BlockConnectionType BlockConnectionType;
Копировать Код
Public Property BlockConnectionType As DatabaseServices.BlockConnectionType
 Возвращает
 Возвращает вариант соединения блока с линиями выноски. Перечисление DatabaseServices.BlockConnectionType.
 Описание
 Свойство представляет предусмотренный данным стилем вариант соединения блока с линиями выноски.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MLeaderStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!