Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FormattedTableData.SetTextHeight
 Послать отзыв
 Метод позволяет задать высоту текста в ячейке.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetTextHeight( int row, int column, double value );
Копировать Код
Public Overridable Sub SetTextHeight( row As Integer, column As Integer, value As Double )
 Параметры
 Параметры
 Описание
 row
 Индекс строки. Тип int. Должен быть неотрицательным и меньше количества строк в таблице.
 column
 Индекс столбца. Тип int. Должен быть неотрицательным и меньше количества столбцов в таблице.
 value
 Новая высота текста. Тип double.
 Описание
 Метод позволяет задать высоту текста в ячейке.
 Ссылки
 Teigha.DatabaseServices.FormattedTableData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!