Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DynamicDimensionData.Create
 Послать отзыв
 Метод позволяет создать новый объект DynamicDimensionData на основе переданного в метод указателя.
 Синтаксис
C#
Visual Basic
Копировать Код
public static DynamicDimensionData Create( IntPtr unmanagedPointer, bool autoDelete );
Копировать Код
Public Shared Function Create( unmanagedPointer As IntPtr, autoDelete As Boolean ) As DynamicDimensionData
 Параметры
 Параметры
 Описание
 unmanagedPointer
 Неуправляемый указатель на исходный объект. Тип IntPtr.
 autoDelete
 Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.
 Возвращает
 Возвращает новый экземпляр класса DynamicDimensionData.
 Описание
 Метод позволяет создать новый объект DynamicDimensionData на основе переданного в метод указателя.
 Ссылки
 Teigha.DatabaseServices.DynamicDimensionData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!