Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Group.InsertAt
 Послать отзыв
 Метод позволяет вставить указанный объект чертежа в данную группу по указанному индексу.
 Синтаксис
C#
Visual Basic
Копировать Код
public void InsertAt( int index, DatabaseServices.ObjectId id );
Копировать Код
Public Sub InsertAt( index As Integer, id As DatabaseServices.ObjectId )
 Параметры
 Параметры
 Описание
 index
 Индекс, по которому следует вставить в группу новый объект чертежа. Тип int.
 id
 Идентификатор вставляемого объекта. Тип DatabaseServices.ObjectId.
 Описание
 Метод позволяет вставить указанный объект чертежа в данную группу по указанному индексу.
 Ссылки
 Teigha.DatabaseServices.Group, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!