Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Point3AngularDimension.ArcPoint
 Послать отзыв
 Свойство ArcPoint предоставляет доступ к трехмерным координатам (WCS) точки, располагающейся на дуге данного размера.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d ArcPoint;
Копировать Код
Public Property ArcPoint As Point3d
 Возвращает
 Возвращает точку на размерной дуге в мировой системе координат (WCS). Тип Point3d.
 Описание
 Свойство ArcPoint предоставляет доступ к трехмерным координатам (WCS) точки, располагающейся на дуге данного размера.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Point3AngularDimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!