Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CellContentsCollection.Clear
 Послать отзыв
 Метод очищает данную коллекцию, удаляя из нее все элементы.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Clear();
Копировать Код
Public Sub Clear()
 Описание
 Метод очищает данную коллекцию, удаляя из нее все элементы. После завершения метода свойство Count коллекции возвращает значение 0.
 Ссылки
 Teigha.DatabaseServices.CellContentsCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!