Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Helix.AxisVector
 Послать отзыв
 Свойство обеспечивает доступ к направляющему вектору оси спирали.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d AxisVector;
Копировать Код
Public Property AxisVector As Vector3d
 Возвращает
 Возвращает направляющий вектор оси спирали. Тип Vector3d.
 Описание
 Свойство обеспечивает доступ к направляющему вектору оси спирали. Этот вектор всегда перпендикулярен линии, соединяющей начальную точку спирали и точку начала оси.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Helix, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!