Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Событие Database.XrefBeginOtherAttached
 Послать отзыв
 Синтаксис
C#
Visual Basic
public event XrefBeginOperationEventHandler XrefBeginOtherAttached;
Public Event XrefBeginOtherAttached As XrefBeginOperationEventHandler
 Описание
 Событие посылается сразу после события beginDeepCloneTranslation, но происходит только для процесса присоединения внешней ссылки.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!