Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.BeginInsertEventArgs.From
 Послать отзыв
 Свойство обеспечивает доступ к вставляемой базе данных.
 Синтаксис
C#
Visual Basic
Копировать Код
public Database From;
Копировать Код
Public Property From() As Database
 Возвращает
 Возвращает вставляемую базу данных. Тип Database.
 Описание
 Свойство обеспечивает доступ к вставляемой базе данных.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.BeginInsertEventArgs, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!