Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CompositeParameter
 Послать отзыв
 Структура CompositeParameter представляет данные, которые определяют параметр точки на составной кривой.
 Иерархия классов
Teigha::Geometry::CompositeParameter
 Синтаксис
C#
Visual Basic
Копировать Код
public struct CompositeParameter
Копировать Код
Public Structure CompositeParameter
 Описание
 Структура CompositeParameter представляет данные, которые определяют параметр точки на составной кривой. Эти данные включают значения параметра точки и индекса подкривой, которой принадлежит точка.
 Методы
 Конструкторы
 Имя
 Описание
 CompositeParameter
 Конструктор структуры CompositeParameter. Создает экземпляр структуры с переданным индексом подкривой и значением локального параметра.
 Топики
 Имя
 Описание
 CompositeParameter Методы
 Ниже перечислены методы класса CompositeParameter.
 CompositeParameter Операторы
 Ниже перечислены операторы класса CompositeParameter.
 CompositeParameter Свойства
 Ниже перечислены свойства класса CompositeParameter.
 Ссылки
 CompositeParameter Методы, CompositeParameter Операторы, CompositeParameter Свойства, Методы, Топики, CompositeParameter Методы, CompositeParameter Операторы, CompositeParameter Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!