Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.TextHorizontalMode
 Послать отзыв
 Перечисление TextHorizontalMode определяет типы горизонтального выравнивания текста.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum TextHorizontalMode { TextLeft = 0, TextCenter = 1, TextRight = 2, TextAlign = 3, TextMid = 4, TextFit = 5 }
Копировать Код
Public Enum TextHorizontalMode TextLeft = 0 TextCenter = 1 TextRight = 2 TextAlign = 3 TextMid = 4 TextFit = 5 End Enum
 Члены
 Члены
 Описание
 TextLeft
 Значение: 0. Текст выравнивается по левому краю относительно заданной точки вставки.
 TextCenter
 Значение: 1. Текст центрируется по горизонтали относительно заданной точки вставки.
 TextRight
 Значение: 2. Текст выравнивается по правому краю относительно заданной точки вставки.
 TextAlign
 Значение: 3. Текст вписывается в заданную ширину аналогично функции "по ширине" в текстовых редакторах (justify). Заполнение текстом заданной полосы (по ширине) осуществляется регулированием исключительно интервалов между словами. Межбуквенные интервалы, сами буквы и высота текста остаются неизменными.
 TextMid
 Значение: 4. Текст центрируется по горизонтали относительно заданной точки вставки. Часто используется в сочетании с настройками вертикального выравнивания для точного позиционирования текста в пределах фигур или объектов (см. перечисление Teigha.DatabaseServices.TextVerticalMode).
 TextFit
 Значение: 5. Текст вписывается в заданную ширину за счет равномерного растяжения всех символов текста, включая пробелы, межбуквенные интервалы и сами буквы. Высота текста остается без изменения.
 Описание
 Перечисление TextHorizontalMode определяет поддерживаемые типы горизонтального выравнивания текста.
 Ваши комментарии по поводу этого топика: Послать отзыв!