Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CircularArc3d.Center
 Послать отзыв
 Свойство Center предоставляет доступ к точке центра дуги.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d Center;
Копировать Код
Public Property Center As Point3d
 Возвращает
 Возвращает точку центра дуги. Тип Point3d.
 Описание
 Свойство Center предоставляет доступ к точке центра дуги.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.Geometry.CircularArc3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!