Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Curve.GetSplitCurves
 Послать отзыв
 Метод создает один или несколько объектов, которые являются подкривыми исходной кривой. Коллекция должна содержать координаты точек на кривой, которые используются в качестве начальных или конечных точек вновь созданных подкривых.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual DBObjectCollection GetSplitCurves( ref DoubleCollection value );
Копировать Код
Public virtual Function GetSplitCurves( ByRef value As DoubleCollection ) As DBObjectCollection
 Параметры
 Параметры
 Описание
 value
 Коллекция типа DoubleCollection с координатами точек на кривой (в мировой системе координат WCS).
 Возвращает
 Метод возвращает экземпляр класса DoubleCollection.
 Описание
 Этот метод создает один или несколько объектов, которые являются подкривыми исходной кривой. Коллекция должна содержать координаты точек на кривой, которые используются в качестве начальных или конечных точек вновь созданных подкривых.
 Ссылки
 Teigha.DatabaseServices.Curve, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!