Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LoftOptionsCheckCurvesOut.AllClosed
 Послать отзыв
 Свойство позволяет проверить, все ли поперечные сечения являются замкнутыми.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool AllClosed;
Копировать Код
Public ReadOnly Property AllClosed As Boolean
 Возвращает
 Возвращает true, если все поперечные сечения являются замкнутыми. В противном случае возвращает false.
 Описание
 Свойство позволяет проверить, все ли поперечные сечения являются замкнутыми.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.LoftOptionsCheckCurvesOut, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!