Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.OpenModeAttribute.OpenModeAttribute
 Послать отзыв
 Конструктор класса OpenModeAttribute.
 Синтаксис
C#
Visual Basic
Копировать Код
public OpenModeAttribute( DatabaseServices.OpenMode mode );
Копировать Код
Public Sub New( mode As DatabaseServices.OpenMode )
 Параметры
 Параметры
 Описание
 mode
 Режим открытия объекта. Значение из перечисления DatabaseServices.OpenMode.
 Описание
 Конструктор класса OpenModeAttribute. Создает новый экземпляр данного класса с указанным режимом доступа к объекту.
 Ссылки
 Teigha.DatabaseServices.OpenModeAttribute, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!