Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DxfFiler.ReadResultBuffer
 Послать отзыв
 Метод считывает следующий элемент этого объекта Filer и возвращает буфер результатов.
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract ResultBuffer ReadResultBuffer();
Копировать Код
Public MustOverride Function ReadResultBuffer() As ResultBuffer
 Возвращает
 Возвращает буфер результатов. Тип ResultBuffer.
 Описание
 Метод считывает следующий элемент этого объекта Filer и возвращает буфер результатов.
 Ссылки
 Teigha.DatabaseServices.DxfFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!