Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SubentityOverrule.GetGsMarkersAtSubentPath
 Послать отзыв
 Данный метод переопределяет метод Entity.GetGraphicsMarkersAtSubentityPathIntPtr() и вызывает его в случае реализации по умолчанию.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual IntPtr[] GetGsMarkersAtSubentPath( ref Entity entity, FullSubentityPath subPath );
Копировать Код
Public virtual Function GetGsMarkersAtSubentPath( ByRef entity As Entity, subPath As FullSubentityPath ) As IntPtr()
 Параметры
 Параметры
 Описание
 entity
 Объект чертежа, тип Entity.
 subPath
 Полный путь к подобъекту. Тип FullSubentityPath.
 Возвращает
 Возвращает массив с GSMarkers для подобъектов. Тип IntPtr[].
 Описание
 Данный метод переопределяет метод Entity.GetGraphicsMarkersAtSubentityPathIntPtr() и вызывает его в случае реализации по умолчанию. Метод Entity.GetGraphicsMarkersAtSubentityPathIntPtr() в реализации по умолчанию возвращает массив GS маркеров указанного подобъекта. Метод GetGsMarkersAtSubentPath() настоящего класса позволяет переопределить механизм работы этого метода.
 Ссылки
 Teigha.DatabaseServices.SubentityOverrule, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!