Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CellRange.IsNull
 Послать отзыв
 Свойство позволяет проверить, является ли нулевым объект диапазона ячеек.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsNull;
Копировать Код
Public ReadOnly Property IsNull As Boolean
 Возвращает
 Возвращает true, если объект диапазона ячеек является нулевым. В противном случае возвращает false.
 Описание
 Свойство позволяет проверить, является ли нулевым объект диапазона ячеек.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.CellRange, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!