Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Handle.ToString
 Послать отзыв
 Возвращает эквивалентное строковое представление данного объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public String ToString();
Копировать Код
Public Function ToString() As String
 Возвращает
 Возвращает эквивалентное строковое представление данного объекта, тип String.
 Описание
 Возвращает эквивалентное строковое представление данного объекта. Подробнее см. в документации Microsoft по .NET API.
 Ссылки
 Teigha.DatabaseServices.Handle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!