Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.PolylineCurve2d.PolylineCurve2d
 Послать отзыв
 Конструктор по умолчанию класса PolylineCurve2d. Создает новый объект без каких-либо реальных данных.
 Синтаксис
C#
Visual Basic
Копировать Код
public PolylineCurve2d();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса PolylineCurve2d. Создает новый объект без каких-либо реальных данных.
 Ссылки
 Teigha.Geometry.PolylineCurve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!