Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObject.Erase()
 Послать отзыв
 Метод помечает этот объект, как удалённый, но не удаляет из базы данных.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Erase();
Копировать Код
Public Sub Erase()
 Описание
 Метод устанавливает признак удаления объекта.
 Замечания
 Удалённые объекты не удаляются из базы данных или из памяти. Удалённые объекты не сохраняются при сохранении базы данных или отправке в файл формата DXF.
 Ссылки
 Teigha.DatabaseServices.DBObject, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!