Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Событие Database.BeginDxfOut
 Послать отзыв
 Синтаксис
C#
Visual Basic
public event EventHandler BeginDxfOut;
Public Event BeginDxfOut As EventHandler
 Описание
 Событие показывает, что база данных чертежа начинает выполнять операцию записи в DXF файл.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!