Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.TextHeight
 Послать отзыв
 Метод предназначен для получения высоты текста в строках заданного типа.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual double TextHeight( DatabaseServices.RowType type );
Копировать Код
Public virtual Function TextHeight( type As DatabaseServices.RowType ) As double
 Параметры
 Параметры
 Описание
 type
 Тип строки из перечисления RowType.
 Возвращает
 Возвращает высоту текста, double.
 Описание
 Метод предназначен для получения высоты текста в строках заданного типа.
 Возможные значения типа строки задаются перечислением RowType (DataRow, TitleRow и HeaderRow). Если тип строки не указан, используется значение по умолчанию DataRow.
 Замечания
 Для получения того же результата предпочтительнее использовать функционал объекта Cell.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!