Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CellRange.Equals
 Послать отзыв
 Метод позволяет проверить на равенство два диапазона ячеек.
 Синтаксис
C#
Visual Basic
Копировать Код
public override bool Equals( ref Object pRange );
Копировать Код
Public Overrides Function Equals( ByRef pRange As Object ) As Boolean
 Параметры
 Параметры
 Описание
 pRange
 Диапазон, который проверяется на равенство данному объекту. Тип Object.
 Возвращает
 Возвращает true, если диапазоны равны. В противном случае возвращает false.
 Описание
 Метод позволяет проверить на равенство два диапазона ячеек.
 Замечания
 Переопределение методов Equals и GetHashCode должно выполняться совместно, чтобы не нарушать логику - если Equals возвращает true, хеш-коды сравниваемых объектов должны совпадать. Обратное не гарантируется - совпадение хеш-кодов не всегда означает совпадение объектов вследствие возможных коллизий. Хеш-коды следует формировать для полей, на которых основано равенство. Иногда используется метод Equals() из объекта C++, но поскольку сравниваются указатели, вы по-прежнему можете использовать этот GetHashCode(), в то время как метод Equals() может быть переопределен в производном классе.
 Ссылки
 Teigha.DatabaseServices.CellRange, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!