Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Graph.GetOutgoing
 Послать отзыв
 Метод позволяет получить коллекцию всех исходящих узлов данного графа.
 Синтаксис
C#
Visual Basic
Копировать Код
public GraphNodeCollection GetOutgoing();
Копировать Код
Public Function GetOutgoing() As GraphNodeCollection
 Возвращает
 Возвращает коллекцию исходящих узлов данного графа. Тип GraphNodeCollection.
 Описание
 Метод позволяет получить коллекцию всех исходящих узлов данного графа. Каждый узел встречается в коллекции только один раз.
 Ссылки
 Teigha.DatabaseServices.Graph, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!