Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.HorizontalCellMargin
 Послать отзыв
 Данное свойство представляет размер горизонтальных полей ячейки объекта Table.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual double HorizontalCellMargin;
Копировать Код
Public virtual Property HorizontalCellMargin() As double
 Возвращает
 Возвращает ширину горизонтальных полей ячейки, тип double.
 Описание
 Свойство предоставляет доступ к ширине горизонтальных полей ячейки данного объекта Table.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!