Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DxfFiler.IsModifyingExistingObject
 Послать отзыв
 Свойство позволяет определить, используется ли данный DxfFiler для изменения существующего объекта. Не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual bool IsModifyingExistingObject;
Копировать Код
Public Overridable ReadOnly Property IsModifyingExistingObject As Boolean
 Возвращает
 Возвращает true, если данный DxfFiler используется в операции изменения существующего объекта. В противном случае возвращает false.
 Описание
 Свойство позволяет определить, используется ли данный DxfFiler для изменения существующего объекта. Не реализовано.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.DxfFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!