Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Перечисление Teigha.DatabaseServices.AssocEvaluationMode
 Послать отзыв
 This is record Teigha::DatabaseServices::AssocEvaluationMode.
 Синтаксис
C#
Visual Basic
[Wrapper("AcDbAssocEvaluationMode")] public enum AssocEvaluationMode { ModifyObjectsAssocEvaluationMode = kModifyObjectsAssocEvaluationMode, ModifyActionAssocEvaluationMode = kModifyActionAssocEvaluationMode }
<Wrapper("AcDbAssocEvaluationMode")> Public Enum AssocEvaluationMode ModifyObjectsAssocEvaluationMode = kModifyObjectsAssocEvaluationMode ModifyActionAssocEvaluationMode = kModifyActionAssocEvaluationMode End Enum
 Ваши комментарии по поводу этого топика: Послать отзыв!