Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.GetGridDoubleLineSpacing
 Послать отзыв
 Метод позволяет получить величину просвета между двойными линиями сетки ячейки, строки или столбца.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual double GetGridDoubleLineSpacing( int row, int column, GridLineType gridLineType );
Копировать Код
Public virtual Function GetGridDoubleLineSpacing( row As Integer, column As Integer, gridLineType As GridLineType ) As double
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс может равняться -1.
 gridLineType
 Тип линий сетки из перечисления GridLineType.
 col
 Индекс столбца, тип int. Индекс может равняться -1.
 Возвращает
 Возвращает значение просвета между двойными линиями сетки, тип double.
 Описание
 Метод позволяет получить величину просвета между двойными линиями сетки ячейки, строки или столбца.
 Чтобы указать ячейку, следует задать допустимые индексы строки и столбца. Чтобы указать строку, следует задать допустимый индекс строки и -1 в качестве индекса столбца. Чтобы указать столбец, следует задать допустимый индекс столбца и -1 в качестве индекса строки. Можно передать в метод комбинацию типов линий, объединив их с помощью оператора OR.
 Замечания
 Для получения того же результата предпочтительнее использовать Table.Cells[row,column].{Top,Bottom,Left,Right}Edge.DoubleLineSpacing.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!