Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SecurityParameters.SecurityParameters
 Послать отзыв
 Конструктор класса SecurityParameters. Создает экземпляр класса с указанными параметрами.
 Синтаксис
C#
Visual Basic
Копировать Код
public SecurityParameters( ref String password, ref String providerName, ref String subject, ref String issuer, ref String serialNumber, ref String comment, ref String timeServer, SecurityActions actions, SecurityAlgorithm algorithm, unsigned int keyLength, unsigned int providerType );
Копировать Код
Public Sub New( ByRef password As String, ByRef providerName As String, ByRef subject As String, ByRef issuer As String, ByRef serialNumber As String, ByRef comment As String, ByRef timeServer As String, actions As SecurityActions, algorithm As SecurityAlgorithm, keyLength As unsigned int, providerType As unsigned int )
 Параметры
 Параметры
 Описание
 password
 Строка с паролем. Тип String.
 providerName
 Имя провайдера криптографии. Тип String.
 subject
 Имя субъекта сертификата (цифрового ID). Тип String.
 issuer
 Имя эмитента сертификата (цифрового ID). Тип String.
 serialNumber
 Серийный номер сертификата (цифрового ID). Тип String.
 comment
 Дополнительный комментарий, предоставляемый с подписью. Тип String.
 timeServer
 Имя сервера времени, используемого для установления временных меток. Тип String.
 actions
 Выполняемые действия. Перечисление SecurityActions.
 algorithm
 Алгоритм шифрования. В текущей версии поддерживается только алгоритм шифрования SecurityAlgorithm.RC4. Перечисление SecurityAlgorithm.
 keyLength
 Длина ключа. Тип unsigned int. Значение зависит от параметра providerName.
 providerType
 Тип провайдера шифрования. Тип unsigned int.
 Описание
 Конструктор класса SecurityParameters. Создает экземпляр класса с указанными параметрами.
 Ссылки
 Teigha.DatabaseServices.SecurityParameters, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!