Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Line2dCollection.Line2dCollection
 Послать отзыв
 Конструктор по умолчанию класса Line2dCollection. Создает пустую коллекцию 2D-линий.
 Синтаксис
C#
Visual Basic
Копировать Код
public Line2dCollection();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса Line2dCollection. Создает пустую коллекцию 2D-линий.
 Ссылки
 Teigha.Geometry.Line2dCollection, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!