Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DynamicBlockReferencePropertyCollectionEnumerator.Current
 Послать отзыв
 Свойство Current возвращает объект коллекции свойств динамического блока, на который указывает указатель.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual object Current;
Копировать Код
Public Overridable ReadOnly Property Current As Object
 Возвращает
 Возвращает текущий объект коллекции. Тип Object.
 Описание
 Свойство Current возвращает объект коллекции свойств динамического блока, на который указывает указатель.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.DynamicBlockReferencePropertyCollectionEnumerator, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!