Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AnnotationScale.Scale
 Послать отзыв
 Свойство предоставляет значение масштаба аннотаций.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Scale;
Копировать Код
Public Property Scale() As Double
 Возвращает
 Возвращает значение масштаба аннотаций. Тип double.
 Описание
 Свойство предоставляет значение масштаба аннотаций.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.AnnotationScale, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!