Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство OrdinateDimension.UsingXAxis
 Послать отзыв
 This is UsingXAxis, a member of class OrdinateDimension.
 Синтаксис
C#
Visual Basic
public bool UsingXAxis;
Public Property UsingXAxis() As bool
 Ссылки
 OrdinateDimension Класс, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!