Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.NurbsData.Closed
 Послать отзыв
 Свойство позволяет убедиться, что сплайн является замкнутым.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool Closed;
Копировать Код
Public ReadOnly Property Closed As Boolean
 Возвращает
 Возвращает true, если сплайн является замкнутым. В противном случае возвращает false.
 Описание
 Свойство позволяет проверить, что сплайн является замкнутым. Замкнутый сплайн строится путем замыкания исходного сплайна между первой и последней точками гладким сплайном.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.NurbsData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!