Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CurveBoundary.CurveBoundary
 Послать отзыв
 Конструктор по умолчанию класса CurveBoundary.
 Синтаксис
C#
Visual Basic
Копировать Код
public CurveBoundary();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса CurveBoundary.
 Ссылки
 Teigha.Geometry.CurveBoundary, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!