Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PolygonMesh.MakeMClosed
 Послать отзыв
 Метод реализует замыкание сети PolygonMesh в направлении M.
 Синтаксис
C#
Visual Basic
Копировать Код
public void MakeMClosed();
Копировать Код
Public Sub MakeMClosed()
 Описание
 Метод реализует замыкание сети PolygonMesh в направлении M. Это означает, что сеть будет рассматриваться как непрерывная при переходе от последней строки к первой.
 Ссылки
 Teigha.DatabaseServices.PolygonMesh, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!