Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DynamicDimensionChangedEventArgs.DynamicDimensionChangedEventArgs
 Послать отзыв
 Этот конструктор создает новый объект класса с указанными индексом и значением.
 Синтаксис
C#
Visual Basic
Копировать Код
public DynamicDimensionChangedEventArgs( int index, double value );
Копировать Код
Public Sub New( index As Integer, value As Double )
 Параметры
 Параметры
 Описание
 index
 Индекс размера. Тип int.
 value
 Значение размера. Тип double.
 Описание
 Этот конструктор создает новый объект класса с указанными индексом и значением.
 Ссылки
 Teigha.DatabaseServices.DynamicDimensionChangedEventArgs, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!