Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.RenderSettings.BackFacesEnabled
 Послать отзыв
 Свойство BackFacesEnabled позволяет определить, включен ли рендеринг задних граней.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool BackFacesEnabled;
Копировать Код
Public Property BackFacesEnabled As Boolean
 Возвращает
 Возвращает true, если рендеринг задних граней выполняется. В противном случае возвращает false.
 Описание
 Свойство BackFacesEnabled позволяет определить, включен ли рендеринг задних граней.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.RenderSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!