Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotSettingsValidator.SetPlotConfigurationName
 Послать отзыв
 Метод задает имена устройства печати и носителя для указанного объекта PlotSettings.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetPlotConfigurationName( ref PlotSettings plotSet, ref String plotDeviceName, ref String mediaName );
Копировать Код
Public Sub SetPlotConfigurationName( ByRef plotSet As PlotSettings, ByRef plotDeviceName As String, ByRef mediaName As String )
 Параметры
 Параметры
 Описание
 plotSet
 Входной объект PlotSettings с настройками печати.
 plotDeviceName
 Имя системного принтера или файла PC3 с настройками устройств печати. Тип String.
 mediaName
 Наименование бумажного носителя. Тип String.
 Описание
 Метод задает имена устройства печати и носителя для указанного объекта PlotSettings.
 Параметр plotDeviceName может иметь значение none_device, только если параметр mediaName имеет значение none_user_media.
 Ссылки
 Teigha.DatabaseServices.PlotSettingsValidator, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!