Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.Dimclre
 Послать отзыв
 Свойство определяет цвет выносных линий.
 Синтаксис
C#
Visual Basic
Копировать Код
public Colors.Color Dimclre;
Копировать Код
Public Property Dimclre As Colors.Color
 Возвращает
 Возвращает цвет линий. Тип Colors.Color
 Описание
 Свойство определяет цвет выносных линий.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!