Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DataCell.SetBool
 Послать отзыв
 Метод устанавливает для этой ячейки логическое значение.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetBool( bool value );
Копировать Код
Public Sub SetBool( value As Boolean )
 Параметры
 Параметры
 Описание
 value
 Входное значение для ячейки. Тип bool.
 Описание
 Метод устанавливает для этой ячейки логическое значение, заданное входным аргументом value.
 Ссылки
 Teigha.DatabaseServices.DataCell, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!