Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DynamicDimensionChangedEventArgs
 Послать отзыв
 Этот класс предоставляет данные для функции OnDimensionValueChanged класса Jig.
 Иерархия классов
Teigha::DatabaseServices::DynamicDimensionChangedEventArgs
 Синтаксис
C#
Visual Basic
Копировать Код
public class DynamicDimensionChangedEventArgs;
Копировать Код
Public Class DynamicDimensionChangedEventArgs
 Описание
 Этот класс предоставляет данные для функции OnDimensionValueChanged класса Jig.
 Методы
 Конструкторы
 Имя
 Описание
 DynamicDimensionChangedEventArgs
 Этот конструктор создает новый объект класса с указанными индексом и значением.
 Топики
 Имя
 Описание
 DynamicDimensionChangedEventArgs Свойства
 Ниже перечислены свойства класса DynamicDimensionChangedEventArgs.
 Ссылки
 DynamicDimensionChangedEventArgs Свойства, Методы, Топики, DynamicDimensionChangedEventArgs Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!