Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MText.Attachment
 Послать отзыв
 Свойство представляет тип точки присоединения этого объекта MText.
 Синтаксис
C#
Visual Basic
Копировать Код
public AttachmentPoint Attachment;
Копировать Код
Public Property Attachment As AttachmentPoint
 Возвращает
 Возвращает тип точки присоединения. Перечисление AttachmentPoint.
 Описание
 Свойство представляет тип точки присоединения этого объекта MText.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MText, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!