Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LinkedTableData.SetValue
 Послать отзыв
 Метод позволяет задать значение указанному элементу содержимого заданной ячейки таблицы.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetValue( int row, int column, int content, ref Object value, ParseOption parseOption );
Копировать Код
Public Overridable Sub SetValue( row As Integer, column As Integer, content As Integer, ByRef value As Object, parseOption As ParseOption )
 Параметры
 Параметры
 Описание
 row
 Индекс строки. Тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 column
 Индекс столбца. Тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице.
 content
 Индекс элемента содержимого ячейки. Тип int.
 value
 Задаваемое значение. Тип Object.
 parseOption
 Опции парсинга значения. Перечисление ParseOption.
 Описание
 Метод позволяет задать значение указанному элементу содержимого заданной ячейки таблицы. Дополнительно метод дает возможность указать опции парсинга значения.
 Замечания
 Метод выбрасывает исключение eInvalidInput, если индексы строки и/или столбца выходят за допустимые пределы. Если содержимое ячейки недоступно для редактирования, метод выбрасывает исключение eIsWriteProtected.
 Ссылки
 Teigha.DatabaseServices.LinkedTableData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!