Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MText.LineSpaceDistance
 Послать отзыв
 Свойство представляет межстрочный интервал в данном объекте.
 Синтаксис
C#
Visual Basic
Копировать Код
public double LineSpaceDistance;
Копировать Код
Public Property LineSpaceDistance As Double
 Возвращает
 Возвращает межстрочный интервал. Тип double.
 Описание
 Свойство представляет межстрочный интервал в данном объекте, т.е. расстояние между базовыми линиями соседних строк текста.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MText, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!