Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Событие Database.XrefPreXrefLockFile
 Послать отзыв
 Синтаксис
C#
Visual Basic
public event XrefPreXrefLockFileEventHandler XrefPreXrefLockFile;
Public Event XrefPreXrefLockFile As XrefPreXrefLockFileEventHandler
 Описание
 Событие посылается непосредственно перед блокировкой чертежа.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!