Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LoftOptionsBuilder.DraftEndMag
 Послать отзыв
 Свойство возвращает величину вытягивания для поверхности у последнего поперечного сечения (end draft magnitude).
 Синтаксис
C#
Visual Basic
Копировать Код
public double DraftEndMag;
Копировать Код
Public Property DraftEndMag As Double
 Возвращает
 Возвращает величину вытягивания. Тип double.
 Описание
 Свойство возвращает величину вытягивания для поверхности у последнего поперечного сечения (end draft magnitude). Параметр управляет модулем вектора касательной к поверхности в последнем поперечном сечении. Значение по умолчанию — 0, т.е. на последнем поперечном сечении автоматически рассчитывается оптимальная величина.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.LoftOptionsBuilder, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!