Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Ray3d.Ray3d
 Послать отзыв
 Конструктор класса Ray3d. Создает луч по двум несовпадающим 3D-точкам, первая из которых становится начальной точкой луча, а вторая задает его направление.
 Синтаксис
C#
Visual Basic
Копировать Код
public Ray3d( Point3d point1, Point3d point2 );
Копировать Код
Public Sub New( point1 As Point3d, point2 As Point3d )
 Параметры
 Параметры
 Описание
 point1
 Точка начала луча. Тип Point3d.
 point2
 Точка, через которую проходит луч. Тип Point3d. Не может совпадать с точкой point1.
 Описание
 Конструктор класса Ray3d. Создает луч, который начинается в точке point1 и проходит через точку point2. Точки point1 и point2 не могут совпадать.
 Ссылки
 Teigha.Geometry.Ray3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!