Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.StyleSheet
 Послать отзыв
 Синтаксис
C#
Visual Basic
public String StyleSheet;
Public Property StyleSheet() As String
 Описание
 Обеспечивает доступ к текущему стилю печати листа.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!