Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Entity.SaveAs(WorldDraw
 Послать отзыв
 Метод используется для генерации графических примитивов при сохранении геометрического объекта в виде прокси-объекта с помощью nanoCAD, обеспечивая его корректное отображение при последующей загрузке. Он вызывается автоматически при сохранении и позволяет переопределять логику сохранения графики через производные классы WorldDraw, WorldGeometry и SubEntityTraits.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SaveAs(WorldDraw mode, SaveType st);
Копировать Код
Public Sub SaveAs(mode As WorldDraw, st As SaveType)
 Параметры
 Параметры
 Описание
 mode
 Указатель на полностью инициализированный объект WorldDraw (или на объект класса, производного от WorldDraw). Тип WorldDraw
 st
 Параметр, указывающий, почему вызван метод saveAs Тип SaveType
 Описание
 Использование метода
 Этот метод использует nanoCAD для генерации графических примитивов всякий раз, когда при сохранении требуется сохранение прокси-объектов для геометрического объекта. Переопределение этого метода позволяет контролировать сохраняемую графику.
 Для приложений допустимо вызывать этот метод, но приложение должно обеспечить полную функциональность объекта WorldDraw, а также объектов WorldGeometry и SubEntityTraits, для которых оно обеспечивает ссылки. Единственный способ обеспечить это — создать производные пользовательские классы для этих трех графических классов.
 Разработка метода в производных классах
 Объект типа WorldDraw, заданный в параметре mode, так же как объекты WorldGeometry и SubEntityTraits, доступные из объекта WorldDraw, должны обеспечивать для данного метода создание любых графических примитивов, требуемых для представления геометрического объекта, когда он отображается как прокси-объект.
 В том контексте, в котором этот метод вызывается, нет необходимости работать с назначениями GS маркера. Однако, все видимые свойства, такие как цвета, слои, типы линий, видимость являются важными.
 Параметр st обеспечивает контекст для вызова метода.
 Графические примитивы, созданные этим методом, будут сохранены вместе с геометрическим объектом в файле чертежа, так что чертеж всегда загружается с контролем приложением не загруженного геометрического объекта (это и значит, что объект становится прокси) и он может быть отображен на экране.
 Выполнение по умолчанию
 По умолчанию, этот метод вызывает метод WorldDraw() геометрического объекта с использованием указателя mode.
 Ссылки
 Teigha.DatabaseServices.Entity, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!