Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GradientColor.GradientColor
 Послать отзыв
 Конструктор класса GradientColor.
 Синтаксис
C#
Visual Basic
Копировать Код
public GradientColor( ref Teigha.Colors.Color color, float value );
Копировать Код
Public Sub New( ByRef color As Teigha.Colors.Color, value As float )
 Параметры
 Параметры
 Описание
 color
 Входной цвет. Тип Teigha.Colors.Color.
 value
 Входное число с плавающей точкой, представляющее интерполированное значение, которое определяется градиентом. Тип float.
 Описание
 Конструктор класса GradientColor. Создает новый экземпляр класса с указанными значениями параметров.
 Ссылки
 Teigha.DatabaseServices.GradientColor, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!