Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.RasterImage
 Послать отзыв
 Класс представляет объект "изображение" на чертеже.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::GraphicsInterface::Drawable Teigha::DatabaseServices::DBObject Teigha::DatabaseServices::Entity Teigha::DatabaseServices::Image Teigha::DatabaseServices::RasterImage
 Синтаксис
C#
Visual Basic
[Wrapper("AcDbRasterImage")] [TypeDescriptionProvider("Teigha.ComponentModel.TypeDescriptionProvider`1[[Teigha.DatabaseServices.RasterImage, TD_Mgd]], TD_Mgd")] public class RasterImage : Image;
<Wrapper("AcDbRasterImage")> <TypeDescriptionProvider("Teigha.ComponentModel.TypeDescriptionProvider`1[[Teigha.DatabaseServices.RasterImage, TD_Mgd]], TD_Mgd")> Public Class RasterImage Inherits Image
 Описание
 Геометрический объект RasterImage (или "объект - изображение"), работает вместе с объектом RasterImageDef (или "объектом - определением изображения") для использования растровых изображений внутри nanoCAD. Отношение между двумя этими классами наиболее похоже на отношение между определением блока nanoCAD и геометрическим объектом, вставленным в блок.
 Объект - изображение представляет собой рисуемый и выбираемый геометрический объект nanoCAD, который представляет растровое изображение в пространстве модели или листа в определенном месте и с определенной ориентацией. Объект – изображение связывается точно с одним определением изображения объекта, в который он посылает запросы на операции обработки изображений, требуемые при отражении и черчении объектов. Поскольку определение изображения управляет всей графической информацией, объект - изображение относительно небольшой. Помимо расположения и ориентации изображения, он содержит границы, градиент, контраст, яркость и другие типовые свойства геометрического объекта, такие как слой и цвет.
 Два или более геометрических объектов могут быть связаны с одним определением объекта-изображения. Т.к. каждый объект-изображение имеет свои собственные границы, это эффективный способ отображать различные части одного растрового изображения в разных точках чертежа.
 Геометрический объект RasterImage должен иногда выполнять преобразования между двумя координатными системами — трехмерными координатами модели, в которой функционируют геометрические объекты и координаты на плоскости, которые понимает объект RasterImageDef. Для этих целей, объект-изображение содержит внутри себя прямоугольник границ на плоскости, определенный в 3D мировых координатах, который приблизительно ограничивает границы изображения, как они размещены в пространстве. Некоторые функции nanoCAD API в состоянии помочь преобразованию между координатами модели и 2D точек на плоскости.
 Объект - определение изображения играет "закулисную" роль определения блока, управляет связями с исходным изображением и управляет операциями низкого уровня с изображением, требуемыми для отображения и прорисовки изображения.
 Объекты - определения изображения хранятся в специальном словаре nanoCAD. Они не являются геометрическими объектами nanoCAD, поэтому они не могут отображаться или выбираться конечными пользователями. Они понимают только 2D координаты, поэтому все запросы на обработку изображений отображаются как 2D операции.
 Операции обработки изображений, так же как масштабирование и поворот изображений при отображений, выполняются специальной компонентой nanoCAD (Image Engine). Эта компонента имеет свое собственное API , в котором могут быть реализованы сложные приложения редактирования изображений. Note Геометрический объект RasterImage не может использоваться самостоятельно. Он должен быть связан с объектом RasterImageDef для отображения изображений с использованием RasterImage.ImageDefId. Более того, RasterImageDefReactor должен быть создан и связан с объектами RasterImageDef и RasterImageDefReactor.
 Методы
 Конструкторы
 Teigha.GraphicsInterface.Drawable
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 Drawable
 Конструктор класса Teigha.GraphicsInterface.Drawable. (Унаследован от Drawable)
 Teigha.DatabaseServices.DBObject
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 DBObject
 Конструктор. (Унаследован от DBObject)
 Teigha.DatabaseServices.RasterImage
 Имя
 Описание
 RasterImage
 Это обзор перегрузок RasterImage.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.GraphicsInterface.Drawable
 Имя
 Описание
 Drawable Методы
 Ниже перечислены методы класса Drawable.
 Drawable Свойства
 Ниже перечислены свойства класса Drawable.
 Teigha.DatabaseServices.DBObject
 Имя
 Описание
 DBObject Методы
 Ниже перечислены методы класса DBObject.
 DBObject Свойства
 Ниже перечислены свойства класса DBObject.
 DBObject События
 Ниже перечислены события класса DBObject.
 Teigha.DatabaseServices.Entity
 Имя
 Описание
 Entity Методы
 Ниже перечислены методы класса Entity.
 Entity Свойства
 Ниже перечислены свойства класса Entity.
 Teigha.DatabaseServices.RasterImage
 Имя
 Описание
 RasterImage Методы
 Ниже перечислены методы класса RasterImage.
 RasterImage Свойства
 Ниже перечислены свойства класса RasterImage.
 Ссылки
 RasterImage Конструктор, RasterImage Методы, RasterImage Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства, DBObject События
 Ваши комментарии по поводу этого топика: Послать отзыв!