Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Ucsorg
 Послать отзыв
 Синтаксис
C#
Visual Basic
public Point3d Ucsorg;
Public Property Ucsorg() As Point3d
 Описание
 Обеспечивает доступ к текущему значению UCSORG для базы данных.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!