Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve2d.GetParameterOf
 Послать отзыв
 Метод вычисляет значение параметра для заданной точки на кривой.
 Синтаксис
C#
Visual Basic
Копировать Код
public double GetParameterOf( Point2d point );
Копировать Код
Public Function GetParameterOf( point As Point2d ) As Double
 Параметры
 Параметры
 Описание
 point
 Входная точка на кривой. Тип Point2d.
 Возвращает
 Возвращает значение параметра для точки point. Тип double.
 Описание
 Метод вычисляет значение параметра для заданной точки на кривой. Используется вызов Curve2d.GetParameterOf(Point2d point, Tolerance tolerance) со значением точности, равным Tolerance.Global.
 Если точка не находится на кривой, результат будет непредсказуем. Чтобы убедиться, что входная точка находится на кривой, используйте метод Curve2d.IsOn(Point2d point).
 Ссылки
 Teigha.Geometry.Curve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!