Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.PointOnCurve3d.GetDerivative
 Послать отзыв
 Метод вычисляет первую либо вторую производную указанной кривой в заданной параметром точке на кривой.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d GetDerivative( int order, ref Curve3d curve, double parameter );
Копировать Код
Public Function GetDerivative( order As Integer, ByRef curve As Curve3d, parameter As Double ) As Vector3d
 Параметры
 Параметры
 Описание
 order
 Порядок вычисляемой производной. Тип int. Допустимые значения 1 и 2.
 curve
 Входная кривая. Тип Curve3d.
 parameter
 Входное значение параметра, задающее точку на кривой для вычисления производной. Тип double.
 Возвращает
 Возвращает вектор производной. Тип Vector3d.
 Описание
 Метод вычисляет первую либо вторую производную указанной кривой в заданной параметром точке на кривой.
 Ссылки
 Teigha.Geometry.PointOnCurve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!