Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.IdMapping.GetEnumerator
 Послать отзыв
 Метод позволяет получить перечислитель для данного объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public System.Collections.IEnumerator GetEnumerator();
Копировать Код
Public Function GetEnumerator() As System.Collections.IEnumerator
 Возвращает
 Возвращает перечислитель. Тип System.Collections.IEnumerator.
 Описание
 Метод позволяет получить перечислитель для данного объекта.
 Ссылки
 Teigha.DatabaseServices.IdMapping, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!