Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbCurve2d.SetFitData
 Послать отзыв
 Метод пересчитывает сплайн, используя заданные определяющие точки, векторы касательных в начальной и конечной точках и точность интерполяции. Опционально сплайн может быть построен периодическим.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetFitData( ref KnotCollection fitKnots, ref Point2dCollection fitPoints, Vector2d startTangent, Vector2d endTangent, Tolerance fitTolerance, bool periodic );
Копировать Код
Public Sub SetFitData( ByRef fitKnots As KnotCollection, ByRef fitPoints As Point2dCollection, startTangent As Vector2d, endTangent As Vector2d, fitTolerance As Tolerance, periodic As Boolean )
 Параметры
 Параметры
 Описание
 fitKnots
 Узловой вектор нового сплайна. Тип KnotCollection.
 fitPoints
 Массив определяющих точек. Тип Point2dCollection.
 startTangent
 Вектор касательной в начальной точке. Тип Vector2d.
 endTangent
 Вектор касательной в конечной точке. Тип Vector2d.
 fitTolerance
 Точность интерполяции. Тип Tolerance.
 periodic
 Флаг, определяющий, требуется ли построить периодический сплайн (замкнутую кривую). Тип bool.
 Описание
 Метод пересчитывает сплайн, используя заданные определяющие точки, векторы касательных в начальной и конечной точках и точность интерполяции.
 Аргумент fitKnots передает узловой вектор для нового сплайна. Установленный флаг periodic делает новый сплайн периодическим, так что первая и последняя определяющие точки должны совпадать.
 Если аргумент fitTolerance не равен 0, то построенный сплайн может не проходить точно через определяющие точки, но максимальное отклонение построенного сплайна от любой определяющей точки не будет превышать fitTolerance.
 Ссылки
 Teigha.Geometry.NurbCurve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!