Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Curve.GetDistanceAtParameter
 Послать отзыв
 Метод возвращает длину вдоль кривой до точки, заданной параметром.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual double GetDistanceAtParameter( double value );
Копировать Код
Public virtual Function GetDistanceAtParameter( value As double ) As double
 Параметры
 Параметры
 Описание
 value
 Входной объект, представляющий параметр.
 Возвращает
 Метод возвращает значение типа double - длину вдоль кривой до точки, заданной входным параметром.
 Описание
 Метод возвращает длину вдоль кривой до точки, заданной параметром.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Curve, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!