Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbCurve2d.MakeClosed
 Послать отзыв
 Метод позволяет сделать данную кривую замкнутой, если она еще не замкнута.
 Синтаксис
C#
Visual Basic
Копировать Код
public void MakeClosed();
Копировать Код
Public Sub MakeClosed()
 Описание
 Метод позволяет сделать данную кривую замкнутой, если она еще незамкнутая.
 Кривая замыкается путем построения периодического сплайна, вид которого определяется имеющимися управляющими вершинами или определяющими точками. Если кривая уже является замкнутой, метод ничего не делает.
 Ссылки
 Teigha.Geometry.NurbCurve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!