Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SectionSettings.GetHatchPatternType
 Послать отзыв
 Метод позволяет получить тип образца штриховки геометрии сечения указанного типа.
 Синтаксис
C#
Visual Basic
Копировать Код
public HatchPatternType GetHatchPatternType( SectionType nSecType, SectionGeometry nGeometry );
Копировать Код
Public Function GetHatchPatternType( nSecType As SectionType, nGeometry As SectionGeometry ) As HatchPatternType
 Параметры
 Параметры
 Описание
 nSecType
 Тип сечения. Перечисление SectionType.
 nGeometry
 Типы элементов геометрии сечения. Перечисление SectionGeometry.
 Возвращает
 Возвращает тип образца штриховки. Перечисление HatchPatternType.
 Описание
 Метод позволяет получить тип образца штриховки геометрии сечения указанного типа как значение из перечисления HatchPatternType.
 Ссылки
 Teigha.DatabaseServices.SectionSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!