Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SweepOptionsBuilder.AlignStart
 Послать отзыв
 Свойство AlignStart представляет вариант выравнивания объекта относительно начала или конца траектории вытягивания.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool AlignStart;
Копировать Код
Public Property AlignStart As Boolean
 Возвращает
 Возвращает true, если применяется выравнивание относительно начала траектории. В случае false используется выравнивание относительно конца траектории.
 Описание
 Свойство AlignStart представляет вариант выравнивания объекта относительно начала или конца траектории вытягивания.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.SweepOptionsBuilder, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!