Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DataCellCollection.Contains
 Послать отзыв
 Метод проверяет, содержит ли данная коллекция элемент, соответствующий указанному объекту DataCell.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool Contains( ref DataCell value );
Копировать Код
Public Function Contains( ByRef value As DataCell ) As Boolean
 Параметры
 Параметры
 Описание
 value
 Искомый объект типа DataCell.
 Возвращает
 Возвращает true, если коллекция содержит объект value. В противном случае возвращает false.
 Описание
 Метод проверяет, содержит ли данная коллекция элемент, соответствующий указанному объекту DataCell.
 Ссылки
 Teigha.DatabaseServices.DataCellCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!