Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.SurfaceSurfaceIntersector.SurfaceSurfaceIntersector
 Послать отзыв
 Конструктор по умолчанию класса SurfaceSurfaceIntersector.
 Синтаксис
C#
Visual Basic
Копировать Код
public SurfaceSurfaceIntersector();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса SurfaceSurfaceIntersector.
 Созданный объект имеет нулевые ссылки на поверхности. Ему назначена точность по умолчанию, а также сняты флаги перекрытия поверхностей и инициализированности внутренних данных.
 Ссылки
 Teigha.Geometry.SurfaceSurfaceIntersector, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!