Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.GetDataFormat
 Послать отзыв
 Метод позволяет получить формат данных указанного по индексу элемента содержимого заданной ячейки.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual String GetDataFormat( int row, int column, int contentIndex );
Копировать Код
Public virtual Function GetDataFormat( row As Integer, column As Integer, contentIndex As Integer ) As String
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 contentIndex
 Индекс элемента содержимого ячейки, тип int. Индекс должен быть больше или равен нулю и меньше количества элементов содержимого в ячейке.
 col
 Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
 Возвращает
 Возвращает формат данных в виде строки, тип String.
 Описание
 Метод позволяет получить формат данных указанного по индексу элемента ячейки, заданной индексами строки и столбца.
 _________
 Замечания
 Для получения того же результата предпочтительнее использовать Table.Cells[row,column].DataFormat.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!