Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.NurbSurface.SetControlPoints
 Послать отзыв
 Метод позволяет задать для поверхности новый массив управляющих вершин.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetControlPoints( int iUDegree, int iVDegree, ref Point3dCollection points );
Копировать Код
Public Sub SetControlPoints( iUDegree As Integer, iVDegree As Integer, ByRef points As Point3dCollection )
 Параметры
 Параметры
 Описание
 iUDegree
 Новое количество управляющих вершин в направлении u. Тип int.
 iVDegree
 Новое количество управляющих вершин в направлении v. Тип int.
 points
 Новый массив управляющих вершин, заданных в координатах WCS. Тип Point3dCollection.
 Описание
 Метод позволяет задать для поверхности новый массив управляющих вершин.
 Если поверхность не содержит информации об управляющих вершинах, метод генерирует исключение eFail.
 Параметры iUDegree или iVDegree должны быть равны количествам управляющих вершин, которые в данный момент используются для данной поверхности для направлений u и v, соответственно. В противном случае будет выброшено исключение eInvalidInput. Если этот метод в конкретном моделере не реализован, выбрасывается исключение eNotImplementedYet.
 Индексы столбцов относятся к направлению v, а индексы строк — к направлению u. Точки массива в коллекции points следует располагать построчно следующим образом: [0,0], [0,1], ...[0,vCount-1], ..., [uCount-1,0], [uCount- 1,1], ...[uCount-1,vCount-1].
 Ссылки
 Teigha.DatabaseServices.NurbSurface, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!