Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DynamicDimensionData.Visible
 Послать отзыв
 Свойство Visible предоставляет возможность управлять видимостью динамического размера.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool Visible;
Копировать Код
Public Property Visible As Boolean
 Возвращает
 Возвращает true, если динамический размер является видимым. В противном случае возвращает false.
 Описание
 Свойство Visible предоставляет возможность управлять видимостью динамического размера.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.DynamicDimensionData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!