Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GripDataCollection.Item
 Послать отзыв
 Свойство Item предоставляет элемент коллекции с указанным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public GripData this[int A_0];
Копировать Код
Default Public ReadOnly Property Item( A_0 As Integer ) As GripData
 Параметры
 Параметры
 Описание
 A_0
 Индекс искомого элемента коллекции. Тип int. Должен удовлетворять множеству допустимых значений.
 Возвращает
 Возвращает элемент коллекции с индексом A_0. Тип GripData.
 Описание
 Свойство Item предоставляет элемент коллекции с указанным индексом.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.GripDataCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!