Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.XrefFullSubentityPath
 Послать отзыв
 Класс XrefFullSubentityPath уникальным образом определяет в базе данных подобъекты внешних ссылок.
 Иерархия классов
Teigha::DatabaseServices::XrefFullSubentityPath
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("AcDbXrefFullSubentityPath")] public class XrefFullSubentityPath : DisposableWrapper
Копировать Код
<Wrapper("AcDbXrefFullSubentityPath")> Public Class XrefFullSubentityPath Inherits DisposableWrapper
 Описание
 Класс XrefFullSubentityPath уникальным образом определяет в базе данных подобъекты внешних ссылок.
 Замечания
 Каждый экземпляр этого класса состоит из объекта SubentId, упорядоченного массива идентификаторов объектов и упорядоченного массива дескрипторов объектов чертежа.
 Идентификатор подобъекта SubentId состоит из индекса и типа SubentType объекта.
 Массив идентификаторов объектов и массив дескрипторов определяют путь к подобъекту от объекта самого верхнего уровня (в пространстве листа или пространстве модели) до объекта чертежа, содержащего подобъект.
 Топики
 Имя
 Описание
 XrefFullSubentityPath Методы
 Ниже перечислены методы класса XrefFullSubentityPath.
 XrefFullSubentityPath Свойства
 Ниже перечислены свойства класса XrefFullSubentityPath.
 Ссылки
 XrefFullSubentityPath Методы, XrefFullSubentityPath Свойства, Топики, XrefFullSubentityPath Методы, XrefFullSubentityPath Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!