Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Entity.TransformSubentityPathsBy(FullSubentityPath[]
 Послать отзыв
 Метод применяет указанную матрицу преобразования к одному или нескольким геометрическим подобъектам текущего объекта, изменяя их положение, ориентацию или размер. Реализация метода позволяет разработчику определять поддерживаемые типы преобразований и способ их применения к подобъектам.
 Синтаксис
C#
Visual Basic
Копировать Код
public void TransformSubentityPathsBy(FullSubentityPath[] subPaths, Matrix3d transform);
Копировать Код
Public Sub TransformSubentityPathsBy(subPaths As FullSubentityPath[], transform As Matrix3d)
 Параметры
 Параметры
 Описание
 subPaths
 Массив одного или нескольких подобъектов, определяющих подобъекты для преобразования. Тип FullSubentityPath[]
 transform
 WCS преобразование, применимое к каждому из подобъектов операции. Тип Matrix3d
 Описание
 Применение геометрического преобразования к одному или нескольким геометрическим подобъектам объекта.
 Этот метод обеспечивает инструмент, с помощью которого nanoCAD и приложения могут предложить геометрическому объекту применить матрицу преобразования(xform) к одному или нескольким геометрическим подобъектам объекта.
 Разработка этого метода не является обязательной. Ограничения на то, какие из типов преобразований поддерживаются, возлагаются на разработчика класса геометрических объектов.
 Этот метод должен приложить матрицу преобразования xform к подобъектам геометрического объекта и изменить состояние геометрического объекта для отражения преобразования. Полностью на усмотрение разработчика отдается то, как применить преобразование. Также на усмотрение разработчика остается решение, что, или какие, ограничения будут у данного типа поддерживаемого преобразования. Если какие-либо ограничения требуются, то разработчик этого метода должен удовлетворить им. Note Если метод не переопределен, то такие команды nanoCAD, как MOVE, ROTATE, SCALE и т.д. не будут вызывать никакого результата для подобъектов геометрических объектов данного класса.
 Ссылки
 Teigha.DatabaseServices.Entity, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!