Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Polyline2d.ConvertToPolyType
 Послать отзыв
 Метод предназначен для преобразования полилинии в тип, указанный значением аргумента.
 Синтаксис
C#
Visual Basic
Копировать Код
public ConvertToPolyType( Poly2dType newVal );
Копировать Код
Public Sub ConvertToPolyType( newVal As Poly2dType )
 Параметры
 Параметры
 Описание
 newVal
 Новый тип полилинии из перечисления Poly2dType.
 Описание
 Метод предназначен для преобразования полилинии в тип, указанный значением аргумента newType. Использует методы SplineFit() и/или CurveFit().
 Ссылки
 Teigha.DatabaseServices.Polyline2d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!