Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Класс Teigha.DatabaseServices.ViewTable
 Послать отзыв
 Класс предназначен для хранения определений именованных видов в базе данных чертежа.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::GraphicsInterface::Drawable Teigha::DatabaseServices::DBObject Teigha::DatabaseServices::SymbolTable Teigha::DatabaseServices::ViewTable
 Синтаксис
C#
Visual Basic
[Wrapper("AcDbViewTable")] public class ViewTable : SymbolTable;
<Wrapper("AcDbViewTable")> Public Class ViewTable Inherits SymbolTable
 Описание
 Класс предназначен для хранения определений именованных видов в базе данных чертежа, то есть является коллекцией/таблицей, в которой каждая запись – это определение именованного вида.
 Именованные виды создаются для быстрого перехода от одного фрагмента чертежа к другому.
 Определение именованного вида – это набор данных, определяющий его характеристики: название, яркость, ракурс и пр. Для определения именованного вида используется класс ViewTableRecord. Соответственно, все записи таблицы видов имеют тип данных ViewTableRecord.
 Итератор таблицы устроен так, что при переборе коллекции перебираются ObjectId каждого элемента, а не сами записи таблицы. По ObjectId можно открыть каждую запись и получить подробные данные, либо изменить их.
 По умолчанию, в чертеже всегда есть стандартные виды: ортогональные (сверху, снизу и пр.) и изометрические (ЮЗ, ЮВ и пр.). Но в таблицу именованных видов они не входят. В таблицу входят только виды, созданные пользователем. В интерфейсе nanoCAD каждое определение именованного вида (запись в таблице видов) является видом в перечне сохраненных видов. Сам перечень сохраненных видов отражает всё содержимое таблицы видов:
 Рис. 1
 На рисунке 1 сохраненные именованные виды отображены в верхней части перечня, над чертой. Такой перечень можно увидеть несколькими способами:
С помощью кнопки слева от вкладок листов:
Через меню: Вид -> Именованные виды -> ? -> *. В этом случае перечень будет выведен в командную строку nanoCAD:
Через ленту: Вид -> Виды -> Установить вид -> ? -> *. Перечень видов будет также выведен в командную строку nanoCAD;
Через команду ВИД -> ? -> *. Перечень видов будет также выведен в командную строку nanoCAD.
 Пример
 В качестве примера работы с таблицей видов приведена команда VIEWTABLEREADING, которая открывает таблицу видов и перебирает её содержимое, выводя в командную строку название каждого вида и его тип данных.
C#
 Копировать Код
public partial class Commands { [Teigha.Runtime.CommandMethod("ViewTableReading")] public void ViewTableReading() { // Получение ссылки на активный документ HostMgd.ApplicationServices.Document doc = HostMgd.ApplicationServices.Application.DocumentManager.MdiActiveDocument; // Получение ссылки на редактор докумена HostMgd.EditorInput.Editor ed = doc.Editor; // Получение ссылки на базу данных документа Teigha.DatabaseServices.Database db = doc.Database; // Начало транзакции с базой данных документа using (Teigha.DatabaseServices.Transaction trans = db.TransactionManager.StartTransaction()) { // Открываем таблицу блоков для чтения Teigha.DatabaseServices.ViewTable viewTable = trans.GetObject(db.ViewTableId, Teigha.DatabaseServices.OpenMode.ForRead) as Teigha.DatabaseServices.ViewTable; if(viewTable!=null) { // Перебираем таблицу именованных видов в цикле foreach (Teigha.DatabaseServices.ObjectId vtr in viewTable) { // Открываем каждую запись таблицы видов Teigha.DatabaseServices.ViewTableRecord obj = trans.GetObject(vtr, Teigha.DatabaseServices.OpenMode.ForRead) as Teigha.DatabaseServices.ViewTableRecord; // Открываем лист, к которому был сделан вид, чтобы получить его название Teigha.DatabaseServices.Layout layout = trans.GetObject(obj.Layout, Teigha.DatabaseServices.OpenMode.ForRead) as Teigha.DatabaseServices.Layout; // Выводим в командную строку название каждого определения вида и лист, к которому // этот лист был сделан ed.WriteMessage($"nTable record name and layout: {obj.Name} , {layout.LayoutName} "); } } else { ed.WriteMessage("В документе нет именованных видов."); } trans.Abort(); } } }
 На рисунке ниже приведен пример того, как отработала команда VIEWTABLEREADING в документе, где заранее были созданы именованные виды в пространстве модели и в листах A4 и А3. Соответственно, в перечне можно увидеть все эти именованные виды и листы, в которых они были созданы.
 Методы
 Конструкторы
 Teigha.GraphicsInterface.Drawable
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 Drawable
 Конструктор класса Teigha.GraphicsInterface.Drawable. (Унаследован от Drawable)
 Teigha.DatabaseServices.DBObject
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 DBObject
 Конструктор. (Унаследован от DBObject)
 Teigha.DatabaseServices.SymbolTable
 ПоказатьPrivateУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 SymbolTable
 This is SymbolTable, a member of class SymbolTable. (Унаследован от SymbolTable)
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.GraphicsInterface.Drawable
 Имя
 Описание
 Drawable Методы
 Ниже перечислены методы класса Drawable.
 Drawable Свойства
 Ниже перечислены свойства класса Drawable.
 Teigha.DatabaseServices.DBObject
 Имя
 Описание
 DBObject Методы
 Ниже перечислены методы класса DBObject.
 DBObject Свойства
 Ниже перечислены свойства класса DBObject.
 DBObject События
 Ниже перечислены события класса DBObject.
 Teigha.DatabaseServices.SymbolTable
 Имя
 Описание
 SymbolTable Методы
 Ниже перечислены методы класса SymbolTable.
 SymbolTable Свойства
 Ниже перечислены свойства класса SymbolTable.
 Ссылки
 Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства, DBObject События
 Ваши комментарии по поводу этого топика: Послать отзыв!