Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.ExternalCurve3d.IsOwnerOfCurve
 Послать отзыв
 Свойство IsOwnerOfCurve позволяет убедиться, что данный объект является владельцем данных своего определения.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsOwnerOfCurve;
Копировать Код
Public ReadOnly Property IsOwnerOfCurve As Boolean
 Возвращает
 Возвращает true, если данный объект является владельцем данных своего определения. В противном случае возвращает false.
 Описание
 Свойство IsOwnerOfCurve позволяет убедиться, что данный объект является владельцем данных своего определения.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.ExternalCurve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!