Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Dimtolj
 Послать отзыв
 Синтаксис
C#
Visual Basic
public int Dimtolj;
Public Property Dimtolj() As Integer
 Описание
 Возвращает или устанавливает текущее значение DIMTOLJ для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!