Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.OsnapPointRef.EvalPoint
 Послать отзыв
 Метод вычисляет текущие координаты точки привязки размера.
 Синтаксис
C#
Visual Basic
Копировать Код
public override Geometry.Point3d EvalPoint();
Копировать Код
Public Overrides Function EvalPoint() As Geometry.Point3d
 Возвращает
 Возвращает текущее положение точки привязки размера. Тип Geometry.Point3d.
 Описание
 Метод вычисляет текущие координаты точки привязки объекта размера.
 Ссылки
 Teigha.DatabaseServices.OsnapPointRef, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!