Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SubentityId.SubentityId
 Послать отзыв
 Конструктор структуры SubentityId. Создает экземпляр структуры, используя переданный тип подобъекта и указатель в качестве индекса.
 Синтаксис
C#
Visual Basic
Копировать Код
public SubentityId( SubentityType type, IntPtr i );
Копировать Код
Public Sub New( type As SubentityType, i As IntPtr )
 Параметры
 Параметры
 Описание
 type
 Тип подобъекта. Тип SubentityType.
 i
 Индекс подобъекта. Тип IntPtr.
 Описание
 Конструктор структуры SubentityId. Создает экземпляр структуры, используя переданный тип подобъекта и указатель в качестве индекса.
 Ссылки
 Teigha.DatabaseServices.SubentityId, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!