Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.AcadDatabase
 Послать отзыв
 Синтаксис
C#
Visual Basic
public Object AcadDatabase;
Public Property AcadDatabase() As Object
 Описание
 Возвращает текущую баз данных.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!