Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.NurbSurface.InsertKnotAtU
 Послать отзыв
 Метод вставляет узел с указанным значением параметра u без изменения формы поверхности.
 Синтаксис
C#
Visual Basic
Копировать Код
public void InsertKnotAtU( double dU );
Копировать Код
Public Sub InsertKnotAtU( dU As Double )
 Параметры
 Параметры
 Описание
 dU
 Входное значение параметра U. Тип double.
 Описание
 Метод вставляет узел с указанным значением параметра u.
 Добавление нового узла не меняет форму поверхности. Метод добавляет новый ряд управляющих вершин в направлении v и корректирует положение локальной управляющей вершины.
 Если поверхность не содержит никакой NURBS информации, метод выбрасывает исключение eFail. Если кратность узлов поверхности для параметра u превышает степень сплайна в направлении u, выбрасывается исключение eInvalidInput. Если этот метод в конкретном моделере не реализован, выбрасывается исключение eNotImplementedYet.
 Ссылки
 Teigha.DatabaseServices.NurbSurface, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!