Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.AugmentedPolylineCurve3d.GetVectorAt
 Послать отзыв
 Метод позволяет получить вектор с указанным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d GetVectorAt( int index );
Копировать Код
Public Function GetVectorAt( index As Integer ) As Vector3d
 Параметры
 Параметры
 Описание
 index
 Входной индекс искомого вектора. Тип int.
 Возвращает
 Возвращает вектор с указанным индексом. Тип Vector3d.
 Описание
 Метод позволяет получить вектор с указанным индексом.
 Ссылки
 Teigha.Geometry.AugmentedPolylineCurve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!