Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocAction.AreDependenciesOnTheSameThing
 Послать отзыв
 Метод позволяет проверить, зависят ли две заданные ассоциативные зависимости от одного и того же объекта. Решение принимается на уровне действия-владельца зависимости.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool AreDependenciesOnTheSameThing( ref AssocDependency dependency1, ref AssocDependency dependency2 );
Копировать Код
Public Function AreDependenciesOnTheSameThing( ByRef dependency1 As AssocDependency, ByRef dependency2 As AssocDependency ) As Boolean
 Параметры
 Параметры
 Описание
 dependency1
 Первая ассоциативная зависимость. Тип AssocDependency.
 dependency2
 Вторая ассоциативная зависимость. Тип AssocDependency.
 Возвращает
 Возвращает true, если указанные две ассоциативные зависимости от одного и того же объекта. В противном случае возвращает false.
 Описание
 Метод позволяет проверить, зависят ли две заданные ассоциативные зависимости от одного и того же объекта.
 Метод делегирован из принадлежащего зависимости предиката AssocDependency.IsDependentOnTheSameThingAs(). Это позволяет владеющему действию, а не самой зависимости, решать, зависят ли указанные две ассоциативные зависимости от одного и того же объекта. Реализация по умолчанию просто возвращает true.
 Если действие владеет объектом AssocActionBody, который переопределяет предикат IsDependentOnTheSameThingOveride(), то вызывается этот предикат (а не просто возвращается true).
 Ссылки
 Teigha.DatabaseServices.AssocAction, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!