Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Surface.Perimeter
 Послать отзыв
 Свойство Perimeter представляет текущее значение периметра данной поверхности.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Perimeter;
Копировать Код
Public ReadOnly Property Perimeter As Double
 Возвращает
 Возвращает значение периметра. Тип double.
 Описание
 Свойство Perimeter представляет текущее значение периметра данной поверхности.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Surface, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!