Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.UnderlayHost
 Послать отзыв
 Класс UnderlayHost реализуется хост-приложениями для поддержки подложек.
 Иерархия классов
Teigha::DatabaseServices::UnderlayHost
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdDbUnderlayHostPE")] public class UnderlayHost : RXObject
Копировать Код
<Wrapper("OdDbUnderlayHostPE")> Public Class UnderlayHost Inherits RXObject
 Описание
 Класс UnderlayHost реализуется хост-приложениями для поддержки подложек. Этот интерфейс используется объектами UnderlayDefinition и UnderlayReference для корректной работы.
 Топики
 Имя
 Описание
 UnderlayHost Методы
 Ниже перечислены методы класса UnderlayHost.
 UnderlayHost Свойства
 Ниже перечислены свойства класса UnderlayHost.
 Ссылки
 UnderlayHost Методы, UnderlayHost Свойства, Топики, UnderlayHost Методы, UnderlayHost Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!