Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.TableFillOptions
 Послать отзыв
 Перечисление TableFillOptions определяет параметры заполнения таблицы.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum TableFillOptions { None = 0, Row = 1, Reverse = 2, GenerateSeries = 4, CopyContent = 8, CopyFormat = 16, OverwriteReadOnlyContent = 32, OverwriteReadOnlyFormat = 64 }
Копировать Код
Public Enum TableFillOptions None = 0 Row = 1 Reverse = 2 GenerateSeries = 4 CopyContent = 8 CopyFormat = 16 OverwriteReadOnlyContent = 32 OverwriteReadOnlyFormat = 64 End Enum
 Члены
 Члены
 Описание
 None
 Значение: 0. Параметры заполнения таблицы не заданы.
 Row
 Значение: 1. Заполнять последовательно ячейки вдоль строки.
 Reverse
 Значение: 2. Заполнять ячейки в обратном направлении.
 GenerateSeries
 Значение: 4. Заполнять ячейки последовательностями значений на основе содержимого исходных ячеек.
 CopyContent
 Значение: 8. Заполнять копиями исходных ячеек.
 CopyFormat
 Значение: 16. Копировать формат из исходных ячеек в заполняемые ячейки.
 OverwriteReadOnlyContent
 Значение: 32. Перезаписывать содержимое ячеек со статусом "только для чтения".
 OverwriteReadOnlyFormat
 Значение: 64. Перезаписывать в ячейках формат со статусом "только для чтения".
 Описание
 Перечисление TableFillOptions определяет параметры заполнения таблицы.
 Ваши комментарии по поводу этого топика: Послать отзыв!