Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeader.SetPlane
 Послать отзыв
 Метод позволяет переопределить плоскость, в которой располагается данная мультивыноска.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetPlane( ref Plane value );
Копировать Код
Public Overridable Sub SetPlane( ByRef value As Plane )
 Параметры
 Параметры
 Описание
 value
 Новая плоскость для мультивыноски. Тип Plane.
 Описание
 Метод позволяет переопределить плоскость, в которой располагается данная мультивыноска. Плоскость задается в мировой системе координат (WCS).
 Ссылки
 Teigha.DatabaseServices.MLeader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!