Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Spline.NumControlPoints
 Послать отзыв
 Свойство NumControlPoints представляет количество управляющих вершин у данного сплайна.
 Синтаксис
C#
Visual Basic
Копировать Код
public int NumControlPoints;
Копировать Код
Public ReadOnly Property NumControlPoints As Integer
 Возвращает
 Возвращает количество управляющих вершин. Тип int.
 Описание
 Свойство NumControlPoints представляет количество управляющих вершин у данного сплайна.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Spline, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!