Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DimAssoc.GetDimAssocGeomIds
 Послать отзыв
 Метод предоставляет список всех связанных с данным объектом геометрических объектов во всех опорных точках.
 Синтаксис
C#
Visual Basic
Копировать Код
public void GetDimAssocGeomIds( ref ObjectIdCollection geomIds );
Копировать Код
Public Sub GetDimAssocGeomIds( ByRef geomIds As ObjectIdCollection )
 Параметры
 Параметры
 Описание
 geomIds
 Список идентификаторов всех связанных геометрических объектов во всех опорных точках. Тип ObjectIdCollection.
 Описание
 Метод предоставляет список всех связанных с данным объектом DimAssoc геометрических объектов во всех его опорных точках.
 Ссылки
 Teigha.DatabaseServices.DimAssoc, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!