Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PolygonMesh.Straighten
 Послать отзыв
 Метод удаляет все опорные вершины сплайна и восстанавливает исходную полигональную сеть контрольных точек.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Straighten();
Копировать Код
Public Sub Straighten()
 Описание
 Метод удаляет все опорные вершины сплайна и восстанавливает исходную полигональную сеть контрольных точек. Эта операция выполняет ту же модификацию, что и опция «Desmooth» команды PEDIT.
 Ссылки
 Teigha.DatabaseServices.PolygonMesh, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!