Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.SplineEntity2d.StartParameter
 Послать отзыв
 Свойство StartParameter представляет минимальное значение параметра у данного сплайна. Не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public double StartParameter;
Копировать Код
Public ReadOnly Property StartParameter As Double
 Возвращает
 Возвращает минимальное значение параметра у данного сплайна. Тип double.
 Описание
 Свойство StartParameter представляет минимальное значение параметра у данного сплайна. Не реализовано.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.SplineEntity2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!