Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Material.Bump
 Послать отзыв
 Свойство представляет компонент рельефности данного материала.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual MaterialMap Bump;
Копировать Код
Public Overridable Property Bump As MaterialMap
 Возвращает
 Возвращает карту рельефности (выдавливания). Тип MaterialMap.
 Описание
 Свойство представляет компонент рельефности данного материала.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Material, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!