Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Dimaltf
 Послать отзыв
 Синтаксис
C#
Visual Basic
public double Dimaltf;
Public Property Dimaltf() As Double
 Описание
 Возвращает или устанавливает текущее значение DIMALTF для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!