Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GeoLocationData
 Послать отзыв
 Этот класс хранит данные географического местоположения, включая DesignPoint, UpDirection, NorthDirection в пространстве чертежа, а также широту, долготу и высоту в географическом пространстве.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::GraphicsInterface::Drawable Teigha::DatabaseServices::DBObject Teigha::DatabaseServices::GeoLocationData
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("AcDbGeoData")] public class GeoLocationData : DBObject;
Копировать Код
<Wrapper("AcDbGeoData")> Public Class GeoLocationData Inherits DBObject
 Описание
 Этот класс представляет данные географического местоположения, включая DesignPoint, UpDirection, NorthDirection в пространстве чертежа, а также широту, долготу и высоту в географическом пространстве. Экземпляры класса хранятся в словаре расширений записи пространства модели в таблице блоков объекта BlockTableRecord.
 GeoLocationData также предоставляет функции преобразования координат между пространством чертежа DWG и географическим пространством.
 Замечания
 Термин GeoMesh в описаниях ниже представляет используемый данным классом экземпляр структуры MeshPointMaps, которая поддерживает две связанные между собой коллекции соответствующих друг другу 2D-точек - исходных точек и точек назначения.
 Методы
 Конструкторы
 Teigha.GraphicsInterface.Drawable
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 Drawable
 Конструктор класса Teigha.GraphicsInterface.Drawable. (Унаследован от Drawable)
 Teigha.DatabaseServices.DBObject
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 DBObject
 Конструктор. (Унаследован от DBObject)
 Teigha.DatabaseServices.GeoLocationData
 Имя
 Описание
 GeoLocationData
 Конструктор класса GeoLocationData.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.GraphicsInterface.Drawable
 Имя
 Описание
 Drawable Методы
 Ниже перечислены методы класса Drawable.
 Drawable Свойства
 Ниже перечислены свойства класса Drawable.
 Teigha.DatabaseServices.DBObject
 Имя
 Описание
 DBObject Методы
 Ниже перечислены методы класса DBObject.
 DBObject Свойства
 Ниже перечислены свойства класса DBObject.
 DBObject События
 Ниже перечислены события класса DBObject.
 Teigha.DatabaseServices.GeoLocationData
 Имя
 Описание
 GeoLocationData Методы
 Ниже перечислены методы класса GeoLocationData.
 GeoLocationData Свойства
 Ниже перечислены свойства класса GeoLocationData.
 Ссылки
 GeoLocationData Методы, GeoLocationData Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства, DBObject События
 Ваши комментарии по поводу этого топика: Послать отзыв!