Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotStyleData.LineType
 Послать отзыв
 Свойство LineType представляет тип линии для данного объекта PlotStyleData.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.LineType LineType;
Копировать Код
Public Property LineType As DatabaseServices.LineType
 Возвращает
 Возвращает тип линии из перечисления DatabaseServices.LineType.
 Описание
 Свойство LineType представляет тип линии для данного объекта PlotStyleData.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.PlotStyleData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!