Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Dimdec
 Послать отзыв
 Синтаксис
C#
Visual Basic
public int Dimdec;
Public Property Dimdec() As Integer
 Описание
 Возвращает или устанавливает текущее значение DIMDEC для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!