Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CompositeParameter.!=
 Послать отзыв
 Оператор неравенства структуры CompositeParameter.
 Синтаксис
C#
Visual Basic
Копировать Код
public static bool operator !=( CompositeParameter a, CompositeParameter b );
Копировать Код
Public Shared Operator <>( a As CompositeParameter, b As CompositeParameter ) As Boolean
 Параметры
 Параметры
 Описание
 a
 Левый операнд. Тип CompositeParameter.
 b
 Правый операнд. Тип CompositeParameter.
 Возвращает
 Возвращает true, если если не выполняется хотя бы одно из следующих условий:
Индексы подкривых совпадают.
Значения локальных параметров равны.
 В противном случае возвращает false.
 Описание
 Оператор неравенства структуры CompositeParameter.
 Ссылки
 Teigha.Geometry.CompositeParameter, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!