Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Solid3d.BooleanOperation
 Послать отзыв
 Метод предназначен для выполнения логических операций между данным объектом и другим твердым телом (объединение, пересечение, вычитание).
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void BooleanOperation( BooleanOperationType operation, ref Solid3d solid );
Копировать Код
Public Overridable Sub BooleanOperation( operation As BooleanOperationType, ByRef solid As Solid3d )
 Параметры
 Параметры
 Описание
 operation
 Тип логической операции. Перечисление BooleanOperationType.
 solid
 Другое твердое тело, участвующее в данной логической операции. Тип Solid3d.
 Описание
 Метод предназначен для выполнения логических операций между данным объектом и другим твердым телом. Допустимы следующие логические операции:
BoolUnite - объединение данного объекта с другим твердым телом.
BoolIntersect - пересечение данного объекта с другим твердым телом.
BoolSubtract - вычитание указанного твердого тела из данного объекта.
 Ссылки
 Teigha.DatabaseServices.Solid3d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!