Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbCurve3d.SetFitData
 Послать отзыв
 Метод пересчитывает сплайн, используя заданные определяющие точки, векторы касательных в начальной и конечной точках.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetFitData( ref Point3dCollection fitPoints, Vector3d startTangent, Vector3d endTangent );
Копировать Код
Public Sub SetFitData( ByRef fitPoints As Point3dCollection, startTangent As Vector3d, endTangent As Vector3d )
 Параметры
 Параметры
 Описание
 fitPoints
 Определяющие точки. Тип Point3dCollection.
 startTangent
 Вектор касательной в начальной точке. Тип Vector3d.
 endTangent
 Вектор касательной в конечной точке. Тип Vector3d.
 Описание
 Метод пересчитывает сплайн, используя заданные определяющие точки, векторы касательных в начальной и конечной точках.
 Используется вызов метода NurbCurve3d.SetFitData(Point3dCollection fitPoints, Vector3d startTangent, Vector3d endTangent, Tolerance fitTolerance) с точностью по умолчанию, равной Tolerance.Global.
 Ссылки
 Teigha.Geometry.NurbCurve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!