Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство TableRegion.IsNull
 Послать отзыв
 This is IsNull, a member of class TableRegion.
 Синтаксис
C#
Visual Basic
public bool IsNull;
Public Property IsNull() As bool
 Ссылки
 TableRegion Класс, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!