Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve2d.GetArea
 Послать отзыв
 Метод вычисляет площадь под кривой с заданной точностью на указанном параметрическом интервале.
 Синтаксис
C#
Visual Basic
Копировать Код
public double GetArea( double startParameter, double endParameter, Tolerance tolerance );
Копировать Код
Public Function GetArea( startParameter As Double, endParameter As Double, tolerance As Tolerance ) As Double
 Параметры
 Параметры
 Описание
 startParameter
 Входное значение параметра для начала интервала. Тип double.
 endParameter
 Входное значение параметра для конца интервала. Должно превышать значение startParameter. Тип double.
 tolerance
 Заданная точность вычисления площади. Тип Tolerance.
 Возвращает
 Возвращает значение площади под кривой на указанном параметрическом интервале. Тип double.
 Описание
 Метод предназначен для вычисления площади под кривой с заданной точностью на параметрическом интервале, который определяется указанными значениями параметра.
 Ссылки
 Teigha.Geometry.Curve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!