Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Filters.SpatialFilter.GetQueryBounds
 Послать отзыв
 Метод не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual Extents3d GetQueryBounds( ref BlockReference blockReference );
Копировать Код
Public Overridable Function GetQueryBounds( ByRef blockReference As BlockReference ) As Extents3d
 Параметры
 Параметры
 Описание
 blockReference
 Вхождение блока. Тип BlockReference.
 Возвращает
 Возвращает ограничивающий бокс. Тип Extents3d.
 Описание
 Метод не реализован.
 Ссылки
 Teigha.DatabaseServices.Filters.SpatialFilter, Teigha.DatabaseServices.Filters
 Ваши комментарии по поводу этого топика: Послать отзыв!