Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ObjectId.ObjectClass
 Послать отзыв
 Свойство предоставляет доступ к RXClass объекта, который ассоциирован с ObjectId, таким образом гарантируя, что результат может быть безопасно разыменован и корректно сравнен с любым классом, производным от DBObject.
 Синтаксис
C#
Visual Basic
Копировать Код
public RXClass ObjectClass;
Копировать Код
Public Property ObjectClass() As RXClass
 Возвращает
 Возвращает тип RXClass.
 Описание
 Свойство предоставляет доступ к RXClass объекта, который ассоциирован с ObjectId, таким образом гарантируя, что результат может быть безопасно разыменован и корректно сравнен с любым классом, производным от DBObject.
 Введение этого свойства имело своей целью упрощение разрабатываемого кода. Необходимость всегда сравнивать результат с NULL отчасти противоречит цели функции.
 Замечания
 Используйте это свойство для получения класса связанного объекта без необходимости открывать и закрывать сам объект.
 Если объект не был считан в память с диска, то будет просканирован образ диска, однако после использования объект останется на диске.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.ObjectId, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!