Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.PlotStyleMode
 Послать отзыв
 Синтаксис
C#
Visual Basic
public bool PlotStyleMode;
Public Property PlotStyleMode() As bool
 Описание
 Возвращает true, если база данных использует цвето-зависимые стили печати и false для именованных стилей печати.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!