Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SectionHeight
 Послать отзыв
 Данное перечисление определяет типы высоты индикатора секущей плоскости выше или ниже линии сечения.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum SectionHeight { HeightAboveSectionLine = 1, HeightBelowSectionLine = 2 }
Копировать Код
Public Enum SectionHeight HeightAboveSectionLine = 1 HeightBelowSectionLine = 2 End Enum
 Члены
 Члены
 Описание
 HeightAboveSectionLine
 Значение: 1. Высота секущей плоскости выше линии сечения.
 HeightBelowSectionLine
 Значение: 2. Высота секущей плоскости ниже линии сечения.
 Описание
 Данное перечисление определяет типы высоты секущей плоскости выше или ниже линии сечения.
 Если типом секущей плоскости является плоскость или граница, возвращаемая высота является высотой индикатора секущей плоскости (или границы). Если типом секущей плоскости является объем, возвращается высота разреза.
 Ваши комментарии по поводу этого топика: Послать отзыв!