Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AbstractViewPE.VisualStyle
 Послать отзыв
 Свойство VisualStyle представляет используемый визуальный стиль.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectId VisualStyle;
Копировать Код
Public Property VisualStyle As ObjectId
 Возвращает
 Возвращает идентификатор объекта визуального стиля. Тип ObjectId.
 Описание
 Свойство VisualStyle представляет используемый визуальный стиль.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.AbstractViewPE, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!