Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Graph.Reset
 Послать отзыв
 Метод предназначен для удаления из данного графа всех узлов, включая узлы циклов, что делает граф пустым.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Reset();
Копировать Код
Public Sub Reset()
 Описание
 Метод предназначен для удаления из данного графа всех узлов, включая узлы циклов, что делает граф пустым. Этот метод вызывается также деструктором класса Graph.
 Ссылки
 Teigha.DatabaseServices.Graph, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!