Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocArrayRectangularParameters.AxesAngle
 Послать отзыв
 Свойство обеспечивает доступ к текущему значению угла между первым рядом и первым столбцом массива.
 Синтаксис
C#
Visual Basic
Копировать Код
public double AxesAngle;
Копировать Код
Public Property AxesAngle() As Double
 Возвращает
 Возвращает угол в радианах между первым рядом и первым столбцом массива. Тип double.
 Описание
 Свойство обеспечивает доступ к текущему значению угла между первым рядом и первым столбцом массива. Угол измеряется в радианах.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.AssocArrayRectangularParameters, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!