Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство RasterImageDef.ColorDepth
 Послать отзыв
 Синтаксис
C#
Visual Basic
public int ColorDepth;
Public Property ColorDepth() As Integer
 Описание
 Возвращает количество битов на точку при отображении исходных данных изображения. Возможные значения 1, 8, 24, 32.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.RasterImageDef, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!