Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Point3dCollection
 Послать отзыв
 Этот класс представляет коллекцию 3D-точек.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Geometry::Point3dCollection
 Синтаксис
C#
Visual Basic
Копировать Код
[DefaultMember("Item"),Wrapper("OdGePoint3dArray")] public class Point3dCollection : DisposableWrapper, System.Collections.IList;
Копировать Код
<DefaultMember("Item"),Wrapper("OdGePoint3dArray")> Public Class Point3dCollection Inherits DisposableWrapper Inherits System.Collections.IList
 Описание
 Этот класс представляет коллекцию 3D-точек.
 Методы
 Конструкторы
 Teigha.Geometry.Point3dCollection
 Имя
 Описание
 Point3dCollection
 Это обзор перегрузок Point3dCollection.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Geometry.Point3dCollection
 Имя
 Описание
 Point3dCollection Методы
 Ниже перечислены методы класса Point3dCollection.
 Point3dCollection Свойства
 Ниже перечислены свойства класса Point3dCollection.
 Ссылки
 Point3dCollection Конструктор, Point3dCollection Методы, Point3dCollection Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!