Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 BlockTableRecord.IsUnloaded
 Послать отзыв
 Признак того, что определение блока выгружено.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsUnloaded { get; set; }
Копировать Код
Public Property IsUnloaded As Boolean
 Возвращает
 Возвращает тип данных bool:
true - данная запись описывает блок, который является внешним, т.е. взят из другого документа, и этот блок был выгружен из настоящего документа.
false - внешний блок не выгружен из настоящего документа.
 Если эти условия не соблюдаются, свойство возвращает false.
 Описание
 Признак того, что определение блока выгружено. Выгрузка определений блоков используется для того, чтобы этот блок можно было потом использовать в других чертежах, как внешний блок.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.BlockTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!