Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Делегат Teigha.DatabaseServices.SystemVariableChangedEventHandler
 Послать отзыв
 This is type Teigha::DatabaseServices::SystemVariableChangedEventHandler.
 Синтаксис
C#
Visual Basic
public delegate SystemVariableChangedEventHandler();
Public Delegate Sub SystemVariableChangedEventHandler()
 Ваши комментарии по поводу этого топика: Послать отзыв!