Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Point3d.MultiplyBy
 Послать отзыв
 Метод возвращает 3D-точку, координаты которой получены умножением координат данной точки на переданное в метод значение.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d MultiplyBy( double value );
Копировать Код
Public Function MultiplyBy( value As Double ) As Point3d
 Параметры
 Параметры
 Описание
 value
 Множитель для координат точки. Тип double.
 Возвращает
 Возвращает 3D-точку в новых координатах. Тип Point3d.
 Описание
 Метод возвращает 3D-точку, координаты которой получены умножением координат данной точки на переданное в метод значение value.
 Ссылки
 Teigha.Geometry.Point3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!