Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Interval.IsSingleton
 Послать отзыв
 Свойство IsSingleton позволяет проверить, не является ли данный интервал синглтоном (вырожденным в точку).
 Возвращает true, если этот интервал ограничен и нижняя граница равна верхней границе в пределах допуска. В противном случае возвращает false.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsSingleton;
Копировать Код
Public ReadOnly Property IsSingleton As Boolean
 Возвращает
 Возвращает true, если интервал ограничен, а его нижняя граница совпадает с верхней в пределах заданной в этом объекте точности определения границ. В противном случае возвращает false.
 Описание
 Свойство IsSingleton позволяет проверить, не является ли данный интервал синглтоном (вырожденным в точку). Вырождение интервала имеет место, если интервал ограничен, и его нижняя граница совпадает с верхней в пределах заданной в этом объекте точности определения границ.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.Interval, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!