Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LinkedTableData.SetCustomData
 Послать отзыв
 Метод позволяет задать пользовательские данные в ячейке, столбце или строке.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetCustomData( int row, int column, ref String key, ref Object value );
Копировать Код
Public Overridable Sub SetCustomData( row As Integer, column As Integer, ByRef key As String, ByRef value As Object )
 Параметры
 Параметры
 Описание
 row
 Индекс строки. Тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 column
 Индекс столбца. Тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице.
 key
 Ключ для пользовательских данных. Тип String.
 value
 Новое значение для пользовательских данных. Тип Object.
 Описание
 Метод позволяет задать пользовательские данные в ячейке, столбце или строке.
 Пользовательские данные хранятся в парах ключ - значение. Чтобы указать ячейку, следует задать допустимые индексы строки и столбца. Чтобы указать строку, следует задать допустимый индекс строки и -1 в качестве индекса столбца. Чтобы указать столбец, следует задать допустимый индекс столбца и -1 в качестве индекса строки.
 Ссылки
 Teigha.DatabaseServices.LinkedTableData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!