Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 BlockTable.BlockTable()
 Послать отзыв
 Констурктор класса.
 Синтаксис
C#
Visual Basic
internal BlockTable(IntPtr unmanagedPointer, bool autoDelete);
Friend Sub New(unmanagedPointer As IntPtr, autoDelete As bool)
 Описание
 Констурктор класса.
 Ссылки
 Teigha.DatabaseServices.BlockTable, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!