Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ObjectSnapModes
 Послать отзыв
 Перечисление ObjectSnapModes определяет режимы объектной привязки.
 Синтаксис
C#
Visual Basic
Копировать Код
[Flags] [Wrapper("OdDb.OsnapMode")] public enum ObjectSnapModes { ModeEnd = 1, ModeMid = 2, ModeCenter = 3, ModeNode = 4, ModeQuad = 5, ModeIntersection = 6, ModeIns = 7, ModePerpendicular = 8, ModeTangent = 9, ModeNear = 10, ModeApparentIntersection = 11, ModeStartpoint = 13 }
Копировать Код
<Flags> <Wrapper("OdDb.OsnapMode")> Public Enum ObjectSnapModes ModeEnd = 1 ModeMid = 2 ModeCenter = 3 ModeNode = 4 ModeQuad = 5 ModeIntersection = 6 ModeIns = 7 ModePerpendicular = 8 ModeTangent = 9 ModeNear = 10 ModeApparentIntersection = 11 ModeStartpoint = 13 End Enum
 Члены
 Члены
 Описание
 ModeCenter
 Значение: 3. Привязка к центру дуги, эллиптической дуги, эллипса или круга.
 ModeEnd
 Значение: 1. Привязка к ближайшей конечной точке или углу геометрического объекта.
 ModeIns
 Значение: 7. Привязка к точке вставки объекта, такого как текст, блок или атрибут.
 ModeMid
 Значение: 2. Привязка к средней точке геометрического объекта.
 ModeNear
 Значение: 10. Привязка к ближайшей точке объекта, например дуги, окружности, эллипса, эллиптической дуги, отрезка, точки как объекта, полилинии, луча, сплайна или прямой.
 ModeNode
 Значение: 4. Привязка к узлу (точке как объекту, определяющей точке размера или начальной точке размерного текста).
 ModePerpendicular
 Значение: 8. Привязка к точке, располагающейся на нормали к выбранному геометрическому объекту.
 ModeQuad
 Значение: 5. Привязка к точке квадранта дуги, эллиптической дуги, эллипса или круга.
 ModeTangent
 Значение: 9. Привязка к точке контакта касательной с дугой, окружностью, эллипсом, эллиптической дугой, дугой полилинии или сплайном.
 ModeIntersection
 Значение: 6. Привязка к пересечению геометрических объектов.
 ModeStartpoint
 Значение: 13. Привязка к ближайшей начальной точке или углу геометрического объекта.
 ModeApparentIntersection
 Значение: 11. Привязка к кажущемуся пересечению двух объектов, которые не пересекаются в 3D пространстве, но на текущем виде выглядят пересекающимися.
 Описание
 Перечисление ObjectSnapModes определяет поддерживаемые режимы объектной привязки.
 Ваши комментарии по поводу этого топика: Послать отзыв!