Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LinkedTableData.GetCustomData
 Послать отзыв
 Метод позволяет получить по ключу пользовательские данные ячейки, столбца или строки.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual Object GetCustomData( int row, int column, ref String key );
Копировать Код
Public Overridable Function GetCustomData( row As Integer, column As Integer, ByRef key As String ) As Object
 Параметры
 Параметры
 Описание
 row
 Индекс строки. Тип int. Индекс может равняться -1.
 column
 Индекс столбца. Тип int. Индекс может равняться -1.
 key
 Ключ пользовательских данных. Тип String.
 Возвращает
 Возвращает пользовательские данные. Тип Object.
 Описание
 Метод позволяет получить по ключу пользовательские данные ячейки, столбца или строки.
 Пользовательские данные хранятся в парах ключ - значение. Чтобы указать ячейку, следует задать допустимые индексы строки и столбца. Чтобы указать строку, следует задать допустимый индекс строки и -1 в качестве индекса столбца. Чтобы указать столбец, следует задать допустимый индекс столбца и -1 в качестве индекса строки.
 Ссылки
 Teigha.DatabaseServices.LinkedTableData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!