Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SweepOptions.Align
 Послать отзыв
 Свойство Align представляет выравнивание вытягиваемого объекта относительно траектории.
 Синтаксис
C#
Visual Basic
Копировать Код
public SweepOptionsAlignOption Align;
Копировать Код
Public ReadOnly Property Align As SweepOptionsAlignOption
 Возвращает
 Возвращает вариант выравнивания относительно траектории. Тип SweepOptionsAlignOption.
 Описание
 Свойство Align представляет выравнивание вытягиваемого объекта относительно траектории.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.SweepOptions, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!