Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.GetBreakSpacing
 Послать отзыв
 Метод предназначен для получения расстояния между фрагментами разбитой на части таблицы.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual double GetBreakSpacing();
Копировать Код
Public virtual Function GetBreakSpacing() As double
 Возвращает
 Возвращает расстояние между фрагментами таблицы, тип double.
 Описание
 Метод предназначен для получения расстояния между фрагментами разбитой на части таблицы.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!