Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.DeleteContent
 Послать отзыв
 Метод предназначен для удаления всего содержимого из ячейки, заданной индексами строки и столбца.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void DeleteContent( int row, int column );
Копировать Код
Public virtual Sub DeleteContent( row As Integer, column As Integer )
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 col
 Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
 Описание
 Метод предназначен для удаления всего содержимого из ячейки, заданной индексами строки и столбца.
 Замечания
 Для получения того же результата предпочтительнее использовать метод Table.Cells[row,column].Contents.Clear.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!