Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.SetFormula
 Послать отзыв
 Метод позволяет задать формулу в элементе содержимого ячейки, который задан индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetFormula( int row, int column, int contentIndex, ref String formula );
Копировать Код
Public virtual Sub SetFormula( row As Integer, column As Integer, contentIndex As Integer, ByRef formula As String )
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 contentIndex
 Индекс элемента содержимого ячейки, тип int. Индекс должен быть больше или равен нулю и меньше количества элементов содержимого в ячейке.
 formula
 Строка с формулой, тип String.
 col
 Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
 Описание
 Метод позволяет задать формулу в элементе содержимого ячейки, который задан индексом.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!