Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.RowHeight
 Послать отзыв
 Метод предназначен для получения высоты конкретной строки таблицы.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual double RowHeight( int row );
Копировать Код
Public virtual Function RowHeight( row As Integer ) As double
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 Возвращает
 Возвращает высоту строки таблицы, тип double.
 Описание
 Метод предназначен для получения высоты строки, указанной её индексом.
 Замечания
 Для получения того же результата предпочтительнее использовать Table.Rows[col].Height.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!