Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.TextRotation
 Послать отзыв
 Метод позволяет получить угол поворота текста в заданной ячейке.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual RotationAngle TextRotation( int row, int col );
Копировать Код
Public virtual Function TextRotation( row As Integer, col As Integer ) As RotationAngle
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 col
 Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
 Возвращает
 Возвращает угол поворота из перечисления RotationAngle.
 Описание
 Метод позволяет получить угол поворота текста в заданной ячейке. Возможные значения угла поворота: Degrees000, Degrees090, Degrees180 и Degrees270.
 Замечания
 Для получения того же результата предпочтительнее использовать метод Table.Cells[row,column].Contents[i].Rotation.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!