Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.RenderGlobal.ProcedureAndDestinationParameter.Destination
 Послать отзыв
 Свойство Destination представляет текущее значение параметра направления вывода рендеринга.
 Синтаксис
C#
Visual Basic
Копировать Код
public Destination Destination;
Копировать Код
Public ReadOnly Property Destination As Destination
 Возвращает
 Возвращает направление вывода рендеринга. Значение из перечисления Destination.
 Описание
 Свойство Destination представляет текущее значение параметра направления вывода рендеринга.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.RenderGlobal.ProcedureAndDestinationParameter, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!