Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.AllowExtendedNames
 Послать отзыв
 Синтаксис
C#
Visual Basic
public bool AllowExtendedNames;
Public Property AllowExtendedNames() As bool
 Описание
 Возвращает или устанавливает признак, равный true, если допустимы расширенные имена.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!