Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Material.TransmittanceScale
 Послать отзыв
 Свойство представляет коэффициент пропускания данного материала.
 Синтаксис
C#
Visual Basic
Копировать Код
public double TransmittanceScale;
Копировать Код
Public Property TransmittanceScale As Double
 Возвращает
 Возвращает коэффициент пропускания материала. Тип double.
 Описание
 Свойство представляет коэффициент пропускания данного материала. Он определяет долю энергии, которая проходит сквозь материал.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Material, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!