Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DataCell.SetHardOwnershipId
 Послать отзыв
 Метод делает эту ячейку владельцем указанного объекта по жесткой ссылке на идентификатор зависимого объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetHardOwnershipId( DatabaseServices.ObjectId value );
Копировать Код
Public Sub SetHardOwnershipId( value As DatabaseServices.ObjectId )
 Параметры
 Параметры
 Описание
 value
 Идентификатор зависимого объекта. Тип DatabaseServices.ObjectId.
 Описание
 Метод наделяет данную ячейку правом жесткого владения указанным объектом value. В ячейке сохраняется идентификатор жесткой ссылки на зависимый объект.
 Ссылки
 Teigha.DatabaseServices.DataCell, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!