Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.BlockTable
 Послать отзыв
 Класс предназначен для хранения определений блоков в базе данных чертежа.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::GraphicsInterface::Drawable Teigha::DatabaseServices::DBObject Teigha::DatabaseServices::SymbolTable Teigha::DatabaseServices::BlockTable
 Синтаксис
C#
Visual Basic
[Wrapper("AcDbBlockTable")] public class BlockTable : SymbolTable, IEnumerable;
<Wrapper("AcDbBlockTable")> Public Class BlockTable Inherits SymbolTable Inherits IEnumerable
 Описание
 Класс предназначен для хранения определений блоков в базе данных чертежа.
 Каждый блок определен записью BlockTableRecord, которая является вхождением коллекции BlockTable (таблицы блоков). В таблицу входят два типа блоков: служебные и пользовательские.
 Служебные блоки создаются платформой для собственных нужд (листы, представления размеров, штриховки и пр.).
 Пользовательские блоки создаются пользователями через интерфейс или с помощью API nanoCAD для повторяющихся фрагментов чертежа.
 Все примитивы чертежа хранятся в таблице блоков: либо в служебных блоках, либо в пользовательских.
 Также у всех блоков есть графическая часть BlockReference, которая ссылается на неграфическую.
 Графическая часть пользовательского блока всегда входит в какой-либо служебный блок, представляющий собой, например, лист документа.
 Примечания
 Этот .NET класс соответствует классу OdDbBlockTable nanoCAD API, который представляет таблицу символов для записи BlockTableRecord, которая представляет определение блока в чертеже базы данных.
 Пример
 В качестве примера работы с таблицей блоков приведена команда BlockTableReading, которая открывает таблицу блоков и перебирает её содержимое, выводя в команданую строку название каждого блока и его тип.
C#
 Копировать Код
public partial class Commands { [Teigha.Runtime.CommandMethod("BlockTableReading")] public void BlockTableUse() { // Получаем ссылки на активный документ HostMgd.ApplicationServices.Document doc = HostMgd.ApplicationServices.Application.DocumentManager.MdiActiveDocument; // Получаем ссылки на редактор докумена HostMgd.EditorInput.Editor ed = doc.Editor; // Получаем ссылки на базу данных документа Teigha.DatabaseServices.Database db = doc.Database; // Начало транзакции с базой данных документа using (Teigha.DatabaseServices.Transaction trans = db.TransactionManager.StartTransaction()) { // Открываем таблицу блоков для чтения Teigha.DatabaseServices.BlockTable blockTable = trans.GetObject(db.BlockTableId, Teigha.DatabaseServices.OpenMode.ForRead) as Teigha.DatabaseServices.BlockTable; // Перебираем таблицу блоков в цикле foreach(Teigha.DatabaseServices.ObjectId btr in blockTable) { // Открываем каждую запись таблицы Teigha.DatabaseServices.BlockTableRecord obj = trans.GetObject(btr, Teigha.DatabaseServices.OpenMode.ForRead) as Teigha.DatabaseServices.BlockTableRecord; // Выводим в командную строку ed.WriteMessage($"\nTable record name and type: {obj.Name} , {obj.GetType()} "); } trans.Abort(); } } }
Visual Basic
 Копировать Код
Public Partial Class Commands <Teigha.Runtime.CommandMethod("BlockTableReading")> Public Sub BlockTableUse() ' Получаем ссылки на активный документ Dim doc As HostMgd.ApplicationServices.Document = HostMgd.ApplicationServices.Application.DocumentManager.MdiActiveDocument ' Получаем ссылки на редактор докумена Dim ed As HostMgd.EditorInput.Editor = doc.Editor ' Получаем ссылки на базу данных документа Dim db As Teigha.DatabaseServices.Database = doc.Database ' Начало транзакции с базой данных документа Using trans As Teigha.DatabaseServices.Transaction = db.TransactionManager.StartTransaction() ' Открываем таблицу блоков для чтения Dim blockTable As Teigha.DatabaseServices.BlockTable = TryCast(trans.GetObject(db.BlockTableId, Teigha.DatabaseServices.OpenMode.ForRead), Teigha.DatabaseServices.BlockTable) ' Перебираем таблицу блоков в цикле For Each btr As Teigha.DatabaseServices.ObjectId In blockTable ' Открываем каждую запись таблицы Dim obj As Teigha.DatabaseServices.BlockTableRecord = TryCast(trans.GetObject(btr, Teigha.DatabaseServices.OpenMode.ForRead), Teigha.DatabaseServices.BlockTableRecord) ' Выводим в командную строку ed.WriteMessage($"\nTable record name and type: {obj.Name} , {obj.[GetType]()} ") Next trans.Abort() End Using End Sub End Class
 На рисунке ниже приведен пример того, как отработала команда BlockTableReading в новом пустом документе, где еще не созданы пользовательские блоки. Соответственно, в перечне можно увидеть только служебные блоки.
 Методы
 Конструкторы
 Teigha.GraphicsInterface.Drawable
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 Drawable
 Конструктор класса Teigha.GraphicsInterface.Drawable. (Унаследован от Drawable)
 Teigha.DatabaseServices.DBObject
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 DBObject
 Конструктор. (Унаследован от DBObject)
 Teigha.DatabaseServices.SymbolTable
 ПоказатьPrivateУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 SymbolTable
 This is SymbolTable, a member of class SymbolTable. (Унаследован от SymbolTable)
 Teigha.DatabaseServices.BlockTable
 ПоказатьInternal
 Нет совпадений по текущему фильтру
 Имя
 Описание
 BlockTable
 Констурктор класса.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.GraphicsInterface.Drawable
 Имя
 Описание
 Drawable Методы
 Ниже перечислены методы класса Drawable.
 Drawable Свойства
 Ниже перечислены свойства класса Drawable.
 Teigha.DatabaseServices.DBObject
 Имя
 Описание
 DBObject Методы
 Ниже перечислены методы класса DBObject.
 DBObject Свойства
 Ниже перечислены свойства класса DBObject.
 DBObject События
 Ниже перечислены события класса DBObject.
 Teigha.DatabaseServices.SymbolTable
 Имя
 Описание
 SymbolTable Методы
 Ниже перечислены методы класса SymbolTable.
 SymbolTable Свойства
 Ниже перечислены свойства класса SymbolTable.
 Ссылки
 Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства, DBObject События
 Ваши комментарии по поводу этого топика: Послать отзыв!