Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.LineSegment2d.Set
 Послать отзыв
 Метод позволяет переопределить начальную точку и вектор данного линейного сегмента.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Set( Point2d point, Vector2d vector );
Копировать Код
Public Sub Set( point As Point2d, vector As Vector2d )
 Параметры
 Параметры
 Описание
 point
 Новая начальная точка. Тип Point2d.
 vector
 Новый направляющий вектор. Тип Vector2d. Определяет направление линейного сегмента и его конечную точку.
 Описание
 Метод позволяет переопределить начальную точку и вектор данного линейного сегмента.
 Ссылки
 Teigha.Geometry.LineSegment2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!