Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.OsnapPointRef
 Послать отзыв
 Класс OsnapPointRef позволяет использовать объектную привязку для получения данных о связанной с размером геометрии.
 Иерархия классов
Teigha::DatabaseServices::OsnapPointRef
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdDbOsnapPointRef")] public class OsnapPointRef : PointRef
Копировать Код
<Wrapper("OdDbOsnapPointRef")> Public Class OsnapPointRef Inherits PointRef
 Описание
 Класс OsnapPointRef позволяет использовать объектную привязку для получения данных о связанной с размером геометрии.
 Методы
 Конструкторы
 Имя
 Описание
 OsnapPointRef
 Это обзор перегрузок OsnapPointRef.
 Топики
 Имя
 Описание
 OsnapPointRef Методы
 Ниже перечислены методы класса OsnapPointRef.
 OsnapPointRef Свойства
 Ниже перечислены свойства класса OsnapPointRef.
 Ссылки
 OsnapPointRef Конструктор, OsnapPointRef Методы, OsnapPointRef Свойства, Методы, Топики, OsnapPointRef Методы, OsnapPointRef Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!