Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Entity.Color
 Послать отзыв
 Свойство предназначено для установки или получения полной информации о цвете геометрического объекта с использованием экземпляра класса Teigha.Colors.Color.
 Синтаксис
C#
Visual Basic
Копировать Код
public Teigha.Colors.Color Color;
Копировать Код
Public Property Color() As Teigha.Colors.Color
 Возвращает
 Возвращает экземпляр класса Teigha.Colors.Color, представляющий полную информацию о цвете геометрического объекта, включая его тип, индекс и другие параметры, определяющие визуальное отображение цвета в чертеже.
 Описание
 Устанавливает или возвращает полную информацию о цвете для геометрического объекта в экземпляре Color.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Entity, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!