Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Filters.IndexUpdateData.GetIdDataPtr
 Послать отзыв
 Метод позволяет получить указатель IntPtr на данные, связанные с переданным идентификатором объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public IntPtr GetIdDataPtr( ObjectId id );
Копировать Код
Public Function GetIdDataPtr( id As ObjectId ) As IntPtr
 Параметры
 Параметры
 Описание
 id
 Входной идентификатор объекта. Тип ObjectId.
 Возвращает
 Возвращает указатель на связанные данные. Тип IntPtr.
 Описание
 Метод позволяет получить указатель IntPtr на данные, связанные с переданным идентификатором объекта ObjectId.
 Ссылки
 Teigha.DatabaseServices.Filters.IndexUpdateData, Teigha.DatabaseServices.Filters
 Ваши комментарии по поводу этого топика: Послать отзыв!