Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocDependency.GetFirstDependencyOnObject
 Послать отзыв
 Метод позволяет получить первую зависимость у заданного объекта DBObject.
 Синтаксис
C#
Visual Basic
Копировать Код
public Teigha.DatabaseServices.ObjectId GetFirstDependencyOnObject( ref DBObject dbObj );
Копировать Код
Public Function GetFirstDependencyOnObject( ByRef dbObj As DBObject ) As Teigha.DatabaseServices.ObjectId
 Параметры
 Параметры
 Описание
 dbObj
 Идентификатор объекта, из которого извлекается зависимость. Тип DBObject. Объект должен быть открыт как минимум для чтения.
 Возвращает
 Возвращает первую зависимость от объекта DBObject или ObjectId.Null, если у DBObject отсутствуют прикрепленные зависимости. Тип Teigha.DatabaseServices.ObjectId.
 Описание
 Метод позволяет получить первую зависимость у данного объекта DBObject. Зависимости прикрепляются к объектам DBObject в виде постоянных реакторов и упорядочиваются в рамках объекта на основе значений их свойства Order. Возвращается первая зависимость в этом упорядоченном списке.
 Ссылки
 Teigha.DatabaseServices.AssocDependency, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!