Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector3dCollectionEnumerator.Current
 Послать отзыв
 Свойство Current представляет текущий элемент перечислителя.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual Object Current;
Копировать Код
Public Overridable ReadOnly Property Current As Object
 Возвращает
 Возвращает текущий элемент перечислителя. Тип Object.
 Описание
 Свойство Current представляет текущий элемент перечислителя.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.Vector3dCollectionEnumerator, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!