Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DataTable.SetRowAt
 Послать отзыв
 Метод позволяет задать (или заменить) данные строки с указанным индексом. Дополнительно метод позволяет выполнить проверки предоставленных данных на соответствие структуре таблицы.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetRowAt( int index, ref DataCellCollection row, bool validate );
Копировать Код
Public Sub SetRowAt( index As Integer, ByRef row As DataCellCollection, validate As Boolean )
 Параметры
 Параметры
 Описание
 index
 Индекс строки. Тип int. В случае недействительного индекса выбрасывается исключение Teigha.Runtime.ErrorStatus.eInvalidInput.
 row
 Коллекция ячеек для строки. Тип DataCellCollection.
 validate
 Флаг проверок. Тип bool. Если данные в не проходят проверку, выбрасывается исключение Teigha.Runtime.ErrorStatus.eInvalidInput.
 Описание
 Метод позволяет задать (или заменить) данные строки с указанным индексом.
 Параметр validate определяет, следует ли выполнять проверки при добавлении строки. Если validate имеет значение true, то метод проверяет соответствие типа каждой ячейки типу соответствующего столбца, а также совпадение количества столбцов в строке и количества столбцов в таблице.
 Ссылки
 Teigha.DatabaseServices.DataTable, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!