Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocArray.EntityId
 Послать отзыв
 Свойство предоставляет идентификатор ObjectId ассоциативного массива.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectId EntityId;
Копировать Код
Public Property EntityId() As ObjectId
 Возвращает
 Возвращает ObjectId ассоциативного массива.
 Описание
 Свойство предоставляет идентификатор ObjectId ассоциативного массива.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.AssocArray, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!