Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MText.BackgroundScaleFactor
 Послать отзыв
 Свойство представляет масштабный коэффициент для фона данного объекта MText.
 Синтаксис
C#
Visual Basic
Копировать Код
public double BackgroundScaleFactor;
Копировать Код
Public Property BackgroundScaleFactor As Double
 Возвращает
 Возвращает масштабный коэффициент. Тип double.
 Описание
 Свойство представляет масштабный коэффициент для фона данного объекта MText.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MText, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!