Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.Suffix
 Послать отзыв
 Свойство задает или возвращает суффикс размерного текста.
 Синтаксис
C#
Visual Basic
Копировать Код
public String Suffix;
Копировать Код
Public Property Suffix As String
 Возвращает
 Возвращает суффикс размерного текста. Тип String.
 Описание
 Свойство задает или возвращает суффикс размерного текста при использовании основных единиц измерения.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!