Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DimAssoc.DimObjId
 Послать отзыв
 Свойство DimObjId предоставляет доступ к ObjectId размера, управляемого данным объектом.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.ObjectId DimObjId;
Копировать Код
Public Property DimObjId As DatabaseServices.ObjectId
 Возвращает
 Возвращает идентификатор объекта ассоциативного размера. Тип DatabaseServices.ObjectId.
 Описание
 Свойство DimObjId предоставляет доступ к ObjectId размера, управляемого данным объектом.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.DimAssoc, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!