Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.SurfaceSurfaceIntersectorConfigurations.IsEqualTo
 Послать отзыв
 Метод проверяет равенство данного объекта другой конфигурации пересечения.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsEqualTo( SurfaceSurfaceIntersectorConfigurations a );
Копировать Код
Public Function IsEqualTo( a As SurfaceSurfaceIntersectorConfigurations ) As Boolean
 Параметры
 Параметры
 Описание
 a
 Входная конфигурация пересечения двух поверхностей, с которой сравнивается данный объект. Тип SurfaceSurfaceIntersectorConfigurations.
 Возвращает
 Возвращает true, если выполняется условие равенства двух конфигураций пересечения поверхностей. В противном случае возвращает false.
 Описание
 Метод проверяет равенство данного объекта другой конфигурации пересечения.
 Замечания
 Условием равенства двух конфигураций пересечения является одновременное выполнение следующих условий:
Конфигурации для первых поверхностей слева от пересечений равны;
Конфигурации для первых поверхностей справа от пересечений равны;
Конфигурации для вторых поверхностей слева от пересечений равны;
Конфигурации для вторых поверхностей справа от пересечений равны;
Типы пересечений совпадают;
Размерности объектов пересечений совпадают.
 Ссылки
 Teigha.Geometry.SurfaceSurfaceIntersectorConfigurations, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!