Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LayoutManager.AbortLayoutCopied
 Послать отзыв
 Cобытие создается, когда прерывается копирование листа.
 Синтаксис
C#
Visual Basic
Копировать Код
public event LayoutEventHandler AbortLayoutCopied;
Копировать Код
Public Event AbortLayoutCopied As LayoutEventHandler
 Описание
 Cобытие создается, когда прерывается копирование листа.
 Ссылки
 Teigha.DatabaseServices.LayoutManager, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!