Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FormattedTableData.SetAlignment
 Послать отзыв
 Метод позволяет задать выравнивание содержимому заданной ячейки.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetAlignment( int row, int column, CellAlignment value );
Копировать Код
Public Overridable Sub SetAlignment( row As Integer, column As Integer, value As CellAlignment )
 Параметры
 Параметры
 Описание
 row
 Индекс строки. Тип int. Должен быть неотрицательным и меньше количества строк в таблице.
 column
 Индекс столбца. Тип int. Должен быть неотрицательным и меньше количества столбцов в таблице.
 value
 Тип выравнивания как значение из перечисления CellAlignment.
 Описание
 Метод позволяет задать выравнивание содержимому заданной ячейки.
 Ссылки
 Teigha.DatabaseServices.FormattedTableData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!