Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Filters.LayerFilter.GetAt
 Послать отзыв
 Метод позволяет получить имя слоя по индексу слоя в данном объекте LayerFilter.
 Синтаксис
C#
Visual Basic
Копировать Код
public void GetAt( int index, ref String name );
Копировать Код
Public Sub GetAt( index As Integer, ByRef name As String )
 Параметры
 Параметры
 Описание
 index
 Индекс искомого слоя. Тип int.
 name
 Имя слоя, который в данном фильтре имеет индекс index. Тип String.
 Описание
 Метод позволяет получить имя слоя name по индексу слоя в данном объекте LayerFilter.
 Ссылки
 Teigha.DatabaseServices.Filters.LayerFilter, Teigha.DatabaseServices.Filters
 Ваши комментарии по поводу этого топика: Послать отзыв!