Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Skpoly
 Послать отзыв
 Синтаксис
C#
Visual Basic
public bool Skpoly;
Public Property Skpoly() As bool
 Описание
 Обеспечивает доступ к текущему значению SKPOLY для базы данных. Значение false соответствует 0. Значение true — 1.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!