Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.SplineEntity2d.GetControlPointAt
 Послать отзыв
 Метод находит в массиве управляющих вершин конкретную вершину с указанным индексом. В текущей версии не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point2d GetControlPointAt( int index );
Копировать Код
Public Function GetControlPointAt( index As Integer ) As Point2d
 Параметры
 Параметры
 Описание
 index
 Индекс управляющей вершины сплайна. Тип int.
 Возвращает
 Возвращает положение управляющей вершины с индексом index. Тип Point2d.
 Описание
 Метод находит в массиве управляющих вершин конкретную вершину с индексом index.
 Замечания
 В текущей версии этот метод не реализован.
 Ссылки
 Teigha.Geometry.SplineEntity2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!