Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DynamicDimensionDataCollection.DynamicDimensionDataCollection
 Послать отзыв
 Конструктор класса по умолчанию.
 Синтаксис
C#
Visual Basic
Копировать Код
public DynamicDimensionDataCollection();
Копировать Код
Public Sub New()
 Описание
 Конструктор класса по умолчанию.
 Ссылки
 Teigha.DatabaseServices.DynamicDimensionDataCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!