Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CubicSplineCurve3d.Create
 Послать отзыв
 Метод создает объект CubicSplineCurve3d на основе переданного указателя.
 Синтаксис
C#
Visual Basic
Копировать Код
public static CubicSplineCurve3d Create( IntPtr unmanagedPointer, bool autoDelete );
Копировать Код
Public Shared Function Create( unmanagedPointer As IntPtr, autoDelete As Boolean ) As CubicSplineCurve3d
 Параметры
 Параметры
 Описание
 unmanagedPointer
 Неуправляемый указатель на исходный объект. Тип IntPtr.
 autoDelete
 Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.
 Возвращает
 Возвращает созданный трехмерный кубический сплайн. Тип CubicSplineCurve3d.
 Описание
 Метод создает объект CubicSplineCurve3d на основе переданного указателя.
 Ссылки
 Teigha.Geometry.CubicSplineCurve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!