Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SecurityParameters.Equals
 Послать отзыв
 Метод предназначен для проверки объектов на равенство.
 Синтаксис
C#
Visual Basic
Копировать Код
public sealed override bool Equals( ref Object obj );
Копировать Код
Public NotOverridable Overrides Function Equals( ByRef obj As Object ) As Boolean
 Параметры
 Параметры
 Описание
 obj
 Объект, проверяемый на равенство данному объекту. Тип Object.
 Возвращает
 Возвращает true, если объекты совпадают, и оба не равны null. В противном случае возвращает false.
 Описание
 Метод предназначен для проверки объектов на равенство.
 Замечания
 Переопределение методов Equals и GetHashCode должно выполняться совместно, чтобы не нарушать логику - если Equals возвращает true, хеш-коды сравниваемых объектов обязаны совпадать. Обратное не гарантируется - совпадение хэш-кодов не всегда означает совпадение объектов вследствие возможных коллизий. Хеш-коды следует формировать для полей, на которых основано равенство сравниваемых объектов.
 Иногда используется метод Equals() из объекта C++, но поскольку сравниваются указатели, вы по-прежнему можете использовать данный GetHashCode(), в то время как метод Equals() может быть переопределен в производном классе.
 Ссылки
 Teigha.DatabaseServices.SecurityParameters, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!