Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Leader.Annotation
 Послать отзыв
 Синтаксис
C#
Visual Basic
public DatabaseServices::ObjectId Annotation;
Public Property Annotation() As DatabaseServices.ObjectId
 Описание
 Устанавливает или возвращает Id аннотации выноски.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Leader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!