Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbSurfaceDefinition.PropertiesInV
 Послать отзыв
 Свойство PropertiesInV представляет значение NurbSurfaceProperties как свойство поверхности в направлении V.
 Синтаксис
C#
Visual Basic
Копировать Код
public int PropertiesInV;
Копировать Код
Public ReadOnly Property PropertiesInV As Integer
 Возвращает
 Возвращает значение NurbSurfaceProperties как свойство поверхности в направлении V. Тип int.
 Описание
 Свойство PropertiesInV представляет значение NurbSurfaceProperties как свойство поверхности в направлении V.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.NurbSurfaceDefinition, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!