Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FieldEvaluator.Format
 Послать отзыв
 Метод предоставляет вычисленное значение поля в виде строки.
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract String Format( ref Field pField );
Копировать Код
Public MustOverride Function Format( ByRef pField As Field ) As String
 Параметры
 Параметры
 Описание
 pField
 Поле, значение которого должно быть отформатировано. Тип Field.
 Возвращает
 Возвращает строковое представление вычисленного значения поля. Тип String.
 Описание
 Фреймворк поля вызывает этот метод, когда у поля запрашивается вычисленное значение поля в строковом представлении.
 Замечания
 Вычислитель может реализовать этот метод для поддержки пользовательского форматирования значений полей. В отсутствие такой реализации стандартные типы данных форматируются с использованием форматов по умолчанию.
 Ссылки
 Teigha.DatabaseServices.FieldEvaluator, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!