Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Spline.FitData
 Послать отзыв
 Свойство FitData представляет данные подгонки этого сплайна.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.FitData FitData;
Копировать Код
Public Property FitData As DatabaseServices.FitData
 Возвращает
 Возвращает данные подгонки в виде объекта DatabaseServices.FitData.
 Описание
 Свойство FitData представляет данные подгонки этого сплайна. Возвращаемые данные содержат все определяющие точки сплайна (в координатах WCS), допуск аппроксимации и касательные на концах сплайна, если они определены.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Spline, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!