Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ObjectIdCollection.Insert
 Послать отзыв
 Метод позволяет вставить указанный идентификатор объекта в коллекцию по указанному индексу.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Insert( int index, ObjectId value );
Копировать Код
Public Sub Insert( index As Integer, value As ObjectId )
 Параметры
 Параметры
 Описание
 index
 Индекс позиции добавляемого элемента. Тип int.
 value
 Добавляемый идентификатор объекта. Тип ObjectId.
 Описание
 Метод позволяет вставить указанный идентификатор объекта в коллекцию по указанному индексу. Этот метод выбрасывает исключение ArgumentOutOfRangeException, если предоставленный индекс недействителен.
 Ссылки
 Teigha.DatabaseServices.ObjectIdCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!