Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ArcDimension.ArcSymbolType
 Послать отзыв
 Свойство предоставляет доступ к типу символа дуги в размерном тексте размера.
 Синтаксис
C#
Visual Basic
Копировать Код
public int ArcSymbolType;
Копировать Код
Public Property ArcSymbolType() As Integer
 Возвращает
 Возвращает код символа дуги, int.
 Описание
 Свойство обеспечивает доступ к типу символа дуги в размерном тексте размера.
 Значение
 Описание
 0
 Символ дуги предшествует тексту.
 1
 Символ дуги находится над текстом.
 2
 Символ дуги не используется.
 Изменение этого значения переопределяет установку, предписанную размерным стилем.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.ArcDimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!