Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbSurface.IsPeriodicInU
 Послать отзыв
 Свойство IsPeriodicInU позволяет проверить, является ли данная поверхность периодической в направлении U.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsPeriodicInU;
Копировать Код
Public ReadOnly Property IsPeriodicInU As Boolean
 Возвращает
 Возвращает true, если поверхность является периодической в направлении U. В противном случае возвращает false.
 Описание
 Свойство IsPeriodicInU позволяет проверить, является ли данная поверхность периодической в направлении U.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.NurbSurface, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!