Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GripData.DrawType
 Послать отзыв
 Данное перечисление определяет типы отрисовки ручек.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum DrawType { WarmGrip = 0, HoverGrip = 1, HotGrip = 2, DragImageGrip = 3 }
Копировать Код
Public Enum DrawType WarmGrip = 0 HoverGrip = 1 HotGrip = 2 DragImageGrip = 3 End Enum
 Члены
 Члены
 Описание
 WarmGrip
 Значение: 0. Подсвеченная ручка.
 HoverGrip
 Значение: 1. Ручка в состоянии, когда на нее наведен курсор мыши.
 HotGrip
 Значение: 2. Активная ручка.
 DragImageGrip
 Значение: 3. Описание
 Описание
 Данное перечисление определяет типы отрисовки ручек.
 Ваши комментарии по поводу этого топика: Послать отзыв!