Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Hatch.EvaluateGradientColorAt
 Послать отзыв
 Синтаксис
C#
Visual Basic
public Teigha::Colors::Color EvaluateGradientColorAt(float value);
Public Function EvaluateGradientColorAt(value As float) As Teigha.Colors.Color
 Параметры
 Параметры
 Описание
 value
 Нормализованная величина [0.0...1.0], по которой вычисляется величина градиента цвета
 Описание
 Метод обеспечивает способ для вычисления вставляемого цвета с учетом заданного определения градиента и цвета, который вычисляется как определенное значение вдоль изменения градиента. Возвращает градиент цвета, вычисленный в указанном диапазоне. Этот диапазон задается параметром метода.
 Ссылки
 Teigha.DatabaseServices.Hatch, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!