Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObject.DowngradeToNotify(bool)
 Послать отзыв
 Метод понижает уровень доступа к этому объекту с ForNotify и ForWrite до наличия только одного открытого режима - ForNotify. В настоящее время не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public void DowngradeToNotify(bool wasWritable);
Копировать Код
Public Sub DowngradeToNotify(wasWritable As bool)
 Параметры
 Параметры
 Описание
 wasWritable
 Признак, указывающий, был ли объект открыт на запись в момент вызова upgradeFromNotify
 Описание
 Восстанавливает объект, открытый и в режиме OpenMode.ForNotify , и в режиме OpenMode.ForWrite, чтобы он был открыт только в режиме OpenMode.ForNotify. Значение параметра wasWritable возвращается из соответствующего вызова DBObject.upgradeFromNotify() для восстановления надлежащего статуса открытия.
 Эта функция должна предшествовать вызову upgradeFromNotify().
 Ссылки
 Teigha.DatabaseServices.DBObject, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!