Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Событие Database.ObjectReappended
 Послать отзыв
 Синтаксис
C#
Visual Basic
public event ObjectEventHandler ObjectReappended;
Public Event ObjectReappended As ObjectEventHandler
 Описание
 Событие возникает, если добавление объекта в базу данных было отменено по команде Undo, и объект повторно добавляется к базе данных при выполнении команды REDO nanoCAD.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!