Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.EllipticalCone.EllipticalCone
 Послать отзыв
 Конструктор класса EllipticalCone. Создает экземпляр класса с указанными косинусом и синусом половинного угла, точкой начала координат, малым и большим радиусами и направляющим вектором оси конуса.
 Синтаксис
C#
Visual Basic
Копировать Код
public EllipticalCone( double cosineAngle, double sineAngle, Point3d baseOrigin, double minorRadius, double majorRadius, Vector3d axisOfSymmetry );
Копировать Код
Public Sub New( cosineAngle As Double, sineAngle As Double, baseOrigin As Point3d, minorRadius As Double, majorRadius As Double, axisOfSymmetry As Vector3d )
 Параметры
 Параметры
 Описание
 cosineAngle
 Косинус половинного угла. Тип double.
 sineAngle
 Синус половинного угла. Тип double.
 baseOrigin
 Начало координат в основании конуса. Тип Point3d.
 minorRadius
 Малый радиус эллиптического конуса. Тип double.
 majorRadius
 Большой радиус эллиптического конуса. Тип double.
 axisOfSymmetry
 Направляющий вектор оси (симметрии) конуса. Тип Vector3d.
 Описание
 Конструктор класса EllipticalCone. Создает экземпляр класса с указанными косинусом и синусом половинного угла, точкой начала координат, малым и большим радиусами и направляющим вектором оси (симметрии) конуса.
 Ссылки
 Teigha.Geometry.EllipticalCone, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!