Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 DimStyleTableRecord.Dimtoh
 Послать отзыв
 Свойство отвечает за настройку ориентации размерного текста вне выносных линий.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual bool Dimtoh { get; set; }
Копировать Код
Public Overridable Property Dimtoh As Boolean
 Возвращает
 Возвращает тип данных bool.
 Описание
 В свойстве хранится текущая настройка ориентации размерного текста, который находится вне выносных линий. В качестве значения свойства доступны следующие:
false – выравнивание по линии измерения;
true – горизонтально (по умолчанию).
 Свойство также доступно через системную переменную DIMTOH и пользовательское меню в окне изменения/создания размерного стиля:
  При изменении системной переменной DIMTOH будет создан новый размерный стиль под названием <переопределение> на основе текущего с новым значением DIMTOH.
 Условия
 Чтение и запись.
 Пример
 Пример изменения настройки ориентации размерного текста вне выносных линий (значения свойства Dimtoh) в размерном стиле Standard:
C#
 Копировать Код
public partial class Commands { [Teigha.Runtime.CommandMethod("DimtohChange")] public void DimtohStandardDimStyle() { // Получение ссылки на активный документ HostMgd.ApplicationServices.Document doc = HostMgd.ApplicationServices.Application.DocumentManager.MdiActiveDocument; // Получение ссылки на редактор документа HostMgd.EditorInput.Editor ed = doc.Editor; // Получение ссылки на базу данных документа Teigha.DatabaseServices.Database db = doc.Database; // Начало транзакции с базой данных документа using (Teigha.DatabaseServices.Transaction trans = db.TransactionManager.StartTransaction()) { // Открываем таблицу размерных стилей для чтения Teigha.DatabaseServices.DimStyleTable dimStyleTable = trans.GetObject(db.DimStyleTableId, Teigha.DatabaseServices.OpenMode.ForRead) as Teigha.DatabaseServices.DimStyleTable; // Находим в таблице размерных стилей ObjectId нужного стиля по его названию Teigha.DatabaseServices.ObjectId styleId = dimStyleTable["Standard"]; // Открываем таблицу размерного стиля для изменений Teigha.DatabaseServices.DimStyleTableRecord obj = trans.GetObject(styleId, Teigha.DatabaseServices.OpenMode.ForWrite) as Teigha.DatabaseServices.DimStyleTableRecord; ed.WriteMessage($"nDimtoh before: {obj.Dimtoh}"); // Изменяем выравнивание размерного текста obj.Dimtoh = false; ed.WriteMessage($"nDimtoh after: {obj.Dimtoh}"); trans.Commit(); } } }
 Результат работы команды DimtohChange:
 Было:
 Стало:
 Ссылки
 Teigha.DatabaseServices.DimStyleTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!