Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Curve.StartParam
 Послать отзыв
 Обеспечивает доступ к значению параметра для начальной точки кривой.
 Синтаксис
C#
Visual Basic
Копировать Код
public double StartParam;
Копировать Код
Public Property StartParam() As double
 Возвращает
 Возвращает значение double параметра для начальной точки кривой.
 Описание
 Обеспечивает доступ к значению параметра для начальной точки кривой.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Curve, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!