Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve2dCollection.Curve2dCollection
 Послать отзыв
 Конструктор по умолчанию класса Curve2dCollection.
 Синтаксис
C#
Visual Basic
Копировать Код
public Curve2dCollection();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса Curve2dCollection.
 Ссылки
 Teigha.Geometry.Curve2dCollection, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!