Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocDependency.AttachToObject
 Послать отзыв
 Метод позволяет прикрепить данную зависимость к одному или нескольким объектам в качестве постоянного реактора.
 Синтаксис
C#
Visual Basic
Копировать Код
public void AttachToObject( ref CompoundObjectId compoundId );
Копировать Код
Public Sub AttachToObject( ByRef compoundId As CompoundObjectId )
 Параметры
 Параметры
 Описание
 compoundId
 Объекты базы данных, к которым прикрепляется данная зависимость. Тип CompoundObjectId.
 Описание
 Метод позволяет прикрепить данную зависимость к указанному объекту compoundId в качестве постоянного реактора. Когда CompoundObjectId представляет составной объект (т.е. CompoundObjectId содержит несколько идентификаторов ObjectId), зависимость прикрепляется в качестве постоянного реактора ко всем объектам, на которые ссылается CompoundObjectId. Позиция зависимости в списке зависимостей объекта корректно учитывает порядок этих зависимостей.
 Прикрепляемая зависимость в данный момент не должна быть прикрепленной ни к какому объекту.
 Замечания
 Поскольку объект может отказаться от прикрепленных к нему зависимостей, клиентский код должен проверять возвращаемый статус ошибки, не предполагая, что он всегда OK.
 Ссылки
 Teigha.DatabaseServices.AssocDependency, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!