Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FieldEvaluatorLoader.FindEvaluator
 Послать отзыв
 Метод предоставляет вычислитель для поля, у которого не задан идентификатор вычислителя.
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract FieldEvaluator FindEvaluator( ref Field pField, ref String pszEvalId );
Копировать Код
Public MustOverride Function FindEvaluator( ByRef pField As Field, ByRef pszEvalId As String ) As FieldEvaluator
 Параметры
 Параметры
 Описание
 pField
 Поле, для которого требуется найти вычислитель. Тип Field.
 pszEvalId
 Найденный идентификатор вычислителя. Тип String.
 Возвращает
 Возвращает вычислитель, найденный для поля pField. Тип FieldEvaluator.
 Описание
 Метод предоставляет вычислитель для поля, у которого не задан идентификатор вычислителя.
 Ссылки
 Teigha.DatabaseServices.FieldEvaluatorLoader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!