Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ApplicationLoadReasons
 Послать отзыв
 Этот перечисляемый тип описывает причины для загрузки приложения.
 Синтаксис
C#
Visual Basic
Копировать Код
[Flags] public enum ApplicationLoadReasons { OnProxyDetection = 1, OnAutoCADStartup = 2, OnCommandInvocation = 4, OnLoadRequest = 8, LoadDisabled = 16, TransparentlyLoadable = 32 }
Копировать Код
<Flags> Public Enum ApplicationLoadReasons OnProxyDetection = 1 OnAutoCADStartup = 2 OnCommandInvocation = 4 OnLoadRequest = 8 LoadDisabled = 16 TransparentlyLoadable = 32 End Enum
 Члены
 Члены
 Описание
 OnProxyDetection
 Загружать приложение, когда управляемые им объекты пользовательских классов загружаются через открытие чертежа, dxfin, вставку и т.д.
 OnAutoCADStartup
 Загружать .NET приложение при старте nanoCAD.
 OnCommandInvocation
 Загружать приложение .NET при каждом выполнении неизвестной команды, для которой имеется запись в реестре.
 OnLoadRequest
 Разрешить загрузку приложения .NET.
 LoadDisabled
 Не требовать загрузку приложения .NET ни по какой причине.
 TransparentlyLoadable
 Приложение .NET должно загружаться прозрачно.
 Описание
 Этот перечисляемый тип описывает причины для загрузки приложения.
 Ваши комментарии по поводу этого топика: Послать отзыв!