Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.IsEmpty
 Послать отзыв
 Метод позволяет определить, является ли содержимое указанной ячейки пустым.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual bool IsEmpty( int row, int column );
Копировать Код
Public virtual Function IsEmpty( row As Integer, column As Integer ) As Boolean
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 col
 Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
 Возвращает
 Возвращает true, если ячейка пуста, и false, если нет.
 Описание
 Метод позволяет определить, является ли содержимое указанной ячейки пустым.
 Замечания
 Для получения того же результата предпочтительнее использовать Table.Cells[row,column].IsEmpty.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!