Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Database.SetWorldPaperspaceUcsBaseOrigin
 Послать отзыв
 Синтаксис
C#
Visual Basic
public void SetWorldPaperspaceUcsBaseOrigin(Point3d origin, OrthographicView orthoView);
Public Sub SetWorldPaperspaceUcsBaseOrigin(origin As Point3d, orthoView As OrthographicView)
 Параметры
 Параметры
 Описание
 origin
 Новая начальная точка в мировых координатах
 orthoView
 Вид, для которого задается начальная точка
 Описание
 Этот метод задает точку в пространстве листа, определяющую новую точку начала пользовательских координат (UCS) для вида, определенного в orthoView. orthoView может быть любым элементом из перечисления OrthographicView.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!