Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Polyline.Closed
 Послать отзыв
 Синтаксис
C#
Visual Basic
public bool Closed;
Public Property Closed() As bool
 Описание
 Обеспечивает доступ к признаку того, является ли полилиния замкнутой (т.е. что есть сегмент от последней вершины к первой) или нет.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Polyline, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!