Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Entity.CloneMeForDragging
 Послать отзыв
 Свойство предназначено для определения, разрешено ли создание клона геометрического объекта для использования его в операции перетаскивания.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool CloneMeForDragging;
Копировать Код
Public Property CloneMeForDragging() As bool
 Возвращает
 Возвращает значение типа bool, где true означает, что для объекта может быть создан клон при операции перетаскивания, а false — что такая операция будет выполняться непосредственно над исходным объектом (например, в случае сложных объектов с большим объемом данных, таких как полилинии).
 Описание
 Свойство определяет признак того, может ли клон быть создан для использования в операции перетаскивания. nanoCAD создает клон для этой операции, за исключением геометрических объектов с большим количеством данных (например, полилинии). Для таких типов объектов операция перетаскивания производится над исходными объектами.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.Entity, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!