Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Ucsname
 Послать отзыв
 Синтаксис
C#
Visual Basic
public DatabaseServices::ObjectId Ucsname;
Public Property Ucsname() As DatabaseServices.ObjectId
 Описание
 Возвращает Id записи таблицы UCS, которая в данный момент используется в пространстве модели базы данных; это значение переменной пространства модели UCSNAME.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!