Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve3d.IsCoplanarWith
 Послать отзыв
 Метод проверяет, является ли переданная в метод кривая компланарной данной кривой. В случае компланарности обеих кривых метод возвращает их общую плоскость.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsCoplanarWith( ref Curve3d curve3d, out Plane plane );
Копировать Код
Public Function IsCoplanarWith( ByRef curve3d As Curve3d, plane As out Plane ) As Boolean
 Параметры
 Параметры
 Описание
 curve3d
 Произвольная 3D-кривая, компланарность с которой требуется проверить. Тип Curve3d.
 plane
 Плоскость, в которой располгаются обе кривые в случае их компланарности. Тип Plane.
 Возвращает
 Возвращает true в случае компланарности кривых, в противном случае возвращает false.
 Описание
 Метод проверяет, является ли переданная в метод кривая компланарной данной кривой. В случае компланарности обеих кривых метод возвращает их общую плоскость.
 Реализация метода использует вызов Curve3d.IsCoplanarWith(ref Curve3d curve3d, out Plane plane, Tolerance tolerance) со значением точности, равным Tolerance.Global.
 Замечания
 Возвращаемое значение plane действительно только в том случае, когда метод возврашает true.
 Ссылки
 Teigha.Geometry.Curve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!