Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SweptSurface.CreateSweptSurface
 Послать отзыв
 Метод предназначен для создания поверхности вытягиванием указанного объекта по заданной траектории с учетом переданных опций
 Синтаксис
C#
Visual Basic
Копировать Код
public void CreateSweptSurface( ref Entity sweepEnt, ref Entity pathEnt, ref DatabaseServices.SweepOptions sweepOptions );
Копировать Код
Public Sub CreateSweptSurface( ByRef sweepEnt As Entity, ByRef pathEnt As Entity, ByRef sweepOptions As DatabaseServices.SweepOptions )
 Параметры
 Параметры
 Описание
 sweepEnt
 Объект, вытягиваемый по траектории. Тип Entity.
 pathEnt
 Объект траектории. Тип Entity.
 sweepOptions
 Настройки операции вытягивания по траектории. Тип DatabaseServices.SweepOptions.
 Описание
 Метод предназначен для создания поверхности вытягиванием указанного объекта по заданной траектории с учетом переданных опций.
 Ссылки
 Teigha.DatabaseServices.SweptSurface, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!