Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Group.SetVisibility
 Послать отзыв
 Метод позволяет установить статус видимости для всех объектов в данной группе.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetVisibility( bool value );
Копировать Код
Public Sub SetVisibility( value As Boolean )
 Параметры
 Параметры
 Описание
 value
 Флаг, определяющий видимость объектов группы. Тип bool. Если флаг принимает значение true, объекты становятся видимыми. В противном случае вся группа оказывается невидимой.
 Описание
 Метод позволяет установить статус видимости для всех объектов в данной группе.
 Ссылки
 Teigha.DatabaseServices.Group, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!