Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Leader.Dimtad
 Послать отзыв
 Синтаксис
C#
Visual Basic
public int Dimtad;
Public Property Dimtad() As Integer
 Описание
 Возвращает или устанавливает текущее значение DIMTAD для выноски. Если значение переопределено для выноски, то это переопределенное значение возвращается. В противном случае возвращается значение из размерности размерного стиля. Для получения дополнительной информации о DIMTAD смотрите секцию "Системные переменные" Руководства по командам nanoCAD.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Leader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!