Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.TransactionManager.TopTransaction
 Послать отзыв
 Предоставляет доступ к объекту Transaction, который является верхним в стеке транзакций (т.е. к последнему созданному объекту Transaction).
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual Transaction TopTransaction;
Копировать Код
Public virtual Property TopTransaction() As Transaction
 Возвращает
 Возвращает объект Transaction.
 Описание
 Предоставляет доступ к последнему созданному объекту Transaction, который представляет верхнюю в стеке транзакций текущую транзакцию.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.TransactionManager, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!