Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.ExternalSurface.IsCylinder
 Послать отзыв
 Свойство IsCylinder позволяет проверить, является ли данная внешняя поверхность цилиндром.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsCylinder;
Копировать Код
Public ReadOnly Property IsCylinder As Boolean
 Возвращает
 Возвращает true, если данная внешняя поверхность является цилиндром. В противном случае возвращает false.
 Описание
 Свойство IsCylinder определяет тип данной внешней поверхности и возвращает true, если она является цилиндром.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.ExternalSurface, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!