Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.LayoutDictionaryId
 Послать отзыв
 Синтаксис
C#
Visual Basic
public DatabaseServices::ObjectId LayoutDictionaryId;
Public Property LayoutDictionaryId() As DatabaseServices.ObjectId
 Описание
 Возвращает Id словаря ACAD_LAYOUT, который содержит объекты типа Layout. Словарь листов содержит характеристики каждого листа пространства листов.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!