Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Line3d.Line3d
 Послать отзыв
 Конструктор по умолчанию. Создает бесконечную линию, совпадающую с осью X.
 Синтаксис
C#
Visual Basic
Копировать Код
public Line3d();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию. Создает бесконечную линию, совпадающую с осью X.
 Ссылки
 Teigha.Geometry.Line3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!