Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CompoundObjectId.CompoundObjectId
 Послать отзыв
 Конструктор класса CompoundObjectId, предназначенный для создания идентификатора составного объекта с использованием переданного идентификатора объекта ObjectId.
 Синтаксис
C#
Visual Basic
Копировать Код
public CompoundObjectId( ObjectId id );
Копировать Код
Public Sub New( id As ObjectId )
 Параметры
 Параметры
 Описание
 id
 Идентификатор исходного объекта, на который будет ссылаться новый объект CompoundObjectId. Тип ObjectId.
 Описание
 Конструктор класса CompoundObjectId, предназначенный для создания идентификатора составного объекта с использованием переданного идентификатора объекта ObjectId.
 Ссылки
 Teigha.DatabaseServices.CompoundObjectId, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!