Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DxfFiler.WriteXDataStart
 Послать отзыв
 Метод определяет начало расширенных данных xdata в этом объекте Filer.
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract void WriteXDataStart();
Копировать Код
Public MustOverride Sub WriteXDataStart()
 Описание
 Метод определяет начало расширенных данных xdata в этом объекте Filer.
 Ссылки
 Teigha.DatabaseServices.DxfFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!