Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve3d.GetClosestPointTo
 Послать отзыв
 Метод находит точку на данной кривой, ближайшую к указанной точке.
 Синтаксис
C#
Visual Basic
Копировать Код
public PointOnCurve3d GetClosestPointTo( Point3d point );
Копировать Код
Public Function GetClosestPointTo( point As Point3d ) As PointOnCurve3d
 Параметры
 Параметры
 Описание
 point
 Входная точка, для которой следует найти ближайшую к ней точку на кривой. Тип Point3d.
 Возвращает
 Возвращает точку на кривой. Тип PointOnCurve3d.
 Описание
 Метод находит точку на данной кривой, ближайшую к указанной точке. Используется метод Curve3d.GetClosestPointTo(Point3d point, Tolerance tolerance) с допуском, равным Global.
 Ссылки
 Teigha.Geometry.Curve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!