Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LayerViewportProperties.IsColorOverridden
 Послать отзыв
 Свойство позволяет проверить, переопределён ли цвет для связанного слоя и видового экрана.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsColorOverridden;
Копировать Код
Public Property IsColorOverridden As Boolean
 Возвращает
 Возвращает true, если цвет переопределен. В противном случае возвращает false.
 Описание
 Свойство позволяет проверить, переопределён ли цвет для связанного слоя и видового экрана.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.LayerViewportProperties, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!