Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.GenerateLayout
 Послать отзыв
 Метод предназначен для обновления всей геометрии таблицы согласно настройкам текущего стиля таблицы и с учетом определений содержащихся в таблице данных.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void GenerateLayout();
Копировать Код
Public virtual Sub GenerateLayout()
 Описание
 Этот метод обновляет таблицу в соответствии с настройками текущего стиля таблицы. Обновлению подлежит вся геометрия таблицы (линии сетки, текстовое содержимое, содержимое блока, фоновая заливка и т.п.) с учетом определений данных и стиля таблицы.
 Данный метод не генерирует блок таблицы. Блок таблицы создается автоматически из списка задействованных объектов чертежа в тот момент, когда приложение отправляет в базу данных объект таблицы и закрывает его.
 Метод позволяет полноценно использовать табличный объект независимо от его статуса в базе данных — резидентного или нерезидентного. Занятая геометрией таблицы память будет автоматически освобождена деструктором объекта Table.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!