Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.TableStyle.SetGridColor
 Послать отзыв
 Метод позволяет задать цвет сетки для указанного сочетания типов линий сетки и типов строк таблицы.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetGridColor( ref Teigha.Colors.Color color, int gridLineTypes, int rowTypes );
Копировать Код
Public Overridable Sub SetGridColor( ByRef color As Teigha.Colors.Color, gridLineTypes As Integer, rowTypes As Integer )
 Параметры
 Параметры
 Описание
 color
 Новый цвет сетки. Тип Teigha.Colors.Color.
 gridLineTypes
 Тип линий сетки (или логическая комбинация нескольких типов). Тип int. См. перечисление GridLineType.
 rowTypes
 Тип строк таблицы (или логическая комбинация нескольких типов). Тип int. См. перечисление RowType.
 Описание
 Метод позволяет задать цвет сетки для указанного сочетания типов линий сетки и типов строк таблицы. Различные типы линий и типы строк можно комбинировать с помощью логического оператора OR.
 Ссылки
 Teigha.DatabaseServices.TableStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!