Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Extents3d.ToString
 Послать отзыв
 Метод предназначен для получения эквивалентного строкового представления данного объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public sealed override String ToString();
Копировать Код
Public NotOverridable Overrides Function ToString() As String
 Возвращает
 Возвращает строку, в которой представлены минимальная и максимальная точки ограничивающего бокса. Тип String.
 Описание
 Метод предназначен для получения эквивалентного строкового представления данного объекта.
 Ссылки
 Teigha.DatabaseServices.Extents3d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!