Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.EllipticalArc3d.StartPoint
 Послать отзыв
 Свойство StartPoint представляет положение начальной точки данной эллиптической дуги.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d StartPoint;
Копировать Код
Public ReadOnly Property StartPoint As Point3d
 Возвращает
 Возвращает начальную точку эллиптической дуги. Тип Point3d.
 Описание
 Свойство StartPoint представляет положение начальной точки данной эллиптической дуги.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.EllipticalArc3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!