Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Face.IsEdgeVisibleAt
 Послать отзыв
 Метод позволяет проверить видимость ребра с указанным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsEdgeVisibleAt( short vertexIndex );
Копировать Код
Public Function IsEdgeVisibleAt( vertexIndex As Short ) As Boolean
 Параметры
 Параметры
 Описание
 vertexIndex
 Индекс вершины грани (0, 1, 2 или 3). Тип short.
 Возвращает
 Возвращает true, если указанное ребро является видимым. В противном случае возвращает false.
 Описание
 Метод позволяет проверить видимость ребра с указанным индексом.
 Ссылки
 Teigha.DatabaseServices.Face, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!