Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LayoutManager.LayoutToBeRemoved
 Послать отзыв
 Cобытие создается перед удалением листа.
 Синтаксис
C#
Visual Basic
Копировать Код
public event LayoutEventHandler LayoutToBeRemoved;
Копировать Код
Public Event LayoutToBeRemoved As LayoutEventHandler
 Описание
 Cобытие создается перед удалением листа.
 Ссылки
 Teigha.DatabaseServices.LayoutManager, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!