Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MText.OverlineOn
 Послать отзыв
 Свойство возвращает строку перехода к зачёркнутому тексту "O".
 Синтаксис
C#
Visual Basic
Копировать Код
public static String OverlineOn;
Копировать Код
Public Shared ReadOnly Property OverlineOn As String
 Возвращает
 Возвращает строку перехода к зачёркнутому тексту. Тип String.
 Описание
 Свойство возвращает строку перехода к зачёркнутому тексту "O". Может использоваться вместо строковой константы "O", чтобы сделать код более понятным. При использовании в строке, возвращаемой свойством MText.Contents, "O" означает переход к зачёркнутому тексту.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.MText, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!