Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Cone.SetAngles
 Послать отзыв
 Метод позволяет переопределить начальный и конечный углы поворота образующей этого конуса.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetAngles( double startAngle, double endAngle );
Копировать Код
Public Sub SetAngles( startAngle As Double, endAngle As Double )
 Параметры
 Параметры
 Описание
 startAngle
 Начальный угол поворота образующей в радианах. Тип double.
 endAngle
 Конечный угол поворота образующей в радианах. Тип double.
 Описание
 Метод позволяет переопределить начальный и конечный углы поворота образующей этого конуса.
 Ссылки
 Teigha.Geometry.Cone, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!