Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.UnderlayReference.Fade
 Послать отзыв
 Свойство Fade представляет значение затухания для подложки в диапазоне [0 – 100].
 Синтаксис
C#
Visual Basic
Копировать Код
public int Fade;
Копировать Код
Public Property Fade As Integer
 Возвращает
 Возвращает значение затухания в диапазоне [0 – 100]. Тип int.
 Описание
 Свойство Fade представляет значение затухания для подложки в диапазоне [0 – 100].
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.UnderlayReference, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!