Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.MaintenanceReleaseVersion
 Послать отзыв
 Синтаксис
C#
Visual Basic
public int MaintenanceReleaseVersion;
Public Property MaintenanceReleaseVersion() As Integer
 Описание
 Возвращает минорную (maintenance) версию базы данных.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!