Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Light.Attenuation
 Послать отзыв
 Свойство предоставляет доступ к информации о пределах затухания источника света.
 Синтаксис
C#
Visual Basic
Копировать Код
public LightAttenuation Attenuation;
Копировать Код
Public Property Attenuation As LightAttenuation
 Возвращает
 Возвращает объект LightAttenuation с информацией о пределах затухания источника света.
 Описание
 Свойство предоставляет доступ к информации о пределах затухания источника света.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Light, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!