Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.GraphicsInterface.Geometry.Draw
 Послать отзыв
 Метод дает команду графической системе регенерировать графическое представление входного значения как компонента данного объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool Draw( ref Drawable value );
Копировать Код
Public Function Draw( ByRef value As Drawable ) As Boolean
 Параметры
 Параметры
 Описание
 value
 Входной объект Drawable, который должен быть отрисован.
 Возвращает
 Возвращает true, если отрисовка завершилась успешно. В противном случае возвращает false.
 Описание
 Метод дает команду графической системе регенерировать графическое представление входного значения как компонента данного объекта.
 Например, определение блока (BlockTableRecord) использует этот метод для отрисовки входящих в блок объектов. Всякий объект-владелец другого объекта должен использовать этот метод, чтобы этот подобъект рисовал сам себя (в отличие от прямого вызова метода WorldDraw() подобъекта).
 Это позволяет графической системе кэшировать графику объекта. Прямой вызов WorldDraw() предотвратит этот тип кэширования.
 Возврат false вызывающей программе будет означать, что запрос вами не обработан.
 Пример
 В качестве примера приведен фрагмент кода, где используется метод Draw() класса Geometry. Наиболее распространенным случаем использования этого метода в .NET API nanoCAD является технология Jig. Jig использует метод WorldDraw, у которого входным параметром является переменная типа Teigha.GraphicsInterface.WorldDraw. У этого типа есть свойство Geometry типа Teigha.GraphicsInterface.Geometry, через которое можно получить доступ к методу Draw():
C#
 Копировать Код
// Определение метода WorldDraw из класса HostMgd.EditorInput.DrawJig protected override bool WorldDraw(WorldDraw draw) { // Переменная line объявлена в классе-наследнике HostMgd.EditorInput.DrawJig if (line == null) { line = new Teigha.DatabaseServices.Line(); line.SetDatabaseDefaults(); } // Присваиваем значения начальной и конечной точкам линии. // Переменные basePt и newPt объявлены в классе-наследнике HostMgd.EditorInput.DrawJig line.StartPoint = basePt; line.EndPoint = newPt; // Для отрисовки линии здесь применяется метод Draw() draw.Geometry.Draw(line); return true; }
 Полный пример применения технологии Jig, где используется метод Draw() класса Geometry, приведен в описании класса DrawJig.
 Ссылки
 Teigha.GraphicsInterface.Geometry, Teigha.GraphicsInterface
 Ваши комментарии по поводу этого топика: Послать отзыв!