Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CellReference.Column
 Послать отзыв
 Свойство Column представляет столбец таблицы, в котором располагается текущая ячейка.
 Синтаксис
C#
Visual Basic
Копировать Код
public int Column;
Копировать Код
Public Property Column As Integer
 Возвращает
 Возвращает индекс столбца с текущей ячейкой. Тип int.
 Описание
 Свойство Column представляет столбец таблицы, в котором располагается текущая ячейка.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.CellReference, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!