Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Shape.StyleId
 Послать отзыв
 Свойство StyleId представляет идентификатор объекта записи в таблице символов шрифта, содержащей шрифт SHX данного объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.ObjectId StyleId;
Копировать Код
Public Property StyleId As DatabaseServices.ObjectId
 Возвращает
 Возвращает идентификатор объекта записи в таблице символов шрифта. Тип DatabaseServices.ObjectId.
 Описание
 Свойство StyleId представляет идентификатор объекта записи в таблице символов шрифта, содержащей шрифт SHX данного объекта. Фактически, объект Shape представляет собой отдельный символ специального шрифта SHX.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Shape, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!