Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Database.ReadDwgFile (String^, System::IO::FileShare, bool, String^)
 Послать отзыв
 Синтаксис
C#
Visual Basic
public void ReadDwgFile(ref String fileName, System.IO.FileShare fileSharing, bool allowCPConversion, ref String password);
Public Sub ReadDwgFile(ByRef fileName As String, fileSharing As System.IO.FileShare, allowCPConversion As bool, ByRef password As String)
 Параметры
 Параметры
 Описание
 fileName
 Имя или URL читаемого файла
 fileSharing
 Режим разделения файла
 allowCPConversion
 Переменная, определяющая режим разрешения конвертации между кодовыми страницами
 password
 Строка, содержащая пароль файла
 Описание
 Читает файл чертежа, определенный fileName в базу данных. fileName должен включать расширение файла (не обязательно .dwg), даже если открываемый файл имеет расширение .dwg. fileName может быть URL.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!