Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.SetValue
 Послать отзыв
 Данный метод анализирует переданный текст и преобразует его в значение подходящего типа данных, которое затем помещает в ячейку.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetValue( int row, int col, ref String pText, ParseOption nOption );
Копировать Код
Public virtual Sub SetValue( row As Integer, col As Integer, ByRef pText As String, nOption As ParseOption )
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 col
 Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
 pText
 Исходный текст для преобразования в сохраняемое в ячейке значение, тип String.
 nOption
 Опции форматирования из перечисления ParseOption.
 Описание
 Данный метод анализирует переданный текст и преобразует его в значение подходящего типа данных, которое затем помещает в ячейку.
Если для nOption установлено значение ParseOptionNone, метод выполняет синтаксический анализ по умолчанию.
Если это SetDefaultFormat, метод устанавливает для значения формат по умолчанию, соответствующий типу данных.
Если это PreserveMtextFormat, для переданного текста используется форматирование MText, если это MText.
 Замечания
 Для получения того же результата предпочтительнее использовать метод Table.Cells[row,column].Contents(i).Value.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!