Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GraphNodeCollection.CopyTo
 Послать отзыв
 Метод предназначен для копирования объектов из массива в данную коллекцию, начиная с указанного индекса.
 Синтаксис
C#
Visual Basic
Копировать Код
public void CopyTo( ref GraphNode[] arr, int index );
Копировать Код
Public Sub CopyTo( ByRef arr As GraphNode(), index As Integer )
 Параметры
 Параметры
 Описание
 arr
 Входной массив узлов. Тип GraphNode[].
 index
 Индекс элемента массива, с которого начинается копирование элементов массива в коллекцию. Тип int.
 Описание
 Метод предназначен для копирования объектов из массива в данную коллекцию, начиная с указанного индекса.
 Ссылки
 Teigha.DatabaseServices.GraphNodeCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!