Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Point3d.Convert2d
 Послать отзыв
 Метод преобразует данную 3D-точку в 2D-точку в двумерной системе координат заданного плоского объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point2d Convert2d( ref PlanarEntity plane );
Копировать Код
Public Function Convert2d( ByRef plane As PlanarEntity ) As Point2d
 Параметры
 Параметры
 Описание
 plane
 Плоскость, в которой располагается данная 3D-точка. Тип PlanarEntity.
 Возвращает
 Возвращает точку Point2d.
 Описание
 Метод преобразует данную 3D-точку в 2D-точку в двумерной системе координат заданного плоского объекта plane.
 Если объект plane имеет систему координат с началом p и осями uAxis и vAxis (см. метод PlanarEntity.GetCoordinateSystem()), то искомая 2D-точка определяется вектором (*this - p) в базисе uAxis, vAxis.
 Предполагается, что данная 3D-точка принадлежит плоскости объекта plane.
 Ссылки
 Teigha.Geometry.Point3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!