Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 ViewportTableRecord.SnapEnabled
 Послать отзыв
 Свойство предназначено для управления режимом привязки.
 Синтаксис
C#
Visual Basic
public bool SnapEnabled;
Public Property SnapEnabled() As bool
 Возвращает
 Возвращает тип данных bool:
true – режим привязки включен;
false – режим привязки выключен.
 Описание
 С помощью свойства можно включать/выключать режим привязки.
 Условия
 Чтение и запись.
 Ссылки
 ViewportTableRecord Класс, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!