Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DxfFiler.AtEmbeddedObjectStart
 Послать отзыв
 Свойство позволяет определить, указывает ли этот объект DxfFiler на элемент с кодом DxfCode.EmbeddedObjectStart. Не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual bool AtEmbeddedObjectStart;
Копировать Код
Public Overridable ReadOnly Property AtEmbeddedObjectStart As Boolean
 Возвращает
 Возвращает true, если объект DxfFiler указывает на элемент с кодом DxfCode.EmbeddedObjectStart. В противном случае возвращает false.
 Описание
 Свойство позволяет определить, указывает ли этот объект DxfFiler на элемент с кодом DxfCode.EmbeddedObjectStart. Не реализовано.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.DxfFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!