Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbCurve2d.EvalMode
 Послать отзыв
 Свойство EvalMode позволяет узнать текущий режим вычисления сплайна.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool EvalMode;
Копировать Код
Public ReadOnly Property EvalMode As Boolean
 Возвращает
 Возвращает true, если внутренняя оптимизация включена. В противном случае возвращает false.
 Описание
 Свойство EvalMode позволяет узнать текущий режим вычисления сплайна.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.NurbCurve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!