Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.GetMergeAllEnabled
 Послать отзыв
 Метод позволяет определить состояние флага слияния всех ячеек в заданной строке или столбце таблицы.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual bool GetMergeAllEnabled( int row, int column );
Копировать Код
Public virtual Function GetMergeAllEnabled( row As Integer, column As Integer ) As Boolean
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 col
 Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
 Возвращает
 Возвращает true, если в строке или столбце включен флаг слияния всех ячеек, иначе false.
 Описание
 Метод позволяет определить состояние флага слияния всех ячеек в заданной строке или столбце таблицы.
 Замечания
 Метод не реализован. Используйте Table.Cells[row,column].IsMergeAllEnabled.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!