Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbCurve3dFitData.!=
 Послать отзыв
 Оператор неравенства для структуры NurbCurve3dFitData. Проверяет неидентичность двух экземпляров структуры.
 Синтаксис
C#
Visual Basic
Копировать Код
public static bool operator !=( NurbCurve3dFitData a, NurbCurve3dFitData b );
Копировать Код
Public Shared Operator <>( a As NurbCurve3dFitData, b As NurbCurve3dFitData ) As Boolean
 Параметры
 Параметры
 Описание
 a
 Левый операнд. Тип NurbCurve3dFitData.
 b
 Правый операнд. Тип NurbCurve3dFitData.
 Возвращает
 Возвращает true, если операнды a и b не равны. В противном случае возвращает false.
 Описание
 Оператор неравенства для структуры NurbCurve3dFitData. Проверяет неидентичность двух экземпляров структуры.
 Неравенство двух объектов NurbCurve3dFitData означает невыполнение по крайней мере одного из следующих условий:
Определяющие точки совпадают;
Равны степени обеих кривых;
Данные касательных присутствуют или отсутствуют для обеих кривых;
Равны начальные векторы касательных;
Равны конечные векторы касательных.
 Ссылки
 Teigha.Geometry.NurbCurve3dFitData, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!