Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.XrefSubCommandEventArgs.paths
 Послать отзыв
 Свойство paths представляет пути записей таблицы блоков.
 Синтаксис
C#
Visual Basic
Копировать Код
public String[] paths;
Копировать Код
Public ReadOnly Property paths As String()
 Возвращает
 Возвращает массив путей. Тип String[].
 Описание
 Свойство paths представляет пути записей таблицы блоков.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.XrefSubCommandEventArgs, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!