Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DwgFiler.DwgVersion
 Послать отзыв
 Свойство возвращает версию DWG файла, с которым связан данный файлер, в виде объекта FullDwgVersion.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual FullDwgVersion DwgVersion;
Копировать Код
Public Overridable ReadOnly Property DwgVersion As FullDwgVersion
 Возвращает
 Возвращает версию DWG файла как объект FullDwgVersion.
 Описание
 Свойство возвращает версию DWG файла, с которым связан данный файлер, в виде объекта FullDwgVersion.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.DwgFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!