Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DxfFiler.WriteObjectId
 Послать отзыв
 Метод записывает в данный объект Filer указанный идентификатор объекта ObjectId.
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract void WriteObjectId( DxfCode opCode, ObjectId value );
Копировать Код
Public MustOverride Sub WriteObjectId( opCode As DxfCode, value As ObjectId )
 Параметры
 Параметры
 Описание
 opCode
 Групповой код DXF. Тип DxfCode.
 value
 Идентификатор объекта, который следует записать. Тип ObjectId.
 Описание
 Метод записывает в данный объект Filer указанный идентификатор объекта ObjectId.
 Ссылки
 Teigha.DatabaseServices.DxfFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!