Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Ray3d.Set
 Послать отзыв
 Метод переопределяет точку начала данного луча и точку, задающую его направление.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Set( Point3d point1, Point3d point2 );
Копировать Код
Public Sub Set( point1 As Point3d, point2 As Point3d )
 Параметры
 Параметры
 Описание
 point1
 Новая точка начала луча. Тип Point3d.
 point2
 Новая точка, определяющая направление луча. Тип Point3d. Должна отличаться от точки point1.
 Описание
 Метод переопределяет данный луч, используя точку начала point1 и точку point2, задающую направление луча.
 Ссылки
 Teigha.Geometry.Ray3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!