Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Section.HitTest
 Послать отзыв
 Метод проверяет попадание указанной точки на секущую плоскость.
 Синтаксис
C#
Visual Basic
Копировать Код
public SectionHitTestInfo HitTest( Point3d ptHit );
Копировать Код
Public Function HitTest( ptHit As Point3d ) As SectionHitTestInfo
 Параметры
 Параметры
 Описание
 ptHit
 Координаты проверяемой точки. Тип Point3d.
 Возвращает
 Возвращает результат проверки на попадание. Тип SectionHitTestInfo.
 Описание
 Метод проверяет попадание указанной точки на секущую плоскость и возвращает результат в виде объекта SectionHitTestInfo.
 Ссылки
 Teigha.DatabaseServices.Section, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!