Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.SecurityParameters
 Послать отзыв
 Синтаксис
C#
Visual Basic
public DatabaseServices::SecurityParameters SecurityParameters;
Public Property SecurityParameters() As DatabaseServices.SecurityParameters
 Описание
 Обеспечивает доступ к параметрам безопасности, связанным с базой данных.
 Условия
 На чтение
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!