Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CellRange.DataType
 Послать отзыв
 Свойство обеспечивает доступ к типу данных в ячейках диапазона.
 Синтаксис
C#
Visual Basic
Копировать Код
public DataTypeParameter? DataType;
Копировать Код
Public Property DataType As DataTypeParameter?
 Возвращает
 Возвращает тип данных в ячейках диапазона. Тип DataTypeParameter.
 Описание
 Свойство обеспечивает доступ к типу данных в ячейках диапазона.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.CellRange, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!