Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CellClass
 Послать отзыв
 Данное перечисление определяет типы классов ячеек таблицы.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum CellClass { None = 0, Label = 1, Data = 2 }
Копировать Код
Public Enum CellClass None = 0 Label = 1 Data = 2 End Enum
 Члены
 Члены
 Описание
 None
 Значение: 0. Класс не задан.
 Label
 Значение: 1. Класс меток.
 Data
 Значение: 2. Класс данных.
 Описание
 Данное перечисление определяет типы классов ячеек таблицы.
 Ваши комментарии по поводу этого топика: Послать отзыв!