Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SurfaceSliceResults
 Послать отзыв
 Структура SurfaceSliceResults представляет данные, которые используются в методах Surface.SliceByPlane() и Surface.SliceBySurface().
 Иерархия классов
Teigha::DatabaseServices::SurfaceSliceResults
 Синтаксис
C#
Visual Basic
Копировать Код
public struct SurfaceSliceResults
Копировать Код
Public Structure SurfaceSliceResults
 Описание
 Структура SurfaceSliceResults представляет данные, которые используются в методах Surface.SliceByPlane() и Surface.SliceBySurface().
 Методы
 Конструкторы
 Имя
 Описание
 SurfaceSliceResults
 Конструктор структуры SurfaceSliceResults. Создает экземпляр структуры с указанными параметрами.
 Топики
 Имя
 Описание
 SurfaceSliceResults Свойства
 Ниже перечислены свойства класса SurfaceSliceResults.
 Ссылки
 SurfaceSliceResults Свойства, Методы, Топики, SurfaceSliceResults Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!