Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GridPropertyParameter.Color
 Послать отзыв
 Свойство представляет цвет линии сетки.
 Синтаксис
C#
Visual Basic
Копировать Код
public Colors.Color Color;
Копировать Код
Public Color As Colors.Color
 Возвращает
 Возвращает цвет линий сетки. Тип Teigha.Colors.Color.
 Описание
 Свойство представляет цвет линии сетки.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.GridPropertyParameter, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!