Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ResultBuffer.Add
 Послать отзыв
 Добавляет значение в конец списка этого буфера результатов.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Add( TypedValue value );
Копировать Код
Public Sub Add( value As TypedValue )
 Параметры
 Параметры
 Описание
 value
 Добавляемый объект, тип TypedValue.
 Описание
 Добавляет значение в конец списка этого буфера результатов.
 Ссылки
 Teigha.DatabaseServices.ResultBuffer, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!