Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AnnotationScale
 Послать отзыв
 Данный класс представляет один единственный масштаб аннотаций, определенный в чертеже как контекст объекта.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::DatabaseServices::ObjectContext Teigha::DatabaseServices::AnnotationScale
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdDbAnnotationScale")] public class AnnotationScale : ObjectContext;
Копировать Код
<Wrapper("OdDbAnnotationScale")> Public Class AnnotationScale Inherits ObjectContext
 Описание
 Данный класс представляет один единственный масштаб аннотаций, определенный в чертеже как контекст объекта. Объекты класса можно получить из коллекции контекстов AnnotationScale.
 Пример
 В примере приведена команда AddAnnotationScale, которая создает новый аннотативный масштаб и добавляет его в коллекцию аннотативных масштабов чертежа. Далее аннотативный масштаб чертежа, равный по умолчанию 1:1, изменяется приложением на вновь добавленный.
C#
 Копировать Код
 public partial class Commands { [Teigha.Runtime.CommandMethod("AddAnnotationScale")] public void AddAnnotationScale() { // Получение ссылки на активный документ HostMgd.ApplicationServices.Document doc = HostMgd.ApplicationServices.Application.DocumentManager.MdiActiveDocument; // Получение ссылки на редактор документа HostMgd.EditorInput.Editor ed = doc.Editor; // Получение ссылки на базу данных документа Teigha.DatabaseServices.Database db = doc.Database; ed.WriteMessage(db.Cannoscale.CollectionName + " " + db.Cannoscale.Name); // Сохраняем менеджер контекста в переменную Teigha.DatabaseServices.ObjectContextManager contextManager = db.ObjectContextManager; // Сохраняем коллекцию аннотативных масштабов в переменную Teigha.DatabaseServices.ObjectContextCollection collection = contextManager.GetContextCollection("ACDB_ANNOTATIONSCALES"); // Создаем аннотативный масштаб Teigha.DatabaseServices.AnnotationScale asc = new Teigha.DatabaseServices.AnnotationScale(); asc.DrawingUnits = 1; asc.Name = "MyAnnoScale"; asc.PaperUnits = 45; // Добавляем в коллекцию новый аннотативный масштаб collection.AddContext(asc); // Перебираем в цикле коллекцию аннотативных масштабов foreach (ObjectContext c in collection) { // Выводим в командную строку название коллекции и каждого масштаба ed.WriteMessage(c.CollectionName + " " + c.Name); } // Выводим в командную строку старое значение аннотативного масштаба чертежа ed.WriteMessage($"Текущий аннотативный масштаб <{db.Cannoscale.Name}> из коллекции {db.Cannoscale.CollectionName}"); // Изменямем аннотативный масштаб чертежа на новый db.Cannoscale = asc; // Выводим в командную строку новое значение аннотативного масштаба чертежа ed.WriteMessage($"Новый аннотативный масштаб <{db.Cannoscale.Name}> из коллекции {db.Cannoscale.CollectionName}"); } }
 Результат работы команды приведен на рисунке:
 Методы
 Конструкторы
 Teigha.DatabaseServices.AnnotationScale
 Имя
 Описание
 AnnotationScale
 Конструктор по умолчанию.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.DatabaseServices.ObjectContext
 Имя
 Описание
 ObjectContext Свойства
 Ниже перечислены свойства класса ObjectContext.
 Teigha.DatabaseServices.AnnotationScale
 Имя
 Описание
 AnnotationScale Свойства
 Ниже перечислены свойства класса AnnotationScale.
 Ссылки
 AnnotationScale Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!