Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.UnderlayDefinition.Load
 Послать отзыв
 Метод позволяет загрузить файл, на который ссылается эта подложка.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Load( ref String password );
Копировать Код
Public Sub Load( ByRef password As String )
 Параметры
 Параметры
 Описание
 password
 Необязательный пароль, который может потребоваться для открытия файла. Тип String.
 Описание
 Метод позволяет загрузить файл, возвращаемый свойством UnderlayDefinition.ActiveFileName. Если пароль равен null, но он необходим для открытия файла, этот метод запрашивает пароль у пользователя.
 Ссылки
 Teigha.DatabaseServices.UnderlayDefinition, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!