Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Ole2Frame.IsLinked
 Послать отзыв
 Свойство позволяет проверить, является ли данный объект связанным.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual bool IsLinked;
Копировать Код
Public Overridable ReadOnly Property IsLinked As Boolean
 Возвращает
 Возвращает true, если данный объект является связанным. В противном случае возвращает false.
 Описание
 Свойство позволяет проверить, является ли данный объект связанным.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Ole2Frame, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!