Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbCurve2d.PurgeFitData
 Послать отзыв
 Метод предназначен для удаления всех определяющих данных, использованных для построения данной кривой.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool PurgeFitData();
Копировать Код
Public Function PurgeFitData() As Boolean
 Возвращает
 Возвращает true, если этот сплайн был построен методом определяющих точек. В противном случае возвращает false.
 Описание
 Метод удаляет все определяющие данные, использованные для построения сплайна. Определяющие данные состоят из определяющих точек, точности интерполяции, касательных векторов в начальной и конечной точках. Само определение сплайна не изменяется (т.е. метод не затрагивает управляющие вершины, узлы или веса).
 Ссылки
 Teigha.Geometry.NurbCurve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!