Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.OffsetCurve2d.Transformation
 Послать отзыв
 Свойство Transformation представляет матрицу геометрического преобразования, которое было применено к этой кривой путем вызова метода TransformBy().
 Синтаксис
C#
Visual Basic
Копировать Код
public Matrix2d Transformation;
Копировать Код
Public ReadOnly Property Transformation As Matrix2d
 Возвращает
 Возвращает матрицу геометрического преобразования, которое было применено к данной кривой. Тип Matrix2d.
 Описание
 Свойство Transformation представляет матрицу геометрического преобразования, которое было применено к этой кривой путем вызова метода TransformBy().
 Замечания
 Если метод TransformBy() никогда не вызывался для этой кривой, возвращаемая матрица будет единичной. Если метод TransformBy() вызывался более одного раза, возвращаемая матрица будет конкатенацией матриц всех примененных преобразований.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.OffsetCurve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!