Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector2dCollection.Remove
 Послать отзыв
 Метод удаляет из коллекции первое вхождение указанного объекта Vector2d.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Remove( Vector2d value );
Копировать Код
Public Sub Remove( value As Vector2d )
 Параметры
 Параметры
 Описание
 value
 Удаляемый из коллекции объект. Тип Vector2d.
 Описание
 Метод удаляет из коллекции первое вхождение указанного объекта Vector2d.
 Ссылки
 Teigha.Geometry.Vector2dCollection, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!