Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GeoLocationData.TransformToLonLatAlt
 Послать отзыв
 Метод предназначен для преобразования координат указанной точки DWG в соответствующую точку географического пространства в координатах ГИС.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d TransformToLonLatAlt( Point3d dwgPt );
Копировать Код
Public Function TransformToLonLatAlt( dwgPt As Point3d ) As Point3d
 Параметры
 Параметры
 Описание
 dwgPt
 Исходная точка DWG. Тип Point3d.
 Возвращает
 Возвращает точку в координатах ГИС. Тип Point3d.
 Описание
 Метод предназначен для преобразования координат указанной точки DWG в соответствующую точку географического пространства в координатах ГИС.
 Ссылки
 Teigha.DatabaseServices.GeoLocationData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!