Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Position2d.Set
 Послать отзыв
 Метод переопределяет координаты данного объекта позиции на основе указанной точки.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Set( Point2d point );
Копировать Код
Public Sub [Set]( point As Point2d )
 Параметры
 Параметры
 Описание
 point
 Входная 2D-точка, определяющая новое положение данного объекта позиции. Тип Point2d.
 Описание
 Метод переопределяет координаты данного объекта позиции на основе указанной точки.
 Ссылки
 Teigha.Geometry.Position2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!