Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DimAssoc.UpdateDimension
 Послать отзыв
 Метод позволяет обновить размер, связанный с данным объектом.
 Синтаксис
C#
Visual Basic
Копировать Код
public void UpdateDimension();
Копировать Код
Public Sub UpdateDimension()
 Описание
 Метод позволяет обновить размер, связанный с данным объектом.
 Ссылки
 Teigha.DatabaseServices.DimAssoc, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!