Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Dimcen
 Послать отзыв
 Синтаксис
C#
Visual Basic
public double Dimcen;
Public Property Dimcen() As Double
 Описание
 Возвращает или устанавливает текущее значение DIMCEN для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!