Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FormattedTableData.Merge
 Послать отзыв
 Метод выполняет слияние ячеек в указанном диапазоне.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void Merge( ref CellRange range );
Копировать Код
Public Overridable Sub Merge( ByRef range As CellRange )
 Параметры
 Параметры
 Описание
 range
 Диапазон, ячейки которого объединяются. Тип CellRange.
 Описание
 Метод выполняет слияние ячеек в указанном диапазоне.
 Ссылки
 Teigha.DatabaseServices.FormattedTableData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!