Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AbstractViewportData.GetClass
 Послать отзыв
 Метод предоставляет класс, связанный c данным объектом AbstractViewportData.
 Синтаксис
C#
Visual Basic
Копировать Код
public static RXClass GetClass();
Копировать Код
Public Shared Function GetClass() As RXClass
 Возвращает
 Возвращает класс, связанный с данным расширением протокола. Тип RXClass.
 Описание
 Метод предоставляет класс, связанный c данным объектом AbstractViewportData.
 Ссылки
 Teigha.DatabaseServices.AbstractViewportData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!