Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Dimexe
 Послать отзыв
 Синтаксис
C#
Visual Basic
public double Dimexe;
Public Property Dimexe() As Double
 Описание
 Возвращает или устанавливает текущее значение DIMEXE для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!