Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AngleConstraint
 Послать отзыв
 Это перечисление описывает набор фиксированных углов поворота.
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdDbMLeaderStyle.SegmentAngleType")] public enum AngleConstraint { DegreesAny = 0, Degrees015 = 1, Degrees030 = 2, Degrees045 = 3, Degrees060 = 4, Degrees090 = 6, DegreesHorz = 12 }
Копировать Код
<Wrapper("OdDbMLeaderStyle.SegmentAngleType")> Public Enum AngleConstraint DegreesAny = 0 Degrees015 = 1 Degrees030 = 2 Degrees045 = 3 Degrees060 = 4 Degrees090 = 6 DegreesHorz = 12 End Enum
 Члены
 Члены
 Описание
 DegreesAny
 Произвольный угол поворота.
 Degrees015
 Угол поворота 15 градусов.
 Degrees030
 Угол поворота 30 градусов.
 Degrees045
 Угол поворота 45 градусов.
 Degrees060
 Угол поворота 60 градусов.
 Degrees090
 Угол поворота 90 градусов.
 DegreesHorz
 Угол поворота 180 градусов.
 Описание
 Это перечисление описывает набор фиксированных углов поворота.
 Ваши комментарии по поводу этого топика: Послать отзыв!