Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.OffsetSurface.IsPlane
 Послать отзыв
 Свойство IsPlane позволяет определить, является ли поверхность смещения плоскостью.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsPlane;
Копировать Код
Public ReadOnly Property IsPlane As Boolean
 Возвращает
 Возвращает true, если поверхность смещения является плоскостью. В противном случае возвращает false.
 Описание
 Свойство IsPlane позволяет определить, является ли поверхность смещения плоскостью.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.OffsetSurface, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!