Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotSettings.ShadePlotId
 Послать отзыв
 Свойство ShadePlotId предоставляет доступ к ObjectId объекта VisualStyle или RenderSettings, на который ссылается данный объект PlotSettings.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.ObjectId ShadePlotId;
Копировать Код
Public ReadOnly Property ShadePlotId As DatabaseServices.ObjectId
 Возвращает
 Возвращает идентификатор объекта. Тип DatabaseServices.ObjectId.
 Описание
 Свойство ShadePlotId предоставляет доступ к ObjectId объекта визуального стиля VisualStyle или объекта настроек рендеринга RenderSettings, на который ссылается данный объект PlotSettings.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.PlotSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!