Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Hatch.EvaluateHatch
 Послать отзыв
 Синтаксис
C#
Visual Basic
public void EvaluateHatch(bool underEstimateNumLines);
Public Sub EvaluateHatch(underEstimateNumLines As bool)
 Описание
 Метод вычисляет линии заливки или ее сплошное наполнение для объекта заливки с использованием определенного образца. Для обычных образцов заливок, за исключением сплошной, метод выполняет расчет пересечений между линиями заданного образца и кривыми контура для формирования линий заливки. Для сплошной заливки, метод производит разбивку области заливки на треугольники и заполнение этих сцепленных треугольников указанным цветом. Note Убедитесь, что вы вызываете метод SetHatchPattern() перед использованием данного метода, для того чтобы изображение обновлялось.
 Ссылки
 Teigha.DatabaseServices.Hatch, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!