Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AbstractViewTableRecord.SetUcsToWorld
 Послать отзыв
 Метод задает пользовательскую систему координат (UCS, ПСК) для записи таблицы видов или видовых экранов с ориентацией мировой системы координат.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetUcsToWorld();
Копировать Код
Public Sub SetUcsToWorld()
 Описание
 Метод задает пользовательскую систему координат (UCS, ПСК) для записи ViewTableRecord или ViewportTableRecord. Ориентация этой UCS совпадает с ориентацией мировой системы координат.
 Ссылки
 Teigha.DatabaseServices.AbstractViewTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!