Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Solid3d.CreateRevolvedSolid
 Послать отзыв
 Метод создает трехмерное твердое тело вращением указанной грани вокруг заданной оси вращения.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void CreateRevolvedSolid( ref Entity profileEntity, SubentityId faceSubEntityId, Point3d axisPoint, Vector3d axisDir, double angleOfRevolution, double startAngle, ref RevolveOptions revolveOptions );
Копировать Код
Public Overridable Sub CreateRevolvedSolid( ByRef profileEntity As Entity, faceSubEntityId As SubentityId, axisPoint As Point3d, axisDir As Vector3d, angleOfRevolution As Double, startAngle As Double, ByRef revolveOptions As RevolveOptions )
 Параметры
 Параметры
 Описание
 profileEntity
 Объект чертежа, которому принадлежит вращаемая грань. Тип Entity.
 faceSubEntityId
 Идентификатор подобъекта вращаемой грани. Тип SubentityId.
 axisPoint
 Точка на оси вращения. Тип Point3d.
 axisDir
 Направляющий вектор оси вращения. Тип Vector3d.
 angleOfRevolution
 Угол поворота профиля в операции вращения (в радианах). Тип double.
 startAngle
 Начальный угол поворота (в радианах). Тип double. Если равен нулю, вращение начинается с текущей позиции объекта profileEntity.
 revolveOptions
 Опции операции вращения. Тип RevolveOptions.
 Описание
 Метод создает трехмерное твердое тело вращением указанной грани вокруг заданной оси вращения.
 Вращаемый объект должен представлять собой допустимую плоскую кривую, область или плоскую поверхность. Этот метод реализован только в среде пространственного моделирования.
 Ссылки
 Teigha.DatabaseServices.Solid3d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!