Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Cell.ResetValue
 Послать отзыв
 Метод предоставляет возможность сбросить значение в этой ячейке.
 Синтаксис
C#
Visual Basic
Копировать Код
public void ResetValue();
Копировать Код
Public Sub ResetValue()
 Описание
 Метод предоставляет возможность сбросить значение в этой ячейке.
 Ссылки
 Teigha.DatabaseServices.Cell, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!