Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MoveType
 Послать отзыв
 Данное перечисление определяет варианты перемещения объекта MLeader.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum MoveType { MoveAllPoints = 0, MoveAllExceptArrowHeaderPoints = 1, MoveContentAndDoglegPoints = 2 }
Копировать Код
Public Enum MoveType MoveAllPoints = 0 MoveAllExceptArrowHeaderPoints = 1 MoveContentAndDoglegPoints = 2 End Enum
 Члены
 Члены
 Описание
 MoveAllPoints
 Значение: 0. Перемещение всех точек мультилинии MLeader.
 MoveAllExceptArrowHeaderPoints
 Значение: 1. Перемещение всех точек мультилинии MLeader за исключением концов стрелок.
 MoveContentAndDoglegPoints
 Значение: 2. Перемещение полок и содержимого объекта MLeader.
 Описание
 Данное перечисление определяет варианты перемещения объекта MLeader.
 Ваши комментарии по поводу этого топика: Послать отзыв!