Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Line.Angle
 Послать отзыв
 Синтаксис
C#
Visual Basic
public double Angle;
Public Property Angle() As Double
 Описание
 Возвращает угол линии в радианах относительно мировой координатной системы.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.Line, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!