Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector2d.X
 Послать отзыв
 Свойство X представляет X-координату данного вектора.
 Синтаксис
C#
Visual Basic
Копировать Код
public double X;
Копировать Код
Public ReadOnly Property X As Double
 Возвращает
 Возвращает значение X-координаты данного вектора. Тип double.
 Описание
 Свойство X представляет значение X-координаты данного вектора.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.Vector2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!