Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MText.ParagraphBreak
 Послать отзыв
 Свойство возвращает строку перехода к новому абзацу "P".
 Синтаксис
C#
Visual Basic
Копировать Код
public static String ParagraphBreak;
Копировать Код
Public Shared ReadOnly Property ParagraphBreak As String
 Возвращает
 Возвращает строку перехода к новому абзацу. Тип String.
 Описание
 Свойство возвращает строку перехода к новому абзацу "P". Может использоваться вместо строковой константы "P", чтобы сделать код более понятным. При использовании в строке, возвращаемой свойством MText.Contents, "P" означает переход к новому абзацу.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.MText, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!