Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Dimdli
 Послать отзыв
 Синтаксис
C#
Visual Basic
public double Dimdli;
Public Property Dimdli() As Double
 Описание
 Возвращает или устанавливает текущее значение DIMDLI для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!