Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CircularArc2d.IntersectWith
 Послать отзыв
 Метод позволяет получить точки пересечения данной дуги с указанной линией, вычисленные с заданной точностью.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point2d[] IntersectWith( ref LinearEntity2d line, Tolerance tolerance );
Копировать Код
Public Function IntersectWith( ByRef line As LinearEntity2d, tolerance As Tolerance ) As Point2d()
 Параметры
 Параметры
 Описание
 line
 Входная 2D-линия, точки пересечения с которой требуется вычислить. Тип LinearEntity2d.
 tolerance
 Заданная точность вычислений. Тип Tolerance.
 Возвращает
 Возвращает массив точек пересечения. Тип Point2d[].
 Описание
 Метод позволяет получить точки пересечения данной дуги с указанной линией, вычисленные с заданной точностью.
 Ссылки
 Teigha.Geometry.CircularArc2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!