Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 BlockTableRecord.AppendEntity(Entity entity)
 Послать отзыв
 Метод предназначен для добавления примитива в блок и в базу данных чертежа.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectId AppendEntity(Entity entity);
Копировать Код
Public Function AppendEntity(entity As Entity) As ObjectId
 Параметры
 Параметры
 Описание
 entity
 Добавляемый примитив (не должен быть NULL)
 Возвращает
 Возвращает ObjectId добавленного примитива.
 Описание
 Метод добавляет примитив entity в блок и базу данных чертежа.
 Ссылки
 Teigha.DatabaseServices.BlockTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!