Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.PointOnCurve3d.IsSingular
 Послать отзыв
 Метод позволяет проверить равенство нулю длины вектора первой производной кривой в данной точке (в пределах указанного допуска).
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsSingular( Tolerance tolerance );
Копировать Код
Public Function IsSingular( tolerance As Tolerance ) As Boolean
 Параметры
 Параметры
 Описание
 tolerance
 Входное значение допуска. Тип Tolerance.
 Возвращает
 Возвращает true, если в пределах указанного допуска длину вектора первой производной можно считать нулевой; в противном случае возвращает false.
 Описание
 Метод позволяет проверить равенство нулю длины вектора первой производной кривой в данной точке (в пределах указанного допуска).
 Ссылки
 Teigha.Geometry.PointOnCurve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!