Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AttributeReference
 Послать отзыв
 Класс AttributeReference представляет объекты атрибутов в базе данных.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::GraphicsInterface::Drawable Teigha::DatabaseServices::DBObject Teigha::DatabaseServices::Entity Teigha::DatabaseServices::DBText Teigha::DatabaseServices::AttributeReference
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("AcDbAttribute")] public class AttributeReference : DBText;
Копировать Код
<Wrapper("AcDbAttribute")> Public Class AttributeReference Inherits DBText
 Описание
 Класс AttributeReference представляет объекты атрибутов в базе данных. Атрибуты используются вхождениями блоков (объекты BlockReference).
 Методы
 Конструкторы
 Teigha.GraphicsInterface.Drawable
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 Drawable
 Конструктор класса Teigha.GraphicsInterface.Drawable. (Унаследован от Drawable)
 Teigha.DatabaseServices.DBObject
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 DBObject
 Конструктор. (Унаследован от DBObject)
 Teigha.DatabaseServices.DBText
 Имя
 Описание
 DBText
 Это обзор перегрузок DBText.
 Teigha.DatabaseServices.AttributeReference
 Имя
 Описание
 AttributeReference
 Это обзор перегрузок AttributeReference.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.GraphicsInterface.Drawable
 Имя
 Описание
 Drawable Методы
 Ниже перечислены методы класса Drawable.
 Drawable Свойства
 Ниже перечислены свойства класса Drawable.
 Teigha.DatabaseServices.DBObject
 Имя
 Описание
 DBObject Методы
 Ниже перечислены методы класса DBObject.
 DBObject Свойства
 Ниже перечислены свойства класса DBObject.
 DBObject События
 Ниже перечислены события класса DBObject.
 Teigha.DatabaseServices.Entity
 Имя
 Описание
 Entity Методы
 Ниже перечислены методы класса Entity.
 Entity Свойства
 Ниже перечислены свойства класса Entity.
 Teigha.DatabaseServices.DBText
 Имя
 Описание
 DBText Методы
 Ниже перечислены методы класса DBText.
 DBText Свойства
 Ниже перечислены свойства класса DBText.
 Teigha.DatabaseServices.AttributeReference
 Имя
 Описание
 AttributeReference Методы
 Ниже перечислены методы класса AttributeReference.
 AttributeReference Свойства
 Ниже перечислены свойства класса AttributeReference.
 Ссылки
 AttributeReference Конструктор, AttributeReference Методы, AttributeReference Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства, DBObject События
 Ваши комментарии по поводу этого топика: Послать отзыв!