Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Делегат Teigha.DatabaseServices.ObjectEventHandler
 Послать отзыв
 This is type Teigha::DatabaseServices::ObjectEventHandler.
 Синтаксис
C#
Visual Basic
public delegate ObjectEventHandler();
Public Delegate Sub ObjectEventHandler()
 Ваши комментарии по поводу этого топика: Послать отзыв!