Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Polyline3d.SplineFit
 Послать отзыв
 Метод выполняет аппроксимацию полилинии сплайном. Эта операция эквивалентна команде PEDIT с опцией "Spline fit".
 Синтаксис
C#
Visual Basic
Копировать Код
public void SplineFit();
Копировать Код
Public Sub SplineFit()
 Описание
 Метод выполняет аппроксимацию полилинии сплайном.
 Сначала метод удаляет все существующие вершины сплайна или аппроксимирующей кривой, все оставшиеся вершины преобразует в контрольные вершины сплайна и генерирует новый набор вершин аппроксимирующего сплайна. Результирующая полилиния аппроксимируется сплайном с использованием нового набора вершин. Эта операция эквивалентна команде PEDIT с опцией "Spline fit".
 Ссылки
 Teigha.DatabaseServices.Polyline3d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!