Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Viewport.ViewHeight
 Послать отзыв
 Свойство ViewHeight представляет высоту вида данного видового экрана в системе координат дисплея (DCS).
 Синтаксис
C#
Visual Basic
Копировать Код
public double ViewHeight;
Копировать Код
Public Property ViewHeight As Double
 Возвращает
 Возвращает высоту вида данного видового экрана в DCS. Тип double.
 Описание
 Свойство ViewHeight представляет высоту вида данного видового экрана в системе координат дисплея (DCS).
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Viewport, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!