Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AbstractViewPE.IsPerspective
 Послать отзыв
 Свойство IsPerspective позволяет проверить, используется ли перспективное проецирование.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsPerspective;
Копировать Код
Public ReadOnly Property IsPerspective As Boolean
 Возвращает
 Возвращает true, если используется перспективное проецирование. В противном случае возвращает false.
 Описание
 Свойство IsPerspective позволяет проверить, используется ли перспективное проецирование.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.AbstractViewPE, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!