Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PolyFaceMesh.GetEnumerator
 Послать отзыв
 Этот метод возвращает перечислитель для данной коллекции.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual System.Collections.IEnumerator GetEnumerator();
Копировать Код
Public virtual Function GetEnumerator() As System.Collections.IEnumerator
 Возвращает
 Возвращает перечислитель System.Collections.IEnumerator.
 Описание
 Метод возвращает перечислитель для данной коллекции.
 Ссылки
 Teigha.DatabaseServices.PolyFaceMesh, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!