Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор Circle.Circle (Point3d, Vector3d, double)
 Послать отзыв
 Синтаксис
C#
Visual Basic
public Circle(Point3d center, Vector3d normal, double radius);
Public Sub New(center As Point3d, normal As Vector3d, radius As Double)
 Параметры
 Параметры
 Описание
 center
 Точка центра окружности
 normal
 Вектор нормали
 radius
 Значение радиуса
 Описание
 Создает конкретную окружность.
 Ссылки
 Teigha.DatabaseServices.Circle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!