Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.XrefGraph.GetXrefNode
 Послать отзыв
 Метод позволяет получить объект XrefGraphNode, соответствующий указанной базе данных.
 Синтаксис
C#
Visual Basic
Копировать Код
public XrefGraphNode GetXrefNode( ref DatabaseServices.Database db );
Копировать Код
Public Function GetXrefNode( ByRef db As DatabaseServices.Database ) As XrefGraphNode
 Параметры
 Параметры
 Описание
 db
 База данных, для которой требуется найти узел. Тип DatabaseServices.Database.
 Возвращает
 Возвращает объект XrefGraphNode, если узел найден, или null в противном случае.
 Описание
 Метод позволяет получить объект XrefGraphNode, соответствующий указанной базе данных.
 Ссылки
 Teigha.DatabaseServices.XrefGraph, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!