Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AuditInfo.ErrorsFixed
 Послать отзыв
 Метод увеличивает количество ошибок, отмеченных в данном экземпляре AuditInfo как исправленные.
 Синтаксис
C#
Visual Basic
Копировать Код
public void ErrorsFixed( int count );
Копировать Код
Public Sub ErrorsFixed( count As Integer )
 Параметры
 Параметры
 Описание
 count
 Входное количество исправленных ошибок. Тип int.
 Описание
 Метод увеличивает количество ошибок, отмеченных в данном экземпляре AuditInfo как исправленные. См. свойство NumFixes.
 Ссылки
 Teigha.DatabaseServices.AuditInfo, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!