Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.PointOnCurve2d.GetPointOnCurve
 Послать отзыв
 Метод переопределяет для данного объекта кривую и значение параметра и возвращает соответствующую этому значению точку на указанной кривой.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point2d GetPointOnCurve( ref Curve2d curve, double parameter );
Копировать Код
Public Function GetPointOnCurve( ByRef curve As Curve2d, parameter As Double ) As Point2d
 Параметры
 Параметры
 Описание
 curve
 Новая кривая. Тип Curve2d.
 parameter
 Новое значение параметра. Тип double.
 Возвращает
 Возвращает на кривой curve точку, соответствующую значению параметра parameter. Тип Point2d.
 Описание
 Метод переопределяет для данного объекта кривую и значение параметра и возвращает соответствующую этому значению точку на указанной кривой.
 Ссылки
 Teigha.Geometry.PointOnCurve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!