Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство RasterImage.Position
 Послать отзыв
 Синтаксис
C#
Visual Basic
public Point3d Position;
Public Property Position() As Point3d
 Описание
 Возвращает точку вставки.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.RasterImage, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!