Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector3dCollection.Vector3dCollection
 Послать отзыв
 Конструктор класса Vector3dCollection. Создает новую коллекцию с заданной ёмкостью.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3dCollection( int capacity );
Копировать Код
Public Sub New( capacity As Integer )
 Параметры
 Параметры
 Описание
 capacity
 Входное значение емкости создаваемой коллекции. Тип int.
 Описание
 Конструктор класса Vector3dCollection. Создает новую коллекцию с заданной ёмкостью capacity.
 Ссылки
 Teigha.Geometry.Vector3dCollection, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!