Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Database.DetachXref
 Послать отзыв
 Синтаксис
C#
Visual Basic
public void DetachXref(ObjectId xrefId);
Public Sub DetachXref(xrefId As ObjectId)
 Параметры
 Параметры
 Описание
 xrefId
 Id внешней ссылки, которая отсоединяется
 Описание
 Функция отсоединяет внешнюю ссылку в базе данных, чей BlockTableRecord определен с помощью xrefId.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!