Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DatabaseSummaryInfo.Equals
 Послать отзыв
 Метод предназначен для проверки данного объекта на совпадение с указанным объектом.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool Equals( ref Object obj );
Копировать Код
Public Function Equals( ByRef obj As Object ) As Boolean
 Параметры
 Параметры
 Описание
 obj
 Объект, который проверяется на совпадение с данным объектом DatabaseSummaryInfo. Тип Object.
 Возвращает
 Возвращает true, если совместно выполняются все указанные ниже условия:
Совпадают поля Title;
Совпадают поля Subject;
Совпадают поля Author;
Совпадают поля Keywords;
Совпадают поля Comments;
Совпадают поля LastSavedBy;
Совпадают поля RevisionNumber;
Совпадают поля HyperlinkBase;
Совпадают поля CustomProperties.
 В противном случае возвращает false.
 Описание
 Метод предназначен для проверки данного объекта на совпадение с указанным объектом obj.
 Замечания
 Переопределение методов Equals и GetHashCode должно выполняться согласованно с сохранением общей логики. Если Equals возвращает true, хеш-коды сравниваемых объектов обязаны совпадать. Обратное не гарантируется - совпадение хэш-кодов не всегда означает совпадение объектов вследствие возможных коллизий. Хэш-коды должны формироваться с использованием полей, на которых основано равенство объектов.
 Ссылки
 Teigha.DatabaseServices.DatabaseSummaryInfo, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!