Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Cell.CellType
 Послать отзыв
 Свойство возвращает тип данной ячейки.
 Синтаксис
C#
Visual Basic
Копировать Код
public TableCellType CellType;
Копировать Код
Public ReadOnly Property CellType As TableCellType
 Возвращает
 Возвращает тип ячейки. Значение из перечисления TableCellType.
 Описание
 Свойство возвращает тип данной ячейки.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Cell, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!