Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AnnotationScale.PaperUnits
 Послать отзыв
 Свойство предоставляет доступ к единицам измерения в пространстве листа, которые используются в масштабе аннотаций.
 Синтаксис
C#
Visual Basic
Копировать Код
public double PaperUnits;
Копировать Код
Public Property PaperUnits() As Double
 Возвращает
 Возвращает величину единицы, тип double.
 Описание
 Свойство предоставляет доступ к единицам измерения в пространстве листа, которые используются в масштабе аннотаций.
 Замечания
 Единицы измерения должны быть положительными и ненулевыми. Масштаб аннотаций представляет собой отношение величины единицы измерения в пространстве листа к единице в пространстве модели. Например, при соотношении 1 мм = 1 см одной единице в пространстве листа соответствует 10,0 единиц в пространстве модели, что дает масштабннй множитель 0,1.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.AnnotationScale, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!