Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LoftOptionsBuilder.Ruled
 Послать отзыв
 Свойство возвращает состояние флага ruled (кусочно-линейная поверхность).
 Синтаксис
C#
Visual Basic
Копировать Код
public bool Ruled;
Копировать Код
Public Property Ruled As Boolean
 Возвращает
 Возвращает true, если строится кусочно-линейная поверхность. В противном случае возвращает false.
 Описание
 Свойство возвращает состояние флага ruled (кусочно-линейная поверхность). Если флаг установлен в значение true, то между каждой парой поперечных сечений создается кусочно-линейная поверхность, что порождает более грубую угловатую форму. Если флаг установлен в значение false, создается общая гладкая поверхность. Значение по умолчанию false.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.LoftOptionsBuilder, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!