Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Solid3d.ExtrudeFacesAlongPath
 Послать отзыв
 Метод позволяет выдавить группу указанных граней твердого тела вдоль заданной траектории.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void ExtrudeFacesAlongPath( ref SubentityId[] subentityIds, ref Curve path );
Копировать Код
Public Overridable Sub ExtrudeFacesAlongPath( ByRef subentityIds() As SubentityId, ByRef path As Curve )
 Параметры
 Параметры
 Описание
 subentityIds
 Массив идентификаторов подобъектов для выдавливаемых граней. Тип SubentityId[].
 path
 Объект, определяющий траекторию выдавливания. Тип Curve.
 Описание
 Метод позволяет выдавить группу указанных граней твердого тела вдоль заданной траектории.
 Грани для выдавливания должны быть плоскими.
 В качестве траектории допустимы следующие объекты:
Линия
Дуга
Эллипс
Сплайн
2D полилиния
3D-полилиния без сглаживания сплайном (Non-spline fit 3D polyline).
 Траектория выдавливания не должна иметь самопересечений и, желательно, участков большой кривизны. Если начальная точка траектории не лежит в плоскости, в которой располагается выдавливаемая область, то начало траектории дотягивается до этой плоскости.
 Этот метод реализован только в среде пространственного моделирования.
 Ссылки
 Teigha.DatabaseServices.Solid3d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!