Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CurveCurveIntersector3d.Set
 Послать отзыв
 Метод позволяет переопределить в данном объекте обе кривые и параметрические интервалы для каждой из них. Точки пересечения вычисляются в пределах точности по умолчанию.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Set( ref Curve3d curve1, ref Curve3d curve2, ref Interval range1, ref Interval range2, Vector3d planeNormal );
Копировать Код
Public Sub Set( ByRef curve1 As Curve3d, ByRef curve2 As Curve3d, ByRef range1 As Interval, ByRef range2 As Interval, planeNormal As Vector3d )
 Параметры
 Параметры
 Описание
 curve1
 Первая входная кривая. Тип Curve3d.
 curve2
 Вторая входная кривая. Тип Curve3d.
 range1
 Параметрический интервал для первой кривой. Тип Interval.
 range2
 Параметрический интервал для второй кривой. Тип Interval.
 planeNormal
 Опциональный вектор нормали плоскости. Тип Vector3d.
 Описание
 Метод позволяет переопределить в данном объекте обе кривые и параметрические интервалы для каждой из них. Точки пересечения вычисляются в пределах точности по умолчанию.
 Ссылки
 Teigha.Geometry.CurveCurveIntersector3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!