Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CellRange.GetStyleOverrides
 Послать отзыв
 Метод позволяет получить переопределения стиля ячеек в этом диапазоне ячеек.
 Синтаксис
C#
Visual Basic
Копировать Код
public TableStyleOverride[] GetStyleOverrides();
Копировать Код
Public Function GetStyleOverrides() As TableStyleOverride()
 Возвращает
 Возвращает массив переопределений стиля ячеек. Тип TableStyleOverride[].
 Описание
 Метод позволяет получить переопределения стиля ячеек в этом диапазоне ячеек.
 Ссылки
 Teigha.DatabaseServices.CellRange, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!