Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Point3dCollection.IsFixedSize
 Послать отзыв
 Свойство показывает, является ли размер этой коллекции фиксированным.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsFixedSize;
Копировать Код
Public Property IsFixedSize() As Boolean
 Возвращает
 Возвращает true, если размер коллекции является фиксированным, иначе - false.
 Описание
 Свойство показывает, является ли размер этой коллекции фиксированным.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.Point3dCollection, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!