Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LayoutManager.LayoutToBeCopied
 Послать отзыв
 Cобытие создается перед стартом копирования листа.
 Синтаксис
C#
Visual Basic
Копировать Код
public event LayoutEventHandler LayoutToBeCopied;
Копировать Код
Public Event LayoutToBeCopied As LayoutEventHandler
 Описание
 Cобытие создается перед стартом копирования листа.
 Ссылки
 Teigha.DatabaseServices.LayoutManager, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!