Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObjectCollection.Item
 Послать отзыв
 Свойство предназначено для быстрого поиска элемента коллекции по его индексу.
 Синтаксис
C#
Visual Basic
Копировать Код
public DBObject Item;
Копировать Код
Public Property Item() As DBObject
 Возвращает
 Возвращает элемент коллекции типа DBObject.
 Описание
 Свойство предназначено для быстрого поиска элемента коллекции по его индексу.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.DBObjectCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!