Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Leader.Dimlwd
 Послать отзыв
 Синтаксис
C#
Visual Basic
public DatabaseServices::LineWeight Dimlwd;
Public Property Dimlwd() As DatabaseServices.LineWeight
 Описание
 Возвращает или устанавливает текущее значение DIMLWD для выноски. Если значение переопределено для объекта, то это переопределенное значение возвращается. В противном случае возвращается значение из размерности размерного стиля. Для получения дополнительной информации о DIMLWD смотрите секцию "Системные переменные" Руководства по командам nanoCAD.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Leader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!