Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GeometryOverrule.SetIdFilter
 Послать отзыв
 Метод реализует фильтрацию объектов по ObjectId перед применением объектного переопределения.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetIdFilter( ref ObjectId[] ids );
Копировать Код
Public Sub SetIdFilter( ByRef ids As ObjectId[] )
 Параметры
 Параметры
 Описание
 ids
 Входной массив объектов ObjectId.
 Описание
 Метод реализует фильтрацию объектов по ObjectId перед применением объектного переопределения.
 Используйте этот метод, когда nanoCAD должен вызывать ваше переопределение только для объектов, чьи идентификаторы присутствуют в указанном массиве.
 Ссылки
 Teigha.DatabaseServices.GeometryOverrule, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!