Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Splinesegs
 Послать отзыв
 Синтаксис
C#
Visual Basic
public int Splinesegs;
Public Property Splinesegs() As Integer
 Описание
 Обеспечивает доступ к текущему значению SPLINESEGS для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!