Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.EdgeRef.EdgeRef
 Послать отзыв
 Конструктор класса EdgeRef. Создает ссылку на ребро на основе указанного составного объекта CompoundObjectId.
 Синтаксис
C#
Visual Basic
Копировать Код
public EdgeRef( ref CompoundObjectId compoundObjectId );
Копировать Код
Public Sub New( ByRef compoundObjectId As CompoundObjectId )
 Параметры
 Параметры
 Описание
 compoundObjectId
 Идентификатор составного объекта, который используется для создания ссылки на ребро. Тип CompoundObjectId.
 Описание
 Конструктор класса EdgeRef. Создает ссылку на ребро на основе указанного составного объекта CompoundObjectId.
 Ссылки
 Teigha.DatabaseServices.EdgeRef, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!