Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.LinearEntity3d.IsPerpendicularTo
 Послать отзыв
 Метод позволяет проверить перпендикулярность данного объекта и указанного линейного объекта в пределах заданной геометрической точности.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsPerpendicularTo( ref LinearEntity3d line, Tolerance tolerance );
Копировать Код
Public Function IsPerpendicularTo( ByRef line As LinearEntity3d, tolerance As Tolerance ) As Boolean
 Параметры
 Параметры
 Описание
 line
 Входной линейный объект. Тип LinearEntity3d.
 tolerance
 Входная геометрическая точность. Тип Tolerance.
 Возвращает
 Возвращает true, если в пределах точности tolerance линейные объекты можно считать взаимно перпендикулярными. В противном случае возвращает false.
 Описание
 Метод позволяет проверить перпендикулярность данного объекта и указанного линейного объекта в пределах заданной геометрической точности.
 Ссылки
 Teigha.Geometry.LinearEntity3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!