Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Torus.ReferenceAxis
 Послать отзыв
 Свойство ReferenceAxis возвращает направление на нулевой меридиан данного тора.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d ReferenceAxis;
Копировать Код
Public ReadOnly Property ReferenceAxis As Vector3d
 Возвращает
 Возвращает направление на нулевой меридиан данного тора. Тип Vector3d.
 Описание
 Свойство ReferenceAxis возвращает направление на нулевой меридиан данного тора.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.Torus, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!