Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObjectReferenceCollection.CopyTo
 Послать отзыв
 Метод копирует все элементы коллекции в указанный массив по указанному индексу.
 Синтаксис
C#
Visual Basic
Копировать Код
public void CopyTo( ref DBObjectReference[] array, int index );
Копировать Код
Public Sub CopyTo( ByRef array() As DBObjectReference, index As Integer )
 Параметры
 Параметры
 Описание
 array
 Целевой массив, в который копируются элементы коллекции. Тип DBObjectReference[].
 index
 Индекс позиции в массиве array, начиная с которой в массив последовательно копируются все элементы данной коллекции. Тип int.
 Описание
 Метод копирует все элементы данной коллекции в указанный массив, начиная с позиции в массиве с указанным индексом.
 Ссылки
 Teigha.DatabaseServices.DBObjectReferenceCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!