Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LayerStateManager.LayerStateHasViewportData
 Послать отзыв
 Метод определяет, связаны ли с этим состоянием слоя данные видового экрана. Состояние слоя имеет данные видового экрана, если метод SaveLayerState() был вызван с ненулевым параметром id.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool LayerStateHasViewportData( ref String name );
Копировать Код
Public Function LayerStateHasViewportData( ByRef name As String ) As Boolean
 Параметры
 Параметры
 Описание
 name
 Имя интересующего состояния слоя, тип String.
 Возвращает
 Возвращает true, если с этим состоянием слоя связаны данные видового экрана, и false в противном случае.
 Описание
 Метод определяет логическое значение, указывающее, связаны ли с этим состоянием слоя данные видового экрана. Состояние слоя имеет данные видового экрана, если метод SaveLayerState() был вызван с ненулевым параметром id.
 Ссылки
 Teigha.DatabaseServices.LayerStateManager, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!