Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SubentityId.TypeClass
 Послать отзыв
 Свойство TypeClass представляет тип класса подобъекта, если тип подобъекта равен SubentityType.Class.
 Синтаксис
C#
Visual Basic
Копировать Код
public RXClass TypeClass;
Копировать Код
Public ReadOnly Property TypeClass As RXClass
 Возвращает
 Возвращает тип класса подобъекта, если тип подобъекта равен SubentityType.Class. В противном случае возвращает Null. Тип RXClass.
 Описание
 Свойство TypeClass представляет тип класса подобъекта, если тип подобъекта равен SubentityType.Class.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.SubentityId, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!