Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.SurfaceSurfaceIntersector.GetIntersectionConfigurations
 Послать отзыв
 Метод предоставляет относительные конфигурации пересекающихся поверхностей в окрестности кривой пересечения. В текущей версии не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public SurfaceSurfaceIntersectorConfigurations GetIntersectionConfigurations( int number );
Копировать Код
Public Function GetIntersectionConfigurations( number As Integer ) As SurfaceSurfaceIntersectorConfigurations
 Параметры
 Параметры
 Описание
 number
 Индекс пересечения. Индексация начинается с нуля. Тип int.
 Возвращает
 Возвращает объект SurfaceSurfaceIntersectorConfigurations с информацией о конфигурациях поверхностей в окрестности пересечения:
Размерность и тип пересечения;
Конфигурация поверхности 1 слева и справа от пересечения;
Конфигурация поверхности 2 слева и справа от пересечения.
 Описание
 Метод предоставляет относительные конфигурации пересекающихся поверхностей в окрестности кривой пересечения. В текущей версии не реализован.
 Замечания
 Метод выбрасывает исключения kXXUnknown, если данный объект пересечения еще не был инициализирован, и kXXIndexOutOfRange, если указанный методу индекс является недействительным.
 Ссылки
 Teigha.Geometry.SurfaceSurfaceIntersector, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!