Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeader.GetVertex
 Послать отзыв
 Метод позволяет получить точку заданной вершины линии выноски с указанным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d GetVertex( int leaderLineIndex, int index );
Копировать Код
Public Function GetVertex( leaderLineIndex As Integer, index As Integer ) As Point3d
 Параметры
 Параметры
 Описание
 leaderLineIndex
 Индекс линии выноски. Тип int.
 index
 Индекс вершины линии выноски. Тип int.
 Возвращает
 Возвращает точку указанной вершины. Тип Point3d.
 Описание
 Метод позволяет получить точку заданной вершины линии выноски с указанным индексом.
 Ссылки
 Teigha.DatabaseServices.MLeader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!