Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CoordinateSystem2d.==
 Послать отзыв
 Оператор равенства структуры CoordinateSystem2d.
 Синтаксис
C#
Visual Basic
Копировать Код
public static bool operator ==( CoordinateSystem2d a, CoordinateSystem2d b );
Копировать Код
Public Shared Operator =( a As CoordinateSystem2d, b As CoordinateSystem2d ) As Boolean
 Параметры
 Параметры
 Описание
 a
 Левый операнд. Тип CoordinateSystem2d.
 b
 Правый операнд. Тип CoordinateSystem2d.
 Возвращает
 Возвращает true, если одновременно выполняются все перечисленные ниже условия:
совпадают начальные точки;
совпадают направляющие векторы осей X;
совпадают направляющие векторы осей Y.
 В противном случае возвращает false.
 Описание
 Оператор равенства структуры CoordinateSystem2d.
 Ссылки
 Teigha.Geometry.CoordinateSystem2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!