Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство SymbolTableRecord.IsResolved
 Послать отзыв
 Синтаксис
C#
Visual Basic
public bool IsResolved;
Public Property IsResolved() As bool
 Описание
 Возвращает true, если запись таблицы символов является частью внешней ссылки, которая является успешно "разрешенной" (загруженной в чертеж). Если запись не является частью внешней ссылки, или она не загружена в чертеж, возвращается false. Для определения того, является ли запись частью внешней ссылки, можно использовать свойство SymbolTableRecord.IsDependent.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.SymbolTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!