Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.ExternalCurve2d.IsNurbCurve
 Послать отзыв
 Свойство IsNurbCurve позволяет проверить, может ли экземпляр внешней кривой быть представлен определением, которое является нативным для графической системы платформы.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsNurbCurve;
Копировать Код
Public ReadOnly Property IsNurbCurve As Boolean
 Возвращает
 Возвращает true, если внешняя кривая имеет точное нативное представление в графической системе платформы. В противном случае возвращает false.
 Описание
 Свойство IsNurbCurve позволяет проверить, может ли экземпляр внешней кривой быть представлен определением, которое является нативным для графической системы платформы.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.ExternalCurve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!