Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Field.Format
 Послать отзыв
 Свойство Format представляет формат вывода для данного поля.
 Синтаксис
C#
Visual Basic
Копировать Код
public String Format;
Копировать Код
Public Property Format As String
 Возвращает
 Возвращает формат вывода для поля. Тип String.
 Описание
 Свойство Format представляет формат вывода для данного поля.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Field, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!