Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ImageBackground.ImageFileName
 Послать отзыв
 Свойство представляет полный путь к файлу изображения, на базе которого создан данный объект.
 Синтаксис
C#
Visual Basic
Копировать Код
public String ImageFileName;
Копировать Код
Public Property ImageFileName As String
 Возвращает
 Возвращает полный путь к файлу изображения. Тип String.
 Описание
 Свойство представляет полный путь к файлу изображения, на базе которого создан данный объект.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.ImageBackground, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!