Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.DynamicDimension
 Послать отзыв
 Свойство позволяет задать или определить, является ли данный размер динамическим.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool DynamicDimension;
Копировать Код
Public Property DynamicDimension As Boolean
 Возвращает
 Возвращает true, если размер является динамическим. В противном случае возвращает false.
 Описание
 Свойство позволяет задать или определить, является ли данный размер динамическим.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!