Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.EllipticalArc3d.ClosestPointToPlane
 Послать отзыв
 Метод вычисляет точку на эллиптической дуге, которая находится ближе всего к указанной плоскости, и точку на этой плоскости, которая находится ближе всего к эллиптической дуге. Геометрические вычисления выполняются с заданной точностью.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d[] ClosestPointToPlane( ref PlanarEntity plane, Tolerance tolerance );
Копировать Код
Public Function ClosestPointToPlane( ByRef plane As PlanarEntity, tolerance As Tolerance ) As Point3d()
 Параметры
 Параметры
 Описание
 plane
 Плоский объект, по отношению к которому вычисляется ближайшая точка на данной эллиптической дуге. Тип PlanarEntity.
 tolerance
 Заданная геометрическая точность. Тип Tolerance.
 Возвращает
 Возвращает массив из двух элементов. Тип Point3d[]. Первый элемент представляет точку на плоскости plane, а второй — ближайшую к ней точку на данной эллиптической дуге.
 Описание
 Метод вычисляет точку на эллиптической дуге, которая находится ближе всего к указанной плоскости, и точку на этой плоскости, которая находится ближе всего к эллиптической дуге. Геометрические вычисления выполняются с заданной точностью. Результатом является массив из двух найденных точек.
 Ссылки
 Teigha.Geometry.EllipticalArc3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!