Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Assoc2dConstraintGroup.WorkPlane
 Послать отзыв
 Свойство предоставляет доступ к рабочей плоскости данной группы ограничений.
 Синтаксис
C#
Visual Basic
Копировать Код
public Teigha.Geometry.Plane WorkPlane;
Копировать Код
Public Property WorkPlane() As Teigha.Geometry.Plane
 Возвращает
 Возвращает рабочую плоскость данной группы ограничений. Тип Teigha.Geometry.Plane.
 Описание
 Свойство предоставляет доступ к рабочей плоскости данной группы ограничений.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Assoc2dConstraintGroup, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!