Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SubDMesh.GetFacePlane
 Послать отзыв
 Метод предназначен для получения плоскости Plane грани, заданной идентификатором SubentityId.
 Синтаксис
C#
Visual Basic
Копировать Код
public Plane GetFacePlane( SubentityId subentId );
Копировать Код
Public Function GetFacePlane( subentId As SubentityId ) As Plane
 Параметры
 Параметры
 Описание
 subentId
 ID грани. Тип SubentityId.
 Возвращает
 Возвращает плоскость Plane заданной грани.
 Описание
 Метод предназначен для получения плоскости Plane грани, заданной идентификатором SubentityId.
 Ссылки
 Teigha.DatabaseServices.SubDMesh, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!