Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LayerEvaluation
 Послать отзыв
 Перечисление LayerEvaluation предназначено для настройки переменной заголовка LAYEREVAL.
 Синтаксис
C#
Visual Basic
Копировать Код
[Flags] public enum LayerEvaluation { NoNewLayerEvaluation = 0, EvalNewXrefLayers = 1, EvalAllNewLayers = 2 }
Копировать Код
<Flags> Public Enum LayerEvaluation NoNewLayerEvaluation = 0 EvalNewXrefLayers = 1 EvalAllNewLayers = 2 End Enum
 Члены
 Члены
 Описание
 EvalAllNewLayers
 Значение: 2. Отслеживается создание нового слоя в текущем чертеже и прикрепленных внешних ссылках.
 EvalNewXrefLayers
 Значение: 1. Отслеживаются только слои внешних ссылок.
 NoNewLayerEvaluation
 Значение: 0. Создание нового слоя не отслеживается.
 Описание
 Перечисление LayerEvaluation используется для настройки переменной заголовка LAYEREVAL. Переменная LAYEREVAL определяет, должен ли список слоев проверяться на предмет новых слоев при добавлении к чертежу или к прикрепленным внешним ссылкам.
 Ваши комментарии по поводу этого топика: Послать отзыв!