Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.SplineEntity3d.SetKnotAt
 Послать отзыв
 Метод переопределяет значение узла с указанным индексом. В текущей версии не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetKnotAt( int i, double value );
Копировать Код
Public Sub SetKnotAt( i As Integer, value As Double )
 Параметры
 Параметры
 Описание
 i
 Входной индекс узла. Тип int.
 value
 Новое значение узла. Тип double.
 Описание
 Метод переопределяет значение узла с указанным индексом.
 Замечания
 В текущей версии этот метод не реализован.
 Ссылки
 Teigha.Geometry.SplineEntity3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!