Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MlineStyle.EndInnerArcs
 Послать отзыв
 Свойство управляет отображением внутренних дуг на завершающем торце мультилинии.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool EndInnerArcs;
Копировать Код
Public Property EndInnerArcs As Boolean
 Возвращает
 Возвращает true, если отображение внутренних дуг на завершающем торце мультилинии включено. В противном случае возвращает false.
 Описание
 Свойство управляет отображением внутренних дуг на завершающем торце мультилинии.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MlineStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!