Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство BlockReference.TreatAsBlockRefForExplode
 Послать отзыв
 Синтаксис
C#
Visual Basic
public bool TreatAsBlockRefForExplode;
Public Property TreatAsBlockRefForExplode() As bool
 Описание
 Вызывается командой nanoCAD EXPLODE, чтобы определить, как объект будет разорван.
 Условия
 Только на чтение Note Значение по умолчанию равно true,и результатом будет использование метода explode() геометрического объекта.
 Если класс геометрического объекта переопределяет данный метод и возвращает true, то команда nanoCAD EXPLODE обработает геометрический объект, как если бы это был реальный объект BlockReference, и будет использовать внутренний код nanoCAD для выполнения операции разрыва.
 Ссылки
 Teigha.DatabaseServices.BlockReference, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!