Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FieldCodeWithChildren.Children
 Послать отзыв
 Свойство Children обеспечивает доступ к массиву вложенных (дочерних) полей данного объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public Field[] Children;
Копировать Код
Public ReadOnly Property Children As Field()
 Возвращает
 Возвращает массив дочерних полей. Тип Field[].
 Описание
 Свойство Children обеспечивает доступ к массиву вложенных (дочерних) полей данного объекта.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.FieldCodeWithChildren, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!