Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FullDwgVersion.MajorVersion
 Послать отзыв
 Свойство возвращает основную (major) версию DWG.
 Синтаксис
C#
Visual Basic
Копировать Код
public DwgVersion MajorVersion;
Копировать Код
Public ReadOnly Property MajorVersion As DwgVersion
 Возвращает
 Возвращает основную версию DWG. Значение из перечисления DwgVersion.
 Описание
 Свойство возвращает основную (major) версию DWG.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.FullDwgVersion, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!