Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MText.SetStaticColumns
 Послать отзыв
 Метод задает столбцу (колонке текста) тип StaticColumns с заданными шириной, просветом между столбцами и количеством столбцов.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetStaticColumns( double width, double gutter, int count );
Копировать Код
Public Sub SetStaticColumns( width As Double, gutter As Double, count As Integer )
 Параметры
 Параметры
 Описание
 width
 Ширина столбца. Тип double.
 gutter
 Расстояние между столбцами текста (column gutter). Тип double.
 count
 Количество столбцов (колонок) текста. Тип int.
 Описание
 Метод задает столбцу (колонке текста) тип StaticColumns с заданными шириной, просветом между столбцами и количеством столбцов.
 Ссылки
 Teigha.DatabaseServices.MText, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!