Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Перечисление Teigha.DatabaseServices.UpdateAction
 Послать отзыв
 This is record Teigha::DatabaseServices::UpdateAction.
 Синтаксис
C#
Visual Basic
public enum UpdateAction { Ignore = 1, None = 0, UpdateRequired = 2 }
Public Enum UpdateAction Ignore = 1 None = 0 UpdateRequired = 2 End Enum
 Ваши комментарии по поводу этого топика: Послать отзыв!