Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.DimfxlenOn
 Послать отзыв
 Свойство позволяет определить, имеют ли выносные линии фиксированную длину.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool DimfxlenOn;
Копировать Код
Public Property DimfxlenOn As Boolean
 Возвращает
 Возвращает true, если выносные линии имеют фиксированную длину. В противном случае возвращает false.
 Описание
 Свойство позволяет определить, имеют ли выносные линии фиксированную длину.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!