Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBDictionaryEntry.Key
 Послать отзыв
 Свойство обеспечивает доступ к уникальному имени записи словаря.
 Синтаксис
C#
Visual Basic
Копировать Код
public String Key;
Копировать Код
Public Property Key() As String
 Возвращает
 Обеспечивает доступ к значению свойства Key в виде экземпляра String.
 Описание
 Свойство обеспечивает доступ к уникальному имени записи словаря.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.DBDictionaryEntry, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!