Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PolygonMesh.IsNClosed
 Послать отзыв
 Свойство позволяет определить, является ли сеть замкнутой в направлении N.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsNClosed;
Копировать Код
Public Property IsNClosed() As Boolean
 Возвращает
 Возвращает true, если сеть является замкнутой в направлении N. В противном случае возврщает false.
 Описание
 Свойство позволяет определить, является ли сеть замкнутой в направлении N.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.PolygonMesh, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!