Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.SetContentLayout
 Послать отзыв
 Метод позволяет задать новый макет для первого элемента содержимого заданной ячейки.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetContentLayout( int row, int column, CellContentLayout layout );
Копировать Код
Public virtual Sub SetContentLayout( row As Integer, column As Integer, layout As CellContentLayout )
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 layout
 Новый макет для элемента содержимого ячейки. Значение из перечисления Teigha.DatabaseServices.CellContentLayout.
 col
 Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
 Описание
 Метод позволяет задать новый макет для первого элемента содержимого заданной ячейки.
 Замечания
 Для получения того же результата предпочтительнее использовать Table.Cells[row,column].ContentLayout.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!