Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GraphNode.NextCycleNode
 Послать отзыв
 Свойство возвращает следующую исходящую циклическую ссылку данного узла.
 Синтаксис
C#
Visual Basic
Копировать Код
public GraphNode NextCycleNode;
Копировать Код
Public ReadOnly Property NextCycleNode As GraphNode
 Возвращает
 Возвращает следующую исходящую циклическую ссылку данного узла. Тип GraphNode.
 Описание
 Свойство возвращает следующую исходящую циклическую ссылку данного узла. Тот же результат дает вызов CycleOut(0).
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.GraphNode, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!