Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MText.Rotation
 Послать отзыв
 Свойство представляет угол поворота данного объекта MText (в радианах).
 Синтаксис
C#
Visual Basic
Копировать Код
public double Rotation;
Копировать Код
Public Property Rotation As Double
 Возвращает
 Возвращает угол поворота текста. Тип double.
 Описание
 Свойство представляет угол поворота данного объекта MText (в радианах).
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MText, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!