Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LayerStateManager.LayerStateToBeDeleted
 Послать отзыв
 Событие создается, если состояние слоя будет удалено.
 Синтаксис
C#
Visual Basic
Копировать Код
public event LayerStateEventHandler LayerStateToBeDeleted;
Копировать Код
Public Event LayerStateToBeDeleted As LayerStateEventHandler
 Описание
 Событие создается, если состояние слоя будет удалено.
 Ссылки
 Teigha.DatabaseServices.LayerStateManager, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!