Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SubentRef.CopyFrom
 Послать отзыв
 Метод позволяет скопировать в данный объект содержимое указанного объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public void CopyFrom( ref SubentRef source );
Копировать Код
Public Sub CopyFrom( ByRef source As SubentRef )
 Параметры
 Параметры
 Описание
 source
 Ссылка на подобъект, являющийся источником данных. Тип SubentRef.
 Описание
 Метод позволяет скопировать в данный объект содержимое указанного объекта.
 Ссылки
 Teigha.DatabaseServices.SubentRef, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!