Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство TextStyleTableRecord.PriorSize
 Послать отзыв
 Синтаксис
C#
Visual Basic
public double PriorSize;
Public Property PriorSize() As Double
 Описание
 Обеспечивает доступ к высоте текста, используемого последним текстом, созданным с использованием текстового стиля. Эта величина автоматически обновляется nanoCAD после создания любого текстового объекта, который ссылается на эту строку TextStyleTableRecord. Если значение свойства textSize для этого текстового стиля равно 0, то значение priorSize является высотой текста по умолчанию для следующего текста, который будет создан, используя данный текстовый стиль.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.TextStyleTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!