Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CellContent.GetBlockAttributeValue
 Послать отзыв
 Метод предоставляет значение атрибута для указанного определения атрибута.
 Синтаксис
C#
Visual Basic
Копировать Код
public String GetBlockAttributeValue( DatabaseServices.ObjectId attDefId );
Копировать Код
Public Function GetBlockAttributeValue( attDefId As DatabaseServices.ObjectId ) As String
 Параметры
 Параметры
 Описание
 attDefId
 Входной идентификатор объекта определения атрибута. Тип DatabaseServices.ObjectId.
 Возвращает
 Возвращает значение атрибута. Тип String.
 Описание
 Метод предоставляет значение атрибута для указанного идентификатора объекта определения атрибута.
 Ссылки
 Teigha.DatabaseServices.CellContent, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!