Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbCurve3d.DefinitionData
 Послать отзыв
 Свойство DefinitionData возвращает все данные, определяющие сплайн.
 Синтаксис
C#
Visual Basic
Копировать Код
public NurbCurve3dData DefinitionData;
Копировать Код
Public ReadOnly Property DefinitionData As NurbCurve3dData
 Возвращает
 Возвращает данные, определяющие этот сплайн. Тип NurbCurve3dData.
 Описание
 Свойство DefinitionData возвращает все данные, определяющие сплайн. Если сплайн не является рациональным, массив весов будет пустым.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.NurbCurve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!