Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Light.ShadowType
 Послать отзыв
 Свойство представляет тип тени для данного источника света.
 Синтаксис
C#
Visual Basic
Копировать Код
public ShadowType ShadowType;
Копировать Код
Public Property ShadowType As ShadowType
 Возвращает
 Возвращает тип тени для источника света. Перечисление ShadowType.
 Описание
 Свойство представляет тип тени для данного источника света.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Light, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!