Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.XrefGraph.GetXrefNode
 Послать отзыв
 Метод позволяет получить объект XrefGraphNode с указанным именем.
 Синтаксис
C#
Visual Basic
Копировать Код
public XrefGraphNode GetXrefNode( ref String name );
Копировать Код
Public Function GetXrefNode( ByRef name As String ) As XrefGraphNode
 Параметры
 Параметры
 Описание
 name
 Имя узла. Тип String.
 Возвращает
 Возвращает объект XrefGraphNode, если узел найден, или null в противном случае.
 Описание
 Метод позволяет получить объект XrefGraphNode с указанным именем.
 Ссылки
 Teigha.DatabaseServices.XrefGraph, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!