Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GripDataCollection.Add
 Послать отзыв
 Метод добавляет в коллекцию объект GripData.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Add( ref GripData gripData );
Копировать Код
Public Sub Add( ByRef gripData As GripData )
 Параметры
 Параметры
 Описание
 gripData
 Входной объект, который требуется добавить в данную коллекцию. Тип GripData.
 Описание
 Метод добавляет в коллекцию указанный объект GripData.
 Ссылки
 Teigha.DatabaseServices.GripDataCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!