Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.OsnapPointRef.LastPointRef
 Послать отзыв
 Свойство LastPointRef обеспечивает доступ к последней точке привязки, которая использовалась для перпендикулярного или касательного типа объектной привязки.
 Синтаксис
C#
Visual Basic
Копировать Код
public OsnapPointRef LastPointRef;
Копировать Код
Public Property LastPointRef As OsnapPointRef
 Возвращает
 Возвращает указатель на интересующую точку объектной привязки. Тип OsnapPointRef.
 Описание
 Свойство LastPointRef обеспечивает доступ к последней точке привязки, которая использовалась для перпендикулярного или касательного типа объектной привязки.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.OsnapPointRef, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!