Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.TransactionManager.StartTransaction
 Послать отзыв
 Этот метод запускает новую транзакцию.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual Transaction StartTransaction();
Копировать Код
Public virtual Function StartTransaction() As Transaction
 Возвращает
 Возвращает объект Transaction.
 Описание
 Этот метод запускает новую транзакцию.
 Ссылки
 Teigha.DatabaseServices.TransactionManager, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!