Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.LoftAng1
 Послать отзыв
 Синтаксис
C#
Visual Basic
public double LoftAng1;
Public Property LoftAng1() As Double
 Описание
 Возвращает или устанавливает текущее значение LOFTANG1 для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!