Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.VerticalCellMargin
 Послать отзыв
 Данное свойство представляет вертикальные поля ячеек объекта Table.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual double VerticalCellMargin;
Копировать Код
Public virtual Property VerticalCellMargin() As double
 Возвращает
 Возвращает текущие размеры вертикальных полей ячеек, double.
 Описание
 Данное свойство представляет вертикальные поля ячеек объекта Table.
 Замечания
 Для получения того же результата предпочтительнее использовать свойство Table.Cells[row, column].VerticalLine.Margin.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!