Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Scale2d.MultiplyBy
 Послать отзыв
 Метод реализует умножение данного вектора масштабирования на заданный скалярный множитель.
 Синтаксис
C#
Visual Basic
Копировать Код
public Scale2d MultiplyBy( double factor );
Копировать Код
Public Function MultiplyBy( factor As Double ) As Scale2d
 Параметры
 Параметры
 Описание
 factor
 Входное значение множителя. Тип double.
 Возвращает
 Возвращает результат умножения данного объекта на множитель factor. Тип Scale2d.
 Описание
 Метод реализует умножение данного вектора масштабирования на переданный в аргументе скалярный множитель factor.
 Ссылки
 Teigha.Geometry.Scale2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!