Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ExtrudedSurface.SetExtrude
 Послать отзыв
 Метод позволяет задать параметры, определяющие экструдированную поверхность.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetExtrude( Vector3d sweepVec, ref DatabaseServices.SweepOptions sweepOptions );
Копировать Код
Public Sub SetExtrude( sweepVec As Vector3d, ByRef sweepOptions As DatabaseServices.SweepOptions )
 Параметры
 Параметры
 Описание
 sweepVec
 Новый вектор выдавливания. Тип Vector3d.
 sweepOptions
 Опции выдавливания из перечисления DatabaseServices.SweepOptions.
 Описание
 Метод позволяет задать параметры, определяющие экструдированную поверхность. Дополнительные параметры операции выдавливания можно настроить с помощью аргумента sweepOptions.
 Замечания
 Этот метод реализован только для пространственного моделирования, в случае иных моделлеров выбрасывает исключение eNotImplementedYet.
 Ссылки
 Teigha.DatabaseServices.ExtrudedSurface, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!