Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.HasFormula
 Послать отзыв
 Метод позволяет определить, является ли формулой заданный по индексу элемент содержимого ячейки.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual bool HasFormula( int row, int column, int contentIndex );
Копировать Код
Public virtual Function HasFormula( row As Integer, column As Integer, contentIndex As Integer ) As Boolean
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 contentIndex
 Индекс элемента содержимого ячейки, тип int. Индекс должен быть больше или равен нулю и меньше количества элементов содержимого в ячейке.
 col
 Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
 Возвращает
 Возвращает true, если искомый элемент содержимого является формулой, и false в противном случае.
 Описание
 Метод позволяет определить, является ли формулой заданный по индексу элемент содержимого ячейки.
 Замечания
 Для получения того же результата предпочтительнее использовать Table.Cells[row,column].Contents[i].HasFormula.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!