Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Spline.ToPolyline
 Послать отзыв
 Метод предназначен для аппроксимации данного сплайна полилинией. Входные аргументы метода позволяют ограничить сверху количество вершин создаваемой полилинии, а в случае плоского сплайна разрешить использование круглых дуг и приведение результата к типу Polyline.
 Синтаксис
C#
Visual Basic
Копировать Код
public Curve ToPolyline( unsigned int numOfVertices, bool bConvertAsArcs, bool bToLWPolyline );
Копировать Код
Public Function ToPolyline( numOfVertices As unsigned int, bConvertAsArcs As Boolean, bToLWPolyline As Boolean ) As Curve
 Параметры
 Параметры
 Описание
 numOfVertices
 Ограничение сверху на количество вершин у создаваемой полилинии. Тип unsigned int. Передаваемое значение не может быть меньше количества определяющих точек сплайна.
 bConvertAsArcs
 Флаг, определяющий, следует ли сегменты полилинии конвертировать в круглые дуги, если сплайн плоский. Тип bool.
 bToLWPolyline
 Флаг, определяющий, следует ли приводить результат аппроксимации к типу Polyline, если сплайн плоский. Тип bool.
 Возвращает
 Возвращает результат аппроксимации сплайна полилинией. Тип Curve.
 Описание
 Метод предназначен для аппроксимации данного сплайна полилинией.
 Аргумент numOfVertices позволяет влиять на точность аппроксимации за счет ограничения сверху количества вершин создаваемой полилинии.
 Результирующая кривая может иметь тип Polyline, Polyline2d или Polyline3d. Если хотя бы одна из точек сплайна не лежит в плоскости XY, то создается полилиния типа Polyline3d, состоящая всегда только из линейных сегментов.
 Если сплайн является плоским, и аргумент bConvertAsArcs принимает значение true, то результирующая полилиния состоит из сегментов круглых дуг, иначе - из линейных сегментов.
 Если сплайн является плоским, и аргумент bToLWPolyline принимает значение true, то результирующая полилиния имеет тип Polyline, в противном случае - Polyline2d.
 Ссылки
 Teigha.DatabaseServices.Spline, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!