Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CurveBoundary.Set
 Послать отзыв
 Метод позволяет переопределить все параметры данной криволинейной границы.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Set( int numElements, ref Entity3d[] curve3ds, ref Curve2d[] curve2ds, bool orientation3d, bool orientation2d );
Копировать Код
Public Sub Set( numElements As Integer, ByRef curve3ds As Entity3d(), ByRef curve2ds As Curve2d(), orientation3d As Boolean, orientation2d As Boolean )
 Параметры
 Параметры
 Описание
 numElements
 Количество элементов в данной граничной кривой. Тип int.
 curve3ds
 Массив 3D-кривых каждого элемента в граничной кривой. Тип Curve3d[].
 curve2ds
 Массив 2D-кривых каждого элемента в граничной кривой. Тип Curve2d[].
 orientation3d
 Флаг ориентации для каждого элемента 3D-кривой (обычная или обратная). Имеет смысл только если аргумент curve3ds не равен NULL. Тип bool.
 orientation2d
 Флаг ориентации для каждого элемента 2D-кривой (обычная или обратная). Имеет смысл только если аргумент curve2ds не равен NULL. Тип bool.
 Описание
 Метод позволяет переопределить все параметры данной криволинейной границы.
 Замечания
 Если текущий экземпляр не пуст и владеет данными своего определения, то при выполнении метода будет удалена вся геометрия существующего определения. Если какой-либо элемент массива curve3ds имеет значение NULL, то соответствующий элемент orientation3d неприменим. Если какой-либо элемент массива curve2ds имеет значение NULL, то соответствующий элемент orientation2d неприменим.
 Ссылки
 Teigha.Geometry.CurveBoundary, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!