Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.BoundBlock3d.BoundBlock3d
 Послать отзыв
 Конструктор по умолчанию класса BoundBlock3d.
 Синтаксис
C#
Visual Basic
Копировать Код
public BoundBlock3d();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса BoundBlock3d. Создает граничную рамку с минимальной и максимальной точками в начале системы координат.
 Ссылки
 Teigha.Geometry.BoundBlock3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!