Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.UcsBase
 Послать отзыв
 Синтаксис
C#
Visual Basic
public DatabaseServices::ObjectId UcsBase;
Public Property UcsBase() As DatabaseServices.ObjectId
 Описание
 Обеспечивает доступ к Id таблицы записей UCS, которая определяет положение и ориентацию настроек ортогонального UCS для пространства модели базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!