Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve2dCollection.CopyTo
 Послать отзыв
 Метод копирует элементы этой коллекции в предоставленный массив, начиная с указанного индекса.
 Синтаксис
C#
Visual Basic
Копировать Код
public void CopyTo( ref Curve2d[] array, int index );
Копировать Код
Public Sub CopyTo( ByRef array() As Curve2d, index As Integer )
 Параметры
 Параметры
 Описание
 array
 Массив, в который следует копировать элементы коллекции. Тип Curve2d[].
 index
 Индекс в массиве, начиная с которого в массив копируются элементы коллекции. Тип int.
 Описание
 Метод копирует элементы этой коллекции в массив array, начиная с индекса index.
 Ссылки
 Teigha.Geometry.Curve2dCollection, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!