Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocArrayPathParameters
 Послать отзыв
 Класс предоставляет интерфейс для управления параметрами ассоциативного массива по траекториии.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::DatabaseServices::AssocArrayParameters Teigha::DatabaseServices::AssocArrayCommonParameters Teigha::DatabaseServices::AssocArrayPathParameters
 Синтаксис
C#
Visual Basic
Копировать Код
[TypeDescriptionProvider("Teigha.ComponentModel.TypeDescriptionProvider`1[[Teigha.DatabaseServices.AssocArrayPathParameters, TD_MgdDbConstraints]], TD_MgdDbConstraints")] [Teigha.Runtime.Wrapper("OdDbAssocArrayPathParameters")] public class AssocArrayPathParameters : AssocArrayCommonParameters;
Копировать Код
<TypeDescriptionProvider("Teigha.ComponentModel.TypeDescriptionProvider`1[[Teigha.DatabaseServices.AssocArrayPathParameters, TD_MgdDbConstraints]], TD_MgdDbConstraints")> <Teigha.Runtime.Wrapper("OdDbAssocArrayPathParameters")> Public Class AssocArrayPathParameters Inherits AssocArrayCommonParameters
 Описание
 Класс предоставляет интерфейс для управления параметрами ассоциативного массива по траекториии.
 Методы
 Конструкторы
 Teigha.DatabaseServices.AssocArrayParameters
 ПоказатьInternalУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 AssocArrayParameters
 This is AssocArrayParameters, a member of class AssocArrayParameters. (Унаследован от AssocArrayParameters)
 Teigha.DatabaseServices.AssocArrayCommonParameters
 ПоказатьInternalУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 AssocArrayCommonParameters
 This is AssocArrayCommonParameters, a member of class AssocArrayCommonParameters. (Унаследован от AssocArrayCommonParameters)
 Teigha.DatabaseServices.AssocArrayPathParameters
 Имя
 Описание
 AssocArrayPathParameters
 Это обзор перегрузок AssocArrayPathParameters.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.DatabaseServices.AssocArrayParameters
 Имя
 Описание
 AssocArrayParameters Методы
 Ниже перечислены методы класса AssocArrayParameters.
 AssocArrayParameters Свойства
 Ниже перечислены свойства класса AssocArrayParameters.
 Teigha.DatabaseServices.AssocArrayCommonParameters
 Имя
 Описание
 AssocArrayCommonParameters Методы
 Ниже перечислены методы класса AssocArrayCommonParameters.
 AssocArrayCommonParameters Свойства
 Ниже перечислены свойства класса AssocArrayCommonParameters.
 Teigha.DatabaseServices.AssocArrayPathParameters
 Имя
 Описание
 AssocArrayPathParameters Перечисления
 Ниже перечислены перечисления класса AssocArrayPathParameters.
 AssocArrayPathParameters Методы
 Ниже перечислены методы класса AssocArrayPathParameters.
 AssocArrayPathParameters Свойства
 Ниже перечислены свойства класса AssocArrayPathParameters.
 Ссылки
 AssocArrayPathParameters Конструктор, AssocArrayPathParameters Перечисления, AssocArrayPathParameters Методы, AssocArrayPathParameters Свойства, Методы, Топики, AssocArrayPathParameters Перечисления, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!