Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.SetIsAutoScale
 Послать отзыв
 Метод позволяет задать состояние флага автомасштабирования контента в указанной ячейке таблицы.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetIsAutoScale( int row, int column, int contentIndex, bool autoFit );
Копировать Код
Public virtual Sub SetIsAutoScale( row As Integer, column As Integer, contentIndex As Integer, autoFit As Boolean )
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 contentIndex
 Индекс элемента содержимого ячейки, тип int. Индекс должен быть больше или равен нулю и меньше количества элементов содержимого в ячейке.
 autoFit
 Состояние флага автомасштабирования, тип bool.
 col
 Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
 Описание
 Метод позволяет задать состояние флага автомасштабирования контента в указанной ячейке таблицы. Если этот флаг установлен, то при вставке блока в ячейку объект Table автоматически вычисляет масштаб и точку вставки вхождения блока.
 Замечания
 Для получения того же результата предпочтительнее использовать Table.Cells[row,column].Contents[i].IsAutoScale.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!