Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 DimStyleTableRecord.IsModifiedForRecompute
 Послать отзыв
 Свойство предназначено для получения состояния размерного стиля для обновления всех объектов, ссылающихся на этот стиль.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsModifiedForRecompute { get; }
Копировать Код
Public ReadOnly Property IsModifiedForRecompute As Boolean
 Возвращает
 Возвращает тип данных bool.
 Описание
 Свойство предназначено для быстрого получения состояния размерного стиля для обновления всех объектов, которые ссылаются на него. В качестве значений свойства доступны следующие варианты:
true - размерный стиль был изменен, нужно обновить все объекты, которые ссылаются на него;
false – размерный стиль не был изменен.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.DimStyleTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!