Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Dimtfill
 Послать отзыв
 Синтаксис
C#
Visual Basic
public int Dimtfill;
Public Property Dimtfill() As Integer
 Описание
 Возвращает или устанавливает состояние цвета фона размерности, который может принимать одно из трех значений:
0 означает, что цвет фона не доступен;
1 означает использование цвета фона из dimtfillclr;
2 означает, что используется цвет фона чертежа.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!