Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.RemoveTextField
 Послать отзыв
 Метод предназначен для удаления текстового поля из этого объекта Dimension, если такое поле имеется.
 Синтаксис
C#
Visual Basic
Копировать Код
public void RemoveTextField();
Копировать Код
Public Sub RemoveTextField()
 Описание
 Метод предназначен для удаления текстового поля из этого объекта Dimension, если такое поле имеется.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!