Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SurfaceSliceResults.NegativeHalfSurface
 Послать отзыв
 Свойство NegativeHalfSurface представляет отрицательную половину поверхности, разрезанной плоскостью или другой поверхностью.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.Surface NegativeHalfSurface;
Копировать Код
Public Property NegativeHalfSurface As DatabaseServices.Surface
 Возвращает
 Возвращает отрицательную половину разрезанной поверхности. Тип DatabaseServices.Surface.
 Описание
 Свойство NegativeHalfSurface представляет отрицательную половину поверхности, разрезанной плоскостью или другой поверхностью.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.SurfaceSliceResults, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!