Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MText.NonBreakSpace
 Послать отзыв
 Свойство возвращает строку неразрывного пробела "~".
 Синтаксис
C#
Visual Basic
Копировать Код
public static String NonBreakSpace;
Копировать Код
Public Shared ReadOnly Property NonBreakSpace As String
 Возвращает
 Возвращает строку неразрывного пробела. Тип String.
 Описание
 Свойство возвращает строку неразрывного пробела "~". Может использоваться вместо строковой константы "~", чтобы сделать код более понятным. При использовании в строке, возвращаемой свойством MText.Contents, "~" означает неразрывный пробел.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.MText, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!