Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PolyFaceMesh.NumFaces
 Послать отзыв
 Свойство предоставляет доступ к количеству граней в сети PolyFaceMesh.
 Синтаксис
C#
Visual Basic
Копировать Код
public int NumFaces;
Копировать Код
Public Property NumFaces() As Integer
 Возвращает
 Возвращает количество граней в сети PolyFaceMesh, тип int.
 Описание
 Свойство предоставляет доступ к количеству граней в сети PolyFaceMesh.
 Для PolyFaceMeshes, созданных с помощью API, это значение будет точно отражать количество записей FaceRecord, добавленных к PolyFaceMesh. Для PolyFaceMeshes, созданных с помощью команды PFACE, это значение может быть меньше, чем количество FaceRecord, принадлежащих PolyFaceMesh.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.PolyFaceMesh, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!