Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 BlockTableRecord.GetEnumerator()
 Послать отзыв
 Метод предназначен для перебора в цикле содержимого определения блока.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual BlockTableRecordEnumerator GetEnumerator();
Копировать Код
Public Overridable Function GetEnumerator() As BlockTableRecordEnumerator
 Возвращает
 Возвращает тип данных BlockTableRecordEnumerator.
 Описание
 Метод возвращает счетчик, с помощью которого можно перебрать содержимое определения блока в цикле.
 Ссылки
 Teigha.DatabaseServices.BlockTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!