Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeader.GetLastVertex
 Послать отзыв
 Метод позволяет определить последнюю вершину выносной линии с указанным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d GetLastVertex( int leaderLineIndex );
Копировать Код
Public Function GetLastVertex( leaderLineIndex As Integer ) As Point3d
 Параметры
 Параметры
 Описание
 leaderLineIndex
 Индекс выносной линии. Тип int.
 Возвращает
 Возвращает точку последней вершины. Тип Point3d.
 Описание
 Метод позволяет определить последнюю вершину выносной линии с указанным индексом.
 Ссылки
 Teigha.DatabaseServices.MLeader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!