Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.KnotCollection.CopyTo
 Послать отзыв
 Метод копирует данную коллекцию узлов в указанный массив.
 Синтаксис
C#
Visual Basic
Копировать Код
public void CopyTo( ref double[] a, int index );
Копировать Код
Public Sub CopyTo( ByRef a As Double(), index As Integer )
 Параметры
 Параметры
 Описание
 a
 Массив, в который копируются значения из коллекции. Тип double[].
 index
 Индекс в массиве, начиная с которого в массиве сохраняются элементы коллекции. Тип int.
 Описание
 Метод копирует данную коллекцию узлов в указанный массив.
 Ссылки
 Teigha.Geometry.KnotCollection, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!