Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.RenderGlobal.Dimensions
 Послать отзыв
 Свойство Dimensions представляет размеры изображения для рендеринга.
 Синтаксис
C#
Visual Basic
Копировать Код
public DimensionsParameter Dimensions;
Копировать Код
Public Property Dimensions As DimensionsParameter
 Возвращает
 Возвращает размеры изображения. Тип DimensionsParameter.
 Описание
 Свойство Dimensions представляет размеры изображения для рендеринга.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.RenderGlobal, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!