Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PolygonMesh.NSurfaceDensity
 Послать отзыв
 Свойство предоставляет доступ к поверхностной плотности сети в направлении N.
 Синтаксис
C#
Visual Basic
Копировать Код
public short NSurfaceDensity;
Копировать Код
Public Property NSurfaceDensity() As short
 Возвращает
 Возвращает или задает поверхностную плотность сети в направлении M.
 Описание
 Свойство предоставляет доступ к поверхностной плотности сети в направлении N.
 Поверхностная плотность N — это количество вершин в направлении N после выполнения операции аппроксимации поверхности. Она используется вместо значения размера N, если PolyMeshType отличается от SimpleMesh.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.PolygonMesh, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!