Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector3d.MultiplyBy
 Послать отзыв
 Метод реализует умножение данного вектора на заданное число.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d MultiplyBy( double value );
Копировать Код
Public Function MultiplyBy( value As Double ) As Vector3d
 Параметры
 Параметры
 Описание
 value
 Входной множитель. Тип double.
 Возвращает
 Возвращает вектор типа Vector3d.
 Описание
 Метод реализует умножение данного вектора на заданное вещественное число value.
 Ссылки
 Teigha.Geometry.Vector3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!