Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FormattedTableData.SetOverride
 Послать отзыв
 Метод позволяет задать переопределение для ячейки, строки, столбца или элемента содержимого ячейки.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetOverride( int row, int column, int content, CellProperties cellProperty );
Копировать Код
Public Overridable Sub SetOverride( row As Integer, column As Integer, content As Integer, cellProperty As CellProperties )
 Параметры
 Параметры
 Описание
 row
 Индекс строки. Тип int. Индекс может равняться -1.
 column
 Индекс столбца. Тип int. Индекс может равняться -1.
 content
 Индекс элемента содержимого ячейки. Тип int. Индекс может равняться -1.
 cellProperty
 Задаваемое переопределение из перечисления GridProperties.
 Описание
 Метод позволяет задать переопределение для ячейки, строки, столбца или элемента содержимого ячейки.
 Чтобы указать элемент содержимого ячейки, следует задать допустимые индексы строки, столбца и элемента содержимого ячейки. Чтобы указать ячейку, следует задать допустимые индексы строки и столбца, а также -1 в качестве индекса элемента содержимого ячейки. Чтобы указать строку, следует задать допустимый индекс строки и -1 для индексов столбца и элемента содержимого ячейки. Чтобы указать столбец, следует задать допустимый индекс столбца и -1 для индексов строки и элемента содержимого ячейки.
 Ссылки
 Teigha.DatabaseServices.FormattedTableData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!