Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DimAssoc.Copied
 Послать отзыв
 Метод уведомления, который вызывается в случае создания копии указанного объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Copied( ref DBObject pObj, ref DBObject pNewObj );
Копировать Код
Public Sub Copied( ByRef pObj As DBObject, ByRef pNewObj As DBObject )
 Параметры
 Параметры
 Описание
 pObj
 Указатель на копируемый объект базы данных. Тип DBObject.
 pNewObj
 Указатель на вновь созданную копию объекта pObj в базе данных. Тип DBObject.
 Описание
 Метод уведомления, который вызывается в случае создания копии объекта, представленного указателем pObj.
 Ссылки
 Teigha.DatabaseServices.DimAssoc, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!