Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство RasterImage.Rotation
 Послать отзыв
 Синтаксис
C#
Visual Basic
public double Rotation;
Public Property Rotation() As Double
 Описание
 Обеспечивает доступ к углу поворота в радианах.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.RasterImage, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!