Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SweepOptionsBuilder.BasePoint
 Послать отзыв
 Свойство BasePoint представляет базовую точку для выравнивания вытягиваемого объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d BasePoint;
Копировать Код
Public Property BasePoint As Point3d
 Возвращает
 Возвращает базовую точку. Тип Point3d.
 Описание
 Свойство BasePoint представляет базовую точку для выравнивания вытягиваемого объекта.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.SweepOptionsBuilder, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!