Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.OsnapPointRef.UpdateXrefSubentPath
 Послать отзыв
 Метод выполняет обновление путей подобъектов внешних ссылок (Xref).
 Синтаксис
C#
Visual Basic
Копировать Код
public override void UpdateXrefSubentPath();
Копировать Код
Public Overrides Sub UpdateXrefSubentPath()
 Описание
 Метод выполняет обновление путей подобъектов внешних ссылок (Xref).
 Ссылки
 Teigha.DatabaseServices.OsnapPointRef, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!