Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.Dimlwd
 Послать отзыв
 Свойство задает или возвращает толщину линии выноски, размерных и выносных линий.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.LineWeight Dimlwd;
Копировать Код
Public Property Dimlwd As DatabaseServices.LineWeight
 Возвращает
 Возвращает вес линий как объект типа DatabaseServices.LineWeight.
 Описание
 Свойство задает или возвращает толщину (вес) линии выноски, размерных и выносных линий. Это свойство также влияет на толщину границы вокруг поля размерного текста, когда свойство Dimgap отрицательно.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!