Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Point2dCollection.Contains
 Послать отзыв
 Метод позволяет определить, является ли указанный объект Point2d членом данной коллекции.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool Contains( Point2d p );
Копировать Код
Public Function Contains( p As Point2d ) As Boolean
 Параметры
 Параметры
 Описание
 p
 Входной проверяемый объект. Тип Point2d.
 Возвращает
 Возвращает true, если объект p присутствует в коллекции. В противном случае возвращает false.
 Описание
 Метод позволяет определить, является ли указанный объект Point2d членом данной коллекции.
 Ссылки
 Teigha.Geometry.Point2dCollection, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!