Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MlineStyleElement
 Послать отзыв
 Эта структура инкапсулирует данные о цвете, смещении и типе линий, используемые объектами MlineStyle.
 Иерархия классов
Teigha::DatabaseServices::MlineStyleElement
 Синтаксис
C#
Visual Basic
Копировать Код
public struct MlineStyleElement
Копировать Код
Public Structure MlineStyleElement
 Описание
 Эта структура инкапсулирует данные о цвете, смещении и типе линий, используемые объектами MlineStyle.
 Методы
 Конструкторы
 Имя
 Описание
 MlineStyleElement
 Конструктор класса MlineStyleElement. Создает элемент стиля с указанным смещением, цветом и идентификатором типа линии.
 Топики
 Имя
 Описание
 MlineStyleElement Методы
 Ниже перечислены методы класса MlineStyleElement.
 MlineStyleElement Свойства
 Ниже перечислены свойства класса MlineStyleElement.
 Ссылки
 MlineStyleElement Методы, MlineStyleElement Свойства, Методы, Топики, MlineStyleElement Методы, MlineStyleElement Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!