Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.TextPosition
 Послать отзыв
 Свойство позволяет управлять 3D-точкой привязки текста.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d TextPosition;
Копировать Код
Public Property TextPosition As Point3d
 Возвращает
 Возвращает точку привязки текста. Тип Point3d.
 Описание
 Свойство задает или возвращает точку привязки текста в виде значения Point3d. Это свойство действительно, только если для свойства UseDefaultTextPosition установлено значение false.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!