Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LinkedTableData.SetDataType
 Послать отзыв
 Метод позволяет задать тип данных для первого элемента содержимого указанной ячейки таблицы.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetDataType( int row, int column, DatabaseServices.DataType dataType, DatabaseServices.UnitType unitType );
Копировать Код
Public Overridable Sub SetDataType( row As Integer, column As Integer, dataType As DatabaseServices.DataType, unitType As DatabaseServices.UnitType )
 Параметры
 Параметры
 Описание
 row
 Индекс строки. Тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 column
 Индекс столбца. Тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице.
 dataType
 Тип данных. Перечисление DatabaseServices.DataType.
 unitType
 Тип единиц измерения. Перечисление DatabaseServices.UnitType.
 Описание
 Метод позволяет задать тип данных для первого элемента содержимого указанной ячейки таблицы.
 Замечания
 Метод выбрасывает исключение eInvalidInput, если индексы строки и/или столбца выходят за допустимые пределы. Если содержимое ячейки недоступно для редактирования, метод выбрасывает исключение eIsWriteProtected.
 Ссылки
 Teigha.DatabaseServices.LinkedTableData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!