Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.RegAppTableRecord
 Послать отзыв
 Экземпляры этого класса представляют записи в таблице RegAppTable (известной как таблица символов APPID в DXF). Каждая из этих записей представляет собой ID приложения, используемый для идентификации группы расширенных данных, прикрепленных к объектам в базе данных чертежа.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::GraphicsInterface::Drawable Teigha::DatabaseServices::DBObject Teigha::DatabaseServices::SymbolTableRecord Teigha::DatabaseServices::RegAppTableRecord
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("AcDbRegAppTableRecord")] public class RegAppTableRecord : SymbolTableRecord;
Копировать Код
<Wrapper("AcDbRegAppTableRecord")> Public Class RegAppTableRecord Inherits SymbolTableRecord
 Описание
 Экземпляры этого класса представляют записи в таблице RegAppTable (известной как таблица символов APPID в DXF). Каждая из этих записей представляет собой ID приложения, используемый для идентификации группы расширенных данных, прикрепленных к объектам в базе данных чертежа.
 Методы
 Конструкторы
 Teigha.GraphicsInterface.Drawable
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 Drawable
 Конструктор класса Teigha.GraphicsInterface.Drawable. (Унаследован от Drawable)
 Teigha.DatabaseServices.DBObject
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 DBObject
 Конструктор. (Унаследован от DBObject)
 Teigha.DatabaseServices.SymbolTableRecord
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 SymbolTableRecord
 This is SymbolTableRecord, a member of class SymbolTableRecord. (Унаследован от SymbolTableRecord)
 Teigha.DatabaseServices.RegAppTableRecord
 Имя
 Описание
 RegAppTableRecord
 Конструктор по умолчанию.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.GraphicsInterface.Drawable
 Имя
 Описание
 Drawable Методы
 Ниже перечислены методы класса Drawable.
 Drawable Свойства
 Ниже перечислены свойства класса Drawable.
 Teigha.DatabaseServices.DBObject
 Имя
 Описание
 DBObject Методы
 Ниже перечислены методы класса DBObject.
 DBObject Свойства
 Ниже перечислены свойства класса DBObject.
 DBObject События
 Ниже перечислены события класса DBObject.
 Teigha.DatabaseServices.SymbolTableRecord
 Имя
 Описание
 SymbolTableRecord Свойства
 Ниже перечислены свойства класса SymbolTableRecord.
 Ссылки
 Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства, DBObject События
 Ваши комментарии по поводу этого топика: Послать отзыв!