Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.TableStyle.SetCellClass
 Послать отзыв
 Метод позволяет задать класс ячейкам с указанным стилем ячейки.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetCellClass( DatabaseServices.CellClass cellClass, ref String styleName );
Копировать Код
Public Overridable Sub SetCellClass( cellClass As DatabaseServices.CellClass, ByRef styleName As String )
 Параметры
 Параметры
 Описание
 cellClass
 Класс ячейки. Тип DatabaseServices.CellClass.
 styleName
 Имя стиля ячейки. Тип String.
 Описание
 Метод позволяет задать класс ячейкам с указанным стилем ячейки.
 Ссылки
 Teigha.DatabaseServices.TableStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!