Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Point3d.Subtract
 Послать отзыв
 Метод позволяет получить точку, координаты которой определяются разностью координат этой точки и соответствующих компонент заданного вектора.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d Subtract( Vector3d value );
Копировать Код
Public Function Subtract( value As Vector3d ) As Point3d
 Параметры
 Параметры
 Описание
 value
 Вычитаемое значение. Тип Vector3d.
 Возвращает
 Возвращает точку Point3d, которая является результатом операции вычитания.
 Описание
 Метод позволяет получить точку, координаты которой определяются разностью координат этой точки и соответствующих компонент вектора value.
 Ссылки
 Teigha.Geometry.Point3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!