Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Entity.BlockName
 Послать отзыв
 Свойство предназначено для получения названия владельца геометрического объекта, которым должен быть объект типа BlockTableRecord.
 Синтаксис
C#
Visual Basic
Копировать Код
public String BlockName;
Копировать Код
Public Property BlockName() As String
 Возвращает
 Возвращает наименование владельца геометрического объекта. Тип String
 Описание
 Свойство предоставляет доступ к названию владельца геометрического объекта, которым должен быть объект типа BlockTableRecord.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.Entity, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!