Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector2dCollection.Item
 Послать отзыв
 Свойство Item предоставляет или задаёт элемент коллекции с указанным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual Vector2d this[int index];
Копировать Код
Default Public Overridable Property Item( index As Integer ) As Vector2d
 Параметры
 Параметры
 Описание
 index
 Входной индекс требуемого элемента. Тип int. Значения индекса отсчитываются от нуля.
 Возвращает
 Возвращает элемент коллекции с указанным индексом. Тип Vector2d.
 Описание
 Свойство Item предоставляет или задаёт элемент коллекции с указанным индексом.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.Geometry.Vector2dCollection, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!