Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector3d.ToString
 Послать отзыв
 Метод реализует эквивалентное представление данного вектора в виде текстовой строки в предписанном формате и с учетом региональных и языковых настроек.
 Синтаксис
C#
Visual Basic
Копировать Код
public String ToString( ref String format, ref IFormatProvider provider );
Копировать Код
Public Function ToString( ByRef format As String, ByRef provider As IFormatProvider ) As String
 Параметры
 Параметры
 Описание
 format
 Входной формат строки. Тип String.
 provider
 Провайдер региональных и языковых настроек. Тип IFormatProvider.
 Возвращает
 Возвращает строковое представление данного вектора. Тип String.
 Описание
 Метод реализует эквивалентное представление данного вектора в виде текстовой строки, формат которой задается аргументом format, а региональные и языковые настройки определяются указанным провайдером provider.
 Ссылки
 Teigha.Geometry.Vector3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!