Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Interval.Tolerance
 Послать отзыв
 Свойство Tolerance представляет точность, используемую для определения границ данного интервала.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Tolerance;
Копировать Код
Public ReadOnly Property Tolerance As Double
 Возвращает
 Возвращает точность, используемую для определения границ данного интервала. Тип double.
 Описание
 Свойство Tolerance представляет точность, используемую для определения границ данного интервала.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.Interval, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!