Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 DimStyleTableRecord.Dimscale
 Послать отзыв
 Свойство предназначено для настройки масштаба размерных элементов.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual double Dimscale { get; set; }
Копировать Код
Public Overridable Property Dimscale As Double
 Возвращает
 Возвращает тип данных double.
 Описание
 В свойстве хранится масштаб размерных элементов – масштабный коэффициент, применяемый ко всем переменным измерения, которые регулируют размеры, смещения и расстояния.
 Свойство принимает в качестве значения положительные числа. Значение по умолчанию 1. Значение 0 – «Разумное» значение, вычисляется для областей просмотра пространства модели.
 Примечание: если задано отрицательное значение масштаба печати, указанные размеры будут соответствовать указанным размерам другими переменными измерения.
 Свойство также доступно через системную переменную DIMSCALE и пользовательское меню в окне изменения/создания размерного стиля:
  При изменении системной переменной DIMSCALE будет создан новый размерный стиль под названием <переопределение> на основе текущего с новым значением DIMSCALE.
 Условия
 Чтение и запись.
 Пример
 Пример изменения масштаба размерных элементов (значения свойства Dimscale) в размерном стиле Standard:
C#
 Копировать Код
public partial class Commands { [Teigha.Runtime.CommandMethod("DimscaleChange")] public void DimscaleStandardDimStyle() { // Получение ссылки на активный документ HostMgd.ApplicationServices.Document doc = HostMgd.ApplicationServices.Application.DocumentManager.MdiActiveDocument; // Получение ссылки на редактор документа HostMgd.EditorInput.Editor ed = doc.Editor; // Получение ссылки на базу данных документа Teigha.DatabaseServices.Database db = doc.Database; // Начало транзакции с базой данных документа using (Teigha.DatabaseServices.Transaction trans = db.TransactionManager.StartTransaction()) { // Открываем таблицу размерных стилей для чтения Teigha.DatabaseServices.DimStyleTable dimStyleTable = trans.GetObject(db.DimStyleTableId, Teigha.DatabaseServices.OpenMode.ForRead) as Teigha.DatabaseServices.DimStyleTable; // Находим в таблице размерных стилей ObjectId нужного стиля по его названию Teigha.DatabaseServices.ObjectId styleId = dimStyleTable["Standard"]; // Открываем таблицу размерного стиля для изменений Teigha.DatabaseServices.DimStyleTableRecord obj = trans.GetObject(styleId, Teigha.DatabaseServices.OpenMode.ForWrite) as Teigha.DatabaseServices.DimStyleTableRecord; ed.WriteMessage($"nDimscale before: {obj.Dimscale}"); // Изменяем настройку масштаба размерных элементов obj.Dimscale = 50; ed.WriteMessage($"nDimscale after: {obj.Dimscale}"); trans.Commit(); } } }
 Ссылки
 Teigha.DatabaseServices.DimStyleTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!