Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObject.IsCustomObject(ObjectId)
 Послать отзыв
 Метод предназначен для проверки, относится ли переданный идентификатор к пользовательскому объекту.В настоящее время не реализован. "id"> [в] Идентификатор объекта для проверки.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsCustomObject(ObjectId id);
Копировать Код
Public Function IsCustomObject(id As ObjectId) As bool
 Параметры
 Параметры
 Описание
 Id
 Идентификатор объекта для проверки. Тип ObjectId
 Возвращает
 Возвращает тип данных bool. true, если объект с Id является пользовательским объектом, false в противном случае.
 Описание
 Возвращает true, если id соответствует пользовательскому объекту.
 Ссылки
 Teigha.DatabaseServices.DBObject, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!