Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.StepsPerSec
 Послать отзыв
 Синтаксис
C#
Visual Basic
public double StepsPerSec;
Public Property StepsPerSec() As Double
 Описание
 Обеспечивает доступ к текущему значению STEPSPERSEC для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!