Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.NamedObjectsDictionaryId
 Послать отзыв
 Синтаксис
C#
Visual Basic
public DatabaseServices::ObjectId NamedObjectsDictionaryId;
Public Property NamedObjectsDictionaryId() As DatabaseServices.ObjectId
 Описание
 Возвращает Id словаря именованных объектов базы данных.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!