Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Region.Normal
 Послать отзыв
 Свойство Normal представляет нормаль плоскости, в которой располагается данная область.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual Vector3d Normal;
Копировать Код
Public Overridable ReadOnly Property Normal As Vector3d
 Возвращает
 Возвращает вектор нормали плоскости данного объекта. Тип Vector3d.
 Описание
 Свойство Normal представляет нормаль плоскости, в которой располагается данная область. Вектор нормали возвращается в мировой системе координат (WCS).
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Region, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!