Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DwgFiler.ReadBinaryChunk
 Послать отзыв
 Метод позволяет получить значение BinaryData текущего элемента этого объекта Filer.
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract byte[] ReadBinaryChunk();
Копировать Код
Public MustOverride Function ReadBinaryChunk() As Byte()
 Возвращает
 Возвращает текущий элемент объекта Filer в виде байтового массива. Тип byte[].
 Описание
 Метод позволяет получить значение BinaryData текущего элемента этого объекта Filer.
 Ссылки
 Teigha.DatabaseServices.DwgFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!