Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector3d.!=
 Послать отзыв
 Оператор неравенства для класса Vector3d.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool operator != ( Vector3d a, Vector3d b );
Копировать Код
Public Operator != ( a As Vector3d, b As Vector3d )
 Параметры
 Параметры
 Описание
 a
 Левый операнд. Тип Vector3d.
 b
 Правый операнд. Тип Vector3d.
 Возвращает
 Возвращает true, если не совпадают значения по крайней мере у одной пары соответствующих компонент двух векторов. В противном случае возвращает false.
 Описание
 Оператор позволяет проверить несовпадение двух указанных векторов на основе их покомпонентного сравнения. Возвращает true в случае несовпадения векторов.
 Ссылки
 Teigha.Geometry.Vector3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!