Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство RasterImage.ImageWidth
 Послать отзыв
 Синтаксис
C#
Visual Basic
public double ImageWidth;
Public Property ImageWidth() As Double
 Описание
 Обеспечивает доступ к ширине изображения.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.RasterImage, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!