Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FieldEvaluationStatus
 Послать отзыв
 Данное перечисление определяет статусы вычисления поля.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum FieldEvaluationStatus { EvaluatorNotFound = 4, InvalidCode = 16, InvalidContext = 32, NotYetEvaluated = 1, OtherError = 64, Success = 2, SyntaxError = 8 }
Копировать Код
Public Enum FieldEvaluationStatus EvaluatorNotFound = 4 InvalidCode = 16 InvalidContext = 32 NotYetEvaluated = 1 OtherError = 64 Success = 2 SyntaxError = 8 End Enum
 Члены
 Члены
 Описание
 NotYetEvaluated
 Значение: 1. Поле еще не вычислено.
 Success
 Значение: 2. Вычисление поля завершено успешно.
 EvaluatorNotFound
 Значение: 4. Вычислитель для поля не найден.
 SyntaxError
 Значение: 8. Синтаксическая ошибка в выражении данного поля.
 InvalidCode
 Значение: 16. Недействительный код поля или выражение.
 InvalidContext
 Значение: 32. Текущий контекст является недействительным для вычисления поля.
 OtherError
 Значение: 64. Вычисление поля завершилось ошибкой.
 Описание
 Данное перечисление определяет статусы вычисления поля.
 Ваши комментарии по поводу этого топика: Послать отзыв!