Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Field.IsTextField
 Послать отзыв
 Свойство IsTextField позволяет определить, является ли данный объект текстовым полем с внедренными полями.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsTextField;
Копировать Код
Public ReadOnly Property IsTextField As Boolean
 Возвращает
 Возвращает true, если данный объект является текстовым полем с внедренными полями. В противном случае возвращает false.
 Описание
 Свойство IsTextField позволяет определить, является ли данный объект текстовым полем с внедренными полями.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Field, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!