Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.RenderGlobal.SaveEnabled
 Послать отзыв
 Свойство SaveEnabled позволяет определить, следует ли сохранять визуализированное изображение в файле на диске.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool SaveEnabled;
Копировать Код
Public Property SaveEnabled As Boolean
 Возвращает
 Возвращает true, если сохранение результата рендеринга включено. В противном случае возвращает false.
 Описание
 Свойство SaveEnabled позволяет определить, следует ли сохранять визуализированное изображение в файле на диске.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.RenderGlobal, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!