Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DataTable.NumRowsPhysicalSize
 Послать отзыв
 Свойство предоставляет доступ к физическому размеру таблицы в строках.
 Синтаксис
C#
Visual Basic
Копировать Код
public int NumRowsPhysicalSize;
Копировать Код
Public Property NumRowsPhysicalSize() As Integer
 Возвращает
 Возвращает физический размер таблицы в строках. Тип int.
 Описание
 Свойство предоставляет доступ к физическому размеру таблицы в строках.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.DataTable, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!