Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DxfFiler.WriteBoolean
 Послать отзыв
 Метод записывает в данный объект Filer указанное логическое значение.
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract void WriteBoolean( DxfCode opCode, bool value );
Копировать Код
Public MustOverride Sub WriteBoolean( opCode As DxfCode, value As Boolean )
 Параметры
 Параметры
 Описание
 opCode
 Групповой код DXF. Тип DxfCode.
 value
 Значение, которое следует записать. Тип bool.
 Описание
 Метод записывает в данный объект Filer групповой код DXF и указанное логическое значение.
 Ссылки
 Teigha.DatabaseServices.DxfFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!