Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Light.LightType
 Послать отзыв
 Свойство представляет тип данного источника света: DistantLight, PointLight, SpotLight или WebLight.
 Синтаксис
C#
Visual Basic
Копировать Код
public DrawableType LightType;
Копировать Код
Public Property LightType As DrawableType
 Возвращает
 Возвращает тип источника света. Перечисление DrawableType.
 Описание
 Свойство представляет тип данного источника света: DistantLight, PointLight, SpotLight или WebLight.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Light, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!