Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.ExternalCurve3d.ExternalCurve
 Послать отзыв
 Свойство ExternalCurve представляет внешнюю кривую в ее исходном виде.
 Синтаксис
C#
Visual Basic
Копировать Код
public IntPtr ExternalCurve;
Копировать Код
Public ReadOnly Property ExternalCurve As IntPtr
 Возвращает
 Возвращает указатель на внешнюю кривую. Тип IntPtr.
 Описание
 Свойство ExternalCurve представляет внешнюю кривую в ее исходном виде. Знание точного определения внешнего объекта потенциально обеспечивает эффективный доступ к объекту в его исходном виде. Вызывающая сторона несет ответственность за высвобождение использованной при этом памяти.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.ExternalCurve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!