Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Curve.CreateFromGeCurve
 Послать отзыв
 Метод CreateFromGeCurve создает экземпляр класса Curve из объекта класса Curve3d.
 Синтаксис
C#
Visual Basic
Копировать Код
public Curve CreateFromGeCurve( ref Curve3d geCurve, Vector3d vec );
Копировать Код
Public Function CreateFromGeCurve( ByRef geCurve As Curve3d, vec As Vector3d ) As Curve
 Параметры
 Параметры
 Описание
 geCurve
 Входная кривая, тип Curve3d.
 vec
 Аргумент типа Vector3d.
 Возвращает
 Возвращает экземпляр класса Curve.
 Описание
 Метод CreateFromGeCurve создает экземпляр класса Curve на основе объекта класса Curve3d с использованием объекта класса Vector3d.
 Ссылки
 Teigha.DatabaseServices.Curve, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!