Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CellBorders.Right
 Послать отзыв
 Свойство возвращает границу ячейки на крайней правой линии сетки таблицы.
 Синтаксис
C#
Visual Basic
Копировать Код
public CellBorder Right;
Копировать Код
Public Property Right() As CellBorder
 Возвращает
 Возвращает границу ячейки. Тип CellBorder.
 Описание
 Свойство возвращает границу ячейки на крайней правой линии сетки таблицы.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.CellBorders, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!