Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Database.GetDimensionStyleChildData
 Послать отзыв
 Синтаксис
C#
Visual Basic
public DimStyleTableRecord GetDimensionStyleChildData(ref RXClass classDescriptor);
Public Function GetDimensionStyleChildData(ByRef classDescriptor As RXClass) As DimStyleTableRecord
 Параметры
 Параметры
 Описание
 classDescriptor
 Объект для проверки
 Описание
 Эта функция возвращает запись DimStyleTableRecord, на которую ссылается размерный стиль.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!