Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DecomposeForSaveReplacementRecord.ReplacementObject
 Послать отзыв
 Свойство ReplacementObject предоставляет идентификатор резидентного замещающего объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public DBObject ReplacementObject;
Копировать Код
Public ReadOnly Property ReplacementObject As DBObject
 Возвращает
 Возвращает идентификатор резидентного замещающего объекта. Тип DBObject.
 Описание
 Свойство ReplacementObject предоставляет идентификатор резидентного замещающего объекта.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.DecomposeForSaveReplacementRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!