Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Database.UpdateExt
 Послать отзыв
 Синтаксис
C#
Visual Basic
public void UpdateExt(bool doBestFit);
Public Sub UpdateExt(doBestFit As bool)
 Параметры
 Параметры
 Описание
 doBestFit
 Определяет, нужно ли создавать ограничивающий объект параллелепипед
 Описание
 Этот метод просматривает все геометрические объекты пространства модели базы данных и обновляет переменные размера пространства модели EXTMAX и EXTMIN в соответствии со значениями, определенными в процессе перебора геометрических объектов.
 Установка аргумента doBestFit в true означает, что при переборе объектов базы данных, все геометрические объекты из BlockReference должны иметь метод geomExtentsBestFit(), вызываемый вместо geomExtents(). Он работает медленнее, но позволяет создавать ограничивающий объект параллелепипед (для получения размера, занимаемого геометрическим объектом). Использование аргумента по умолчанию (false) работает быстрее, но может не создавать ограничивающий объект параллелепипед.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!