Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeaderStyle.TextHeight
 Послать отзыв
 Свойство представляет высоту многострочного текста, которая предусмотрена данным стилем.
 Синтаксис
C#
Visual Basic
Копировать Код
public double TextHeight;
Копировать Код
Public Property TextHeight As Double
 Возвращает
 Возвращает высоту текста. Тип double.
 Описание
 Свойство представляет высоту многострочного текста, которая предусмотрена данным стилем.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MLeaderStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!