Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PatternDefinition.OffsetX
 Послать отзыв
 Свойство представляет x-компоненту смещения.
 Синтаксис
C#
Visual Basic
Копировать Код
public double OffsetX;
Копировать Код
Public ReadOnly Property OffsetX As Double
 Возвращает
 Возвращает x-компоненту смещения. Тип double.
 Описание
 Свойство представляет x-компоненту смещения.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.PatternDefinition, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!