Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LayerStateEventArgs
 Послать отзыв
 Класс LayerStateEventArgs представляет данные для события LayerState.
 Иерархия классов
Teigha::DatabaseServices::LayerStateEventArgs
 Синтаксис
C#
Visual Basic
Копировать Код
public class LayerStateEventArgs : EventArgs
Копировать Код
Public Class LayerStateEventArgs Inherits EventArgs
 Описание
 Класс LayerStateEventArgs представляет данные для события LayerState.
 Топики
 Имя
 Описание
 LayerStateEventArgs Свойства
 Ниже перечислены свойства класса LayerStateEventArgs.
 Ссылки
 LayerStateEventArgs Свойства, Топики, LayerStateEventArgs Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!