Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CellReference.Row
 Послать отзыв
 Свойство Row представляет строку таблицы, в которой располагается текущая ячейка.
 Синтаксис
C#
Visual Basic
Копировать Код
public int Row;
Копировать Код
Public Property Row As Integer
 Возвращает
 Возвращает индекс строки с текущей ячейкой. Тип int.
 Описание
 Свойство Row представляет строку таблицы, в которой располагается текущая ячейка.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.CellReference, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!