Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DataTypeParameter.DataType
 Послать отзыв
 Свойство DataType представляет тип данных для этого экземпляра структуры.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.DataType DataType;
Копировать Код
Public Property DataType As DatabaseServices.DataType
 Возвращает
 Возвращает тип данных. Значение из перечисления DatabaseServices.DataType.
 Описание
 Свойство DataType представляет тип данных для этого экземпляра структуры.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.DataTypeParameter, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!