Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Dimasz
 Послать отзыв
 Синтаксис
C#
Visual Basic
public double Dimasz;
Public Property Dimasz() As Double
 Описание
 Возвращает или устанавливает текущее значение DIMASZ для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!