Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.GetToolTip
 Послать отзыв
 Метод предназначен для формирования строки всплывающей подсказки для ячейки, строки или столбца.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual String GetToolTip( int row, int column );
Копировать Код
Public virtual Function GetToolTip( row As Integer, column As Integer ) As String
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс может равняться -1.
 col
 Индекс столбца, тип int. Индекс может равняться -1.
 Возвращает
 Возвращает строку подсказки, тип String.
 Описание
 Метод предназначен для формирования строки всплывающей подсказки для ячейки, строки или столбца.
 Чтобы указать ячейку, следует задать допустимые индексы строки и столбца. Чтобы указать строку, следует задать допустимый индекс строки и -1 в качестве индекса столбца. Чтобы указать столбец, следует задать допустимый индекс столбца и -1 в качестве индекса строки.
 Замечания
 Для получения того же результата предпочтительнее использовать Table.Cells[row,column].ToolTip.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!