Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve2d.GetInterval
 Послать отзыв
 Метод позволяет получить параметрический интервал данной кривой.
 Синтаксис
C#
Visual Basic
Копировать Код
public Interval GetInterval();
Копировать Код
Public Function GetInterval() As Interval
 Возвращает
 Возвращает параметрический интервал данной кривой. Тип Interval.
 Описание
 Метод позволяет получить параметрический интервал данной кривой.
 Ссылки
 Teigha.Geometry.Curve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!