Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PatternDefinition
 Послать отзыв
 Класс PatternDefinition инкапсулирует данные определения штриховки, возвращаемые методом Hatch.GetPatternDefinitionAt().
 Иерархия классов
Teigha::DatabaseServices::PatternDefinition
 Синтаксис
C#
Visual Basic
Копировать Код
public struct PatternDefinition
Копировать Код
Public Structure PatternDefinition
 Описание
 Класс PatternDefinition инкапсулирует данные определения штриховки, возвращаемые методом Hatch.GetPatternDefinitionAt().
 Методы
 Конструкторы
 Имя
 Описание
 PatternDefinition
 Конструктор класса PatternDefinition.
 Топики
 Имя
 Описание
 PatternDefinition Методы
 Ниже перечислены методы класса PatternDefinition.
 PatternDefinition Свойства
 Ниже перечислены свойства класса PatternDefinition.
 Ссылки
 PatternDefinition Методы, PatternDefinition Свойства, Методы, Топики, PatternDefinition Методы, PatternDefinition Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!