Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Filters.SpatialFilter
 Послать отзыв
 Этот класс реализует объекты пространственного фильтра в экземпляре базы данных.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::GraphicsInterface::Drawable Teigha::DatabaseServices::DBObject Teigha::DatabaseServices::Filters::Filter Teigha::DatabaseServices::Filters::SpatialFilter
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("AcDbSpatialFilter")] public class SpatialFilter : Filter;
Копировать Код
<Wrapper("AcDbSpatialFilter")> Public Class SpatialFilter Inherits Filter
 Описание
 Этот класс реализует пространственные фильтры для фильтрации объектов чертежа в экземпляре базы данных.
 Пространственный фильтр определяет геометрическую 3D-область, полученную экструзией некоторого 2D-контура в заданном направлении, ограниченную передней и задней плоскостями отсечения. Такие фильтры реализуют также границы отсечения для объектов внешних ссылок.
 Методы
 Конструкторы
 Teigha.GraphicsInterface.Drawable
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 Drawable
 Конструктор класса Teigha.GraphicsInterface.Drawable. (Унаследован от Drawable)
 Teigha.DatabaseServices.DBObject
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 DBObject
 Конструктор. (Унаследован от DBObject)
 Teigha.DatabaseServices.Filters.Filter
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 Filter
 Конструктор класса Filter. (Унаследован от Filter)
 Teigha.DatabaseServices.Filters.SpatialFilter
 Имя
 Описание
 SpatialFilter
 Конструктор класса SpatialFilter по умолчанию..
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.GraphicsInterface.Drawable
 Имя
 Описание
 Drawable Методы
 Ниже перечислены методы класса Drawable.
 Drawable Свойства
 Ниже перечислены свойства класса Drawable.
 Teigha.DatabaseServices.DBObject
 Имя
 Описание
 DBObject Методы
 Ниже перечислены методы класса DBObject.
 DBObject Свойства
 Ниже перечислены свойства класса DBObject.
 DBObject События
 Ниже перечислены события класса DBObject.
 Teigha.DatabaseServices.Filters.Filter
 Имя
 Описание
 Filter Свойства
 Ниже перечислены свойства класса Filter.
 Teigha.DatabaseServices.Filters.SpatialFilter
 Имя
 Описание
 SpatialFilter Методы
 Ниже перечислены методы класса SpatialFilter.
 SpatialFilter Свойства
 Ниже перечислены свойства класса SpatialFilter.
 Ссылки
 SpatialFilter Методы, SpatialFilter Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства, DBObject События
 Ваши комментарии по поводу этого топика: Послать отзыв!