Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AttributeDefinition.AttributeDefinition
 Послать отзыв
 Конструктор класса, предназначенный для создания нового экземпляра класса AttributeDefinition с указанными параметрами.
 Синтаксис
C#
Visual Basic
Копировать Код
public AttributeDefinition( Point3d position, ref String value, ref String tag, ref String prompt, DatabaseServices::ObjectId style );
Копировать Код
Public Sub New( position As Point3d, ByRef value As String, ByRef tag As String, ByRef prompt As String, style As DatabaseServices.ObjectId )
 Параметры
 Параметры
 Описание
 position
 Позиция объекта AttributeDefinition. Тип Point3d.
 value
 Значение объекта AttributeDefinition. Тип String.
 tag
 Тег объекта AttributeDefinition. Тип String.
 prompt
 Запрос объекта AttributeDefinition. Тип String.
 style
 Стиль объекта AttributeDefinition. Тип DatabaseServices.ObjectId.
 Описание
 Конструктор класса, предназначенный для создания нового экземпляра класса AttributeDefinition с указанными параметрами.
 Ссылки
 Teigha.DatabaseServices.AttributeDefinition, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!