Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.KnotParameterizationEnum
 Послать отзыв
 Данное перечисление определяет метод узловой параметризации сплайна, который строится по определяющим точкам.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum KnotParameterizationEnum { Chord = 0, CustomParameterization = 15, SqrtChord = 1, Uniform = 2 }
Копировать Код
Public Enum KnotParameterizationEnum Chord = 0 CustomParameterization = 15 SqrtChord = 1 Uniform = 2 End Enum
 Члены
 Члены
 Описание
 Chord
 Значение: 0. Параметризация кривой по длине хорды (Chord length method).
 CustomParameterization
 Значение: 15. Пользовательский способ параметризации кривой.
 SqrtChord
 Значение: 1. Параметризация кривой по квадратному корню из длины хорды (центростремительный способ параметризации сплайна, Centripetal method).
 Uniform
 Значение: 2. Линейный метод параметризации кривой (метод равномерного распределения, Uniformly spaced method).
 Описание
 Данное перечисление определяет метод узловой параметризации сплайна, который строится по определяющим точкам. Выбор метода параметризации определяет способ создания узлов.
 Ваши комментарии по поводу этого топика: Послать отзыв!