Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.TableStyle.Name
 Послать отзыв
 Свойство Name представляет имя данного стиля таблицы.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual String Name;
Копировать Код
Public Overridable Property Name As String
 Возвращает
 Возвращает имя стиля таблицы. Тип String.
 Описание
 Свойство Name представляет имя данного стиля таблицы.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.TableStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!