Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DynamicBlockReferencePropertyCollection.GetEnumerator
 Послать отзыв
 Метод возвращает перечислитель для данной коллекции.
 Синтаксис
C#
Visual Basic
Копировать Код
public IEnumerator GetEnumerator();
Копировать Код
Public Function GetEnumerator() As IEnumerator
 Возвращает
 Возвращает перечислитель коллекции. Тип IEnumerator.
 Описание
 Метод возвращает перечислитель для данной коллекции.
 Ссылки
 Teigha.DatabaseServices.DynamicBlockReferencePropertyCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!