Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Solid3d.CopyEdge
 Послать отзыв
 Метод позволяет сделать копию указанного ребра данного объекта в виде отдельного объекта (экземпляра класса Line, Circle, Arc, Ellipse, Spline).
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual Entity CopyEdge( SubentityId subEntityId );
Копировать Код
Public Overridable Function CopyEdge( subEntityId As SubentityId ) As Entity
 Параметры
 Параметры
 Описание
 subEntityId
 Идентификатор подобъекта ребра в данном твердом теле. Тип SubentityId.
 Возвращает
 Возвращает копию ребра в виде самостоятельного экземпляра одного из геометрических примитивов. Тип Entity.
 Описание
 Метод позволяет сделать копию указанного ребра данного объекта в виде отдельного объекта (экземпляра класса Line, Circle, Arc, Ellipse, Spline).
 Ссылки
 Teigha.DatabaseServices.Solid3d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!