Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FormattedTableData.SetGridLineWeight
 Послать отзыв
 Метод позволяет задать толщину линий сетки в указанной ячейке, строке или столбце.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetGridLineWeight( int row, int column, GridLineType gridLinetype, LineWeight value );
Копировать Код
Public Overridable Sub SetGridLineWeight( row As Integer, column As Integer, gridLinetype As GridLineType, value As LineWeight )
 Параметры
 Параметры
 Описание
 row
 Индекс строки. Тип int. Индекс может равняться -1.
 column
 Индекс столбца. Тип int. Индекс может равняться -1.
 gridLinetype
 Тип линий сетки из перечисления GridLineType. Комбинацию типов линий сетки можно задать с помощью логического оператора OR.
 value
 Новая толщина линий сетки. Значение из перечисления LineWeight.
 Описание
 Метод позволяет задать толщину линий сетки в указанной ячейке, строке или столбце.
 Чтобы указать ячейку, следует передать действительные индексы строки и столбца. Чтобы указать строку, следует передать действительный индекс строки и -1 в качестве индекса столбца. Чтобы указать столбец, следует передать действительный индекс столбца и -1 в качестве индекса строки.
 Ссылки
 Teigha.DatabaseServices.FormattedTableData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!