Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FaceRef.FaceRef
 Послать отзыв
 Конструктор класса FaceRef. Создает экземпляр класса на базе указанного подобъекта составного объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public FaceRef( ref CompoundObjectId compoundObjectId, SubentityId subentId );
Копировать Код
Public Sub New( ByRef compoundObjectId As CompoundObjectId, subentId As SubentityId )
 Параметры
 Параметры
 Описание
 compoundObjectId
 Идентификатор составного объекта. Тип CompoundObjectId.
 subentId
 Идентификатор подобъекта составного объекта compoundObjectId, на основе которого создается новый экземпляр класса FaceRef. Тип SubentityId.
 Описание
 Конструктор класса FaceRef. Создает экземпляр класса на базе указанного подобъекта составного объекта.
 Ссылки
 Teigha.DatabaseServices.FaceRef, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!