Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DataColumn.ColumnName
 Послать отзыв
 Свойство возвращает или задает имя этого столбца данных.
 Синтаксис
C#
Visual Basic
Копировать Код
public String ColumnName;
Копировать Код
Public Property ColumnName() As String
 Возвращает
 Возвращает имя столбца данных. Тип String.
 Описание
 Свойство возвращает или задает имя этого столбца данных.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.DataColumn, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!