Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SweepOptions.AlignStart
 Послать отзыв
 Свойство AlignStart представляет вариант выравнивания объекта относительно начала или конца траектории вытягивания.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool AlignStart;
Копировать Код
Public ReadOnly Property AlignStart As Boolean
 Возвращает
 Возвращает true, если применяется выравнивание относительно начала траектории. В случае false используется выравнивание относительно конца траектории.
 Описание
 Свойство AlignStart представляет вариант выравнивания объекта относительно начала или конца траектории вытягивания.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.SweepOptions, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!