Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ProxyEntity.ApplicationDescription
 Послать отзыв
 Свойство ApplicationDescription обеспечивает доступ к строке с описанием приложения класса, представленного данным прокси-объектом.
 Синтаксис
C#
Visual Basic
Копировать Код
public String ApplicationDescription;
Копировать Код
Public ReadOnly Property ApplicationDescription As String
 Возвращает
 Возвращает строку с описанием приложения. Тип String.
 Описание
 Свойство ApplicationDescription обеспечивает доступ к строке с описанием приложения класса, представленного данным прокси-объектом.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.ProxyEntity, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!