Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBVisualStyle.SetTrait
 Послать отзыв
 Метод позволяет задать указанному свойству данного визуального стиля целочисленное значение.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetTrait( VisualStyleProperty vsProp, int nVal, VisualStyleOperation vsOp );
Копировать Код
Public Sub SetTrait( vsProp As VisualStyleProperty, nVal As Integer, vsOp As VisualStyleOperation )
 Параметры
 Параметры
 Описание
 vsProp
 Свойство визуального стиля, которое необходимо установить. Значение из перечисления VisualStyleProperty.
 nVal
 Целочисленное значение для свойсва. Тип double.
 vsOp
 Операция, используемая для установки свойства. Значение из перечисления VisualStyleOperation.
 Описание
 Метод позволяет задать указанному свойству данного визуального стиля целочисленное значение.
 Ссылки
 Teigha.DatabaseServices.DBVisualStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!