Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.HostApplicationServices.TEXTFILL
 Послать отзыв
 Свойство позволяет определить, применяется ли заливка к шрифтам TrueType.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool TEXTFILL;
Копировать Код
Public Property TEXTFILL As Boolean
 Возвращает
 Возвращает true, если к шрифтам TrueType применяется заливка. В противном случае возвращает false.
 Описание
 Свойство позволяет определить, применяется ли заливка к шрифтам TrueType.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.HostApplicationServices, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!