Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ObjectContext
 Послать отзыв
 Абстрактный базовый класс ObjectContext предназначен для представления контекста, который может влиять на свойства и поведение пользовательских объектов.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::DatabaseServices::ObjectContext
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdDbObjectContext")] public abstract class ObjectContext : RXObject
Копировать Код
<Wrapper("OdDbObjectContext")> Public MustInherit Class ObjectContext Inherits RXObject
 Описание
 Абстрактный базовый класс ObjectContext предназначен для представления контекста, который может влиять на свойства и поведение пользовательских объектов.
 Производные от него классы используются для представления конкретных типов контекста. В качестве примера можно привести контекст масштаба аннотации, который определяет доступные параметры и поведение этого объекта чертежа.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.DatabaseServices.ObjectContext
 Имя
 Описание
 ObjectContext Свойства
 Ниже перечислены свойства класса ObjectContext.
 Ссылки
 ObjectContext Свойства, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!