Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.UcsOrthographic
 Послать отзыв
 Синтаксис
C#
Visual Basic
public DatabaseServices::OrthographicView UcsOrthographic;
Public Property UcsOrthographic() As DatabaseServices.OrthographicView
 Описание
 Возвращает текущий ортогональный вид.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!