Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Событие Database.XrefRestoreAborted
 Послать отзыв
 Синтаксис
C#
Visual Basic
public event EventHandler XrefRestoreAborted;
Public Event XrefRestoreAborted As EventHandler
 Описание
 Событие показывает, что операция восстановления базы данных чертежа была снята и не завершилась.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!