Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор Line.Line (Point3d, Point3d)
 Послать отзыв
 Синтаксис
C#
Visual Basic
public Line(Point3d stPoint, Point3d endPoint);
Public Sub New(stPoint As Point3d, endPoint As Point3d)
 Параметры
 Параметры
 Описание
 stPoint
 Точка начала линии (в WCS координатах)
 endPoint
 Точка конца линии (в WCS координатах)
 Описание
 Этот конструктор инициализирует объект "линия" с использованием параметров, задающих начальную и конечную точки. Обе точки должны быть в WCS координатах.
 Ссылки
 Teigha.DatabaseServices.Line, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!