Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.LinearEntity2d.IntersectWith
 Послать отзыв
 Метод вычисляет точку пересечения данного объекта с другим линейным объектом.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point2d[] IntersectWith( ref LinearEntity2d line );
Копировать Код
Public Function IntersectWith( ByRef line As LinearEntity2d ) As Point2d()
 Параметры
 Параметры
 Описание
 line
 Линейный объект, точку пересечения с которым требуется вычислить. Тип LinearEntity2d.
 Возвращает
 Возвращает точку пересечения в виде массива из одного элемента. Тип Point2d[].
 Описание
 Метод вычисляет точку пересечения данного объекта с другим линейным объектом. Используется вызов метода LinearEnt2d.IntersectWith(LinearEntity2d line, Tolerance tolerance) со значением точности, равным Tolerance.Global.
 Ссылки
 Teigha.Geometry.LinearEntity2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!