Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Interval.IsEqualAtUpper
 Послать отзыв
 Метод проверяет, совпадает ли верхняя граница данного интервала с указанным значением в пределах заданной точности.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsEqualAtUpper( double value );
Копировать Код
Public Function IsEqualAtUpper( value As Double ) As Boolean
 Параметры
 Параметры
 Описание
 value
 Проверяемое значение. Тип double.
 Возвращает
 Возвращает true, если данный интервал ограничен сверху, и его верхняя граница равна значению value в пределах заданной в данном объекте точности определения границ. В противном случае возвращает false.
 Описание
 Метод проверяет, совпадают ли верхняя граница данного интервала с указанным значением в пределах заданной в данном объекте точности определения границ.
 Ссылки
 Teigha.Geometry.Interval, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!