Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.NurbSurface.InsertKnotAtV
 Послать отзыв
 Метод вставляет узел с указанным значением параметра v без изменения формы поверхности.
 Синтаксис
C#
Visual Basic
Копировать Код
public void InsertKnotAtV( double dV );
Копировать Код
Public Sub InsertKnotAtV( dV As Double )
 Параметры
 Параметры
 Описание
 dV
 Входное значение параметра V. Тип double.
 Описание
 Метод вставляет узел с указанным значением параметра v.
 Добавление нового узла не меняет форму поверхности. Метод добавляет новый ряд управляющих вершин в направлении u и корректирует положение локальной управляющей вершины.
 Если поверхность не содержит никакой NURBS информации, метод выбрасывает исключение eFail. Если кратность узлов поверхности для параметра v превышает степень сплайна в направлении v, выбрасывается исключение eInvalidInput. Если этот метод в конкретном моделере не реализован, выбрасывается исключение eNotImplementedYet.
 Ссылки
 Teigha.DatabaseServices.NurbSurface, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!