Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve3dCollection.Curve3dCollection
 Послать отзыв
 Конструктор по умолчанию класса Curve3dCollection.
 Синтаксис
C#
Visual Basic
Копировать Код
public Curve3dCollection();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса Curve3dCollection.
 Ссылки
 Teigha.Geometry.Curve3dCollection, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!