Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ObjectId.ObjectId
 Послать отзыв
 Конструктор создает экземпляр ObjectId на основе целочисленного указателя в старом формате.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectId( IntPtr oldId );
Копировать Код
Public Sub New( oldId As IntPtr )
 Параметры
 Параметры
 Описание
 oldId
 Исходный указатель, тип IntPtr.
 Возвращает
 Возвращает новый экземпляр ObjectId.
 Описание
 Конструктор создает экземпляр ObjectId на основе целочисленного указателя в старом формате.
 Ссылки
 Teigha.DatabaseServices.ObjectId, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!