Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Light.MapSize
 Послать отзыв
 Свойство представляет размер карты теней. Возможные значения: 64, 128, 256, 512, 1024, 2048 или 4096.
 Синтаксис
C#
Visual Basic
Копировать Код
public int MapSize;
Копировать Код
Public Property MapSize As Integer
 Возвращает
 Возвращает размер карты теней. Тип int.
 Описание
 Свойство представляет размер карты теней. Возможные значения: 64, 128, 256, 512, 1024, 2048 или 4096.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Light, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!