Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Viewport.UcsIconVisible
 Послать отзыв
 Свойство UcsIconVisible позволяет определить, включено ли отображение значка ПСК (UCS) в данном видовом экране.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool UcsIconVisible;
Копировать Код
Public Property UcsIconVisible As Boolean
 Возвращает
 Возвращает true, если значок ПСК (UCS) отображается в видовом экране. В противном случае возвращает false.
 Описание
 Свойство UcsIconVisible позволяет определить, включено ли отображение значка ПСК (UCS) в данном видовом экране.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Viewport, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!