Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GripOverrule.MoveGripPointsAt
 Послать отзыв
 Данный метод осуществляет перемещение указанных ручек, определяемое заданным вектором.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void MoveStretchPointsAt( ref Entity entity, ref IntegerCollection indices, Vector3d offset );
Копировать Код
Public virtual Sub MoveStretchPointsAt( ByRef entity As Entity, ByRef indices As IntegerCollection, offset As Vector3d )
 Параметры
 Параметры
 Описание
 entity
 Объект, тип Entity,
 indices
 Массив индексов, тип IntegerCollection. Порядок индексов ручек определяется методом GetGripPoints.
 offset
 Вектор смещения ручек в WCS, тип Vector3d.
 Описание
 Данный метод осуществляет перемещение указанных ручек, определяемое заданным вектором. Ручки задаются массивом соответствующих им индексов в коллекции, которую формирует метод GetGripPoints.
 Ссылки
 Teigha.DatabaseServices.GripOverrule, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!