Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FullSubentityPath.!=
 Послать отзыв
 Оператор неравенства класса FullSubentityPath.
 Синтаксис
C#
Visual Basic
Копировать Код
public static bool operator !=( FullSubentityPath a, FullSubentityPath b );
Копировать Код
Public Shared Operator <>( a As FullSubentityPath, b As FullSubentityPath ) As Boolean
 Параметры
 Параметры
 Описание
 a
 Левый операнд. Тип FullSubentityPath.
 b
 Правый операнд. Тип FullSubentityPath.
 Возвращает
 Возвращает true при несовпадении операндов. В противном случае возвращает false.
 Описание
 Оператор неравенства класса FullSubentityPath.
 Ссылки
 Teigha.DatabaseServices.FullSubentityPath, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!