Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ObjectErasedEventArgs
 Послать отзыв
 Данный класс представляет данные для события ObjectErased в базе данных.
 Иерархия классов
Teigha::DatabaseServices::ObjectErasedEventArgs
 Синтаксис
C#
Visual Basic
Копировать Код
public sealed class ObjectErasedEventArgs : EventArgs
Копировать Код
Public NotInheritable Class ObjectErasedEventArgs Inherits EventArgs
 Описание
 Данный класс представляет данные для события ObjectErased в базе данных.
 Топики
 Имя
 Описание
 ObjectErasedEventArgs Свойства
 Ниже перечислены свойства класса ObjectErasedEventArgs.
 Ссылки
 ObjectErasedEventArgs Свойства, Топики, ObjectErasedEventArgs Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!