Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.PolylineCurve2d.SetFitPointAt
 Послать отзыв
 Метод переопределяет определяющую точку сплайна с указанным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetFitPointAt( int i, Point2d point );
Копировать Код
Public Sub SetFitPointAt( i As Integer, point As Point2d )
 Параметры
 Параметры
 Описание
 i
 Входной индекс определяющей точки. Тип int.
 point
 Новые координаты определяющей точки с указанным индексом. Тип Point2d.
 Описание
 Метод переопределяет координаты определяющей точки сплайна с индексом i.
 Ссылки
 Teigha.Geometry.PolylineCurve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!