Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve2d.GetLength
 Послать отзыв
 Метод вычисляет длину кривой на заданном параметрическом интервале с заданной точностью.
 Синтаксис
C#
Visual Basic
Копировать Код
public double GetLength( double fromParameter, double toParameter, Tolerance tolerance );
Копировать Код
Public Function GetLength( fromParameter As Double, toParameter As Double, tolerance As Tolerance ) As Double
 Параметры
 Параметры
 Описание
 fromParameter
 Значение параметра в начальной точке интервала. Тип double.
 toParameter
 Значение параметра в конечной точке интервала. Тип double.
 tolerance
 Заданная геометрическая точность. Тип Tolerance.
 Возвращает
 Возвращает длину кривой на заданном параметрическом интервале. Тип double.
 Описание
 Метод вычисляет длину кривой на заданном параметрическом интервале с заданной точностью.
 Ссылки
 Teigha.Geometry.Curve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!