Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 DimStyleTableRecord.Dimadec
 Послать отзыв
 Свойство предназначено для настройки количества десятичных знаков в угловых размерах.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual int Dimadec { get; set; }
Копировать Код
Public Overridable Property Dimadec As Integer
 Возвращает
 Возвращает тип данных int.
 Возвращаемые значения
 Возвращаемые значения
 Описание
 0-8
 от 0 до 8 десятичных знаков после целой части значения углового размера.
 Описание
 В свойстве хранится количество десятичных знаков в угловых размерах. Значение свойства связано со значением одноименной системной переменной DIMADEC, в которой хранится текущее количество десятичных знаков в угловых размерах.
 Возможны следующие значения свойства:
-1 – по Dimdec (свойство принимает такое значение только через изменение системной переменной DIMADEC. Напрямую из класса DimStyleTableRecord оно недоступно);
целочисленные значения в диапазоне от 0 до 8.
 Свойство также доступно через пользовательское меню в окне изменения/создания размерного стиля:
  При изменении системной переменной DIMADEC будет создан новый размерный стиль под названием <переопределение> на основе текущего с новым значением DIMADEC.
 Условия
 Чтение и запись.
 Пример
 Пример изменения количества десятичных знаков в угловых размерах (значения свойства Dimadec) в размерном стиле Standard:
C#
 Копировать Код
public partial class Commands { [Teigha.Runtime.CommandMethod("DimadecChange")] public void DimadecStandardDimStyle() { // Получение ссылки на активный документ HostMgd.ApplicationServices.Document doc = HostMgd.ApplicationServices.Application.DocumentManager.MdiActiveDocument; // Получение ссылки на редактор документа HostMgd.EditorInput.Editor ed = doc.Editor; // Получение ссылки на базу данных документа Teigha.DatabaseServices.Database db = doc.Database; // Начало транзакции с базой данных документа using (Teigha.DatabaseServices.Transaction trans = db.TransactionManager.StartTransaction()) { // Открываем таблицу размерных стилей для чтения Teigha.DatabaseServices.DimStyleTable dimStyleTable = trans.GetObject(db.DimStyleTableId, Teigha.DatabaseServices.OpenMode.ForRead) as Teigha.DatabaseServices.DimStyleTable; // Находим в таблице размерных стилей ObjectId нужного стиля по его названию Teigha.DatabaseServices.ObjectId styleId = dimStyleTable["Standard"]; // Открываем таблицу размерного стиля для изменений Teigha.DatabaseServices.DimStyleTableRecord obj = trans.GetObject(styleId, Teigha.DatabaseServices.OpenMode.ForWrite) as Teigha.DatabaseServices.DimStyleTableRecord; ed.WriteMessage($"nDimadec before: {obj.Dimadec}"); // Изменяем настройку точности в угловых измерениях obj.Dimadec = 3; ed.WriteMessage($"nDimadec after: {obj.Dimadec}"); trans.Commit(); } } }
 Результат работы команды DimadecChange:
 Было:
 Стало:
 Ссылки
 Teigha.DatabaseServices.DimStyleTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!