Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DataTable
 Послать отзыв
 Класс DataTable предоставляет универсальный инструмент для хранения в виде двумерной таблицы числовых и текстовых данных, 3D-точек и идентификаторов объектов.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::GraphicsInterface::Drawable Teigha::DatabaseServices::DBObject Teigha::DatabaseServices::DataTable
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("AcDbDataTable")] public class DataTable : DBObject;
Копировать Код
<Wrapper("AcDbDataTable")> Public Class DataTable Inherits DBObject
 Описание
 Класс DataTable предоставляет универсальный инструмент для хранения в виде двумерной таблицы числовых и текстовых данных, 3D-точек и идентификаторов объектов. С этой целью используются классы DataCell и DataColumn.
 Методы
 Конструкторы
 Teigha.GraphicsInterface.Drawable
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 Drawable
 Конструктор класса Teigha.GraphicsInterface.Drawable. (Унаследован от Drawable)
 Teigha.DatabaseServices.DBObject
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 DBObject
 Конструктор. (Унаследован от DBObject)
 Teigha.DatabaseServices.DataTable
 Имя
 Описание
 DataTable
 Это обзор перегрузок DataTable.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.GraphicsInterface.Drawable
 Имя
 Описание
 Drawable Методы
 Ниже перечислены методы класса Drawable.
 Drawable Свойства
 Ниже перечислены свойства класса Drawable.
 Teigha.DatabaseServices.DBObject
 Имя
 Описание
 DBObject Методы
 Ниже перечислены методы класса DBObject.
 DBObject Свойства
 Ниже перечислены свойства класса DBObject.
 DBObject События
 Ниже перечислены события класса DBObject.
 Teigha.DatabaseServices.DataTable
 Имя
 Описание
 DataTable Методы
 Ниже перечислены методы класса DataTable.
 DataTable Свойства
 Ниже перечислены свойства класса DataTable.
 Ссылки
 DataTable Конструктор, DataTable Методы, DataTable Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства, DBObject События
 Ваши комментарии по поводу этого топика: Послать отзыв!