Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Point3d
 Послать отзыв
 Этот класс представляет точки (позиции) в трехмерном пространстве.
 Иерархия классов
Teigha::Geometry::Point3d
 Синтаксис
C#
Visual Basic
Копировать Код
[StructLayout(LayoutKind.Sequential),DefaultMember("Coordinate"),Wrapper("OdGePoint3d")] public class Point3d : IFormattable;
Копировать Код
<StructLayout(LayoutKind.Sequential),DefaultMember("Coordinate"),Wrapper("OdGePoint3d")> Public Class Point3d Inherits IFormattable
 Описание
 Этот класс представляет точки (позиции) в трехмерном пространстве.
 Методы
 Конструкторы
 Имя
 Описание
 Point3d
 Это обзор перегрузок Point3d.
 Топики
 Имя
 Описание
 Point3d Методы
 Ниже перечислены методы класса Point3d.
 Point3d Операторы
 Ниже перечислены операторы класса Point3d.
 Point3d Свойства
 Ниже перечислены свойства класса Point3d.
 Ссылки
 Point3d Конструктор, Point3d Методы, Point3d Операторы, Point3d Свойства, Методы, Топики, Point3d Методы, Point3d Операторы, Point3d Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!