Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.OsnapPointRef.IsXrefObj
 Послать отзыв
 Метод проверяет, не является ли связанная геометрия внешней ссылкой (Xref).
 Синтаксис
C#
Visual Basic
Копировать Код
public override bool IsXrefObj( ref ObjectIdCollection ids1, ref ObjectIdCollection ids2, bool isMainObj );
Копировать Код
Public Overrides Function IsXrefObj( ByRef ids1 As ObjectIdCollection, ByRef ids2 As ObjectIdCollection, isMainObj As Boolean ) As Boolean
 Параметры
 Параметры
 Описание
 ids1
 Первая коллекция идентификаторов объектов. Тип ObjectIdCollection.
 ids2
 Вторая коллекция идентификаторов объектов. Тип ObjectIdCollection.
 isMainObj
 Флаг, определяющий, является ли проверяемый объект основным. Тип bool.
 Возвращает
 Возвращает true, если связанная геометрия является внешней ссылкой. В противном случае возвращает false.
 Описание
 Метод позволяет проверить, не является ли связанная с точкой привязки геометрия внешней ссылкой (Xref).
 Ссылки
 Teigha.DatabaseServices.OsnapPointRef, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!