Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Helix.StartPoint
 Послать отзыв
 Свойство обеспечивает доступ к положению начальной точки спирали.
 Синтаксис
C#
Visual Basic
Копировать Код
public override Point3d StartPoint;
Копировать Код
Public Overrides Property StartPoint As Point3d
 Возвращает
 Возвращает начальную точку спирали. Тип Point3d.
 Описание
 Свойство обеспечивает доступ к положению начальной точки спирали.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Helix, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!