Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.SuppressRegenerateTable
 Послать отзыв
 Этот метод позволяет приложению временно отключить регенерацию объекта Table на время изменения одного или нескольких его свойств.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SuppressRegenerateTable( bool suppress );
Копировать Код
Public virtual Sub SuppressRegenerateTable( suppress As Boolean )
 Параметры
 Параметры
 Описание
 suppress
 Флаг подавления или включения регенерации объекта Table, bool.
 Описание
 Этот метод позволяет приложению временно отключить регенерацию объекта Table на время изменения одного или нескольких его свойств.
 Замечания
 Предупреждение
 Вызов этой функции с параметром suppress, равным true, отключает регенерацию объекта Table. Объект Table пересчитывается при вызове этого метода с параметром suppress, равным false. Перед сохранением табличного объекта в файл чертежа пользователь должен либо вызвать данный метод со значением false, либо применить метод RecomputeTableBlock(true). В противном случае объект таблицы никогда не будет отображён.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!