Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Sun.SunColor
 Послать отзыв
 Свойство SunColor представляет цвет солнечного освещения.
 Синтаксис
C#
Visual Basic
Копировать Код
public Teigha.Colors.Color SunColor;
Копировать Код
Public Property SunColor As Teigha.Colors.Color
 Возвращает
 Возвращает цвет солнечного освещения. Тип Teigha.Colors.Color.
 Описание
 Свойство SunColor представляет цвет солнечного освещения.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Sun, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!