Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocAction.GetDependentObjects
 Послать отзыв
 Метод позволяет получить коллекцию объектов, от которых зависит или которые изменяет данное действие.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectIdCollection GetDependentObjects( bool readDependenciesWanted, bool writeDependenciesWanted );
Копировать Код
Public Function GetDependentObjects( readDependenciesWanted As Boolean, writeDependenciesWanted As Boolean ) As ObjectIdCollection
 Параметры
 Параметры
 Описание
 readDependenciesWanted
 Если true, то следует искать действия, которые зависят от данного действия. Тип bool.
 writeDependenciesWanted
 Если true, то следует искать действия, которые влияют на данное действие. Тип bool.
 Возвращает
 Возвращает коллекцию ObjectId с найденными зависимостями. Тип ObjectIdCollection.
 Описание
 Метод позволяет получить коллекцию объектов, от которых зависит или которые изменяет данное действие. Реализация по умолчанию собирает все объекты, для которых действие имеет зависимость типа AssocDependency.
 Если действию принадлежит объект AssocActionBody с переопределенным методом GetDependentObjectsOverride(), вызывается именно этот переопределенный метод вместо реализации по умолчанию. Это позволяет пользовательским классам для тел действий самим контролировать, какие объекты возвращать, а какие не указывать. Впрочем, обычно нет необходимости переопределять этот метод, поскольку реализации по умолчанию, которая обходит все зависимости данного действия, должно быть вполне достаточно.
 Ссылки
 Teigha.DatabaseServices.AssocAction, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!