Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.ExternalBoundedSurface.BaseSurface
 Послать отзыв
 Свойство BaseSurface предоставляет доступ к геометрии базовой неограниченной поверхности.
 Синтаксис
C#
Visual Basic
Копировать Код
public Surface BaseSurface;
Копировать Код
Public ReadOnly Property BaseSurface As Surface
 Возвращает
 Возвращает базовую неограниченную поверхность для данного объекта. Тип Surface.
 Описание
 Свойство BaseSurface предоставляет доступ к геометрии базовой неограниченной поверхности (т.е. неограниченной ничем, кроме своих параметрических границ, если таковые имеются). Результат преобразуется в нативную поверхность, если соответствующий нативный тип поверхности существует.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.ExternalBoundedSurface, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!