Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CircularArc3d.IntersectWith
 Послать отзыв
 Метод позволяет найти точки пересечения данной дуги с другой 3D-дугой.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d[] IntersectWith( ref CircularArc3d arc );
Копировать Код
Public Function IntersectWith( ByRef arc As CircularArc3d ) As Point3d()
 Параметры
 Параметры
 Описание
 arc
 Входная трехмерная дуга. Тип CircularArc3d.
 Возвращает
 Возвращает массив точек пересечения двух дуг. Тип Point3d[].
 Описание
 Метод позволяет найти точки пересечения данной дуги с указанной 3D-дугой arc. Используется вызов метода CircularArc3d.IntersectWith(CircularArc3d arc, Tolerance tolerance) с точностью, равной Tolerance.Global.
 Ссылки
 Teigha.Geometry.CircularArc3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!