Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.UnitsConverter.CanConvertFrom
 Послать отзыв
 Метод позволяет проверить, допустимо ли преобразование заданного объекта в указанном контексте.
 Синтаксис
C#
Visual Basic
Копировать Код
public override bool CanConvertFrom( ref ITypeDescriptorContext context, ref Type sourceType );
Копировать Код
Public Function CanConvertFrom( ByRef context As ITypeDescriptorContext, ByRef sourceType As Type ) As Boolean
 Параметры
 Параметры
 Описание
 context
 Контекст преобразования. Тип ITypeDescriptorContext.
 sourceType
 Исходный тип. Тип Type.
 Возвращает
 Возвращает true, если преобразование объекта возможно. В противном случае возвращает false.
 Описание
 Метод позволяет проверить, допустимо ли преобразование заданного объекта в указанном контексте.
 Ссылки
 Teigha.DatabaseServices.UnitsConverter, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!