Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbCurve2d.MakeNonPeriodic
 Послать отзыв
 Метод делает данную кривую непериодической (если она таковой еще не является).
 Синтаксис
C#
Visual Basic
Копировать Код
public void MakeNonPeriodic();
Копировать Код
Public Sub MakeNonPeriodic()
 Описание
 Метод позволяет сделать периодическую кривую непериодической. Закрепление на концах обеспечивается введением полной кратности узлов в начальной и конечной точках.
 Ссылки
 Teigha.Geometry.NurbCurve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!