Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Graph.Node
 Послать отзыв
 Метод предназначен для получения узла данного графа по его индексу.
 Синтаксис
C#
Visual Basic
Копировать Код
public GraphNode Node( int index );
Копировать Код
Public Function Node( index As Integer ) As GraphNode
 Параметры
 Параметры
 Описание
 index
 Входной индекс узла. Тип int.
 Возвращает
 Возвращает узел с указанным индексом. Тип GraphNode. В случае недействительного индекса возвращает null.
 Описание
 Метод предназначен для получения узла данного графа по его индексу.
 Ссылки
 Teigha.DatabaseServices.Graph, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!