Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Ole2Frame.ScaleHeight
 Послать отзыв
 Свойство представляет масштабный коэффициент OLE-объекта по высоте, выраженный в процентах.
 Синтаксис
C#
Visual Basic
Копировать Код
public double ScaleHeight;
Копировать Код
Public Property ScaleHeight As Double
 Возвращает
 Возвращает масштаб OLE-объекта по высоте. Тип double.
 Описание
 Свойство представляет выраженное в процентах отношение текущей и исходной высоты OLE-объекта, т.е. его масштаб по высоте.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Ole2Frame, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!