Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeader.SetBlockAttribute
 Послать отзыв
 Метод задает значение указанному атрибуту в содержимом блока данной мультивыноски.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetBlockAttribute( DatabaseServices.ObjectId attDefId, ref AttributeReference attributeValue );
Копировать Код
Public Sub SetBlockAttribute( attDefId As DatabaseServices.ObjectId, ByRef attributeValue As AttributeReference )
 Параметры
 Параметры
 Описание
 attDefId
 Идентификатор объекта определения атрибута блока. Тип DatabaseServices.ObjectId.
 attributeValue
 Задаваемое значение атрибута. Тип AttributeReference.
 Описание
 Метод задает значение указанному атрибуту в содержимом блока данной мультивыноски.
 Ссылки
 Teigha.DatabaseServices.MLeader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!