Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ResultBuffer.GetEnumerator
 Послать отзыв
 Метод предназначен для получения объекта перечислителя буфера результатов ResultBuffer.
 Синтаксис
C#
Visual Basic
Копировать Код
public ResultBufferEnumerator GetEnumerator();
Копировать Код
Public Function GetEnumerator() As ResultBufferEnumerator
 Возвращает
 Возвращает объект перечислителя ResultBufferEnumerator.
 Описание
 Метод предназначен для получения объекта перечислителя буфера результатов ResultBuffer.
 Ссылки
 Teigha.DatabaseServices.ResultBuffer, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!