Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbCurve3d.InsertKnot
 Послать отзыв
 Метод вставляет новый узел в узловой вектор данной кривой.
 Синтаксис
C#
Visual Basic
Копировать Код
public void InsertKnot( double newKnot );
Копировать Код
Public Sub InsertKnot( newKnot As Double )
 Параметры
 Параметры
 Описание
 newKnot
 Новый узел. Тип double.
 Описание
 Метод вставляет новый узел в узловой вектор данной кривой. Если значение newKnot уже имеется в узловом векторе, то кратность этого узла увеличивается на единицу.
 Ссылки
 Teigha.Geometry.NurbCurve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!