Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.OsnapPointRef.IntersectEntity
 Послать отзыв
 Метод предоставляет ссылку на объект XrefFullSubentityPath объекта чертежа, с которым пересекается данный объект OsnapPointRef.
 Синтаксис
C#
Visual Basic
Копировать Код
public XrefFullSubentityPath IntersectEntity();
Копировать Код
Public Function IntersectEntity() As XrefFullSubentityPath
 Возвращает
 Возвращает ссылку на полный путь подобъекта внешней ссылки. Тип XrefFullSubentityPath.
 Описание
 Метод предоставляет ссылку на объект XrefFullSubentityPath объекта чертежа, с которым пересекается данный объект OsnapPointRef.
 Ссылки
 Teigha.DatabaseServices.OsnapPointRef, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!