Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CurveCurveIntersector2d.CurveCurveIntersector2d
 Послать отзыв
 Конструктор по умолчанию класса CurveCurveIntersector2d.
 Синтаксис
C#
Visual Basic
Копировать Код
public CurveCurveIntersector2d();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию для класса CurveCurveIntersector2d.
 Создает объект с нулевыми указателями на кривые и допуском по умолчанию. Предполагается, что реальные данные будут заданы позднее с использованием одного из методов Set().
 Ссылки
 Teigha.Geometry.CurveCurveIntersector2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!