Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 DimStyleTableRecord.Dimldrblk
 Послать отзыв
 Свойство отвечает за вид окончания выноски и зависит от значения свойства Dimldrblks.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual ObjectId Dimldrblk { get; set; }
Копировать Код
Public Overridable Property Dimldrblk As ObjectId
 Возвращает
 Возвращает тип данных ObjectId.
 Описание
 В свойстве хранится ObjectId внешнего вида окончания выноски, который в настоящий момент установлен.
 Каждый вид окончания выноски является блоком и в чертеже хранится, как тип данных BlockTableRecord в таблице блоков BlockTable.
 Коллекция блоков - окончаний выносок хранится в шаблоне чертежа и через API недоступна. Отдельные блоки из этой коллекции появляются в таблице блоков чертежа после того, как к ним обратились через системную переменную DIMLDRBLK или через пользовательский интерфейс:
  При изменении системной переменной DIMLDRBLK будет создан новый размерный стиль под названием <переопределение> на основе текущего с новым значением DIMLDRBLK.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.DimStyleTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!