Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Group.GetIndex
 Послать отзыв
 Метод позволяет получить индекс указанного объекта в данной группе.
 Синтаксис
C#
Visual Basic
Копировать Код
public int GetIndex( DatabaseServices.ObjectId id );
Копировать Код
Public Function GetIndex( id As DatabaseServices.ObjectId ) As Integer
 Параметры
 Параметры
 Описание
 id
 Идентификатор объекта чертежа. Тип DatabaseServices.ObjectId.
 Возвращает
 Возвращает индекс указанного объекта в данной группе. Тип int. Метод выбрасывает исключение eInvalidInput, если объект с указанным id в данной группе отсутствует.
 Описание
 Метод позволяет получить индекс указанного объекта в данной группе.
 Ссылки
 Teigha.DatabaseServices.Group, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!