Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ArcDimension.Leader2Point
 Послать отзыв
 Свойство предоставляет доступ к конечной точке дополнительной выноски размера длины дуги, если выноска отображается.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d Leader2Point;
Копировать Код
Public Property Leader2Point() As Point3d
 Возвращает
 Возвращает точку, тип Point3d.
 Описание
 Свойство позволяет получить или задать конечную точку дополнительной выноски размера длины дуги, если выноска отображается. Точка задается в мировой системе коордмнат (WCS).
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.ArcDimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!