Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LinkedTableData.UpdateDataLink
 Послать отзыв
 Метод позволяет обновить внешние ссылки в данном объекте.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void UpdateDataLink( UpdateDirection dir, UpdateOption option );
Копировать Код
Public Overridable Sub UpdateDataLink( dir As UpdateDirection, [option] As UpdateOption )
 Параметры
 Параметры
 Описание
 dir
 Направление обновления данных. Перечисление UpdateDirection.
 option
 Опции обновления данных. Перечисление UpdateOption.
 Описание
 Метод позволяет обновить внешние ссылки в данном объекте. Дополнительно возможно уточнить направление обновления и задать опции обновления.
 Ссылки
 Teigha.DatabaseServices.LinkedTableData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!