Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.BoundBlock2d.Direction1
 Послать отзыв
 Свойство Direction1 представляет направление и длину первой стороны данной граничной рамки.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector2d Direction1;
Копировать Код
Public ReadOnly Property Direction1 As Vector2d
 Возвращает
 Возвращает вектор, определяющий первую сторону граничной рамки. Тип Vector2d.
 Описание
 Свойство Direction1 представляет направление и длину первой стороны данной граничной рамки.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.BoundBlock2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!