Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор Polyline.Polyline (int)
 Послать отзыв
 Синтаксис
C#
Visual Basic
public Polyline(int vertices);
Public Sub New(vertices As Integer)
 Параметры
 Параметры
 Описание
 vertices
 Количество вершин, для которых будет выделена память
 Описание
 Класс Polyline динамически выделяет память при добавлении вершин. Однако, если вы знаете количество вершин, которое будет добавлено к полилинии, в конструкторе может быть выделен точный объем памяти в соответствии с указанным в конструкторе количеством вершин. Определение ненулевого значения для параметра vertices не означает, что объект автоматически будет иметь столько вершин. Это означает, что будет выделена память, готовая к загрузке информации о вершинах. Эта выделенная память не используется, пока не будет заполнена при вызове метода Polyline.AddVertexAt().
 Если полилиния будет расширена или уменьшена с помощью добавления или удаления вершин, выделенная динамическая память может только увеличиваться, но не уменьшаться. Когда пользователь завершает добавление или удаление вершин, может оставаться неиспользуемая выделенная память. Для ее освобождения следует использовать метод Polyline.MinimizeMemory(), но после того, как все добавления или удаления в полилинии сделаны. Это освобождение памяти не делается автоматически при выполнении каждой из команд Polyline.AddVertexAt() и Polyline.RemoveVertexAt(), поскольку является операцией, затратной по времени.
 Ссылки
 Teigha.DatabaseServices.Polyline, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!