Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Shape.Normal
 Послать отзыв
 Свойство Normal представляет нормаль плоскости, в которой располагается данный объект.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d Normal;
Копировать Код
Public Property Normal As Vector3d
 Возвращает
 Возвращает вектор нормали плоскости в мировой системе координат (WCS). Тип Vector3d.
 Описание
 Свойство Normal представляет нормаль плоскости, в которой располагается данный объект.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Shape, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!