Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocAction.SetOwningNetwork
 Послать отзыв
 Метод позволяет задать сеть-владельца для данного действия.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetOwningNetwork( Teigha.DatabaseServices.ObjectId networkId, bool alsoSetAsDatabaseOwner );
Копировать Код
Public Sub SetOwningNetwork( networkId As Teigha.DatabaseServices.ObjectId, alsoSetAsDatabaseOwner As Boolean )
 Параметры
 Параметры
 Описание
 networkId
 Входная сеть ассоциативных зависимостей, которая логически должна владеть данным действием. Тип Teigha.DatabaseServices.ObjectId.
 alsoSetAsDatabaseOwner
 Флаг назначения владельца. Тип bool. Задать true, если требуется сделать сеть networkId "физическим" владельцем этого действия в базе данных. В противном случае передать false.
 Описание
 Метод позволяет задать сеть-владельца для данного действия.
 Всякое действие, за исключением самой верхней сети AssocNetwork, логически принадлежит единственной сети AssocNetwork. Эта сеть также может быть «физическим» владельцем ассоциативного действия в базе данных (сеть имеет идентификатор жесткого владения действием), но «физическим» владельцем может быть и какой-либо иной объект. Например, для сетей, подключенных к BlockTableRecords, «логическим» владельцем является сеть верхнего уровня всей базы данных, а «физическим» владельцем в базе данных является подсловарь словаря расширения AcBdBlockTableRecord.
 Этот метод не следует вызывать напрямую. Вместо этого следует использовать методы AssocNetwork.AddAction() и AssocNetwork.RemoveAction(), которые, в свою очередь, вызывают SetOwningNetwork().
 Ссылки
 Teigha.DatabaseServices.AssocAction, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!