Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.LineSegment3d.Set
 Послать отзыв
 Метод позволяет переопределить начальную и конечную точки данного линейного сегмента.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Set( Point3d point1, Point3d point2 );
Копировать Код
Public Sub Set( point1 As Point3d, point2 As Point3d )
 Параметры
 Параметры
 Описание
 point1
 Новая начальная точка. Тип Point3d.
 point2
 Новая конечная точка. Тип Point3d.
 Описание
 Метод позволяет переопределить начальную и конечную точки данного линейного сегмента.
 Ссылки
 Teigha.Geometry.LineSegment3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!