Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CellEdgeMasks
 Послать отзыв
 Перечисление CellEdgeMasks определяет индексы расположения границы ячейки таблицы.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum CellEdgeMasks { TopMask = 1, RightMask = 2, BottomMask = 4, LeftMask = 8 }
Копировать Код
Public Enum CellEdgeMasks TopMask = 1 RightMask = 2 BottomMask = 4 LeftMask = 8 End Enum
 Члены
 Члены
 Описание
 TopMask
 Значение: 1. Индекс верхней границы ячейки.
 RightMask
 Значение: 2. Индекс правой границы ячейки.
 BottomMask
 Значение: 4. Индекс нижней границы ячейки.
 LeftMask
 Значение: 8. Индекс левой границы ячейки.
 Описание
 Перечисление CellEdgeMasks определяет индексы расположения границы ячейки (слева, справа, сверху, снизу).
 Ваши комментарии по поводу этого топика: Послать отзыв!