Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.TableHitTestInfo.ToString
 Послать отзыв
 Метод позволяет получить эквивалентное строковое представление данного объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public sealed override String ToString();
Копировать Код
Public NotOverridable Overrides Function ToString() As String
 Возвращает
 Возвращает строковое представление данного объекта. Тип String.
 Описание
 Метод позволяет получить эквивалентное строковое представление данного объекта, которое содержит индексы строки и столбца.
 Ссылки
 Teigha.DatabaseServices.TableHitTestInfo, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!