Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Handle.==
 Послать отзыв
 Возвращает true, если a равно b.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool operator ==( Handle a, Handle b );
Копировать Код
Public Operator ==( a As Handle, b As Handle )
 Параметры
 Параметры
 Описание
 a
 Левый операнд, тип Handle,
 b
 Правый операнд, тип Handle.
 Возвращает
 Возвращает true, если a равно b, и false в противном случае.
 Описание
 Возвращает true, если a равно b.
 Ссылки
 Teigha.DatabaseServices.Handle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!