Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Runtime.RXObject.Create
 Послать отзыв
 Метод создает новый экземпляр класса, используя псевдоконструктор класса и данный экземпляр класса.
 Синтаксис
C#
Visual Basic
Копировать Код
public RXObject Create( IntPtr unmanagedPointer, bool autoDelete );
Копировать Код
Public Function Create( unmanagedPointer As IntPtr, autoDelete As Boolean ) As RXObject
 Параметры
 Параметры
 Описание
 unmanagedPointer
 Входной неуправляемый указатель на исходный объект. Тип IntPtr.
 autoDelete
 Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.
 Возвращает
 Возвращает новый экземпляр класса. Тип RXObject.
 Описание
 Метод создает новый экземпляр класса, используя псевдоконструктор класса и данный экземпляр класса. Возвращает интеллектуальный указатель на вновь созданный экземпляр.
 Ссылки
 Teigha.DatabaseServices.FormattedTableData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!