Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Point3d.Mirror
 Послать отзыв
 Метод позволяет получить 3D-точку, которая является зеркальным отражением данной точки относительно заданной плоскости.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d Mirror( ref Plane plane );
Копировать Код
Public Function Mirror( ByRef plane As Plane ) As Point3d
 Параметры
 Параметры
 Описание
 plane
 Плоскость зеркального отражения. Тип Plane.
 Возвращает
 Возвращает 3D-точку, которая является результатом зеркального отражения данной точки относительно заданной плоскости. Тип Point3d.
 Описание
 Метод позволяет получить 3D-точку, которая является зеркальным отражением данной точки относительно заданной плоскости plane.
 Ссылки
 Teigha.Geometry.Point3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!