Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Point3AngularDimension.Point3AngularDimension
 Послать отзыв
 Конструктор по умолчанию класса Point3AngularDimension.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3AngularDimension();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса Point3AngularDimension. Создает угловой размер с вершиной угла и началами обеих выносных линий в точке (0, 0, 0).
 Ссылки
 Teigha.DatabaseServices.Point3AngularDimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!