Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.OffsetSurface
 Послать отзыв
 Класс OffsetSurface представляет 3D-поверхность, которая построена как точное смещение другой поверхности.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Geometry::Entity3d Teigha::Geometry::Surface Teigha::Geometry::OffsetSurface
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdGeOffsetSurface")] public sealed class OffsetSurface : Surface
Копировать Код
<Wrapper("OdGeOffsetSurface")> Public NotInheritable Class OffsetSurface Inherits Surface
 Описание
 Класс OffsetSurface представляет 3D-поверхность, которая построена как точное смещение другой поверхности.
 Методы
 Конструкторы
 Teigha.Geometry.OffsetSurface
 Имя
 Описание
 OffsetSurface
 Это обзор перегрузок OffsetSurface.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Geometry.Entity3d
 Имя
 Описание
 Entity3d Методы
 Ниже перечислены методы класса Entity3d.
 Teigha.Geometry.Surface
 Имя
 Описание
 Surface Методы
 Ниже перечислены методы класса Surface.
 Surface Свойства
 Ниже перечислены свойства класса Surface.
 Teigha.Geometry.OffsetSurface
 Имя
 Описание
 OffsetSurface Методы
 Ниже перечислены методы класса OffsetSurface.
 OffsetSurface Свойства
 Ниже перечислены свойства класса OffsetSurface.
 Ссылки
 OffsetSurface Конструктор, OffsetSurface Методы, OffsetSurface Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!