Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Viewport.UcsName
 Послать отзыв
 Свойство UcsName представляет идентификатор объекта пользовательской системы координат, связанной с данным видовым экраном.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.ObjectId UcsName;
Копировать Код
Public ReadOnly Property UcsName As DatabaseServices.ObjectId
 Возвращает
 Возвращает идентификатор объекта пользовательской системы координат. Тип DatabaseServices.ObjectId.
 Описание
 Свойство UcsName представляет идентификатор объекта пользовательской системы координат (ПСК, UCS), связанной с данным видовым экраном.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Viewport, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!