Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 BlockTableRecord.PathName
 Послать отзыв
 Свойство предназначено для хранения ссылки на внешний блок.
 Синтаксис
C#
Visual Basic
Копировать Код
public string PathName { get; set; }
Копировать Код
Public Property PathName As String
 Возвращает
 Тип данных string.
 Note Значение свойства соответствует групповому коду 1 DXF.
 Описание
 Свойство предназначено для внешних блоков и хранит в себе ссылку на этот блок в виде строки. Если запись таблицы блоков не является внешней ссылкой, то строка будет занесена в запись таблицы блоков, но не будет использоваться.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.BlockTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!