Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.SetGridLineWeight
 Послать отзыв
 Метод позволяет задать толщину линии для ячейки, строки или столбца объекта Table.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetGridLineWeight( int row, int column, GridLineType gridLineType, DatabaseServices.LineWeight lineWeight );
Копировать Код
Public virtual Sub SetGridLineWeight( row As Integer, column As Integer, gridLineType As GridLineType, lineWeight As DatabaseServices.LineWeight )
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс может равняться -1.
 lineWeight
 Толщина линии из перечисления DatabaseServices.LineWeight.
 col
 Индекс столбца, тип int. Индекс может равняться -1.
 gridlineType
 Тип линий сетки из перечисления GridLineType.
 Описание
 Метод позволяет задать толщину линии для ячейки, строки или столбца объекта Table.
 Чтобы задать одинаковое значение сразу для нескольких типов линий сетки, можно комбинировать типы линий, используя оператор OR.
 Чтобы задать ячейку, следует указать допустимые индексы строки и столбца. Чтобы задать строку, следует указать допустимый индекс строки и -1 в качестве индекса столбца. Чтобы задать столбец, следует указать допустимый индекс столбца и -1 в качестве индекса строки.
 Замечания
 Для получения того же результата предпочтительнее использовать Table.Cells[row,column].{Top,Bottom,Left,Right}Edge.LineWeight.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!