Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Field
 Послать отзыв
 Класс Field представляет объекты Field в базе данных. Объект Field является контейнером для вычисляемого выражения, вычисленного результата и других данных.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::GraphicsInterface::Drawable Teigha::DatabaseServices::DBObject Teigha::DatabaseServices::Field
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("AcDbField" )] public class Field : DBObject;
Копировать Код
<Wrapper("AcDbField" )> Public Class Field Inherits DBObject
 Описание
 Класс Field представляет объекты Field в базе данных. Объект Field является контейнером для вычисляемого выражения, вычисленного результата и ряда других данных. Поддерживаются следующие типы данных для результатов: Long, Double, String, Date, Point, 3dPoint, ObjectId, Buffer и Resbuf. За вычисление отвечает вычислитель.
 Методы
 Конструкторы
 Teigha.GraphicsInterface.Drawable
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 Drawable
 Конструктор класса Teigha.GraphicsInterface.Drawable. (Унаследован от Drawable)
 Teigha.DatabaseServices.DBObject
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 DBObject
 Конструктор. (Унаследован от DBObject)
 Teigha.DatabaseServices.Field
 Имя
 Описание
 Field
 Это обзор перегрузок Field.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.GraphicsInterface.Drawable
 Имя
 Описание
 Drawable Методы
 Ниже перечислены методы класса Drawable.
 Drawable Свойства
 Ниже перечислены свойства класса Drawable.
 Teigha.DatabaseServices.DBObject
 Имя
 Описание
 DBObject Методы
 Ниже перечислены методы класса DBObject.
 DBObject Свойства
 Ниже перечислены свойства класса DBObject.
 DBObject События
 Ниже перечислены события класса DBObject.
 Teigha.DatabaseServices.Field
 Имя
 Описание
 Field Методы
 Ниже перечислены методы класса Field.
 Field Свойства
 Ниже перечислены свойства класса Field.
 Ссылки
 Field Конструктор, Field Методы, Field Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства, DBObject События
 Ваши комментарии по поводу этого топика: Послать отзыв!