Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SubDMesh.VertexNormalArray
 Послать отзыв
 Свойство представляет доступ к массиву нормалей в вершинах сети.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3dCollection VertexNormalArray;
Копировать Код
Public Property VertexNormalArray() As Vector3dCollection
 Возвращает
 Возвращает массив нормалей в вершинах сети, тип Vector3dCollection.
 Описание
 Свойство представляет доступ к массиву нормалей в вершинах сети.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.SubDMesh, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!