Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Dimse1
 Послать отзыв
 Синтаксис
C#
Visual Basic
public bool Dimse1;
Public Property Dimse1() As bool
 Описание
 Возвращает или устанавливает текущее значение DIMSE1 для базы данных. Значение false соответствует 0. Значение true — 1.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!