Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.Dimsoxd
 Послать отзыв
 Свойство управляет подавлением стрелок, если между выносными линиями для них недостаточно места.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool Dimsoxd;
Копировать Код
Public Property Dimsoxd As Boolean
 Возвращает
 Возвращает true, если подавление включено. В противном случае возвращает false.
 Описание
 Свойство управляет подавлением стрелок, если между выносными линиями для них недостаточно места.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!