Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SystemVariableChangedEventArgs.Changed
 Послать отзыв
 Свойство Changed позволяет проверить, успешно ли завершилось изменение системной переменной.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool Changed;
Копировать Код
Public ReadOnly Property Changed As Boolean
 Возвращает
 Возвращает true, если изменение системной переменной завершилось успешно. В противном случае возвращает false.
 Описание
 Свойство Changed позволяет проверить, успешно ли завершилось изменение системной переменной.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.SystemVariableChangedEventArgs, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!