Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Celtype
 Послать отзыв
 Синтаксис
C#
Visual Basic
public DatabaseServices::ObjectId Celtype;
Public Property Celtype() As DatabaseServices.ObjectId
 Описание
 Возвращает или устанавливает Id типа линии, определенной текущим значением CELTYPE для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!