Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FeatureControlFrame.GetBoundingPolyline
 Послать отзыв
 Метод предназначен для получения последовательности несовпадающих угловых точек этого объекта FeatureControlFrame.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual Point3dCollection GetBoundingPolyline();
Копировать Код
Public Overridable Function GetBoundingPolyline() As Point3dCollection
 Возвращает
 Возвращает последовательность угловых точек данного объекта. Тип Point3dCollection.
 Описание
 Метод предназначен для получения последовательности несовпадающих угловых точек этого объекта FeatureControlFrame.
 Ссылки
 Teigha.DatabaseServices.FeatureControlFrame, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!