Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.ExternalBoundedSurface.IsEllipCone
 Послать отзыв
 Свойство IsEllipCone позволяет проверить, является ли неограниченная базовая поверхность данного объекта эллиптическим конусом.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsEllipCone;
Копировать Код
Public ReadOnly Property IsEllipCone As Boolean
 Возвращает
 Возвращает true, если неограниченная базовая поверхность данного объекта является эллиптическим конусом. В противном случае возвращает false.
 Описание
 Свойство IsEllipCone определяет тип неограниченной базовой поверхности данного объекта и возвращает true, если она является эллиптическим конусом.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.ExternalBoundedSurface, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!