Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBVisualStyle.DBVisualStyle
 Послать отзыв
 Конструктор по умолчанию.
 Синтаксис
C#
Visual Basic
Копировать Код
public DBVisualStyle();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию.
 Ссылки
 Teigha.DatabaseServices.DBVisualStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!