Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ObjectContextCollection.IEnumerable_GetEnumerator
 Послать отзыв
 Метод предоставляет перечислитель для данного объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual System.Collections.IEnumerator IEnumerable_GetEnumerator();
Копировать Код
Public Overridable Function IEnumerable_GetEnumerator() As System.Collections.IEnumerator
 Возвращает
 Возвращает перечислитель для данной коллекции. Тип System.Collections.IEnumerator.
 Описание
 Метод предоставляет перечислитель для данного объекта.
 Ссылки
 Teigha.DatabaseServices.ObjectContextCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!