Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.HostApplicationServices.FindFile
 Послать отзыв
 Метод позволяет получить полный путь к указанному файлу.
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract String FindFile( ref String fileName, ref Database database, FindFileHint hint );
Копировать Код
Public MustOverride Function FindFile( ByRef fileName As String, ByRef database As Database, hint As FindFileHint ) As String
 Параметры
 Параметры
 Описание
 fileName
 Имя файла, который требуется найти. Тип String.
 database
 Указатель на контекст базы данных. Тип Database. Указать значение null, если искомый файл не связан с базой данных.
 hint
 Уточнение типа искомого файла. Перечисление FindFileHint.
 Возвращает
 Возвращает полное имя файла либо пустую строку, если файл найти не удалось. Тип String.
 Описание
 Метод позволяет получить полный путь к указанному файлу. Используется в случаях, когда базе данных требуется доступ к файлу, например файлу шрифта, файлу шаблона и т.д.
 Типичные этапы поиска:
Проверка имени файла.
Поиск в текущем каталоге.
Поиск в каталоге чертежей (для файлов шрифтов SHX, изображений и внешних ссылок).
Поиск в каталогах, перечисленных в переменной среды (environment variable).
Поиск в каталоге шрифтов Microsoft(R) Windows(R) (только для шрифтов TTF в Windows).
 Для сужения поиска метод позволяет уточнить тип искомого файла константой из перечисления FindFileHint.
 Ссылки
 Teigha.DatabaseServices.HostApplicationServices, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!