Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.ExternalCurve3d.IsLineSegment
 Послать отзыв
 Свойство IsLineSegment позволяет проверить, представляет ли данный объект прямолинейный сегмент.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsLineSegment;
Копировать Код
Public ReadOnly Property IsLineSegment As Boolean
 Возвращает
 Возвращает true, если данный объект представляет прямолинейный сегмент. В противном случае возвращает false.
 Описание
 Свойство IsLineSegment позволяет проверить, представляет ли данный объект прямолинейный сегмент.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.ExternalCurve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!