Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbCurve3dData.IsEqualTo
 Послать отзыв
 Метод проверяет, совпадают ли данные этой NURBS кривой с данными указанного объекта типа NurbCurve3dData.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsEqualTo( NurbCurve3dData a );
Копировать Код
Public Function IsEqualTo( a As NurbCurve3dData ) As Boolean
 Параметры
 Параметры
 Описание
 a
 Проверяемые данные трехмерной NURBS кривой. Тип NurbCurve3dData.
 Возвращает
 Возвращает true, если сравниваемые объекты можно считать равными. В противном случае возвращает false.
 Описание
 Метод проверяет, совпадают ли данные этой NURBS кривой с данными указанного объекта типа NurbCurve3dData.
 Замечания
 Объекты типа NurbCurve3dData считаются равными, если одновременно выполняются следующие условия:
Обе кривые являются рациональными (назначены веса) или обе являются нерациональными (веса не используются);
Обе кривые являются периодическими (замкнутыми) или обе являются непериодическими (незамкнутыми);
Управляющие вершины совпадают;
Коллекции узлов совпадают;
Значения весов равны.
 Ссылки
 Teigha.Geometry.NurbCurve3dData, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!