Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Leader.IsSplined
 Послать отзыв
 Синтаксис
C#
Visual Basic
public bool IsSplined;
Public Property IsSplined() As bool
 Описание
 Возвращает признак того, является ли выноска сглаженной сплайном.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Leader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!