Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MText.Height
 Послать отзыв
 Свойство представляет высоту ограничивающего бокса данного объекта MText.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Height;
Копировать Код
Public Property Height As Double
 Возвращает
 Возвращает высоту ограничивающего бокса данного объекта. Тип double.
 Описание
 Свойство представляет высоту ограничивающего бокса данного объекта MText, т.е. его габаритный размер по высоте.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MText, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!