Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ArcDimension.HasLeader
 Послать отзыв
 Свойство определяет, имеет ли размер дополнительную выноску, отображаемую для устранения неоднозначности.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool HasLeader;
Копировать Код
Public Property HasLeader() As Boolean
 Возвращает
 Возвращает логическое значение, тип bool.
 Описание
 Свойство определяет, имеет ли размер дополнительную выноску, отображаемую для устранения неоднозначности.
 Замечания
 Если угол между выносными линиями меньше Pi/2 (90 градусов), или расстояние от центральной точки до размерной дуги меньше радиуса дуги, то выноска не отображается, даже если свойству HasLeader присвоено значение true.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.ArcDimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!