Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FormattedTableData.SetRotation
 Послать отзыв
 Метод позволяет задать поворот содержимого ячейки.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetRotation( int row, int column, double value );
Копировать Код
Public Overridable Sub SetRotation( row As Integer, column As Integer, value As Double )
 Параметры
 Параметры
 Описание
 row
 Индекс строки. Тип int. Должен быть неотрицательным и меньше количества строк в таблице.
 column
 Индекс столбца. Тип int. Должен быть неотрицательным и меньше количества столбцов в таблице.
 value
 Угол поворота элементов содержимого ячейки (в радианах). Тип double.
 Описание
 Метод позволяет задать поворот содержимого ячейки.
 Ссылки
 Teigha.DatabaseServices.FormattedTableData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!