Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotStyleDescriptor.GetHashCode
 Послать отзыв
 Метод вычисляет хэш-код для данного объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public int GetHashCode();
Копировать Код
Public Function GetHashCode() As Integer
 Возвращает
 Возвращает хэш-код для данного объекта. Тип int.
 Описание
 Метод вычисляет хэш-код для данного объекта. Дополнительные сведения см. в документации по API Microsoft .NET.
 Ссылки
 Teigha.DatabaseServices.PlotStyleDescriptor, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!