Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Dimtxt
 Послать отзыв
 Синтаксис
C#
Visual Basic
public double Dimtxt;
Public Property Dimtxt() As Double
 Описание
 Возвращает или устанавливает текущее значение DIMTXT для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!