Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotSettings.CurrentStyleSheet
 Послать отзыв
 Свойство CurrentStyleSheet представляет текущую таблицу стилей печати.
 Синтаксис
C#
Visual Basic
Копировать Код
public String CurrentStyleSheet;
Копировать Код
Public ReadOnly Property CurrentStyleSheet As String
 Возвращает
 Возвращает имя текущей таблицы стилей печати. Тип String.
 Описание
 Свойство CurrentStyleSheet представляет текущую таблицу стилей печати.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.PlotSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!