Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GripData
 Послать отзыв
 Класс представляет данные ручек для объектов чертежа.
 Иерархия классов
Teigha::DatabaseServices::GripData
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdDbGripData")] public class GripData : DisposableWrapper
Копировать Код
<Wrapper("OdDbGripData")> Public Class GripData Inherits DisposableWrapper
 Описание
 Этот класс описывает конкретную ручку для конкретного объекта чертежа и позволяет приложениям с управлением объектами чертежа посредством ручек реализовать следующий функционал:
отрисовка ручек с собственными глифами;
выполнение пользовательских операций, когда пользователь активирует ручку или наводит на нее курсор;
управление контекстным меню при использовании ручек;
получение подробных уведомлений об операциях редактирования с использованием ручек.
 Когда пользовательский класс реализует метод Entity.GetGripPoints(), он заполняет аргумент GripDataCollection объектами GripData, по одному на каждую точку захвата.
 Объект GripData содержит два обязательных элемента, определяющих ручку:
фактическая 3D-точка ручки,
указатель на структуру данных пользовательского объекта, который используется в качестве идентификатора ручки.
 В объекте GripData представлен также ряд необязательных элементов, содержащих указатели на обратные вызовы, которые вызывающее приложение может вызывать в ходе редактирования ручки, чтобы позволить пользовательскому объекту выполнять обработку событий.
 Предусмотрен также ряд необязательных элементов, содержащих указатели на обратные вызовы, которые позволяют реализовать обработку событий пользовательским объектом в ходе редактирования ручки. Эти указатели могут быть нулевыми, если функциональность не реализована.
 Объект также включает опциональную битовую маску, которая позволяет настраивать внешний вид ручки в процессе операций перетаскивания. Эти битовые значения допускают комбинирование посредством операции OR.
 Топики
 Имя
 Описание
 GripData Перечисления
 Ниже перечислены перечисления класса GripData.
 GripData Методы
 Ниже перечислены методы класса GripData.
 GripData Свойства
 Ниже перечислены свойства класса GripData.
 Ссылки
 GripData Перечисления, GripData Методы, GripData Свойства, Топики, GripData Перечисления, GripData Методы, GripData Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!