Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Polyline.GetBulgeAt
 Послать отзыв
 Синтаксис
C#
Visual Basic
public double GetBulgeAt(int index);
Public Function GetBulgeAt(index As Integer) As Double
 Параметры
 Параметры
 Описание
 index
 Индекс (отсчитываемый от 0) вершины для начала степени выпуклости
 Описание
 Этот метод возвращает значение степени выпуклости для вершины, указанной в index. Степень выпуклости используется для задания того, какая часть сегмента дуги присутствует в данной вершине. Степень выпуклости определяется как одна четвертая тангенса внутреннего угла для сегмента дуги, являющегося отрицательным, если дуга располагается против часовой стрелки от начальной к конечной точке. Степень выпуклости, равная 0, характеризует прямую, а степень выпуклости, равная 1, характеризует полукруг.
 Ссылки
 Teigha.DatabaseServices.Polyline, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!