Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Hatch.Origin
 Послать отзыв
 Синтаксис
C#
Visual Basic
public Point2d Origin;
Public Property Origin() As Point2d
 Описание
 Обеспечивает доступ к исходной точке для образца заливки для объекта заливки. Эта точка возвращается в мировых координатах.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Hatch, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!