Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MlineStyleElementCollection.Add
 Послать отзыв
 Метод предназначен для добавления в коллекцию объекта MlineStyleElement.
 Синтаксис
C#
Visual Basic
Копировать Код
public int Add( MlineStyleElement element, bool checkIfReferenced );
Копировать Код
Public Function Add( element As MlineStyleElement, checkIfReferenced As Boolean ) As Integer
 Параметры
 Параметры
 Описание
 element
 Добавляемый в коллекцию элемент. Тип MlineStyleElement.
 checkIfReferenced
 Флаг, предписывающий проверку на наличие ссылок на element. Тип bool.
 Возвращает
 Возвращает индекс нового элемента коллекции. Тип int.
 Описание
 Метод предназначен для добавления в коллекцию объекта MlineStyleElement.
 Ссылки
 Teigha.DatabaseServices.MlineStyleElementCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!