Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Viewport.FrontClipAtEyeOn
 Послать отзыв
 Свойство FrontClipAtEyeOn позволяет определить, проходит ли передняя плоскость отсечения через камеру.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool FrontClipAtEyeOn;
Копировать Код
Public Property FrontClipAtEyeOn As Boolean
 Возвращает
 Возвращает true, если передняя плоскость отсечения проходит через камеру. В противном случае возвращает false.
 Описание
 Свойство FrontClipAtEyeOn позволяет определить, проходит ли передняя плоскость отсечения через камеру.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Viewport, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!