Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Перечисление Teigha.DatabaseServices.AssocEvaluationPriority
 Послать отзыв
 This is record Teigha::DatabaseServices::AssocEvaluationPriority.
 Синтаксис
C#
Visual Basic
[Wrapper("AcDbAssocEvaluationPriority")] public enum AssocEvaluationPriority { CannotBeEvaluatedAssocEvaluationPriority = -1000, CannotDermineAssocEvaluationPriority = 0, CanBeEvaluatedAssocEvaluationPriority = 1000 }
<Wrapper("AcDbAssocEvaluationPriority")> Public Enum AssocEvaluationPriority CannotBeEvaluatedAssocEvaluationPriority = -1000 CannotDermineAssocEvaluationPriority = 0 CanBeEvaluatedAssocEvaluationPriority = 1000 End Enum
 Ваши комментарии по поводу этого топика: Послать отзыв!