Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve3d.GetProjectedClosestPointTo
 Послать отзыв
 Метод находит точки на данной кривой и указанной кривой Curve3d, которые оказываются ближайшими точками на проекциях этих двух кривых на указанную плоскость.
 Синтаксис
C#
Visual Basic
Копировать Код
public PointOnCurve3d[] GetProjectedClosestPointTo( ref Curve3d curve3d, Vector3d projectDirection );
Копировать Код
Public Function GetProjectedClosestPointTo( ByRef curve3d As Curve3d, projectDirection As Vector3d ) As PointOnCurve3d()
 Параметры
 Параметры
 Описание
 curve3d
 Входная 3D-кривая. Тип Curve3d.
 projectDirection
 Нормаль плоскости проецирования. Тип Vector3d.
 Возвращает
 Возвращает массив точек на 3D-кривой. Тип PointOnCurve3d[].
 Описание
 Метод находит точки на данной кривой и указанной кривой Curve3d, которые оказываются ближайшими точками на проекциях этих двух кривых на плоскость с нормалью projectDirection. Результатом является массив "ближайших" точек на данной кривой.
 Используется вызов метода Curve3d.GetProjectedClosestPointTo(Curve3d curve, Vector3d projectDirection, Tolerance tolerance) с точностью, равной Tolerance.Global.
 Данный метод используется в основном в задачах графической визуализации, где projectDirection служит направлением взгляда. В этом случае метод возвращает точки двух кривых, которые в проекции кажутся ближайшими точками этих кривых (хотя, разумеется, в действительности ближайшими точками они могут и не быть).
 Замечания
 Данный метод используется в основном в задачах графической визуализации, где projectDirection служит направлением взгляда. В этом случае метод возвращает точки двух кривых, которые в проекции кажутся ближайшими точками этих кривых (хотя, разумеется, в действительности ближайшими точками они могут и не быть).
 Ссылки
 Teigha.Geometry.Curve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!