Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LayerViewportProperties.IsLineWeightOverridden
 Послать отзыв
 Свойство позволяет проверить, переопределена ли толщина (вес) линий для связанного слоя и видового экрана.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsLineWeightOverridden;
Копировать Код
Public Property IsLineWeightOverridden As Boolean
 Возвращает
 Возвращает true, если толщина (вес) линий переопределена. В противном случае возвращает false.
 Описание
 Свойство позволяет проверить, переопределена ли толщина (вес) линий для связанного слоя и видового экрана.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.LayerViewportProperties, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!