Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector3d.Equals
 Послать отзыв
 Метод реализует проверку равенства данного вектора и входного объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool Equals( ref Object obj );
Копировать Код
Public Function Equals( ByRef obj As Object ) As Boolean
 Параметры
 Параметры
 Описание
 obj
 Входной объект, с которым выполняется сравнение. Тип Object.
 Возвращает
 Возвращает true, если данный вектор равен входному объекту obj. В противном случае возвращает false.
 Описание
 Метод реализует проверку равенства данного вектора и входного объекта. В случае равенства возвращает true.
 Ссылки
 Teigha.Geometry.Vector3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!