Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CurveCurveIntersector3d.IsTransversal
 Послать отзыв
 Метод позволяет проверить, являются ли кривые трансверсальными (пересекающимися) в указанной точке пересечения.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsTransversal( int intersection );
Копировать Код
Public Function IsTransversal( intersection As Integer ) As Boolean
 Параметры
 Параметры
 Описание
 intersection
 Входной индекс точки пересечения кривых. Тип int.
 Возвращает
 Возвращает true, если пересечение кривых в указанной точке является трансверсальным. В противном случае возвращает false.
 Описание
 Метод позволяет проверить, являются ли кривые трансверсальными (пересекающимися) в указанной точке пересечения. В такой точке пересечения вектора касательных к кривым 1 и 2 не параллельны друг другу.
 Ссылки
 Teigha.Geometry.CurveCurveIntersector3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!