Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GraphNodeCollection.Add
 Послать отзыв
 Метод позволяет добавить в коллекцию новый элемент.
 Синтаксис
C#
Visual Basic
Копировать Код
public int Add( ref GraphNode value );
Копировать Код
Public Function Add( ByRef value As GraphNode ) As Integer
 Параметры
 Параметры
 Описание
 value
 Добавляемый в коллекцию узел графа. Тип GraphNode.
 Возвращает
 Возвращает индекс нового элемента коллекции. Тип int.
 Описание
 Метод позволяет добавить в коллекцию новый элемент.
 Ссылки
 Teigha.DatabaseServices.GraphNodeCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!