Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Filters.SpatialFilter.ClipVolumeIntersectsExtents
 Послать отзыв
 Метод позволяет определить, пересекается ли область данного пространственного фильтра SpatialFilter с указанным ограничивающим 3D-боксом.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool ClipVolumeIntersectsExtents( Extents3d ext );
Копировать Код
Public Function ClipVolumeIntersectsExtents( ext As Extents3d ) As Boolean
 Параметры
 Параметры
 Описание
 ext
 Входной ограничивающий бокс (прямоугольный параллелепипед, ориентированный по осям системы координат). Тип Extents3d.
 Возвращает
 Возвращает true, если факт пересечения областей установлен. В противном случае возвращает false.
 Описание
 Метод позволяет определить, пересекается ли область данного пространственного фильтра SpatialFilter с указанным ограничивающим 3D-боксом Extents3d.
 Ссылки
 Teigha.DatabaseServices.Filters.SpatialFilter, Teigha.DatabaseServices.Filters
 Ваши комментарии по поводу этого топика: Послать отзыв!