Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Field.Value
 Послать отзыв
 Свойство Value возвращает значение поля в исходном типе данных.
 Синтаксис
C#
Visual Basic
Копировать Код
public Object Value;
Копировать Код
Public ReadOnly Property Value As Object
 Возвращает
 Возвращает значение поля. Тип Object.
 Описание
 Свойство Value возвращает значение поля в исходном типе данных.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Field, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!