Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Point2dCollection.Point2dCollection
 Послать отзыв
 Конструктор по умолчанию класса Point2dCollection.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point2dCollection();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса Point2dCollection. Создает пустую коллекцию с ёмкостью по умолчанию, которая определяется константой Point2dCollection.DefaultSize.
 Ссылки
 Teigha.Geometry.Point2dCollection, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!