Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Field.DataType
 Послать отзыв
 Свойство DataType возвращает тип результата вычисления поля.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.DataType DataType;
Копировать Код
Public ReadOnly Property DataType As DatabaseServices.DataType
 Возвращает
 Возвращает тип результата как значение из перечисления Teigha.DatabaseServices.DataType.
 Описание
 Свойство DataType возвращает тип результата вычисления поля. Возможные типы представлены перечислением Teigha.DatabaseServices.DataType.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Field, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!