Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DynamicDimensionChangedEventArgs.Index
 Послать отзыв
 Свойство обеспечивает доступ к значению индекса.
 Синтаксис
C#
Visual Basic
Копировать Код
public int Index;
Копировать Код
Public ReadOnly Property Index As Integer
 Возвращает
 Возвращает текущее значение индекса. Тип int.
 Описание
 Свойство обеспечивает доступ к значению индекса.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.DynamicDimensionChangedEventArgs, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!