Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DimAssoc.Erased
 Послать отзыв
 Метод уведомления, который вызывается в случае удаления указанного объекта в базе данных.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Erased( ref DBObject pObj );
Копировать Код
Public Sub Erased( ByRef pObj As DBObject )
 Параметры
 Параметры
 Описание
 pObj
 Указатель на удаляемый объект в базе данных. Тип DBObject.
 Описание
 Метод уведомления, который вызывается в случае удаления в базе данных объекта, представленного указателем pObj.
 Ссылки
 Teigha.DatabaseServices.DimAssoc, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!