Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FeatureControlFrame.GetDimstyleData
 Послать отзыв
 Метод позволяет получить запись таблицы размерных стилей с настройками размерного стиля (включая переопределения) этого объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public DimStyleTableRecord GetDimstyleData();
Копировать Код
Public Function GetDimstyleData() As DimStyleTableRecord
 Возвращает
 Возвращает запись таблицы размерных стилей. Тип DimStyleTableRecord.
 Описание
 Метод позволяет получить запись таблицы размерных стилей с настройками размерного стиля (включая переопределения) этого объекта.
 Ссылки
 Teigha.DatabaseServices.FeatureControlFrame, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!