Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Point3AngularDimension.XLine2Point
 Послать отзыв
 Свойство представляет начальную точку второй выносной линии углового размера.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d XLine2Point;
Копировать Код
Public Property XLine2Point As Point3d
 Возвращает
 Возвращает начальную точку второй выносной линии углового размера. Тип Point3d.
 Описание
 Свойство XLine2Point представляет конечную точку второй опорной линии данного размера. Эта точка определяет начальную точку второй выносной линии углового размера.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Point3AngularDimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!