Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Interval.IsBoundedAbove
 Послать отзыв
 Свойство IsBoundedAbove позволяет проверить, является ли данный интервал ограниченным сверху.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsBoundedAbove;
Копировать Код
Public ReadOnly Property IsBoundedAbove As Boolean
 Возвращает
 Возвращает true, если данный интервал является ограниченным сверху. В противном случае возвращает false.
 Описание
 Свойство IsBoundedAbove позволяет проверить, является ли данный интервал ограниченным сверху.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.Interval, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!