Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 ViewportTableRecord.SnapIncrements
 Послать отзыв
 Свойство предназначено для настройки шага привязки.
 Синтаксис
C#
Visual Basic
public Point2d SnapIncrements;
Public Property SnapIncrements() As Point2d
 Возвращает
 Возвращает тип данных Point2d.
 Описание
 Свойство предназначено для настройки шага привязки по осям X и Y. Значение X означает интервал сетки привязки по оси X, значение Y – интервал сетки привязки по оси Y. Значения сетки привязки соответствуют единицам измерения чертежа.
 Условия
 Чтение и запись.
 Ссылки
 ViewportTableRecord Класс, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!