Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AbstractViewTableRecord.SetUcs
 Послать отзыв
 Метод задает ПСК (UCS) для записи таблицы видов или видовых экранов, используя указанный объект UcsTableRecord.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetUcs( DatabaseServices.ObjectId id );
Копировать Код
Public Sub SetUcs( id As DatabaseServices.ObjectId )
 Параметры
 Параметры
 Описание
 id
 Входной идентификатор объекта UcsTableRecord. Тип DatabaseServices.ObjectId.
 Описание
 Метод определяет новую именованную пользовательскую систему координат (ПСК, UCS) для записи таблицы видов или видовых экранов. Используемый для этого входной идентификатор id должен ссылаться на действительный объект UcsTableRecord.
 Ссылки
 Teigha.DatabaseServices.AbstractViewTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!