Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SymbolUtilityServices.PreValidateSymbolName
 Послать отзыв
 Метод выполняет предварительную подготовку строки к последующей проверке на соответствие наименованию символа.
 Синтаксис
C#
Visual Basic
Копировать Код
public static String PreValidateSymbolName( ref String symbolName, bool preserveCase );
Копировать Код
Public Shared Function PreValidateSymbolName( ByRef symbolName As String, preserveCase As Boolean ) As String
 Параметры
 Параметры
 Описание
 symbolName
 Наименование символа. Тип String.
 preserveCase
 Флаг, определяющий, следует ли сохранять регистр алфавитных знаков в строке. Тип bool.
 Возвращает
 Возвращает строку, прошедшую предварительную подготовку. Тип String.
 Описание
 Метод выполняет предварительную подготовку строки к последующей проверке на соответствие наименованию символа.
 Выполняется нормализация наименования, удаляются ведущие и замыкающие пробелы. Если аргумент preserveCase принимает значение false, то вся строка преобразуется в верхний регистр.
 Ссылки
 Teigha.DatabaseServices.SymbolUtilityServices, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!