Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Entity.EdgeStyleId
 Послать отзыв
 Свойство предназначено для получения или установки идентификатора визуального стиля, применяемого исключительно к ребрам геометрического объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectId EdgeStyleId;
Копировать Код
Public Property EdgeStyleId() As ObjectId
 Возвращает
 Возвращает значение типа ObjectId, представляющее собой ссылку на объект стиля отображения ребер (EdgeStyle), который определяет их внешний вид при визуализации.
 Описание
 Свойство Обеспечивает доступ к идентификатору визуального стиля только для ребер объекта.
 Ссылки
 Teigha.DatabaseServices.Entity, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!