Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Section.Elevation
 Послать отзыв
 Свойство Elevation представляет уровень плоскости по оси Z.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Elevation;
Копировать Код
Public Property Elevation As Double
 Возвращает
 Возвращает значение координаты Z. Тип double.
 Описание
 Свойство Elevation представляет уровень плоскости по оси Z.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Section, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!