Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Filename
 Послать отзыв
 Синтаксис
C#
Visual Basic
public String Filename;
Public Property Filename() As String
 Описание
 Возвращает имя файла, связанного с базой данных.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!