Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.Dimfrac
 Послать отзыв
 Свойство задает или возвращает дробный формат.
 Синтаксис
C#
Visual Basic
Копировать Код
public int Dimfrac;
Копировать Код
Public Property Dimfrac As Integer
 Возвращает
 Возвращает значение типа int, которое кодирует вариант отображения дроби: 0 для горизонтальной, 1 для диагональной, 2 для дроби в одну строку.
 Описание
 Свойство задает или возвращает дробный формат. Применимо, если для свойства Dimlunit установлено значение 5 (дробный формат) или 4 (архитектурный дробный формат).
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!