Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.Dimtih
 Послать отзыв
 Свойство Dimtih управляет ориентацией размерного текста между выносными линиями.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool Dimtih;
Копировать Код
Public Property Dimtih As Boolean
 Возвращает
 Возвращает true в случае выравнивания по горизонтали. Возвращает false в случае выравнивания вдоль размерной линии или линии выноски.
 Описание
 Свойство задает или возвращает ориентацию размерного текста между выносными линиями.
 Если свойство Dimtih имеет значение true, поле размерного текста выравнивается по горизонтали. Если Dimtih имеет значение false, ориентация поля размерного текста определяется ориентацией размерной линии или линии выноски.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!