Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DxfFiler.WriteString
 Послать отзыв
 Метод записывает в данный объект Filer указанную строку.
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract void WriteString( DxfCode opCode, String value );
Копировать Код
Public MustOverride Sub WriteString( opCode As DxfCode, value As String )
 Параметры
 Параметры
 Описание
 opCode
 Групповой код DXF. Тип DxfCode.
 value
 Значение, которое следует записать. Тип String.
 Описание
 Метод записывает в данный объект Filer указанные групповой код DXF и строку.
 Ссылки
 Teigha.DatabaseServices.DxfFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!