Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocArrayCommonParameters.GetLevelCount
 Послать отзыв
 Метод предоставляет количество уровней в этом массиве.
 Синтаксис
C#
Visual Basic
Копировать Код
public int GetLevelCount( out String expression, out String evaluatorId );
Копировать Код
Public Function GetLevelCount( expression As out String, evaluatorId As out String ) As Integer
 Параметры
 Параметры
 Описание
 expression
 Выражение для параметра. Тип String.
 evaluatorId
 Полученный в виде строки идентификатор вычислителя. Тип String.
 Возвращает
 Возвращает количество уровней. Тип int.
 Описание
 Метод предоставляет количество уровней в этом массиве. Если для параметра выражение отсутствует, то после выполнения метода строки expression и evaluatorId остаются пустыми.
 Ссылки
 Teigha.DatabaseServices.AssocArrayCommonParameters, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!