Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Viewport.DefaultLightingType
 Послать отзыв
 Свойство DefaultLightingType представляет тип освещения по умолчанию в данном видовом экране.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.DefaultLightingType DefaultLightingType;
Копировать Код
Public Property DefaultLightingType As DatabaseServices.DefaultLightingType
 Возвращает
 Возвращает тип освещения по умолчанию в данном видовом экране. Перечисление DatabaseServices.DefaultLightingType.
 Описание
 Свойство DefaultLightingType представляет тип освещения по умолчанию в данном видовом экране.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Viewport, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!