Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Matrix2dInfo.Angle
 Послать отзыв
 Свойство Angle представляет значение угла поворота в матрице.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Angle;
Копировать Код
Public ReadOnly Property Angle As Double
 Возвращает
 Возвращает значение угла поворота. Тип double.
 Описание
 Свойство Angle представляет значение угла поворота в матрице.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.Matrix2dInfo, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!