Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CompoundObjectId.LeafId
 Послать отзыв
 Свойство обеспечивает доступ к идентификатору конечного ObjectId в BlockTableRecord, на который ссылается последнее вхождение BlockReference в пути, или просто ObjectId, если путь отсутствует.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectId LeafId;
Копировать Код
Public Property LeafId() As ObjectId
 Возвращает
 Возвращает идентификатор конечного объекта. Тип ObjectId.
 Описание
 Свойство обеспечивает доступ к идентификатору конечного ObjectId в BlockTableRecord, на который ссылается последнее вхождение BlockReference в пути, или просто ObjectId, если путь отсутствует.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.CompoundObjectId, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!