Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBVisualStyle.Description
 Послать отзыв
 Свойство обеспечивает доступ к описанию визуального стиля.
 Синтаксис
C#
Visual Basic
Копировать Код
public String Description;
Копировать Код
Public Property Description() As String
 Возвращает
 Возвращает описание стиля. Тип String.
 Описание
 Свойство обеспечивает доступ к описанию визуального стиля.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.DBVisualStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!