Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GripData.OnGripStatusChanged
 Послать отзыв
 Метод предназначен для обработки события изменения статуса ручки.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void OnGripStatusChanged( ObjectId entityId, Status newStatus );
Копировать Код
Public Overridable Sub OnGripStatusChanged( entityId As ObjectId, newStatus As Status )
 Параметры
 Параметры
 Описание
 entityId
 Идентификатор объекта чертежа. Тип ObjectId.
 newStatus
 Новый статус ручки. Перечисление GripData.Status.
 Описание
 Метод предназначен для обработки события изменения статуса ручки.
 Ссылки
 Teigha.DatabaseServices.GripData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!