Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Entity.BoundingBoxIntersectWith(Entity
 Послать отзыв
 Метод предназначен для расчета проекции края ограничивающего бокса исходного объекта чертежа и объекта, пересечения с которым необходимо найти, на указанную плоскость проекции. После вычисления проекции метод определяет ограничивающий бокс для объекта, находит точки пересечения и проецирует их обратно на край ограничивающего прямоугольника исходного объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public void BoundingBoxIntersectWith(Entity entityPointer, Intersect intersectType, Plane projectionPlane, Point3dCollection points, IntPtr thisGraphicSystemMarker, IntPtr otherGraphicSystemMarker);
Копировать Код
Public Sub BoundingBoxIntersectWith(entityPointer As Entity, intersectType As Intersect, projectionPlane As Plane, points As Point3dCollection, thisGraphicSystemMarker As IntPtr, otherGraphicSystemMarker As IntPtr)
 Параметры
 Параметры
 Описание
 entityPointer
 Указатель на объект, с которым необходимо найти пересечения. Тип Entity
 intersectType
 Вид пересечения. Тип Intersect
 projectionPlane
 Плоскость проекции. Тип Plane
 points
 Выходная коллекция координат точек пересечения. Тип Point3dCollection
 thisGraphicSystemMarker
 GS маркер подобъекта исходного объекта чертежа, для которого ищутся пересечения. Может быть 0, если это не применимо. Тип IntPtr
 otherGraphicSystemMarker
 GS маркер подобъекта объекта чертежа, с которым нужно найти пересечения. Может быть 0, если это не применимо. Тип IntPtr
 Описание
 Метод расчитывает проекцию края ограничивающего бокса исходного объекта чертежа и объекта, пересечения с которым необходимо найти, на указанную плоскость проекции, вычисляет ограничивающий бокс для этого объекта, а затем находит точки пересечения и проецирует пересечения обратно на край ограничивающего прямоугольника исходного объекта.
 Ссылки
 Teigha.DatabaseServices.Entity, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!