Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.EllipticalArc2d.IsCircular
 Послать отзыв
 Метод позволяет проверить, можно ли в пределах указанной геометрической точности считать данную эллиптическую дугу круглой.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsCircular( Tolerance tolerance );
Копировать Код
Public Function IsCircular( tolerance As Tolerance ) As Boolean
 Параметры
 Параметры
 Описание
 tolerance
 Заданная геометрическая точность. Тип Tolerance.
 Возвращает
 Возвращает true, если в пределах указанной геометрической точности данную эллиптическую дугу можно считать круглой. В противном случае возвращает false.
 Описание
 Метод позволяет проверить, можно ли в пределах указанной геометрической точности считать данную эллиптическую дугу круглой.
 Ссылки
 Teigha.Geometry.EllipticalArc2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!