Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Cell.AttachmentPoint
 Послать отзыв
 Свойство возвращает точку присоединения ячейки.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d AttachmentPoint;
Копировать Код
Public ReadOnly Property AttachmentPoint As Point3d
 Возвращает
 Возвращает точку присоединения ячейки. Тип Point3d.
 Описание
 Свойство возвращает точку Point3d присоединения ячейки.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Cell, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!