Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.ExternalSurface.ExternalSurface
 Послать отзыв
 Конструктор по умолчанию класса ExternalSurface.
 Синтаксис
C#
Visual Basic
Копировать Код
public ExternalSurface();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса ExternalSurface. Создает пустой экземпляр с нулевым указателем на определение поверхности, неопределенным типом поверхности (другими словами, нет информации о системе, в которой была создана внешняя поверхность) и опцией предотвращения копирования внешней поверхности.
 Ссылки
 Teigha.Geometry.ExternalSurface, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!