Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство BlockReference.IsDynamicBlock
 Послать отзыв
 Синтаксис
C#
Visual Basic
public bool IsDynamicBlock;
Public Property IsDynamicBlock() As bool
 Описание
 Определяет, содержит ли BlockReference , переданный в конструктор класса, информацию о динамическом блоке.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.BlockReference, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!