Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AbstractViewPE.Ucs
 Послать отзыв
 Свойство Ucs представляет используемую пользовательскую систему координат.
 Синтаксис
C#
Visual Basic
Копировать Код
public CoordinateSystem3d Ucs;
Копировать Код
Public Property Ucs As CoordinateSystem3d
 Возвращает
 Возвращает пользовательскую систему координат. Тип CoordinateSystem3d.
 Описание
 Свойство Ucs представляет используемую пользовательскую систему координат (ПСК, UCS).
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.AbstractViewPE, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!