Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AbstractViewportData.CircleSides
 Послать отзыв
 Свойство CircleSides предоставляет доступ к количеству линейных сегментов, используемых при тесселяции окружностей.
 Синтаксис
C#
Visual Basic
Копировать Код
public UInt16 CircleSides;
Копировать Код
Public Property CircleSides As UInt16
 Возвращает
 Возвращает количество линейных сегментов, используемых для аппроксимации окружности. Тип UInt16.
 Описание
 Свойство CircleSides предоставляет доступ к количеству линейных сегментов, используемых при тесселяции окружностей в видовом экране.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.AbstractViewportData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!