Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Tolerance.Tolerance
 Послать отзыв
 Конструктор структуры Tolerance. Создает экземпляр класса с указанными значениями equalPoint и equalVector для проверки равенства точек и векторов.
 Синтаксис
C#
Visual Basic
Копировать Код
public Tolerance( double equalVector, double equalPoint );
Копировать Код
Public Sub New( equalVector As Double, equalPoint As Double )
 Параметры
 Параметры
 Описание
 equalVector
 Точность (допуск) для критерия равенства векторов. Тип double.
 equalPoint
 Точность (допуск) для критерия равенства точек. Тип double.
 Описание
 Конструктор структуры Tolerance. Создает экземпляр класса с указанными значениями equalPoint и equalVector для проверки равенства точек и векторов.
 Ссылки
 Teigha.Geometry.Tolerance, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!