Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AttributeDefinition.Preset
 Послать отзыв
 Свойство предоставляет доступ на изменение статуса "Установленный" (Preset) данного определения атрибута AttributeDefinition.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool Preset;
Копировать Код
Public Property Preset() As Boolean
 Возвращает
 Возвращает true, если данному определению атрибута присвоен статус "Установленный" (Preset). В противном случае возвращает false.
 Описание
 Свойство предоставляет доступ на изменение статуса "Установленный" (Preset) данного определения атрибута. Такое определение предполагает заданное значение по умолчанию.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.AttributeDefinition, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!