Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LayerTableRecord
 Послать отзыв
 Класс предназначен для хранения определений слоёв в базе данных чертежа.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::GraphicsInterface::Drawable Teigha::DatabaseServices::DBObject Teigha::DatabaseServices::SymbolTableRecord Teigha::DatabaseServices::LayerTableRecord
 Синтаксис
C#
Visual Basic
[Wrapper("AcDbLayerTableRecord" )] public class LayerTableRecord : SymbolTableRecord;
<Wrapper("AcDbLayerTableRecord" )> Public Class LayerTableRecord Inherits SymbolTableRecord
 Описание
 Класс предназначен для хранения определений слоёв в базе данных чертежа.
 Определение слоя представляет из себя набор данных, определяющий настройки слоя, которые влияют на внешний вид и свойства объектов, расположенных на этом слое (цвет — есть или нет, замороженный/размороженный и т.д.).
 Все настройки слоёв, которые есть в пользовательском интерфейсе, также доступны и через API в виде свойств класса LayerTableRecord.
 Для создания нового слоя необходимо указать его название. Все остальные свойства имеют значения по умолчанию и их значения при создании слоя определять не обязательно.
 Пример
 В качестве примера работы с определением слоя приведена команда AddNewLayer, которая создаёт новый слой и добавляет его в таблицу слоёв dwg-документа.
C#
 Копировать Код
public partial class Commands { [Teigha.Runtime.CommandMethod("AddNewLayer")] public void AddNewLayer() { // Получение ссылки на активный документ HostMgd.ApplicationServices.Document doc = HostMgd.ApplicationServices.Application.DocumentManager.MdiActiveDocument; // Получение ссылки на редактор докумена HostMgd.EditorInput.Editor ed = doc.Editor; // Получение ссылки на базу данных документа Teigha.DatabaseServices.Database db = doc.Database; // Начало транзакции с базой данных документа using (Teigha.DatabaseServices.Transaction trans = db.TransactionManager.StartTransaction()) { // Открываем таблицу слоёв для записи Teigha.DatabaseServices.LayerTable layerTable = trans.GetObject(db.LayerTableId, Teigha.DatabaseServices.OpenMode.ForWrite) as Teigha.DatabaseServices.LayerTable; // Создаем новый слой Teigha.DatabaseServices.LayerTableRecord newLayer = new Teigha.DatabaseServices.LayerTableRecord(); newLayer.Name = "newLayer"; newLayer.Color=Teigha.Colors.Color.FromColorIndex(Teigha.Colors.ColorMethod.ByAci,3); // Добавляем новый слой в таблицу слоёв try { layerTable.Add(newLayer); } catch (Teigha.Runtime.Exception ex) { if (ex.ErrorStatus == Teigha.Runtime.ErrorStatus.DuplicateRecordName) ed.WriteMessage("Слой с таким названием уже существует."); } // Перебираем таблицу слоёв в цикле foreach (Teigha.DatabaseServices.ObjectId dstr in layerTable) { // Открываем каждую запись таблицы Teigha.DatabaseServices.LayerTableRecord obj = trans.GetObject(dstr, Teigha.DatabaseServices.OpenMode.ForRead) as Teigha.DatabaseServices.LayerTableRecord; // Выводим в командную строку nanoCAD имя каждого слоя и его цвет ed.WriteMessage($"Layer name: {obj.Name} | color: {obj.Color}"); } trans.Commit(); } } }
 На рисунке ниже приведен снимок экрана с сообщениями в командной строке nanoCAD после отработки команды AddNewLayer в новом пустом документе:
 В результате получаем список из двух слоёв: слой «0», который всегда есть в документе и слой newLayer, который был добавлен нашей командой.
 Методы
 Конструкторы
 Teigha.GraphicsInterface.Drawable
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 Drawable
 Конструктор класса Teigha.GraphicsInterface.Drawable. (Унаследован от Drawable)
 Teigha.DatabaseServices.DBObject
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 DBObject
 Конструктор. (Унаследован от DBObject)
 Teigha.DatabaseServices.SymbolTableRecord
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 SymbolTableRecord
 This is SymbolTableRecord, a member of class SymbolTableRecord. (Унаследован от SymbolTableRecord)
 Teigha.DatabaseServices.LayerTableRecord
 Имя
 Описание
 LayerTableRecord
 Это обзор перегрузок LayerTableRecord.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.GraphicsInterface.Drawable
 Имя
 Описание
 Drawable Методы
 Ниже перечислены методы класса Drawable.
 Drawable Свойства
 Ниже перечислены свойства класса Drawable.
 Teigha.DatabaseServices.DBObject
 Имя
 Описание
 DBObject Методы
 Ниже перечислены методы класса DBObject.
 DBObject Свойства
 Ниже перечислены свойства класса DBObject.
 DBObject События
 Ниже перечислены события класса DBObject.
 Teigha.DatabaseServices.SymbolTableRecord
 Имя
 Описание
 SymbolTableRecord Свойства
 Ниже перечислены свойства класса SymbolTableRecord.
 Teigha.DatabaseServices.LayerTableRecord
 Имя
 Описание
 LayerTableRecord Методы
 Ниже перечислены методы класса LayerTableRecord.
 LayerTableRecord Свойства
 Ниже перечислены свойства класса LayerTableRecord.
 Ссылки
 LayerTableRecord Конструктор, LayerTableRecord Методы, LayerTableRecord Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства, DBObject События
 Ваши комментарии по поводу этого топика: Послать отзыв!