Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Extents3d.IsEqualTo
 Послать отзыв
 Метод позволяет сравнить данный объект с указанным объектом Extents3d в пределах заданного допуска.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsEqualTo( Extents3d a, Tolerance tolerance );
Копировать Код
Public Function IsEqualTo( a As Extents3d, tolerance As Tolerance ) As Boolean
 Параметры
 Параметры
 Описание
 a
 Проверяемый объект. Тип Extents3d.
 tolerance
 Геометрический допуск. Тип Tolerance.
 Возвращает
 Возвращает true, если минимальные и максимальные точки сравниваемых объектов совпадают в пределах допуска tolerance. В противном случае возвращает false.
 Описание
 Метод позволяет сравнить данный объект с указанным объектом Extents3d в пределах заданного допуска.
 Ссылки
 Teigha.DatabaseServices.Extents3d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!