Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.HyperLinkCollection.IndexOf
 Послать отзыв
 Метод позволяет получить индекс объекта HyperLink в этой коллекции, соответствующий указанной гиперссылке.
 Синтаксис
C#
Visual Basic
Копировать Код
public int IndexOf( ref HyperLink value );
Копировать Код
Public Function IndexOf( ByRef value As HyperLink ) As Integer
 Параметры
 Параметры
 Описание
 value
 Гиперссылка, для которой вычисляется индекс в данной коллекции. Тип HyperLink.
 Возвращает
 Возвращает индекс указанного объекта HyperLink в этой коллекции. Тип int.
 Описание
 Метод позволяет получить индекс объекта HyperLink в этой коллекции, соответствующий указанной гиперссылке value.
 Ссылки
 Teigha.DatabaseServices.HyperLinkCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!