Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.UnderlayItem.Name
 Послать отзыв
 Свойство Name представляет уникальное имя данного элемента в файле.
 Синтаксис
C#
Visual Basic
Копировать Код
public String Name;
Копировать Код
Public ReadOnly Property Name As String
 Возвращает
 Возвращает уникальное имя элемента. Тип String.
 Описание
 Свойство Name представляет уникальное имя данного элемента в файле.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.UnderlayItem, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!