Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Spline.InsertFitPointAt
 Послать отзыв
 Метод позволяет вставить указанную точку в массив определяющих точек данного сплайна по заданному индексу.
 Синтаксис
C#
Visual Basic
Копировать Код
public void InsertFitPointAt( int index, Point3d point );
Копировать Код
Public Sub InsertFitPointAt( index As Integer, point As Point3d )
 Параметры
 Параметры
 Описание
 index
 Индекс в массиве определяющих точек. Тип int.
 point
 Вставляемая определяющая точка. Тип Point3d.
 Описание
 Метод позволяет вставить указанную точку в массив определяющих точек данного сплайна по заданному индексу.
 Ссылки
 Teigha.DatabaseServices.Spline, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!