Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Scale3d.PreMultiplyBy
 Послать отзыв
 Метод реализует векторное произведение указанного вектора масштабирования на данный объект (leftSide) * (данный вектор).
 Синтаксис
C#
Visual Basic
Копировать Код
public Scale3d PreMultiplyBy( Scale3d leftSide );
Копировать Код
Public Function PreMultiplyBy( leftSide As Scale3d ) As Scale3d
 Параметры
 Параметры
 Описание
 leftSide
 Входной вектор масштабирования, используемый в качестве множителя. Тип Scale3d.
 Возвращает
 Возвращает результат векторного умножения. Тип Scale3d.
 Описание
 Метод сохраняет в данном объекте результат векторного произведения данного объекта на указанный вектор масштабирования (leftSide) * (данный вектор).
 Замечания
 Умножение векторов масштабирования является коммутативным.
 Ссылки
 Teigha.Geometry.Scale3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!