Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.BeginWblockObjectsEventArgs.IdMapping
 Послать отзыв
 Свойство предоставляет доступ к объекту IdMapping, который обеспечивает мэппинг исходных и целевых объектов.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.IdMapping IdMapping;
Копировать Код
Public Property IdMapping() As DatabaseServices.IdMapping
 Возвращает
 Возвращает объект мэппинга идентификаторов объектов. Тип DatabaseServices.IdMapping.
 Описание
 Свойство предоставляет доступ к объекту IdMapping, который обеспечивает мэппинг исходных и целевых объектов.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.BeginWblockObjectsEventArgs, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!