Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MlineStyle.Filled
 Послать отзыв
 Свойство управляет режимом фоновой заливки мультилинии.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool Filled;
Копировать Код
Public Property Filled As Boolean
 Возвращает
 Возвращает true, если фоновая заливка включена. В противном случае возвращает false.
 Описание
 Свойство управляет режимом фоновой заливки мультилинии.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MlineStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!