Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Line2d.Line2d
 Послать отзыв
 Конструктор класса Line2d. Строит линию, проходящую через две заданные несовпадающие точки.
 Синтаксис
C#
Visual Basic
Копировать Код
public Line2d( Point2d point1, Point2d point2 );
Копировать Код
Public Sub New( point1 As Point2d, point2 As Point2d )
 Параметры
 Параметры
 Описание
 point1
 Первая заданная точка. Тип Point2d.
 point2
 Вторая заданная точка. Тип Point2d.
 Описание
 Конструктор класса Line2d. Строит линию, проходящую через две заданные несовпадающие точки.
 Ссылки
 Teigha.Geometry.Line2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!