Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.KnotCollection.IsFixedSize
 Послать отзыв
 Свойство IsFixedSize позволяет проверить, является ли фиксированным размер данной коллекции.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual bool IsFixedSize;
Копировать Код
Public Overridable ReadOnly Property IsFixedSize As Boolean
 Возвращает
 Возвращает true, если размер данной коллекции является фиксированным. В противном случае возвращает false.
 Описание
 Свойство IsFixedSize позволяет проверить, является ли фиксированным размер данной коллекции.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.KnotCollection, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!