Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.TableStyle.GridColor
 Послать отзыв
 Метод позволяет получить цвет указанного типа линий сетки в строке заданного типа.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual Teigha.Colors.Color GridColor( GridLineType gridLineType, RowType rowType );
Копировать Код
Public Overridable Function GridColor( gridLineType As GridLineType, rowType As RowType ) As Teigha.Colors.Color
 Параметры
 Параметры
 Описание
 gridLineType
 Тип линий сетки. Перечисление GridLineType.
 rowType
 Тип строки. Перечисление RowType.
 Возвращает
 Возвращает цвет линий сетки. Тип Teigha.Colors.Color.
 Описание
 Метод позволяет получить цвет линий сетки указанного типа в строках заданного типа.
 Ссылки
 Teigha.DatabaseServices.TableStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!