Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Plimcheck
 Послать отзыв
 Синтаксис
C#
Visual Basic
public bool Plimcheck;
Public Property Plimcheck() As bool
 Описание
 Возвращает или устанавливает текущее значение LIMCHECK пространства листа для базы данных. Значение false соответствует 0. Значение true — 1.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!