Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AbstractViewTableRecord.LensLength
 Послать отзыв
 Свойство LensLength предоставляет доступ к фокусному расстоянию (в мм) для TableRecord в режиме перспективного проецирования.
 Синтаксис
C#
Visual Basic
Копировать Код
public double LensLength;
Копировать Код
Public Property LensLength As Double
 Возвращает
 Возвращает фокусное расстояние камеры вида (в мм). Тип double.
 Описание
 Свойство LensLength предоставляет доступ к фокусному расстоянию (в мм) для TableRecord в режиме перспективного проецирования (DXF 42).
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.AbstractViewTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!