Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.RadialDimensionLarge.JogAngle
 Послать отзыв
 Свойство JogAngle представляет угол излома данного размера.
 Синтаксис
C#
Visual Basic
Копировать Код
public double JogAngle;
Копировать Код
Public Property JogAngle As Double
 Возвращает
 Возвращает угол излома в радианах. Тип double.
 Описание
 Свойство JogAngle представляет угол излома данного размера (угол между линией, проходящей через переопределенный центр, и линией, проходящей через точку излома). Положительным направлением отсчета углов является направление против часовой стрелки, если смотреть навстречу вектору нормали плоскости размера.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.RadialDimensionLarge, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!