Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CircularArc3d.CircularArc3d
 Послать отзыв
 Конструктор класса CircularArc3d. Создает в заданной плоскости круглую 3D-дугу с указанными центром, радиусом, начальным и конечным углами.
 Синтаксис
C#
Visual Basic
Копировать Код
public CircularArc3d( Point3d center, Vector3d normal, Vector3d referenceVector, double radius, double startAngle, double endAngle );
Копировать Код
Public Sub New( center As Point3d, normal As Vector3d, referenceVector As Vector3d, radius As Double, startAngle As Double, endAngle As Double )
 Параметры
 Параметры
 Описание
 center
 Центр дуги. Тип Point3d.
 normal
 Вектор нормали плоскости, в которой создается 3D-дуга. Тип Vector3d.
 referenceVector
 Опорный вектор, определяющий направление начала отсчета углов дуги (направление нулевого угла). Тип Vector3d.
 radius
 Радиус дуги. Тип double. Не может равняться 0.
 startAngle
 Угол начальной точки дуги. Тип double.
 endAngle
 Угол конечной точки дуги. Тип double.
 Описание
 Конструктор класса CircularArc3d. Создает в заданной плоскости круглую 3D-дугу с указанными центром, радиусом, начальным и конечным углами. Кроме того, задается направление, от которого будут отсчитываться углы.
 Замечания
 Векторы normal и referenceVector должны быть перпендикулярными. Угол измеряется против часовой стрелки вокруг вектора нормали. Направление вектора referenceVector определяет начало отсчета углов (нулевой угол). Угол начальной точки дуги startAngle должен быть меньше угла конечной точки endAngle. Все углы представляются в радианах.
 Ссылки
 Teigha.Geometry.CircularArc3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!