Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ArcDimension.CenterPoint
 Послать отзыв
 Свойство предоставляет доступ к точке центра дуги, длину которой определяет данный размер.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d CenterPoint;
Копировать Код
Public Property CenterPoint() As Point3d
 Возвращает
 Возвращает точку, тип Point3d.
 Описание
 Свойство позволяет получить или задать точку центра дуги, длину которой определяет данный размер. Точка задается в мировой системе коордмнат (WCS).
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.ArcDimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!