Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 DimStyleTableRecord.Dimdli
 Послать отзыв
 Свойство отвечает расстояние между размерными линиями в базовых размерах.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual double Dimdli { get; set; }
Копировать Код
Public Overridable Property Dimdli As Double
 Возвращает
 Возвращает тип данных double.
 Описание
 В свойстве хранится расстояние между размерными линиями в базовых размерах в виде числа double. Свойство может принимать только положительные числа. Значение по умолчанию 6.
 Свойство также доступно через системную переменную DIMDLI и пользовательское меню в окне изменения/создания размерного стиля:
  При изменении системной переменной DIMDLI будет создан новый размерный стиль под названием <переопределение> на основе текущего с новым значением DIMDLI.
 Условия
 Чтение и запись.
 Пример
 Пример изменения расстояния между размерными линиями в базовых размерах (значения свойства Dimdli) в размерном стиле "Standard":
C#
 Копировать Код
public partial class Commands { [Teigha.Runtime.CommandMethod("DimdliChange")] public void DimdliStandardDimStyle() { // Получение ссылки на активный документ HostMgd.ApplicationServices.Document doc = HostMgd.ApplicationServices.Application.DocumentManager.MdiActiveDocument; // Получение ссылки на редактор документа HostMgd.EditorInput.Editor ed = doc.Editor; // Получение ссылки на базу данных документа Teigha.DatabaseServices.Database db = doc.Database; // Начало транзакции с базой данных документа using (Teigha.DatabaseServices.Transaction trans = db.TransactionManager.StartTransaction()) { // Открываем таблицу размерных стилей для чтения Teigha.DatabaseServices.DimStyleTable dimStyleTable = trans.GetObject(db.DimStyleTableId, Teigha.DatabaseServices.OpenMode.ForRead) as Teigha.DatabaseServices.DimStyleTable; // Находим в таблице размерных стилей ObjectId нужного стиля по его названию Teigha.DatabaseServices.ObjectId styleId = dimStyleTable["Standard"]; // Открываем таблицу размерного стиля для изменений Teigha.DatabaseServices.DimStyleTableRecord obj = trans.GetObject(styleId, Teigha.DatabaseServices.OpenMode.ForWrite) as Teigha.DatabaseServices.DimStyleTableRecord; ed.WriteMessage($"nDimdli before: {obj.Dimdli}"); // Изменяем расстояние между размерными линиями obj.Dimdli = 12; ed.WriteMessage($"nDimdli after: {obj.Dimdli}"); trans.Commit(); } } }
 Результат работы команды DimdliChange:
 Было:
 Стало:
 Ссылки
 Teigha.DatabaseServices.DimStyleTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!