Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MlineStyle.Elements
 Послать отзыв
 Свойство представляет элементы данного объекта MlineStyle с данными о цвете, смещении и типах линий, используемых стилем мультилинии.
 Синтаксис
C#
Visual Basic
Копировать Код
public MlineStyleElementCollection Elements;
Копировать Код
Public ReadOnly Property Elements As MlineStyleElementCollection
 Возвращает
 Возвращает коллекцию элементов мультилинии. Тип MlineStyleElementCollection.
 Описание
 Свойство представляет элементы данного объекта MlineStyle, которые содержат данные о цвете, смещении и идентификаторах типов линий, используемых этим стилем.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.MlineStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!