Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ObjectOverrule.Cancel
 Послать отзыв
 Метод отменяет переопределение.А
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void Cancel( ref DBObject dbObject );
Копировать Код
Public virtual Sub Cancel( ByRef dbObject As DBObject )
 Параметры
 Параметры
 Описание
 dbObject
 Объект DBObject.
 Описание
 Метод отменяет переопределение.
 Ссылки
 Teigha.DatabaseServices.ObjectOverrule, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!