Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GripData.IsPerViewport
 Послать отзыв
 Свойство определяет, используется ли эта ручка в каждом видовом экране.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsPerViewport;
Копировать Код
Public Property IsPerViewport As Boolean
 Возвращает
 Возвращает true, если ручка используется в каждом видовом экране. В противном случае возвращает false.
 Описание
 Свойство определяет, используется ли эта ручка в каждом видовом экране.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.GripData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!