Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SecurityAlgorithm
 Послать отзыв
 Данное перечисление определяет алгоритмы шифрования, поддерживаемые в документах nanoCAD.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum SecurityAlgorithm { RC4 = 26625 }
Копировать Код
Public Enum SecurityAlgorithm RC4 = 26625 End Enum
 Члены
 Члены
 Описание
 RC4
 Значение: 26625 (0x6801). Потоковый шифр RC4.
 Описание
 Данное перечисление определяет алгоритмы шифрования, поддерживаемые в документах nanoCAD.
 Ваши комментарии по поводу этого топика: Послать отзыв!