Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ProxyEntity.ProxyFlags
 Послать отзыв
 Свойство ProxyFlags представляет флаги редактирования для класса, связанного с данным прокси-объектом.
 Синтаксис
C#
Visual Basic
Копировать Код
public int ProxyFlags;
Копировать Код
Public ReadOnly Property ProxyFlags As Integer
 Возвращает
 Возвращает флаги редактирования. Тип int.
 Описание
 Свойство ProxyFlags представляет флаги редактирования для класса, связанного с данным прокси-объектом. Эти битовые флаги определяют операции, допустимые для этого прокси-объекта.
 Свойство возвращает комбинацию одного или нескольких свойств из следующего списка:
 Имя
 Значение
 Используемый метод
 kNoOperation
 0x0
 Отсутствует.
 kEraseAllowed
 0x1
 erase()
 kTransformAllowed
 0x2
 transformBy()
 kColorChangeAllowed
 0x4
 setColor(), setColorIndex()
 kLayerChangeAllowed
 0x8
 setLayer()
 kLinetypeChangeAllowed
 0x10
 setLinetype()
 kLinetypeScaleChangeAllowed
 0x20
 setLinetypeScale()
 kVisibilityChangeAllowed
 0x40
 setVisibility()
 kCloningAllowed
 0x80
 subDeepClone(), subWblockClone()
 kLineWeightChangeAllowed
 0x100
 setLineWeight()
 kPlotStyleNameChangeAllowed
 0x200
 setPlotStyleName()
 kDisableProxyWarning
 0x400
 Отключить предупреждения о прокси-объектах.
 kMaterialChangeAllowed
 0x800
 setMaterial()
 kAllButCloningAllowed
 0xB7F
 Все перечисленные выше, кроме клонирования.
 kAllAllowedBits
 0xBFF
 Все перечисленные выше.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.ProxyEntity, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!