Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SecurityParameters.ProviderName
 Послать отзыв
 Свойство ProviderName представляет имя провайдера криптографии.
 Синтаксис
C#
Visual Basic
Копировать Код
public String ProviderName;
Копировать Код
Public Property ProviderName As String
 Возвращает
 Возвращает имя провайдера криптографии. Тип String.
 Описание
 Свойство ProviderName представляет имя провайдера криптографии.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.SecurityParameters, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!