Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.SplineEntity3d.EndPoint
 Послать отзыв
 Свойство EndPoint представляет точку сплайна с максимальным значением параметра. Не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d EndPoint;
Копировать Код
Public ReadOnly Property EndPoint As Point3d
 Возвращает
 Возвращает точку сплайна с максимальным значением параметра. Тип Point3d.
 Описание
 Свойство EndPoint представляет точку сплайна с максимальным значением параметра. Не реализовано.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.SplineEntity3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!