Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Cell.SetValue
 Послать отзыв
 Метод позволяет задать значение указанного атрибута блока данной ячейки.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetValue( ref Object value, ParseOption parseOption );
Копировать Код
Public Sub SetValue( ByRef value As Object, parseOption As ParseOption )
 Параметры
 Параметры
 Описание
 value
 Новое значение атрибута. Тип Object.
 parseOption
 Опции представления нового значения из перечисления ParseOption.
 Описание
 Метод позволяет задать значение указанного атрибута блока данной ячейки. Атрибут определяется идентификатором определения атрибута.
 Ссылки
 Teigha.DatabaseServices.Cell, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!