Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CircularArc3d.ProjectedIntersectWith
 Послать отзыв
 Метод позволяет найти точки пересечения проекций данной дуги и указанной линии на заданную плоскость.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d[] ProjectedIntersectWith( ref LinearEntity3d line, Vector3d projectionDirection );
Копировать Код
Public Function ProjectedIntersectWith( ByRef line As LinearEntity3d, projectionDirection As Vector3d ) As Point3d()
 Параметры
 Параметры
 Описание
 line
 Входная 3D-линия. Тип LinearEntity3d.
 projectionDirection
 Направление проецирования (нормаль плоскости проекции). Тип Vector3d.
 Возвращает
 Возвращает массив точек пересечения проекций дуги и линии на заданную плоскость. Тип Point3d[].
 Описание
 Метод позволяет найти точки пересечения проекций данной дуги и линии line на плоскость с вектором нормали projectionDirection. Другими словами, метод находит те точки на дуге и линии, которые проецируются в одну и ту же точку на этой плоскости.
 Используется вызов метода CircularArc3d.ProjectedIntersectWith(LinearEntity3d line, Vector3d projectionDirection, Tolerance tolerance) с точностью, равной Tolerance.Global.
 Замечания
 Метод используется преимущественно в задачах, где projectionDirection представляет собой направление взгляда. В этом случае метод возвращает точки, которые представляются наблюдателю точками пересечения линии с дугой (но фактически точками пересечения могут и не быть).
 Ссылки
 Teigha.Geometry.CircularArc3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!