Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.BulgeVertexCollection.Add
 Послать отзыв
 Метод добавляет объект BulgeVertex в данную коллекцию.
 Синтаксис
C#
Visual Basic
Копировать Код
public int Add( ref BulgeVertex value );
Копировать Код
Public Function Add( ByRef value As BulgeVertex ) As Integer
 Параметры
 Параметры
 Описание
 value
 Добавляемый в коллекцию объект. Тип BulgeVertex.
 Возвращает
 Возвращает отсчитываемый от нуля индекс вновь добавленного элемента коллекции.
 Описание
 Метод добавляет объект BulgeVertex в данную коллекцию и возвращает индекс нового элемента коллекции.
 Ссылки
 Teigha.DatabaseServices.BulgeVertexCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!