Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Filters.Filter.Filter
 Послать отзыв
 Конструктор класса Filter.
 Синтаксис
C#
Visual Basic
Копировать Код
public Filter( IntPtr unmanagedObjPtr, bool autoDelete );
Копировать Код
Public Sub New( unmanagedObjPtr As IntPtr, autoDelete As Boolean )
 Параметры
 Параметры
 Описание
 autoDelete
 Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.
 unmanagedObjPtr
 Неуправляемый указатель на исходный объект. Тип IntPtr.
 Описание
 Конструктор класса Filter.
 Ссылки
 Teigha.DatabaseServices.Filters.Filter, Teigha.DatabaseServices.Filters
 Ваши комментарии по поводу этого топика: Послать отзыв!