Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Cone.Set
 Послать отзыв
 Метод позволяет переопределить все параметры конуса - центр и радиус основания, направление оси конуса, косинус и синус угла между осью конуса и образующей, высоту конуса, а также начальный и конечный углы поворота образующей конуса.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Set( double cosineAngle, double sineAngle, Point3d baseCenter, double baseRadius, Vector3d axisOfSymmetry, Vector3d refAxis, ref Interval height, double startAngle, double endAngle );
Копировать Код
Public Sub Set( cosineAngle As Double, sineAngle As Double, baseCenter As Point3d, baseRadius As Double, axisOfSymmetry As Vector3d, refAxis As Vector3d, ByRef height As Interval, startAngle As Double, endAngle As Double )
 Параметры
 Параметры
 Описание
 cosineAngle
 Косинус угла между осью конуса и его образующей. Тип double.
 sineAngle
 Синус угла между осью конуса и его образующей. Тип double.
 baseCenter
 Центр окружности в основании конуса. Тип Point3d.
 baseRadius
 Радиус основания конуса. Тип double.
 axisOfSymmetry
 Направление оси конуса. Тип Vector3d.
 refAxis
 Опорный вектор в основании конуса, задающий направление отсчета углов в основании. Тип Vector3d.
 height
 Высота конуса. Тип Interval.
 startAngle
 Начальный угол поворота образующей в радианах. Тип double.
 endAngle
 Конечный угол поворота образующей в радианах. Тип double.
 Описание
 Метод позволяет переопределить все параметры конуса - центр и радиус основания, направление оси конуса, косинус и синус угла между осью конуса и образующей, высоту конуса, а также начальный и конечный углы поворота образующей конуса.
 Ссылки
 Teigha.Geometry.Cone, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!