Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Extents3d.!=
 Послать отзыв
 Оператор неравенства класса Extents3d.
 Синтаксис
C#
Visual Basic
Копировать Код
public static bool operator !=( Extents3d a, Extents3d b );
Копировать Код
Public Shared Operator <>( a As Extents3d, b As Extents3d ) As Boolean
 Параметры
 Параметры
 Описание
 a
 Левый операнд. Тип Extents3d.
 b
 Правый операнд. Тип Extents3d.
 Возвращает
 Возвращает true, если у операндов не совпадают минимальные и/или максимальные точки. В противном случае возвращает false.
 Описание
 Оператор неравенства класса Extents3d.
 Ссылки
 Teigha.DatabaseServices.Extents3d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!