Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Spline.WeightAt
 Послать отзыв
 Метод позволяет получить значение веса по указанному индексу.
 Синтаксис
C#
Visual Basic
Копировать Код
public double WeightAt( int index );
Копировать Код
Public Function WeightAt( index As Integer ) As Double
 Параметры
 Параметры
 Описание
 index
 Входной индекс. Тип int.
 Возвращает
 Возвращает значение веса. Тип double.
 Описание
 Метод позволяет получить значение веса по указанному индексу.
 Ссылки
 Teigha.DatabaseServices.Spline, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!