Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Polyline.GetPoint2dAt
 Послать отзыв
 Синтаксис
C#
Visual Basic
public Point2d GetPoint2dAt(int index);
Public Function GetPoint2dAt(index As Integer) As Point2d
 Параметры
 Параметры
 Описание
 index
 Индекс (отсчитываемый от 0) вершины
 Описание
 Этот метод возвращает 2D расположение вершины полилинии, заданной параметром index, в собственной координатной системе (OCS).
 Ссылки
 Teigha.DatabaseServices.Polyline, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!