Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Viewport.CircleSides
 Послать отзыв
 Свойство CircleSides представляет процент масштабирования окружностей в данном видовом экране в диапазоне [1..20000]. Это значение используется при тесселяции кривых. Чем оно выше, тем больше линейных сегментов используется при тесселяции кривой.
 Синтаксис
C#
Visual Basic
Копировать Код
public int CircleSides;
Копировать Код
Public Property CircleSides As Integer
 Возвращает
 Возвращает процент масштабирования окружностей в диапазоне [1..20000]. Тип int.
 Описание
 Свойство CircleSides представляет процент масштабирования окружностей в данном видовом экране. Эта величина влияет на количество сегментов при тесселяции кривых для отображения на экране и находится в диапазоне [1..20000]. Чем значение выше, тем больше линейных сегментов используется при тесселяции кривой.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Viewport, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!