Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DbDictionaryEnumerator.Key
 Послать отзыв
 Свойство возвращает значение ключа текущей записи перечислителя.
 Синтаксис
C#
Visual Basic
Копировать Код
public String Key;
Копировать Код
Public Property Key() As String
 Возвращает
 Возвращает ключ записи. Тип String.
 Описание
 Свойство обеспечивает доступ к значению ключа текущей записи перечислителя.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.DbDictionaryEnumerator, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!