Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve2dCollection.Item
 Послать отзыв
 Свойство Item представляет элемент коллекции с указанным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public Curve2d this[int index];
Копировать Код
Default Public Property Item( Param As Integer ) As Curve2d
 Параметры
 Параметры
 Описание
 index
 Входной индекс элемента коллекции. Тип int.
 Возвращает
 Возвращает элемент коллекции с указанным индексом. Тип Curve2d.
 Описание
 Свойство Item представляет элемент коллекции с указанным индексом.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.Geometry.Curve2dCollection, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!