Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ExtrudedSurface.SweepEntity
 Послать отзыв
 Свойство SweepEntity обеспечивает доступ к геометрическому объекту, который был использован для создания выдавленной поверхности.
 Синтаксис
C#
Visual Basic
Копировать Код
public Entity SweepEntity;
Копировать Код
Public ReadOnly Property SweepEntity As Entity
 Возвращает
 Возвращает объект чертежа. Тип Entity.
 Описание
 Свойство SweepEntity обеспечивает доступ к геометрическому объекту Entity, который был использован для создания выдавленной поверхности.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.ExtrudedSurface, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!