Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SectionSettings.SetVisibility
 Послать отзыв
 Метод позволяет управлять видимостью создаваемой геометрии указанного типа.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetVisibility( SectionType nSecType, SectionGeometry nGeometry, bool bVisible );
Копировать Код
Public Sub SetVisibility( nSecType As SectionType, nGeometry As SectionGeometry, bVisible As Boolean )
 Параметры
 Параметры
 Описание
 nSecType
 Тип сечения. Перечисление SectionType.
 nGeometry
 Типы элементов геометрии сечения. Перечисление SectionGeometry.
 bVisible
 Флаг видимости геометрии. Тип bool. Передать в метод значение true, если геометрия должна отображаться, в противном случае передать значение false.
 Описание
 Метод позволяет управлять видимостью создаваемой геометрии указанного типа.
 Ссылки
 Teigha.DatabaseServices.SectionSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!