Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Solid3dMassProperties.PrincipalAxes
 Послать отзыв
 Свойство PrincipalAxes представляет главную ось твердого тела по ее индексу.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d this[int index];
Копировать Код
Default Public ReadOnly Property PrincipalAxes(index As Integer) As Vector3d
 Возвращает
 Возвращает главную ось тела по ее индексу. Тип Vector3d.
 Описание
 Свойство PrincipalAxes представляет главную ось твердого тела по ее индексу.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Solid3dMassProperties, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!