Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Hatch.GetHatchLineDataAt
 Послать отзыв
 Синтаксис
C#
Visual Basic
public Line2d GetHatchLineDataAt(int index);
Public Function GetHatchLineDataAt(index As Integer) As Line2d
 Параметры
 Параметры
 Описание
 index
 Номер линии объекта заливки, которая должна быть возвращена
 Описание
 Метод возвращает линию данных заливки из объекта заливки.
 Ссылки
 Teigha.DatabaseServices.Hatch, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!