Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbSurface.IsRationalInU
 Послать отзыв
 Свойство IsRationalInU позволяет проверить, является ли данная поверхность рациональной в направлении U.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsRationalInU;
Копировать Код
Public ReadOnly Property IsRationalInU As Boolean
 Возвращает
 Возвращает true, если поверхность является рациональной в направлении U. В противном случае возвращает false.
 Описание
 Свойство IsRationalInU позволяет проверить, является ли данная поверхность рациональной в направлении U.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.NurbSurface, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!