Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 BlockTableRecord.BlockEndId
 Послать отзыв
 Свойство предназначено для хранения BlockEndId.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectId BlockEndId { get; }
Копировать Код
Public Property BlockEndId As ObjectId
 Возвращает
 Возвращает ObjectId объекта BlockEnd текущей записи таблицы блоков (BlockTableRecord).
 Описание
 В свойстве хранится ObjectId объекта BlockEnd.
 Объект BlockEnd создается автоматически при создании блока и существует в чертеже для совместимости.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.BlockTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!