Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Database.Insert (String^, Database^, bool)
 Послать отзыв
 Синтаксис
C#
Visual Basic
public ObjectId Insert(ref String blockName, ref Database dataBase, bool preserveSourceDatabase);
Public Function Insert(ByRef blockName As String, ByRef dataBase As Database, preserveSourceDatabase As bool) As ObjectId
 Параметры
 Параметры
 Описание
 blockName
 Имя, используемое для новой записи таблицы блоков, созданной данным методом
 dataBase
 База данных источника
 preserveSourceDatabase
 Признак, определяющий, будет ли база данных источника сохранена независимой
 Описание
 Эта функция имитирует команду INSERT nanoCAD. Сначала при выполнении метода создается новая запись в таблице блоков. Этой записи присваивается имя, указанное в blockName. Затем, все геометрические объекты пространства модели, указанные в dataBase, копируются в новую запись таблицы блоков.
 Аргумент preserveSourceDatabase определяет, должна ли исходная база данных быть сохранена независимой от базы данных назначения или нет. Значение этого параметра по умолчанию — true. В этом случае объекты из базы данных источника копируются в базу данных назначения и база данных источника не меняется. Если параметр preserveSourceDatabase равен false, то объекты из базы данных источника не переписываются в базу данных назначения. В этом случае метод исполняется быстрее, но это делает базу данных источника зависимой от базы данных назначения. При таком вызове необходимо быть уверенным, что база данных источника будет удалена сразу же после или, как минимум, перед удалением базы данных назначения.
 Возвращает Id объекта для новой записи таблицы блоков, созданной этой функцией.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!