Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotSettingsValidator.RefreshLists
 Послать отзыв
 Метод обновляет в указанном объекте PlotSettings списки устройств печати, коллекцию доступных бумажных носителей и таблицы стилей печати.
 Синтаксис
C#
Visual Basic
Копировать Код
public void RefreshLists( ref PlotSettings plotSet );
Копировать Код
Public Sub RefreshLists( ByRef plotSet As PlotSettings )
 Параметры
 Параметры
 Описание
 plotSet
 Входной объект PlotSettings с настройками печати.
 Описание
 Метод обновляет в указанном объекте PlotSettings списки устройств печати, коллекцию доступных бумажных носителей и таблицы стилей печати.
 Такое обновление необходимо выполнять, если в течение сеанса nanoCAD изменились какие-либо устройства печати, файлы PC3 или таблицы стилей печати.
 Ссылки
 Teigha.DatabaseServices.PlotSettingsValidator, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!