Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Field.SetFieldCode
 Послать отзыв
 Метод позволяет установить для этого объекта указанный код поля.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetFieldCode( ref String fieldCode );
Копировать Код
Public Sub SetFieldCode( ByRef fieldCode As String )
 Параметры
 Параметры
 Описание
 fieldCode
 Код поля, который требуется задать. Тип String.
 Описание
 Метод позволяет установить для этого объекта указанный код поля fieldCode.
 Замечания
 Если это поле связано с объектом базы данных (DBObject), объект DBObject следует закрыть перед вызовом этого метода, чтобы гарантировать корректное обновление данных поля.
 Ссылки
 Teigha.DatabaseServices.Field, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!