Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MInsertBlock.MInsertBlock
 Послать отзыв
 Конструктор класса MInsertBlock.
 Синтаксис
C#
Visual Basic
Копировать Код
public MInsertBlock( Point3d position, DatabaseServices.ObjectId blockTableRecord, short columns, short rows, double colSpacing, double rowSpacing );
Копировать Код
Public Sub New( position As Point3d, blockTableRecord As DatabaseServices.ObjectId, columns As short, rows As short, colSpacing As Double, rowSpacing As Double )
 Параметры
 Параметры
 Описание
 position
 Положение данного объекта MInsertBlock. Тип Point3d.
 blockTableRecord
 Запись в таблице блоков. Тип DatabaseServices.ObjectId.
 columns
 Количество столбцов изображения BlockTableRecord, отображаемых данным объектом MInsertBlock. Тип short.
 rows
 Количество строк изображения BlockTableRecord, отображаемых данным объектом MInsertBlock. Тип short.
 colSpacing
 Расстояние между столбцами изображения BlockTableRecord, отображаемых данным объектом MInsertBlock. Тип double.
 rowSpacing
 Расстояние между строками изображения BlockTableRecord, отображаемых данным объектом MInsertBlock. Тип double.
 Описание
 Конструктор класса MInsertBlock.
 Ссылки
 Teigha.DatabaseServices.MInsertBlock, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!