Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SecurityParameters
 Послать отзыв
 Класс SecurityParameters представляет параметры безопасности, используемые базой данных.
 Иерархия классов
Teigha::DatabaseServices::SecurityParameters
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("SecurityParams")] public sealed class SecurityParameters
Копировать Код
<Wrapper("SecurityParams")> Public NotInheritable Class SecurityParameters
 Описание
 Класс SecurityParameters представляет параметры безопасности, используемые базой данных.
 Методы
 Конструкторы
 Имя
 Описание
 SecurityParameters
 Это обзор перегрузок SecurityParameters.
 Топики
 Имя
 Описание
 SecurityParameters Методы
 Ниже перечислены методы класса SecurityParameters.
 SecurityParameters Операторы
 Ниже перечислены операторы класса SecurityParameters.
 SecurityParameters Свойства
 Ниже перечислены свойства класса SecurityParameters.
 Ссылки
 SecurityParameters Конструктор, SecurityParameters Методы, SecurityParameters Операторы, SecurityParameters Свойства, Методы, Топики, SecurityParameters Методы, SecurityParameters Операторы, SecurityParameters Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!