Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector2d.GetAngleTo
 Послать отзыв
 Метод вычисляет угол в интервале [0, Pi] между данным вектором и входным вектором.
 Синтаксис
C#
Visual Basic
Копировать Код
public double GetAngleTo( Vector2d vector );
Копировать Код
Public Function GetAngleTo( vector As Vector2d ) As Double
 Параметры
 Параметры
 Описание
 vector
 Входной двумерный вектор. Тип Vector2d.
 Возвращает
 Возвращает угол в радианах между двумя двумерными векторами в интервале [0, Pi]. Тип double.
 Описание
 Метод вычисляет угол в интервале [0, Pi] между данным вектором и входным вектором vector.
 Ссылки
 Teigha.Geometry.Vector2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!