Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Database.SaveAs (String^, DatabaseServices::SecurityParameters^)
 Послать отзыв
 Синтаксис
C#
Visual Basic
public void SaveAs(ref String fileName, ref DatabaseServices::SecurityParameters security);
Public Sub SaveAs(ByRef fileName As String, ByRef security As DatabaseServices.SecurityParameters)
 Параметры
 Параметры
 Описание
 fileName
 Имя файла или URL, куда записываются данные базы данных
 security
 Структура типа SecurityParameters
 Описание
 Запускает процесс сохранения в базе данных и записывает информацию чертежа в файл, определенный параметром fileName.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!