Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PolyFaceMesh.PolyFaceMesh
 Послать отзыв
 Конструктор по умолчанию. Инициализирует счетчики граней и вершин нулями.
 Синтаксис
C#
Visual Basic
Копировать Код
public PolyFaceMesh();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию. Инициализирует счетчики граней и вершин нулями.
 Ссылки
 Teigha.DatabaseServices.PolyFaceMesh, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!