Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObject.GetPersistentReactorIds()
 Послать отзыв
 Метод предназначен для получения коллекции идентификаторов постоянных реакторов данного объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectIdCollection GetPersistentReactorIds();
Копировать Код
Public Function GetPersistentReactorIds() As ObjectIdCollection
 Возвращает
 Возвращает идентификаторы постоянных реакторов этого объекта. Тип ObjectIdCollection
 Описание
 Метод предоставляет коллекцию идентификаторов постоянных реакторов данного объекта.
 Ссылки
 Teigha.DatabaseServices.DBObject, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!