Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MentalRayRenderSettings.SamplingFilter
 Послать отзыв
 Свойство SamplingFilter представляет параметры фильтрации для слияния нескольких выборочных значений в общий цвет пикселя.
 Синтаксис
C#
Visual Basic
Копировать Код
public MentalRayRenderSettingsTraitsSamplingParameter SamplingFilter;
Копировать Код
Public Property SamplingFilter As MentalRayRenderSettingsTraitsSamplingParameter
 Возвращает
 Возвращает параметры фильтрации. Тип MentalRayRenderSettingsTraitsSamplingParameter.
 Описание
 Свойство SamplingFilter представляет параметры фильтрации для слияния нескольких выборочных значений в общий цвет пикселя.
 Параметр MentalRayRenderSettingsTraitsSamplingParameter хранит следующие данные:
Метод фильтрации для слияния нескольких выборочных значений в общий цвет пикселя;
Ширина области фильтра для группы соседних пикселей в диапазоне [0..8];
Высота области фильтра для группы соседних пикселей в диапазоне [0..8].
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MentalRayRenderSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!