Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SectionSubItem
 Послать отзыв
 Данное перечисление определяет флаги попадания точки на индикатор секущей плоскости, которые возвращает метод Section.HitTest().
 Синтаксис
C#
Visual Basic
Копировать Код
public enum SectionSubItem { SectionSubItemNone = 0, SectionLine = 1, SectionLineTop = 2, SectionLineBottom = 4, BackLine = 8, BackLineTop = 16, BackLineBottom = 32, VerticalLineTop = 64, VerticalLineBottom = 128 }
Копировать Код
Public Enum SectionSubItem SectionSubItemNone = 0 SectionLine = 1 SectionLineTop = 2 SectionLineBottom = 4 BackLine = 8 BackLineTop = 16 BackLineBottom = 32 VerticalLineTop = 64 VerticalLineBottom = 128 End Enum
 Члены
 Члены
 Описание
 SectionSubItemNone
 Значение: 0. Проверяемая на попадание точка не попала ни на один из элементов индикатора секущей плоскости.
 SectionLine
 Значение: 1. Проверяемая на попадание точка находится на линии сечения.
 SectionLineTop
 Значение: 2. Проверяемая на попадание точка находится на верхней линии индикатора секущей плоскости.
 SectionLineBottom
 Значение: 4. Проверяемая на попадание точка находится на нижней линии индикатора секущей плоскости.
 BackLine
 Значение: 8. Проверяемая на попадание точка находится на одной из задних линий на уровне линии сечения.
 BackLineTop
 Значение: 16 = 0x10. Проверяемая на попадание точка находится на одной из задних линий на уровне верхней линии.
 BackLineBottom
 Значение: 32 = 0x20. Проверяемая на попадание точка находится на одной из задних линий на уровне нижней линии.
 VerticalLineTop
 Значение: 64 = 0x40. Проверяемая на попадание точка находится на одной из вертикальных линий в верхней половине индикатора секущей плоскости.
 VerticalLineBottom
 Значение: 128 = 0x80. Проверяемая на попадание точка находится на одной из вертикальных линий в нижней половине индикатора секущей плоскости.
 Описание
 Данное перечисление определяет флаги попадания точки на индикатор секущей плоскости. Значения из этого перечисления возвращает метод Section.HitTest().
 Ваши комментарии по поводу этого топика: Послать отзыв!