Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DwgFiler.WriteHardOwnershipId
 Послать отзыв
 Метод предназначен для записи заданного идентификатора жесткой ссылки владения объектом (HardOwnershipId) в этот объект Filer.
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract void WriteHardOwnershipId( ObjectId value );
Копировать Код
Public MustOverride Sub WriteHardOwnershipId( value As ObjectId )
 Параметры
 Параметры
 Описание
 value
 Записываемый в Filer идентификатор жесткой ссылки владения объектом. Тип ObjectId.
 Описание
 Метод предназначен для записи заданного идентификатора жесткой ссылки владения объектом (HardOwnershipId) в этот объект Filer.
 Ссылки
 Teigha.DatabaseServices.DwgFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!