Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocEvaluationCallback.EndActionEvaluationUsingObject
 Послать отзыв
 Метод реализует уведомление о том, что действие завершило операции чтения и/или записи над указанным объектом.
 Синтаксис
C#
Visual Basic
Копировать Код
public void EndActionEvaluationUsingObject( ref AssocAction action, ObjectId objectId, ref DBObject obj );
Копировать Код
Public Sub EndActionEvaluationUsingObject( ByRef action As AssocAction, objectId As ObjectId, ByRef obj As DBObject )
 Параметры
 Параметры
 Описание
 action
 Вычисляемое действие. Тип AssocAction.
 objectId
 Тот же самый объект, который ранее был передан в метод BeginActionEvaluationUsingObject(). Тип ObjectId.
 obj
 Объект, над которым выполняются операции чтения или записи. Тип DBObject.
 Описание
 Метод реализует уведомление о том, что действие завершило операции чтения и/или записи над объектом, представленным аргументом obj.
 Ссылки
 Teigha.DatabaseServices.AssocEvaluationCallback, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!