Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 ViewTableRecord.LiveSection
 Послать отзыв
 Свойство предназначено для управления отображением псевдоразреза, применяемого в именованном виде.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectId LiveSection { get; set; }
Копировать Код
Public Property LiveSection As ObjectId
 Возвращает
 Возвращает тип данных ObjectId.
 Описание
 Свойство предназначено для управления отображением псевдоразреза, применяемого в именованном виде. Доступно только для именованных видов пространства модели. Псевдоразрез – секущая плоскость. Трехмерные тела, через которую проходит эта плоскость, получат разрез, который можно только просматривать.
 Условия
 Чтение и запись.
 Ссылки
 ViewTableRecord Класс, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!