Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Group.Has
 Послать отзыв
 Метод позволяет проверить, имеется ли в данной группе указанный объект.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool Has( ref Entity entity );
Копировать Код
Public Function Has( ByRef entity As Entity ) As Boolean
 Параметры
 Параметры
 Описание
 entity
 Искомый объект чертежа. Тип Entity.
 Возвращает
 Возвращает true, если указанный объект entity входит в данную группу. В противном случае возвращает false.
 Описание
 Метод позволяет проверить, входит ли в данную группу указанный объект.
 Ссылки
 Teigha.DatabaseServices.Group, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!