Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор Polyline.Polyline ()
 Послать отзыв
 Синтаксис
C#
Visual Basic
public Polyline(); public Polyline(IntPtr unmanagedObjPtr, bool autoDelete);
Public Sub New() Public Sub New(unmanagedObjPtr As IntPtr, autoDelete As bool)
 Описание
 Конструктор по умолчанию.
 Ссылки
 Teigha.DatabaseServices.Polyline, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!