Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotStyleDescriptor.ToString
 Послать отзыв
 Этот класс формирует эквивалентное строковое представление данного объекта в формате, зависящем от языка и региональных настроек, которые определяет указанный провайдер.
 Синтаксис
C#
Visual Basic
Копировать Код
public String ToString( ref IFormatProvider provider );
Копировать Код
Public Function ToString( ByRef provider As IFormatProvider ) As String
 Параметры
 Параметры
 Описание
 provider
 провайдер языковых и региональных настроек. Тип IFormatProvider.
 Возвращает
 Возвращает строку String.
 Описание
 Этот класс формирует эквивалентное строковое представление данного объекта в формате, зависящем от языка и региональных настроек, которые определяет указанный провайдер.
 Ссылки
 Teigha.DatabaseServices.PlotStyleDescriptor, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!