Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Point2dCollection.DefaultSize
 Послать отзыв
 Поле DefaultSize представляет ёмкость по умолчанию новой коллекции Point2dCollection, создаваемой конструктором по умолчанию.
 Синтаксис
C#
Visual Basic
Копировать Код
public const int DefaultSize = 10;
Копировать Код
Public Const DefaultSize As Integer = 10
 Возвращает
 Возвращает ёмкость по умолчанию для новой коллекции. Тип int.
 Описание
 Поле DefaultSize представляет ёмкость по умолчанию новой коллекции Point2dCollection, создаваемой конструктором по умолчанию.
 Ссылки
 Teigha.Geometry.Point2dCollection, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!