Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LoftOptions.NormalOption
 Послать отзыв
 Свойство возвращает настройку для нормали к плоскости в данном объекте.
 Синтаксис
C#
Visual Basic
Копировать Код
public LoftOptionsNormalOption NormalOption;
Копировать Код
Public ReadOnly Property NormalOption As LoftOptionsNormalOption
 Возвращает
 Возвращает значение из перечисления LoftOptionsNormalOption.
 Описание
 Свойство возвращает настройку для нормали к плоскости в данном объекте из перечисления LoftOptionsNormalOption. Значение по умолчанию — NoNormal.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.LoftOptions, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!