Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DimStyleTableRecord
 Послать отзыв
 Класс предназначен для хранения определения размерного стиля.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::GraphicsInterface::Drawable Teigha::DatabaseServices::DBObject Teigha::DatabaseServices::SymbolTableRecord Teigha::DatabaseServices::DimStyleTableRecord
 Синтаксис
C#
Visual Basic
[Wrapper("AcDbDimStyleTableRecord")] public class DimStyleTableRecord : SymbolTableRecord;
<Wrapper("AcDbDimStyleTableRecord")> Public Class DimStyleTableRecord Inherits SymbolTableRecord
 Описание
 Класс предназначен для хранения определения размерного стиля.
 Определение размерного стиля представляет из себя набор данных о том, как должна выглядеть размерная линия и текст, относящийся к ней. Размерные стили часто используются, как вариации одного и того же стиля для различных видов размеров: угловых, линейных и т.д.
 На рисунке приведено окно редактирования размерного стиля, которое вызывается из окна размерных стилей кнопкой «Редактировать..».
 Все настройки, которые есть в этом окне также доступны и через API в виде свойств класса DimStyleTableRecord. Также все настройки размерных стилей доступны через системные переменные, которые тоже можно изменять через .NET API. При изменении системных переменных, которые являются настройками размерных стилей, создаются новые размерные стили на основе текущих с новыми значениями настроек размерных стилей, которые были изменены через системные переменные.
 Для создания нового размерного стиля необходимо указывать размерный стиль, на котором будет основан новый. Также для размерного стиля можно создать подстиль определенного элемента оформления, например подстиль для выносок. Чтобы создать такой подстиль, нужно создать копию стиля, на котором будет основан подстиль и в названии этого подстиля (свойство DimStyleTableRecord.Name) добавить специальные символы, приведенные в таблице:
 Специальные символы
 Значение
 Пример
 «$0»
 Линейный
 «СПДС$0»
 «$2»
 Угловой
 «СПДС$2»
 «$3»
 Диаметральный
 «СПДС$3»
 «$4»
 Радиус
 «СПДС$4»
 «$6»
 Ординатный
 «СПДС$6»
 «$7»
 Выноска
 «СПДС$7»
 Пример
 В качестве примера работы с классом DimStyleTableRecord приведена команда "AddNewDimStyle", которая добавляет в dwg-документ новый размерный стиль.
C#
 Копировать Код
public partial class Commands { [Teigha.Runtime.CommandMethod("AddNewDimStyle")] public void AddDimStyle() { // Получение ссылки на активный документ HostMgd.ApplicationServices.Document doc = HostMgd.ApplicationServices.Application.DocumentManager.MdiActiveDocument; // Получение ссылки на редактор докумена HostMgd.EditorInput.Editor ed = doc.Editor; // Получение ссылки на базу данных документа Teigha.DatabaseServices.Database db = doc.Database; // Начало транзакции с базой данных документа using (Teigha.DatabaseServices.Transaction trans = db.TransactionManager.StartTransaction()) { // Открываем таблицу блоков для чтения Teigha.DatabaseServices.DimStyleTable dimStyleTable = trans.GetObject(db.DimStyleTableId, Teigha.DatabaseServices.OpenMode.ForWrite) as Teigha.DatabaseServices.DimStyleTable; // Создаем новый размерный стиль Teigha.DatabaseServices.DimStyleTableRecord newDimStyle = new Teigha.DatabaseServices.DimStyleTableRecord(); // Находим в таблице размерных стилей ObjectId стиля Standard // для того, чтобы скопировать его настройки в наш новый размерный стиль Teigha.DatabaseServices.ObjectId styleId = dimStyleTable["Standard"]; // Находим стиль Standard в базе данных чертежа по его ObjectId и открываем для чтения Teigha.DatabaseServices.DimStyleTableRecord standardDimStyle = trans.GetObject(styleId, Teigha.DatabaseServices.OpenMode.ForRead) as Teigha.DatabaseServices.DimStyleTableRecord; // Копируем настройки стиля Standard в наш новый стиль newDimStyle.CopyFrom(standardDimStyle); // При этом скопируется и значение свойства Name // исправляем имя нового стиля, чтобы не было конфликта newDimStyle.Name = "newDimStyle"; // При использовании подстилей нужно в название (свойство DimStyleTableRecord.Name) // добавить специальные символы из таблицы // Например: // Teigha.DatabaseServices.DimStyleTableRecord newSubDimStyle1 =  // new Teigha.DatabaseServices.DimStyleTableRecord(); // newSubDimStyle1.CopyFrom(newDimStyle); // newSubDimStyle1.Name = newDimStyle.Name + @"$2"; // dimStyleTable.Add(newSubDimStyle1); // Добавляем новый размерный стиль в таблицу размерных стилей dimStyleTable.Add(newDimStyle); // Перебираем таблицу блоков в цикле foreach (Teigha.DatabaseServices.ObjectId dstr in dimStyleTable) { // Открываем каждую запись таблицы Teigha.DatabaseServices.DimStyleTableRecord obj = trans.GetObject(dstr, Teigha.DatabaseServices.OpenMode.ForRead) as Teigha.DatabaseServices.DimStyleTableRecord; // Выводим в командную строку nanoCAD имя каждого размерного стиля ed.WriteMessage($"DimStyle {obj.Name}"); } trans.Commit(); } } }
 На рисунке ниже приведен результат работы команды AddNewDimStyle в новом пустом документе. В командной строке отобразятся только размерные стили, которые есть в шаблоне dwg-документа и новый стиль "newDimStyle", созданный командой.
 Методы
 Конструкторы
 Teigha.GraphicsInterface.Drawable
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 Drawable
 Конструктор класса Teigha.GraphicsInterface.Drawable. (Унаследован от Drawable)
 Teigha.DatabaseServices.DBObject
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 DBObject
 Конструктор. (Унаследован от DBObject)
 Teigha.DatabaseServices.SymbolTableRecord
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 SymbolTableRecord
 This is SymbolTableRecord, a member of class SymbolTableRecord. (Унаследован от SymbolTableRecord)
 Teigha.DatabaseServices.DimStyleTableRecord
 Имя
 Описание
 DimStyleTableRecord
 Это обзор перегрузок DimStyleTableRecord.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.GraphicsInterface.Drawable
 Имя
 Описание
 Drawable Методы
 Ниже перечислены методы класса Drawable.
 Drawable Свойства
 Ниже перечислены свойства класса Drawable.
 Teigha.DatabaseServices.DBObject
 Имя
 Описание
 DBObject Методы
 Ниже перечислены методы класса DBObject.
 DBObject Свойства
 Ниже перечислены свойства класса DBObject.
 DBObject События
 Ниже перечислены события класса DBObject.
 Teigha.DatabaseServices.SymbolTableRecord
 Имя
 Описание
 SymbolTableRecord Свойства
 Ниже перечислены свойства класса SymbolTableRecord.
 Teigha.DatabaseServices.DimStyleTableRecord
 Имя
 Описание
 DimStyleTableRecord Методы
 Ниже перечислены методы класса DimStyleTableRecord.
 DimStyleTableRecord Свойства
 Ниже перечислены свойства класса DimStyleTableRecord.
 Ссылки
 DimStyleTableRecord Конструктор, DimStyleTableRecord Методы, DimStyleTableRecord Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства, DBObject События
 Ваши комментарии по поводу этого топика: Послать отзыв!