Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.RenderEnvironment.FogEnabled
 Послать отзыв
 Свойство FogEnabled управляет включением и выключением влияния тумана.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool FogEnabled;
Копировать Код
Public Property FogEnabled As Boolean
 Возвращает
 Возвращает true, если влияние тумана учитывается. В противном случае возвращает false.
 Описание
 Свойство FogEnabled управляет включением и выключением влияния тумана.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.RenderEnvironment, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!