Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbCurve3d.FitTolerance
 Послать отзыв
 Свойство FitTolerance представляет точность интерполяции для данного сплайна.
 Синтаксис
C#
Visual Basic
Копировать Код
public Tolerance FitTolerance;
Копировать Код
Public Property FitTolerance As Tolerance
 Возвращает
 Возвращает текущее значение геометрической точности интерполяции для данного сплайна. Тип Tolerance.
 Описание
 Свойство FitTolerance представляет точность интерполяции для данного сплайна.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.Geometry.NurbCurve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!