Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.SetGridProperty
 Послать отзыв
 Метод позволяет задать свойства линий сетки для ячеек, строк или столбцов в диапазоне ячеек.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetGridProperty( ref CellRange rangeIn, GridLineType gridLineTypes, GridPropertyParameter gridProp );
Копировать Код
Public virtual Sub SetGridProperty( ByRef rangeIn As CellRange, gridLineTypes As GridLineType, gridProp As GridPropertyParameter )
 Параметры
 Параметры
 Описание
 rangeIn
 Входной диапазон ячеек, диапазон строк или диапазон столбцов таблицы. Тип CellRange.
 gridLineTypes
 Типы линий сетки из перечисления GridLineType. Допускаются комбинации этих типов с использованием оператора OR.
 gridProp
 Свойства линий сетки, которые требуется задать. Тип GridPropertyParameter.
 Описание
 Метод позволяет задать свойства линий сетки для ячеек, строк или столбцов в диапазоне ячеек. Диапазон может быть диапазоном ячеек, диапазоном строк или диапазоном столбцов.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!