Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Matrix2d.AlignCoordinateSystem
 Послать отзыв
 Метод предоставляет матрицу, которая преобразует одну систему координат в другую. Каждая из систем координат указывается точкой начала и двумя осями.
 Синтаксис
C#
Visual Basic
Копировать Код
public static Matrix2d AlignCoordinateSystem( Point2d fromOrigin, Vector2d fromE0, Vector2d fromE1, Point2d toOrigin, Vector2d toE0, Vector2d toE1 );
Копировать Код
Public Shared Function AlignCoordinateSystem( fromOrigin As Point2d, fromE0 As Vector2d, fromE1 As Vector2d, toOrigin As Point2d, toE0 As Vector2d, toE1 As Vector2d ) As Matrix2d
 Параметры
 Параметры
 Описание
 fromOrigin
 Точка начала исходной системы координат. Тип Point2d.
 fromE0
 Ось X исходной системы координат. Тип Vector2d.
 fromE1
 Ось Y исходной системы координат. Тип Vector2d.
 toOrigin
 Точка начала целевой системы координат. Тип Point2d.
 toE0
 Ось X целевой системы координат. Тип Vector2d.
 toE1
 Ось Y целевой системы координат. Тип Vector2d.
 Возвращает
 Возвращает матрицу геометрического преобразования. Тип Matrix2d.
 Описание
 Метод предоставляет матрицу, которая преобразует систему координат с началом fromOrigin и осями fromE0 и fromE1 в систему координат с началом toOrigin и осями toE0 и toE1.
 Ссылки
 Teigha.Geometry.Matrix2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!