Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 ViewTableRecord.LayerState
 Послать отзыв
 В свойстве хранится название снимка слоёв именованного вида.
 Синтаксис
C#
Visual Basic
public String LayerState;
Public Property LayerState() As String
 Возвращает
 Возвращает тип данных string.
 Описание
 Снимок слоёв именованного вида – это набор настроек слоёв, установленных для именованного вида. Снимок слоёв можно сделать только в именованном виде, который уже сохранен в базе данных чертежа. Во время создания именованного вида снимок слоёв не делается. Для создания снимка слоёв нужно выбрать именованный вид и сохранить в нём снимок cлоёв. В именованном виде может храниться только один снимок слоёв. Если нужно внести изменения в снимок слоёв именованного вида, то нужно удалить старый снимок и добавить в именованный вид новый. При восстановлении именованного вида, в котором есть снимок слоёв, настройки слоёв документа изменяются в соответствии со снимком слоёв именованного вида.
 Условия
 Чтение и запись.
 Ссылки
 ViewTableRecord Класс, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!