Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector3d.Add
 Послать отзыв
 Метод реализует сложение данного вектора с заданным 3D-вектором.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d Add( Vector3d v );
Копировать Код
Public Function Add( v As Vector3d ) As Vector3d
 Параметры
 Параметры
 Описание
 v
 Входной вектор. Тип Vector3d.
 Возвращает
 Возвращает сумму двух трехмерных векторов как объект типа Vector3d.
 Описание
 Метод реализует сложение данного вектора с заданным 3D-вектором v.
 Ссылки
 Teigha.Geometry.Vector3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!