Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBDictionary.Contains
 Послать отзыв
 Возвращает true, если объект с указанным ключом присутствует в словаре.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool Contains( ref String entryName );
Копировать Код
Public Function Contains( ByRef entryName As String ) As Boolean
 Параметры
 Параметры
 Описание
 entryName
 Имя ключа для искомого объекта.
 Возвращает
 Возвращает true, если объект с указанным ObjectId присутствует в словаре, и false в противном случае.
 Описание
 Возвращает true, если объект с указанным ключом присутствует в словаре.
 Ссылки
 Teigha.DatabaseServices.DBDictionary, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!