Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FormattedTableData.GetGridVisibility
 Послать отзыв
 Метод позволяет определить видимость линий сетки в ячейке, строке или столбце.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual Visibility GetGridVisibility( int row, int column, GridLineType gridLinetype );
Копировать Код
Public Overridable Function GetGridVisibility( row As Integer, column As Integer, gridLinetype As GridLineType ) As Visibility
 Параметры
 Параметры
 Описание
 row
 Индекс строки. Тип int. Может принимать значение -1.
 column
 Индекс столбца. Тип int. Может принимать значение -1.
 gridLinetype
 Тип линий сетки из перечисления GridLineType. Комбинацию типов линий сетки можно задать с помощью логического оператора OR.
 Возвращает
 Возвращает видимость линий сетки как значение из перечисления Visibility.
 Описание
 Метод позволяет определить видимость линий сетки в ячейке, строке или столбце.
 Чтобы указать ячейку, следует передать действительные индексы строки и столбца. Чтобы указать строку, следует передать действительный индекс строки и -1 в качестве индекса столбца. Чтобы указать столбец, следует передать действительный индекс столбца и -1 в качестве индекса строки.
 Ссылки
 Teigha.DatabaseServices.FormattedTableData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!