Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbSurface.GetDefinition
 Послать отзыв
 Метод предоставляет определение данной NURBS поверхности.
 Синтаксис
C#
Visual Basic
Копировать Код
public NurbSurfaceDefinition GetDefinition();
Копировать Код
Public Function GetDefinition() As NurbSurfaceDefinition
 Возвращает
 Возвращает определение данной NURBS поверхности Тип NurbSurfaceDefinition.
 Описание
 Метод предоставляет определение данной NURBS поверхности.
 Определение поверхности NURBS содержит следующую информацию:
Степени сплайна в направлениях U и V;
Свойства сплайна в направлениях U и V;
Количество управляющих вершин в направлениях U и V;
Сами управляющие вершины;
Значения веса;
Узлы в направлениях U и V.
 Ссылки
 Teigha.Geometry.NurbSurface, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!