Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SubentityOverrule.GetCompoundObjectTransform
 Послать отзыв
 Данный метод переопределяет свойство Entity.CompoundObjectTransform и вызывает его при реализации по умолчанию.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual Matrix3d GetCompoundObjectTransform( ref Entity entity );
Копировать Код
Public virtual Function GetCompoundObjectTransform( ByRef entity As Entity ) As Matrix3d
 Параметры
 Параметры
 Описание
 entity
 Объект чертежа, тип Entity.
 Возвращает
 Возвращает матрицу преобразования, сформированную для вложенных подобъектов. Тип Matrix3d.
 Описание
 Данный метод переопределяет свойство Entity.CompoundObjectTransform и вызывает его при реализации по умолчанию.
 Свойство Entity.CompoundObjectTransform в реализации по умолчанию возвращает матрицу преобразования Matrix3d, сформированную для вложенных подобъектов. С помощью метода GetCompoundObjectTransform() настоящего класса можно переопределить механизм работы этого свойства.
 Ссылки
 Teigha.DatabaseServices.SubentityOverrule, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!