Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AnnotationScale.UniqueIdentifier
 Послать отзыв
 Свойство предоставляет доступ к уникальному идентификатору масштаба аннотаций.
 Синтаксис
C#
Visual Basic
Копировать Код
public IntPtr UniqueIdentifier;
Копировать Код
Public Property UniqueIdentifier() As IntPtr
 Возвращает
 Возвращает указатель на масштаб аннотаций. Тип IntPtr.
 Описание
 Свойство предоставляет доступ к уникальному идентификатору масштаба аннотаций.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.AnnotationScale, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!