Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector2d.Vector2d
 Послать отзыв
 Конструктор структуры Vector2d. Создает новый 2D-вектор с координатами из указанного массива.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector2d( ref double[] xy );
Копировать Код
Public Sub New( ByRef xy() As Double )
 Параметры
 Параметры
 Описание
 xy
 Массив координат создаваемого вектора. Тип double[]. Используются только первые два значения из переданного массива.
 Описание
 Конструктор структуры Vector2d. Создает новый 2D-вектор с координатами из первых двух элементов массива xy.
 Ссылки
 Teigha.Geometry.Vector2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!