Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Database.WorldPaperspaceUcsBaseOrigin
 Послать отзыв
 Синтаксис
C#
Visual Basic
public Point3d WorldPaperspaceUcsBaseOrigin(OrthographicView orthoView);
Public Function WorldPaperspaceUcsBaseOrigin(orthoView As OrthographicView) As Point3d
 Параметры
 Параметры
 Описание
 orthoView
 Вид, для которого определяется начальная точка системы координат
 Описание
 Метод возвращает начальную точку пользовательской системы координат пространства листа (в мировых координатах) для вида, определенного orthoView. orthoView должен быть одним из элементов перечисления OrthographicView.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!