Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GradientPatternType
 Послать отзыв
 Перечисление GradientPatternType определяет источники шаблонов градиента.
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdDbHatch.GradientPatternType")] public enum GradientPatternType { PreDefinedGradient = 0, UserDefinedGradient = 1 }
Копировать Код
<Wrapper("OdDbHatch.GradientPatternType")> Public Enum GradientPatternType PreDefinedGradient = 0 UserDefinedGradient = 1 End Enum
 Члены
 Члены
 Описание
 PreDefinedGradient
 Значение: 0. Градиент определяется одним из предопределенных шаблонов градиента.
 UserDefinedGradient
 Значение: 1. Градиент определяется одним из пользовательских шаблонов градиента.
 Описание
 Перечисление GradientPatternType определяет источники шаблонов градиента (предопределенный или пользовательский).
 Ваши комментарии по поводу этого топика: Послать отзыв!