Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CurveCurveIntersector3d.Create
 Послать отзыв
 Метод предназначен для создания объекта на основе переданного указателя.
 Синтаксис
C#
Visual Basic
Копировать Код
public static CurveCurveIntersector3d Create( IntPtr unmanagedPointer, bool autoDelete );
Копировать Код
Public Shared Function Create( unmanagedPointer As IntPtr, autoDelete As Boolean ) As CurveCurveIntersector3d
 Параметры
 Параметры
 Описание
 unmanagedPointer
 Входной неуправляемый указатель на исходный объект. Тип IntPtr.
 autoDelete
 Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.
 Возвращает
 Возвращает созданный объект. Тип CurveCurveIntersector3d.
 Описание
 Метод создает объект на основе переданного указателя и возвращает полученный объект.
 Ссылки
 Teigha.Geometry.CurveCurveIntersector3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!