Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Dimlunit
 Послать отзыв
 Синтаксис
C#
Visual Basic
public int Dimlunit;
Public Property Dimlunit() As Integer
 Описание
 Возвращает или устанавливает текущее значение DIMLUNIT для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!