Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbCurve3dFitData
 Послать отзыв
 Класс NurbCurve3dFitData представляет данные, возвращаемые свойством Teigha.Geometry.NurbCurve3d.FitData.
 Синтаксис
C#
Visual Basic
Копировать Код
[StructLayout(LayoutKind.Sequential)] public struct NurbCurve3dFitData { }
Копировать Код
<StructLayout(LayoutKind.Sequential)> Public Structure NurbCurve3dFitData End Structure
 Описание
 Класс NurbCurve3dFitData представляет данные, возвращаемые свойством Teigha.Geometry.NurbCurve3d.FitData.
 Топики
 Имя
 Описание
 NurbCurve3dFitData Методы
 Ниже перечислены методы класса NurbCurve3dFitData.
 NurbCurve3dFitData Операторы
 Ниже перечислены операторы класса NurbCurve3dFitData.
 NurbCurve3dFitData Свойства
 Ниже перечислены свойства класса NurbCurve3dFitData.
 Ссылки
 NurbCurve3dFitData Методы, NurbCurve3dFitData Операторы, NurbCurve3dFitData Свойства, Топики, NurbCurve3dFitData Методы, NurbCurve3dFitData Операторы, NurbCurve3dFitData Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!