Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MText.UnderlineOn
 Послать отзыв
 Свойство возвращает строку перехода к подчеркнутому тексту "L".
 Синтаксис
C#
Visual Basic
Копировать Код
public static String UnderlineOn;
Копировать Код
Public Shared ReadOnly Property UnderlineOn As String
 Возвращает
 Возвращает строку перехода к подчеркнутому тексту. Тип String.
 Описание
 Свойство возвращает строку перехода к подчеркнутому тексту "L". Может использоваться вместо строковой константы "L", чтобы сделать код более понятным. При использовании в строке, возвращаемой свойством MText.Contents, "L" означает переход к подчеркнутому тексту.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.MText, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!