Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LinkedTableData.GetEnumerator
 Послать отзыв
 Метод позволяет получить перечислитель для данной таблицы, преднастроенный с учетом указанных опций.
 Синтаксис
C#
Visual Basic
Копировать Код
public TableEnumerator GetEnumerator( TableEnumeratorOption option );
Копировать Код
Public Function GetEnumerator( [option] As TableEnumeratorOption ) As TableEnumerator
 Параметры
 Параметры
 Описание
 option
 Опции перечислителя таблицы. Перечисление TableEnumeratorOption.
 Возвращает
 Возвращает перечислитель для таблицы. Тип TableEnumerator.
 Описание
 Метод позволяет получить перечислитель для данной таблицы, преднастроенный с учетом указанных опций.
 Ссылки
 Teigha.DatabaseServices.LinkedTableData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!