Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CurveCurveIntersector2d
 Послать отзыв
 Класс CurveCurveIntersector2d представляет геометрию пересечений 2D-кривых общего вида.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Geometry::Entity2d Teigha::Geometry::CurveCurveIntersector2d
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdGeCurveCurveInt2d")] public sealed class CurveCurveIntersector2d : Entity2d
Копировать Код
<Wrapper("OdGeCurveCurveInt2d")> Public NotInheritable Class CurveCurveIntersector2d Inherits Entity2d
 Описание
 Класс CurveCurveIntersector2d представляет геометрию пересечений 2D-кривых общего вида.
 В классах LinearEntity2d, CircularArc2d и EllipticalArc2d есть специальные методы IntersectWith() для поиска точек пересечения двух линий, линии и дуги, двух дуг или линии и эллипса. Однако нет метода для поиска точек пересечения двух 2D-кривых общего вида. Для решения этой задачи предназначен класс CurveCurveIntersector2d.
 Создание объектов этого класса сопровождается указанием двух кривых, пересечения которых требуется вычислить. Указатели на эти кривые сохраняются как элементы данных этого класса. Для поиска пересечений возможно дополнительно конкретизировать параметрические интервалы для каждой из кривых.
 Класс поддерживает запросы, которые возвращают точки пересечения и интервалы перекрытия кривых. В классе имеются методы для получения информации о каждой точке пересечения, например, является ли пересечение касательным или трансверсальным. Если передать в конструктор две совпадающие кривые, можно получить точки самопересечения этой кривой.
 Замечания
 Если одна из связанных кривых удалена, объект этого класса должен быть перевычислен.
 Методы
 Конструкторы
 Teigha.Geometry.CurveCurveIntersector2d
 Имя
 Описание
 CurveCurveIntersector2d
 Это обзор перегрузок CurveCurveIntersector2d.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Geometry.Entity2d
 Имя
 Описание
 Entity2d Методы
 Ниже перечислены методы класса Entity2d.
 Teigha.Geometry.CurveCurveIntersector2d
 Имя
 Описание
 CurveCurveIntersector2d Методы
 Ниже перечислены методы класса CurveCurveIntersector2d.
 CurveCurveIntersector2d Свойства
 Ниже перечислены свойства класса CurveCurveIntersector2d.
 Ссылки
 CurveCurveIntersector2d Конструктор, CurveCurveIntersector2d Методы, CurveCurveIntersector2d Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!