Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector3d.IsUnitLength
 Послать отзыв
 Метод проверяет, является ли данный вектор единичным в пределах заданной точности.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsUnitLength( Tolerance tolerance );
Копировать Код
Public Function IsUnitLength( tolerance As Tolerance ) As Boolean
 Параметры
 Параметры
 Описание
 tolerance
 Входная точность. Тип Tolerance.
 Возвращает
 Возвращает true, если в пределах точности tolerance данный вектор можно считать единичным. В противном случае возвращает false.
 Описание
 Метод проверяет, является ли данный вектор единичным в пределах заданной точности tolerance.
 Если данный вектор совпадает с результатом его нормализации (приведения к единичной длине) в пределах заданной точности Tolerance.EqualVector(), метод возвращает значение true. В противном случае возвращает false.
 Ссылки
 Teigha.Geometry.Vector3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!