Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.XrefFullSubentityPath.DwgOut
 Послать отзыв
 Метод записывает данные этого объекта в указанный файлер в формате .dwg.
 Синтаксис
C#
Visual Basic
Копировать Код
public void DwgOut( ref DatabaseServices.DwgFiler outputFiler );
Копировать Код
Public Sub DwgOut( ByRef outputFiler As DatabaseServices.DwgFiler )
 Параметры
 Параметры
 Описание
 outputFiler
 Файлер, в который выполняется запись данных. Тип DatabaseServices.DwgFiler.
 Описание
 Метод записывает данные этого объекта XrefFullSubentityPath в указанный файлер в формате .dwg.
 Ссылки
 Teigha.DatabaseServices.XrefFullSubentityPath, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!