Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Point2d.Origin
 Послать отзыв
 Свойство возвращает начало координат 2D-пространства данной точки.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point2d Origin;
Копировать Код
Public Property Origin() As Point2d
 Возвращает
 Возвращает точку начала координат. Тип Point2d.
 Описание
 Свойство возвращает начало координат 2D-пространства данной точки.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.Point2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!