Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.LineSegment3d.EndPoint
 Послать отзыв
 Свойство EndPoint представляет конечную точку данного линейного сегмента.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d EndPoint;
Копировать Код
Public ReadOnly Property EndPoint As Point3d
 Возвращает
 Возвращает конечную точку линейного сегмента. Тип Point3d.
 Описание
 Свойство EndPoint представляет конечную точку данного линейного сегмента.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.LineSegment3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!