Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FileDependencyInfo.FoundPath
 Послать отзыв
 Свойство FoundPath представляет путь, по которому был найден файл.
 Синтаксис
C#
Visual Basic
Копировать Код
public String FoundPath;
Копировать Код
Public ReadOnly Property FoundPath As String
 Возвращает
 Возвращает путь, по которому был найден файл. Тип String.
 Описание
 Свойство FoundPath представляет путь, по которому был найден файл.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.FileDependencyInfo, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!