Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DimAssoc.RemoveAssociativity
 Послать отзыв
 Метод удаляет все связи между размером, объектом DimAssoc и всеми опорными точками.
 Синтаксис
C#
Visual Basic
Копировать Код
public void RemoveAssociativity();
Копировать Код
Public Sub RemoveAssociativity()
 Описание
 Метод удаляет все связи между размером, объектом DimAssoc и всеми опорными точками.
 Ссылки
 Teigha.DatabaseServices.DimAssoc, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!