Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Dimlfac
 Послать отзыв
 Синтаксис
C#
Visual Basic
public double Dimlfac;
Public Property Dimlfac() As Double
 Описание
 Возвращает или устанавливает текущее значение DIMLFAC для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!