Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Menu
 Послать отзыв
 Синтаксис
C#
Visual Basic
public String Menu;
Public Property Menu() As String
 Описание
 Возвращает текст, отображаемый в меню.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!