Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 DimStyleTableRecord.Dimclrd
 Послать отзыв
 Свойство отвечает за цвет размерных линий, стрелок и размерных линий-выносок (радиус, диаметр).
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual Color Dimclrd { get; set; }
Копировать Код
Public Overridable Property Dimclrd As Color
 Возвращает
 Возвращает тип данных Teigha.Colors.Color.
 Возвращаемые значения
 Возвращаемые значения
 Описание
 BYBLOCK
 цвет размерных линий, стрелок и размерных линий-выносок (радиус, диаметр) ПО БЛОКУ
 BYLAYER
 цвет размерных линий, стрелок и размерных линий-выносок (радиус, диаметр) ПО СЛОЮ
 red
 цвет размерных линий, стрелок и размерных линий-выносок (радиус, диаметр) КРАСНЫЙ
 yellow
 цвет размерных линий, стрелок и размерных линий-выносок (радиус, диаметр) ЖЕЛТЫЙ
 green
 цвет размерных линий, стрелок и размерных линий-выносок (радиус, диаметр) ЗЕЛЕНЫЙ
 cyan
 цвет размерных линий, стрелок и размерных линий-выносок (радиус, диаметр) ГОЛУБОЙ
 blue
 цвет размерных линий, стрелок и размерных линий-выносок (радиус, диаметр) СИНИЙ
 magenta
 цвет размерных линий, стрелок и размерных линий-выносок (радиус, диаметр) ФИОЛЕТОВЫЙ
 white
 цвет размерных линий, стрелок и размерных линий-выносок (радиус, диаметр) БЕЛЫЙ
 Описание
 В свойстве хранится цвет размерных линий, стрелок и размерных линий-выносок в виде типа данных Teigha.Colors.Color. Помимо различных цветов для этого свойства доступны значения «BYBLOCK» и «BYLAYER». Значение по умолчанию – «BYBLOCK».
 Свойство также доступно через системную переменную DIMCLRD и пользовательское меню в окне изменения/создания размерного стиля:
 При изменении системной переменной DIMCLRD будет создан новый размерный стиль под названием <переопределение> на основе текущего с новым значением DIMCLRD.
 Соответствия значений свойства Dimclrd в пользовательском интерфейсе и при работе с ним через .NET API:
 Наименование цвета в UI
 Наименование цвета при считывании через API
 Как изменить через API
 «По блоку»
 BYBLOCK
 Teigha.Colors.Color.FromColorIndex(Teigha.Colors.ColorMethod.ByBlock, 0)
 «По слою»
 BYLAYER
 Teigha.Colors.Color.FromColorIndex(Teigha.Colors.ColorMethod.ByLayer, 256)
 красный
 red
 Teigha.Colors.Color.FromColorIndex(Teigha.Colors.ColorMethod.ByColor, 1)
 желтый
 yellow
 Teigha.Colors.Color.FromColorIndex(Teigha.Colors.ColorMethod.ByColor, 2)
 зеленый
 green
 Teigha.Colors.Color.FromColorIndex(Teigha.Colors.ColorMethod.ByColor, 3)
 голубой
 cyan
 Teigha.Colors.Color.FromColorIndex(Teigha.Colors.ColorMethod.ByColor, 4)
 синий
 blue
 Teigha.Colors.Color.FromColorIndex(Teigha.Colors.ColorMethod.ByColor, 5)
 фиолетовый
 magenta
 Teigha.Colors.Color.FromColorIndex(Teigha.Colors.ColorMethod.ByColor, 6)
 белый
 white
 Teigha.Colors.Color.FromColorIndex(Teigha.Colors.ColorMethod.ByColor, 7)
 Условия
 Чтение и запись.
 Пример
 Пример изменения цвета размерных линий (значения свойства Dimclrd) в размерном стиле "Standard":
C#
 Копировать Код
public partial class Commands { [Teigha.Runtime.CommandMethod("DimclrdChange")] public void DimclrdStandardDimStyle() { // Получение ссылки на активный документ HostMgd.ApplicationServices.Document doc = HostMgd.ApplicationServices.Application.DocumentManager.MdiActiveDocument; // Получение ссылки на редактор документа HostMgd.EditorInput.Editor ed = doc.Editor; // Получение ссылки на базу данных документа Teigha.DatabaseServices.Database db = doc.Database; // Начало транзакции с базой данных документа using (Teigha.DatabaseServices.Transaction trans = db.TransactionManager.StartTransaction()) { // Открываем таблицу размерных стилей для чтения Teigha.DatabaseServices.DimStyleTable dimStyleTable = trans.GetObject(db.DimStyleTableId, Teigha.DatabaseServices.OpenMode.ForRead) as Teigha.DatabaseServices.DimStyleTable; // Находим в таблице размерных стилей ObjectId нужного стиля по его названию Teigha.DatabaseServices.ObjectId styleId = dimStyleTable["Standard"]; // Открываем таблицу размерного стиля для изменений Teigha.DatabaseServices.DimStyleTableRecord obj = trans.GetObject(styleId, Teigha.DatabaseServices.OpenMode.ForWrite) as Teigha.DatabaseServices.DimStyleTableRecord; ed.WriteMessage($"nDimclrd before: {obj.Dimclrd}"); // Изменяем цвет размерных линий на красный obj.Dimclrd = Teigha.Colors.Color.FromColorIndex(Teigha.Colors.ColorMethod.ByColor, 1); ed.WriteMessage($"nDimclrd after: {obj.Dimclrd}"); trans.Commit(); } } }
 Результат работы команды DimclrdChange:
 Было:
 Стало:
 Ссылки
 Teigha.DatabaseServices.DimStyleTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!