Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve3d.IsOn
 Послать отзыв
 Метод позволяет установить, находится ли указанная точка на данной кривой. Дополнительно возвращает значение параметра для лежащей на кривой точки.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsOn( Point3d point, out double value );
Копировать Код
Public Function IsOn( point As Point3d, value As out double ) As Boolean
 Параметры
 Параметры
 Описание
 point
 Произвольная точка Point3d.
 value
 Выходное значение параметра для точки на кривой (если точка лежит на кривой). Тип double.
 Возвращает
 Возвращает true в случае, если указанная точка находится на данной кривой, иначе - false.
 Описание
 Метод позволяет установить, находится ли указанная точка на данной кривой. Параметр value содержит значимые данные только тогда, когда метод возвращает значение true.
 Ссылки
 Teigha.Geometry.Curve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!