Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Line.Thickness
 Послать отзыв
 Синтаксис
C#
Visual Basic
public double Thickness;
Public Property Thickness() As Double
 Описание
 Обеспечивает доступ к значению ширины линии. Ширина представляет собой размер линии вдоль направления ее вектора нормали (иногда называемого направлением "вытеснения").
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Line, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!