Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.GridColor
 Послать отзыв
 Метод позволяет получить цвет сетки с указанной стороны ячейки.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual Color GridColor( int row, int col, CellEdgeMasks edge );
Копировать Код
Public virtual Function GridColor( row As Integer, col As Integer, edge As CellEdgeMasks ) As Color
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 col
 Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
 edge
 Сторона ячейки, заданная значением из перечисления CellEdgeMasks.
 Возвращает
 Возвращает цвет сетки. Тип Color.
 Описание
 Метод позволяет получить цвет сетки с указанной стороны ячейки.
 Замечания
 Для получения того же результата предпочтительнее использовать Table.Cells[row,column].{Top,Bottom,Left,Right}Edge.Color.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!