Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FormattedTableData.GetAlignment
 Послать отзыв
 Метод позволяет получить выравнивание содержимого ячейки.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual CellAlignment GetAlignment( int row, int column );
Копировать Код
Public Overridable Function GetAlignment( row As Integer, column As Integer ) As CellAlignment
 Параметры
 Параметры
 Описание
 row
 Индекс строки. Тип int. Должен быть неотрицательным и быть меньше, чем количество строк в таблице.
 column
 Индекс столбца. Тип int. Должен быть неотрицательным и быть меньше, чем количество столбцов в таблице.
 Возвращает
 Возвращает выравнивание содержимого ячейки как значение из перечисления CellAlignment.
 Описание
 Метод позволяет получить выравнивание содержимого ячейки.
 Ссылки
 Teigha.DatabaseServices.FormattedTableData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!