Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.PointOnCurve2d
 Послать отзыв
 Класс PointOnCurve2d представляет точку на параметрической 2D-кривой.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Geometry::Entity2d Teigha::Geometry::PointEntity2d Teigha::Geometry::PointOnCurve2d
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdGePointOnCurve2d")] public sealed class PointOnCurve2d : PointEntity2d
Копировать Код
<Wrapper("OdGePointOnCurve2d")> Public NotInheritable Class PointOnCurve2d Inherits PointEntity2d
 Описание
 Класс PointOnCurve2d представляет точку на параметрической 2D-кривой. Этот класс инкапсулирует всю геометрическую информацию о точке на 2D-кривой, включая соответствующее точке значение параметра, 2D-координаты точки и производные кривой в этой точке.
 Методы
 Конструкторы
 Teigha.Geometry.PointOnCurve2d
 Имя
 Описание
 PointOnCurve2d
 Это обзор перегрузок PointOnCurve2d.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Geometry.Entity2d
 Имя
 Описание
 Entity2d Методы
 Ниже перечислены методы класса Entity2d.
 Teigha.Geometry.PointEntity2d
 Имя
 Описание
 PointEntity2d Методы
 Ниже перечислены методы класса PointEntity2d.
 PointEntity2d Свойства
 Ниже перечислены свойства класса PointEntity2d.
 Teigha.Geometry.PointOnCurve2d
 Имя
 Описание
 PointOnCurve2d Методы
 Ниже перечислены методы класса PointOnCurve2d.
 PointOnCurve2d Свойства
 Ниже перечислены свойства класса PointOnCurve2d.
 Ссылки
 PointOnCurve2d Конструктор, PointOnCurve2d Методы, PointOnCurve2d Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!