Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotStyleTable.SetLineweightAt
 Послать отзыв
 Метод позволяет задать вес (толщину) линии для стиля печати с указанным индексом в данной таблице PlotStyleTable.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetLineweightAt( double val, Int32 index );
Копировать Код
Public Overridable Sub SetLineweightAt( val As Double, index As Int32 )
 Параметры
 Параметры
 Описание
 val
 Новое значение веса (толщины) линии для стиля печати. Тип double.
 index
 Индекс стиля печати, в котором изменяется вес линий. Тип Int32.
 Описание
 Метод позволяет задать вес (толщину) линии для стиля печати с индексом index в данной таблице PlotStyleTable.
 Ссылки
 Teigha.DatabaseServices.PlotStyleTable, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!