Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ObjectOverrule.SetXDataFilter
 Послать отзыв
 Метод включает предварительную фильтрацию переопределяемых объектов по расширенным данным (xdata).
 Метод используется в тех случаях, когда nanoCAD должен выполнять поиск xdata с RegisteredApplicationName для переопределяемого объекта перед вызовом любого из ваших переопределений.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetXDataFilter( ref String registeredApplicationName );
Копировать Код
Public Sub SetXDataFilter( ByRef registeredApplicationName As String )
 Параметры
 Параметры
 Описание
 registeredApplicationName
 Имя зарегистрированного приложения, тип String.
 Описание
 Метод включает предварительную фильтрацию переопределяемых объектов по расширенным данным (xdata).
 Метод используется в тех случаях, когда nanoCAD должен выполнять поиск xdata с RegisteredApplicationName для переопределяемого объекта перед вызовом любого из ваших переопределений.
 Ссылки
 Teigha.DatabaseServices.ObjectOverrule, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!