Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.AugmentedPolylineCurve3d.Points
 Послать отзыв
 Свойство Points предоставляет доступ к коллекции точек, которые определяют данную полилинию.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3dCollection Points;
Копировать Код
Public ReadOnly Property Points As Point3dCollection
 Возвращает
 Возвращает коллекцию точек. Тип Point3dCollection.
 Описание
 Свойство Points предоставляет доступ к коллекции точек, которые определяют данную полилинию.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.AugmentedPolylineCurve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!