Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.PlanarEntity.IsPerpendicularTo
 Послать отзыв
 Метод позволяет проверить перпендикулярность данного объекта и указанной плоской поверхности (в пределах точности по умолчанию).
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsPerpendicularTo( ref PlanarEntity linearEntity );
Копировать Код
Public Function IsPerpendicularTo( ByRef linearEntity As PlanarEntity ) As Boolean
 Параметры
 Параметры
 Описание
 linearEntity
 Проверяемая плоская поверхность. Тип PlanarEntity.
 Возвращает
 Возвращает true, если в пределах точности по умолчанию плоскую поверхность linearEntity можно считать перпендикулярной данной плоской поверхности. В противном случае возвращает false.
 Описание
 Метод позволяет проверить перпендикулярность данного объекта и указанной плоской поверхности.
 Используется вызов метода PlanarEntity.IsPerpendicularTo(ref PlanarEntity linearEntity, Tolerance tolerance) с точностью, равной Tolerance.Global.
 Ссылки
 Teigha.Geometry.PlanarEntity, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!