Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.SetAlignment
 Послать отзыв
 Метод задает выравнивание ячеек в строках указанных типов.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetAlignment( CellAlignment align, int rowTypes );
Копировать Код
Public virtual Sub SetAlignment( align As CellAlignment, rowTypes As Integer )
 Параметры
 Параметры
 Описание
 align
 Тип выравнивания из перечисления CellAlignment.
 rowTypes
 Типы строк. Тип int.
 Описание
 Метод задает выравнивание ячеек в строках указанных типов. Различные типы строк можно комбинировать, используя операторы OR. Если тип строки не указан, этот метод обрабатывает все возможные типы строк.
 Замечания
 Для получения того же результата предпочтительнее использовать функционал объекта Cell.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!