Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AttributeCollection
 Послать отзыв
 Коллекция, которая служит контейнером для атрибутов вхождения блока.
 Иерархия классов
Teigha::DatabaseServices::AttributeCollection
 Синтаксис
C#
Visual Basic
Копировать Код
[DefaultMember("Item")] public class AttributeCollection : System.Collections.ICollection, System.Collections.IEnumerable;
Копировать Код
Public Class AttributeCollection Inherits System.Collections.ICollection Inherits System.Collections.IEnumerable
 Описание
 Класс представляет коллекцию, которая служит контейнером для атрибутов вхождения блока.
 Пример
 В примере приведена команда, которая создает в пространстве модели блок с атрибутами и выводит содержимое коллекции атрибутов блока в командную строку nanoCAD.
C#:
 Копировать Код
using HostMgd.EditorInput; using Teigha.DatabaseServices; using Teigha.Runtime; public partial class Commands { [CommandMethod("ATTRIBUTECOLLECTIONREADING")] public void AttributeCollectionUSeExample() { // Получение ссылки на активный документ HostMgd.ApplicationServices.Document doc = HostMgd.ApplicationServices.Application.DocumentManager.MdiActiveDocument; // Получение ссылки на редактор докумена Editor ed = doc.Editor; // Получение ссылки на базу данных документа Database db = doc.Database; // Создаем определение блока, к которому будем добавлять атрибуты. // В блоке будет фигура крест-круг, состоящая из двух полилиний и окружности: BlockTableRecord btr = new BlockTableRecord(); btr.Name = "TestBlock"; Teigha.DatabaseServices.Polyline polyline = new Teigha.DatabaseServices.Polyline(); polyline.AddVertexAt(0, new Teigha.Geometry.Point2d(0, 0), 0, 0, 0); polyline.AddVertexAt(1, new Teigha.Geometry.Point2d(1000, 1000), 0, 0, 0); Teigha.DatabaseServices.Polyline polyline1 = new Teigha.DatabaseServices.Polyline(); polyline1.AddVertexAt(0, new Teigha.Geometry.Point2d(0, 1000), 0, 0, 0); polyline1.AddVertexAt(1, new Teigha.Geometry.Point2d(1000, 0), 0, 0, 0); Circle circle = new Circle(); circle.Center = new Teigha.Geometry.Point3d(500, 500, 0); circle.Radius = 500; btr.AppendEntity(polyline); btr.AppendEntity(polyline1); btr.AppendEntity(circle); // Начинаем транзакцию с базой данных для добавления нового блока в чертеж using (Transaction trans = db.TransactionManager.StartTransaction()) { // Добавляем определение нового блока в базу данных чертежа, // предварительно проверив, нет ли блока с таким же именем BlockTable blockTable = trans.GetObject(db.BlockTableId, OpenMode.ForWrite) as BlockTable; ObjectId btrID = default; if (!blockTable.Has(btr.Name)) btrID = blockTable.Add(btr); // Создаем вставку блока для добавления ее в пространство модели BlockReference blockReference = new BlockReference(new Teigha.Geometry.Point3d(0, 0, 0), btrID); // Создаем атрибуты для нашего блока AttributeReference attribute = new AttributeReference(new Teigha.Geometry.Point3d(blockReference.Position.X + 150, 1150, 0), "Cross-circle", "Block name", default); attribute.Height = 100; AttributeReference attribute1 = new AttributeReference(new Teigha.Geometry.Point3d(attribute.Position.X, 1000, 0), circle.Diameter.ToString(), "Size", default); attribute1.Height = 100; // Добавляем атрибуты в коллекцию атрибутов вставки блока AttributeCollection attributeCollection = blockReference.AttributeCollection; attributeCollection.AppendAttribute(attribute); attributeCollection.AppendAttribute(attribute1); // Добавляем втсавку блока с атрибутами в пространство модели BlockTableRecord modelSpace = trans.GetObject(blockTable[BlockTableRecord.ModelSpace], OpenMode.ForWrite) as BlockTableRecord; modelSpace.AppendEntity(blockReference); // Проверяем коллекцию атрибутов блока, выводя её параметры в командную строку nanoCAD ed.WriteMessage($"Attribute collection has {attributeCollection.Count} items:"); foreach (ObjectId attrId in attributeCollection) { AttributeReference attribute_=trans.GetObject(attrId, OpenMode.ForRead) as AttributeReference; ed.WriteMessage($"{attribute_.Tag} : {attribute_.TextString}"); } // Завершаем транзакцию trans.Commit(); } } }
 Результат работы команды ATTRIBUTECOLLECTIONREADING:
 Топики
 Имя
 Описание
 AttributeCollection Методы
 Ниже перечислены методы класса AttributeCollection.
 AttributeCollection Свойства
 Ниже перечислены свойства класса AttributeCollection.
 Ссылки
 AttributeCollection Методы, AttributeCollection Свойства, Топики, AttributeCollection Методы, AttributeCollection Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!