Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.ClipBoundary2d.ClipBoundary2d
 Послать отзыв
 Конструктор класса ClipBoundary2d. Создает экземпляр класса с указанными параметрами.
 Синтаксис
C#
Visual Basic
Копировать Код
public ClipBoundary2d( ref Point2dCollection clipBoundary );
Копировать Код
Public Sub New( ByRef clipBoundary As Point2dCollection )
 Параметры
 Параметры
 Описание
 clipBoundary
 Массив вершин границы обрезки. Тип Point2dCollection.
 Описание
 Конструктор класса ClipBoundary2d. Создает границу обрезки с вершинами в заданных точках.
 Ссылки
 Teigha.Geometry.ClipBoundary2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!