Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Filters.SpatialFilterVolume.UpDirection
 Послать отзыв
 Свойство UpDirection возвращает вектор нормали преобразованной границы отсечения.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d UpDirection;
Копировать Код
Public ReadOnly Property UpDirection As Vector3d
 Возвращает
 Возвращает вектор нормали. Тип Vector3d.
 Описание
 Свойство UpDirection возвращает вектор нормали преобразованной границы отсечения.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Filters.SpatialFilterVolume, Teigha.DatabaseServices.Filters
 Ваши комментарии по поводу этого топика: Послать отзыв!