Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.BoundaryRepresentation.Element
 Послать отзыв
 Класс Element является интерфейсным базовым классом для элементов сети. Элемент сети представляет собой минимальное замкнутое, упорядоченное подмножество соединенных узлов сети.
 Этот класс определяет функционал, который является общим для элементов сети во всех измерениях. Пользователь не может создавать экземпляры этого класса непосредственно.
 Иерархия классов
Teigha::BoundaryRepresentation::MeshEntity Teigha::BoundaryRepresentation::Element
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("AcBrElement")] public class Element : MeshEntity;
Копировать Код
<Wrapper("AcBrElement")> Public Class Element Inherits MeshEntity
 Описание
 Класс Element является интерфейсным базовым классом для элементов сети. Элемент сети представляет собой минимальное замкнутое, упорядоченное подмножество соединенных узлов сети.
 Этот класс определяет функционал, который является общим для элементов сети во всех измерениях. Пользователь не может создавать экземпляры этого класса.
 Замечания
 Класс доступен только в среде пространственного моделирования.
 Топики
 Имя
 Описание
 MeshEntity Методы
 Ниже перечислены методы класса MeshEntity.
 MeshEntity Свойства
 Ниже перечислены свойства класса MeshEntity.
 Ссылки
 Топики, MeshEntity Методы, MeshEntity Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!