Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeaderStyle.EnableBlockRotation
 Послать отзыв
 Свойство позволяет проверить, предусмотрено ли данным стилем вращение связанного блока.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool EnableBlockRotation;
Копировать Код
Public Property EnableBlockRotation As Boolean
 Возвращает
 Возвращает true, если вращение блока включено (допускается). В противном случае возвращает false.
 Описание
 Свойство позволяет проверить, предусмотрено ли данным стилем вращение связанного блока.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MLeaderStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!