Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Entity.List()
 Послать отзыв
 Метод List() вызывается из nanoCAD при выборе геометрического объекта в команде LIST и выводит информацию о нём в командную строку. Он может быть переопределён в производных классах для добавления специфичных сведений, предварительно вызвав реализацию родительского класса.
 Синтаксис
C#
Visual Basic
Копировать Код
public void List();
Копировать Код
Public Sub List()
 Описание
 Использование метода
 Этот метод предназначен для вызова из nanoCAD всякий раз, когда геометрический объект выбирается в процессе исполнения команды LIST. Тем не менее, он может быть вызван из приложений, если это требуется.
 Этот метод отображает информацию о геометрическом объекте в командной строке nanoCAD.
 Выполнение метода в производных классах
 При разработке метода в производных классах, первое, что должно быть сделано методом — это вызов AssertReadEnabled(). Следующее действие — вызов метода list() родительского класса чтобы позволить родительскому классу записать его информацию (родительский класс должен вызвать метод своего родительского класса и так далее до того, как будет достигнут класс DBObject. Таки образом, информация о геометрическом объекте будет напечатана в указанном порядке). Как только метод list родительского класса будет вызван, то за ним может следовать серия вызовов print() для печати той информации, которую требуется вывести.
 Разработанный по умолчанию метод
 Для геометрического объекта выводятся имя DXF, слой, пространство, в котором находится объект (модели или листа) и дескриптор геометрического объекта.
 Ссылки
 Teigha.DatabaseServices.Entity, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!