Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Entity3d.Mirror
 Послать отзыв
 Метод выполняет зеркальное отображение данного объекта относительно указанной плоскости.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Mirror( ref Plane plane );
Копировать Код
Public Sub Mirror( ByRef plane As Plane )
 Параметры
 Параметры
 Описание
 plane
 Плоскость зеркального отображения. Тип Plane.
 Описание
 Метод выполняет зеркальное отображение данного объекта относительно указанной плоскости.
 Ссылки
 Teigha.Geometry.Entity3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!