Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CompoundObjectId.Transform
 Послать отзыв
 Свойство предоставляет составное преобразование координат конечного объекта последовательности вхождений блоков в пространство модели, объединяя все преобразования BlockReference, от самого вложенного до самого верхнего.
 Синтаксис
C#
Visual Basic
Копировать Код
public Matrix3d Transform;
Копировать Код
Public Property Transform() As Matrix3d
 Возвращает
 Возвращает матрицу геометрического преобразования координат. Тип Matrix3d.
 Описание
 Свойство предоставляет составное преобразование координат конечного объекта последовательности вхождений блоков в пространство модели, объединяя все преобразования BlockReference, от самого вложенного до самого верхнего. Это преобразование представляет собой преобразование координат объекта конечного уровня из пространства координат BlockTableRecord в мировую систему координат.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.CompoundObjectId, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!