Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.RenderEnvironment.EnvironmentImageEnabled
 Послать отзыв
 Свойство EnvironmentImageEnabled позволяет управлять режимом отображения окружающей среды.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool EnvironmentImageEnabled;
Копировать Код
Public Property EnvironmentImageEnabled As Boolean
 Возвращает
 Возвращает true, если отображение окружающей среды включено. В противном случае возвращает false.
 Описание
 Свойство EnvironmentImageEnabled позволяет управлять режимом отображения окружающей среды.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.RenderEnvironment, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!