Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Entity.MoveGripPointsAt(IntegerCollection
 Послать отзыв
 Метод изменяет геометрический объект таким образом, чтобы координаты ручек, указанных в массиве indices, переместились на заданный вектор offset в мировой системе координат. Порядок и значения индексов определяются методом GetGripPoints(), который должен быть согласован при переопределении этого метода.
 Синтаксис
C#
Visual Basic
Копировать Код
public void MoveGripPointsAt(IntegerCollection indices, Vector3d offset);
Копировать Код
Public Sub MoveGripPointsAt(indices As IntegerCollection, offset As Vector3d)
 Параметры
 Параметры
 Описание
 indices
 Массив содержит индексные значения (которые относятся к координатам ручек, созданным методом GetGripPoints()), которые показывают, какие именно координаты ручек являются "горячими". Тип IntegerCollection
 offset
 Вектор (в WCS координатах), определяющий направление и величину, на которые координаты ручек должны быть преобразованы. Тип Vector3d
 Описание
 Использование метода
 Этот метод предназначен для вызова из nanoCAD во время редактирования ручкой геометрического объекта. Тем не менее, он может быть вызван из приложений, если это требуется.
 Вызову этого метода должен предшествовать вызов метода GetGripPoints(), чтобы получить корректные координаты ручек и порядок, в котором они приходят, чтобы определить значения индекса, которые передаются в массив indices.
 Вектор offset определяет направление и величину преобразования, которое применяется к координатам ручек, определенным в indices.
 Конечный результат заключается в том, что метод изменяет геометрический объект любым способом, при котором координаты ручек, определенные индексными значениями в indices, будут передвинуты в направлении и на величину, определяемую вектором offset.
 Выполнение метода в производных классах
 Этот метод должен изменить геометрический объект так, что координаты ручек, определенные в массиве indices, преобразуются по направлению и величине, определенными вектором offset (заданном в WCS координатах). Как это воздействует на остальные точки геометрического объекта, зависит от вида объекта, но и другие обстоятельства также должны быть учтены методом, т.к. ожидается, что метод произведет изменение всего геометрического объекта в результате редактирования координат ручек.
 Если метод разрабатывается в производных классах, то также должен быть разработан метод GetGripPoints(), поскольку значения индекса в массиве indices представляют начинающиеся с 0 индексы координат ручек, добавляемые в массив методом GetGripPoints(). Так, значение индекса в массиве indices, равное 0, соответствует первой точке, которую метод GetGripPoints() добавил в массив, переданный из этого метода, значение 1 индекса соответствует второй точке и т.д. Например, если пользователь переносил бы объект по 1-ой и 3-ем точкам, добавленным методом GetGripPoints(), то массив indices имел бы 2 элемента. Первый был бы 0, а второй — 2.
 Из-за зависимости данного метода от метода GetGripPoints(), является абсолютно необходимым, чтобы метод точно знал, какие точки задаются методом GetGripPoints() и в каком порядке (это порядок, в каком точки добавляются в массив, передаваемый из метода GetGripPoints()).
 Выполнение по умолчанию
 Вызов метода Entity.TransformBy() с матрицей преобразования, которая преобразовывает весь геометрический объект на основании offset.
 Ссылки
 Teigha.DatabaseServices.Entity, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!