Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.SurfaceSurfaceIntersector.SurfaceSurfaceIntersector
 Послать отзыв
 Конструктор класса SurfaceSurfaceIntersector. Создает объект пересечения двух указанных поверхностей, предполагающий использование заданной точности геометрических вычислений.
 Синтаксис
C#
Visual Basic
Копировать Код
public SurfaceSurfaceIntersector( ref Surface surface2, ref Surface surface1, Geometry.Tolerance tolerance );
Копировать Код
Public Sub New( ByRef surface2 As Surface, ByRef surface1 As Surface, tolerance As Geometry.Tolerance )
 Параметры
 Параметры
 Описание
 surface2
 Первая поверхность, участвующая в пересечении. Тип Surface.
 surface1
 Вторая поверхность, участвующая в пересечении. Тип Surface.
 tolerance
 Заданная геометрическая точность. Тип Geometry.Tolerance.
 Описание
 Конструктор класса SurfaceSurfaceIntersector. Создает объект пересечения двух указанных поверхностей, предполагающий использование заданной точности геометрических вычислений.
 Замечания
 Конструктор не вычисляет геометрию пересечений указанных поверхностей. Эту задачу решают поддерживаемые данным классом запросы.
 Ссылки
 Teigha.Geometry.SurfaceSurfaceIntersector, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!