Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Событие Database.BeginDxfIn
 Послать отзыв
 Синтаксис
C#
Visual Basic
public event EventHandler BeginDxfIn;
Public Event BeginDxfIn As EventHandler
 Описание
 Событие показывает, что база данных чертежа начинает выполнять операцию чтения DXF файла.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!