Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FileDependencyInfo.Feature
 Послать отзыв
 Свойство Feature предоставляет имя приложения или компонента, создавшего эту запись.
 Синтаксис
C#
Visual Basic
Копировать Код
public String Feature;
Копировать Код
Public ReadOnly Property Feature As String
 Возвращает
 Возвращает имя приложения или компонента, создавшего эту запись. Тип String.
 Описание
 Свойство Feature предоставляет имя приложения или компонента, создавшего эту запись.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.FileDependencyInfo, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!