Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotStyleData.VirtualPenNumber
 Послать отзыв
 Свойство VirtualPenNumber представляет номер виртуального пера для данного объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public int VirtualPenNumber;
Копировать Код
Public Property VirtualPenNumber As Integer
 Возвращает
 Возвращает номер виртуального пера. Тип int.
 Описание
 Свойство VirtualPenNumber представляет номер виртуального пера для данного объекта.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.PlotStyleData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!