Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.NurbsData.Rational
 Послать отзыв
 Свойство позволяет проверить, является ли сплайн рациональным.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool Rational;
Копировать Код
Public ReadOnly Property Rational As Boolean
 Возвращает
 Возвращает true, если сплайн является рациональным. В противном случае возвращает false.
 Описание
 Свойство позволяет проверить, является ли сплайн рациональным. У рационального сплайна каждая управляющая вершина имеет соответствующее значение веса.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.NurbsData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!