Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SectionType
 Послать отзыв
 Перечисление SectionType задает возможные типы создаваемых сечений, каждый из которых определяет свой собственный комплекс свойств порождаемой геометрии сечения.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum SectionType { LiveSection = 1, Section2d = 2, Section3d = 4 }
Копировать Код
Public Enum SectionType LiveSection = 1 Section2d = 2 Section3d = 4 End Enum
 Члены
 Члены
 Описание
 LiveSection
 Значение: 1. Псевдоразрез.
 Section2d
 Значение: 2. 2D-сечение.
 Section3d
 Значение: 4. 3D-сечение.
 Описание
 Перечисление SectionType задает возможные типы создаваемых сечений, каждый из которых определяет свой собственный комплекс свойств порождаемой геометрии сечения.
 Ваши комментарии по поводу этого топика: Послать отзыв!