Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Handle.Handle
 Послать отзыв
 Конструктор создает экземпляр дескриптора Handle, используя на входе значение 64-битного дескриптора.
 Синтаксис
C#
Visual Basic
Копировать Код
public Handle( Int64 value );
Копировать Код
Public Sub New( value As Int64 )
 Параметры
 Параметры
 Описание
 value
 Входное значение 64-битного дескриптора, тип long.
 Описание
 Конструктор создает экземпляр дескриптора Handle, используя на входе значение 64-битного дескриптора.
 Ссылки
 Teigha.DatabaseServices.Handle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!