Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObject.SubObjectModified
 Послать отзыв
 Cобытие происходит каждый раз, когда подобъект данного объекта открывается для изменений, в режиме OpenMode.ForWrite, изменяется и закрывается с изменениями.
 Синтаксис
C#
Visual Basic
Копировать Код
public event ObjectEventHandler SubObjectModified;
Копировать Код
Public Event SubObjectModified As ObjectEventHandler
 Возвращает
 Тип данных EventHandler, представляющий обработчик события.
 Описание
 Cобытие происходит каждый раз, когда подобъект данного объекта открывается для изменений, в режиме OpenMode.ForWrite, изменяется и закрывается с изменениями.
 Ссылки
 Teigha.DatabaseServices.DBObject, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!