Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Section.Section
 Послать отзыв
 Конструктор по умолчанию класса Section.
 Синтаксис
C#
Visual Basic
Копировать Код
public Section();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса Section.
 Ссылки
 Teigha.DatabaseServices.Section, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!