Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство TextStyleTableRecord.FlagBits
 Послать отзыв
 Синтаксис
C#
Visual Basic
public System.Byte FlagBits;
Public Property FlagBits() As System.Byte
 Описание
 Обеспечивает доступ к значению битовых флагов текстового стиля. Только второй и третий биты используются. Если второй бит установлен в 1, то это означает, что текст отображается справа налево (зеркально по X). Если третий бит установлен в 1, то это означает, что текст отображается снизу вверх (зеркально по Y).
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.TextStyleTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!