Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FormattedTableData.IsMerged
 Послать отзыв
 Метод позволяет определить, принадлежит ли данная ячейка диапазону слияния ячеек.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual bool IsMerged( int row, int column );
Копировать Код
Public Overridable Function IsMerged( row As Integer, column As Integer ) As Boolean
 Параметры
 Параметры
 Описание
 row
 Индекс строки. Тип int. Должен быть неотрицательным и меньше количества строк в таблице.
 column
 Индекс столбца. Тип int. Должен быть неотрицательным и меньше количества столбцов в таблице.
 Возвращает
 Возвращает true, если ячейка входит в диапазон слияния. В противном случае возвращает false.
 Описание
 Метод позволяет определить, принадлежит ли данная ячейка диапазону слияния ячеек.
 Ссылки
 Teigha.DatabaseServices.FormattedTableData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!