Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Dimblk
 Послать отзыв
 Синтаксис
C#
Visual Basic
public DatabaseServices::ObjectId Dimblk;
Public Property Dimblk() As DatabaseServices.ObjectId
 Описание
 Возвращает или устанавливает текущее значение DIMBLK для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!