Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DatabaseSummaryInfoBuilder.Author
 Послать отзыв
 Свойство обеспечивает доступ к имени автора.
 Синтаксис
C#
Visual Basic
Копировать Код
public String Author;
Копировать Код
Public Property Author() As String
 Возвращает
 Возвращает имя автора. Тип String.
 Описание
 Свойство обеспечивает доступ к имени автора.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.DatabaseSummaryInfoBuilder, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!