Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 LayerTableRecord.MaterialId
 Послать отзыв
 В свойстве хранится ObjectId материала, назначенного слою.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectId MaterialId { get; set; }
Копировать Код
Public Property MaterialId As ObjectId
 Возвращает
 Возвращает тип данных ObjectId.
 Описание
 С помощью свойства можно получить ObjectId материала, назначенного свойству и изменить его.
 Материал, установленный в слое, будет у всех объектов чертежа, расположенных на этом слое, если материал этих объектов имеет значение «По слою».
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.LayerTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!