Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.BoundaryRepresentation.Element2dNodeEnumerator
 Послать отзыв
 Класс Element2dNodeEnumerator представляет перечислитель узлов объекта Element2d.
 Иерархия классов
Teigha::BoundaryRepresentation::EnumeratorBase Teigha::BoundaryRepresentation::Element2dNodeEnumerator
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("AcBrElement2dNodeTraverser")] public class Element2dNodeEnumerator : EnumeratorBase, Generic.IEnumerator<Node>;
Копировать Код
<Wrapper("AcBrElement2dNodeTraverser")> Public Class Element2dNodeEnumerator Inherits EnumeratorBase Inherits Generic.IEnumerator<Node>
 Описание
 Класс Element2dNodeEnumerator представляет перечислитель узлов объекта Element2d.
 Топики
 Имя
 Описание
 EnumeratorBase Методы
 Ниже перечислены методы класса EnumeratorBase.
 EnumeratorBase Свойства
 Ниже перечислены свойства класса EnumeratorBase.
 Teigha.BoundaryRepresentation.Element2dNodeEnumerator
 Имя
 Описание
 Element2dNodeEnumerator Свойства
 Ниже перечислены свойства класса Element2dNodeEnumerator.
 Ссылки
 Element2dNodeEnumerator Свойства, Топики, EnumeratorBase Методы, EnumeratorBase Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!