Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve2dCollection.Remove
 Послать отзыв
 Метод предназначен для удаления указанного элемента из коллекции, если он там существует.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Remove( ref Curve2d value );
Копировать Код
Public Sub Remove( ByRef value As Curve2d )
 Параметры
 Параметры
 Описание
 value
 Удаляемый элемент. Тип Curve2d.
 Описание
 Метод предназначен для удаления указанного элемента из коллекции, если он там существует.
 Ссылки
 Teigha.Geometry.Curve2dCollection, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!