Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ObjectId.OldId
 Послать отзыв
 Свойство устарело, вместо него следует использовать свойство OldIdPtr.
 Синтаксис
C#
Visual Basic
Копировать Код
public long long OldId;
Копировать Код
Public Property OldId() As long long
 Возвращает
 Возвращает массив из двух элементов типа long.
 Описание
 Свойство обеспечивает доступ к значению ObjectId как к длинному целому (long), что является старым форматом (представляет собой массив из двух элементов типа long, в первом из которых содержится то же значение, что и в ObjectId).
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.ObjectId, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!