Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MText.Descent
 Послать отзыв
 Свойство возвращает высоту максимального нижнего выносного элемента букв последней строки этого объекта MText.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Descent;
Копировать Код
Public ReadOnly Property Descent As Double
 Возвращает
 Возвращает высоту максимального нижнего выносного элемента у букв последней строки. Тип double.
 Описание
 Свойство возвращает высоту максимального нижнего выносного элемента букв последней строки этого объекта MText. Это часть строчной буквы, расположенная ниже базовой линии строки текста, как например, у букв "ц", "g" и т.д.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.MText, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!