Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Vertex2d.Position
 Послать отзыв
 Свойство Position представляет положение данной вершины в системе координат объекта (OCS).
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d Position;
Копировать Код
Public Property Position As Point3d
 Возвращает
 Возвращает координатную точку данной вершины. Тип Point3d.
 Описание
 Свойство Position представляет положение данной вершины в системе координат объекта (OCS).
 Замечания
 Несмотря на то, что свойство принимает и возвращает Z-координаты, эти значения полилинией игнорируются.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Vertex2d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!