Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SweptSurface.SweepEntity
 Послать отзыв
 Свойство SweepEntity представляет геометрический объект, использованный для получения данной поверхности вытягиванием по траектории.
 Синтаксис
C#
Visual Basic
Копировать Код
public Entity SweepEntity;
Копировать Код
Public ReadOnly Property SweepEntity As Entity
 Возвращает
 Возвращает геометрический объект для вытягивания по траектории. Тип Entity.
 Описание
 Свойство SweepEntity представляет геометрический объект, использованный для получения данной поверхности вытягиванием по траектории.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.SweptSurface, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!