Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.RevolveOptions.RevolveOptions
 Послать отзыв
 Конструктор по умолчанию класса RevolveOptions.
 Синтаксис
C#
Visual Basic
Копировать Код
public RevolveOptions();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса RevolveOptions.
 Ссылки
 Teigha.DatabaseServices.RevolveOptions, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!