Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.LineSegment2d.GetBisector
 Послать отзыв
 Метод вычисляет серединный перпендикуляр для данного линейного сегмента.
 Синтаксис
C#
Visual Basic
Копировать Код
public Line2d GetBisector();
Копировать Код
Public Function GetBisector() As Line2d
 Возвращает
 Возвращает бесконечную прямую, которая представляет собой серединный перпендикуляр для данного линейного сегмента. Тип Line2d.
 Описание
 Метод вычисляет серединный перпендикуляр для данного линейного сегмента.
 Ссылки
 Teigha.Geometry.LineSegment2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!