Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.CopyFrom
 Послать отзыв
 Метод предназначен для копирования данных и формата из заданной таблицы. Параметры копирования задаются объектом TableCopyOptions.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void CopyFrom( ref LinkedTableData source, TableCopyOptions options );
Копировать Код
Public virtual Sub CopyFrom( ByRef source As LinkedTableData, options As TableCopyOptions )
 Параметры
 Параметры
 Описание
 source
 Исходная таблица. Тип LinkedTableData.
 options
 Параметры копирования. Тип TableCopyOptions.
 Описание
 Метод предназначен для копирования данных и формата из заданной таблицы. Параметры копирования задаются объектом TableCopyOptions.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!