Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.HostApplicationServices.NewProgressMeter
 Послать отзыв
 Метод позволяет получить индикатор прогресса, который визуально отражает ход завершения некоторого процесса. В текущей версии не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual ProgressMeter NewProgressMeter();
Копировать Код
Public Overridable Function NewProgressMeter() As ProgressMeter
 Возвращает
 Если метод реализован, возвращает индикатор прогресса. Тип ProgressMeter. В текущей версии возвращает null.
 Описание
 Метод позволяет получить индикатор прогресса, который визуально отражает ход завершения некоторого процесса. В текущей версии не реализован.
 Ссылки
 Teigha.DatabaseServices.HostApplicationServices, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!