Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.PointOnSurface.GetUDerivative
 Послать отзыв
 Метод переопределяет в данном объекте точку поверхности, используя новые параметрические координаты, и вычисляет в этой точке частную производную указанного порядка в направлении U. В текущей версии этот метод не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d GetUDerivative( int order, Point2d point );
Копировать Код
Public Function GetUDerivative( order As Integer, point As Point2d ) As Vector3d
 Параметры
 Параметры
 Описание
 order
 Порядок производной (1 или 2). Тип int.
 point
 Входная 2D-точка в пространстве параметров. Тип Point2d. Координата point.x определяет значение параметра точки по оси u, а координата point.y - значение параметра по оси v.
 Возвращает
 Возвращает вектор частной производной порядка order в направлении U. Тип Vector3d.
 Описание
 Метод переопределяет в данном объекте точку поверхности, используя параметрические координаты point, и вычисляет в этой точке частную производную порядка order в направлении U. В текущей версии этот метод не реализован.
 Ссылки
 Teigha.Geometry.PointOnSurface, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!