Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.PlanarEntity.Normal
 Послать отзыв
 Свойство Normal представляет единичный вектор нормали плоскости данного объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d Normal;
Копировать Код
Public ReadOnly Property Normal As Vector3d
 Возвращает
 Возвращает вектор нормали плоскости данного объекта. Тип Vector3d.
 Описание
 Свойство Normal представляет единичный вектор нормали плоскости данного объекта.
 Замечания
 Следует иметь ввиду, что направление вектора нормали плоскости может быть инвертировано средствами базового класса Surface. См. свойства Surface.IsNormalReversed и Surface.ReverseNormal.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.PlanarEntity, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!