Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.BulgeVertexCollection.Item
 Послать отзыв
 Свойство возвращает элемент коллекции c указанным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public BulgeVertex this[int index] { get; set; }
Копировать Код
Public Property Item(index As Integer) As BulgeVertex
 Возвращает
 Возвращает элемент коллекции по его индексу. Тип BulgeVertex. Если индекс окажется за пределами допустимого диапазона, выбросит исключение "Индекс вне диапазона".
 Описание
 Свойство возвращает элемент коллекции c индексом index.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.BulgeVertexCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!