Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.EllipticalArc3d.IsInside
 Послать отзыв
 Метод позволяет убедиться, находится ли указанная точка внутри полного эллипса в пределах заданной точности.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsInside( Point3d pointValue, Tolerance tolerance );
Копировать Код
Public Function IsInside( pointValue As Point3d, tolerance As Tolerance ) As Boolean
 Параметры
 Параметры
 Описание
 pointValue
 Проверяемая точка. Тип Point3d.
 tolerance
 Заданная геометрическая точность. Тип Tolerance.
 Возвращает
 Возвращает true, если в пределах используемой точности можно считать, что проверяемая точка находится в пределах полного эллипса. В противном случае возвращает false.
 Описание
 Метод позволяет убедиться, находится ли указанная точка внутри полного эллипса в пределах заданной точности.
 Ссылки
 Teigha.Geometry.EllipticalArc3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!