Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.LineSegment2d.GetSegmentLength
 Послать отзыв
 Метод позволяет с указанной точностью вычислить длину параметрически заданного отрезка на данном сегменте.
 Синтаксис
C#
Visual Basic
Копировать Код
public double GetSegmentLength( double fromParameter, double toParameter, Tolerance tolerance );
Копировать Код
Public Function GetSegmentLength( fromParameter As Double, toParameter As Double, tolerance As Tolerance ) As Double
 Параметры
 Параметры
 Описание
 fromParameter
 Значение параметра для начальной точки отрезка. Тип double.
 toParameter
 Значение параметра для конечной точки отрезка. Тип double.
 tolerance
 Входное значение геометрической точности. Тип Tolerance.
 Возвращает
 Возвращает длину отрезка между указанными точками. Тип double.
 Описание
 Метод позволяет вычислить длину отрезка на данном сегменте, концы которого определены указанными значениями параметра. Вычисления выполняются с указанной геометрической точностью.
 Ссылки
 Teigha.Geometry.LineSegment2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!