Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.XrefEditEnabled
 Послать отзыв
 Синтаксис
C#
Visual Basic
public bool XrefEditEnabled;
Public Property XrefEditEnabled() As bool
 Описание
 Обеспечивает доступ к текущему значению XEDIT для базы данных. Значение false соответствует 0. Значение true — 1.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!