Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObject.ClassID
 Послать отзыв
 Свойство предоставляет идентификатор класса данного объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public System.Guid ClassID;
Копировать Код
Public Property ClassID() As System.Guid
 Возвращает
 Возвращает идентификатор класса объекта. Тип System.Guid
 Описание
 Свойство предоставляет идентификатор класса данного объекта.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.DBObject, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!