Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Material.Diffuse
 Послать отзыв
 Свойство представляет основной диффузный компонент этого материала.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual MaterialDiffuseComponent Diffuse;
Копировать Код
Public Overridable Property Diffuse As MaterialDiffuseComponent
 Возвращает
 Возвращает диффузный компонент материала. Тип MaterialDiffuseComponent.
 Описание
 Свойство представляет основной диффузный компонент этого материала.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Material, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!