Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocArray.SourceEntities
 Послать отзыв
 Свойство обеспечивает доступ к коллекции ObjectId исходных объектов, образующих элементы ассоциативного массива.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectIdCollection SourceEntities;
Копировать Код
Public Property SourceEntities() As ObjectIdCollection
 Возвращает
 Возвращает коллекцию идентификаторов исходных объектов. Тип ObjectIdCollection.
 Описание
 Свойство обеспечивает доступ к коллекции ObjectId исходных объектов, образующих элементы ассоциативного массива.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.AssocArray, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!