Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DatabaseIOEventArgs
 Послать отзыв
 Класс представляет данные для событий базы данных, связанных с операциями ввода-вывода (BeginSave, DwgFileOpened и SaveComplete).
 Иерархия классов
Teigha::DatabaseServices::DatabaseIOEventArgs
 Синтаксис
C#
Visual Basic
Копировать Код
public class DatabaseIOEventArgs : System.EventArgs;
Копировать Код
Public Class DatabaseIOEventArgs Inherits System.EventArgs
 Описание
 Класс представляет данные для событий базы данных, связанных с операциями ввода-вывода (BeginSave, DwgFileOpened и SaveComplete).
 Методы
 Конструкторы
 ПоказатьInternal
 Нет совпадений по текущему фильтру
 Имя
 Описание
 DatabaseIOEventArgs
 This is DatabaseIOEventArgs, a member of class DatabaseIOEventArgs.
 Топики
 Имя
 Описание
 DatabaseIOEventArgs Свойства
 Ниже перечислены свойства класса DatabaseIOEventArgs.
 Ссылки
 DatabaseIOEventArgs Свойства, Методы, Топики, DatabaseIOEventArgs Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!