Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.RenderEnvironment.DoubleRangeParameter.Near
 Послать отзыв
 Свойство Near представляет расстояние для ближнего тумана.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Near;
Копировать Код
Public ReadOnly Property Near As Double
 Возвращает
 Возвращает дистанцию для ближнего тумана. Тип double.
 Описание
 Свойство Near представляет расстояние для ближнего тумана.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.RenderEnvironment.DoubleRangeParameter, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!