Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SubentityOverrule.GetSubentClassId
 Послать отзыв
 Данный метод переопределяет свойство Entity.ClassId и вызывает его в случае реализации по умолчанию.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual Guid GetSubentClassId( ref Entity entity, FullSubentityPath path );
Копировать Код
Public virtual Function GetSubentClassId( ByRef entity As Entity, path As FullSubentityPath ) As Guid
 Параметры
 Параметры
 Описание
 entity
 Объект чертежа, тип Entity.
 path
 Полный путь к подобъекту. Тип FullSubentityPath.
 Возвращает
 Возвращает Guid класса, представляющего подобъект.
 Описание
 Данный метод переопределяет свойство Entity.ClassId и вызывает его в случае реализации по умолчанию. Свойство Entity.ClassId в реализации по умолчанию возвращает Guid класса, представляющего подобъект. Метод GetSubentClassId() настоящего класса позволяет переопределить механизм работы этого свойства.
 Ссылки
 Teigha.DatabaseServices.SubentityOverrule, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!