Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Matrix2d.IsUniscaledOrtho
 Послать отзыв
 Метод позволяет проверить, являются ли векторы в линейной части матрицы равными по длине и перпендикулярными друг другу в пределах заданной точности.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsUniscaledOrtho( Tolerance tolerance );
Копировать Код
Public Function IsUniscaledOrtho( tolerance As Tolerance ) As Boolean
 Параметры
 Параметры
 Описание
 tolerance
 Входная геометрическая точность. Тип Tolerance.
 Возвращает
 Возвращает true, если в пределах точности tolerance векторы в линейной части матрицы можно считать равными по длине и перпендикулярными друг другу. В противном случае возвращает false.
 Описание
 Метод позволяет проверить, являются ли векторы в линейной части матрицы равными по длине и перпендикулярными друг другу в пределах заданной точности.
 Ссылки
 Teigha.Geometry.Matrix2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!