Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DxfFiler.WriteHandle
 Послать отзыв
 Метод записывает в данный объект Filer указанный дескриптор Handle.
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract void WriteHandle( DxfCode opCode, Handle value );
Копировать Код
Public MustOverride Sub WriteHandle( opCode As DxfCode, value As Handle )
 Параметры
 Параметры
 Описание
 opCode
 Групповой код DXF. Тип DxfCode.
 value
 Дескриптор, который следует записать. Тип Handle.
 Описание
 Метод записывает в данный объект Filer указанные групповой код DXF и дескриптор Handle.
 Ссылки
 Teigha.DatabaseServices.DxfFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!