Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.ExternalSurface.IsCone
 Послать отзыв
 Свойство IsCone позволяет проверить, является ли данная внешняя поверхность конусом.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsCone;
Копировать Код
Public ReadOnly Property IsCone As Boolean
 Возвращает
 Возвращает true, если данная внешняя поверхность является конусом. В противном случае возвращает false.
 Описание
 Свойство IsCone определяет тип данной внешней поверхности и возвращает true, если она является конусом.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.ExternalSurface, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!