Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.ExternalCurve3d.ExternalCurveKind
 Послать отзыв
 Свойство ExternalCurveKind представляет информацию о нативной системе, в которой было создано определение внешней кривой.
 Синтаксис
C#
Visual Basic
Копировать Код
public Geometry.ExternalEntityKind ExternalCurveKind;
Копировать Код
Public ReadOnly Property ExternalCurveKind As Geometry.ExternalEntityKind
 Возвращает
 Возвращает информацию о системе, в которой было создано определение внешнего объекта. Тип Geometry.ExternalEntityKind.
 Описание
 Свойство ExternalCurveKind представляет информацию о нативной системе, в которой было создано определение внешней кривой.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.ExternalCurve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!