Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table
 Послать отзыв
 Таблица является планарным объектом, который может быть размещен в произвольной плоскости трехмерного пространства. Как правило, таблица представляет собой прямоугольный массив ячеек размером n x m, содержимое которого состоит из аннотативных объектов, чаще всего текстовых. Таблицы обычно включают строку наименования таблицы, строку с заголовками столбцов и некоторое количество строк данных.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::GraphicsInterface::Drawable Teigha::DatabaseServices::DBObject Teigha::DatabaseServices::Entity Teigha::DatabaseServices::BlockReference Teigha::DatabaseServices::Table
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("AcDbTable")] public class Table : BlockReference;
Копировать Код
<Wrapper("AcDbTable")> Public Class Table Inherits BlockReference
 Описание
 Таблица является планарным объектом, который можно создать и разместить в трехмерном пространстве в произвольной плоскости. Таблицу обычно представляют в виде прямоугольного массива ячеек размером n x m, содержимое которого состоит из аннотативных объектов, чаще всего текстовых. Таблицы часто содержат строку с наименованием таблицы, строку с наименованиями столбцов и некоторое количество строк данных.
 После создания нового объекта Table приложениям обычно необходимо задать стиль таблицы, количество строк и столбцов, ширину столбца, высоту строки, точку вставки, ориентацию таблицы по ширине и вектор нормали. Используя методы объекта Table, приложения могут заполнять ячейки таблицы текстом или содержимым блоков.
 Пример
 Ниже приведен пример команды ADDTABLE3X3, которая добавляет в пространство модели таблицу с тремя строками и тремя столбцами и заполняет ее текстовыми данными.
C#
 Копировать Код
 public partial class Commands { [Teigha.Runtime.CommandMethod("AddTable3x3")] public void AddTable3x3() { // Получение ссылки на активный документ HostMgd.ApplicationServices.Document doc = HostMgd.ApplicationServices.Application.DocumentManager.MdiActiveDocument; // Получение ссылки на редактор документа HostMgd.EditorInput.Editor ed = doc.Editor; // Получение ссылки на базу данных документа Teigha.DatabaseServices.Database db = doc.Database; // Начало транзакции с базой данных документа using (Teigha.DatabaseServices.Transaction trans = db.TransactionManager.StartTransaction()) { // Открываем таблицу блоков Teigha.DatabaseServices.BlockTable blockTable = trans.GetObject(db.BlockTableId, Teigha.DatabaseServices.OpenMode.ForRead) as Teigha.DatabaseServices.BlockTable; // Открываем пространство модели Teigha.DatabaseServices.BlockTableRecord modelSpace = trans.GetObject(blockTable[Teigha.DatabaseServices.BlockTableRecord.ModelSpace], Teigha.DatabaseServices.OpenMode.ForWrite) as Teigha.DatabaseServices.BlockTableRecord; // Создаем таблицу Teigha.DatabaseServices.Table newTable = new Teigha.DatabaseServices.Table(); // Устанавливаем количество строки и столбцов - 3х3 newTable.SetSize(3, 3); // Устанавливаем точку вставки newTable.Position=new Teigha.Geometry.Point3d(100, 100, 100); // Задаем ширину столбцов newTable.SetColumnWidth(100); // Записываем коллекцию ячеек таблицы в отдельную переменную Teigha.DatabaseServices.CellRange newTableCells = newTable.Cells; // Заполняем ячейки данными for(int i = 0; i < newTable.Rows.Count; i++) { for(int j= 0; j < newTable.Columns.Count; j++) { newTableCells[i, j].TextString = "Data " + i + "," + j; } } // Добавляем таблицу в пространство модели modelSpace.AppendEntity(newTable); // Завершаем транзакцию, сохранив в базе данных проделанные действия trans.Commit(); } } }
 Результатом работы команды ADDTABLE3X3 является таблица следующего вида:
 Методы
 Конструкторы
 Teigha.GraphicsInterface.Drawable
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 Drawable
 Конструктор класса Teigha.GraphicsInterface.Drawable. (Унаследован от Drawable)
 Teigha.DatabaseServices.DBObject
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 DBObject
 Конструктор. (Унаследован от DBObject)
 Teigha.DatabaseServices.BlockReference
 Имя
 Описание
 BlockReference
 Это обзор перегрузок BlockReference.
 Teigha.DatabaseServices.Table
 Имя
 Описание
 Table
 Это обзор перегрузок Table.
 Деструкторы
 Teigha.DatabaseServices.BlockReference
 ПоказатьProtectedУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 ~BlockReference
 This is ~BlockReference, a member of class BlockReference. (Унаследован от BlockReference)
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.GraphicsInterface.Drawable
 Имя
 Описание
 Drawable Методы
 Ниже перечислены методы класса Drawable.
 Drawable Свойства
 Ниже перечислены свойства класса Drawable.
 Teigha.DatabaseServices.DBObject
 Имя
 Описание
 DBObject Методы
 Ниже перечислены методы класса DBObject.
 DBObject Свойства
 Ниже перечислены свойства класса DBObject.
 DBObject События
 Ниже перечислены события класса DBObject.
 Teigha.DatabaseServices.Entity
 Имя
 Описание
 Entity Методы
 Ниже перечислены методы класса Entity.
 Entity Свойства
 Ниже перечислены свойства класса Entity.
 Teigha.DatabaseServices.BlockReference
 Имя
 Описание
 BlockReference Данные
 Ниже перечислены данные класса BlockReference.
 BlockReference Методы
 Ниже перечислены методы класса BlockReference.
 BlockReference Свойства
 Ниже перечислены свойства класса BlockReference.
 Teigha.DatabaseServices.Table
 Имя
 Описание
 Table Методы
 Ниже перечислены методы класса Table.
 Table Свойства
 Ниже перечислены свойства класса Table.
 Ссылки
 Table Конструктор, Table Методы, Table Свойства, Методы, Топики, BlockReference Данные, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства, DBObject События
 Ваши комментарии по поводу этого топика: Послать отзыв!