Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Entity.Transparency
 Послать отзыв
 Свойство предназначено для получения или установки уровня прозрачности геометрического объекта, что влияет на его визуальное отображение при трёхмерной визуализации.
 Синтаксис
C#
Visual Basic
Копировать Код
public Teigha.Colors.Transparency Transparency;
Копировать Код
Public Property Transparency() As Teigha.Colors.Transparency
 Возвращает
 Возвращает экземпляр класса Teigha.Colors.Transparency, представляющий текущий уровень прозрачности объекта — от полностью непрозрачного (0) до полностью прозрачного (100).
 Описание
 Свойство обеспечивает доступ к величине прозрачности геометрического объекта.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Entity, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!