Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Face.GetVertexAt
 Послать отзыв
 Метод предназначен для получения точки в вершине с указанным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d GetVertexAt( short value );
Копировать Код
Public Function GetVertexAt( value As Short ) As Point3d
 Параметры
 Параметры
 Описание
 value
 Индекс вершины грани (0, 1, 2 или 3). Тип short.
 Возвращает
 Возвращает точку в WCS. Тип Point3d.
 Описание
 Метод предназначен для получения точки в вершине с указанным индексом. Используется мировая система координат WCS.
 Ссылки
 Teigha.DatabaseServices.Face, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!