Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PolygonMeshVertex.Position
 Послать отзыв
 Свойство Position представляет позицию данной вершины в мировой системе координат (WCS).
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d Position;
Копировать Код
Public Property Position As Point3d
 Возвращает
 Возвращает точку, в которой располагается вершина. Тип Point3d.
 Описание
 Свойство Position представляет позицию данной вершины в мировой системе координат (WCS).
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.PolygonMeshVertex, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!