Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GraphNode.IsCycleNode
 Послать отзыв
 Свойство позволяет определить, является ли данный узел графа частью циклической ссылки, т.е. узлом цикла.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsCycleNode;
Копировать Код
Public ReadOnly Property IsCycleNode As Boolean
 Возвращает
 Возвращает true, если данный узел является частью цикла. В противном случае возвращает false.
 Описание
 Свойство позволяет определить, является ли данный узел графа частью циклической ссылки, т.е. узлом цикла.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.GraphNode, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!