Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DxfFiler.IncludesDefaultValues
 Послать отзыв
 Свойство позволяет определить, используется ли DxfFiler для целей, в которых обычно выводятся значения по умолчанию. Не реализовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IncludesDefaultValues;
Копировать Код
Public ReadOnly Property IncludesDefaultValues As Boolean
 Возвращает
 Возвращает true, если DxfFiler используется для целей, в которых обычно выводятся значения по умолчанию. В противном случае возвращает false.
 Описание
 Свойство позволяет определить, используется ли DxfFiler для целей, в которых обычно выводятся значения по умолчанию (т.е. цвет BYLAYER, вектор нормали = (0,0,1) и т.д.). Не реализовано.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.DxfFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!