Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocDependency.IsAttachedToObject
 Послать отзыв
 Свойство позволяет установить, связана ли данная зависимость с каким-либо объектом.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsAttachedToObject;
Копировать Код
Public Property IsAttachedToObject() As Boolean
 Возвращает
 Возвращает true, если данная зависимость прикреплена к какому-либо объекту. В противном случае возвращает false.
 Описание
 Свойство позволяет установить, связана ли данная зависимость с каким-либо объектом. Зависимость прикрепляется к связанному объекту DBObject как постоянный реактор, но она также может вовсе не иметь связи ни с каким объектом. В этом случае свойство AssocDependency.DependentOnObject() возвращает ObjectId.Null.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.AssocDependency, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!