Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector2dCollection.Count
 Послать отзыв
 Свойство Count представляет текущее количество элементов в данной коллекции.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual int Count;
Копировать Код
Public Overridable ReadOnly Property Count As Integer
 Возвращает
 Возвращает текущее количество элементов в коллекции. Тип int.
 Описание
 Свойство Count представляет количество элементов, фактически содержащихся в данной коллекции.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.Vector2dCollection, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!