Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.EllipticalCylinder.MajorRadius
 Послать отзыв
 Свойство MajorRadius представляет текущее значение большого радиуса данного эллиптического цилиндра.
 Синтаксис
C#
Visual Basic
Копировать Код
public double MajorRadius;
Копировать Код
Public Property MajorRadius As Double
 Возвращает
 Возвращает текущее значение большого радиуса эллиптического цилиндра. Тип double.
 Описание
 Свойство MajorRadius представляет текущее значение большого радиуса данного эллиптического цилиндра.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.Geometry.EllipticalCylinder, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!