Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Point3dCollection.IsSynchronized
 Послать отзыв
 Свойство показывает, является ли доступ к этой коллекции потокобезопасным.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsSynchronized;
Копировать Код
Public Property IsSynchronized() As Boolean
 Возвращает
 Возвращает true, если доступ к этой коллекции является потокобезопасным; в противном случае возвращает false.
 Описание
 Свойство показывает, является ли доступ к этой коллекции потокобезопасным.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.Point3dCollection, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!