Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DxfFiler.ReadPoint3d
 Послать отзыв
 Метод возвращает трехмерную точку Point3d из текущего элемента этого объекта Filer.
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract Point3d ReadPoint3d();
Копировать Код
Public MustOverride Function ReadPoint3d() As Point3d
 Возвращает
 Возвращает трехмерную точку. Тип Point3d.
 Описание
 Метод возвращает трехмерную точку Point3d из текущего элемента этого объекта Filer.
 Ссылки
 Teigha.DatabaseServices.DxfFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!