Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Filters.FilteredBlockIterator.Next
 Послать отзыв
 Свойство Next получает доступ к текущей позиции итератора и возвращает следующий идентификатор объекта ObjectId.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectId Next;
Копировать Код
Public ReadOnly Property [Next] As ObjectId
 Возвращает
 Возвращает следующий идентификатор объекта ObjectId.
 Описание
 Свойство Next получает доступ к текущей позиции итератора и возвращает следующий идентификатор объекта ObjectId.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Filters.FilteredBlockIterator, Teigha.DatabaseServices.Filters
 Ваши комментарии по поводу этого топика: Послать отзыв!