Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор TextStyleTable.TextStyleTable
 Послать отзыв
 This is TextStyleTable, a member of class TextStyleTable.
 Синтаксис
C#
Visual Basic
internal TextStyleTable(IntPtr unmanagedPointer, bool autoDelete);
Friend Sub New(unmanagedPointer As IntPtr, autoDelete As bool)
 Ссылки
 Teigha.DatabaseServices.TextStyleTable, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!