Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 DimStyleTableRecord.Dimfxlen
 Послать отзыв
 Свойство отвечает за длину выносных линий размеров когда DimfxlenOn = true.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual double Dimfxlen { get; set; }
Копировать Код
Public Overridable Property Dimfxlen As Double
 Возвращает
 Возвращает тип данных double.
 Описание
 В свойстве хранится длина выносных линий фиксированной длины в виде числа double. Значение по умолчанию 1. Это число учитывается в отображении размеров, когда DimfxlenOn = true.
 Свойство также доступно через системную переменную DIMFXL и пользовательское меню в окне изменения/создания размерного стиля:
  При изменении системной переменной DIMFXL будет создан новый размерный стиль под названием <переопределение> на основе текущего с новым значением DIMFXL.
 Условия
 Чтение и запись.
 Пример
 Пример изменения фиксированной длины выносных линий (значения свойства Dimfxlen) в размерном стиле Standard:
C#
 Копировать Код
public partial class Commands { [Teigha.Runtime.CommandMethod("DimfxlenChange")] public void DimfxlenStandardDimStyle() { // Получение ссылки на активный документ HostMgd.ApplicationServices.Document doc = HostMgd.ApplicationServices.Application.DocumentManager.MdiActiveDocument; // Получение ссылки на редактор документа HostMgd.EditorInput.Editor ed = doc.Editor; // Получение ссылки на базу данных документа Teigha.DatabaseServices.Database db = doc.Database; // Начало транзакции с базой данных документа using (Teigha.DatabaseServices.Transaction trans = db.TransactionManager.StartTransaction()) { // Открываем таблицу размерных стилей для чтения Teigha.DatabaseServices.DimStyleTable dimStyleTable = trans.GetObject(db.DimStyleTableId, Teigha.DatabaseServices.OpenMode.ForRead) as Teigha.DatabaseServices.DimStyleTable; // Находим в таблице размерных стилей ObjectId нужного стиля по его названию Teigha.DatabaseServices.ObjectId styleId = dimStyleTable["Standard"]; // Открываем таблицу размерного стиля для изменений Teigha.DatabaseServices.DimStyleTableRecord obj = trans.GetObject(styleId, Teigha.DatabaseServices.OpenMode.ForWrite) as Teigha.DatabaseServices.DimStyleTableRecord; ed.WriteMessage($"nDimxlen before: {obj.Dimfxlen}"); // Проверяем значение свойства DimfxlenOn // Если оно false, то изменяем на true if (!obj.DimfxlenOn) obj.DimfxlenOn = true; // Изменяем фиксированный размер выносных линий obj.Dimfxlen = 15; ed.WriteMessage($"nDimfxlen after: {obj.Dimfxlen}"); trans.Commit(); } } }
 Результат работы команды DimfxlenChange:
 Было:
 Стало:
 Для того, чтобы увидеть результат, нужно удалить существующие линейные размеры и создать новые.
 Ссылки
 Teigha.DatabaseServices.DimStyleTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!