Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SymbolUtilityServices.TextStyleStandardName
 Послать отзыв
 Свойство TextStyleStandardName представляет предопределенную запись символа для имени текстового стиля "STANDARD".
 Синтаксис
C#
Visual Basic
Копировать Код
public static String TextStyleStandardName;
Копировать Код
Public Shared ReadOnly Property TextStyleStandardName As String
 Возвращает
 Возвращает предопределенное имя текстового стиля "STANDARD" Тип String.
 Описание
 Свойство TextStyleStandardName представляет предопределенную запись символа для имени текстового стиля "STANDARD". Не может быть ни NULL, ни пустой строкой.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.SymbolUtilityServices, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!