Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 DimStyleTableRecord.Dimsoxd
 Послать отзыв
 Свойство предназначено для контроля подавления размерных линий вне выносных линий.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual bool Dimsoxd { get; set; }
Копировать Код
Public Overridable Property Dimsoxd As Boolean
 Возвращает
 Возвращает тип данных bool.
 Описание
 В свойстве хранится настройка подавления размерных линий вне выносных линий.
 Возможны следующие значения типа bool:
false – не подавляется (по умолчанию);
true – подавляется.
 Свойство также доступно через системную переменную DIMSOXD и пользовательское меню в окне изменения/создания размерного стиля:
  При изменении системной переменной DIMSOXD будет создан новый размерный стиль под названием <переопределение> на основе текущего с новым значением DIMSOXD.
 Условия
 Чтение и запись.
 Пример
 Пример изменения настройки подавления размерных линий вне выносных линий (значения свойства Dimsoxd) в размерном стиле Standard:
C#
 Копировать Код
public partial class Commands { [Teigha.Runtime.CommandMethod("DimsoxdChange")] public void DimsoxdStandardDimStyle() { // Получение ссылки на активный документ HostMgd.ApplicationServices.Document doc = HostMgd.ApplicationServices.Application.DocumentManager.MdiActiveDocument; // Получение ссылки на редактор документа HostMgd.EditorInput.Editor ed = doc.Editor; // Получение ссылки на базу данных документа Teigha.DatabaseServices.Database db = doc.Database; // Начало транзакции с базой данных документа using (Teigha.DatabaseServices.Transaction trans = db.TransactionManager.StartTransaction()) { // Открываем таблицу размерных стилей для чтения Teigha.DatabaseServices.DimStyleTable dimStyleTable = trans.GetObject(db.DimStyleTableId, Teigha.DatabaseServices.OpenMode.ForRead) as Teigha.DatabaseServices.DimStyleTable; // Находим в таблице размерных стилей ObjectId нужного стиля по его названию Teigha.DatabaseServices.ObjectId styleId = dimStyleTable["Standard"]; // Открываем таблицу размерного стиля для изменений Teigha.DatabaseServices.DimStyleTableRecord obj = trans.GetObject(styleId, Teigha.DatabaseServices.OpenMode.ForWrite) as Teigha.DatabaseServices.DimStyleTableRecord; ed.WriteMessage($"nDimsoxd before: {obj.Dimsoxd}"); // Для того, чтобы было видно, как работает свойство, // настроим размерный стиль так, чтобы размерный текст // был всегда между размерных линий obj.Dimtix = true; // Изменяем признак подавления размерных линий вне выносных obj.Dimsoxd = true; ed.WriteMessage($"nDimsoxd after: {obj.Dimsoxd}"); trans.Commit(); } } }
 Результат работы команды DimsoxdChange:
 Было:
 Стало:
 Ссылки
 Teigha.DatabaseServices.DimStyleTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!