Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Point3d.Point3d
 Послать отзыв
 Конструктор класса Point3d. Создает трехмерную точку с координатами, полученными из первых трех элементов заданного массива.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d( ref double[] xyz );
Копировать Код
Public Sub New( ByRef xyz As double() )
 Параметры
 Параметры
 Описание
 xyz
 Массив значений типа double, определяющих координаты этой точки. Из переданного массива используются только первые три значения.
 Описание
 Конструктор класса Point3d. Создает трехмерную точку с координатами, полученными из первых трех элементов заданного массива xyz.
 Ссылки
 Teigha.Geometry.Point3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!