Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Dimjust
 Послать отзыв
 Синтаксис
C#
Visual Basic
public int Dimjust;
Public Property Dimjust() As Integer
 Описание
 Возвращает или устанавливает текущее значение DIMJUST для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!