Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GripData.AlternateBasePoint
 Послать отзыв
 Свойство обеспечивает доступ к альтернативной базовой точке этой ручки.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d? AlternateBasePoint;
Копировать Код
Public Property AlternateBasePoint As Point3d?
 Возвращает
 Возвращает базовую точку ручки. Тип Point3d?.
 Описание
 Свойство обеспечивает доступ к альтернативной базовой точке этой ручки.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.GripData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!