Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.RevolvedSurface.CreateRevolvedSurface
 Послать отзыв
 Метод предназначен для создания поверхности вращения с указанными параметрами.
 Синтаксис
C#
Visual Basic
Копировать Код
public void CreateRevolvedSurface( ref Entity revolveEntity, Point3d axisPoint, Vector3d axisDirection, double revolveAngle, double startAngle, ref DatabaseServices.RevolveOptions revolveOptions );
Копировать Код
Public Sub CreateRevolvedSurface( ByRef revolveEntity As Entity, axisPoint As Point3d, axisDirection As Vector3d, revolveAngle As Double, startAngle As Double, ByRef revolveOptions As DatabaseServices.RevolveOptions )
 Параметры
 Параметры
 Описание
 revolveEntity
 Плоская кривая, область или плоская поверхность, которая служит образующей для создания поверхности вращения. Тип Entity.
 axisPoint
 Точка, через которую проходит ось вращения. Тип Point3d.
 axisDirection
 Направляющий вектор оси вращения. Тип Vector3d.
 revolveAngle
 Угол поворота (в радианах). Положительное направление отсчета углов - против часовой стрелки, если смотреть навстречу направляющему вектору оси вращения. Тип double.
 startAngle
 Начальный угол поворота (в радианах). Тип double.
 revolveOptions
 Опции операции вращения. Тип DatabaseServices.RevolveOptions.
 Описание
 Метод предназначен для создания поверхности вращения с указанными параметрами.
 Ссылки
 Teigha.DatabaseServices.RevolvedSurface, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!