Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GeoLocationData.GeoLocationData
 Послать отзыв
 Конструктор класса GeoLocationData.
 Синтаксис
C#
Visual Basic
Копировать Код
public GeoLocationData();
Копировать Код
Public Sub New()
 Описание
 Конструктор класса GeoLocationData.
 Ссылки
 Teigha.DatabaseServices.GeoLocationData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!