Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Entity.Unhighlight(FullSubentityPath
 Послать отзыв
 Метод снимает подсветку указанного геометрического подобъекта или всего объекта, если путь subId не задан, и использует метод GetGraphicsMarkersAtSubentPath() для определения связанных графических маркеров. Этот метод позволяет управлять отображением подсветки в одном или всех видовых экранах с помощью параметра highlightAll.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Unhighlight(FullSubentityPath subId, bool highlightAll);
Копировать Код
Public Sub Unhighlight(subId As FullSubentityPath, highlightAll As bool)
 Параметры
 Параметры
 Описание
 subId
 Указывает, для какого геометрического подобъекта снять подсветку. Тип FullSubentityPath
 highlightAll
 Признак снятия подсветки во всех видовых экранах. Тип bool
 Описание
 Использование метода
 Этот метод использует параметр FullSubentityPath для определения того, какой подобъект геометрического объекта является требуемым. Затем он снимает его подсветку на экране. Если аргумент FullSubentityPath не задан, то снимается подсветка всего геометрического объекта.
 Обычно, FullSubentityPath переданный в subId, получается из метода Entity.GetSubentPathsAtGraphicsMarker(). Это гарантирует, что он правильно и полностью заполнен.
 Этот метод использует метод GetGraphicsMarkersAtSubentPath() геометрического объекта для получения GS маркера, связанного с subId.
 Не является необходимым соответствие каждого вызова метода Highlight() с вызовом метода Unhighlight(). Вызов метода Unhighlight() снимает выделение геометрического объекта независимо от того, сколько раз до этого вызывался метод Highlight().
 Разработка метода в производных классах
 Разработанный метод Entity.Unhighlight() выполняет все действия, необходимые для отмены подсветки любых подобъектов. Поэтому, нет необходимости переопределять этот метод, за исключением случая, когда вы хотите выполнить некоторые до- или после- операционные действия, или вы хотите отменить возможность снять подсветку геометрических подобъектов.
 Если метод переопределен и он снимает подсветку геометрических подобъектов, то метод Entity.Unhighlight() должен быть вызван в некоторой точке переопределенного метода, чтобы выполнить реальное снятие подсветки.
 Внутри метода Entity.Unhighlight() вызывается метод GetGraphicsMarkersAtSubentPath() данного геометрического объекта для преобразования FullSubentityPath в соответствующие GS маркеры. Поэтому, чтобы метод был успешным, метод GetGraphicsMarkersAtSubentPath() должен быть также разработан.
 Для большей информации о параметре subId, смотри документацию на методы Entity.GetGraphicsMarkersAtSubentPath() или GetSubentPathsAtGraphicsMarker().
 Ссылки
 Teigha.DatabaseServices.Entity, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!