Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Xrecord
 Послать отзыв
 Класс Xrecord — это класс для хранения и управления произвольными данными.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::GraphicsInterface::Drawable Teigha::DatabaseServices::DBObject Teigha::DatabaseServices::Xrecord
 Синтаксис
C#
Visual Basic
Копировать Код
public class Xrecord : DBObject;
Копировать Код
Public Class Xrecord Inherits DBObject
 Описание
 Класс Xrecord предназначен для хранения и управления произвольными данными без ограничений по размеру, которые имеются у Xdata (16 КБ на одну запись). Каждый объект Xrecord может хранить до 2 Gb.
 Данные формата Xrecord используются в словарях расширения. Если в словарь расширения объекта добавить Xrecord, то с таким объектом можно связать большой объем данных.
 Как и в случае с Xdata, для доступа к данным класса Xrecord используется класс ResultBuffer, однако Xrecord работает со стандартными групповыми кодами DXF, значения которых меньше 1000:
 Групповые коды XRECORD
 Код
 Описание
 100
 Маркер подкласса (Xrecord)
 280
 Флаг клонирования повторяющихся записей (выбор способа объединения повторяющихся записей):
0 = неприменимо
1 = оставить существующие
2 = использовать клонирование
3 = <внешняя ссылка>$0$<имя>
4 = $0$<имя>
5 = восстановить имя
 1–369 (за исключением значений 5 и 105)
 Эти значения могут использоваться в приложении любым способом
 Это означает, что помимо всех обычно используемых типов данных Xrecord может хранить идентификаторы объектов любого из четырех типов:
 Идентификатор
 Код dxf
 HardOwnershipId
 360
 HardPointerId
 340
 SoftOwnershipId
 350
 SoftPointerId
 330
 Это позволяет хранить в Xrecord идентификаторы объектов, в том числе и других записей Xrecord.
 Пример
 Пример C#:
 В качестве примера приведена команда XRECORDREADING, которая добавляет в словарь расширения пространства модели запись Xrecord, затем перебирает все записи словаря расширения пространства модели и выводит названия этих записей в командную строку nanoCAD:
C#
 Копировать Код
public partial class Commands { [Teigha.Runtime.CommandMethod("XRecordReading")] public void XrecordReading() { // Получение ссылки на активный документ HostMgd.ApplicationServices.Document doc = HostMgd.ApplicationServices.Application.DocumentManager.MdiActiveDocument; // Получение ссылки на редактор документа HostMgd.EditorInput.Editor ed = doc.Editor; // Получение ссылки на базу данных документа Teigha.DatabaseServices.Database db = doc.Database; // Начало транзакции с базой данных документа using (Teigha.DatabaseServices.Transaction trans = db.TransactionManager.StartTransaction()) { // Открываем таблицу блоков Teigha.DatabaseServices.BlockTable blockTable = trans.GetObject(db.BlockTableId, Teigha.DatabaseServices.OpenMode.ForRead) as Teigha.DatabaseServices.BlockTable; // Открываем пространство модели Teigha.DatabaseServices.BlockTableRecord modelSpace = trans.GetObject(blockTable[Teigha.DatabaseServices.BlockTableRecord.ModelSpace], Teigha.DatabaseServices.OpenMode.ForWrite) as Teigha.DatabaseServices.BlockTableRecord; // Записываем идентификатор словаря расширения пространства модели в отдельную переменную Teigha.DatabaseServices.ObjectId extDictObjId = modelSpace.ExtensionDictionary; // Проверяем, не равен ли null идентификатор словаря расширения пространства модели. // Если равен, значит словарь расширения отсутствует и его нужно создать if (extDictObjId == Teigha.DatabaseServices.ObjectId.Null) { modelSpace.UpgradeOpen(); // Создаем словарь расширения modelSpace.CreateExtensionDictionary(); // Записываем его идентификатор в переменную extDictObjId = modelSpace.ExtensionDictionary; } // Открываем словарь расширения пространства модели для изменений Teigha.DatabaseServices.DBDictionary modelSpaceDict = trans.GetObject(extDictObjId, Teigha.DatabaseServices.OpenMode.ForWrite) as Teigha.DatabaseServices.DBDictionary; // Создаем новую запись типа Xrecord Teigha.DatabaseServices.Xrecord xRec = new Teigha.DatabaseServices.Xrecord(); // Создаем массив данных TypedValue для записи Xrecord Teigha.DatabaseServices.TypedValue[] tV = new Teigha.DatabaseServices.TypedValue[] { new Teigha.DatabaseServices.TypedValue((int)Teigha.DatabaseServices.DxfCode.LayoutName, "Model space"), new Teigha.DatabaseServices.TypedValue((int)Teigha.DatabaseServices.DxfCode.Description, "This is model space") }; // Записываем массив данных в Xrecord xRec.Data = new Teigha.DatabaseServices.ResultBuffer(tV); // Добавляем в словарь расширения пространства модели новую запись с названием "LayoutInfo" modelSpaceDict.SetAt("LayoutInfo", xRec); // Добавляем также запись в базу данных чертежа trans.AddNewlyCreatedDBObject(xRec, true); // Перебираем словарь расширений в цикле foreach (Teigha.DatabaseServices.DBDictionaryEntry entry in modelSpaceDict) { // Выводим название каждой записи словаря в командную строку ed.WriteMessage($"Record name: {entry.Key}"); } // Завершаем транзакцию, сохранив в базе данных проделанные действия trans.Commit(); } } }
 Если выполнить эту команду в новом и пока пустом dwg-документе, то в командной строке можно увидеть две записи в словаре расширений пространства модели: одна – служебная, другая – созданная командой XRECORDREADING:
 Методы
 Конструкторы
 Teigha.GraphicsInterface.Drawable
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 Drawable
 Конструктор класса Teigha.GraphicsInterface.Drawable. (Унаследован от Drawable)
 Teigha.DatabaseServices.DBObject
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 DBObject
 Конструктор. (Унаследован от DBObject)
 Teigha.DatabaseServices.Xrecord
 Имя
 Описание
 Xrecord
 Конструктор по умолчанию.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.GraphicsInterface.Drawable
 Имя
 Описание
 Drawable Методы
 Ниже перечислены методы класса Drawable.
 Drawable Свойства
 Ниже перечислены свойства класса Drawable.
 Teigha.DatabaseServices.DBObject
 Имя
 Описание
 DBObject Методы
 Ниже перечислены методы класса DBObject.
 DBObject Свойства
 Ниже перечислены свойства класса DBObject.
 DBObject События
 Ниже перечислены события класса DBObject.
 Teigha.DatabaseServices.Xrecord
 Имя
 Описание
 Xrecord Свойства
 Ниже перечислены свойства класса Xrecord.
 Ссылки
 Xrecord Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства, DBObject События
 Ваши комментарии по поводу этого топика: Послать отзыв!