Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DbHomeView.ToggleDefaultSettings
 Послать отзыв
 Метод предназначен для приведения данного объекта к настройкам по умолчанию.
 Синтаксис
C#
Visual Basic
Копировать Код
public void ToggleDefaultSettings();
Копировать Код
Public Sub ToggleDefaultSettings()
 Описание
 Метод предназначен для приведения данного объекта к настройкам по умолчанию.
 Ссылки
 Teigha.DatabaseServices.DbHomeView, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!