Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Surface.Surface
 Послать отзыв
 Конструктор по умолчанию класса Surface.
 Синтаксис
C#
Visual Basic
Копировать Код
public Surface();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса Surface.
 Ссылки
 Teigha.DatabaseServices.Surface, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!