Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CellRange.CanDeleteRows
 Послать отзыв
 Свойство позволяет определить, возможно ли удаление строк из диапазона.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool CanDeleteRows;
Копировать Код
Public ReadOnly Property CanDeleteRows As Boolean
 Возвращает
 Возвращает true, если удаление строк возможно. В противном случае возвращает false.
 Описание
 Свойство позволяет определить, возможно ли удаление строк из диапазона.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.CellRange, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!