Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AbstractViewPE.LowerLeftCorner
 Послать отзыв
 Свойство LowerLeftCorner представляет координаты левого нижнего угла связанного видового экрана.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point2d LowerLeftCorner;
Копировать Код
Public ReadOnly Property LowerLeftCorner As Point2d
 Возвращает
 Возвращает координаты левого нижнего угла видового экрана. Тип Point2d.
 Описание
 Свойство LowerLeftCorner представляет координаты левого нижнего угла связанного видового экрана.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.AbstractViewPE, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!