Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector2d.-
 Послать отзыв
 Оператор изменяет направление вектора на противоположное.
 Синтаксис
C#
Visual Basic
Копировать Код
public static Vector2d Vector2d -( Vector2d a );
Копировать Код
Public Shared Operator -( a As Vector2d ) As Vector2d
 Параметры
 Параметры
 Описание
 a
 Входной вектор. Тип Vector2d.
 Возвращает
 Возвращает вектор, который противоположен по направлению входному вектору a. Тип Vector2d.
 Описание
 Оператор возвращает вектор, который противоположен по направлению входному вектору a и имеет координаты (-x, -y).
 Ссылки
 Teigha.Geometry.Vector2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!