Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.KnotCollection.GetEnumerator
 Послать отзыв
 Метод предоставляет перечислитель для данной коллекции узлов.
 Синтаксис
C#
Visual Basic
Копировать Код
public IEnumerator GetEnumerator();
Копировать Код
Public Function GetEnumerator() As IEnumerator
 Возвращает
 Возвращает перечислитель для данной коллекции. Тип IEnumerator.
 Описание
 Метод предоставляет перечислитель для данной коллекции узлов.
 Ссылки
 Teigha.Geometry.KnotCollection, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!