Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MlineStyle.FillColor
 Послать отзыв
 Свойство представляет цвет фоновой заливки мультилинии.
 Синтаксис
C#
Visual Basic
Копировать Код
public Color FillColor;
Копировать Код
Public Property FillColor As Color
 Возвращает
 Возвращает цвет фоновой заливки мультилинии. Тип Color.
 Описание
 Свойство представляет цвет фоновой заливки мультилинии.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MlineStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!