Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Entity2d.TranslateBy
 Послать отзыв
 Метод выполняет трансляцию данного объекта на заданный двумерный вектор.
 Синтаксис
C#
Visual Basic
Копировать Код
public void TranslateBy( Vector2d translateVector );
Копировать Код
Public Sub TranslateBy( translateVector As Vector2d )
 Параметры
 Параметры
 Описание
 translateVector
 Вектор, определяющий операцию 2D-трансляции. Тип Vector2d.
 Описание
 Метод выполняет трансляцию (параллельный перенос) данного объекта на заданный двумерный вектор.
 Ссылки
 Teigha.Geometry.Entity2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!