Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CubicSplineCurve2d.NumFitPoints
 Послать отзыв
 Свойство NumFitPoints представляет количество определяющих точек данного сплайна.
 Синтаксис
C#
Visual Basic
Копировать Код
public int NumFitPoints;
Копировать Код
Public ReadOnly Property NumFitPoints As Integer
 Возвращает
 Возвращает количество определяющих точек сплайна. Тип int.
 Описание
 Свойство NumFitPoints представляет количество определяющих точек данного сплайна.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.CubicSplineCurve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!