Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Extents3d.Extents3d
 Послать отзыв
 Конструктор класса Extents3d. Создает ограничивающий бокс по двум точкам Point3d.
 Синтаксис
C#
Visual Basic
Копировать Код
public Extents3d( Point3d min, Point3d max );
Копировать Код
Public Sub New( min As Point3d, max As Point3d )
 Параметры
 Параметры
 Описание
 min
 Минимальная точка. Тип Point3d.
 max
 Максимальная точка. Тип Point3d.
 Описание
 Конструктор класса Extents3d. Создает ограничивающий бокс по двум точкам Point3d.
 Ссылки
 Teigha.DatabaseServices.Extents3d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!