Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SystemVariableChangingEventArgs
 Послать отзыв
 Класс SystemVariableChangingEventArgs представляет свойства, связанные с событиями системных переменных (в процессе изменения системных переменных).
 Иерархия классов
Teigha::DatabaseServices::SystemVariableChangingEventArgs
 Синтаксис
C#
Visual Basic
Копировать Код
public sealed class SystemVariableChangingEventArgs : EventArgs
Копировать Код
Public NotInheritable Class SystemVariableChangingEventArgs Inherits EventArgs
 Описание
 Класс SystemVariableChangingEventArgs представляет свойства, связанные с событиями системных переменных (в процессе изменения системных переменных).
 Топики
 Имя
 Описание
 SystemVariableChangingEventArgs Свойства
 Ниже перечислены свойства класса SystemVariableChangingEventArgs.
 Ссылки
 SystemVariableChangingEventArgs Свойства, Топики, SystemVariableChangingEventArgs Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!