Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Interval.IsContinuousAtUpper
 Послать отзыв
 Метод позволяет проверить, совпадает ли верхняя граница данного интервала с нижней границей указанного интервала в пределах заданной точности определения границ.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsContinuousAtUpper( ref Interval otherInterval );
Копировать Код
Public Function IsContinuousAtUpper( ByRef otherInterval As Interval ) As Boolean
 Параметры
 Параметры
 Описание
 otherInterval
 Проверяемый интервал. Тип Interval.
 Возвращает
 Возвращает true, если данный интервал ограничен сверху, интервал otherInterval ограничен снизу, а верхняя граница данного интервала совпадает с нижней границей интервала otherInterval в пределах точности определения границ, настроенной в данном интервале. В противном случае возвращает false.
 Описание
 Метод позволяет проверить, совпадает ли верхняя граница данного интервала с нижней границей интервала otherInterval в пределах заданной точности определения границ. Предполагается, что данный интервал ограничен сверху, а интервал otherInterval ограничен снизу.
 Ссылки
 Teigha.Geometry.Interval, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!