Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор CellBorders.CellBorders
 Послать отзыв
 This is CellBorders, a member of class CellBorders.
 Синтаксис
C#
Visual Basic
internal CellBorders(ref CellRange cell);
Friend Sub New(ByRef cell As CellRange)
 Ссылки
 Teigha.DatabaseServices.CellBorders, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!