Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Событие Database.BeginSave
 Послать отзыв
 Синтаксис
C#
Visual Basic
public event DatabaseIOEventHandler BeginSave;
Public Event BeginSave As DatabaseIOEventHandler
 Описание
 Событие показывает, что база данных чертежа начинает выполнять операцию сохранения.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!