Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LayoutManager.Current
 Послать отзыв
 Свойство предоставляет доступ к текущему менеджеру листов LayoutManager.
 Синтаксис
C#
Visual Basic
Копировать Код
public LayoutManager Current;
Копировать Код
Public Property Current() As LayoutManager
 Возвращает
 Возвращает объект типа LayoutManager.
 Описание
 Свойство предоставляет доступ к текущему менеджеру листов LayoutManager.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.LayoutManager, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!