Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SymbolUtilityServices.GetLinetypeByBlockId
 Послать отзыв
 Метод позволяет извлечь из указанной базы данных идентификатор объекта типа линий "ByBlock".
 Синтаксис
C#
Visual Basic
Копировать Код
public static ObjectId GetLinetypeByBlockId( ref Database databasePointer );
Копировать Код
Public Shared Function GetLinetypeByBlockId( ByRef databasePointer As Database ) As ObjectId
 Параметры
 Параметры
 Описание
 databasePointer
 База данных, из которой извлекается идентификатор объекта. Тип Database.
 Возвращает
 Возвращает ненулевой идентификатор объекта типа линий "ByBlock". Тип ObjectId.
 Описание
 Метод позволяет извлечь из указанной базы данных идентификатор объекта типа линий "ByBlock".
 Ссылки
 Teigha.DatabaseServices.SymbolUtilityServices, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!