Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.RevolveOptions.CloseToAxis
 Послать отзыв
 Свойство CloseToAxis позволяет определить, следует ли замкнуть на ось вращения концы незамкнутого профиля перед выполнением операции вращения.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool CloseToAxis;
Копировать Код
Public ReadOnly Property CloseToAxis As Boolean
 Возвращает
 Возвращает true, если опция дотягивания концов кривой до оси вращения включена. В противном случае возвращает false.
 Описание
 Свойство CloseToAxis позволяет определить, следует ли замкнуть на ось вращения концы незамкнутого профиля перед выполнением операции вращения. Значение по умолчанию для этой опции — false.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.RevolveOptions, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!