Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Viewport.CustomScale
 Послать отзыв
 Свойство CustomScale представляет пользовательский масштаб в данном видовом экране.
 Синтаксис
C#
Visual Basic
Копировать Код
public double CustomScale;
Копировать Код
Public Property CustomScale As Double
 Возвращает
 Возвращает величину пользовательского масштаба. Тип double.
 Описание
 Свойство, которое представляет пользовательский масштаб этого видового экрана.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Viewport, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!