Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Polyline.RemoveVertexAt
 Послать отзыв
 Синтаксис
C#
Visual Basic
public void RemoveVertexAt(int index);
Public Sub RemoveVertexAt(index As Integer)
 Параметры
 Параметры
 Описание
 index
 Индекс (отсчитываемый от 0) удаляемой вершины
 Описание
 Метод удаляет вершину с индексом, заданным index.
 Ссылки
 Teigha.DatabaseServices.Polyline, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!