Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.EllipticalCylinder.RadiusRatio
 Послать отзыв
 Свойство RadiusRatio представляет соотношение длин полуосей эллипса в основании данного эллиптического цилиндра.
 Синтаксис
C#
Visual Basic
Копировать Код
public double RadiusRatio;
Копировать Код
Public ReadOnly Property RadiusRatio As Double
 Возвращает
 Возвращает отношение длин полуосей эллипса в основании эллиптического цилиндра. Тип double.
 Описание
 Свойство RadiusRatio представляет отношение длин полуосей эллипса в основании данного эллиптического цилиндра. Чем это отношение ближе к единице, тем ближе к окружности эллиптическое основание цилиндра.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.EllipticalCylinder, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!