Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SweepOptionsBuilder.CheckIntersections
 Послать отзыв
 Свойство CheckIntersections позволяет определить состояние опции проверки на самопересечения для получаемого тела или поверхности.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool CheckIntersections;
Копировать Код
Public Property CheckIntersections As Boolean
 Возвращает
 Возвращает true, если проверка на самопересечения включена. В противном случае возвращает false.
 Описание
 Свойство CheckIntersections позволяет определить состояние опции проверки на самопересечения для получаемого тела или поверхности.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.SweepOptionsBuilder, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!