Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DxfFiler.WriteBytes
 Послать отзыв
 Метод записывает в данный объект Filer указанный байтовый массив.
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract void WriteBytes( DxfCode opCode, unsigned char[] chunk );
Копировать Код
Public MustOverride Sub WriteBytes( opCode As DxfCode, chunk() As unsigned char )
 Параметры
 Параметры
 Описание
 opCode
 Групповой код DXF. Тип DxfCode.
 value
 Значение, которое следует записать. Тип unsigned char[].
 Описание
 Метод записывает в данный объект Filer групповой код DXF и указанный байтовый массив.
 Ссылки
 Teigha.DatabaseServices.DxfFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!