Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FaceRef
 Послать отзыв
 Класс FaceRef представляет ссылку на грань.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::DatabaseServices::GeomRef Teigha::DatabaseServices::SubentRef Teigha::DatabaseServices::FaceRef
 Синтаксис
C#
Visual Basic
Копировать Код
[TypeDescriptionProvider("Teigha.ComponentModel.TypeDescriptionProvider`1[[Teigha.DatabaseServices.FaceRef, TD_MgdDbConstraints]], TD_MgdDbConstraints"), Teigha.Runtime.Wrapper("AcDbFaceRef")] public class FaceRef : SubentRef;
Копировать Код
<TypeDescriptionProvider("Teigha.ComponentModel.TypeDescriptionProvider`1[[Teigha.DatabaseServices.FaceRef, TD_MgdDbConstraints]], TD_MgdDbConstraints"), Teigha.Runtime.Wrapper("AcDbFaceRef")> Public Class FaceRef Inherits SubentRef
 Описание
 Класс FaceRef представляет ссылку на грань.
 Методы
 Конструкторы
 Teigha.DatabaseServices.FaceRef
 Имя
 Описание
 FaceRef
 Это обзор перегрузок FaceRef.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.DatabaseServices.GeomRef
 Имя
 Описание
 GeomRef Методы
 Ниже перечислены методы класса GeomRef.
 GeomRef Свойства
 Ниже перечислены свойства класса GeomRef.
 Teigha.DatabaseServices.SubentRef
 Имя
 Описание
 SubentRef Методы
 Ниже перечислены методы класса SubentRef.
 SubentRef Свойства
 Ниже перечислены свойства класса SubentRef.
 Ссылки
 FaceRef Конструктор, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!