Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AbstractViewPE.IsFrontClipOn
 Послать отзыв
 Свойство IsFrontClipOn позволяет определить, включен ли режим переднего отсечения.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsFrontClipOn;
Копировать Код
Public Property IsFrontClipOn As Boolean
 Возвращает
 Возвращает true, если передняя плоскость отсечения включена. В противном случае возвращает false.
 Описание
 Свойство IsFrontClipOn позволяет определить, включен ли режим переднего отсечения.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.AbstractViewPE, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!