Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GripOverrule.GetGripPoints
 Послать отзыв
 Метод предоставляет данные о всех ручках объекта чертежа.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void GetGripPoints( ref Entity entity, ref Point3dCollection gripPoints, ref IntegerCollection snapModes, ref IntegerCollection geometryIds );
Копировать Код
Public virtual Sub GetGripPoints( ByRef entity As Entity, ByRef gripPoints As Point3dCollection, ByRef snapModes As IntegerCollection, ByRef geometryIds As IntegerCollection )
 Параметры
 Параметры
 Описание
 entity
 Объект чертежа, тип Entity,
 gripPoints
 Коллекция точек Point3d для ручек а мировой системе координат, тип Point3dCollection,
 snapModes
 Режимы привязки, коллекция IntegerCollection,
 geometryIds
 Зарезервирован для будущего использования.
 Описание
 Метод предоставляет данные о всех ручках объекта чертежа.
 Ссылки
 Teigha.DatabaseServices.GripOverrule, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!