Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PolylineVertex3d.Position
 Послать отзыв
 Свойство обеспечивает доступ к положению вершины в виде объекта Point3d.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d Position;
Копировать Код
Public Property Position() As Point3d
 Возвращает
 Возвращает положение вершины в виде объекта Point3d.
 Описание
 Свойство обеспечивает доступ к положению вершины в виде объекта Point3d.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.PolylineVertex3d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!