Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.OsnapPointRef.NearPointParam
 Послать отзыв
 Свойство NearPointParam представляет параметр ближайшей точки связанной геометрии.
 Синтаксис
C#
Visual Basic
Копировать Код
public double NearPointParam;
Копировать Код
Public Property NearPointParam As Double
 Возвращает
 Возвращает параметр ближайшей точки. Тип double.
 Описание
 Свойство NearPointParam представляет параметр ближайшей точки связанной геометрии.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.OsnapPointRef, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!