Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.VertexRef.VertexRef
 Послать отзыв
 Конструктор класса VertexRef. Создает ссылку на вершину в заданной точке конкретного подобъекта заданного составного объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public VertexRef( ref CompoundObjectId compoundObjectId, SubentityId subentId, Point3d point );
Копировать Код
Public Sub New( ByRef compoundObjectId As CompoundObjectId, subentId As SubentityId, point As Point3d )
 Параметры
 Параметры
 Описание
 compoundObjectId
 Входной идентификатор составного объекта. Тип CompoundObjectId.
 subentId
 Входной идентификатор подобъекта. Тип SubentityId.
 point
 Входная точка. Тип Point3d.
 Описание
 Конструктор класса VertexRef. Создает ссылку на вершину в заданной точке конкретного подобъекта заданного составного объекта.
 Ссылки
 Teigha.DatabaseServices.VertexRef, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!