Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Indexctl
 Послать отзыв
 Синтаксис
C#
Visual Basic
public int Indexctl;
Public Property Indexctl() As Integer
 Описание
 Возвращает или устанавливает значение заголовка переменной INDEXCTL.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!