Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Useri2
 Послать отзыв
 Синтаксис
C#
Visual Basic
public int Useri2;
Public Property Useri2() As Integer
 Описание
 Обеспечивает доступ к текущему значению USERI2 для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!