Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Line3d.Set
 Послать отзыв
 Метод изменяет определение линии так, чтобы она проходила через две несовпадающие опорные точки.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Set( Point3d point1, Point3d point2 );
Копировать Код
Public Sub Set( point1 As Point3d, point2 As Point3d )
 Параметры
 Параметры
 Описание
 point1
 Первая опорная точка. Тип Point3d.
 point2
 Вторая опорная точка. Тип Point3d.
 Описание
 Метод изменяет определение линии так, чтобы она проходила через две несовпадающие опорные точки point1 и point2.
 Ссылки
 Teigha.Geometry.Line3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!