Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PolylineVertex3d.PolylineVertex3d
 Послать отзыв
 Этот конструктор создает объект PolylineVertex3d с заданным положением в пространстве и типом SimpleVertex.
 Синтаксис
C#
Visual Basic
Копировать Код
public PolylineVertex3d( Point3d param );
Копировать Код
Public Sub New( param As Point3d )
 Параметры
 Параметры
 Описание
 param
 Объект Point3d, задающий координаты создаваемой вершины в мировой системе координат (WCS).
 Описание
 Этот конструктор создает объект PolylineVertex3d с заданным положением в пространстве и типом SimpleVertex.
 Ссылки
 Teigha.DatabaseServices.PolylineVertex3d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!