Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Dimazin
 Послать отзыв
 Синтаксис
C#
Visual Basic
public int Dimazin;
Public Property Dimazin() As Integer
 Описание
 Возвращает или устанавливает текущее значение DIMAZIN для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!