Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CellContent.DeleteContent
 Послать отзыв
 Метод удаляет из ячейки всё содержимое.
 Синтаксис
C#
Visual Basic
Копировать Код
public void DeleteContent();
Копировать Код
Public Sub DeleteContent()
 Описание
 Метод удаляет из ячейки всё её содержимое.
 Замечания
 Если содержимое ячейки защищено от редактирования, метод выбрасывает исключение eIsWriteProtected.
 Ссылки
 Teigha.DatabaseServices.CellContent, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!