Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DeepCloneType
 Послать отзыв
 Данное перечисление определяет типы глубокого клонирования.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum DeepCloneType { Block = 2, Copy = 0, Explode = 1, Insert = 6, InsertCopy = 10, Objects = 8, SymbolTableMerge = 4, Wblock = 7, WblockObjects = 11, XrefBind = 3, XrefInsert = 9 }
Копировать Код
Public Enum DeepCloneType Block = 2 Copy = 0 Explode = 1 Insert = 6 InsertCopy = 10 Objects = 8 SymbolTableMerge = 4 Wblock = 7 WblockObjects = 11 XrefBind = 3 XrefInsert = 9 End Enum
 Члены
 Члены
 Описание
 Copy
 Значение: 0. Копирование объектов.
 Explode
 Значение: 1. Разбиение исходных составных объектов.
 Block
 Значение: 2. Клонирование блоков.
 XrefBind
 Значение: 3. Связывание внешних ссылок.
 SymbolTableMerge
 Значение: 4. Слияние таблиц символов.
 Insert
 Значение: 6. Вставка объектов.
 Wblock
 Значение: 7. Преобразование блока (WBLOCK).
 Objects
 Значение: 8. Клонирование объектов.
 XrefInsert
 Значение: 9. Вставка внешних ссылок.
 InsertCopy
 Значение: 10. Вставка копий объектов.
 WblockObjects
 Значение: 11. Клонирование выбранных объектов (WBLOCK).
 Описание
 Данное перечисление определяет типы глубокого клонирования.
 Ваши комментарии по поводу этого топика: Послать отзыв!