Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SurfaceSliceResults.SurfaceSliceResults
 Послать отзыв
 Конструктор структуры SurfaceSliceResults. Создает экземпляр структуры с указанными параметрами.
 Синтаксис
C#
Visual Basic
Копировать Код
public SurfaceSliceResults( ref Surface negativeHalfSurface, ref Surface newSurface );
Копировать Код
Public Sub New( ByRef negativeHalfSurface As Surface, ByRef newSurface As Surface )
 Параметры
 Параметры
 Описание
 negativeHalfSurface
 Другая сторона поверхности, которая разрезана плоскостью или поверхностью. Тип Surface.
 newSurface
 Положительная половина поверхности, когда поверхность не может быть отредактирована непосредственно, поскольку она наследует геометрию другой поверхности. Тип Surface.
 Описание
 Конструктор структуры SurfaceSliceResults. Создает экземпляр структуры с указанными параметрами.
 Ссылки
 Teigha.DatabaseServices.SurfaceSliceResults, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!