Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeader.GetLeaderLineIndexes
 Послать отзыв
 Метод предоставляет массив индексов всех линейных сегментов указанной линии выноски.
 Синтаксис
C#
Visual Basic
Копировать Код
public ArrayList GetLeaderLineIndexes( int leaderIndex );
Копировать Код
Public Function GetLeaderLineIndexes( leaderIndex As Integer ) As ArrayList
 Параметры
 Параметры
 Описание
 leaderIndex
 индекс выноски. Тип int.
 Возвращает
 Возвращает массив индексов всех линейных сегментов указанной линии выноски. Тип ArrayList.
 Описание
 Метод предоставляет массив индексов всех линейных сегментов указанной линии выноски.
 Ссылки
 Teigha.DatabaseServices.MLeader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!