Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство RasterImageDef.Size
 Послать отзыв
 Синтаксис
C#
Visual Basic
public Vector2d Size;
Public Property Size() As Vector2d
 Описание
 Возвращает количество битов, занимаемых точкой исходного изображения. Допустимые значения — 1,8,24,32.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.RasterImageDef, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!