Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Helix.Twist
 Послать отзыв
 Свойство обеспечивает доступ к направлению закручивания спирали (по часовой стрелке или против).
 Синтаксис
C#
Visual Basic
Копировать Код
public bool Twist;
Копировать Код
Public Property Twist As Boolean
 Возвращает
 Возвращает true, если спираль закручивается «против часовой стрелки». В противном случае возвращает false.
 Описание
 Свойство обеспечивает доступ к направлению закручивания спирали (по часовой стрелке или против).
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Helix, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!