Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Line2dCollection.Item
 Послать отзыв
 Свойство Item предоставляет доступ к элементу коллекции с указанным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public Line2d this[int index];
Копировать Код
Default Public Property Item( index As Integer ) As Line2d
 Параметры
 Параметры
 Описание
 index
 Входной индекс элемента коллекции. Тип int.
 Возвращает
 Возвращает элемент коллекции с указанным индексом. Тип Line2d.
 Описание
 Свойство Item предоставляет доступ к элементу коллекции с указанным индексом.
 Замечания
 В случае некорректного значения индекса метод выбрасывает исключение ArgumentOutOfRangeException.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.Geometry.Line2dCollection, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!