Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ObjectIdCollection.Item
 Послать отзыв
 Свойство предоставляет доступ к элементу коллекции по его индексу.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectId this[int index]
Копировать Код
Default Public Property Item( index As Integer ) As ObjectId
 Параметры
 Параметры
 Описание
 index
 Индекс элемента коллекции. Тип int.
 Возвращает
 Возвращает элемент коллекции. Тип ObjectId.
 Описание
 Свойство предоставляет доступ к элементу коллекции по его индексу.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.ObjectIdCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!