Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GeoLocationData.ScaleFactor
 Послать отзыв
 Свойство обеспечивает доступ к масштабному множителю данного объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public double ScaleFactor;
Копировать Код
Public Property ScaleFactor As Double
 Возвращает
 Возвращает масштабный множитель. Тип double.
 Описание
 Свойство обеспечивает доступ к масштабному множителю данного объекта.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.GeoLocationData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!