Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Plane.Plane
 Послать отзыв
 Конструктор класса Plane. Создает экземпляр класса с указанными коэффициентами в общем уравнении плоскости.
 Синтаксис
C#
Visual Basic
Копировать Код
public Plane( double a, double b, double c, double d );
Копировать Код
Public Sub New( a As Double, b As Double, c As Double, d As Double )
 Параметры
 Параметры
 Описание
 a
 Коэффициент a в общем уравнении плоскости. Тип double.
 b
 Коэффициент b в общем уравнении плоскости. Тип double.
 c
 Коэффициент c в общем уравнении плоскости. Тип double.
 d
 Коэффициент d в общем уравнении плоскости. Тип double.
 Описание
 Конструктор класса Plane. Создает экземпляр класса с указанными коэффициентами в общем уравнении плоскости.
 Замечания
 Общее уравнение плоскости имеет вид:
 Копировать Код
 a * X + b * Y + c * Z + d = 0
 где a, b, c, d - некоторые действительные константы, удовлетворяющие условию невырожденности плоскости a^2 + b^2 + c^2 != 0 (т.е., a, b и c не могут равняться нулю одновременно). Величины a, b, c служат компонентами вектора нормали этой плоскости.
 Ссылки
 Teigha.Geometry.Plane, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!