Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LayerStateRenameEventArgs.Name
 Послать отзыв
 Свойство Name представляет текущее имя слоя.
 Синтаксис
C#
Visual Basic
Копировать Код
public String Name;
Копировать Код
Public ReadOnly Property Name As String
 Возвращает
 Возвращает текущее имя слоя. Тип String.
 Описание
 Свойство Name представляет текущее имя слоя (старое имя).
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.LayerStateRenameEventArgs, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!