Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve2dCollection.IndexOf
 Послать отзыв
 Метод позволяет найти индекс указанной кривой в данной коллекции.
 Синтаксис
C#
Visual Basic
Копировать Код
public int IndexOf( ref Curve2d value );
Копировать Код
Public Function IndexOf( ByRef value As Curve2d ) As Integer
 Параметры
 Параметры
 Описание
 value
 Искомая кривая. Тип Curve2d.
 Возвращает
 Возвращает индекс элемента value в коллекции. Тип int.
 Описание
 Метод позволяет найти индекс указанной кривой value в данной коллекции.
 Ссылки
 Teigha.Geometry.Curve2dCollection, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!