Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SectionManager.LiveSection
 Послать отзыв
 Свойство LiveSection представляет в базе данных идентификатор объекта активной в данный момент секущей плоскости.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.ObjectId LiveSection;
Копировать Код
Public ReadOnly Property LiveSection As DatabaseServices.ObjectId
 Возвращает
 Возвращает идентификатор объекта секущей плоскости. Тип DatabaseServices.ObjectId.
 Описание
 Свойство LiveSection представляет в базе данных идентификатор объекта активной в данный момент секущей плоскости.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.SectionManager, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!