Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotStyleTable.ApplyScaleFactor
 Послать отзыв
 Свойство ApplyScaleFactor позволяет определить, следует ли применять глобальный масштабный коэффициент к не-ISO типам линий.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool ApplyScaleFactor;
Копировать Код
Public Property ApplyScaleFactor As Boolean
 Возвращает
 Возвращает true, если глобальный масштабный коэффициент применяется к не-ISO типам линий. В противном случае возвращает false.
 Описание
 Свойство ApplyScaleFactor позволяет определить, следует ли применять глобальный масштабный коэффициент к типам линий, не соответствующим стандарту ISO.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.PlotStyleTable, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!