Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.GetGridProperty
 Послать отзыв
 Метод предназначен для получения свойств сетки ячейки, строки или столбца.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual GridPropertyParameter GetGridProperty( int row, int column, GridLineType gridLineType );
Копировать Код
Public virtual Function GetGridProperty( row As Integer, column As Integer, gridLineType As GridLineType ) As GridPropertyParameter
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс может равняться -1.
 gridLineType
 Тип линий сетки из перечисления GridLineType.
 col
 Индекс столбца, тип int. Индекс может равняться -1.
 Возвращает
 Возвращает свойств линий сетки в виде объекта GridPropertyParameter.
 Описание
 Метод предназначен для получения свойств сетки ячейки, строки или столбца.
 Чтобы указать ячейку, следует задать допустимые индексы строки и столбца. Чтобы указать строку, следует задать допустимый индекс строки и -1 в качестве индекса столбца. Чтобы указать столбец, следует задать допустимый индекс столбца и -1 в качестве индекса строки. Можно передать в метод комбинацию типов линий, объединив их с помощью оператора OR.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!