Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.EllipticalArc2d.EllipticalArc2d
 Послать отзыв
 Конструктор класса EllipticalArc2d. Создает эллипс с указанными центром, осями и радиусами.
 Синтаксис
C#
Visual Basic
Копировать Код
public EllipticalArc2d( Point2d center, Vector2d majorAxis, Vector2d minorAxis, double majorRadius, double minorRadius );
Копировать Код
Public Sub New( center As Point2d, majorAxis As Vector2d, minorAxis As Vector2d, majorRadius As Double, minorRadius As Double )
 Параметры
 Параметры
 Описание
 center
 Центр эллипса. Тип Point2d.
 majorAxis
 Большая ось эллипса. Тип Vector2d.
 minorAxis
 Малая ось эллипса. Тип Vector2d.
 majorRadius
 Большой радиус эллипса. Тип double.
 minorRadius
 Малый радиус эллипса. Тип double.
 Описание
 Конструктор класса EllipticalArc2d. Создает эллипс с указанными центром, большой и малой осями, большим и малым радиусами.
 Ссылки
 Teigha.Geometry.EllipticalArc2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!