Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.StdScaleType
 Послать отзыв
 Данное перечисление определяет список стандартных значений масштаба печати.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum StdScaleType { ScaleToFit = 0, StdScale1_2Inchis1ft = 34, StdScale1000To1 = 33, StdScale100To1 = 32, StdScale10To1 = 31, StdScale1ftIs1ft = 15, StdScale1InchIs1ft = 12, StdScale1To1 = 16, StdScale1To10 = 21, StdScale1To100 = 27, StdScale1To128InchIs1ft = 1, StdScale1To16 = 22, StdScale1To16InchIs1ft = 4, StdScale1To2 = 17, StdScale1To20 = 23, StdScale1To2InchIs1ft = 10, StdScale1To30 = 24, StdScale1To32InchIs1ft = 3, StdScale1To4 = 18, StdScale1To40 = 25, StdScale1To4InchIs1ft = 8, StdScale1To5 = 19, StdScale1To50 = 26, StdScale1To64InchIs1ft = 2, StdScale1To8 = 20, StdScale1To8InchIs1ft = 6, StdScale2To1 = 28, StdScale3InchIs1ft = 13, StdScale3To16InchIs1ft = 7, StdScale3To32InchIs1ft = 5, StdScale3To4InchIs1ft = 11, StdScale3To8InchIs1ft = 9, StdScale4To1 = 29, StdScale6InchIs1ft = 14, StdScale8To1 = 30 }
Копировать Код
Public Enum StdScaleType ScaleToFit = 0 StdScale1_2Inchis1ft = 34 StdScale1000To1 = 33 StdScale100To1 = 32 StdScale10To1 = 31 StdScale1ftIs1ft = 15 StdScale1InchIs1ft = 12 StdScale1To1 = 16 StdScale1To10 = 21 StdScale1To100 = 27 StdScale1To128InchIs1ft = 1 StdScale1To16 = 22 StdScale1To16InchIs1ft = 4 StdScale1To2 = 17 StdScale1To20 = 23 StdScale1To2InchIs1ft = 10 StdScale1To30 = 24 StdScale1To32InchIs1ft = 3 StdScale1To4 = 18 StdScale1To40 = 25 StdScale1To4InchIs1ft = 8 StdScale1To5 = 19 StdScale1To50 = 26 StdScale1To64InchIs1ft = 2 StdScale1To8 = 20 StdScale1To8InchIs1ft = 6 StdScale2To1 = 28 StdScale3InchIs1ft = 13 StdScale3To16InchIs1ft = 7 StdScale3To32InchIs1ft = 5 StdScale3To4InchIs1ft = 11 StdScale3To8InchIs1ft = 9 StdScale4To1 = 29 StdScale6InchIs1ft = 14 StdScale8To1 = 30 End Enum
 Члены
 Члены
 Описание
 ScaleToFit
 Значение: 0. Масштаб области печати подгоняется под размер формата листа.
 StdScale1To128InchIs1ft
 Значение: 1. Масштаб 1/128" = 1' в британских единицах измерения.
 StdScale1To64InchIs1ft
 Значение: 2. Стандартный масштаб 1/64" = 1' в британских единицах измерения.
 StdScale1To32InchIs1ft
 Значение: 3. Стандартный масштаб 1/32" = 1' в британских единицах измерения.
 StdScale1To16InchIs1ft
 Значение: 4. Стандартный масштаб 1/16" = 1' в британских единицах измерения.
 StdScale3To32InchIs1ft
 Значение: 5. Стандартный масштаб 3/32" = 1' в британских единицах измерения.
 StdScale1To8InchIs1ft
 Значение: 6. Стандартный масштаб 1/8" = 1' в британских единицах измерения.
 StdScale3To16InchIs1ft
 Значение: 7. Стандартный масштаб 3/16" = 1' в британских единицах измерения.
 StdScale1To4InchIs1ft
 Значение: 8. Стандартный масштаб 1/4" = 1' в британских единицах измерения.
 StdScale3To8InchIs1ft
 Значение: 9. Стандартный масштаб 3/8" = 1' в британских единицах измерения.
 StdScale1To2InchIs1ft
 Значение: 10. Стандартный масштаб 1/2" = 1' в британских единицах измерения.
 StdScale3To4InchIs1ft
 Значение: 11. Стандартный масштаб 3/4" = 1' в британских единицах измерения.
 StdScale1InchIs1ft
 Значение: 12. Стандартный масштаб 1" = 1' в британских единицах измерения.
 StdScale3InchIs1ft
 Значение: 13. Стандартный масштаб 3" = 1' в британских единицах измерения.
 StdScale6InchIs1ft
 Значение: 14. Стандартный масштаб 6" = 1' в британских единицах измерения.
 StdScale1ftIs1ft
 Значение: 15. Стандартный масштаб 1'= 1' в британских единицах измерения.
 StdScale1To1
 Значение: 16. Стандартный масштаб 1:1.
 StdScale1To2
 Значение: 17. Стандартный масштаб 1:2.
 StdScale1To4
 Значение: 18. Стандартный масштаб 1:4.
 StdScale1To5
 Значение: 19. Стандартный масштаб 1:5.
 StdScale1To8
 Значение: 20. Стандартный масштаб 1:8.
 StdScale1To10
 Значение: 21. Стандартный масштаб 1:10.
 StdScale1To16
 Значение: 22. Стандартный масштаб 1:16.
 StdScale1To20
 Значение: 23. Стандартный масштаб 1:20.
 StdScale1To30
 Значение: 24. Стандартный масштаб 1:30.
 StdScale1To40
 Значение: 25. Стандартный масштаб 1:40.
 StdScale1To50
 Значение: 26. Стандартный масштаб 1:50.
 StdScale1To100
 Значение: 27. Стандартный масштаб 1:100.
 StdScale2To1
 Значение: 28. Стандартный масштаб 2:1.
 StdScale4To1
 Значение: 29. Стандартный масштаб 4:1.
 StdScale8To1
 Значение: 30. Стандартный масштаб 8:1.
 StdScale10To1
 Значение: 31. Стандартный масштаб 10:1.
 StdScale100To1
 Значение: 32. Стандартный масштаб 100:1.
 StdScale1000To1
 Значение: 33. Стандартный масштаб 1000:1.
 StdScale1_2Inchis1ft
 Значение: 34. Стандартный масштаб 1.5" = 1' в британских единицах измерения.
 Описание
 Данное перечисление определяет список стандартных значений масштаба печати. Используется ли листом стандартный масштаб, зависит от значения свойства Teigha.PlotSettings.UseStandardScale.
 Ваши комментарии по поводу этого топика: Послать отзыв!