Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.OriginalFileVersion
 Послать отзыв
 Синтаксис
C#
Visual Basic
public DatabaseServices::DwgVersion OriginalFileVersion;
Public Property OriginalFileVersion() As DatabaseServices.DwgVersion
 Описание
 Возвращает версию, которая была при открытии файла чертежа.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!