Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MlineStyleElement.Color
 Послать отзыв
 Свойство возвращает цвет данного элемента стиля.
 Синтаксис
C#
Visual Basic
Копировать Код
public Colors.Color Color;
Копировать Код
Public ReadOnly Property Color As Colors.Color
 Возвращает
 Возвращает цвет элемента стиля. Тип Colors.Color.
 Описание
 Свойство возвращает цвет данного элемента стиля.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.MlineStyleElement, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!