Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbCurve3d.NurbCurve3d
 Послать отзыв
 Конструктор класса NurbCurve3d. Создает трехмерную NURBS кривую, которая интерполирует указанный линейный сегмент.
 Синтаксис
C#
Visual Basic
Копировать Код
public NurbCurve3d( ref LineSegment3d lineSegment );
Копировать Код
Public Sub New( ByRef lineSegment As LineSegment3d )
 Параметры
 Параметры
 Описание
 lineSegment
 Входной линейный сегмент. Тип LineSegment3d.
 Описание
 Конструктор класса NurbCurve3d. Создает трехмерную NURBS кривую, которая интерполирует указанный линейный сегмент.
 Ссылки
 Teigha.Geometry.NurbCurve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!