Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CompositeCurve3d.CompositeCurve3d
 Послать отзыв
 Конструктор класса CompositeCurve3d. Создает составную кривую из кривых в предоставленном массиве.
 Синтаксис
C#
Visual Basic
Копировать Код
public CompositeCurve3d( ref Curve3d[] curves );
Копировать Код
Public Sub New( ByRef curves As Curve3d() )
 Параметры
 Параметры
 Описание
 curves
 Массив кривых, из которых предполагается создание составной кривой. Тип Curve3d[].
 Описание
 Конструктор класса CompositeCurve3d. Создает составную кривую из кривых в предоставленном массиве.
 Замечания
 Кривые из входного массива должны быть соединены конец в конец. Это означает, что начальная точка каждой кривой в массиве (кроме первой) должна совпадать с конечной точкой предыдущей кривой в массиве. Проверка выполнения этого условия в конструкторе не предусмотрена.
 Ссылки
 Teigha.Geometry.CompositeCurve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!