Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DataTable.NumColsGrowSize
 Послать отзыв
 Свойство возвращает или позволяет задать инкремент физического количества столбцов в таблице.
 Синтаксис
C#
Visual Basic
Копировать Код
public int NumColsGrowSize;
Копировать Код
Public Property NumColsGrowSize() As Integer
 Возвращает
 Возвращает инкремент физического количества столбцов в таблице. Тип int.
 Описание
 Свойство возвращает или позволяет задать инкремент физического количества столбцов в таблице.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.DataTable, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!