Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.EllipticalArc2d.EllipticalArc2d
 Послать отзыв
 Конструктор по умолчанию класса EllipticalArc2d.
 Синтаксис
C#
Visual Basic
Копировать Код
public EllipticalArc2d();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса EllipticalArc2d создает полный эллипс с центром в начале координат (0,0), большая и малая оси которого совпадают с осями X и Y, а большой и малый радиусы равны 1. Начальное и конечное значения параметра равны нулю и 2 х PI, соответственно. Таким образом, построенный эллипс геометрически представляет собой единичную окружность с центром в начале координат.
 Ссылки
 Teigha.Geometry.EllipticalArc2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!