Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FormattedTableData.SetScale
 Послать отзыв
 Метод позволяет задать масштаб содержимого ячейки.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetScale( int row, int column, double value );
Копировать Код
Public Overridable Sub SetScale( row As Integer, column As Integer, value As Double )
 Параметры
 Параметры
 Описание
 row
 Индекс строки. Тип int. Должен быть неотрицательным и меньше количества строк в таблице.
 column
 Индекс столбца. Тип int. Должен быть неотрицательным и меньше количества столбцов в таблице.
 value
 Новый масштаб. Тип double.
 Описание
 Метод позволяет задать масштаб содержимого ячейки.
 Ссылки
 Teigha.DatabaseServices.FormattedTableData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!