Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Событие Database.XrefBeginRestore
 Послать отзыв
 Синтаксис
C#
Visual Basic
public event XrefBeginOperationEventHandler XrefBeginRestore;
Public Event XrefBeginRestore As XrefBeginOperationEventHandler
 Описание
 Событие показывает, что внешняя ссылка была ранее выгружена, и сейчас снова загружена, но ее файл не изменился.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!