Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.MoveContent
 Послать отзыв
 Данный метод перемещает элемент содержимого ячейки из одной позиции в коллекции элементов в другую позицию.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void MoveContent( int row, int column, int fromIndex, int toIndex );
Копировать Код
Public virtual Sub MoveContent( row As Integer, column As Integer, fromIndex As Integer, toIndex As Integer )
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 fromIndex
 Исходный индекс элемента содержимого ячейки, тип int. Индекс должен быть больше или равен нулю и меньше количества элементов содержимого в ячейке.
 toIndex
 Целевой индекс элемента содержимого ячейки, тип int.
 col
 Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
 Описание
 Данный метод перемещает элемент содержимого ячейки из одной позиции в коллекции элементов в другую позицию.
 Замечания
 Для получения того же результата предпочтительнее использовать Table.Cells[row,column].Contents.Move.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!