Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Extents2d.Extents2d
 Послать отзыв
 Конструктор класса Extents2d. Создает 2D ограничивающий бокс с указанными координатами минимальной и максимальной точек.
 Синтаксис
C#
Visual Basic
Копировать Код
public Extents2d( double minX, double minY, double maxX, double maxY );
Копировать Код
Public Sub New( minX As Double, minY As Double, maxX As Double, maxY As Double )
 Параметры
 Параметры
 Описание
 minX
 X-координата минимальной точки. Тип double.
 minY
 Y-координата минимальной точки. Тип double.
 maxX
 X-координата максимальной точки. Тип double.
 maxY
 Y-координата максимальной точки. Тип double.
 Описание
 Конструктор класса Extents2d. Создает 2D ограничивающий бокс с указанными координатами минимальной и максимальной точек.
 Ссылки
 Teigha.DatabaseServices.Extents2d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!