Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.RecomputeDimensionBlock
 Послать отзыв
 Метод предназначен для перевычисления размерного блока, на который ссылается данный объект Dimension, чтобы отразить любые изменения, внесенные в объект Dimension с момента последнего обновления записи таблицы блоков.
 Синтаксис
C#
Visual Basic
Копировать Код
public void RecomputeDimensionBlock( bool forceUpdate );
Копировать Код
Public Sub RecomputeDimensionBlock( forceUpdate As Boolean )
 Параметры
 Параметры
 Описание
 forceUpdate
 Флаг принудительного обновления размера. В случае значения true запись BlockTableRecord обновляется, даже если размер не был изменён. Тип bool.
 Описание
 Метод предназначен для перевычисления размерного блока, на который ссылается данный объект Dimension, чтобы отразить любые изменения, внесенные в объект Dimension с момента последнего обновления записи таблицы блоков.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!