Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.GetDataLinkRange
 Послать отзыв
 Метод позволяет получить связанный диапазон ячеек, если указанная ячейка входит в этот диапазон.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual CellRange GetDataLinkRange( int row, int column );
Копировать Код
Public virtual Function GetDataLinkRange( row As Integer, column As Integer ) As CellRange
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 col
 Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
 Возвращает
 Возвращает диапазон ячеек. Тип CellRange.
 Описание
 Метод позволяет получить связанный диапазон ячеек, если указанная ячейка является частью этого диапазона. Ячейка задается индексами строки и столбца. Указанная ячейка может быть любой ячейкой в связанном диапазоне. Метод возвратит недопустимый диапазон, если указанная ячейка не принадлежит связанному диапазону.
 Замечания
 Для получения того же результата предпочтительнее использовать метод Table.Cells[row,column].GetDataLinkRange.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!