Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DataCellCollection.Item
 Послать отзыв
 Свойство позволяет получить или задать элемент коллекции по указанному индексу.
 Синтаксис
C#
Visual Basic
Копировать Код
public DataCell this[int index] { get; set; }
Копировать Код
Default Public Property Item(index As Integer) As DataCell
 Параметры
 Параметры
 Описание
 index
 Индекс элемента коллекции. Тип int.
 Возвращает
 Возвращает элемент коллекции. Тип DataCell.
 Описание
 Свойство позволяет получить или задать элемент коллекции по указанному индексу. В случае недействительного индекса выбрасывается исключение ArgumentOutOfRangeException.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.DataCellCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!