Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocArrayPathParameters.Method
 Послать отзыв
 Свойство обеспечивает доступ к текущему методу распределения объектов вдоль траектории.
 Синтаксис
C#
Visual Basic
Копировать Код
public MethodType Method;
Копировать Код
Public Property Method() As MethodType
 Возвращает
 Возвращает метод распределения объектов вдоль траектории как значение из перечисления MethodType.
 Описание
 Свойство обеспечивает доступ к текущему методу распределения объектов вдоль траектории.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.AssocArrayPathParameters, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!