Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ObjectId.ObjectLeftOnDisk
 Послать отзыв
 Синтаксис
C#
Visual Basic
Копировать Код
public bool ObjectLeftOnDisk;
Копировать Код
Public Property ObjectLeftOnDisk() As Boolean
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.ObjectId, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!