Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SubDMesh.SetSubDMesh
 Послать отзыв
 Метод создает сеть с заданной гладкостью, используя на входе массивы вершин и граней.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetSubDMesh( ref Point3dCollection vertexArray, ref Int32Collection indexArray, int smoothLevel );
Копировать Код
Public Sub SetSubDMesh( ByRef vertexArray As Point3dCollection, ByRef indexArray As Int32Collection, smoothLevel As Integer )
 Параметры
 Параметры
 Описание
 vertexArray
 Массив вершин. Тип Point3dCollection.
 indexArray
 Массив целых чисел, описывающих грани. Тип Int32Collection.
 smoothLevel
 Степень сглаживания сети, int.
 Описание
 Метод создает сеть с заданной гладкостью, используя на входе массивы вершин и граней.
 Замечания
 Массив граней упорядочен следующим образом: первое число определяет количество вершин в грани, следующие числа - индексы вершин, образующих грань.
 Ссылки
 Teigha.DatabaseServices.SubDMesh, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!