Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ProxyObject.ProxyFlags
 Послать отзыв
 Свойство ProxyFlags представляет множество операций, допустимых для данного прокси-объекта, в виде комбинации битовых флагов.
 Синтаксис
C#
Visual Basic
Копировать Код
public int ProxyFlags;
Копировать Код
Public ReadOnly Property ProxyFlags As Integer
 Возвращает
 Возвращает комбинацию битовых флагов. Тип int.
 Описание
 Свойство ProxyFlags представляет битовые флаги редактирования для класса, связанного с данным прокси-объектом. Флаги определяют множество допустимых для этого прокси-объекта операций.
 Это свойство возвращает комбинацию следующих свойств:
 Имя
 Значение
 Описание
 kNoOperation
 0x0
 Нет разрешенных операций.
 kEraseAllowed
 0x1
 erase()
 kCloningAllowed
 0x80
 subDeepClone(), subWblockClone()
 kAllButCloningAllowed
 0x1
 erase()
 kAllAllowedBits
 0x81
 erase(), subDeepClone(), subWblockClone()
 kMergeIgnore
 0x00
 Сохранять исходные имена.
 kMergeReplace
 0x100
 Использовать клон.
 kMergeMangleName
 0x200
 Создавать анонимные иена.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.ProxyObject, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!