Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CircularArc3d.Set
 Послать отзыв
 Метод переопределяет дугу так, чтобы она имела заданный радиус и касалась двух указанных кривых.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Set( ref Curve3d curve1, ref Curve3d curve2, double radius, double param1, double param2 );
Копировать Код
Public Sub Set( ByRef curve1 As Curve3d, ByRef curve2 As Curve3d, radius As Double, param1 As Double, param2 As Double )
 Параметры
 Параметры
 Описание
 curve1
 Первая 3D-кривая, задающая условие касательности дуги. Тип Curve3d.
 curve2
 Вторая 3D-кривая, задающая условие касательности дуги. Тип Curve3d.
 radius
 Радиус дуги. Тип double.
 param1
 Возвращает параметр, соответствующий точке касания на кривой curve1. Тип double.
 param2
 Возвращает параметр, соответствующий точке касания на кривой curve2. Тип double.
 Описание
 Метод переопределяет дугу так, чтобы она имела заданный радиус и касалась двух указанных кривых.
 Замечания
 Если новую дугу с указанными параметрами построить невозможно, данная дуга остается без изменений. Кривые curve1 и curve2 должны быть компланарными.
 Ссылки
 Teigha.Geometry.CircularArc3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!