Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Section.Height
 Послать отзыв
 Метод предназначен для вычисления высоты секущей плоскости для указанного типа высоты.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Height( SectionHeight nHeightType );
Копировать Код
Public Function Height( nHeightType As SectionHeight ) As Double
 Параметры
 Параметры
 Описание
 nHeightType
 Задает тип вычисляемой высоты (выше или ниже линии сечения). Перечисление SectionHeight.
 Возвращает
 Возвращает вычисленное значение высоты. Тип double.
 Описание
 Метод предназначен для вычисления высоты секущей плоскости для указанного типа высоты (выше или ниже линии сечения).
 Если типом секущей плоскости является плоскость или граница, возвращаемая высота является высотой индикатора секущей плоскости (или границы). Если типом секущей плоскости является объем, возвращается высота разреза.
 Ссылки
 Teigha.DatabaseServices.Section, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!