Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.AugmentedPolylineCurve3d.AugmentedPolylineCurve3d
 Послать отзыв
 Конструктор класса AugmentedPolylineCurve3d. Создает трехмерную полилинию с заданным вектором в каждой управляющей вершине.
 Синтаксис
C#
Visual Basic
Копировать Код
public AugmentedPolylineCurve3d( ref Point3dCollection controlPoints, ref Vector3dCollection vectorBundle );
Копировать Код
Public Sub New( ByRef controlPoints As Point3dCollection, ByRef vectorBundle As Vector3dCollection )
 Параметры
 Параметры
 Описание
 controlPoints
 Входной массив 3D управляющих вершин. Тип Point3dCollection.
 vectorBundle
 Массив 3D-векторов для вершин полилинии. Тип Vector3dCollection.
 Описание
 Конструктор класса AugmentedPolylineCurve3d. Создает трехмерную полилинию с заданным вектором в каждой управляющей вершине.
 Ссылки
 Teigha.Geometry.AugmentedPolylineCurve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!