Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbSurface.NumKnotsInV
 Послать отзыв
 Свойство NumKnotsInV представляет количество управляющих вершин в направлении V.
 Синтаксис
C#
Visual Basic
Копировать Код
public int NumKnotsInV;
Копировать Код
Public ReadOnly Property NumKnotsInV As Integer
 Возвращает
 Возвращает количество управляющих вершин в направлении V. Тип int.
 Описание
 Свойство NumKnotsInV представляет количество управляющих вершин в направлении V.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.NurbSurface, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!