Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DgnUnderlayItem.SetShowRasterRef
 Послать отзыв
 Свойство позволяет задать режим отображения растровых изображений в файлах DGN, на которые имеются ссылки.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool SetShowRasterRef;
Копировать Код
Public Property SetShowRasterRef() As Boolean
 Возвращает
 Возвращает true, если растровые изображения в файлах DGN должны отображаться. В противном случае возвращает false.
 Описание
 Свойство позволяет задать режим отображения растровых изображений в файлах DGN, на которые имеются ссылки.
 Условия
 Только запись.
 Ссылки
 Teigha.DatabaseServices.DgnUnderlayItem, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!