Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocAction.IsExternalDependency
 Послать отзыв
 Метод позволяет проверить, является ли входная зависимость AssocDependency, принадлежащая данному действию, внешней по отношению к этому действию.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsExternalDependency( ref AssocDependency dependency );
Копировать Код
Public Function IsExternalDependency( ByRef dependency As AssocDependency ) As Boolean
 Параметры
 Параметры
 Описание
 dependency
 Входная зависимость. Тип AssocDependency.
 Возвращает
 Возвращает true, если входная зависимость оказывается внешней по отношению к данному действию. В противном случае возвращает false.
 Описание
 Метод проверяет, является ли входная зависимость AssocDependency, принадлежащая данному действию, внешней по отношению к этому действию, т.е. зависит ли она от DBObject, который не является этим действием и не принадлежит этому действию (когда действие является сетью). Кроме того, зависимость, которая не зависит ни от какого объекта, считается внешней.
 Если действию принадлежит объект AssocActionBody с переопределенным предикатом IsExternalDependencyOverride(), вместо реализации по умолчанию вызывается именно этот переопределенный предикат.
 Ссылки
 Teigha.DatabaseServices.AssocAction, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!