Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.ClipBoundary2dData.ClippedSegmentSourceLabel
 Послать отзыв
 Свойство ClippedSegmentSourceLabel представляет исходную метку обрезанного сегмента.
 Синтаксис
C#
Visual Basic
Копировать Код
public IntegerCollection ClippedSegmentSourceLabel;
Копировать Код
Public ReadOnly Property ClippedSegmentSourceLabel As IntegerCollection
 Возвращает
 Возвращает исходную метку обрезанного сегмента. Тип IntegerCollection.
 Описание
 Свойство ClippedSegmentSourceLabel представляет исходную метку обрезанного сегмента.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.ClipBoundary2dData, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!