Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.KnotCollection.StartParameter
 Послать отзыв
 Свойство StartParameter представляет параметр в начальном узле коллекции.
 Синтаксис
C#
Visual Basic
Копировать Код
public double StartParameter;
Копировать Код
Public ReadOnly Property StartParameter As Double
 Возвращает
 Возвращает параметр в начальном узле коллекции. Тип double.
 Описание
 Свойство StartParameter представляет параметр в начальном узле коллекции.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.KnotCollection, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!