Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve3dCollection.Add
 Послать отзыв
 Метод добавляет в данную коллекцию новую кривую Curve3d.
 Синтаксис
C#
Visual Basic
Копировать Код
public int Add( ref Curve3d value );
Копировать Код
Public Function Add( ByRef value As Curve3d ) As Integer
 Параметры
 Параметры
 Описание
 value
 Входная кривая, которая добавляется в коллекцию. Тип Curve3d.
 Возвращает
 Возвращает индекс добавленной кривой в данной коллекции. Тип int.
 Описание
 Метод добавляет в данную коллекцию новую кривую Curve3d.
 Ссылки
 Teigha.Geometry.Curve3dCollection, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!