Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Database.GetSupportedSaveVersions
 Послать отзыв
 Синтаксис
C#
Visual Basic
public array<DwgVersion> GetSupportedSaveVersions();
Public Function GetSupportedSaveVersions() As array<DwgVersion>
 Описание
 Возвращает массив мажорных и минорных версий, для которых возможно сохранение.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!