Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FullDwgVersion.FullDwgVersion
 Послать отзыв
 Конструктор класса FullDwgVersion. Создает объект с заданными настройками версии (major/minor).
 Синтаксис
C#
Visual Basic
Копировать Код
public FullDwgVersion( DwgVersion majorVersion, MaintenanceReleaseVersion minorVersion );
Копировать Код
Public Sub New( majorVersion As DwgVersion, minorVersion As MaintenanceReleaseVersion )
 Параметры
 Параметры
 Описание
 majorVersion
 Основная версия DWG. Значение из перечисления DwgVersion.
 minorVersion
 Второстепенная версия. Значение из перечисления MaintenanceReleaseVersion.
 Описание
 Конструктор класса FullDwgVersion. Создает объект с заданными настройками версии (major/minor).
 Ссылки
 Teigha.DatabaseServices.FullDwgVersion, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!