Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.IdMapping.Contains
 Послать отзыв
 Метод позволяет проверить, содержится ли в данном объекте IdMapping объект IdPair с указанным ключом.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool Contains( ObjectId key );
Копировать Код
Public Function Contains( key As ObjectId ) As Boolean
 Параметры
 Параметры
 Описание
 key
 Идентификатор исходного объекта как ключ для поиска объекта IdPair. Тип ObjectId.
 Возвращает
 Возвращает true, если объект IdPair с указанным ключом найден. В противном случае возвращает false.
 Описание
 Метод позволяет проверить, содержится ли в данном объекте IdMapping объект IdPair с указанным ключом.
 Ссылки
 Teigha.DatabaseServices.IdMapping, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!