Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CellRange.IsFormatEditable
 Послать отзыв
 Свойство позволяет проверить, возможно ли изменять формат ячеек данного диапазона.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool? IsFormatEditable;
Копировать Код
Public ReadOnly Property IsFormatEditable As Boolean?
 Возвращает
 Возвращает true, если формат ячеек диапазона можно редактировать. В противном случае возвращает false.
 Описание
 Свойство позволяет проверить, возможно ли изменять формат ячеек данного диапазона.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.CellRange, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!