Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Hatch.PatternType
 Послать отзыв
 Синтаксис
C#
Visual Basic
public DatabaseServices::HatchPatternType PatternType;
Public Property PatternType() As DatabaseServices.HatchPatternType
 Описание
 Возвращает тип образца как элемент перечислений UserDefined, PreDefined или CustomDefined для объекта заливки.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.Hatch, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!