Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Unit
 Послать отзыв
 Данное перечисление определяет реальные единицы измерения длины в пространстве модели, представляющие одну единицу чертежа nanoCAD.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum Unit { Angstroms = 11, Astronomical = 18, Centimeter = 2, Decimeters = 14, Dekameters = 15, Foot = 6, GigaMeters = 17, Hectometers = 16, Inch = 5, Kilometer = 4, LightYears = 19, Meter = 3, Microinches = 9, Microns = 13, Mile = 8, Millimeter = 1, Mils = 10, Nanometers = 12, None = 0, Parsecs = 20, Yard = 7 }
Копировать Код
Public Enum Unit Angstroms = 11 Astronomical = 18 Centimeter = 2 Decimeters = 14 Dekameters = 15 Foot = 6 GigaMeters = 17 Hectometers = 16 Inch = 5 Kilometer = 4 LightYears = 19 Meter = 3 Microinches = 9 Microns = 13 Mile = 8 Millimeter = 1 Mils = 10 Nanometers = 12 None = 0 Parsecs = 20 Yard = 7 End Enum
 Члены
 Члены
 Описание
 Angstroms
 Значение: 11. Единица измерения - ангстрем, равный одной десятимиллиардной метра.
 Astronomical
 Значение: 18. Астрономическая единица. Астрономическая единица, используемая для измерения расстояний в астрономии. 1 а.е. точно равна 149 597 870 700 м (среднее расстояние от Земли до Солнца).
 Centimeter
 Значение: 2. Единица измерения - сантиметр, 1 см = 0.01 м.
 Decimeters
 Значение: 14. Единица измерения - дециметр, равный одной десятой метра.
 Dekameters
 Значение: 15. Единица измерения - декаметр, равный 10 метрам.
 Foot
 Значение: 6. Британская единица измерения - фут.
 GigaMeters
 Значение: 17. Единица измерения - гигаметр, равный 10^9 метров.
 Hectometers
 Значение: 16. Единица измерения - гектометр, равный 100 метрам.
 Inch
 Значение: 5. Британская единица измерения - дюйм.
 Kilometer
 Значение: 4. Единица измерения - километр, 1 км = 1000 м.
 LightYears
 Значение: 19. Единица измерения - cветовой год, внесистемная единица измерения расстояний в астрономии. Равна расстоянию, которое электромагнитные волны (свет) проходят в вакууме, не испытывая влияния гравитационных полей, за один юлианский год. Составляет примерно 9.46?10^15 м.
 Meter
 Значение: 3. Единица измерения системы СИ - метр.
 Microinches
 Значение: 9. Британская единица измерения - микродюйм, равный одной миллионной дюйма.
 Microns
 Значение: 13. Единица измерения - микрон, равный одной миллионной метра.
 Mile
 Значение: 8. Британская единица измерения - миля, равная примерно 1609 м.
 Millimeter
 Значение: 1. Единица измерения - миллиметр, 1 мм = 0.001 м.
 Mils
 Значение: 10. Британская единица измерения - мил, равный одной тысячной дюйма.
 Nanometers
 Значение: 12. Единица измерения - нанометр, равный одной миллиардной метра.
 None
 Значение: 0. Единица измерения не определена.
 Parsecs
 Значение: 20. Единица измерения - парсек, внесистемная единица измерения расстояний в астрономии. 1 пк примерно равен 3,086x10^16 м.
 Yard
 Значение: 7. Британская единица измерения - ярд, что составляет около 0.91 метра.
 Описание
 Данное перечисление определяет реальные единицы измерения длины в пространстве модели, представляющие одну единицу чертежа nanoCAD.
 Ваши комментарии по поводу этого топика: Послать отзыв!