Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MText.CorrectSpelling
 Послать отзыв
 Метод предназначен для проверки орфографии с целью исправления орфографических ошибок. В текущей версии не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public int CorrectSpelling();
Копировать Код
Public Function CorrectSpelling() As Integer
 Возвращает
 Возвращает 0 в случае успешного завершения. В противном случае возвращает 1. Тип int.
 Описание
 Метод предназначен для проверки орфографии с целью исправления орфографических ошибок. В случае успешного завершения должен возвращать 0 и 1 в противном случае. В текущей версии не реализован и всегда возвращает 0.
 Ссылки
 Teigha.DatabaseServices.MText, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!