Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.ExternalCurve3d.IsRay
 Послать отзыв
 Свойство IsRay позволяет проверить, представляет ли данный объект луч.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsRay;
Копировать Код
Public ReadOnly Property IsRay As Boolean
 Возвращает
 Возвращает true, если данный объект представляет луч. В противном случае возвращает false.
 Описание
 Свойство IsRay позволяет проверить, представляет ли данный объект луч.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.ExternalCurve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!