Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Curve.SetFromGeCurve
 Послать отзыв
 Метод копирует в текущую кривую Curve параметры заданной кривой Curve3d.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetFromGeCurve( ref Curve3d geCurve );
Копировать Код
Public Function SetFromGeCurve( ByRef geCurve As Curve3d )
 Параметры
 Параметры
 Описание
 geCurve
 Исходная кривая типа Curve3d.
 Описание
 Метод копирует в текущую кривую Curve параметры заданной кривой Curve3d.
 Ссылки
 Teigha.DatabaseServices.Curve, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!