Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GraphNode.NumIn
 Послать отзыв
 Свойство возвращает количество входящих ссылок в данном узле.
 Синтаксис
C#
Visual Basic
Копировать Код
public int NumIn;
Копировать Код
Public ReadOnly Property NumIn As Integer
 Возвращает
 Возвращает количество входящих ссылок. Тип int.
 Описание
 Свойство возвращает количество входящих ссылок в данном узле.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.GraphNode, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!