Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.BoundBlock3d.BasePoint
 Послать отзыв
 Свойство BasePoint предоставляет доступ к базовой точке данной граничной рамки.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d BasePoint;
Копировать Код
Public ReadOnly Property BasePoint As Point3d
 Возвращает
 Возвращает базовую точку данной граничной рамки. Тип Point3d.
 Описание
 Свойство BasePoint предоставляет доступ к базовой точке данной граничной рамки.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.BoundBlock3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!