Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.SetTextStyle
 Послать отзыв
 Метод обеспечивает использование объектом Table заданной записи TextStyleTableRecord для указанной ячейки.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetTextStyle( int row, int col, DatabaseServices.ObjectId id );
Копировать Код
Public virtual Sub SetTextStyle( row As Integer, col As Integer, id As DatabaseServices.ObjectId )
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 col
 Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
 id
 Идентификатор записи TextStyleTableRecord, представляющей текстовый стиль. Тип DatabaseServices.ObjectId.
 Описание
 Метод обеспечивает использование объектом Table заданной записи TextStyleTableRecord для указанной ячейки.
 Замечания
 Для получения того же результата предпочтительнее использовать Table.Cells[row,column].TextStyleId.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!