Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AuditInfo.PrintError
 Послать отзыв
 Метод уведомления, вызываемый для печати информации из журнала об обнаруженных или исправленных ошибках.
 Синтаксис
C#
Visual Basic
Копировать Код
public void PrintError( ref String name, ref String value, ref String validation, ref String defaultValue );
Копировать Код
Public Sub PrintError( ByRef name As String, ByRef value As String, ByRef validation As String, ByRef defaultValue As String )
 Параметры
 Параметры
 Описание
 name
 Входная строка, описывающая тип найденных ошибочных данных. Тип String.
 value
 Входное ошибочное значение. Тип String.
 validation
 Входное описание причины, по которой данные рассматриваются как ошибочные. Тип String.
 defaultValue
 Устанавливаемое значение по умолчанию. Тип String.
 Описание
 Метод уведомления, вызываемый для печати информации из журнала об обнаруженных или исправленных ошибках.
 Ссылки
 Teigha.DatabaseServices.AuditInfo, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!