Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ObjectId
 Послать отзыв
 ObjectId хранит единственный неизменный в пределах сеанса локатор для резидентного объекта базы данных.
 Иерархия классов
Teigha::DatabaseServices::ObjectId
 Синтаксис
C#
Visual Basic
Копировать Код
[StructLayout(LayoutKind.Sequential),Wrapper("OdDbObjectId")] public class ObjectId;
Копировать Код
<StructLayout(LayoutKind.Sequential),Wrapper("OdDbObjectId")> Public Class ObjectId
 Описание
 Механизм работы с находящимися в памяти резидентными объектами базы данных состоит из двух частей.
 Первая – это сам резидентный объект базы данных, который находится в памяти и может быть выгружен на диск, если необходимо высвободить память. Вторая часть – это объект-заглушка, который всегда находится в памяти и играет роль точки доступа к соответствующему резидентному объекту базы данных.
 Когда некоторый объект (object / entity) впервые добавляется в базу данных, создается новый объект-заглушка с указателем на добавляемый в базу данных объект. Адрес в памяти этой заглушки и является значением ObjectId для добавляемого в базу данных объекта. Этот же механизм применяется, когда база данных считывается в память с диска.
 При открытии резидентного объекта базы данных приложение видит, что в открывающий вызов передается ObjectId резидентного объекта базы данных и возвращается указатель на реальный резидентный объект базы данных. В действительности ObjectId является просто адресом заглушки в памяти, обращение к которой необходимо лишь для получения указателя на реальный резидентный объект базы данных. Когда выгруженный на диск резидентный объект базы данных подгружается обратно в память, то возвращается уже его новый адрес.
 Как таковой, объект ObjectId служит контейнером для адреса заглушки резидентного объекта базы данных. Это чрезвычайно важный объект, поскольку он хранит единственный неизменный в пределах сеанса локатор для резидентного объекта базы данных.
 Замечания
 В файловых операциях, когда это возможно, следует использовать ObjectId пользовательских объектов и примитивов, поскольку при вводе/выводе идентификаторы объектов автоматически транслируются в дескрипторы объектов (handle), благодаря чему от сеанса к сеансу всегда идентифицируют один и тот же объект или примитив. При файловых операциях с ObjectId объектов рекомендуется использовать для них правильный подтип (HardPointerId, SoftOwnershipId и т.д.) с тем, чтобы внутренние механизмы обрабатывали их корректно.
 Если требуется сохранить идентификатор объекта во внешнем файле (то есть не в файле DWG или DXF), идентификаторы ObjectId объектов использовать нельзя. Фактическое значение ObjectId (его адрес в памяти) в разных сеансах отличается. В этом случае вам следует сохранять не ObjectId объекта, а его дескриптор (handle). Если вы работаете сразу с несколькими DWG файлами, то необходимо сохранять не только дескриптор, но и имя файла чертежа, поскольку значения дескрипторов уникальны лишь в пределах одного чертежа.
 Если, имея дескриптор, необходимо получить ObjectId соответствующего объекта, используйте функцию Database.GetObjectId().
 И наоборот, если, имея идентификатор объекта, требуется получить дескриптор этого объекта, следует открыть объект и воспользоваться его свойством DBObject.Handle.
 Методы
 Конструкторы
 Имя
 Описание
 ObjectId
 Конструктор создает экземпляр ObjectId на основе целочисленного указателя в старом формате.
 Топики
 Имя
 Описание
 ObjectId Методы
 Ниже перечислены методы класса ObjectId.
 ObjectId Операторы
 Ниже перечислены операторы класса ObjectId.
 ObjectId Свойства
 Ниже перечислены свойства класса ObjectId.
 Ссылки
 ObjectId Методы, ObjectId Операторы, ObjectId Свойства, Методы, Топики, ObjectId Методы, ObjectId Операторы, ObjectId Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!