Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Database.GetObjectId
 Послать отзыв
 Синтаксис
C#
Visual Basic
public ObjectId GetObjectId(bool createIfNotFound, Handle objHandle, int identifier);
Public Function GetObjectId(createIfNotFound As bool, objHandle As Handle, identifier As Integer) As ObjectId
 Параметры
 Параметры
 Описание
 createIfNotFound
 Признак того, нужно ли создавать объект заглушки, если дескриптор не найден
 objHandle
 Дескриптор объекта, который должен быть найден в базе данных
 identifier
 Предназначен для использования в будущем
 Описание
 Возвращает Id объекта, дескриптор которого содержится в objHandle. Если параметр createIfNotFound установлен в true, и дескриптор не найден в базе данных, будет создан объект заглушки (stub) ObjectID, используя указанный дескриптор.
 Параметр createIfNotFound должен быть установлен в false.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!