Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbCurve2dFitData.EndTangent
 Послать отзыв
 Свойство EndTangent представляет направление касательной в конечной точке кривой.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector2d EndTangent;
Копировать Код
Public ReadOnly Property EndTangent As Vector2d
 Возвращает
 Возвращает касательный вектор в последней точке кривой. Тип Vector2d.
 Описание
 Свойство EndTangent представляет направление касательной в конечной точке кривой.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.NurbCurve2dFitData, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!