Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Hatch.LoopTypeAt
 Послать отзыв
 Синтаксис
C#
Visual Basic
public HatchLoopTypes LoopTypeAt(int loopIndex);
Public Function LoopTypeAt(loopIndex As Integer) As HatchLoopTypes
 Параметры
 Параметры
 Описание
 loopIndex
 Индекс выбранной петли
 Описание
 Метод возвращает тип петли выбранной петли контура из геометрического объекта.
 Ссылки
 Teigha.DatabaseServices.Hatch, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!