Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.OriginalFileSavedByVersion
 Послать отзыв
 Синтаксис
C#
Visual Basic
public DatabaseServices::DwgVersion OriginalFileSavedByVersion;
Public Property OriginalFileSavedByVersion() As DatabaseServices.DwgVersion
 Описание
 Возвращает версию, в которой был последний раз сохранен файл чертежа, не считая текущую сессию.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!