Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FileDependencyManager.UpdateEntry
 Послать отзыв
 Метод обновляет запись с указанным индексом в разделе .dwg списка файловых зависимостей.
 Синтаксис
C#
Visual Basic
Копировать Код
public void UpdateEntry( int index );
Копировать Код
Public Sub UpdateEntry( index As Integer )
 Параметры
 Параметры
 Описание
 index
 Входной индекс записи. Тип int.
 Описание
 Метод обновляет запись с указанным индексом в разделе .dwg списка файловых зависимостей.
 Замечания
 Этот метод переопределяет заново значения полей mIsModified, mTimestamp и mFileSize записи.
 Ссылки
 Teigha.DatabaseServices.FileDependencyManager, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!