Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DataTable.GetColumnAt
 Послать отзыв
 Метод позволяет получить столбец DataColumn по его индексу в данной таблице DataTable.
 Синтаксис
C#
Visual Basic
Копировать Код
public DataColumn GetColumnAt( int index );
Копировать Код
Public Function GetColumnAt( index As Integer ) As DataColumn
 Параметры
 Параметры
 Описание
 index
 Индекс столбца. Тип int.
 Возвращает
 Возвращает столбец в заданной позиции index. Тип DataColumn. В случае недействительного индекса происходит завершение работы приложения, сопровождаемое сообщением 'Operation is not valid due to the current state of the object.' (Текущее состояние объекта не позволяет выполнить операцию).
 Описание
 Метод позволяет получить столбец DataColumn по его индексу в данной таблице DataTable.
 Ссылки
 Teigha.DatabaseServices.DataTable, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!