Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.TextAlignmentType
 Послать отзыв
 Данное перечисление определяет варианты выравнивания многострочного текста.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum TextAlignmentType { CenterAlignment = 1, LeftAlignment = 0, RightAlignment = 2 }
Копировать Код
Public Enum TextAlignmentType CenterAlignment = 1 LeftAlignment = 0 RightAlignment = 2 End Enum
 Члены
 Члены
 Описание
 LeftAlignment
 Значение: 0. Текст выравнивается по левому краю.
 CenterAlignment
 Значение: 1. Текст центрируется.
 RightAlignment
 Значение: 2. Текст выравнивается по правому краю.
 Описание
 Данное перечисление определяет варианты выравнивания многострочного текста.
 Ваши комментарии по поводу этого топика: Послать отзыв!