Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PolygonMesh.MakeMOpen
 Послать отзыв
 Метод делает сеть PolygonMesh незамкнутой в направлении М.
 Синтаксис
C#
Visual Basic
Копировать Код
public void MakeMOpen();
Копировать Код
Public Sub MakeMOpen()
 Описание
 Метод делает сеть PolygonMesh незамкнутой в направлении М. Это означает, что сеть будет иметь разрыв между последней и первой строками.
 Ссылки
 Teigha.DatabaseServices.PolygonMesh, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!