Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FileOpenMode
 Послать отзыв
 Перечисление FileOpenMode определяет поддерживаемые режимы открытия резидентных объектов базы данных.
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdDbDatabase.OpenMode")] public enum FileOpenMode { OpenForReadAndReadShare = 1, OpenForReadAndWriteNoShare = 2, OpenForReadAndAllShare = 3, OpenTryForReadShare = 4 }
Копировать Код
<Wrapper("OdDbDatabase.OpenMode")> Public Enum FileOpenMode OpenForReadAndReadShare = 1 OpenForReadAndWriteNoShare = 2 OpenForReadAndAllShare = 3 OpenTryForReadShare = 4 End Enum
 Члены
 Члены
 Описание
 OpenForReadAndReadShare
 Значение: 1. Файл открывается на чтение и разрешается совместный доступ на чтение. Использование метода Database.ReadDwgFile() в этом режиме исключает возможность записи в файл другими приложениями. В случае, когда файл уже был открыт на запись другим приложением, обращение к методу Database.ReadDwgFile() завершится ошибкой.
 OpenForReadAndWriteNoShare
 Значение: 2. Файл открывается на чтение и запись, но совместный доступ к файлу не разрешается. Использование метода Database.ReadDwgFile() в этом режиме исключает возможность выполнять операции чтения и записи в файл другими приложениями. Вызов метода Database.ReadDwgFile() в этом режиме завершается ошибкой, если на этот момент файл уже открыт каким-либо другим приложением, либо доступ к файлу разрешен только на чтение.
 OpenForReadAndAllShare
 Значение: 3. Файл открывается на чтение, и разрешён совместный доступ к файлу на чтение и запись. Вызов метода Database.ReadDwgFile() в этом режиме допускает полный доступ к файлу других приложений. Это позволяет открыть на чтение файл, который уже открыт на запись другим приложением. Кроме того, вызов метода Database.ReadDwgFile() в этом режиме не блокирует другим приложениям возможность записи в этот файл.
 OpenTryForReadShare
 Значение: 4. Базе данных предписывается открыть файл в режиме ForReadAndReadShare, а если эта попытка не удалась, попытаться открыть файл в режиме ForReadAndAllShare.
 Описание
 Перечисление FileOpenMode определяет поддерживаемые режимы открытия резидентных объектов базы данных.
 Ваши комментарии по поводу этого топика: Послать отзыв!