Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CompoundObjectId.=
 Послать отзыв
 Оператор присвоения для объекта CompoundObjectId. Входной объект имеет тип CompoundObjectId.
 Синтаксис
C#
Visual Basic
Копировать Код
public CompoundObjectId operator =( ref CompoundObjectId A_0 );
Копировать Код
Public Operator =( ByRef A_0 As CompoundObjectId )
 Параметры
 Параметры
 Описание
 A_0
 Входной объект. Тип CompoundObjectId.
 Описание
 Оператор присвоения для объекта CompoundObjectId. Входной объект имеет тип CompoundObjectId.
 Ссылки
 Teigha.DatabaseServices.CompoundObjectId, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!