Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CurveBoundary
 Послать отзыв
 Класс CurveBoundary представляет геометрию криволинейных границ на ограниченной поверхности.
 Иерархия классов
Teigha::Geometry::CurveBoundary
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdGeCurveBoundary")] public sealed class CurveBoundary : DisposableWrapper, ICloneable
Копировать Код
<Wrapper("OdGeCurveBoundary")> Public NotInheritable Class CurveBoundary Inherits DisposableWrapper Implements ICloneable
 Описание
 Класс CurveBoundary представляет геометрию криволинейных границ (граничные циклы граней) на ограниченной поверхности.
 Каждый граничный цикл описывается четырьмя массивами:
массив 3D-кривых и/или указателей 3D-позиций;
массив указателей 2D-кривых в пространстве параметров;
логический массив, описывающий логическую ориентацию для каждой 3D-кривой;
логический массив, описывающий логическую ориентацию для каждой 2D-кривой в пространстве параметров.
 В совокупности эти четыре массива представляют массив ориентированных пространственных 3D-кривых (и/или 3D-позиций) и массив ориентированных кривых в пространстве параметров. Между элементами этих массивов существует взаимно однозначное соответствие, при этом некоторые элементы того или иного массива могут быть нулевыми или нерелевантными.
 Например, 4-кортеж (curve3d, NULL, False, True) представляет допустимый экземпляр этого класса. Первый элемент кортежа определяет пространственную 3D-кривую. Нулевое значение второго элемента кортежа свидетельствует о том, что связанной 2D-кривой в пространстве параметров не существует. Третий элемент кортежа показывает, что логическое направление пространственной 3D-кривой противоположно параметрическому направлению кривой. Поскольку кривой в пространстве параметров нет, последний элемент кортежа нерелевантен (в случае существования кривой в пространстве параметров четвертый элемент кортежа представлял бы логическое направление этой кривой).
 Случаи вырождения циклов представляются следующим образом.
Весь цикл выродился в одну точку в пространстве модели, представленную кортежем (numElements = 1, position3d, curve2d).
 Кривая curve2d может быть нулевой. Ребро и 2D-кривая в пространстве параметров теряют смысл. Подобные состояния цикла выявляет свойство CurveBoundary.isDegenerate.
В цикле имеется одно или несколько вырожденных ребер, представленных позициями соответствующих точек position3d.
 В общем случае описание геометрии граничной кривой в пространстве модели может включать указатели curve3d и/или position3d. Соответственно, пользователю эта геометрия предоставляется в виде указателей на объекты Entity3d. Вырожденность составляющих проверяется по типу геометрии подобъекта в пространстве модели.
 Данный класс поддерживает владение своей геометрией. При уничтожении экземпляра класса, являющегося владельцем своей геометрии, эта геометрия будет удалена.
 Методы
 Конструкторы
 Имя
 Описание
 CurveBoundary
 Это обзор перегрузок CurveBoundary.
 Топики
 Имя
 Описание
 CurveBoundary Методы
 Ниже перечислены методы класса CurveBoundary.
 CurveBoundary Свойства
 Ниже перечислены свойства класса CurveBoundary.
 Ссылки
 CurveBoundary Конструктор, CurveBoundary Методы, CurveBoundary Свойства, Методы, Топики, CurveBoundary Методы, CurveBoundary Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!