Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SubDMesh.FaceArray
 Послать отзыв
 Свойство предоставляет доступ к массиву индексов граней базового уровня сети.
 Синтаксис
C#
Visual Basic
Копировать Код
public Int32Collection FaceArray;
Копировать Код
Public Property FaceArray() As Int32Collection
 Возвращает
 Возвращает массив индексов граней, тип Int32Collection.
 Описание
 Свойство предоставляет доступ к массиву индексов граней базового уровня сети.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.SubDMesh, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!