Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LayerStateManager.LayerStateDeleted
 Послать отзыв
 Событие завершения удаления состояния слоя.
 Синтаксис
C#
Visual Basic
Копировать Код
public event LayerStateDeletedEventHandler LayerStateDeleted;
Копировать Код
Public Event LayerStateDeleted As LayerStateDeletedEventHandler
 Описание
 Событие завершения удаления состояния слоя.
 Ссылки
 Teigha.DatabaseServices.LayerStateManager, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!