Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.GetCellStyle
 Послать отзыв
 Метод позволяет выяснить стиль ячейки, заданной индексами строки или столбца.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual String GetCellStyle( int row, int column );
Копировать Код
Public virtual Function GetCellStyle( row As Integer, column As Integer ) As String
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 col
 Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
 Возвращает
 Возвращает наименование стиля ячейки, тип String.
 Описание
 Метод позволяет выяснить стиль ячейки, заданной индексами строки или столбца.
 Замечания
 Для получения того же результата предпочтительнее использовать Table.Cells[row,column].Style.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!