Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Polyline2d.LinetypeGenerationOn
 Послать отзыв
 Свойство определяет, включена ли для данной полилинии генерация типа линии.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool LinetypeGenerationOn;
Копировать Код
Public Property LinetypeGenerationOn() As Boolean
 Возвращает
 Возвращает true, если генерация типа линии включена, и false, если отключена.
 Описание
 Свойство определяет, включена ли для данной полилинии генерация типа линии.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Polyline2d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!