Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Point3d.ToString
 Послать отзыв
 Метод позволяет получить эквивалентное строковое представление данного объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public String ToString();
Копировать Код
Public Function ToString() As String
 Возвращает
 Возвращает представление данного объекта в виде строки. Тип String.
 Описание
 Метод позволяет получить эквивалентное строковое представление данного объекта.
 Ссылки
 Teigha.Geometry.Point3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!