Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DataLinkManager
 Послать отзыв
 Класс предназначен для управления внешними ссылками в базе данных.
 Иерархия классов
Teigha::DatabaseServices::DataLinkManager
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("AcDbDataLinkManager")] public class DataLinkManager : RXObject;
Копировать Код
<Wrapper("AcDbDataLinkManager")> Public Class DataLinkManager Inherits RXObject
 Описание
 Класс предназначен для управления внешними ссылками в базе данных.
 Методы
 Конструкторы
 ПоказатьInternal
 Нет совпадений по текущему фильтру
 Имя
 Описание
 DataLinkManager
 This is DataLinkManager, a member of class DataLinkManager.
 Топики
 Имя
 Описание
 DataLinkManager Методы
 Ниже перечислены методы класса DataLinkManager.
 DataLinkManager Свойства
 Ниже перечислены свойства класса DataLinkManager.
 Ссылки
 DataLinkManager Методы, DataLinkManager Свойства, Методы, Топики, DataLinkManager Методы, DataLinkManager Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!