Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Poly2dType
 Послать отзыв
 Перечисление Poly2dType определяет поддерживаемые типы 2D-полилиний.
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdDb.Poly2dType")] public enum Poly2dType { SimplePoly = 0, FitCurvePoly = 1, QuadSplinePoly = 2, CubicSplinePoly = 3 }
Копировать Код
<Wrapper("OdDb.Poly2dType")> Public Enum Poly2dType SimplePoly = 0 FitCurvePoly = 1 QuadSplinePoly = 2 CubicSplinePoly = 3 End Enum
 Члены
 Члены
 Описание
 SimplePoly
 Значение: 0. Простая полилиния.
 FitCurvePoly
 Значение: 1. Полилиния, аппроксимирующая кривую.
 QuadSplinePoly
 Значение: 2. Полилиния, аппроксимирующая кривую квадратичным B-сплайном.
 CubicSplinePoly
 Значение: 3. Полилиния, аппроксимирующая кривую кубическим B-сплайном.
 Описание
 Перечисление Poly2dType определяет поддерживаемые типы 2D-полилиний.
 Ваши комментарии по поводу этого топика: Послать отзыв!