Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CellRange.IsSingleCell
 Послать отзыв
 Свойство позволяет проверить, состоит ли диапазон из единственной ячейки.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsSingleCell;
Копировать Код
Public ReadOnly Property IsSingleCell As Boolean
 Возвращает
 Возвращает true, если диапазон состоит из единственной ячейки. В противном случае возвращает false.
 Описание
 Свойство позволяет проверить, состоит ли диапазон из единственной ячейки.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.CellRange, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!