Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.IdMapping.Delete
 Послать отзыв
 Метод позволяет удалить объект IdPair с указанным ключом из данного объекта IdMapping.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Delete( ObjectId key );
Копировать Код
Public Sub Delete( key As ObjectId )
 Параметры
 Параметры
 Описание
 key
 Идентификатор исходного объекта клонирования как ключ удаляемого объекта IdPair. Тип ObjectId.
 Описание
 Метод позволяет удалить объект IdPair с ключом key из данного объекта IdMapping.
 Ссылки
 Teigha.DatabaseServices.IdMapping, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!