Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocArrayPathParameters.SetItemCount
 Послать отзыв
 Метод задает количество элементов в массиве по траектории.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetItemCount( int count, ref String expression, ref String evaluatorId );
Копировать Код
Public Sub SetItemCount( count As Integer, ByRef expression As String, ByRef evaluatorId As String )
 Параметры
 Параметры
 Описание
 count
 Количество элементов в массиве. Тип int.
 expression
 Выражение для параметра. Тип String. Строка может быть пустой.
 evaluatorId
 Строковое представление идентификатора вычислителя. Тип String. Строка может быть пустой.
 Описание
 Метод задает количество элементов в массиве по траектории. Если для параметра выражение отсутствует, строки expression и evaluatorId должны быть пустыми.
 Ссылки
 Teigha.DatabaseServices.AssocArrayPathParameters, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!