Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Material.SelfIllumination
 Послать отзыв
 Свойство представляет значение самосвечения данного материала.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual double SelfIllumination;
Копировать Код
Public Overridable Property SelfIllumination As Double
 Возвращает
 Возвращает значение самосвечения материала. Тип double.
 Описание
 Свойство представляет значение самосвечения данного материала.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Material, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!