Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LoftOptionsBuilder.DraftStartMag
 Послать отзыв
 Свойство возвращает величину вытягивания для поверхности у первого поперечного сечения (start draft magnitude).
 Синтаксис
C#
Visual Basic
Копировать Код
public double DraftStartMag;
Копировать Код
Public Property DraftStartMag As Double
 Возвращает
 Возвращает величину вытягивания поверхности из первого поперечного сечения. Тип double.
 Описание
 Свойство возвращает величину вытягивания для поверхности у первого поперечного сечения (start draft magnitude). Она управляет модулем вектора касательной к поверхности в первом поперечном сечении. Значение по умолчанию — 0, т.е. система автоматически вычислит оптимальную величину для первого поперечного сечения.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.LoftOptionsBuilder, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!