Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Curve.Extend
 Послать отзыв
 Метод Extend достраивает кривую до новой точки, заданной параметром newParameter.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void Extend( double newParameter );
Копировать Код
Public virtual Function Extend( newParameter As double )
 Параметры
 Параметры
 Описание
 newParameter
 Аргумент типа double, который параметрически задает новую начальную или конечную точку кривой.
 Описание
 Этот метод достраивает кривую до новой точки, заданной параметром newParameter.
 Ссылки
 Teigha.DatabaseServices.Curve, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!