Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Leader.FirstVertex
 Послать отзыв
 Синтаксис
C#
Visual Basic
public Point3d FirstVertex;
Public Property FirstVertex() As Point3d
 Описание
 Возвращает стартовую точку выноски в WCS координатах. Эта точка будет началом стрелки, если она доступна.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.Leader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!