Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.SetBackgroundColor
 Послать отзыв
 Данный метод задает цвет фона для указанных типов строк.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetBackgroundColor( ref Color color, int rowTypes );
Копировать Код
Public virtual Sub SetBackgroundColor( ByRef color As Color, rowTypes As Integer )
 Параметры
 Параметры
 Описание
 color
 Цвет фона. Тип Color.
 rowTypes
 Типы строк, int. Возможные значения типа строки: DataRow, TitleRow и HeaderRow из перечисления RowType.
 Описание
 Данный метод задает цвет фона для указанных типов строк. Различные типы строк можно комбинировать с использованием оператора OR. Если тип строки не указан, метод применяется ко всем возможным типам строк.
 Замечания
 Для получения того же результата предпочтительнее использовать функционал объекта Cell.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!