Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GripData.Context
 Послать отзыв
 Данное перечисление определяет флаги контекста ручки.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum Context { SharedGrip = 1, MultiHotGrip = 2 }
Копировать Код
Public Enum Context SharedGrip = 1 MultiHotGrip = 2 End Enum
 Члены
 Члены
 Описание
 MultiHotGrip
 Значение: 2. Многофункциональная ручка.
 SharedGrip
 Значение: 1. Ручка, общая для нескольких объектов чертежа.
 Описание
 Данное перечисление определяет флаги контекста ручки.
 Ваши комментарии по поводу этого топика: Послать отзыв!