Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Dimfxl
 Послать отзыв
 Синтаксис
C#
Visual Basic
public double Dimfxl;
Public Property Dimfxl() As Double
 Описание
 Возвращает значение фиксированной выносной линии.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!