Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CellBorder.Margin
 Послать отзыв
 Свойство Margin представляет размер поля на границе ячейки.
 Синтаксис
C#
Visual Basic
Копировать Код
public double? Margin;
Копировать Код
Public Property Margin As Double?
 Возвращает
 Возвращает размер поля на границе ячейки. Тип double?.
 Описание
 Свойство Margin представляет размер поля на границе ячейки.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.CellBorder, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!