Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.SuppressZeroInches
 Послать отзыв
 Свойство используется для управления подавлением нулевого значения целых дюймов в размере формата футы-дюймы, когда футы и дюймы являются основными единицами измерения.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool SuppressZeroInches;
Копировать Код
Public Property SuppressZeroInches As Boolean
 Возвращает
 Возвращает true, если подавление включено. В противном случае возвращает false.
 Описание
 Свойство управляет подавлением отображения нулевого значения целых дюймов в размере формата футы-дюймы, когда футы и дюймы являются основными единицами измерения.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!