Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeader.AddLeaderLine
 Послать отзыв
 Метод позволяет добавить к данному объекту MLeader новую линию выноски с началом в указанной точке.
 Синтаксис
C#
Visual Basic
Копировать Код
public int AddLeaderLine( Point3d point );
Копировать Код
Public Function AddLeaderLine( point As Point3d ) As Integer
 Параметры
 Параметры
 Описание
 point
 Первая точка новой линии выноски. Тип Point3d.
 Возвращает
 Возвращает индекс добавленной линии выноски. Тип int.
 Описание
 Метод позволяет добавить к данному объекту MLeader новую линию выноски с началом в указанной точке.
 Ссылки
 Teigha.DatabaseServices.MLeader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!