Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FieldEvaluator.EvaluatorId
 Послать отзыв
 Метод предоставляет идентификатор вычислителя для указанного кода поля.
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract String EvaluatorId( ref Field pField );
Копировать Код
Public MustOverride Function EvaluatorId( ByRef pField As Field ) As String
 Параметры
 Параметры
 Описание
 pField
 Входной объект поля, для которого требуется получить идентификатор вычислителя. Тип Field.
 Возвращает
 Возвращает идентификатор вычислителя. Если их несколько, идентификаторы разделяются запятыми. Тип String.
 Описание
 Метод предоставляет идентификатор вычислителя для указанного кода поля. Вызывается для поиска вычислителя по коду поля, для которого не задан идентификатор вычислителя.
 Замечания
 Реализации этого метода должны проверять код поля. Если код поля распознается вычислителем и может быть им обработан, тогда этот метод должен возвращать идентификатор вычислителя.
 Ссылки
 Teigha.DatabaseServices.FieldEvaluator, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!