Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Point3dCollection.CopyTo
 Послать отзыв
 Метод копирует эту коллекцию точек в указанный массив, начиная с указанного индекса.
 Синтаксис
C#
Visual Basic
Копировать Код
public void CopyTo( ref Point3d[] a, int index );
Копировать Код
Public Sub CopyTo( ByRef a As Point3d(), index As Integer )
 Параметры
 Параметры
 Описание
 a
 Входной массив, в который выполняется копирование. Тип Point3d[].
 index
 Входной индекс, начиная с которого в массив копируются точки из коллекции. Тип int.
 Описание
 Метод копирует эту коллекцию точек в массив a, начиная с индекса index.
 Ссылки
 Teigha.Geometry.Point3dCollection, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!