Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeaderStyle.MLeaderStyle
 Послать отзыв
 Конструктор класса MLeaderStyle, который создает новый экземпляр класса как копию уже существующего экземпляра.
 Синтаксис
C#
Visual Basic
Копировать Код
public MLeaderStyle( ref MLeaderStyle mleaderStyle );
Копировать Код
Public Sub New( ByRef mleaderStyle As MLeaderStyle )
 Параметры
 Параметры
 Описание
 mleaderStyle
 Объект для копирования. Тип MLeaderStyle.
 Описание
 Конструктор класса MLeaderStyle, который создает новый экземпляр класса как копию уже существующего экземпляра.
 Ссылки
 Teigha.DatabaseServices.MLeaderStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!