Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FeatureControlFrame.FeatureControlFrame
 Послать отзыв
 Конструктор класса FeatureControlFrame. Создает экземпляр класса с указанными кодами, точкой вставки и ориентацией в заданной плоскости.
 Синтаксис
C#
Visual Basic
Копировать Код
public FeatureControlFrame( ref String codes, Point3d insertionPoint, Vector3d normalVector, Vector3d x );
Копировать Код
Public Sub New( ByRef codes As String, insertionPoint As Point3d, normalVector As Vector3d, x As Vector3d )
 Параметры
 Параметры
 Описание
 codes
 Текст данного символа. Предполагает использование esc-последовательностей для настройки символа. Тип String.
 insertionPoint
 Точка вставки символа. Тип Point3d.
 normalVector
 Вектор нормали плоскости, в которой располагается данный символ. Тип Vector3d. Задается в WCS.
 x
 Направление оси X в указанной плоскости. Тип Vector3d. Задается в WCS.
 Описание
 Конструктор класса FeatureControlFrame. Создает экземпляр класса с указанными кодами, точкой вставки и ориентацией в заданной плоскости.
 Замечания
 Точкой вставки является середина левого края символа допусков формы и расположения.
 Для настройки символа FeatureControlFrame допускается использовать следующие управляющие esc-последовательности:
 Esc-последовательность
 Значение
 n
 новая строка
 {\Fgdt;a}
 допуск наклона
 {\Fgdt;b}
 допуск перпендикулярности
 {\Fgdt;c}
 допуск плоскостности
 {\Fgdt;d}
 допуск формы заданной поверхности
 {\Fgdt;e}
 допуск круглости
 {\Fgdt;f}
 допуск параллельности
 {\Fgdt;g}
 допуск цилиндричности
 {\Fgdt;h}
 допуск радиального биения
 {\Fgdt;i}
 допуск симметричности
 {\Fgdt;j}
 позиционный допуск (+)
 {\Fgdt;k}
 допуск формы заданного профиля
 {\Fgdt;l}
 минимальное состояние материала
 {\Fgdt;m}
 максимальное состояние материала
 {\Fgdt;n}
 символ диаметра
 {\Fgdt;p}
 позиционный допуск (P)
 {\Fgdt;r}
 допуск соосности
 {\Fgdt;s}
 независимость от размера объекта
 {\Fgdt;t}
 допуск полного биения
 {\Fgdt;u}
 допуск прямолинейности
 %%v
 вертикальный разделитель
 Ссылки
 Teigha.DatabaseServices.FeatureControlFrame, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!