Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Plimmax
 Послать отзыв
 Синтаксис
C#
Visual Basic
public Point2d Plimmax;
Public Property Plimmax() As Point2d
 Описание
 Возвращает или устанавливает текущее значение LIMMAX для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!