Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Field.EvaluationStatus
 Послать отзыв
 Свойство EvaluationStatus возвращает статус вычисления данного поля.
 Синтаксис
C#
Visual Basic
Копировать Код
public FieldEvaluationStatusResult EvaluationStatus;
Копировать Код
Public ReadOnly Property EvaluationStatus As FieldEvaluationStatusResult
 Возвращает
 Возвращает статус вычисления поля. Тип FieldEvaluationStatusResult.
 Описание
 Свойство EvaluationStatus возвращает статус вычисления данного поля.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Field, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!