Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 DimStyleTableRecord.Dimltex2
 Послать отзыв
 Свойство отвечает за настройку типа линии вторых выносных линий линейных размеров.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual ObjectId Dimltex2 { get; set; }
Копировать Код
Public Overridable Property Dimltex2 As ObjectId
 Возвращает
 Возвращает тип данных ObjectId.
 Описание
 В свойстве хранится ObjectId установленного типа линии для вторых выносных линий линейных размеров. Значение по умолчанию - «По слою».
 Свойство также доступно через системную переменную DIMLTEX2 и пользовательское меню в окне изменения/создания размерного стиля:
  При изменении системной переменной DIMLTEX2 будет создан новый размерный стиль под названием <переопределение> на основе текущего с новым значением DIMLTEX2.
 Условия
 Чтение и запись.
 Пример
 Пример изменения типа линии вторых выносных линий линейных размеров (значения свойства Dimltex2) в размерном стиле Standard:
C#
 Копировать Код
public partial class Commands { [Teigha.Runtime.CommandMethod("Dimltex2Change")] public void Dimltex2StandardDimStyle() { // Получение ссылки на активный документ HostMgd.ApplicationServices.Document doc = HostMgd.ApplicationServices.Application.DocumentManager.MdiActiveDocument; // Получение ссылки на редактор документа HostMgd.EditorInput.Editor ed = doc.Editor; // Получение ссылки на базу данных документа Teigha.DatabaseServices.Database db = doc.Database; // Начало транзакции с базой данных документа using (Teigha.DatabaseServices.Transaction trans = db.TransactionManager.StartTransaction()) { // Открываем таблицу размерных стилей для чтения Teigha.DatabaseServices.DimStyleTable dimStyleTable = trans.GetObject(db.DimStyleTableId, Teigha.DatabaseServices.OpenMode.ForRead) as Teigha.DatabaseServices.DimStyleTable; // Находим в таблице размерных стилей ObjectId нужного стиля по его названию Teigha.DatabaseServices.ObjectId styleId = dimStyleTable["Standard"]; // Открываем таблицу размерного стиля для изменений Teigha.DatabaseServices.DimStyleTableRecord obj = trans.GetObject(styleId, Teigha.DatabaseServices.OpenMode.ForWrite) as Teigha.DatabaseServices.DimStyleTableRecord; // Открываем таблицу типов линий для чтения Teigha.DatabaseServices.LinetypeTable linetypeTable= trans.GetObject(db.LinetypeTableId, Teigha.DatabaseServices.OpenMode.ForRead) as Teigha.DatabaseServices.LinetypeTable; ed.WriteMessage($"nDimltex2 before: {obj.Dimltex2}"); // Изменяем цвет размерных линий на красный obj.Dimltex2 = linetypeTable["ГОСТ 2.303 3"]; // Также увеличим размерный текст и размер стрелок на окончаниях размерных линий obj.Dimtxt = 7; obj.Dimasz = 7; ed.WriteMessage($"nDimltex2 after: {obj.Dimltex2}"); trans.Commit(); } } }
 Результат работы команды Dimltex2Change:
 Было:
 Стало:
 Ссылки
 Teigha.DatabaseServices.DimStyleTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!