Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector2d.ToString
 Послать отзыв
 Метод реализует эквивалентное представление данного вектора в виде текстовой строки.
 Синтаксис
C#
Visual Basic
Копировать Код
public sealed override String ToString();
Копировать Код
Public NotOverridable Overrides Function ToString() As String
 Возвращает
 Возвращает строковое представление данного вектора. Тип String.
 Описание
 Метод реализует эквивалентное представление данного вектора в виде текстовой строки.
 Ссылки
 Teigha.Geometry.Vector2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!