Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.UnderlayReference.GenerateClipBoundaryFromPline
 Послать отзыв
 Метод предназначен для создания границы обрезки из заданной полилинии.
 Синтаксис
C#
Visual Basic
Копировать Код
public void GenerateClipBoundaryFromPline( DatabaseServices.ObjectId polyId );
Копировать Код
Public Sub GenerateClipBoundaryFromPline( polyId As DatabaseServices.ObjectId )
 Параметры
 Параметры
 Описание
 polyId
 Идентификатор объекта полилинии. Тип DatabaseServices.ObjectId.
 Описание
 Метод предназначен для создания границы обрезки из заданной полилинии.
 Ссылки
 Teigha.DatabaseServices.UnderlayReference, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!