Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Filters.SpatialFilterDefinition.FrontClip
 Послать отзыв
 Свойство FrontClip возвращает расстояние до передней плоскости отсечения в положительном направлении выдавливания.
 Синтаксис
C#
Visual Basic
Копировать Код
public double FrontClip;
Копировать Код
Public ReadOnly Property FrontClip As Double
 Возвращает
 Возвращает расстояние до передней плоскости отсечения. Тип double.
 Описание
 Свойство FrontClip возвращает расстояние до передней плоскости отсечения в положительном направлении выдавливания.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Filters.SpatialFilterDefinition, Teigha.DatabaseServices.Filters
 Ваши комментарии по поводу этого топика: Послать отзыв!