Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeader.AddLeaderLine
 Послать отзыв
 Добавляет линию выноски в кластер выноски с указанным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public int AddLeaderLine( int leaderIndex );
Копировать Код
Public Function AddLeaderLine( leaderIndex As Integer ) As Integer
 Параметры
 Параметры
 Описание
 leaderIndex
 Индекс кластера выноски. Тип int.
 Возвращает
 Возвращает индекс добавленной линии выноски. Тип int.
 Описание
 Добавляет линию выноски в кластер выноски с указанным индексом.
 Ссылки
 Teigha.DatabaseServices.MLeader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!