Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LineAngularDimension2.xLine1End
 Послать отзыв
 Свойство представляет конечную точку первой опорной линии данного размера.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d xLine1End;
Копировать Код
Public Property xLine1End As Point3d
 Возвращает
 Возвращает конечную точку первой опорной линии размера. Тип Point3d.
 Описание
 Свойство представляет конечную точку первой опорной линии данного размера. Эта же точка служит начальной точкой первой выносной линии.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.LineAngularDimension2, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!