Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Entity.AddSubentityPaths
 Послать отзыв
 Метод предназначен для добавления подобъектов к геометрическому объекту.
 Синтаксис
C#
Visual Basic
Копировать Код
public void AddSubentityPaths(FullSubentityPath[] subPaths);
Копировать Код
Public Sub AddSubentityPaths(subPaths As FullSubentityPath[])
 Параметры
 Параметры
 Описание
 subPaths
 Массив, идентифицирующий добавляемые геометрические подобъекты. Тип FullSubentityPath[]
 Описание
 Добавляет один или несколько геометрических подобъектов к геометрическому объекту.
 Ссылки
 Teigha.DatabaseServices.Entity, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!