Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство LinetypeTableRecord.IsScaledToFit
 Послать отзыв
 Синтаксис
C#
Visual Basic
public bool IsScaledToFit;
Public Property IsScaledToFit() As bool
 Описание
 Обеспечивает доступ к типу выравнивания для LinetypeTableRecord.
 Если ScaledToFit равен true, выравнивание будет равно "растянуть по размеру" (эквивалентно "S" в поле "выравнивание" определения типа линии).
 Если ScaledToFit равен false, то выравнивание не будет "растянуть по размеру" (эквивалентно "A" в поле "выравнивание" определения типа линии).
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.LinetypeTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!