Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Point3d.*
 Послать отзыв
 Оператор умножения класса Point3d. Реализует умножение координат точки на вещественный множитель.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d operator *( Point3d a, double value );
Копировать Код
Public Operator *( a As Point3d, value As Double )
 Параметры
 Параметры
 Описание
 a
 Левый операнд. Тип Point3d.
 value
 Правый операнд. Тип double.
 Возвращает
 Возвращает точку Point3d в новых координатах.
 Описание
 Оператор умножения класса Point3d. Реализует умножение координат точки a на вещественный множитель value.
 Ссылки
 Teigha.Geometry.Point3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!