Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Point3dCollection.Item
 Послать отзыв
 Свойство, представляющее элемент из коллекции с указанным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d this[int index];
Копировать Код
Default Public Property Item( index As Integer ) As Point3d
 Параметры
 Параметры
 Описание
 index
 Индекс элемента коллекции. Тип int.
 Возвращает
 Возвращает элемент коллекции с указанным индексом. Тип Point3d.
 Описание
 Свойство, представляющее элемент из коллекции с указанным индексом. Нумерация элементов коллекции начинается с нуля.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.Geometry.Point3dCollection, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!