Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ArcDimension.IsPartial
 Послать отзыв
 Свойство определяет, является ли размер длины дуги частичным.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsPartial;
Копировать Код
Public Property IsPartial() As Boolean
 Возвращает
 Возвращает true, если размер длины дуги является частичным, иначе - false.
 Описание
 Свойство определяет, является ли размер длины дуги частичным.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.ArcDimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!