Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Entity.SetSubentityGripStatus(GripStatus
 Послать отзыв
 Метод вызывается перед удалением ручек подобъектов, чтобы геометрический объект мог выполнить необходимые действия по управлению ресурсами, или после их удаления для уведомления об окончании сессии редактирования.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetSubentityGripStatus(GripStatus status, FullSubentityPath subentity);
Копировать Код
Public Sub SetSubentityGripStatus(status As GripStatus, subentity As FullSubentityPath)
 Параметры
 Параметры
 Описание
 status
 Статус операции ручкой. Тип GripStatus
 subentity
 Геометрический подобъект, чей статус ручки изменяется. Тип FullSubentityPath
 Описание
 Этот метод вызывается со значением статуса GripsToBeDeleted, когда ручки для подобъектов подготовлены к удалению в приложении. Это уведомление позволяет геометрическому объекту выполнить любые требуемые задания по управлению ресурсами перед тем, как объекты ручки GripStatus и любые альтернативные базовые точки объекта, на которые указывает объект GripStatus, будут удалены. Это уведомление может быть послано более чем один раз для данной сессии редактирования ручкой. Если сессия редактирования ручкой не закончена, когда послано это уведомление, геометрический объект впоследствии получит вызов его метода GetGripPoints() для получения новой координаты ручки, которая будет использоваться в сессии редактирования ручкой.
 Этот метод вызывается со значением статуса GripsDone, когда ручки для геометрического объекта были удалены в приложении и геометрический объект больше не участвует в любой операции редактирования ручкой.
 Ссылки
 Teigha.DatabaseServices.Entity, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!