Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SweepOptionsBuilder.EndDraftDist
 Послать отзыв
 Свойство EndDraftDist представляет расстояние вдоль траектории, на котором сужение/расширение вытягиваемого объекта прекращается.
 Синтаксис
C#
Visual Basic
Копировать Код
public double EndDraftDist;
Копировать Код
Public Property EndDraftDist As Double
 Возвращает
 Возвращает расстояние, на котором сужение/расширение прекращается. Тип double.
 Описание
 Свойство EndDraftDist представляет расстояние вдоль траектории, на котором сужение/расширение вытягиваемого объекта прекращается.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.SweepOptionsBuilder, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!