Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.BoundedPlane
 Послать отзыв
 Класс BoundedPlane представляет ограниченную плоскую параметрическую поверхность.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Geometry::Entity3d Teigha::Geometry::Surface Teigha::Geometry::PlanarEntity Teigha::Geometry::BoundedPlane
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdGeBoundedPlane")] public sealed class BoundedPlane : PlanarEntity
Копировать Код
<Wrapper("OdGeBoundedPlane")> Public NotInheritable Class BoundedPlane Inherits PlanarEntity
 Описание
 Класс BoundedPlane представляет ограниченную плоскую параметрическую поверхность.
 Методы
 Конструкторы
 Teigha.Geometry.BoundedPlane
 Имя
 Описание
 BoundedPlane
 Это обзор перегрузок BoundedPlane.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Geometry.Entity3d
 Имя
 Описание
 Entity3d Методы
 Ниже перечислены методы класса Entity3d.
 Teigha.Geometry.Surface
 Имя
 Описание
 Surface Методы
 Ниже перечислены методы класса Surface.
 Surface Свойства
 Ниже перечислены свойства класса Surface.
 Teigha.Geometry.PlanarEntity
 Имя
 Описание
 PlanarEntity Методы
 Ниже перечислены методы класса PlanarEntity.
 PlanarEntity Свойства
 Ниже перечислены свойства класса PlanarEntity.
 Teigha.Geometry.BoundedPlane
 Имя
 Описание
 BoundedPlane Методы
 Ниже перечислены методы класса BoundedPlane.
 Ссылки
 BoundedPlane Конструктор, BoundedPlane Методы, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!