Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство TextStyleTableRecord.IsVertical
 Послать отзыв
 Синтаксис
C#
Visual Basic
public bool IsVertical;
Public Property IsVertical() As bool
 Описание
 Обеспечивает доступ к признаку, установленному в true тогда и только тогда, когда текстовый стиль рисуется вертикально.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.TextStyleTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!