Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector3dCollection
 Послать отзыв
 Класс Vector3dCollection представляет коллекцию трехмерных векторов.
 Иерархия классов
Teigha::Geometry::Vector3dCollection
 Синтаксис
C#
Visual Basic
Копировать Код
[DefaultMember("Item")] [Wrapper("OdGeVector3dArray")] public sealed class Vector3dCollection : IList
Копировать Код
<DefaultMember("Item")> <Wrapper("OdGeVector3dArray")> Public NotInheritable Class Vector3dCollection Implements IList
 Описание
 Класс Vector3dCollection представляет коллекцию трехмерных векторов Vector3d.
 Методы
 Конструкторы
 Имя
 Описание
 Vector3dCollection
 Это обзор перегрузок Vector3dCollection.
 Топики
 Имя
 Описание
 Vector3dCollection Данные
 Ниже перечислены данные класса Vector3dCollection.
 Vector3dCollection Методы
 Ниже перечислены методы класса Vector3dCollection.
 Vector3dCollection Свойства
 Ниже перечислены свойства класса Vector3dCollection.
 Ссылки
 Vector3dCollection Конструктор, Vector3dCollection Данные, Vector3dCollection Методы, Vector3dCollection Свойства, Методы, Топики, Vector3dCollection Данные, Vector3dCollection Методы, Vector3dCollection Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!