Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocArray.TransformItemBy
 Послать отзыв
 Метод применяет заданное геометрическое 3D-преобразование к указанному элементу ассоциативного массива.
 Синтаксис
C#
Visual Basic
Копировать Код
public void TransformItemBy( ItemLocator index, Matrix3d transform );
Копировать Код
Public Sub TransformItemBy( index As ItemLocator, transform As Matrix3d )
 Параметры
 Параметры
 Описание
 index
 Индекс элемента ассоциативного массива, к которому применяется геометрическое преобразование. Тип ItemLocator.
 transform
 Матрица геометрического 3D-преобразования. Тип Matrix3d.
 Описание
 Метод позволяет применить указанное геометрическое 3D-преобразование transform к элементу ассоциативного массива, который задан локатором index.
 Ссылки
 Teigha.DatabaseServices.AssocArray, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!