Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Layout.GetViewports
 Послать отзыв
 Метод возвращает коллекцию ObjectId всех видовых экранов, присутствующих в пространстве листа.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectIdCollection GetViewports();
Копировать Код
Public Function GetViewports() As ObjectIdCollection
 Возвращает
 Возвращает коллекцию ObjectId всех видовых экранов, тип ObjectIdCollection.
 Описание
 Метод возвращает коллекцию ObjectId всех видовых экранов, присутствующих в пространстве листа. Первым в списке будет ObjectId видового экрана пространства листа. Если возвращаемый список пуст, то этот лист ни разу не переключался (не был активирован). Список обновляется при каждой активации листа и поддерживается в актуальном состоянии, пока этот лист активен (список актуализируется при каждом добавлении или удалении видовых экранов).
 Ссылки
 Teigha.DatabaseServices.Layout, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!