Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotStyleData.!=
 Послать отзыв
 Оператор неравенства для структуры PlotStyleData.
 Синтаксис
C#
Visual Basic
Копировать Код
public static bool operator !=( PlotStyleData a, PlotStyleData b );
Копировать Код
Public Shared Operator <>( a As PlotStyleData, b As PlotStyleData ) As Boolean
 Параметры
 Параметры
 Описание
 a
 Левый операнд. Тип PlotStyleData.
 b
 Правый операнд. Тип PlotStyleData.
 Возвращает
 Возвращает true только в случае неравенства левого и правого операндов. Тип bool.
 Описание
 Оператор неравенства для структуры PlotStyleData.
 Ссылки
 Teigha.DatabaseServices.PlotStyleData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!