Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CellContent.DataType
 Послать отзыв
 Свойство DataType представляет тип данных содержимого ячейки таблицы.
 Синтаксис
C#
Visual Basic
Копировать Код
public DataTypeParameter DataType;
Копировать Код
Public Property DataType As DataTypeParameter
 Возвращает
 Возвращает тип данных ячейки. Тип DataTypeParameter.
 Описание
 Свойство DataType представляет тип данных содержимого ячейки таблицы.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.CellContent, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!