Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Worldview
 Послать отзыв
 Синтаксис
C#
Visual Basic
public bool Worldview;
Public Property Worldview() As bool
 Описание
 Обеспечивает доступ к текущему значению WORLDVIEW для базы данных. Значение false соответствует 0. Значение true — 1.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!