Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.TypedValue.Equals
 Послать отзыв
 Метод определяет равенство данного объекта с указанным объектом.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool Equals( ref Object obj );
Копировать Код
Public Function Equals( ByRef obj As Object ) As Boolean
 Параметры
 Параметры
 Описание
 obj
 Объект, с которым выполняется проверка на равенство. Тип Object
 Возвращает
 Возвращает значение true в случае равенства объектов, в противном случае - false.
 Описание
 Метод определяет равенство данного объекта с указанным объектом.
 Ссылки
 Teigha.DatabaseServices.TypedValue, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!