Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CellReference
 Послать отзыв
 Структура CellReference представляет текущую ячейку таблицы.
 Иерархия классов
Teigha::DatabaseServices::CellReference
 Синтаксис
C#
Visual Basic
Копировать Код
public struct CellReference
Копировать Код
Public Structure CellReference
 Описание
 Структура CellReference представляет текущую ячейку таблицы.
 Топики
 Имя
 Описание
 CellReference Свойства
 Ниже перечислены свойства класса CellReference.
 Ссылки
 CellReference Свойства, Топики, CellReference Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!