Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Field.Field
 Послать отзыв
 Конструктор класса, создающий объект Field с указанным кодом поля.
 Синтаксис
C#
Visual Basic
Копировать Код
public Field( ref String fieldCode );
Копировать Код
Public Sub New( ByRef fieldCode As String )
 Параметры
 Параметры
 Описание
 fieldCode
 Код поля. Тип String.
 Описание
 Конструктор класса Field. Создает объект Field с указанным кодом поля fieldCode.
 Ссылки
 Teigha.DatabaseServices.Field, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!