Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Matrix2d.Multiply
 Послать отзыв
 Метод реализует левое умножение данной матрицы на указанную матрицу, являющуюся левым множителем.
 Синтаксис
C#
Visual Basic
Копировать Код
public Matrix2d Multiply( Matrix2d matrix );
Копировать Код
Public Function Multiply( matrix As Matrix2d ) As Matrix2d
 Параметры
 Параметры
 Описание
 matrix
 Входная матрица, которая является левым множителем в матричном произведении. Тип Matrix2d.
 Возвращает
 Возвращает результат левого произведения данной матрицы на матрицу matrix. Тип Matrix2d.
 Описание
 Метод реализует левое умножение данной матрицы на матрицу matrix, являющуюся левым множителем, что эквивалентно применению метода Matrix2d.PreMultiplyBy(matrix). Результат произведения (matrix) х (данная матрица) сохраняется в данной матрице.
 Ссылки
 Teigha.Geometry.Matrix2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!