Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.TextLineSpacingStyle
 Послать отзыв
 Свойство задает или возвращает стиль межстрочного интервала для размерного текста.
 Синтаксис
C#
Visual Basic
Копировать Код
public LineSpacingStyle TextLineSpacingStyle;
Копировать Код
Public Property TextLineSpacingStyle As LineSpacingStyle
 Возвращает
 Возвращает стиль межстрочного интервала. Значение из перечисления LineSpacingStyle.
 Описание
 Свойство задает или возвращает стиль межстрочного интервала для размерного текста. По эффекту аналогично свойству LineSpacingStyle объекта MText.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!