Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbSurface.NurbSurface
 Послать отзыв
 Конструктор класса NurbSurface. Создает экземпляр класса с указанными параметрами, используя заданную геометрическую точность.
 Синтаксис
C#
Visual Basic
Копировать Код
public NurbSurface( int degreeU, int degreeV, int propsInU, int propertiesInV, int numberControlPointsInU, int numberControlPointsInV, ref Point3dCollection controlPoints, ref DoubleCollection weights, ref KnotCollection knotsInU, ref KnotCollection knotsInV, Tolerance tolerance );
Копировать Код
Public Sub New( degreeU As Integer, degreeV As Integer, propsInU As Integer, propertiesInV As Integer, numberControlPointsInU As Integer, numberControlPointsInV As Integer, ByRef controlPoints As Point3dCollection, ByRef weights As DoubleCollection, ByRef knotsInU As KnotCollection, ByRef knotsInV As KnotCollection, tolerance As Tolerance )
 Параметры
 Параметры
 Описание
 degreeU
 Степень сплайна в направлении U. Тип int.
 degreeV
 Степень сплайна в направлении V. Тип int.
 propsInU
 Свойства поверхности в направлении U (используются значения NurbSurfaceProperties). Тип int.
 propertiesInV
 Свойства поверхности в направлении V (используются значения NurbSurfaceProperties). Тип int.
 numberControlPointsInU
 Количество управляющих вершин в направлении U. Тип int.
 numberControlPointsInV
 Количество управляющих вершин в направлении V. Тип int.
 controlPoints
 Массив управляющих вершин. Тип Point3dCollection.
 weights
 Массив весов. Тип DoubleCollection.
 knotsInU
 Узловой вектор в направлении U. Тип KnotCollection.
 knotsInV
 Узловой вектор в направлении V. Тип KnotCollection.
 tolerance
 Заданная геометрическая точность. Тип Tolerance.
 Описание
 Конструктор класса NurbSurface. Создает экземпляр NURBS поверхности с указанными параметрами, используя заданную геометрическую точность.
 Ссылки
 Teigha.Geometry.NurbSurface, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!