Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Viewport.ThawLayersInViewport
 Послать отзыв
 Метод позволяет разморозить в данном видовом экране указанный список слоёв.
 Синтаксис
C#
Visual Basic
Копировать Код
public void ThawLayersInViewport( ref System.Collections.IEnumerator layerIds );
Копировать Код
Public Sub ThawLayersInViewport( ByRef layerIds As System.Collections.IEnumerator )
 Параметры
 Параметры
 Описание
 layerIds
 Коллекция идентификаторов слоёв, которые следует разморозить. Тип System.Collections.IEnumerator.
 Описание
 Метод позволяет разморозить в данном видовом экране указанный список слоёв.
 Замечания
 Данный метод не затрагивает другие видовые экраны.
 Ссылки
 Teigha.DatabaseServices.Viewport, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!