Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CoordinateSystem2d.ToString
 Послать отзыв
 Метод позволяет получить эквивалентное строковое представление данного объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public sealed override String ToString();
Копировать Код
Public NotOverridable Overrides Function ToString() As String
 Возвращает
 Возвращает строковое представление данного объекта. Тип String.
 Описание
 Метод позволяет получить эквивалентное строковое представление данного объекта. Возвращаемая строка включает начало этой системы координат и направления её осей X и Y.
 Ссылки
 Teigha.Geometry.CoordinateSystem2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!