Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Spline.NurbsData
 Послать отзыв
 Свойство NurbsData представляет данные NURBS этого сплайна, включающие узлы, значения веса, значения допуска для узлов и управляющих вершин точек и т.д.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.NurbsData NurbsData;
Копировать Код
Public Property NurbsData As DatabaseServices.NurbsData
 Возвращает
 Возвращает данные NURBS сплайна. Тип DatabaseServices.NurbsData.
 Описание
 Свойство NurbsData представляет данные NURBS этого сплайна, включающие узлы, значения веса, значения допуска для узлов и управляющих вершин точек и т.д.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Spline, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!