Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Cylinder.GetAngles
 Послать отзыв
 Метод предоставляет начальный и конечный углы на базовой окружности цилиндра.
 Синтаксис
C#
Visual Basic
Копировать Код
public double[] GetAngles();
Копировать Код
Public Function GetAngles() As Double()
 Возвращает
 Возвращает массив из двух элементов, которые определяют начальный и конечный углы, соответственно. Тип double[].
 Описание
 Метод предоставляет начальный и конечный углы на базовой окружности цилиндра.
 Ссылки
 Teigha.Geometry.Cylinder, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!