Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.EllipticalArc3d.SetAxes
 Послать отзыв
 Метод позволяет переопределить направления большой и малой осей у данной эллиптической дуги.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetAxes( Vector3d majorAxis, Vector3d minorAxis );
Копировать Код
Public Sub SetAxes( majorAxis As Vector3d, minorAxis As Vector3d )
 Параметры
 Параметры
 Описание
 majorAxis
 Новое направление большой оси эллиптической дуги. Тип Vector3d.
 minorAxis
 Новое направление малой оси эллиптической дуги. Тип Vector3d.
 Описание
 Метод позволяет переопределить направления большой и малой осей у данной эллиптической дуги.
 Ссылки
 Teigha.Geometry.EllipticalArc3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!