Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.OffsetCurve2d.ParameterDirection
 Послать отзыв
 Свойство ParameterDirection позволяет определить направление изменения параметра у данной кривой относительно направления изменения параметра у базовой кривой.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool ParameterDirection;
Копировать Код
Public ReadOnly Property ParameterDirection As Boolean
 Возвращает
 Возвращает true, если направления изменения параметра у данной кривой и ее базовой кривой совпадают. В противном случае возвращает false.
 Описание
 Свойство ParameterDirection позволяет определить направление изменения параметра у данной кривой относительно направления изменения параметра у базовой кривой.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.OffsetCurve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!