Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve2d.GetClosestPointTo
 Послать отзыв
 Метод позволяет получить точку на этой кривой, ближайшую к заданной точке.
 Синтаксис
C#
Visual Basic
Копировать Код
public PointOnCurve2d GetClosestPointTo( Point2d point );
Копировать Код
Public Function GetClosestPointTo( point As Point2d ) As PointOnCurve2d
 Параметры
 Параметры
 Описание
 point
 Входная точка, для которой требуется найти ближайшую точку на кривой. Тип Point2d.
 Возвращает
 Возвращает точку на кривой, которая является ближайшей к заданной точке point. Тип PointOnCurve2d.
 Описание
 Метод позволяет получить точку на этой кривой, ближайшую к заданной точке. Используется вызов метода Curve2d.GetClosestPointTo(Point2d point, Tolerance tolerance) с точностью Tolerance.Global.
 Ссылки
 Teigha.Geometry.Curve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!