Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FieldEvaluationResult.Found
 Послать отзыв
 Свойство Found возвращает количество найденных полей.
 Синтаксис
C#
Visual Basic
Копировать Код
public int Found;
Копировать Код
Public ReadOnly Property Found As Integer
 Возвращает
 Возвращает количество найденных полей. Тип int.
 Описание
 Свойство Found возвращает количество найденных полей.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.FieldEvaluationResult, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!