Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.MsOleScale
 Послать отзыв
 Синтаксис
C#
Visual Basic
public double MsOleScale;
Public Property MsOleScale() As Double
 Описание
 Возвращает или устанавливает значение заголовка LAYERNOTIFY.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!