Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.SurfaceSurfaceIntersector.GetIntersectPointParameters
 Послать отзыв
 Метод предоставляет для каждой из поверхностей параметрическую точку (U, V), которая соответствует точке пересечения с указанным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point2d[] GetIntersectPointParameters( int number );
Копировать Код
Public Function GetIntersectPointParameters( number As Integer ) As Point2d()
 Параметры
 Параметры
 Описание
 number
 Индекс пересечения. Индексация начинается с нуля. Тип int.
 Возвращает
 Возвращает двухэлементный массив параметрических точек (U, V) для каждой из поверхностей в точке пересечения. Тип Point2d[]. Принята следующая индексация элементов массива:
0 — Параметрическая точка на первой поверхности в точке пересечения.
1 — Параметрическая точка на второй поверхности в точке пересечения.
 Описание
 Метод предоставляет для каждой из поверхностей свою параметрическую точку (U, V), которая соответствует точке пересечения с указанным индексом.
 Ссылки
 Teigha.Geometry.SurfaceSurfaceIntersector, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!