Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.SurfaceSurfaceIntersector.Surface1
 Послать отзыв
 Свойство Surface1 представляет объект первой поверхности, связанный с данным объектом.
 Синтаксис
C#
Visual Basic
Копировать Код
public Surface Surface1;
Копировать Код
Public ReadOnly Property Surface1 As Surface
 Возвращает
 Возвращает объект первой поверхности. Тип Surface.
 Описание
 Свойство Surface1 представляет объект первой поверхности, связанный с данным объектом.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.SurfaceSurfaceIntersector, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!