Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector2d.YAxis
 Послать отзыв
 Свойство YAxis представляет направление оси Y.
 Синтаксис
C#
Visual Basic
Копировать Код
public static Vector2d YAxis;
Копировать Код
Public Shared ReadOnly Property YAxis As Vector2d
 Возвращает
 Возвращает направление оси Y. Тип Vector2d.
 Описание
 Свойство YAxis представляет направление оси Y.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.Vector2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!