Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Dimtm
 Послать отзыв
 Синтаксис
C#
Visual Basic
public double Dimtm;
Public Property Dimtm() As Double
 Описание
 Возвращает или устанавливает текущее значение DIMTM для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!