Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SweepOptionsBuilder.SweepOptionsBuilder
 Послать отзыв
 Конструктор по умолчанию класса SweepOptionsBuilder.
 Синтаксис
C#
Visual Basic
Копировать Код
public SweepOptionsBuilder();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса SweepOptionsBuilder.
 Ссылки
 Teigha.DatabaseServices.SweepOptionsBuilder, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!