Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.LoftAng2
 Послать отзыв
 Синтаксис
C#
Visual Basic
public double LoftAng2;
Public Property LoftAng2() As Double
 Описание
 Возвращает или устанавливает текущее значение LOFTANG2 для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!