Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PolygonMeshVertex.PolygonMeshVertex
 Послать отзыв
 Конструктор по умолчанию класса PolygonMeshVertex.
 Синтаксис
C#
Visual Basic
Копировать Код
public PolygonMeshVertex();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса PolygonMeshVertex. Типом вершины по умолчанию является Vertex3dType.SimpleVertex.
 Ссылки
 Teigha.DatabaseServices.PolygonMeshVertex, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!