Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeader.recomputeBreakPoints
 Послать отзыв
 Метод перевычисляет точки разбиения данной мультивыноски.
 Синтаксис
C#
Visual Basic
Копировать Код
public void recomputeBreakPoints();
Копировать Код
Public Sub recomputeBreakPoints()
 Описание
 Метод перевычисляет точки разбиения данной мультивыноски.
 Ссылки
 Teigha.DatabaseServices.MLeader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!