Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.LineSegment3d.Set
 Послать отзыв
 Метод переопределяет данный линейный сегмент таким образом, чтобы он оказался касательным к обеим указанным кривым.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Set( ref Curve3d curve1, ref Curve3d curve2, double parameter1, double parameter2 );
Копировать Код
Public Sub Set( ByRef curve1 As Curve3d, ByRef curve2 As Curve3d, parameter1 As Double, parameter2 As Double )
 Параметры
 Параметры
 Описание
 curve1
 Первая входная кривая, касательность к которой требуется обеспечить. Тип Curve3d.
 curve2
 Вторая входная кривая, касательность к которой требуется обеспечить. Тип Curve3d.
 parameter1
 Значение параметра точки на кривой curve1, в которой кривая касается линейного сегмента. Тип double.
 parameter2
 Значение параметра точки на кривой curve2, в которой кривая касается линейного сегмента. Тип double.
 Описание
 Метод позволяет переопределить данный линейный сегмент таким образом, чтобы он оказался касательным к обеим указанным кривым. Входные значения параметров parameter1 для кривой curve1 и parameter2 для кривой curve2 используются в качестве первоначальных приближений при вычислении точек касания.
 Ссылки
 Teigha.Geometry.LineSegment3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!