Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObjectCollection.IndexOf
 Послать отзыв
 Метод определяет индекс элемента коллекции с заданным объектом типа DBObject.
 Синтаксис
C#
Visual Basic
Копировать Код
public int IndexOf( ref DBObject value );
Копировать Код
Public Function IndexOf( ByRef value As DBObject ) As Integer
 Параметры
 Параметры
 Описание
 value
 Объект типа DBObject, для которого следует установить индекс в коллекции.
 Возвращает
 Возвращает индекс (int) элемента коллекции. Индексация в коллекции начинается с нуля.
 Описание
 Метод определяет индекс элемента коллекции с заданным объектом типа DBObject. Индексация в коллекции начинается с нуля.
 Ссылки
 Teigha.DatabaseServices.DBObjectCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!