Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GraphNodeCollection.Insert
 Послать отзыв
 Метод позволяет вставить указанный объект GraphNode в эту коллекцию по заданному индексу.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Insert( int index, ref GraphNode value );
Копировать Код
Public Sub Insert( index As Integer, ByRef value As GraphNode )
 Параметры
 Параметры
 Описание
 index
 Индекс, по которому вставляется объект value. Тип int.
 value
 Вставляемый в коллекцию объект. Тип GraphNode.
 Описание
 Метод позволяет вставить указанный объект GraphNode в эту коллекцию по заданному индексу.
 Ссылки
 Teigha.DatabaseServices.GraphNodeCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!