Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод RasterImageDef.ImageCopy
 Послать отзыв
 Синтаксис
C#
Visual Basic
public IntPtr ImageCopy(bool forceImageLoad);
Public Function ImageCopy(forceImageLoad As bool) As IntPtr
 Параметры
 Параметры
 Описание
 forceImageLoad
 Признак, указывающий, нужно ли загрузить изображение, если оно еще не загружено
 Описание
 Создает копию данных чертежа и возвращает указатель на нее.
 Ссылки
 Teigha.DatabaseServices.RasterImageDef, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!