Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DwgFiler.ReadInt64
 Послать отзыв
 Метод предназначен для получения значения Int64 из текущего элемента данного объекта Filer.
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract long ReadInt64();
Копировать Код
Public MustOverride Function ReadInt64() As Long
 Возвращает
 Возвращает значение текущего элемента данного объекта Filer. Тип long.
 Описание
 Метод предназначен для получения значения Int64 из текущего элемента данного объекта Filer.
 Ссылки
 Teigha.DatabaseServices.DwgFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!