Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GripOverrule.OnGripStatusChanged
 Послать отзыв
 Метод вызывается, когда объект чертежа оказывается задействованным в операциях с ручками.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void OnGripStatusChanged( ref Entity entity, GripStatus status );
Копировать Код
Public virtual Sub OnGripStatusChanged( ByRef entity As Entity, status As GripStatus )
 Параметры
 Параметры
 Описание
 entity
 Объект, тип Entity,
 status
 Статус операции с ручками из перечисления Teigha.DatabaseServices.GripStatus.
 Описание
 Метод вызывается, когда объект чертежа оказывается задействованным в операциях с ручками.
 Ссылки
 Teigha.DatabaseServices.GripOverrule, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!