Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.OffsetSurface.OriginalSurface
 Послать отзыв
 Свойство OriginalSurface вычисляет указатель на исходную поверхность.
 Синтаксис
C#
Visual Basic
Копировать Код
public Geometry.Surface OriginalSurface;
Копировать Код
Public ReadOnly Property OriginalSurface As Geometry.Surface
 Возвращает
 Возвращает исходную поверхность. Тип Geometry.Surface.
 Описание
 Свойство OriginalSurface вычисляет указатель на исходную поверхность.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.OffsetSurface, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!