Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocArrayParameters
 Послать отзыв
 Класс предоставляет интерфейс для управления параметрами ассоциативного массива.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::DatabaseServices::AssocArrayParameters
 Синтаксис
C#
Visual Basic
Копировать Код
[TypeDescriptionProvider("Teigha.ComponentModel.TypeDescriptionProvider`1[[Teigha.DatabaseServices.AssocArrayParameters, TD_MgdDbConstraints]], TD_MgdDbConstraints")] [Teigha.Runtime.Wrapper("AcDbAssocArrayParameters")] public class AssocArrayParameters : Teigha.Runtime.RXObject;
Копировать Код
<TypeDescriptionProvider("Teigha.ComponentModel.TypeDescriptionProvider`1[[Teigha.DatabaseServices.AssocArrayParameters, TD_MgdDbConstraints]], TD_MgdDbConstraints")> <Teigha.Runtime.Wrapper("AcDbAssocArrayParameters")> Public Class AssocArrayParameters Inherits Teigha.Runtime.RXObject
 Описание
 Класс предоставляет интерфейс для управления параметрами ассоциативного массива. Производные от него классы реализуют логику для геометрических преобразований элементов массива, а также манипуляций с ручками. Объект AssocArray владеет объектом этого класса, используя его методы для вычисления всего массива.
 Методы
 Конструкторы
 Teigha.DatabaseServices.AssocArrayParameters
 ПоказатьInternal
 Нет совпадений по текущему фильтру
 Имя
 Описание
 AssocArrayParameters
 This is AssocArrayParameters, a member of class AssocArrayParameters.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.DatabaseServices.AssocArrayParameters
 Имя
 Описание
 AssocArrayParameters Методы
 Ниже перечислены методы класса AssocArrayParameters.
 AssocArrayParameters Свойства
 Ниже перечислены свойства класса AssocArrayParameters.
 Ссылки
 AssocArrayParameters Методы, AssocArrayParameters Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!