Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SectionSettings.CurrentSectionType
 Послать отзыв
 Свойство CurrentSectionType представляет текущий тип сечения или разреза.
 Синтаксис
C#
Visual Basic
Копировать Код
public SectionType CurrentSectionType;
Копировать Код
Public Property CurrentSectionType As SectionType
 Возвращает
 Возвращает тип сечения. Перечисление SectionType.
 Описание
 Свойство CurrentSectionType представляет текущий тип сечения или разреза.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.SectionSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!