Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DataLinkManager.RemoveDataLink
 Послать отзыв
 Метод удаляет внешнюю ссылку с указанным именем.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectId RemoveDataLink( ref String name );
Копировать Код
Public Function RemoveDataLink( ByRef name As String ) As ObjectId
 Параметры
 Параметры
 Описание
 name
 Имя удаляемой внешней ссылки. Тип String.
 Возвращает
 Возвращает идентификатор ObjectId уделенной внешней ссылки.
 Описание
 Метод удаляет внешнюю ссылку с указанным именем.
 Ссылки
 Teigha.DatabaseServices.DataLinkManager, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!