Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MoveGripPointsFlags
 Послать отзыв
 Перечисление MoveGripPointsFlags определяет флаги для точек перемещения ручек.
 Синтаксис
C#
Visual Basic
Копировать Код
[Flags] [Wrapper("OdDbGripOperations.MoveGripPointsFlags")] public enum MoveGripPointsFlags { Osnapped = 1, Polar = 2, ObjectTrack = 4, ZDir = 8, Keyboard = 16 }
Копировать Код
<Flags> <Wrapper("OdDbGripOperations.MoveGripPointsFlags")> Public Enum MoveGripPointsFlags Osnapped = 1 Polar = 2 ObjectTrack = 4 ZDir = 8 Keyboard = 16 End Enum
 Члены
 Члены
 Описание
 Osnapped
 Значение: 1. Смещение вследствие объектной привязки.
 Polar
 Значение: 2. Смещение при полярном отслеживании (Polar).
 ObjectTrack
 Значение: 4. Смещение вследствие объектного отслеживания.
 ZDir
 Значение: 8. Смещение в направлении Z (при полярном отслеживании, либо вследствие объектной привязки).
 Keyboard
 Значение: 16. Смещение задано с клавиатуры.
 Описание
 Перечисление MoveGripPointsFlags определяет флаги для точек перемещения ручек.
 Ваши комментарии по поводу этого топика: Послать отзыв!