Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Point2d.*
 Послать отзыв
 Оператор умножения класса Point2d. Реализует преобразование координат этой точки матрицей mat.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point2d operator * ( Matrix2d mat, Point2d a );
Копировать Код
Public Operator * ( mat As Matrix2d, a As Point2d )
 Параметры
 Параметры
 Описание
 mat
 Левый операнд. Тип Matrix2d.
 a
 Правый операнд. Тип Point2d.
 Возвращает
 Возвращает точку Point2d в новых координатах.
 Описание
 Оператор умножения класса Point2d. Реализует преобразование координат точки a матрицей mat.
 Ссылки
 Teigha.Geometry.Point2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!