Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.WblockNoticeEventArgs
 Послать отзыв
 Класс WblockNoticeEventArgs представляет данные для события WblockNotice базы данных.
 Иерархия классов
Teigha::DatabaseServices::WblockNoticeEventArgs
 Синтаксис
C#
Visual Basic
Копировать Код
public sealed class WblockNoticeEventArgs : EventArgs
Копировать Код
Public NotInheritable Class WblockNoticeEventArgs Inherits EventArgs
 Описание
 Класс WblockNoticeEventArgs представляет данные для события WblockNotice базы данных.
 Топики
 Имя
 Описание
 WblockNoticeEventArgs Свойства
 Ниже перечислены свойства класса WblockNoticeEventArgs.
 Ссылки
 WblockNoticeEventArgs Свойства, Топики, WblockNoticeEventArgs Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!