Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.EdgeRef.EdgeRef
 Послать отзыв
 Конструктор класса EdgeRef. Создает ссылку на ребро, используя указанную кривую Curve3d.
 Синтаксис
C#
Visual Basic
Копировать Код
public EdgeRef( ref Curve3d curve );
Копировать Код
Public Sub New( ByRef curve As Curve3d )
 Параметры
 Параметры
 Описание
 curve
 3D-кривая, используемая для создания этой ссылки на ребро. Тип Curve3d.
 Описание
 Конструктор класса EdgeRef. Создает ссылку на ребро, используя указанную кривую Curve3d.
 Ссылки
 Teigha.DatabaseServices.EdgeRef, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!