Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Point2dCollection.ToArray
 Послать отзыв
 Метод создает массив объектов Point2d, содержащий копии всех элементов данной коллекции.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point2d[] ToArray();
Копировать Код
Public Function ToArray() As Point2d()
 Возвращает
 Возвращает массив, содержащий копии всех элементов данной коллекции. Тип Point2d[].
 Описание
 Метод создает массив объектов Point2d, содержащий копии всех элементов данной коллекции.
 Ссылки
 Teigha.Geometry.Point2dCollection, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!