Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector3d.Convert2d
 Послать отзыв
 Метод позволяет получить представление данного трехмерного вектора в виде 2D-вектора в системе координат входного плоского объекта. Предполагается, что данный вектор параллелен заданной плоскости.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector2d Convert2d( ref PlanarEntity plane );
Копировать Код
Public Function Convert2d( ByRef plane As PlanarEntity ) As Vector2d
 Параметры
 Параметры
 Описание
 plane
 Входной плоский объект. Тип PlanarEntity.
 Возвращает
 Возвращает двумерный вектор. Тип Vector2d.
 Описание
 Метод обеспечивает представление данного трехмерного вектора в виде 2D-вектора в системе координат входного плоского объекта plane. Систему координат плоского объекта возвращает метод PlanarEntity.GetCoordinateSystem(). Предполагается, что данный 3D-вектор параллелен входной плоскости plane.
 Ссылки
 Teigha.Geometry.Vector3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!