Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LayoutManager.LayoutRenamed
 Послать отзыв
 Cобытие создается, когда завершается переименование листа.
 Синтаксис
C#
Visual Basic
Копировать Код
public event LayoutRenamedEventHandler LayoutRenamed;
Копировать Код
Public Event LayoutRenamed As LayoutRenamedEventHandler
 Описание
 Cобытие создается, когда завершается переименование листа.
 Ссылки
 Teigha.DatabaseServices.LayoutManager, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!