Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод RasterImageDef.Unload
 Послать отзыв
 Синтаксис
C#
Visual Basic
public void Unload(bool modifyDatabase);
Public Sub Unload(modifyDatabase As bool)
 Параметры
 Параметры
 Описание
 modifyDatabase
 Признак, указывающий, нужно ли выполнять запись в буфер Undo
 Описание
 Немедленно выгружает данные изображения в RasImageDef из рабочей памяти, но не уничтожает собственно RasImageDef. Посылаются уведомления, которые вызывают перерисовку для всех зависимых геометрических объектов RasterImage. Метод требует, чтобы RasImageDef был открыт на запись.
 Если modifyDatabase равен true, то все изменения, сделанные с объектом RasImageDef, будут записаны в буфер Undo.
 Ссылки
 Teigha.DatabaseServices.RasterImageDef, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!