Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.Dimldrblk
 Послать отзыв
 Свойство задает или возвращает блок стрелок на концах линий выноски.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.ObjectId Dimldrblk;
Копировать Код
Public Property Dimldrblk As DatabaseServices.ObjectId
 Возвращает
 Возвращает ссылку на блок стрелок. Тип DatabaseServices.ObjectId.
 Описание
 Свойство задает или возвращает блок стрелок на концах линий выноски. Нулевое значение указывает, что используется стрелка по умолчанию.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!