Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LayerStateManager.AbortLayerStateRestore
 Послать отзыв
 Это событие создается, если прерван процесс восстановления состояния слоя.
 Синтаксис
C#
Visual Basic
Копировать Код
public event LayerStateEventHandler AbortLayerStateRestore;
Копировать Код
Public Event AbortLayerStateRestore As LayerStateEventHandler
 Описание
 Это событие создается, если прерван процесс восстановления состояния слоя.
 Ссылки
 Teigha.DatabaseServices.LayerStateManager, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!