Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DwgFiler.ReadUInt16
 Послать отзыв
 Метод предназначен для получения значения UInt16 из текущего элемента данного объекта Filer.
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract ushort ReadUInt16();
Копировать Код
Public MustOverride Function ReadUInt16() As UShort
 Возвращает
 Возвращает значение 16-разрядного целого числа без знака. Тип ushort.
 Описание
 Метод предназначен для получения 16-разрядного целого числа без знака (UInt16) из текущего элемента данного объекта Filer.
 Ссылки
 Teigha.DatabaseServices.DwgFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!