Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ObjectContextCollectionEnumerator.Current
 Послать отзыв
 Свойство представляет элемент коллекции, на котором установлен указатель перечислителя.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectContext Current;
Копировать Код
Public ReadOnly Property Current As ObjectContext
 Возвращает
 Возвращает элемент коллекции под указателем перечислителя. Тип ObjectContext.
 Описание
 Свойство представляет элемент коллекции, на котором установлен указатель перечислителя.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.ObjectContextCollectionEnumerator, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!