Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.EdgeRef.EdgeRef
 Послать отзыв
 Конструктор класса EdgeRef. Создает ссылку на ребро на основе полного пути к подобъекту ребра указанного составного объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public EdgeRef( ref CompoundObjectId compoundObjectId, SubentityId edgeSubentId );
Копировать Код
Public Sub New( ByRef compoundObjectId As CompoundObjectId, edgeSubentId As SubentityId )
 Параметры
 Параметры
 Описание
 compoundObjectId
 Идентификатор составного объекта. Тип CompoundObjectId.
 edgeSubentId
 Идентификатор подобъекта-ребра. Тип SubentityId.
 Описание
 Конструктор класса EdgeRef. Создает ссылку на ребро на основе полного пути к подобъекту ребра указанного составного объекта.
 Ссылки
 Teigha.DatabaseServices.EdgeRef, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!