Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Cylinder.IntersectWith
 Послать отзыв
 Метод вычисляет точки пересечения данного цилиндра с указанным линейным объектом, используя геометрическую точность по умолчанию.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d[] IntersectWith( ref LinearEntity3d linearEntity );
Копировать Код
Public Function IntersectWith( ByRef linearEntity As LinearEntity3d ) As Point3d()
 Параметры
 Параметры
 Описание
 linearEntity
 Входной линейный объект, точки пересечения с которым требуется вычислить. Тип LinearEntity3d.
 Возвращает
 Возвращает массив, состоящий из двух элементов, которые соответствуют, соответственно, первой и второй точкам пересечения (если они существуют). Тип Point3d[].
 Описание
 Метод вычисляет точки пересечения данного цилиндра с указанным линейным объектом. Используется вызов метода Cylinder.IntersectWith(LinearEntity3d linearEntity, Tolerance tolerance) со значением точности, равным Tolerance.Global.
 Замечания
 В случае отсутствия точек пересечения или при возникновении ошибки метод возвращает null.
 Ссылки
 Teigha.Geometry.Cylinder, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!