Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve2d.IsClosed
 Послать отзыв
 Метод выполняет проверку, замкнута ли данная кривая.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsClosed();
Копировать Код
Public Function IsClosed() As Boolean
 Возвращает
 Возвращает true, если начальная и конечная точки кривой совпадают в пределах точности Tolerance.Global. В противном случае возвращает false.
 Описание
 Метод выполняет проверку, замкнута ли данная кривая.
 Кривая считается замкнутой, если в пределах заданной точности начальная и конечная точки кривой совпадают. Здесь используется вызов Curve2d.IsClosed(Tolerance tolerance) с точностью Tolerance.Global.
 Ссылки
 Teigha.Geometry.Curve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!