Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Matrix3d.Mirroring
 Послать отзыв
 Метод формирует матрицу преобразования, соответствующего зеркальному отражению относительно заданной оси.
 Синтаксис
C#
Visual Basic
Копировать Код
public Matrix3d Mirroring( ref Line3d line );
Копировать Код
Public Function Mirroring( ByRef line As Line3d ) As Matrix3d
 Параметры
 Параметры
 Описание
 line
 Ось симметрии. Тип Line3d.
 Возвращает
 Возвращает матрицу преобразования. Тип Matrix3d.
 Описание
 Метод формирует матрицу преобразования, соответствующего зеркальному отражению относительно заданной оси.
 Ссылки
 Teigha.Geometry.Matrix3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!