Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DrawOrderTable.MoveAbove
 Послать отзыв
 Метод предназначен для перемещения объектов с указанными идентификаторами выше целевого объекта в последовательности отрисовки данного объекте DrawOrderTable.
 Синтаксис
C#
Visual Basic
Копировать Код
public void MoveAbove( ref ObjectIdCollection collection, DatabaseServices.ObjectId target );
Копировать Код
Public Sub MoveAbove( ByRef collection As ObjectIdCollection, target As DatabaseServices.ObjectId )
 Параметры
 Параметры
 Описание
 collection
 Идентификаторы объектов, для которых изменяется порядок отрисовки. Тип ObjectIdCollection.
 target
 Идентификатор целевого объекта. Тип DatabaseServices.ObjectId.
 Описание
 Метод предназначен для перемещения объектов с указанными идентификаторами выше целевого объекта в последовательности отрисовки данного объекта DrawOrderTable. Относительный порядок отрисовки в пределах группы перемещаемых объектов не изменяется.
 Ссылки
 Teigha.DatabaseServices.DrawOrderTable, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!