Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PropertiesOverrule.GetClassID
 Послать отзыв
 Метод предназначен для получения ClassID объекта DBObject.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual Guid GetClassID( ref DBObject entity );
Копировать Код
Public virtual Function GetClassID( ByRef entity As DBObject ) As Guid
 Параметры
 Параметры
 Описание
 entity
 Объект в базе данных чертежа, тип DBObject.
 Возвращает
 Возвращает Guid объекта чертежа.
 Описание
 Метод предназначен для получения ClassID объекта DBObject.
 Ссылки
 Teigha.DatabaseServices.PropertiesOverrule, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!