Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbCurve3dData.Weights
 Послать отзыв
 Свойство Weights представляет веса NURBS кривой.
 Синтаксис
C#
Visual Basic
Копировать Код
public DoubleCollection Weights;
Копировать Код
Public ReadOnly Property Weights As DoubleCollection
 Возвращает
 Возвращает массив весов данной NURBS кривой. Тип DoubleCollection.
 Описание
 Свойство Weights представляет веса NURBS кривой.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.NurbCurve3dData, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!