Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.NurbSurface.InsertControlPointsAtV
 Послать отзыв
 Метод позволяет вставить строку управляющих вершин для заданного значения параметра v узла.
 Синтаксис
C#
Visual Basic
Копировать Код
public void InsertControlPointsAtV( double dV, ref Point3dCollection uCtrlPts, ref DoubleCollection uWeights );
Копировать Код
Public Sub InsertControlPointsAtV( dV As Double, ByRef uCtrlPts As Point3dCollection, ByRef uWeights As DoubleCollection )
 Параметры
 Параметры
 Описание
 dV
 Входное значение параметра V. Тип double.
 vCtrlPts
 Входной массив добавляемых управляющих вершин. Тип Point3dCollection.
 vWeights
 Входной массив добавляемых весов, если поверхность является рациональной. Тип DoubleCollection.
 Описание
 Метод позволяет вставить строку управляющих вершин для заданного значения параметра v узла.
 Если поверхность не содержит никакой информации NURBS, метод выбрасывает исключение eFail. Если входное значение параметра dU выходит за пределы допустимого диапазона, выбрасывается исключение eOutOfRange.
 Ссылки
 Teigha.DatabaseServices.NurbSurface, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!