Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.RenderGlobal.DimensionsParameter.Height
 Послать отзыв
 Свойство Height представляет размер по высоте.
 Синтаксис
C#
Visual Basic
Копировать Код
public int Height;
Копировать Код
Public ReadOnly Property Height As Integer
 Возвращает
 Возвращает значение высоты. Тип int.
 Описание
 Свойство Height представляет размер по высоте.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.RenderGlobal.DimensionsParameter, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!