Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DbHomeView.Equals
 Послать отзыв
 Метод предназначен для проверки на равенство данного объекта с указанным объектом.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool Equals( ref Object obj );
Копировать Код
Public Function Equals( ByRef obj As Object ) As Boolean
 Параметры
 Параметры
 Описание
 obj
 Объект, с которым выполняет проверка на равенство. Тип Object.
 Возвращает
 Возвращает true, если объекты эквивалентны. В противном случае возвращает false.
 Описание
 Метод предназначен для проверки на равенство данного объекта с указанным объектом obj.
 Ссылки
 Teigha.DatabaseServices.DbHomeView, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!