Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SymbolTableEnumerator
 Послать отзыв
 Класс SymbolTableEnumerator представляет перечислитель для таблицы символов.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::DatabaseServices::SymbolTableEnumerator
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdDbSymbolTableIterator")] public class SymbolTableEnumerator : DisposableWrapper, IEnumerator
Копировать Код
<Wrapper("OdDbSymbolTableIterator")> Public Class SymbolTableEnumerator Inherits DisposableWrapper Implements IEnumerator
 Описание
 Класс SymbolTableEnumerator представляет перечислитель для таблицы символов.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.DatabaseServices.SymbolTableEnumerator
 Имя
 Описание
 SymbolTableEnumerator Методы
 Ниже перечислены методы класса SymbolTableEnumerator.
 SymbolTableEnumerator Свойства
 Ниже перечислены свойства класса SymbolTableEnumerator.
 Ссылки
 SymbolTableEnumerator Методы, SymbolTableEnumerator Свойства, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!