Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CoordinateSystem2d.Xaxis
 Послать отзыв
 Свойство Xaxis представляет направляющий вектор оси X данной системы координат.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector2d Xaxis;
Копировать Код
Public ReadOnly Property Xaxis As Vector2d
 Возвращает
 Возвращает направляющий вектор оси X данной системы координат. Тип Vector2d.
 Описание
 Свойство Xaxis представляет направляющий вектор оси X данной системы координат.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.CoordinateSystem2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!