Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CompositeParameter.SegmentIndex
 Послать отзыв
 Свойство SegmentIndex представляет индекс подкривой у данного объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public int SegmentIndex;
Копировать Код
Public ReadOnly Property SegmentIndex As Integer
 Возвращает
 Возвращает индекс подкривой. Тип int.
 Описание
 Свойство SegmentIndex представляет индекс подкривой у данного объекта.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.CompositeParameter, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!