Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GradientBackground.Rotation
 Послать отзыв
 Свойство обеспечивает доступ к углу поворота градиентного фона.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Rotation;
Копировать Код
Public Property Rotation As Double
 Возвращает
 Возвращает угол поворота градиентного фона. Тип double.
 Описание
 Свойство обеспечивает доступ к углу поворота градиентного фона относительно текущей ПСК.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.GradientBackground, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!