Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SecurityParameters.Comment
 Послать отзыв
 Свойство Comment представляет дополнительный комментарий, сопровождающий подпись.
 Синтаксис
C#
Visual Basic
Копировать Код
public String Comment;
Копировать Код
Public Property Comment As String
 Возвращает
 Возвращает строку комментария. Тип String.
 Описание
 Свойство Comment представляет дополнительный комментарий, сопровождающий подпись.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.SecurityParameters, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!