Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SecurityParameters.Action
 Послать отзыв
 Свойство Action представляет действия безопасности, которые необходимо выполнить.
 Синтаксис
C#
Visual Basic
Копировать Код
public SecurityActions Action;
Копировать Код
Public Property Action As SecurityActions
 Возвращает
 Возвращает предписанные действия безопасности. Перечисление SecurityActions.
 Описание
 Свойство Action представляет действия безопасности, которые необходимо выполнить.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.SecurityParameters, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!