Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Point2d.Coordinate
 Послать отзыв
 Свойство предоставляет доступ к координатам точки.
 Синтаксис
C#
Visual Basic
Копировать Код
public double this[int index];
Копировать Код
Default Public ReadOnly Property Coordinate( index As Integer ) As Double
 Параметры
 Параметры
 Описание
 index
 Индекс координаты; тип int. 0 – координата X, 1 – координата Y.
 Возвращает
 Возвращает значение координаты. Тип double
 Описание
 Свойство предоставляет доступ к координатам точки.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.Point2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!