Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBDictionary.SetName
 Послать отзыв
 Метод выполняет переименование указанной записи.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetName( ref String oldName, ref String newName );
Копировать Код
Public Function SetName( ByRef oldName As String, ByRef newName As String )
 Параметры
 Параметры
 Описание
 oldName
 Строка со старым ключом.
 newName
 Строка с новым ключом.
 Описание
 Метод переименовывает запись с именем oldName, присваивая ей новое имя newName.
 Ссылки
 Teigha.DatabaseServices.DBDictionary, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!