Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.LinearEntity2d.IsColinearTo
 Послать отзыв
 Метод позволяет проверить, является ли указанный линейный объект коллинеарным данному линейному объекту.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsColinearTo( ref LinearEntity2d line );
Копировать Код
Public Function IsColinearTo( ByRef line As LinearEntity2d ) As Boolean
 Параметры
 Параметры
 Описание
 line
 Проверяемый линейный объект. Тип LinearEntity2d.
 Возвращает
 Возвращает true, если объект line коллинеарен данному линейному объекту. В противном случае возвращает false.
 Описание
 Метод позволяет проверить, является ли указанный линейный объект коллинеарным данному линейному объекту. Используется вызов метода LinearEnt2d.IsColinearTo(LinearEntity2d line, Tolerance tolerance) с точностью, равной Tolerance.Global.
 Ссылки
 Teigha.Geometry.LinearEntity2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!