Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GripData.OnRightClick
 Послать отзыв
 Метод предназначен для обработки события нажатия правой кнопки мыши на этой ручке.
 Синтаксис
C#
Visual Basic
Копировать Код
public System.Collections.Generic.IEnumerable<Runtime.IMenuItem> OnRightClick( ref GripDataCollection hotGrips, ref ObjectIdCollection entities );
Копировать Код
Public Function OnRightClick( ByRef hotGrips As GripDataCollection, ByRef entities As ObjectIdCollection ) As System.Collections.Generic.IEnumerable<Runtime.IMenuItem>
 Параметры
 Параметры
 Описание
 hotGrips
 Коллекция активных ручек. Тип GripDataCollection.
 entities
 Коллекция идентификаторов объектов чертежа. Тип ObjectIdCollection.
 Возвращает
 Возвращает интерфейс System.Collections.Generic.IEnumerable.
 Описание
 Метод предназначен для обработки события нажатия правой кнопки мыши на этой ручке.
 Ссылки
 Teigha.DatabaseServices.GripData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!