Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Database.UnloadXrefs
 Послать отзыв
 Синтаксис
C#
Visual Basic
public void UnloadXrefs(ref ObjectIdCollection xrefIds);
Public Sub UnloadXrefs(ByRef xrefIds As ObjectIdCollection)
 Параметры
 Параметры
 Описание
 xrefIds
 Входная коллекция Id объектов для таблиц записей блоков выгружаемых внешних ссылок
 Описание
 Выгружает внешние ссылки, чьи Id таблицы записей блоков есть в xrefIds.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!