Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Solid3d.RemoveFaces
 Послать отзыв
 Метод предназначен для удаления указанных граней из данного твердого тела.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void RemoveFaces( ref SubentityId[] subentityIds );
Копировать Код
Public Overridable Sub RemoveFaces( ByRef subentityIds() As SubentityId )
 Параметры
 Параметры
 Описание
 subentityIds
 Массив идентификаторов подобъектов удаляемых граней данного 3D-тела. Тип SubentityId[].
 Описание
 Метод предназначен для удаления указанных граней из данного твердого тела.
 После удаления указанных граней соседние грани увеличиваются, заполняя образовавшиеся пустоты. Если соседние грани нельзя использовать, метод оставляет тело без изменений. В ряде случаев удаление граней может привести к тому, что тело станет недопустимым.
 Этот метод реализован только в среде пространственного моделирования.
 Ссылки
 Teigha.DatabaseServices.Solid3d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!