Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Light.LampColorPreset
 Послать отзыв
 Свойство представляет предустановленный цвет лампы данного источника света.
 Синтаксис
C#
Visual Basic
Копировать Код
public LampColorPreset LampColorPreset;
Копировать Код
Public Property LampColorPreset As LampColorPreset
 Возвращает
 Возвращает цвет лампы. Перечисление LampColorPreset.
 Описание
 Свойство представляет предустановленный цвет лампы данного источника света.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Light, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!