Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObject.SetField(Field)
 Послать отзыв
 Метод устанавливает указанное поле для свойства "ТЕКСТ".
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectId SetField(Field field);
Копировать Код
Public Function SetField(field As Field) As ObjectId
 Параметры
 Параметры
 Описание
 field
 Задаваемое поле. Тип Field
 Описание
 Поле может быть задано в объекте, с использованием имени свойства как ключа. Если поле еще не заведено в базе данных, оно будет заведено. Если поле уже есть в базе данных, оно будет открыто на запись. После вызова метода, поле должно быть закрыто.
 Ссылки
 Teigha.DatabaseServices.DBObject, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!