Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.HostApplicationServices.HostApplicationServices
 Послать отзыв
 Конструктор по умолчанию класса HostApplicationServices.
 Синтаксис
C#
Visual Basic
Копировать Код
public HostApplicationServices();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса HostApplicationServices.
 Ссылки
 Teigha.DatabaseServices.HostApplicationServices, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!