Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DataCell.SetPoint
 Послать отзыв
 Метод устанавливает для этой ячейки значение типа Point3d.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetPoint( Point3d value );
Копировать Код
Public Sub SetPoint( value As Point3d )
 Параметры
 Параметры
 Описание
 value
 Входное значение для ячейки. Тип Point3d.
 Описание
 Метод устанавливает для этой ячейки значение типа Point3d, заданное входным аргументом value.
 Ссылки
 Teigha.DatabaseServices.DataCell, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!