Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство RasterImage.Height
 Послать отзыв
 Синтаксис
C#
Visual Basic
public double Height;
Public Property Height() As Double
 Описание
 Обеспечивает доступ к высоте растрового изображения в единицах измерения чертежа.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.RasterImage, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!