Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SubDMesh.ComputeVolume
 Послать отзыв
 Метод предназначен для вычисления текущего объема сети.
 Синтаксис
C#
Visual Basic
Копировать Код
public double ComputeVolume();
Копировать Код
Public Function ComputeVolume() As double
 Возвращает
 Возвращает объем сети, тип double.
 Описание
 Метод предназначен для вычисления текущего объема сети.
 Ссылки
 Teigha.DatabaseServices.SubDMesh, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!