Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.GetBreakHeight
 Послать отзыв
 Метод предназначен для получения высоты разрыва данной таблицы при включенном режиме разбиения таблицы.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual double GetBreakHeight( int index );
Копировать Код
Public virtual Function GetBreakHeight( index As Integer ) As double
 Параметры
 Параметры
 Описание
 index
 Индекс фрагмента таблицы. Индекс должен быть больше или равен нулю и меньше количества табличных фрагментов, на которые разбита таблица.
 Возвращает
 Возвращает высоту разрыва таблицы, тип double.
 Описание
 Метод предназначен для получения высоты разрыва данной таблицы при включенном режиме разбиения таблицы.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!