Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 BlockTableRecord.ModelSpace
 Послать отзыв
 Свойство предназначено для хранения названия служебного блока пространства модели.
 Синтаксис
C#
Visual Basic
Копировать Код
public static readonly string ModelSpace;
Копировать Код
Public Shared ReadOnly ModelSpace As String
 Возвращает
 Тип данных string.
 Описание
 Свойство предназначено для быстрого поиска служебного блока пространства модели в базе данных чертежа, и хранит в себе название этого блока.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.BlockTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!