Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CellContent.SetBlockAttributeValue
 Послать отзыв
 Метод переопределяет значение атрибута с указанным определением атрибута.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetBlockAttributeValue( DatabaseServices.ObjectId attDefId, ref String value );
Копировать Код
Public Sub SetBlockAttributeValue( attDefId As DatabaseServices.ObjectId, ByRef value As String )
 Параметры
 Параметры
 Описание
 attDefId
 Входной идентификатор объекта определения атрибута. Тип DatabaseServices.ObjectId.
 value
 Новое значение атрибута. Тип String.
 Описание
 Метод переопределяет значение атрибута с указанным определением атрибута.
 Замечания
 Если тип содержимого ячейки отличается от CellContentTypes.Block, выбрасывается исключение eInvalidInput.
 Ссылки
 Teigha.DatabaseServices.CellContent, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!