Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBDictionary.IncludingErased
 Послать отзыв
 Предоставляет доступ ко всем записям словаря, включая стертые.
 Синтаксис
C#
Visual Basic
Копировать Код
public DBDictionary IncludingErased;
Копировать Код
Public Property IncludingErased() As DBDictionary
 Возвращает
 Возвращает словарь DBDictionary, содержащий все записи данного словаря, включая удаленные.
 Описание
 Возвращает словарь DBDictionary, содержащий все записи данного словаря, включая удаленные.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.DBDictionary, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!