Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.GetTextStyleId
 Послать отзыв
 Метод предназначен для получения ObjectId текстового стиля элемента содержимого по указанному индексу.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual DatabaseServices.ObjectId GetTextStyleId( int row, int column, int contentIndex );
Копировать Код
Public virtual Function GetTextStyleId( row As Integer, column As Integer, contentIndex As Integer ) As DatabaseServices.ObjectId
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 contentIndex
 Индекс элемента содержимого ячейки, тип int. Индекс должен быть больше или равен нулю и меньше количества элементов содержимого в ячейке.
 col
 Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
 Возвращает
 Возвращает идентификатор текстового стиля. Тип DatabaseServices.ObjectId.
 Описание
 Метод предназначен для получения ObjectId текстового стиля элемента содержимого по указанному индексу. Ячейка задается индексами строки и столбца.
 Замечания
 Для получения того же результата предпочтительнее использовать Table.Cells[row,column].Contents[i].TextStyleId.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!