Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CellRange.CanInsertColumn
 Послать отзыв
 Свойство позволяет определить, можно ли вставить столбец в диапазон.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool CanInsertColumn;
Копировать Код
Public ReadOnly Property CanInsertColumn As Boolean
 Возвращает
 Возвращает true, если вставить столбец можно. В противном случае возвращает false.
 Описание
 Свойство позволяет определить, можно ли вставить столбец в диапазон.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.CellRange, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!