Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GraphNode.NumOut
 Послать отзыв
 Свойство возвращает количество исходящих ссылок в данном узле.
 Синтаксис
C#
Visual Basic
Копировать Код
public int NumOut;
Копировать Код
Public ReadOnly Property NumOut As Integer
 Возвращает
 Возвращает количество исходящих ссылок. Тип int.
 Описание
 Свойство возвращает количество исходящих ссылок в данном узле.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.GraphNode, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!