Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SecurityParameters.Issuer
 Послать отзыв
 Свойство Issuer представляет имя эмитента сертификата (цифрового ID).
 Синтаксис
C#
Visual Basic
Копировать Код
public String Issuer;
Копировать Код
Public Property Issuer As String
 Возвращает
 Возвращает имя эмитента сертификата. Тип String.
 Описание
 Свойство Issuer представляет имя эмитента сертификата (цифрового ID).
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.SecurityParameters, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!