Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FaceRef.FaceRef
 Послать отзыв
 Конструктор по умолчанию класса FaceRef.
 Синтаксис
C#
Visual Basic
Копировать Код
public FaceRef();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса FaceRef.
 Ссылки
 Teigha.DatabaseServices.FaceRef, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!