Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.LinearEntity2d
 Послать отзыв
 Класс LinearEntity2d является абстрактным базовым классом для всех классов двумерных линейных объектов.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Geometry::Entity2d Teigha::Geometry::Curve2d Teigha::Geometry::LinearEntity2d
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdGeLinearEntity2d")] public abstract class LinearEntity2d : Curve2d
Копировать Код
<Wrapper("OdGeLinearEntity2d")> Public MustInherit Class LinearEntity2d Inherits Curve2d
 Описание
 Класс LinearEntity2d является абстрактным базовым классом для всех классов двумерных линейных объектов.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Geometry.Entity2d
 Имя
 Описание
 Entity2d Методы
 Ниже перечислены методы класса Entity2d.
 Teigha.Geometry.Curve2d
 Имя
 Описание
 Curve2d Методы
 Ниже перечислены методы класса Curve2d.
 Curve2d Свойства
 Ниже перечислены свойства класса Curve2d.
 Teigha.Geometry.LinearEntity2d
 Имя
 Описание
 LinearEntity2d Методы
 Ниже перечислены методы класса LinearEntity2d.
 LinearEntity2d Свойства
 Ниже перечислены свойства класса LinearEntity2d.
 Ссылки
 LinearEntity2d Методы, LinearEntity2d Свойства, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!