Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор SymbolTable.SymbolTable
 Послать отзыв
 This is SymbolTable, a member of class SymbolTable.
 Синтаксис
C#
Visual Basic
private SymbolTable(IntPtr unmanagedPointer, bool autoDelete);
Private Sub New(unmanagedPointer As IntPtr, autoDelete As bool)
 Ссылки
 Teigha.DatabaseServices.SymbolTable, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!