Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ParseOption
 Послать отзыв
 Данное перечисление определяет параметры парсинга значения.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum ParseOption { ParseOptionNone = 0, SetDefaultFormat = 1, PreserveMtextFormat = 2 }
Копировать Код
Public Enum ParseOption ParseOptionNone = 0 SetDefaultFormat = 1 PreserveMtextFormat = 2 End Enum
 Члены
 Члены
 Описание
 ParseOptionNone
 Значение: 0. Использовать парсинг по умолчанию.
 SetDefaultFormat
 Значение: 1. Назначить формат по умолчанию на основе типа анализируемого значения.
 PreserveMtextFormat
 Значение: 2. Формат MText в текущей строке формата сохраняется без изменений, если формат анализируемого текста отличается от MText. Если анализируемый текст имеет формат MText, то его формат переопределит формат MText в текущей строке формата.
 Описание
 Данное перечисление определяет параметры парсинга значения.
 Ваши комментарии по поводу этого топика: Послать отзыв!