Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeader.EnableLanding
 Послать отзыв
 Свойство должно управлять отображением зазора между концом линии полки и содержимым мультивыноски. В текущей реализации платформы всегда считается равным true.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool EnableLanding;
Копировать Код
Public Property EnableLanding As Boolean
 Возвращает
 Всегда возвращает true, т.е. отображение зазора между линией полки и контентом мультивыноски всегда включено.
 Описание
 Данное свойство позволяет проверить, должен ли отображаться зазор между концом линии полки и содержимым мультивыноски (многострочным текстом или блоком).
 По замыслу разработчиков, если данный флаг принимает значение true, величина зазора должна определяться значением свойства LandingGap. В противном случае значение зазора LandingGap должно игнорироваться (просто считается равным нулю).
 Но в текущей реализации платформы флаг EnableLanding выставлен всегда (равен true). Таким образом, для отрисовки зазора между концом линии полки и контентом мультивыноски всегда используется текущее значение свойства LandingGap.
 Изменять состояние флага EnableLanding через API технически возможно, но бессмысленно, поскольку в текущей реализации состояние флага не анализируется, а принимается всегда равным true.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MLeader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!