Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.Dimblk
 Послать отзыв
 Свойство задает или возвращает идентификатор блока, который используется для отображения концов стрелок на размерных линиях.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.ObjectId Dimblk;
Копировать Код
Public Property Dimblk As DatabaseServices.ObjectId
 Возвращает
 Возвращает идентификатор блока. Тип DatabaseServices.ObjectId.
 Описание
 Свойство задает или возвращает идентификатор ObjectId блока, который используется для отображения концов стрелок на размерных линиях.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!