Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.Dimlunit
 Послать отзыв
 Свойство задает или возвращает формат представления основных значений размеров и допусков.
 Синтаксис
C#
Visual Basic
Копировать Код
public int Dimlunit;
Копировать Код
Public Property Dimlunit As Integer
 Возвращает
 Возвращает код формата числовых значений размеров и допусков. Тип int.
 Описание
 Свойство задает или возвращает формат представления основных значений размеров и допусков.
 Допустимые значения:
 Значение
 Описание
 1
 Научный формат.
 2
 Десятичный формат.
 3
 Конструкторский формат.
 4
 Архитектурный формат.
 5
 Дробный формат.
 6
 Формат по умолчанию, заданный в настройках Microsoft® Windows®.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!