Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 DimStyleTableRecord.Dimaltf
 Послать отзыв
 Свойство предназначено для настройки множителя расстояния альтернативных измерений в размерах.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual double Dimaltf { get; set; }
Копировать Код
Public Overridable Property Dimaltf As Double
 Возвращает
 Возвращает тип данных double.
 Описание
 В свойстве хранится множитель расстояния для альтернативных измерений в размерах. В свойстве могут храниться только положительные вещественные числа, кроме нуля. Значение по умолчанию 25,4.
 Свойство также доступно через системную переменную DIMALTF и пользовательское меню в окне изменения/создания размерного стиля:
  При изменении системной переменной DIMALTF будет создан новый размерный стиль под названием <переопределение> на основе текущего с новым значением DIMALTF.
 Условия
 Чтение и запись.
 Пример
 Пример изменения множителя расстояния альтернативных измерений в размерах (значения свойства Dimaltf) в размерном стиле Standard:
C#
 Копировать Код
public partial class Commands { [Teigha.Runtime.CommandMethod("DimaltfChange")] public void DimaltfStandardDimStyle() { // Получение ссылки на активный документ HostMgd.ApplicationServices.Document doc = HostMgd.ApplicationServices.Application.DocumentManager.MdiActiveDocument; // Получение ссылки на редактор документа HostMgd.EditorInput.Editor ed = doc.Editor; // Получение ссылки на базу данных документа Teigha.DatabaseServices.Database db = doc.Database; // Начало транзакции с базой данных документа using (Teigha.DatabaseServices.Transaction trans = db.TransactionManager.StartTransaction()) { // Открываем таблицу размерных стилей для чтения Teigha.DatabaseServices.DimStyleTable dimStyleTable = trans.GetObject(db.DimStyleTableId, Teigha.DatabaseServices.OpenMode.ForRead) as Teigha.DatabaseServices.DimStyleTable; // Находим в таблице размерных стилей ObjectId нужного стиля по его названию Teigha.DatabaseServices.ObjectId styleId = dimStyleTable["Standard"]; // Открываем таблицу размерного стиля для изменений Teigha.DatabaseServices.DimStyleTableRecord obj = trans.GetObject(styleId, Teigha.DatabaseServices.OpenMode.ForWrite) as Teigha.DatabaseServices.DimStyleTableRecord; ed.WriteMessage($"nDimaltf before: {obj.Dimaltf}"); // Проверка, включено ли отображение альтернативных измерений if (obj.Dimalt == false) obj.Dimalt = true; // Изменяем коэффициент пересчета obj.Dimaltf = 2; ed.WriteMessage($"nDimaltf after: {obj.Dimaltf}"); trans.Commit(); } } }
 Результат работы команды DimaltfChange:
 Было:
 Стало:
 Ссылки
 Teigha.DatabaseServices.DimStyleTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!