Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MatchProperties
 Послать отзыв
 Этот класс является базовым для классов, реализующих копирование свойств между объектами чертежа.
 Иерархия классов
Teigha::DatabaseServices::MatchProperties
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdDbMatchProperties")] public class MatchProperties : RXObject
Копировать Код
<Wrapper("OdDbMatchProperties")> Public Class MatchProperties Inherits RXObject
 Описание
 Этот класс является базовым для классов, реализующих копирование свойств между объектами чертежа.
 Топики
 Имя
 Описание
 MatchProperties Методы
 Ниже перечислены методы класса MatchProperties.
 Ссылки
 MatchProperties Методы, Топики, MatchProperties Методы
 Ваши комментарии по поводу этого топика: Послать отзыв!