Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Leader.Dimgap
 Послать отзыв
 Синтаксис
C#
Visual Basic
public double Dimgap;
Public Property Dimgap() As Double
 Описание
 Возвращает или устанавливает текущее значение DIMGAP для выноски. Если значение переопределено для объекта, то это переопределенное значение возвращается. В противном случае возвращается значение из размерности размерного стиля. Для получения дополнительной информации о DIMGAP смотрите секцию "Системные переменные" Руководства по командам nanoCAD.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Leader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!