Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Cell.ContentTypes
 Послать отзыв
 Свойство возвращает тип содержимого ячейки.
 Синтаксис
C#
Visual Basic
Копировать Код
public CellContentTypes ContentTypes;
Копировать Код
Public ReadOnly Property ContentTypes As CellContentTypes
 Возвращает
 Возвращает тип содержимого ячейки из перечисления Teigha.DatabaseServices.CellContentTypes.
 Описание
 Свойство возвращает тип содержимого ячейки.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Cell, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!