Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Curve.ReverseCurve
 Послать отзыв
 Метод изменяет направление параметризации кривой на противоположное - начало кривой становится ее концом и наоборот.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void ReverseCurve();
Копировать Код
Public virtual Function ReverseCurve()
 Описание
 Метод изменяет направление параметризации кривой на противоположное - начало кривой становится ее концом и наоборот.
 Ссылки
 Teigha.DatabaseServices.Curve, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!