Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Cylinder.IsClosed
 Послать отзыв
 Метод позволяет проверить, является ли основание данного цилиндра полной окружностью. Используется геометрическая точность по умолчанию.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsClosed();
Копировать Код
Public Function IsClosed() As Boolean
 Возвращает
 Возвращает true, если с используемой точностью основание данного цилиндра можно считать полной окружностью. В противном случае возвращает false.
 Описание
 Метод позволяет проверить, является ли основание данного цилиндра полной окружностью. Используется вызов метода Cylinder.IntersectWith(LinearEntity3d linearEntity, Tolerance tolerance) со значением геометрической точности, равным Tolerance.Global.
 Ссылки
 Teigha.Geometry.Cylinder, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!