Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Shape.Position
 Послать отзыв
 Свойство Position представляет координатную точку привязки данного объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d Position;
Копировать Код
Public Property Position As Point3d
 Возвращает
 Возвращает точку привязки объекта. Тип Point3d.
 Описание
 Свойство Position представляет координатную точку привязки данного объекта.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Shape, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!