Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.NurbSurface.IsClosedInV
 Послать отзыв
 Свойство позволяет проверить, является ли данная поверхность замкнутой в направлении v.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsClosedInV;
Копировать Код
Public ReadOnly Property IsClosedInV As Boolean
 Возвращает
 Возвращает true, если поверхность в указанном направлении является замкнутой. В противном случае возвращает false.
 Описание
 Свойство позволяет проверить, является ли данная поверхность замкнутой в направлении v.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.NurbSurface, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!