Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство DBText.Normal
 Послать отзыв
 Синтаксис
C#
Visual Basic
public Vector3d Normal;
Public Property Normal() As Vector3d
 Описание
 Обеспечивает доступ к вектору нормали к плоскости, содержащей текст. Вектор нормали задается в мировых координатах.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.DBText, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!