Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AuditInfo.FixErrors
 Послать отзыв
 Свойство позволяет определить, должны ли ошибки быть исправлены реализуемым объектом.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool FixErrors;
Копировать Код
Public Property FixErrors() As Boolean
 Возвращает
 Возвращает значение true, если ошибки должны быть исправлены реализуемым объектом. В противном случае возвращает false.
 Описание
 Свойство позволяет определить, должны ли ошибки быть исправлены реализуемым объектом.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.AuditInfo, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!