Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.SectionViewStyleDictionaryId
 Послать отзыв
 This is SectionViewStyleDictionaryId, a member of class Database.
 Синтаксис
C#
Visual Basic
public DatabaseServices::ObjectId SectionViewStyleDictionaryId;
Public Property SectionViewStyleDictionaryId() As DatabaseServices.ObjectId
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!