Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LayoutManager.DeleteLayout
 Послать отзыв
 Метод удаляет из текущей базы данных объект Layout с именем deleteName.
 Синтаксис
C#
Visual Basic
Копировать Код
public void DeleteLayout( ref String deleteName );
Копировать Код
Public Sub DeleteLayout( ByRef deleteName As String )
 Параметры
 Параметры
 Описание
 deleteName
 Имя удаляемого объекта Layout, тип string.
 Описание
 Метод удаляет из текущей базы данных объект Layout с именем deleteName.
 Ссылки
 Teigha.DatabaseServices.LayoutManager, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!