Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Entity.GetTransformedCopy(Matrix3d)
 Послать отзыв
 Метод создает копию геометрического объекта и применяет к ней заданное преобразование с помощью матрицы transform, после чего возвращает преобразованный клон.
 Внимание: для сложных объектов, таких как полилинии, метод может привести к некорректному состоянию чертежа из-за разделяемого владения вложенными объектами.
 Синтаксис
C#
Visual Basic
Копировать Код
public Entity GetTransformedCopy(Matrix3d transform);
Копировать Код
Public Function GetTransformedCopy(transform As Matrix3d) As Entity
 Параметры
 Параметры
 Описание
 transform
 Матрица для преобразования копии геометрического объекта
 Возвращает
 Метод возвращает новый экземпляр геометрического объекта типа Entity, представляющий собой копию исходного объекта, к которой применена указанная матрица преобразования (transform).
 Если преобразование выполнить не удалось (например, из-за некорректной матрицы или особенностей внутренней структуры объекта), метод может вернуть null.
 Описание
 Использование метода
 Этот метод создает клон геометрического объекта, применяет матрицу преобразования transform и затем возвращает этот преобразованный клон.
 Предупреждение: Для встроенных в nanoCAD комплексных объектов, таких как полилиния, этот метод создает неполный клон только с заголовком геометрического объекта, который также является владельцем множества объектов, которыми владеет исходный объект (такими, как вершины полилинии), которые затем преобразуются с помощью матрицы transform. Это приводит к разрушению чертежа (два заголовка геометрического объекта владеют одни и тем же набором объектов), так же как и преобразование исходного множества геометрических объектов, у которых данный объект является владельцем, вместо копирования набора объектов.
 Разработка метода в производных классах
 Реализация этого метода в классе Entity по умолчанию должна быть достаточной для большинства наследуемых типов геометрических объектов. Однако, наследуемые классы геометрических объектов, которые хотят поддерживать нестандартный масштаб или неортогональные преобразования, требуют переопределения этого метода со своей собственной реализацией.
 Этот метод должен создать копию геометрического объекта (используя динамически распределяемую память), применить матрицу преобразования transform к копии и затем вернуть результат преобразования этой копии.
 Определение того, что составляет корректную матрицу преобразования и какой тип клонирования объекта должен делаться — ограниченное (с помощь метода clone()), полное копирование (если геометрический объект владеет другими объектами) или без клонирования (это делает метод не операционным) возлагается на разработчика.
 Реализация по умолчанию
 Если геометрический объект представлен в универсальном масштабе и в ортогональных координатах, метод Entity.GetTransformedCopy может вызвать метод clone() для создания клона геометрического объекта, затем вызвать Entity.TransformBy() с этим клоном и вернуть результат этого преобразования клона.
 Ссылки
 Teigha.DatabaseServices.Entity, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!