Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PolygonMesh.NSize
 Послать отзыв
 Свойство предоставляет доступ к количеству вершин в направлении N.
 Синтаксис
C#
Visual Basic
Копировать Код
public short NSize;
Копировать Код
Public Property NSize() As short
 Возвращает
 Возвращает или задает значение N, тип short.
 Описание
 Свойство предоставляет доступ к количеству вершин в направлении N.
 Если тип сети PolyMeshType равен SimpleMesh, это количество вершин будет использоваться для создания N столбцов в PolygonMesh. Для любого другого типа сети в качестве размера столбца будет использоваться поверхностная плотность N.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.PolygonMesh, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!