Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.OffsetSurface.IsTorus
 Послать отзыв
 Свойство IsTorus позволяет определить, является ли поверхность смещения тором.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsTorus;
Копировать Код
Public ReadOnly Property IsTorus As Boolean
 Возвращает
 Возвращает true, если поверхность смещения является тором. В противном случае возвращает false.
 Описание
 Свойство IsTorus позволяет определить, является ли поверхность смещения тором.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.OffsetSurface, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!