Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeader.AddLeader
 Послать отзыв
 Метод позволяет добавить к данному объекту MLeader новый кластер выноски, состоящий из выносной линии и полки.
 Синтаксис
C#
Visual Basic
Копировать Код
public int AddLeader();
Копировать Код
Public Function AddLeader() As Integer
 Возвращает
 Возвращает индекс добавленного кластера. Тип int.
 Описание
 Метод позволяет добавить к данному объекту MLeader новый кластер выноски, состоящий из выносной линии и полки.
 Ссылки
 Teigha.DatabaseServices.MLeader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!