Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SecurityActions
 Послать отзыв
 Данное перечисление определяет связанные с шифрованием операции, которые могут запрашиваться в процессе файлового ввода-вывода.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum SecurityActions { AddTimeStamp = 32, EncryptData = 1, EncryptProperties = 2, SignData = 16 }
Копировать Код
Public Enum SecurityActions AddTimeStamp = 32 EncryptData = 1 EncryptProperties = 2 SignData = 16 End Enum
 Члены
 Члены
 Описание
 AddTimeStamp
 Значение: 32. Добавить временную метку.
 EncryptData
 Значение: 1. Шифровать данные DWG и DXF.
 EncryptProperties
 Значение: 2. Шифровать свойства DWG и DXF.
 SignData
 Значение: 16. Подписать данные.
 Описание
 Данное перечисление определяет связанные с шифрованием операции, которые могут запрашиваться в процессе файлового ввода-вывода.
 Ваши комментарии по поводу этого топика: Послать отзыв!