Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector3d.X
 Послать отзыв
 Свойство возвращает значение X-координаты данного вектора.
 Синтаксис
C#
Visual Basic
Копировать Код
public double X;
Копировать Код
Public Property X() As Double
 Возвращает
 Возвращает значение координаты X данного вектора. Тип double.
 Описание
 Свойство возвращает значение X-координаты данного вектора.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.Vector3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!