Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CircularArc3d.GetPlane
 Послать отзыв
 Метод позволяет найти плоскость, в которой лежит данная дуга.
 Синтаксис
C#
Visual Basic
Копировать Код
public Plane GetPlane();
Копировать Код
Public Function GetPlane() As Plane
 Возвращает
 Возвращает плоскость, в которой лежит эта дуга. Тип Plane.
 Описание
 Метод позволяет найти плоскость, в которой лежит данная дуга.
 Ссылки
 Teigha.Geometry.CircularArc3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!