Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.UnderlayItemCollection
 Послать отзыв
 Класс UnderlayItemCollection представляет коллекцию для объектов UnderlayItem.
 Иерархия классов
Teigha::DatabaseServices::UnderlayItemCollection
 Синтаксис
C#
Visual Basic
Копировать Код
[DefaultMember("Item")] public sealed class UnderlayItemCollection : ICollection
Копировать Код
<DefaultMember("Item")> Public NotInheritable Class UnderlayItemCollection Implements ICollection
 Описание
 Класс UnderlayItemCollection представляет коллекцию для объектов UnderlayItem.
 Топики
 Имя
 Описание
 UnderlayItemCollection Методы
 Ниже перечислены методы класса UnderlayItemCollection.
 UnderlayItemCollection Свойства
 Ниже перечислены свойства класса UnderlayItemCollection.
 Ссылки
 UnderlayItemCollection Методы, UnderlayItemCollection Свойства, Топики, UnderlayItemCollection Методы, UnderlayItemCollection Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!