Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ObjectId.IsErased
 Послать отзыв
 Свойство возвращает true, если объект, связанный с данным ObjectId, удален.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsErased;
Копировать Код
Public Property IsErased() As Boolean
 Возвращает
 Возвращает true, если объект, связанный с данным ObjectId, удален. В противном случае возвращает false.
 Описание
 Свойство возвращает true, если объект, связанный с данным ObjectId, удален.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.ObjectId, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!