Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SymbolUtilityServices.IsLayerZeroName
 Послать отзыв
 Метод позволяет проверить, соответствует ли входная строка имени слоя "0".
 Синтаксис
C#
Visual Basic
Копировать Код
public static bool IsLayerZeroName( ref String name );
Копировать Код
Public Shared Function IsLayerZeroName( ByRef name As String ) As Boolean
 Параметры
 Параметры
 Описание
 name
 Проверяемое имя. Тип String.
 Возвращает
 Возвращает true, если строка name соответствует имени слоя "0". В противном случае возвращает false.
 Описание
 Метод позволяет проверить, соответствует ли входная строка имени слоя "0".
 Ссылки
 Teigha.DatabaseServices.SymbolUtilityServices, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!