Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MentalRayRenderSettings.FinalGatheringEnabled
 Послать отзыв
 Свойство FinalGatheringEnabled позволяет определить, включен ли режим финальной сборки.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool FinalGatheringEnabled;
Копировать Код
Public Property FinalGatheringEnabled As Boolean
 Возвращает
 Возвращает true, если режим финальной сборки активен. В противном случае возвращает false.
 Описание
 Свойство FinalGatheringEnabled позволяет определить, включен ли режим финальной сборки.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MentalRayRenderSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!