Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeaderStyle.BreakSize
 Послать отзыв
 Свойство представляет величину разрыва выносных линий, предусмотренную данным стилем.
 Синтаксис
C#
Visual Basic
Копировать Код
public double BreakSize;
Копировать Код
Public Property BreakSize As Double
 Возвращает
 Возвращает величину разрыва выносных линий. Тип double.
 Описание
 Свойство представляет величину разрыва выносных линий, предусмотренную данным стилем.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MLeaderStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!