Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GraphicsMetafileType
 Послать отзыв
 Данное перечисление определяет, какие данные могут находиться в графическом метафайле прокси-объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum GraphicsMetafileType { NoMetafile = 0, BoundingBox = 1, FullGraphics = 2 }
Копировать Код
Public Enum GraphicsMetafileType NoMetafile = 0 BoundingBox = 1 FullGraphics = 2 End Enum
 Члены
 Члены
 Описание
 NoMetafile
 Значение: 0. Отсутствует не только графическое представление, но и габаритный бокс.
 BoundingBox
 Значение: 1. Доступен лишь габаритный бокс.
 FullGraphics
 Значение: 2. Имеется графическое представление.
 Описание
 Данное перечисление определяет, какие данные могут находиться в графическом метафайле прокси-объекта.
 Ваши комментарии по поводу этого топика: Послать отзыв!