Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FeatureControlFrame.Dimtxsty
 Послать отзыв
 Свойство Dimtxsty представляет текущее значение системной переменной DIMTXSTY, которая определяет текстовый стиль размерного текста.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectId Dimtxsty;
Копировать Код
Public Property Dimtxsty As ObjectId
 Возвращает
 Возвращает идентификатор объекта текстового стиля размерного текста. Тип ObjectId.
 Описание
 Свойство Dimtxsty представляет текущее значение системной переменной DIMTXSTY, которая определяет текстовый стиль размерного текста.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.FeatureControlFrame, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!