Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.UnderlayReference.DefaultFade
 Послать отзыв
 Свойство DefaultFade представляет значение затухания по умолчанию.
 Синтаксис
C#
Visual Basic
Копировать Код
public static int DefaultFade;
Копировать Код
Public Shared ReadOnly Property DefaultFade As Integer
 Возвращает
 Возвращает значение затухания. Тип int.
 Описание
 Свойство DefaultFade представляет значение затухания по умолчанию.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.UnderlayReference, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!