Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство IdPair.IsOwnerTranslated
 Послать отзыв
 This is IsOwnerTranslated, a member of class IdPair.
 Синтаксис
C#
Visual Basic
public bool IsOwnerTranslated;
Public Property IsOwnerTranslated() As bool
 Ссылки
 IdPair Структура, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!