Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SymbolUtilityServices.IsTextStyleStandardName
 Послать отзыв
 Метод позволяет проверить, соответствует ли входная строка имени стиля текста "Standard".
 Синтаксис
C#
Visual Basic
Копировать Код
public static bool IsTextStyleStandardName( ref String name );
Копировать Код
Public Shared Function IsTextStyleStandardName( ByRef name As String ) As Boolean
 Параметры
 Параметры
 Описание
 name
 Проверяемое имя. Тип String.
 Возвращает
 Возвращает true, если входная строка name соответствует имени стиля текста "Standard". В противном случае возвращает false.
 Описание
 Метод позволяет проверить, соответствует ли входная строка имени стиля текста "Standard".
 Ссылки
 Teigha.DatabaseServices.SymbolUtilityServices, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!