Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Viewport.SetUcs
 Послать отзыв
 Метод позволяет задать в видовом экране пользовательскую систему координат, используя указанный тип ортогонального вида.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetUcs( OrthographicView view );
Копировать Код
Public Sub SetUcs( view As OrthographicView )
 Параметры
 Параметры
 Описание
 view
 Тип ортогонального вида. Перечисление OrthographicView.
 Описание
 Метод позволяет задать в видовом экране пользовательскую систему координат (ПСК, UCS), используя указанный тип ортогонального вида.
 Ссылки
 Teigha.DatabaseServices.Viewport, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!