Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.EllipticalCone.GetHalfAngles
 Послать отзыв
 Метод предоставляет косинус и синус половинного угла данного эллиптического конуса.
 Синтаксис
C#
Visual Basic
Копировать Код
public double[] GetHalfAngles();
Копировать Код
Public Function GetHalfAngles() As Double()
 Возвращает
 Возвращает двухэлементный массив. Первый элемент массива соответствует косинусу половинного угла, а второй элемент - синусу половинного угла. Тип double[].
 Описание
 Метод предоставляет косинус и синус половинного угла данного эллиптического конуса в виде двухэлементного массива.
 Ссылки
 Teigha.Geometry.EllipticalCone, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!