Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.SetGridColor
 Послать отзыв
 Метод позволяет задать цвет для данного типа линий сетки и типа строки объекта Table.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetGridColor( ref Color color, int borders, int rows );
Копировать Код
Public virtual Sub SetGridColor( ByRef color As Color, borders As Integer, rows As Integer )
 Параметры
 Параметры
 Описание
 color
 Новый цвет линий. Тип Color.
 borders
 Тип линий сетки, int. См. перечисление Teigha.DatabaseServices.GridLineType.
 rows
 Тип строки, для которой меняется цвет сетки, int. См. перечисление RowType.
 Описание
 Метод позволяет задать цвет для данного типа линий сетки и типа строки объекта Table. Можно комбинировать различные типы линий и типы строк.
 Замечания
 Для получения того же результата предпочтительнее использовать функционал объекта Cell.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!