Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.LineSegment3d.StartPoint
 Послать отзыв
 Свойство StartPoint представляет начальную точку данного линейного сегмента.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d StartPoint;
Копировать Код
Public ReadOnly Property StartPoint As Point3d
 Возвращает
 Возвращает начальную точку линейного сегмента. Тип Point3d.
 Описание
 Свойство StartPoint представляет начальную точку данного линейного сегмента.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.LineSegment3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!