Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AttributeReference.IsConstant
 Послать отзыв
 Свойство предоставляет доступ к флагу, который определяет, является ли данный объект AttributeReference постоянным.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsConstant;
Копировать Код
Public Property IsConstant() As Boolean
 Возвращает
 Возвращает true, если данный объект AttributeReference является постоянным. В противном случае возвращает false.
 Описание
 Свойство предоставляет доступ к флагу, который определяет, является ли данный объект AttributeReference постоянным.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.AttributeReference, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!