Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocArrayPathParameters.ItemCount
 Послать отзыв
 Свойство обеспечивает доступ к количеству элементов в массиве.
 Синтаксис
C#
Visual Basic
Копировать Код
public int ItemCount;
Копировать Код
Public Property ItemCount() As Integer
 Возвращает
 Возвращает количество элементов в массиве. Тип int.
 Описание
 Свойство обеспечивает доступ к количеству элементов в массиве.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.AssocArrayPathParameters, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!