Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.XrefGraphNode.Database
 Послать отзыв
 Свойство Database представляет базу данных, соответствующую данному узлу.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.Database Database;
Копировать Код
Public ReadOnly Property Database As DatabaseServices.Database
 Возвращает
 Возвращает базу данных для данного объекта. Тип DatabaseServices.Database.
 Описание
 Свойство Database представляет базу данных, соответствующую данному узлу.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.XrefGraphNode, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!