Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Entity.GetGraphicsMarkersAtSubentityPathIntPtr(FullSubentityPath)
 Послать отзыв
 Метод предназначен для возврата всех маркеров графической системы (GS-маркеров) по путям подобъектов для сложных сущностей, которые поддерживают связывание целочисленного идентификатора с каждым графическим примитивом или группами примитивов во время отрисовки. Объекты чертежа используют механизм маркеров графической системы для отрисовки самих себя, при этом каждый графический примитив или группа примитивов связываются с уникальным целочисленным идентификатором, называемым GS-маркером. С помощью специальных механизмов выбора GS-маркер выбранного на экране подобъекта может быть получен и использован для различных целей, таких как выделение/снятие выделения, скрытие/отображение подобъекта и других операций.
 Синтаксис
C#
Visual Basic
Копировать Код
public IntPtrCollection GetGraphicsMarkersAtSubentityPathIntPtr(FullSubentityPath subPath);
Копировать Код
Public Function GetGraphicsMarkersAtSubentityPathIntPtr(subPath As FullSubentityPath) As IntPtrCollection
 Параметры
 Параметры
 Описание
 subPath
 Объект, который содержит свойство SubentId с информацией для определения геометрического подобъекта (подобъектов), для которых требуется определение GS маркера. Тип FullSubentityPath
 Описание
 Геометрические объекты используют различные геометрические примитивы при своем графическом отображении. Частью этого механизма является способность установки соответствия целого идентификатора, называемого графически системным маркером (или GS маркером) с каждым примитивом или группой примитивов. Посредством использования определенных механизмов отбора, GS маркер для реального геометрического подобъекта, выбранного на экране, может быть получен и, вместе с некоторой другой информацией, передан в данный метод, и использоваться этим и некоторыми другими методами для различных целей, таких как подсветка и отмена подсветки геометрических подобъектов на экране.
 Использование метода
 Этот метод использует свойство SubentId с объектом subPath для определения, какой GS маркер является подходящим для геометрического объекта. Любой соответствующий GS маркер добавляется к возвращаемой коллекции.
 Id объекта subPath не используется, и нет необходимости заполнять этот Id.
 Необходимо, чтобы в объекте SubentId внутри subPath были заполнены требуемый SubentityType и корректное значение индекса (которое может быть или не быть в действительности значением GS маркера).
 Обычно, этот метод вызывается с объектом FullSubentityPath, который заполняется методом Entity.GetSubentityPathsAtGraphicsMarker().
 Разработка метода в производных классах
 Этот метод должен быть в состоянии правильно интерпретировать значения SubentityType и индекса в свойстве SubentId в subPath, для того чтобы определить GS маркеры для соответствующего геометрического подобъекта (или подобъектов). Таким образом, GS маркеры определяются и затем добавляются к возвращаемой коллекции.
 Значение индекса объекта SubentId может иметь те значения, которые вы захотите (часто это просто GS маркеры), но, если он реализован, метод GetSubentityPathsAtGraphicsMarker() должен быть в состоянии вычислить их, базируясь на предоставленном GS маркере и, если он реализован, метод GetSubentity() должен быть в состоянии интерпретировать их для определения соответствующего геометрического подобъекта (или подобъектов).
 Возвращает коллекцию указателя(-ей) на GS маркера(-ов) для геометрического подобъекта (подобъектов). Note Методы Entity.Highlight() и Entity.Unhighlight() оба вызывают данный метод для получения GS маркеров, связанных с FullSubentityPath. Если данный метод не переопределен, то и указанные методы не работают.
 Ссылки
 Teigha.DatabaseServices.Entity, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!