Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DataCellCollection.Remove
 Послать отзыв
 Метод удаляет из коллекции элемент, соответствующий входному объекту DataCell.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Remove( ref DataCell value );
Копировать Код
Public Sub Remove( ByRef value As DataCell )
 Параметры
 Параметры
 Описание
 value
 Удаляемый из коллекции элемент. Тип DataCell.
 Описание
 Метод удаляет из коллекции элемент, соответствующий входному объекту DataCell.
 Ссылки
 Teigha.DatabaseServices.DataCellCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!