Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SecurityParameters.Subject
 Послать отзыв
 Свойство Subject представляет имя субъекта сертификата (цифрового ID).
 Синтаксис
C#
Visual Basic
Копировать Код
public String Subject;
Копировать Код
Public Property Subject As String
 Возвращает
 Возвращает имя субъекта сертификата. Тип String.
 Описание
 Свойство Subject представляет имя субъекта сертификата (цифрового ID).
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.SecurityParameters, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!