Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.VertexRef.Point
 Послать отзыв
 Свойство Point представляет координатную точку данной ссылки на вершину.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d Point;
Копировать Код
Public ReadOnly Property Point As Point3d
 Возвращает
 Возвращает координатную 3D-точку вершины. Тип Point3d.
 Описание
 Свойство Point представляет координатную 3D-точку данной ссылки на вершину.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.VertexRef, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!