Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SkyBackground.GetDrawableType
 Послать отзыв
 Метод предоставляет тип отображаемого объекта DrawableType для данного объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public GraphicsInterface.DrawableType GetDrawableType();
Копировать Код
Public Function GetDrawableType() As GraphicsInterface.DrawableType
 Возвращает
 Возвращает тип отображаемого объекта DrawableType для данного объекта. Тип GraphicsInterface.DrawableType.
 Описание
 Метод предоставляет тип отображаемого объекта DrawableType для данного объекта.
 Ссылки
 Teigha.DatabaseServices.SkyBackground, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!