Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.UnderlayItemCollection.CopyTo
 Послать отзыв
 Метод предназначен для копирования коллекции элементов подложки в указанный массив, начиная с указанного индекса.
 Синтаксис
C#
Visual Basic
Копировать Код
public void CopyTo( ref UnderlayItem[] arr, int index );
Копировать Код
Public Sub CopyTo( ByRef arr() As UnderlayItem, index As Integer )
 Параметры
 Параметры
 Описание
 arr
 Целевой массив, в который копируются элементы подложки. Тип UnderlayItem[].
 index
 Начальный индекс массива, начиная с которого в массиве располагаются копируемые элементы. Тип int.
 Описание
 Метод предназначен для копирования коллекции элементов подложки в указанный массив, начиная с указанного индекса.
 Ссылки
 Teigha.DatabaseServices.UnderlayItemCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!