Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBDictionaryEntry.DBDictionaryEntry
 Послать отзыв
 Этот конструктор создает новый экземпляр класса DBDictionaryEntry с заданными ключом и значением ObjectId.
 Синтаксис
C#
Visual Basic
Копировать Код
public DBDictionaryEntry( ref String key, ObjectId value );
Копировать Код
Public Sub New( ByRef key As String, value As ObjectId )
 Параметры
 Параметры
 Описание
 key
 Строковый ключ записи.
 value
 Идентификатор ObjectId объекта в данной записи .
 Возвращает
 Новый экземпляр класса DBDictionaryEntry.
 Описание
 Этот конструктор создает новый экземпляр класса DBDictionaryEntry с заданными ключом и значением ObjectId.
 Ссылки
 Teigha.DatabaseServices.DBDictionaryEntry, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!