Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.TableBreakOptions
 Послать отзыв
 Перечисление TableBreakOptions определяет поддерживаемые параметры разрывов в таблице.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum TableBreakOptions { None = 0, EnableBreaking = 1, RepeatTopLabels = 2, RepeatBottomLabels = 4, AllowManualPositions = 8, AllowManualHeights = 16 }
Копировать Код
Public Enum TableBreakOptions None = 0 EnableBreaking = 1 RepeatTopLabels = 2 RepeatBottomLabels = 4 AllowManualPositions = 8 AllowManualHeights = 16 End Enum
 Члены
 Члены
 Описание
 None
 Значение: 0. Параметры разрывов не заданы.
 EnableBreaking
 Значение: 1. Включить вставку разрывов в таблице.
 RepeatTopLabels
 Значение: 2. Повторять верхние метки во всех таблицах.
 RepeatBottomLabels
 Значение: 4. Повторять нижние метки во всех таблицах.
 AllowManualPositions
 Значение: 8. Разрешить ручное позиционирование индивидуально для всех таблиц.
 AllowManualHeights
 Значение: 16. Разрешить переопределение максимальной высоты для отдельных таблиц.
 Описание
 Перечисление TableBreakOptions определяет поддерживаемые параметры разрывов в таблице.
 Ваши комментарии по поводу этого топика: Послать отзыв!