Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.TableHitTestInfo.Column
 Послать отзыв
 Свойство Column представляет индекс столбца таблицы.
 Синтаксис
C#
Visual Basic
Копировать Код
public int Column;
Копировать Код
Public ReadOnly Property Column As Integer
 Возвращает
 Возвращает индекс столбца таблицы. Тип int.
 Описание
 Свойство Column представляет индекс столбца таблицы.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.TableHitTestInfo, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!