Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Solid3d.CreateSweptSolid
 Послать отзыв
 Метод создает трехмерное твердое тело вытягиванием указанной кривой, области или плоской поверхности по заданной траектории.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void CreateSweptSolid( ref Entity sweepEntity, ref Entity pathEntity, ref SweepOptions sweepOptions );
Копировать Код
Public Overridable Sub CreateSweptSolid( ByRef sweepEntity As Entity, ByRef pathEntity As Entity, ByRef sweepOptions As SweepOptions )
 Параметры
 Параметры
 Описание
 sweepEntity
 Объект чертежа, который служит профилем для операции вытягивания по траектории. Тип Entity.
 pathEntity
 Объект кривой, которая представляет траекторию вытягивания профиля. Тип Entity.
 sweepOptions
 Настройки операции вытягивания по траектории. Тип SweepOptions.
 Описание
 Метод создает трехмерное твердое тело вытягиванием указанной кривой, области или плоской поверхности по заданной траектории. Реализован только в среде пространственного моделирования.
 Замечания
 По умолчанию объект SweepOptions использует для выравнивания опцию SweepOptionsAlignOption.NoAlignment. Значение выравнивания SweepOptionsAlignOption.kAlignSweepEntityToPath следует задать до вызова этого метода.
 Ссылки
 Teigha.DatabaseServices.Solid3d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!