Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.SplineEntity2d.GetContinuityAtKnot
 Послать отзыв
 Метод предоставляет степень наивысшей производной, которая определена в указанном узле. Предполагается использование точности по умолчанию. В текущей версии не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public int GetContinuityAtKnot( int index );
Копировать Код
Public Function GetContinuityAtKnot( index As Integer ) As Integer
 Параметры
 Параметры
 Описание
 index
 Индекс узла. Тип int.
 Возвращает
 Возвращает степень наивысшей производной в указанном узле. Тип int. Если первая производная в этом узле не определена, метод возвращает 0.
 Описание
 Метод предоставляет степень наивысшей производной, которая определена в указанном узле. Предполагается использование точности по умолчанию.
 Замечания
 В текущей версии этот метод не реализован.
 Ссылки
 Teigha.Geometry.SplineEntity2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!