Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CellContent.TextString
 Послать отзыв
 Свойство TextString обеспечивает доступ к текстовому представлению содержимого ячейки.
 Синтаксис
C#
Visual Basic
Копировать Код
public String TextString;
Копировать Код
Public Property TextString As String
 Возвращает
 Возвращает строку, которая представляет содержимое ячейки. Тип String.
 Описание
 Свойство TextString обеспечивает доступ к текстовому представлению содержимого ячейки.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.CellContent, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!