Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DxfFiler.WriteUInt64
 Послать отзыв
 Метод записывает в данный объект Filer указанное 64-разрядное целое число без знака (unsigned long long).
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract void WriteUInt64( DxfCode opCode, unsigned long long value );
Копировать Код
Public MustOverride Sub WriteUInt64( opCode As DxfCode, value As unsigned long long )
 Параметры
 Параметры
 Описание
 opCode
 Групповой код DXF. Тип DxfCode.
 value
 Значение, которое следует записать. Тип unsigned long long.
 Описание
 Метод записывает в данный объект Filer указанные групповой код DXF и 64-разрядное целое число без знака (unsigned long long).
 Ссылки
 Teigha.DatabaseServices.DxfFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!