Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MlineStyle.Set
 Послать отзыв
 Метод делает данный объект копией указанного объекта MlineStyle.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Set( ref MlineStyle source, bool checkIfReferenced );
Копировать Код
Public Sub [Set]( ByRef source As MlineStyle, checkIfReferenced As Boolean )
 Параметры
 Параметры
 Описание
 source
 Объект-источник. Тип MlineStyle.
 checkIfReferenced
 Флаг, указывающий, следует ли проверять наличие ссылок на этот стиль. Тип bool. В текущей версии не используется.
 Описание
 Метод делает данный объект копией указанного объекта MlineStyle.
 Ссылки
 Teigha.DatabaseServices.MlineStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!