Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.TableTemplate.Capture
 Послать отзыв
 Метод позволяет захватить шаблон таблицы.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Capture( ref Table table, TableCopyOptions copyOption );
Копировать Код
Public Sub Capture( ByRef table As Table, copyOption As TableCopyOptions )
 Параметры
 Параметры
 Описание
 table
 Исходная таблица. Тип Table.
 copyOption
 Опции копирования, определяющие, что именно требуется захватывать из шаблона. Перечисление TableCopyOptions.
 Описание
 Метод позволяет захватить шаблон таблицы.
 Ссылки
 Teigha.DatabaseServices.TableTemplate, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!