Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PolygonMeshVertex.PolygonMeshVertex
 Послать отзыв
 Конструктор класса PolygonMeshVertex. Создает экземпляр класса в заданной пространственной точке.
 Синтаксис
C#
Visual Basic
Копировать Код
public PolygonMeshVertex( Point3d point );
Копировать Код
Public Sub New( point As Point3d )
 Параметры
 Параметры
 Описание
 point
 Координаты создаваемой вершины в мировой системе координат (WCS). Тип Point3d.
 Описание
 Конструктор класса PolygonMeshVertex. Создает экземпляр класса в заданной пространственной точке.
 Ссылки
 Teigha.DatabaseServices.PolygonMeshVertex, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!