Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CircularArc2d.CircularArc2d
 Послать отзыв
 Конструктор класса CircularArc2d. Создает окружность с заданными центром и радиусом.
 Синтаксис
C#
Visual Basic
Копировать Код
public CircularArc2d( Point2d center, double radius );
Копировать Код
Public Sub New( center As Point2d, radius As Double )
 Параметры
 Параметры
 Описание
 center
 Входной центр окружности. Тип Point2d.
 radius
 Входной радиус окружности. Тип double.
 Описание
 Конструктор класса CircularArc2d. Создает окружность с заданными центром center и радиусом radius.
 Ссылки
 Teigha.Geometry.CircularArc2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!