Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FileDependencyManager.GetEntry
 Послать отзыв
 Метод предоставляет запись с указанным индексом в разделе .dwg списка файловых зависимостей.
 Синтаксис
C#
Visual Basic
Копировать Код
public FileDependencyInfo GetEntry( int fdlIndex );
Копировать Код
Public Function GetEntry( fdlIndex As Integer ) As FileDependencyInfo
 Параметры
 Параметры
 Описание
 fdlIndex
 Входное значение индекса записи в списке файловых зависимостей. Тип int.
 Возвращает
 Возвращает найденную запись. Тип FileDependencyInfo.
 Описание
 Метод предоставляет запись FileDependencyInfo с указанным индексом в разделе .dwg списка файловых зависимостей.
 Ссылки
 Teigha.DatabaseServices.FileDependencyManager, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!