Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DataTable.Assign
 Послать отзыв
 Метод копирует в эту таблицу данные из указанной таблицы. Не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Assign( ref DataTable other );
Копировать Код
Public Sub Assign( ByRef other As DataTable )
 Параметры
 Параметры
 Описание
 other
 Входная таблица, которая служит источником данных. Тип DataTable.
 Описание
 Метод копирует в эту таблицу данные из указанной таблицы. Не реализован.
 Ссылки
 Teigha.DatabaseServices.DataTable, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!