Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FieldResult.setEvaluationStatus
 Послать отзыв
 Метод задает статус вычисления поля.
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract void setEvaluationStatus( FieldEvaluationStatus errorStatus, int errorCode, ref String errorMessage );
Копировать Код
Public MustOverride Sub setEvaluationStatus( errorStatus As FieldEvaluationStatus, errorCode As Integer, ByRef errorMessage As String )
 Параметры
 Параметры
 Описание
 errorStatus
 Статус ошибки. Перечисление FieldEvaluationStatus.
 errorCode
 Код ошибки. Тип int.
 errorMessage
 Описание ошибки. Тип String.
 Описание
 Метод задает статус вычисления поля, который включает собственно статус, а также код и описание ошибки.
 Ссылки
 Teigha.DatabaseServices.FieldResult, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!