Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Database.XBindXrefs
 Послать отзыв
 Синтаксис
C#
Visual Basic
public void XBindXrefs(ref ObjectIdCollection xrefSymbolIds, bool insertBind);
Public Sub XBindXrefs(ByRef xrefSymbolIds As ObjectIdCollection, insertBind As bool)
 Параметры
 Параметры
 Описание
 xrefSymbolIds
 Коллекция Id объектов SymbolTableRecord, которые должны быть связаны
 insertBind
 Признак, указывающий, должны ли быть конвертированы символы внешней ссылки при вставке
 Описание
 Метод связывает записи таблицы символов, чьи Id содержатся в xrefSymbolIds. Если insertBind равен true, то затем имена записей таблицы символов будут изменены из имен внешних ссылок в обычные, вставленные в таблицу символов, имена записей.
 Id объектов в xrefSymbolIds все должны быть из работающей базы данных и все должны быть из разрешенных внешних ссылок.
 xrefSymbolIds может содержать Id объектов следующих типов — BlockTableRecord, LayerTableRecord, LinetypeTableRecord, TextStyleTableRecord (если они не представляют файл формы), RegAppTableRecord and DimStyleTableRecord.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!