Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DimAssoc.RemovePointRef
 Послать отзыв
 Метод удаляет (возможно, принудительно), указатель на опорную точку, которая связывает размер с соответствующей геометрией.
 Синтаксис
C#
Visual Basic
Копировать Код
public void RemovePointRef( bool force );
Копировать Код
Public Sub RemovePointRef( force As Boolean )
 Параметры
 Параметры
 Описание
 force
 Входной флаг, определяющий, следует ли принудительно удалять точки привязки. Тип bool.
 Описание
 Метод удаляет (возможно, принудительно), указатель на опорную точку, которая связывает размер с соответствующей геометрией.
 Ссылки
 Teigha.DatabaseServices.DimAssoc, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!