Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DynamicBlockReferenceProperty.GetAllowedValues
 Послать отзыв
 Метод позволяет получить массив допустимых значений для данного свойства динамического блока.
 Синтаксис
C#
Visual Basic
Копировать Код
public object[] GetAllowedValues();
Копировать Код
Public Function GetAllowedValues() As Object()
 Возвращает
 Возвращает массив допустимых значений. Тип Object[].
 Описание
 Метод позволяет получить массив допустимых значений для данного свойства динамического блока.
 Ссылки
 Teigha.DatabaseServices.DynamicBlockReferenceProperty, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!