Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Interval.LowerBound
 Послать отзыв
 Свойство LowerBound представляет нижнюю границу данного интервала. Возвращаемое значение имеет смысл только в случае интервала, ограниченного снизу.
 Синтаксис
C#
Visual Basic
Копировать Код
public double LowerBound;
Копировать Код
Public ReadOnly Property LowerBound As Double
 Возвращает
 Возвращает нижнюю границу данного интервала. Тип double.
 Описание
 Свойство LowerBound представляет нижнюю границу данного интервала. Возвращаемое значение имеет смысл только в случае интервала, ограниченного снизу.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.Interval, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!