Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.NurbsData.ControlPointTolerance
 Послать отзыв
 Свойство возвращает значение допуска, используемое для операций с управляющими вершинами NURBS.
 Синтаксис
C#
Visual Basic
Копировать Код
public double ControlPointTolerance;
Копировать Код
Public ReadOnly Property ControlPointTolerance As Double
 Возвращает
 Возвращает значение допуска для управляющих вершин. Тип double.
 Описание
 Свойство возвращает значение допуска, используемое для операций с управляющими вершинами NURBS.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.NurbsData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!