Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.OriginalFileName
 Послать отзыв
 This is OriginalFileName, a member of class Database.
 Синтаксис
C#
Visual Basic
public String OriginalFileName;
Public Property OriginalFileName() As String
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!