Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.TransactionManager.NumberOfActiveTransactions
 Послать отзыв
 Свойство возвращает количество активных транзакций.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual int NumberOfActiveTransactions;
Копировать Код
Public virtual Property NumberOfActiveTransactions() As Integer
 Возвращает
 Возвращает количество активных транзакций, тип int.
 Описание
 Свойство возвращает количество активных транзакций.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.TransactionManager, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!