Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotStyleData.LineEndStyle
 Послать отзыв
 Свойство LineEndStyle представляет текущий стиль концов линий, используемый в данном объекте.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.LineEndStyle LineEndStyle;
Копировать Код
Public Property LineEndStyle As DatabaseServices.LineEndStyle
 Возвращает
 Возвращает текущий стиль концов линий. Перечисление DatabaseServices.LineEndStyle.
 Описание
 Свойство LineEndStyle представляет текущий стиль концов линий, используемый в данном объекте.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.PlotStyleData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!