Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObject.Goodbye
 Послать отзыв
 Событие, вызываемое непосредственно перед удалением объекта из памяти.
 Синтаксис
C#
Visual Basic
Копировать Код
public event EventHandler Goodbye;
Копировать Код
Public Event Goodbye As EventHandler
 Возвращает
 Тип данных ObjectEventHandler, представляющий обработчик события.
 Описание
 Событие, вызываемое непосредственно перед удалением объекта из памяти.
 Ссылки
 Teigha.DatabaseServices.DBObject, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!