Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Material
 Послать отзыв
 Класс Material представляет свойства материала, используемые при визуализации затененных объектов.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::GraphicsInterface::Drawable Teigha::DatabaseServices::DBObject Teigha::DatabaseServices::Material
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("AcDbMaterial")] public class Material : DBObject;
Копировать Код
<Wrapper("AcDbMaterial")> Public Class Material Inherits DBObject
 Описание
 Класс Material представляет свойства материала, используемые при визуализации затененных объектов.
 Объект Material включает целый ряд компонентов затенения, включая диффузный, зеркальный, рассеянный, непрозрачности, отражения, рельефности, преломления. Каждый компонент определяет отдельный аспект затенения объекта сцены.
 Методы
 Конструкторы
 Teigha.GraphicsInterface.Drawable
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 Drawable
 Конструктор класса Teigha.GraphicsInterface.Drawable. (Унаследован от Drawable)
 Teigha.DatabaseServices.DBObject
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 DBObject
 Конструктор. (Унаследован от DBObject)
 Teigha.DatabaseServices.Material
 Имя
 Описание
 Material
 Конструктор по умолчанию класса Material.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.GraphicsInterface.Drawable
 Имя
 Описание
 Drawable Методы
 Ниже перечислены методы класса Drawable.
 Drawable Свойства
 Ниже перечислены свойства класса Drawable.
 Teigha.DatabaseServices.DBObject
 Имя
 Описание
 DBObject Методы
 Ниже перечислены методы класса DBObject.
 DBObject Свойства
 Ниже перечислены свойства класса DBObject.
 DBObject События
 Ниже перечислены события класса DBObject.
 Teigha.DatabaseServices.Material
 Имя
 Описание
 Material Свойства
 Ниже перечислены свойства класса Material.
 Ссылки
 Material Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства, DBObject События
 Ваши комментарии по поводу этого топика: Послать отзыв!