Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Cone.Height
 Послать отзыв
 Свойство Height обеспечивает доступ к параметрическому интервалу, который определяет высоту данного конуса.
 Синтаксис
C#
Visual Basic
Копировать Код
public Interval Height;
Копировать Код
Public Property Height As Interval
 Возвращает
 Возвращает параметрический интервал, определяющий высоту данного конуса. Тип Interval.
 Описание
 Свойство Height обеспечивает доступ к параметрическому интервалу, который определяет высоту данного конуса.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.Geometry.Cone, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!