Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.VisualStyleDictionaryId
 Послать отзыв
 Синтаксис
C#
Visual Basic
public DatabaseServices::ObjectId VisualStyleDictionaryId;
Public Property VisualStyleDictionaryId() As DatabaseServices.ObjectId
 Описание
 Возвращает Id словаря ACAD_VISUALSTYLE, который содержит объекты типа "визуальный стиль".
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!