Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector3d.LengthSqrd
 Послать отзыв
 Свойство возвращает квадрат длины данного вектора.
 Синтаксис
C#
Visual Basic
Копировать Код
public double LengthSqrd;
Копировать Код
Public Property LengthSqrd() As Double
 Возвращает
 Возвращает квадрат евклидовой длины данного вектора. Тип double.
 Описание
 Свойство возвращает квадрат евклидовой длины данного вектора.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.Vector3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!