Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор IdPair.IdPair
 Послать отзыв
 This is IdPair, a member of class IdPair.
 Синтаксис
C#
Visual Basic
public IdPair(ObjectId key, ObjectId value, bool isCloned, bool isPrimary, bool isOwnerTranslated);
Public Sub New(key As ObjectId, value As ObjectId, isCloned As bool, isPrimary As bool, isOwnerTranslated As bool)
 Ссылки
 IdPair Структура, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!