Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DxfFiler.ReadInt16
 Послать отзыв
 Метод возвращает 16-разрядное целое число со знаком из текущего элемента этого объекта Filer.
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract short ReadInt16();
Копировать Код
Public MustOverride Function ReadInt16() As Short
 Возвращает
 Возвращает 16-разрядное целое число со знаком. Тип short.
 Описание
 Метод возвращает 16-разрядное целое число со знаком из текущего элемента этого объекта Filer.
 virtual int ReadInt32() abstract;
 Ссылки
 Teigha.DatabaseServices.DxfFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!