Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Ray3d.Set
 Послать отзыв
 Метод переопределяет точку начала и направляющий вектор данного луча.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Set( Point3d point, Vector3d vector );
Копировать Код
Public Sub [Set]( point As Point3d, vector As Vector3d )
 Параметры
 Параметры
 Описание
 point
 Новая начальная точка луча. Тип Point3d.
 vector
 Направляющий вектор луча. Тип Vector3d. Должен иметь ненулевую длину.
 Описание
 Метод переопределяет точку начала и направляющий вектор данного луча.
 Ссылки
 Teigha.Geometry.Ray3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!