Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ObjectContext.Name
 Послать отзыв
 Свойство представляет имя данного контекста.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual String Name;
Копировать Код
Public Overridable Property Name As String
 Возвращает
 Возвращает имя контекста. Тип String.
 Описание
 Свойство представляет имя данного контекста.
 Имя контекста объекта может появляться в доступных пользователю компонентах пользовательского интерфейса и может изменяться, если контекст поддерживает переименование. По этой причине приложениям не следует использовать ссылки на контексты по именам контекстов. Для этого рекомендуется свойство UniqueIdentifier, предоставляющее гарантированно уникальный и неизменный идентификатор контекста.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.ObjectContext, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!