Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DwgFiler.WriteUInt32
 Послать отзыв
 Метод записывает в этот Filer указанное 32-разрядное целое число без знака (тип unsigned int).
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract void WriteUInt32( unsigned int value );
Копировать Код
Public MustOverride Sub WriteUInt32( value As unsigned int )
 Параметры
 Параметры
 Описание
 value
 Записываемое в Filer значение. Тип unsigned int.
 Описание
 Метод записывает в этот Filer указанное 32-разрядное целое число без знака (тип unsigned int).
 Ссылки
 Teigha.DatabaseServices.DwgFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!