Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector2d.Mirror
 Послать отзыв
 Метод позволяет получить вектор, который является результатом зеркального отражения данного вектора относительно заданного направления в той же плоскости.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector2d Mirror( Vector2d line );
Копировать Код
Public Function Mirror( line As Vector2d ) As Vector2d
 Параметры
 Параметры
 Описание
 line
 Линия зеркального отражения. Тип Vector2d.
 Возвращает
 Возвращает зеркальное отражение данного вектора. Тип Vector2d.
 Описание
 Метод позволяет получить вектор, который является результатом зеркального отражения данного вектора относительно заданного направления в той же плоскости.
 Ссылки
 Teigha.Geometry.Vector2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!