Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CircularArc2d.SetAngles
 Послать отзыв
 Метод позволяет переопределить углы начальной и конечной точек данной дуги.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetAngles( double startAngle, double endAngle );
Копировать Код
Public Sub SetAngles( startAngle As Double, endAngle As Double )
 Параметры
 Параметры
 Описание
 startAngle
 Новое значение начального угла. Тип double.
 endAngle
 Новое значение конечного угла. Тип double.
 Описание
 Метод позволяет переопределить углы начальной и конечной точек данной дуги.
 Ссылки
 Teigha.Geometry.CircularArc2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!