Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SectionSettings.SetDestinationBlock
 Послать отзыв
 Метод позволяет задать идентификатор целевого блока, который подлежит замене в процессе создания сечения, если для генерации сечения установлен флаг SectionGeneration.DestinationReplaceBlock.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetDestinationBlock( SectionType nSecType, DatabaseServices.ObjectId id );
Копировать Код
Public Sub SetDestinationBlock( nSecType As SectionType, id As DatabaseServices.ObjectId )
 Параметры
 Параметры
 Описание
 nSecType
 Тип сечения. Перечисление SectionType.
 id
 Идентификатор объекта блока. Тип DatabaseServices.ObjectId.
 Описание
 Метод позволяет задать идентификатор целевого блока, который подлежит замене в процессе создания сечения, если для генерации сечения установлен флаг SectionGeneration.DestinationReplaceBlock.
 Ссылки
 Teigha.DatabaseServices.SectionSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!