Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AbstractViewPE.IsFrontClipAtEyeOn
 Послать отзыв
 Свойство IsFrontClipAtEyeOn позволяет определить, проходит ли передняя плоскость отсечения через точку камеры.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsFrontClipAtEyeOn;
Копировать Код
Public Property IsFrontClipAtEyeOn As Boolean
 Возвращает
 Возвращает true, если передняя плоскость отсечения проходит через камеру. В противном случае возвращает false.
 Описание
 Свойство IsFrontClipAtEyeOn позволяет определить, проходит ли передняя плоскость отсечения через точку камеры.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.AbstractViewPE, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!