Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Database.ReadDwgFile (String^, FileOpenMode, bool, String^)
 Послать отзыв
 Синтаксис
C#
Visual Basic
public void ReadDwgFile(ref String fileName, FileOpenMode mode, bool allowCPConversion, ref String password);
Public Sub ReadDwgFile(ByRef fileName As String, mode As FileOpenMode, allowCPConversion As bool, ByRef password As String)
 Параметры
 Параметры
 Описание
 fileName
 Имя или URL читаемого файла
 mode
 Режим открытия
 allowCPConversion
 Переменная, определяющая режим разрешения конвертации между кодовыми страницами
 password
 Строка, содержащая пароль файла
 Описание
 Читает файл чертежа, определенный fileName в базу данных. fileName должен включать расширение файла (не обязательно .dwg), даже если открываемый файл имеет расширение .dwg. fileName может быть URL.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!