Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Spline.PurgeFitData
 Послать отзыв
 Метод предназначен для удаления из данного объекта данных аппроксимации, если сплайн построен методом определяющих точек.
 Синтаксис
C#
Visual Basic
Копировать Код
public void PurgeFitData();
Копировать Код
Public Sub PurgeFitData()
 Описание
 Метод предназначен для удаления из данного объекта данных аппроксимации, если сплайн построен методом определяющих точек. После удаления этих данных сплайн использует свои управляющие вершины или данные NURBS.
 Ссылки
 Teigha.DatabaseServices.Spline, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!