Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotSettings.PlotAsRaster
 Послать отзыв
 Свойство PlotAsRaster позволяет выяснить, предусмотрен ли текущими настройками печати растровый вывод видового экрана с тонированными объектами.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool PlotAsRaster;
Копировать Код
Public ReadOnly Property PlotAsRaster As Boolean
 Возвращает
 Возвращает true, если настройками задан растровый вывод тонированных объектов. В противном случае возвращает false.
 Описание
 Свойство PlotAsRaster позволяет выяснить, предусмотрен ли текущими настройками печати растровый вывод видового экрана с тонированными объектами.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.PlotSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!