Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GridPropertyParameter.PropertyMask
 Послать отзыв
 Свойство представляет маску для указания параметров сетки. Свойства сетки можно комбинировать с помощью операции OR для масок.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.GridProperties PropertyMask;
Копировать Код
Public PropertyMask As DatabaseServices.GridProperties
 Возвращает
 Возвращает свойство или комбинацию свойств сетки таблицы. Тип DatabaseServices.GridProperties.
 Описание
 Свойство представляет маску для указания параметров сетки. Свойства сетки можно комбинировать с помощью операции OR для масок.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.GridPropertyParameter, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!