Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Scale3d.Coordinate
 Послать отзыв
 Свойство Coordinate представляет масштабный коэффициент с указанным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public double this[int index];
Копировать Код
Default Public ReadOnly Property Coordinate( index As Integer ) As Double
 Параметры
 Параметры
 Описание
 index
 Входной индекс масштабного коэффициента. Тип int.
 Возвращает
 Возвращает значение масштабного коэффициента. Тип double.
 Описание
 Свойство Coordinate представляет масштабный коэффициент с указанным индексом.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.Scale3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!