Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Cell.GetMergeRange
 Послать отзыв
 Метод позволяет получить диапазон слияния данной ячейки.
 Синтаксис
C#
Visual Basic
Копировать Код
public CellRange GetMergeRange();
Копировать Код
Public Function GetMergeRange() As CellRange
 Возвращает
 Возвращает диапазон слияния данной ячейки. Тип CellRange.
 Описание
 Метод позволяет получить диапазон слияния данной ячейки. Метод возвращает недопустимый диапазон слияния, если ячейка не является частью диапазона слияния.
 Ссылки
 Teigha.DatabaseServices.Cell, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!