Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SweepOptionsBuilder.TwistAngle
 Послать отзыв
 Свойство TwistAngle представляет угол кручения профиля по мере его вытягивания по траектории.
 Синтаксис
C#
Visual Basic
Копировать Код
public double TwistAngle;
Копировать Код
Public Property TwistAngle As Double
 Возвращает
 Возвращает угол кручения профиля. Тип double.
 Описание
 Свойство TwistAngle представляет угол кручения профиля по мере его вытягивания по траектории.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.SweepOptionsBuilder, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!