Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Viewport.GridMajor
 Послать отзыв
 Свойство GridMajor представляет количество вспомогательных линий сетки между каждой парой соседних основных линий сетки.
 Синтаксис
C#
Visual Basic
Копировать Код
public short GridMajor;
Копировать Код
Public Property GridMajor As Short
 Возвращает
 Возвращает количество вспомогательных линий сетки между основными. Тип short.
 Описание
 Свойство GridMajor представляет количество вспомогательных линий сетки между каждой парой соседних основных линий сетки.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Viewport, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!