Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.SplineEntity2d.SetControlPointAt
 Послать отзыв
 Метод переопределяет положение управляющей вершины с указанным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetControlPointAt( int index, Point2d point );
Копировать Код
Public Sub SetControlPointAt( index As Integer, point As Point2d )
 Параметры
 Параметры
 Описание
 index
 Входной индекс управляющей вершины. Тип int.
 point
 Новое положение управляющей вершины. Тип Point2d.
 Описание
 Метод переопределяет положение управляющей вершины с указанным индексом.
 Замечания
 В текущей версии этот метод не реализован.
 Ссылки
 Teigha.Geometry.SplineEntity2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!