Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocArrayRectangularParameters.SetColumnSpacing
 Послать отзыв
 Метод позволяет задать расстояние между столбцами массива.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetColumnSpacing( double spacing, ref String expression, ref String evaluatorId );
Копировать Код
Public Sub SetColumnSpacing( spacing As Double, ByRef expression As String, ByRef evaluatorId As String )
 Параметры
 Параметры
 Описание
 spacing
 Расстояние между столбцами массива. Тип double.
 expression
 Выражение для параметра. Тип String. Строка может быть пустой.
 evaluatorId
 Строковое представление идентификатора вычислителя. Тип String. Строка может быть пустой.
 Описание
 Метод позволяет задать расстояние между столбцами массива.
 Если для параметра выражение отсутствует, строки expression и evaluatorId должны быть пустыми.
 Ссылки
 Teigha.DatabaseServices.AssocArrayRectangularParameters, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!