Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbCurve2dFitData
 Послать отзыв
 Структура NurbCurve2dFitData предназначена для хранения данных, которые возвращает свойство NurbCurve2d.FitData.
 Иерархия классов
Teigha::Geometry::NurbCurve2dFitData
 Синтаксис
C#
Visual Basic
Копировать Код
public struct NurbCurve2dFitData
Копировать Код
Public Structure NurbCurve2dFitData
 Описание
 Структура NurbCurve2dFitData предназначена для хранения данных, которые возвращает свойство NurbCurve2d.FitData.
 Топики
 Имя
 Описание
 NurbCurve2dFitData Методы
 Ниже перечислены методы класса NurbCurve2dFitData.
 NurbCurve2dFitData Операторы
 Ниже перечислены операторы класса NurbCurve2dFitData.
 NurbCurve2dFitData Свойства
 Ниже перечислены свойства класса NurbCurve2dFitData.
 Ссылки
 NurbCurve2dFitData Методы, NurbCurve2dFitData Операторы, NurbCurve2dFitData Свойства, Топики, NurbCurve2dFitData Методы, NurbCurve2dFitData Операторы, NurbCurve2dFitData Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!