Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObject.HasPersistentReactor(ObjectId)
 Послать отзыв
 Метод предназначен для проверки, является ли переданный идентификатор идентификатором реактора, присоединенного к этому объекту.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool HasPersistentReactor(ObjectId objId);
Копировать Код
Public Function HasPersistentReactor(objId As ObjectId) As bool
 Параметры
 Параметры
 Описание
 objId
 Идентификатор постоянного реактора. Тип ObjectId
 Возвращает
 Возвращает тип данных bool. true, если ObjId является идентификатором объекта реактора, присоединенного к этому объекту, false в противном случае.
 Описание
 Метод проеверяет, является ли переданный идентификатор идентификатором реактора, присоединенного к этому объекту.
 Ссылки
 Teigha.DatabaseServices.DBObject, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!