Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Matrix2dInfo
 Послать отзыв
 Структура Matrix2dInfo инкапсулирует данные, возвращаемые методом Matrix2d.IsConformal().
 Иерархия классов
Teigha::Geometry::Matrix2dInfo
 Синтаксис
C#
Visual Basic
Копировать Код
public struct Matrix2dInfo
Копировать Код
Public Structure Matrix2dInfo
 Описание
 Структура Matrix2dInfo инкапсулирует данные, возвращаемые методом Matrix2d.IsConformal().
 Топики
 Имя
 Описание
 Matrix2dInfo Методы
 Ниже перечислены методы класса Matrix2dInfo.
 Matrix2dInfo Операторы
 Ниже перечислены операторы класса Matrix2dInfo.
 Matrix2dInfo Свойства
 Ниже перечислены свойства класса Matrix2dInfo.
 Ссылки
 Matrix2dInfo Методы, Matrix2dInfo Операторы, Matrix2dInfo Свойства, Топики, Matrix2dInfo Методы, Matrix2dInfo Операторы, Matrix2dInfo Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!