Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MlineStyle.StartInnerArcs
 Послать отзыв
 Свойство управляет отображением внутренних дуг на начальном торце мультилинии.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool StartInnerArcs;
Копировать Код
Public Property StartInnerArcs As Boolean
 Возвращает
 Возвращает true, если отображение внутренних дуг на начальном торце мультилинии включено. В противном случае возвращает false.
 Описание
 Свойство управляет отображением внутренних дуг на начальном торце мультилинии.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MlineStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!