Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SystemVariableChangedEventArgs
 Послать отзыв
 Класс SystemVariableChangedEventArgs представляет свойства, связанные с событиями системных переменных (после изменения системных переменных).
 Иерархия классов
Teigha::DatabaseServices::SystemVariableChangedEventArgs
 Синтаксис
C#
Visual Basic
Копировать Код
public sealed class SystemVariableChangedEventArgs : EventArgs
Копировать Код
Public NotInheritable Class SystemVariableChangedEventArgs Inherits EventArgs
 Описание
 Класс SystemVariableChangedEventArgs представляет свойства, связанные с событиями системных переменных (после изменения системных переменных).
 Топики
 Имя
 Описание
 SystemVariableChangedEventArgs Свойства
 Ниже перечислены свойства класса SystemVariableChangedEventArgs.
 Ссылки
 SystemVariableChangedEventArgs Свойства, Топики, SystemVariableChangedEventArgs Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!