Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.IdMapping.DestinationDatabase
 Послать отзыв
 Свойство предоставляет доступ к целевой базе данных операции глубокого клонирования, использующей этот объект IdMapping.
 Синтаксис
C#
Visual Basic
Копировать Код
public Database DestinationDatabase;
Копировать Код
Public Property DestinationDatabase As Database
 Возвращает
 Возвращает целевую базу данных операции глубокого клонирования. Тип Database.
 Описание
 Свойство предоставляет доступ к целевой базе данных операции глубокого клонирования, использующей этот объект IdMapping.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.IdMapping, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!