Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObject.GetXDataForApplication(String)
 Послать отзыв
 Метод предназначен для получения данных xdata приложения с указанным названием.
 Синтаксис
C#
Visual Basic
Копировать Код
public ResultBuffer GetXDataForApplication(String applicationName);
Копировать Код
Public Function GetXDataForApplication(applicationName As String) As ResultBuffer
 Параметры
 Параметры
 Описание
 applicationName
 Имя зарегистрированного приложения, используемого для получения xdata. Тип String
 Возвращает
 Возвращает данные, которые являются копией xdata приложения с указанным названием. Тип ResultBuffer
 Описание
 Метод предоставляет данные xdata приложения с указанным названием.
 Ссылки
 Teigha.DatabaseServices.DBObject, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!