Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.GetMergeRange
 Послать отзыв
 Метод позволяет определить диапазон слияния для указанной ячейки.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual CellRange GetMergeRange( int row, int column );
Копировать Код
Public virtual Function GetMergeRange( row As Integer, column As Integer ) As CellRange
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 col
 Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
 Возвращает
 Возвращает диапазон слияния. Тип CellRange.
 Описание
 Метод позволяет определить диапазон слияния для указанной ячейки. Диапазон слияния будет недействительным, если ячейка не входит в этот диапазон.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!