Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.PointOnCurve3d.Parameter
 Послать отзыв
 Свойство возвращает значение параметра данной точки на кривой.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Parameter;
Копировать Код
Public Property Parameter() As Double
 Возвращает
 Возвращает значение параметра данной точки на кривой. Тип double.
 Описание
 Свойство возвращает значение параметра данной точки на кривой.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.Geometry.PointOnCurve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!