Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FormattedTableData.SetGridColor
 Послать отзыв
 Метод позволяет задать цвет сетки в строке, столбце или ячейке.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetGridColor( int row, int column, GridLineType gridLinetype, ref Colors.Color value );
Копировать Код
Public Overridable Sub SetGridColor( row As Integer, column As Integer, gridLinetype As GridLineType, ByRef value As Colors.Color )
 Параметры
 Параметры
 Описание
 row
 Индекс строки. Тип int. Индекс может равняться -1.
 column
 Индекс столбца. Тип int. Индекс может равняться -1.
 gridLinetype
 Тип линий сетки из перечисления GridLineType. Комбинацию типов линий сетки можно задать с помощью логического оператора OR.
 value
 Новый цвет сетки. Тип Teigha.Colors.Color.
 Описание
 Метод позволяет задать цвет сетки в строке, столбце или ячейке.
 Чтобы указать ячейку, следует передать действительные индексы строки и столбца. Чтобы указать строку, следует передать действительный индекс строки и -1 в качестве индекса столбца. Чтобы указать столбец, следует передать действительный индекс столбца и -1 в качестве индекса строки.
 Ссылки
 Teigha.DatabaseServices.FormattedTableData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!