Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DxfFiler
 Послать отзыв
 Этот класс является абстрактным базовым классом для классов, которые используются для файловых операций ввода-вывода в формате DXF.
 Иерархия классов
Teigha::DatabaseServices::DxfFiler
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdDbDxfFiler")] public class DxfFiler : RXObject;
Копировать Код
<Wrapper("OdDbDxfFiler")> Public Class DxfFiler Inherits RXObject
 Описание
 Этот класс является абстрактным базовым классом для классов, которые используются для файловых операций ввода-вывода в формате DXF.
 Методы
 Конструкторы
 Имя
 Описание
 DxfFiler
 Конструктор класса DxfFiler.
 Топики
 Имя
 Описание
 DxfFiler Методы
 Ниже перечислены методы класса DxfFiler.
 DxfFiler Свойства
 Ниже перечислены свойства класса DxfFiler.
 Ссылки
 DxfFiler Методы, DxfFiler Свойства, Методы, Топики, DxfFiler Методы, DxfFiler Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!