Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Hatch.GradientAngle
 Послать отзыв
 Синтаксис
C#
Visual Basic
public double GradientAngle;
Public Property GradientAngle() As Double
 Описание
 Возвращает угол, в радианах, под которым применяется текущее определение градиента.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Hatch, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!