Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.TableContent.SetCellStyle
 Послать отзыв
 Метод позволяет задать стиль указанной ячейки.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetCellStyle( int row, int column, ref String cellStyle );
Копировать Код
Public Overridable Sub SetCellStyle( row As Integer, column As Integer, ByRef cellStyle As String )
 Параметры
 Параметры
 Описание
 row
 Индекс строки таблицы. Тип int.
 column
 Индекс столбца таблицы. Тип int.
 cellStyle
 Имя стиля ячейки. Тип String.
 Описание
 Метод позволяет задать стиль указанной ячейки.
 Имя стиля ячейки может принимать одно из следующих значений:
_TITLE,
_HEADER,
_DATA.
 Ссылки
 Teigha.DatabaseServices.TableContent, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!