Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve3d.IsPeriodic
 Послать отзыв
 Метод позволяет установить, является ли данная кривая периодической.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsPeriodic( out double period );
Копировать Код
Public Function IsPeriodic( period As out double ) As Boolean
 Параметры
 Параметры
 Описание
 period
 Выходное значение периода кривой (если она периодическая). Тип double.
 Возвращает
 Возвращает true, если кривая является периодической, иначе - false.
 Описание
 Метод позволяет установить, является ли данная кривая периодической. Выходное значение period имеет смысл только в том случае, когда метод возвращает значение true.
 Замечания
 Кривая является периодической с периодом period тогда и только тогда, когда она замкнута, и для любого значения параметра t точки EvaluatePoint(t) и EvaluatePoint(t + period) всегда совпадают.
 Ссылки
 Teigha.Geometry.Curve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!