Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Surftype
 Послать отзыв
 Синтаксис
C#
Visual Basic
public int Surftype;
Public Property Surftype() As Integer
 Описание
 Обеспечивает доступ к текущему значению SURFTYPE для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!