Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Polyline.MaximizeMemory
 Послать отзыв
 Синтаксис
C#
Visual Basic
public void MaximizeMemory();
Public Sub MaximizeMemory()
 Описание
 Этот метод "распаковывает" любые запакованные данные памяти, которые могут быть использованы в полилинии. Это позволяет ускорить доступ к полилинии для изменения.
 Ссылки
 Teigha.DatabaseServices.Polyline, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!