Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LinkedTableData.NumberOfRows
 Послать отзыв
 Свойство представляет количество строк в данной таблице.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual int NumberOfRows;
Копировать Код
Public Overridable ReadOnly Property NumberOfRows As Integer
 Возвращает
 Возвращает количество строк. Тип int.
 Описание
 Свойство представляет количество строк в данной таблице.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.LinkedTableData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!