Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeader.GetTextAttachmentType
 Послать отзыв
 Метод позволяет получить вариант расположения точки прикрепления выносной линии к объекту MText.
 Синтаксис
C#
Visual Basic
Копировать Код
public TextAttachmentType GetTextAttachmentType( LeaderDirectionType leaderDirection );
Копировать Код
Public Function GetTextAttachmentType( leaderDirection As LeaderDirectionType ) As TextAttachmentType
 Параметры
 Параметры
 Описание
 leaderDirection
 Вариант ориентации полки из перечисления LeaderDirectionType.
 Возвращает
 Возвращает тип прикрепления выносной линии к многострочному тексту. Перечисление TextAttachmentType.
 Описание
 Метод позволяет получить вариант расположения точки прикрепления выносной линии к объекту MText.
 Ссылки
 Teigha.DatabaseServices.MLeader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!