Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CurveCurveIntersector2d.GetIntersectionPointTolerance
 Послать отзыв
 Метод предоставляет геометрическую точность, которая использовалась для вычисления точки пересечения с заданным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public double GetIntersectionPointTolerance( int intersection );
Копировать Код
Public Function GetIntersectionPointTolerance( intersection As Integer ) As Double
 Параметры
 Параметры
 Описание
 intersection
 Индекс интересующей точки пересечения. Тип int.
 Возвращает
 Возвращает геометрическую точность вычисления указанной точки пересечения. Тип double.
 Описание
 Метод предоставляет геометрическую точность, которая использовалась для вычисления точки пересечения с заданным индексом.
 Ссылки
 Teigha.Geometry.CurveCurveIntersector2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!