Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LinkedTableData.DataType
 Послать отзыв
 Метод позволяет получить тип данных в первом элементе содержимого ячейки, заданной индексами строки и столбца.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual DatabaseServices.DataType DataType( int row, int column );
Копировать Код
Public Overridable Function DataType( row As Integer, column As Integer ) As DatabaseServices.DataType
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 column
 Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
 Возвращает
 Возвращает тип данных в ячейке. Перечисление DatabaseServices.DataType.
 Описание
 Метод позволяет получить тип данных в первом элементе содержимого ячейки, заданной индексами строки и столбца.
 Замечания
 При выходе индекса строки и/или индекса столбца за пределы допустимого диапазона метод выбрасывает исключение eInvalidInput.
 Ссылки
 Teigha.DatabaseServices.LinkedTableData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!