Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Section.IsLiveSectionEnabled
 Послать отзыв
 Свойство IsLiveSectionEnabled позволяет определить, включен ли режим псевдоразреза.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsLiveSectionEnabled;
Копировать Код
Public Property IsLiveSectionEnabled As Boolean
 Возвращает
 Возвращает true, если режим псевдоразреза активен. В противном случае возвращает false.
 Описание
 Свойство IsLiveSectionEnabled позволяет определить, включен ли режим псевдоразреза.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Section, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!