Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SweepOptions.BasePoint
 Послать отзыв
 Свойство BasePoint представляет базовую точку для выравнивания вытягиваемого объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d BasePoint;
Копировать Код
Public ReadOnly Property BasePoint As Point3d
 Возвращает
 Возвращает базовую точку. Тип Point3d.
 Описание
 Свойство BasePoint представляет базовую точку для выравнивания вытягиваемого объекта.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.SweepOptions, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!