Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Transaction
 Послать отзыв
 Класс реализует поддержку транзакций. Транзакции помогают расширить спектр связанных с объектом операций и избежать нежелательных конфликтных ситуаций. Кроме того, они повышают производительность, позволяя отложить операции закрытия всех открытых объектов до момента завершения транзакции.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::DatabaseServices::Transaction
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdTransaction")] public class Transaction : RXObject;
Копировать Код
<Wrapper("OdTransaction")> Public Class Transaction Inherits RXObject
 Описание
 Класс реализует поддержку транзакций.
 Транзакции помогают расширить спектр связанных с объектом операций и избежать нежелательных конфликтных ситуаций. Кроме того, они повышают производительность, позволяя отложить операции закрытия всех открытых объектов до момента завершения транзакции.
 Методы
 Конструкторы
 Teigha.DatabaseServices.Transaction
 Имя
 Описание
 Transaction
 Конструктор.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.DatabaseServices.Transaction
 Имя
 Описание
 Transaction Методы
 Ниже перечислены методы класса Transaction.
 Transaction Свойства
 Ниже перечислены свойства класса Transaction.
 Ссылки
 Transaction Методы, Transaction Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!