Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.GetIsAutoScale
 Послать отзыв
 Метод позволяет проверить, включено ли автомасштабирование в указанной ячейке таблицы.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual bool GetIsAutoScale( int row, int column, int contentIndex );
Копировать Код
Public virtual Function GetIsAutoScale( row As Integer, column As Integer, contentIndex As Integer ) As Boolean
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 contentIndex
 Индекс элемента содержимого ячейки, тип int. Индекс должен быть больше или равен нулю и меньше количества элементов содержимого в ячейке.
 col
 Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
 Возвращает
 Возвращает true, если блок в элементе с указанным индексом масштабируется автоматически, и false в противном случае.
 Описание
 Метод позволяет проверить, включено ли автомасштабирование в указанной ячейке таблицы. Если оно включено, то при размещении блока в ячейке объект Table автоматически вычисляет масштаб и точку вставки для содержимого блока.
 Замечания
 Для получения того же результата предпочтительнее использовать свойство Table.Cells[row,column].Contents[i].IsAutoScale.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!