Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.SurfaceSurfaceIntersector.IntersectPoint
 Послать отзыв
 Метод позволяет получить трехмерную точку пересечения с указанным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d IntersectPoint( int number );
Копировать Код
Public Function IntersectPoint( number As Integer ) As Point3d
 Параметры
 Параметры
 Описание
 number
 Индекс кривой пересечения. Индексация начинается с нуля. Тип int.
 Возвращает
 Возвращает точку пересечения с индексом number. Тип Point3d.
 Описание
 Метод позволяет получить трехмерную точку пересечения с указанным индексом.
 Замечания
 Метод выбрасывает следующие исключения:
kXXIndexOutOfRange, если указанный индекс выходит за пределы диапазона допустимых значений;
kXXWrongDimensionAtIndex в случае неверной размерности указанного пересечения;
kXXUnknown, если данный объект пересечения не инициализирован.
 Ссылки
 Teigha.Geometry.SurfaceSurfaceIntersector, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!