Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObject.AddContext(ObjectContext)
 Послать отзыв
 Метод предназначен для добавления копии контекста к объекту базы данных.
 Синтаксис
C#
Visual Basic
Копировать Код
public void AddContext(ObjectContext context);
Копировать Код
Public Sub AddContext(context As ObjectContext)
 Параметры
 Параметры
 Описание
 context
 Контекст для добавления
 Описание
 Метод добавляет копию контекста к объекту базы данных.
 Ссылки
 Teigha.DatabaseServices.DBObject, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!