Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LinkedTableData.GetDataLink
 Послать отзыв
 Метод позволяет получить коллекцию внешних ссылок, заданных в указанном диапазоне ячеек.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual DatabaseServices.ObjectIdCollection GetDataLink( ref CellRange range );
Копировать Код
Public Overridable Function GetDataLink( ByRef range As CellRange ) As DatabaseServices.ObjectIdCollection
 Параметры
 Параметры
 Описание
 range
 Входной диапазон ячеек таблицы. Тип CellRange.
 Возвращает
 Возвращает коллекцию внешних ссылок из указанного диапазона ячеек. Тип DatabaseServices.ObjectIdCollection.
 Описание
 Метод позволяет получить коллекцию внешних ссылок, заданных в указанном диапазоне ячеек.
 Ссылки
 Teigha.DatabaseServices.LinkedTableData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!