Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PdfReference.PdfReference
 Послать отзыв
 Конструктор по умолчанию класса PdfReference.
 Синтаксис
C#
Visual Basic
Копировать Код
public PdfReference();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса PdfReference.
 Ссылки
 Teigha.DatabaseServices.PdfReference, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!