Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.GraphicsInterface.TransientManager
 Послать отзыв
 Класс TransientManager представляет функционал менеджера временных отображаемых объектов растровой графики.
 Иерархия классов
Teigha::GraphicsInterface::TransientManager
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("AcGiTransientManager")] public class TransientManager : DisposableWrapper
Копировать Код
<Wrapper("AcGiTransientManager")> Public Class TransientManager Inherits DisposableWrapper
 Описание
 Класс TransientManager предоставляет функциональность менеджера временных отображаемых объектов растровой графики. Данный менеджер позволяет управлять временными отображаемыми объектами, обеспечивая поддержку операций их добавления, удаления и обновления.
 Топики
 Имя
 Описание
 TransientManager Методы
 Ниже перечислены методы класса TransientManager.
 TransientManager Свойства
 Ниже перечислены свойства класса TransientManager.
 Ссылки
 TransientManager Методы, TransientManager Свойства, Топики, TransientManager Методы, TransientManager Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!