Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FormattedTableData.GetContentColor
 Послать отзыв
 Метод позволяет получить цвет содержимого указанной ячейки.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual Colors.Color GetContentColor( int row, int column );
Копировать Код
Public Overridable Function GetContentColor( row As Integer, column As Integer ) As Colors.Color
 Параметры
 Параметры
 Описание
 row
 Индекс строки. Тип int.
 column
 Индекс столбца. Тип int.
 Возвращает
 Возвращает цвет содержимого ячейки. Тип Teigha.Colors.Color.
 Описание
 Метод позволяет получить цвет содержимого указанной ячейки.
 Ссылки
 Teigha.DatabaseServices.FormattedTableData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!