Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Scale3d.RemoveScale
 Послать отзыв
 Метод вычисляет вектор масштабирования, соответствующий длинам вектор-столбцов матрицы преобразования, и затем приводит масштабные коэффициенты этой матрицы к единице.
 Синтаксис
C#
Visual Basic
Копировать Код
public static Scale3d RemoveScale( Matrix3d mat );
Копировать Код
Public Shared Function RemoveScale( mat As Matrix3d ) As Scale3d
 Параметры
 Параметры
 Описание
 mat
 Входная матрица преобразования. Тип Matrix3d.
 Возвращает
 Возвращает вектор масштабирования в матрице mat в ее исходном состоянии. Тип Scale3d.
 Описание
 Метод вычисляет вектор масштабирования, соответствующий длинам вектор-столбцов матрицы преобразования, и затем приводит масштабные коэффициенты этой матрицы к единице.
 Ссылки
 Teigha.Geometry.Scale3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!