Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FileDependencyManager.CountEntries
 Послать отзыв
 Свойство CountEntries представляет количество уникальных записей в разделе .dwg списка файловых зависимостей.
 Синтаксис
C#
Visual Basic
Копировать Код
public int CountEntries;
Копировать Код
Public ReadOnly Property CountEntries As Integer
 Возвращает
 Возвращает количество уникальных записей. Тип int.
 Описание
 Свойство CountEntries представляет количество уникальных записей в разделе .dwg списка файловых зависимостей.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.FileDependencyManager, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!