Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PolygonMesh.PolygonMesh
 Послать отзыв
 Данный конструктор создает новый объект PolygonMesh с переданными в аргументах параметрами.
 Синтаксис
C#
Visual Basic
Копировать Код
public PolygonMesh( PolyMeshType type, int size, int sizeValue, ref Point3dCollection vertices, bool closedValue, bool closed );
Копировать Код
Public Sub New( type As PolyMeshType, size As Integer, sizeValue As Integer, ByRef vertices As Point3dCollection, closedValue As Boolean, closed As Boolean )
 Параметры
 Параметры
 Описание
 type
 Геометрический тип сети из перечисления PolyMeshType.
 size
 Количество вершин в направлении M, тип int.
 sizeValue
 Количество вершин в направлении N, тип int.
 vertices
 Коллекция вершин данного объекта, тип Point3dCollection.
 closedValue
 Флаг замкнутости сети в направлении M, тип bool.
 closed
 Флаг замкнутости сети в направлении N, bool.
 Описание
 Данный конструктор создает новый объект PolygonMesh с переданными в аргументах параметрами.
 Ссылки
 Teigha.DatabaseServices.PolygonMesh, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!