Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FeatureControlFrame
 Послать отзыв
 Класс FeatureControlFrame представляет в базе данных рамки символов допусков формы и расположения.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::GraphicsInterface::Drawable Teigha::DatabaseServices::DBObject Teigha::DatabaseServices::Entity Teigha::DatabaseServices::FeatureControlFrame
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("AcDbFcf")] public class FeatureControlFrame : Entity;
Копировать Код
<Wrapper("AcDbFcf")> Public Class FeatureControlFrame Inherits Entity
 Описание
 Класс FeatureControlFrame представляет в базе данных символы допусков формы и расположения. Эти символы представляют собой многосекционные прямоугольные рамки.
 Методы
 Конструкторы
 Teigha.GraphicsInterface.Drawable
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 Drawable
 Конструктор класса Teigha.GraphicsInterface.Drawable. (Унаследован от Drawable)
 Teigha.DatabaseServices.DBObject
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 DBObject
 Конструктор. (Унаследован от DBObject)
 Teigha.DatabaseServices.FeatureControlFrame
 Имя
 Описание
 FeatureControlFrame
 Это обзор перегрузок FeatureControlFrame.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.GraphicsInterface.Drawable
 Имя
 Описание
 Drawable Методы
 Ниже перечислены методы класса Drawable.
 Drawable Свойства
 Ниже перечислены свойства класса Drawable.
 Teigha.DatabaseServices.DBObject
 Имя
 Описание
 DBObject Методы
 Ниже перечислены методы класса DBObject.
 DBObject Свойства
 Ниже перечислены свойства класса DBObject.
 DBObject События
 Ниже перечислены события класса DBObject.
 Teigha.DatabaseServices.Entity
 Имя
 Описание
 Entity Методы
 Ниже перечислены методы класса Entity.
 Entity Свойства
 Ниже перечислены свойства класса Entity.
 Teigha.DatabaseServices.FeatureControlFrame
 Имя
 Описание
 FeatureControlFrame Методы
 Ниже перечислены методы класса FeatureControlFrame.
 FeatureControlFrame Свойства
 Ниже перечислены свойства класса FeatureControlFrame.
 Ссылки
 FeatureControlFrame Конструктор, FeatureControlFrame Методы, FeatureControlFrame Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства, DBObject События
 Ваши комментарии по поводу этого топика: Послать отзыв!