Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.TableStyle.Color
 Послать отзыв
 Метод позволяет получить цвет текста в строке указанного типа.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual Teigha.Colors.Color Color( RowType rowType );
Копировать Код
Public Overridable Function Color( rowType As RowType ) As Teigha.Colors.Color
 Параметры
 Параметры
 Описание
 rowType
 Тип строки. Перечисление RowType.
 Возвращает
 Возвращает цвет текста в строке. Тип Teigha.Colors.Color.
 Описание
 Метод позволяет получить цвет текста в строке указанного типа.
 Ссылки
 Teigha.DatabaseServices.TableStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!