Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.TypedValue.TypedValue
 Послать отзыв
 Данный конструктор создает объект с заданным кодом типа значения.
 Синтаксис
C#
Visual Basic
Копировать Код
public TypedValue( int typeCode );
Копировать Код
Public Sub New( typeCode As Integer )
 Параметры
 Параметры
 Описание
 typeCode
 Код типа, int.
 Описание
 Данный конструктор создает объект с заданным кодом типа значения.
 Ссылки
 Teigha.DatabaseServices.TypedValue, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!