Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ItemLocator.RowIndex
 Послать отзыв
 Свойство представляет индекс, определяющий строку элемента в массиве относительно первой строки.
 Синтаксис
C#
Visual Basic
Копировать Код
public int RowIndex;
Копировать Код
Public Property RowIndex() As Integer
 Возвращает
 Возвращает текущую строку данного элемента. Тип int.
 Описание
 Свойство представляет индекс, определяющий строку элемента в массиве относительно первой строки.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.ItemLocator, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!