Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FormattedTableData.GetMargin
 Послать отзыв
 Метод предназначен для получения размера полей (расстояний между границами и содержимым) для ячеек, строк или столбцов.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual double GetMargin( int row, int column, CellMargins margin );
Копировать Код
Public Overridable Function GetMargin( row As Integer, column As Integer, margin As CellMargins ) As Double
 Параметры
 Параметры
 Описание
 row
 Индекс строки. Тип int. Может принимать значение -1.
 column
 Индекс столбца. Тип int. Может принимать значение -1.
 margin
 Тип поля из перечисления CellMargins.
 Возвращает
 Возвращает размер полей. Тип double.
 Описание
 Метод предназначен для получения размера полей (расстояний между границами и содержимым) для ячеек, строк или столбцов.
 Чтобы указать ячейку, следует передать действительные индексы строки и столбца. Чтобы указать строку, следует передать действительный индекс строки и -1 в качестве индекса столбца. Чтобы указать столбец, следует передать действительный индекс столбца и -1 в качестве индекса строки.
 Ссылки
 Teigha.DatabaseServices.FormattedTableData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!