Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.ExternalBoundedSurface.IsExternalSurface
 Послать отзыв
 Свойство IsExternalSurface позволяет убедиться, что базовая поверхность данного объекта является внешней поверхностью.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsExternalSurface;
Копировать Код
Public ReadOnly Property IsExternalSurface As Boolean
 Возвращает
 Возвращает true, если базовая поверхность данного объекта является внешней поверхностью. В противном случае возвращает false.
 Описание
 Свойство IsExternalSurface позволяет убедиться, что базовая поверхность данного объекта является внешней поверхностью.
 Замечания
 Если проверки конкретного типа (IsCone, IsEllipCone, IsCylinder, IsEllipCylinder, IsNurbs, IsPlane, IsSphere, IsTorus) не дали положительного результата, но объект определён, то свойство IsExternalSurface должно возвращать true.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.ExternalBoundedSurface, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!