Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.PointOnCurve2d.PointOnCurve2d
 Послать отзыв
 Конструктор класса PointOnCurve2d. Создает на указанной кривой точку с заданным значением параметра.
 Синтаксис
C#
Visual Basic
Копировать Код
public PointOnCurve2d( ref Curve2d curve, double parameter );
Копировать Код
Public Sub New( ByRef curve As Curve2d, parameter As Double )
 Параметры
 Параметры
 Описание
 curve
 Входная кривая. Тип Curve2d.
 parameter
 Значение параметра для создаваемой точки. Тип double.
 Описание
 Конструктор класса PointOnCurve2d. Создает на указанной кривой точку с заданным значением параметра.
 Ссылки
 Teigha.Geometry.PointOnCurve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!