Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.BlockScale
 Послать отзыв
 Данный метод предназначен для определения масштабного коэффициента вхождения блока в указанной ячейке таблицы.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual double BlockScale( int row, int col );
Копировать Код
Public virtual Function BlockScale( row As Integer, col As Integer ) As double
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int.
 col
 Индекс столбца, тип int.
 Возвращает
 Возвращает масштабный коэффициент вхождения блока, тип double.
 Описание
 Данный метод предназначен для определения масштабного коэффициента вхождения блока в ячейке, заданной индексами строки и столбца.
 Замечания
 Для получения того же результата предпочтительнее использовать Table.Cells[row,column].Contents[i].Scale.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!