Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.OleStartUp
 Послать отзыв
 Синтаксис
C#
Visual Basic
public bool OleStartUp;
Public Property OleStartUp() As bool
 Описание
 Возвращает или устанавливает текущее значение заголовка OLESTARTUP.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!