Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Torus.IntersectWith
 Послать отзыв
 Метод вычисляет точки пересечения данного тора с указанным линейным объектом в пределах указанной точности.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d[] IntersectWith( ref LinearEntity3d linearEntity, Tolerance tolerance );
Копировать Код
Public Function IntersectWith( ByRef linearEntity As LinearEntity3d, tolerance As Tolerance ) As Point3d()
 Параметры
 Параметры
 Описание
 linearEntity
 Линейный объект, точки пересечения с которым требуется вычислить. Тип LinearEntity3d.
 tolerance
 Входная геометрическая точность. Тип Tolerance.
 Возвращает
 Возвращает массив точек пересечения данного тора с линейным объектом linearEntity. Тип Point3d[]. Если метод не смог найти точки пересечения или точек пересечения не существует, этот метод возвращает null.
 Описание
 Метод вычисляет точки пересечения данного тора с указанным линейным объектом в пределах указанной точности.
 Ссылки
 Teigha.Geometry.Torus, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!