Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GroundPlaneBackground.ColorUndergroundHorizon
 Послать отзыв
 Свойство предоставляет доступ к цвету поднятой нулевой плоскости на дальнем плане.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual EntityColor ColorUndergroundHorizon;
Копировать Код
Public Overridable Property ColorUndergroundHorizon As EntityColor
 Возвращает
 Возвращает цвет объекта. Тип EntityColor.
 Описание
 Свойство предоставляет доступ к цвету поднятой нулевой плоскости на дальнем плане.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.GroundPlaneBackground, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!