Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocDependency.SetDependentOnObject
 Послать отзыв
 Метод устанавливает зависимость от объекта для данной зависимости с помощью идентификатора составного объекта CompoundObjectId.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetDependentOnObject( ref CompoundObjectId compoundId );
Копировать Код
Public Sub SetDependentOnObject( ByRef compoundId As CompoundObjectId )
 Параметры
 Параметры
 Описание
 compoundId
 Идентификатор составного объекта, от которого должна зависеть данная зависимость (может быть нулевым). Тип CompoundObjectId.
 Описание
 Метод устанавливает зависимость от объекта для данной зависимости с помощью идентификатора составного объекта CompoundObjectId.
 В отличие от AttachToObject(), этот метод не добавляет эту зависимость в список постоянных реакторов объекта. Таким образом, зависимость оказывается в неопределенном состоянии — она не является ни прикрепленной к объекту, ни неприкрепленной к объекту. Чтобы действительно прикрепить эту зависимость к объекту после того, как метод SetDependentOnObject() уже был вызван с ненулевым ObjectId, следует перед вызовом метода AttachToObject() сначала вызвать SetDependentOnObject() с нулевым аргументом compoundId. Этот метод может повредить зависимость, и у клиентского кода не должно быть никаких причин для его использования.
 Ссылки
 Teigha.DatabaseServices.AssocDependency, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!