Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.GetBlockTableRecordId
 Послать отзыв
 Метод предназначен для получения идентификатора записи в таблице блоков для элемента содержимого ячейки по указанному индексу этого элемента.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual DatabaseServices.ObjectId GetBlockTableRecordId( int row, int column, int contentIndex );
Копировать Код
Public virtual Function GetBlockTableRecordId( row As Integer, column As Integer, contentIndex As Integer ) As DatabaseServices.ObjectId
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 contentIndex
 Индекс элемента содержимого ячейки. Индекс должен быть больше или равен нулю и меньше количества элементов содержимого в ячейке.
 col
 Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
 Возвращает
 Возвращает идентификатор записи в таблице блоков. Тип DatabaseServices.ObjectId.
 Описание
 Метод предназначен для получения идентификатора записи в таблице блоков для элемента содержимого ячейки по указанному индексу этого элемента.
 Замечания
 Для получения того же результата предпочтительнее использовать Table.Cells[row,column].Contents[i].BlockTableRecordId.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!