Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObject.GetField()
 Послать отзыв
 Метод предназначен для получения идентификатора поля "TEXT" из словаря полей.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectId GetField();
Копировать Код
Public Function GetField() As ObjectId
 Возвращает
 Возвращает идентификатор поля "TEXT" из словаря полей. Тип ObjectId
 Описание
 Этот метод обеспечивает доступ к полю "TEXT", связанному с объектом базы данных, путем получения идентификатора поля.
 Ссылки
 Teigha.DatabaseServices.DBObject, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!