Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeader.ConnectionPoint
 Послать отзыв
 Метод возвращает точку присоединения этой мультивыноски в указанном направлении.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d ConnectionPoint( Vector3d direction );
Копировать Код
Public Function ConnectionPoint( direction As Vector3d ) As Point3d
 Параметры
 Параметры
 Описание
 direction
 Направление для искомой точки. Тип Vector3d.
 Возвращает
 Возвращает точку присоединения. Тип Point3d.
 Описание
 Метод возвращает точку присоединения этой мультивыноски в указанном направлении.
 Ссылки
 Teigha.DatabaseServices.MLeader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!