Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DynamicDimensionData.Editable
 Послать отзыв
 Свойство Editable позволяет определить, доступен ли для редактирования этот динамический размер.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool Editable;
Копировать Код
Public Property Editable As Boolean
 Возвращает
 Возвращает true, если динамический размер доступен для редактирования. В противном случае возвращает false.
 Описание
 Свойство Editable позволяет определить, доступен ли для редактирования этот динамический размер.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.DynamicDimensionData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!