Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SolidBackground.Color
 Послать отзыв
 Свойство Color представляет цвет данного фона.
 Синтаксис
C#
Visual Basic
Копировать Код
public Teigha.Colors.EntityColor Color;
Копировать Код
Public Property Color As Teigha.Colors.EntityColor
 Возвращает
 Возвращает цвет фона. Тип Teigha.Colors.EntityColor.
 Описание
 Свойство Color представляет цвет данного фона.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.SolidBackground, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!