Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve3d.GetParameterAtLength
 Послать отзыв
 Метод позволяет получить значение параметра для точки на кривой, расстояние вдоль кривой до которой от указанной параметрически начальной точки равно заданной длине.
 Синтаксис
C#
Visual Basic
Копировать Код
public double GetParameterAtLength( double datumParameter, double length, bool direction, double tolerance );
Копировать Код
Public Function GetParameterAtLength( datumParameter As Double, length As Double, direction As Boolean, tolerance As Double ) As Double
 Параметры
 Параметры
 Описание
 datumParameter
 Значение параметра для начальной точки. Тип double.
 length
 Целевое расстояние между точками, вычисляемое вдоль кривой. Тип double.
 direction
 Направление изменения параметра. Тип bool.
 tolerance
 Точность вычисления искомого параметра. Тип double.
 Возвращает
 Возвращает значение параметра для точки на кривой. Тип double.
 Описание
 Метод позволяет получить значение параметра для точки на кривой, расстояние вдоль кривой до которой от указанной параметрически начальной точки равно заданной длине length. Аргументы метода дают возможность задать также направление вдоль кривой и точность вычислений.
 Ссылки
 Teigha.Geometry.Curve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!