Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Polyline2d.ConstantWidth
 Послать отзыв
 Свойство предоставляет доступ к значению толщины полилинии.
 Синтаксис
C#
Visual Basic
Копировать Код
public double ConstantWidth;
Копировать Код
Public Property ConstantWidth() As double
 Возвращает
 Возвращает толщину полилинии, тип double.
 Описание
 Свойство предоставляет доступ к значению толщины полилинии.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Polyline2d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!