Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MergeCellStyleOption
 Послать отзыв
 Перечисление MergeCellStyleOption определяет опции объединения стилей ячеек.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum MergeCellStyleOption { None = 0, CopyDuplicates = 1, OverwriteDuplicates = 2, ConvertDuplicatesToOverrrides = 4, IgnoreNewStyles = 8 }
Копировать Код
Public Enum MergeCellStyleOption None = 0 CopyDuplicates = 1 OverwriteDuplicates = 2 ConvertDuplicatesToOverrrides = 4 IgnoreNewStyles = 8 End Enum
 Члены
 Члены
 Описание
 ConvertDuplicatesToOverrrides
 Значение: 4. В случае конфликтов в именах стилей ячеек формат стиля целевых ячеек устанавливается как переопределенный. Аналогичное действие применяется к строкам и столбцам, которые ссылаются на эти стили ячеек.
 CopyDuplicates
 Значение: 1. В случае конфликтов в именах стилей ячеек конфликтующие стили ячеек копируются из исходной таблицы в целевую как новые стили ячеек.
 IgnoreNewStyles
 Значение: 8. Если в целевом стиле таблицы стиль ячеек не задан, он не копируется из исходной таблицы в целевую.
 None
 Значение: 0. Опции не заданы. Если в целевом стиле таблицы стиль ячеек не указан, он будет скопирован из исходного стиля таблицы.
 OverwriteDuplicates
 Значение: 2. В случае конфликтов в именах стилей ячеек стили ячеек в целевом стиле таблицы копируются и перезаписываются.
 Описание
 Перечисление MergeCellStyleOption определяет опции объединения стилей ячеек.
 Ваши комментарии по поводу этого топика: Послать отзыв!