Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.RevolveOptions.CheckRevolveCurve
 Послать отзыв
 Метод реализует проверку на допустимость указанного объекта чертежа для операции вращения вокруг указанной оси.
 Синтаксис
C#
Visual Basic
Копировать Код
public RevolveOptionsCheckRevolveCurveOut CheckRevolveCurve( ref Entity ent, Point3d axisPnt, Vector3d axisDir, bool displayErrorMessages );
Копировать Код
Public Function CheckRevolveCurve( ByRef ent As Entity, axisPnt As Point3d, axisDir As Vector3d, displayErrorMessages As Boolean ) As RevolveOptionsCheckRevolveCurveOut
 Параметры
 Параметры
 Описание
 ent
 Объект чертежа, проверяемый на допустимость для операции вращения. Тип Entity.
 axisPnt
 Точка на оси вращения. Тип Point3d.
 axisDir
 Направляющий вектор оси вращения. Тип Vector3d.
 displayErrorMessages
 Входной флаг, определяющий, следует ли выводить сообщения об ошибках в случае их обнаружения. Тип bool.
 Возвращает
 Возвращает результат проверки в виде объекта типа RevolveOptionsCheckRevolveCurveOut.
 Описание
 Метод реализует проверку на допустимость указанного объекта чертежа для операции вращения вокруг указанной оси.
 Результатом проверки является объект RevolveOptionsCheckRevolveCurveOut, свойства которого служат индикаторами следующих состояний.
Входной геометрический объект представляет собой замкнутую область (регион).
Кривая образующей является незамкнутой, и ее конечные точки располагаются на оси вращения.
Кривая образующей является плоской.
 Замечания
 Эта проверка всегда выполняется методами CreateRevolvedSurface() и CreateRevolvedSolid(), поэтому приложению не обязательно вызывать этот метод непосредственно.
 Ссылки
 Teigha.DatabaseServices.RevolveOptions, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!