Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.NurbSurface.Evaluate
 Послать отзыв
 Метод предназначен для вычисления 3D-точки на NURBS поверхности для заданных значений параметров (dU, dV). Дополнительно метод вычисляет массив производных по указанному параметру u или v.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Evaluate( double dU, double dV, int derivDegree, Point3d point, Vector3dCollection derivatives );
Копировать Код
Public Sub Evaluate( dU As Double, dV As Double, derivDegree As Integer, point As Point3d, derivatives As Vector3dCollection )
 Параметры
 Параметры
 Описание
 dU
 Входной параметр в направлении U. Тип double.
 dV
 Входной параметр в направлении V. Тип double.
 derivDegree
 Входной аргумент, определяющий выбор параметра u или v для вычисления массива derivatives. Тип int. Параметру u соответствует значение 0, параметру v - значение 1.
 point
 Вычисленная 3D-точка на NURBS поверхности. Тип Point3d.
 derivatives
 Вычисленный массив первых производных по указанному параметру. Тип Vector3dCollection.
 Описание
 Метод предназначен для вычисления 3D-точки на NURBS поверхности для заданных значений параметров (dU, dV). Дополнительно метод вычисляет массив первых производных по u или по v в зависимости от значения входного параметра derivDegree - 0 или 1, соответственно.
 Замечания
 Если поверхность не содержит никакой NURBS информации, выбрасывается исключение eFail. Если любое из значений dU или dV выходит за пределы допустимого диапазона, генерируется исключение eOutOfRange. Если этот метод в конкретном моделере не реализован, выбрасывается исключение eNotImplementedYet.
 Ссылки
 Teigha.DatabaseServices.NurbSurface, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!