Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CurveBoundary.DegeneratePosition
 Послать отзыв
 Свойство DegeneratePosition представляет позицию в трехмерном пространстве для вырожденной границы.
 Синтаксис
C#
Visual Basic
Копировать Код
public Position3d DegeneratePosition;
Копировать Код
Public ReadOnly Property DegeneratePosition As Position3d
 Возвращает
 Возвращает позицию вырожденной границы в трехмерном пространстве. Тип Position3d.
 Описание
 Свойство DegeneratePosition представляет позицию в трехмерном пространстве для вырожденной границы.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.CurveBoundary, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!