Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.XrefGraphNode.BlockTableRecordId
 Послать отзыв
 Свойство BlockTableRecordId представляет идентификатор объекта BlockTableRecord, связанный с данным узлом.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.ObjectId BlockTableRecordId;
Копировать Код
Public Property BlockTableRecordId() As DatabaseServices.ObjectId
 Возвращает
 Возвращает идентификатор связанного объекта BlockTableRecord. Тип DatabaseServices.ObjectId.
 Описание
 Свойство BlockTableRecordId представляет идентификатор объекта BlockTableRecord, связанный с данным узлом.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.XrefGraphNode, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!