Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MTextFragment.NewParagraph
 Послать отзыв
 Свойство позволяет проверить, является ли данный фрагмент началом нового абзаца текста.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool NewParagraph;
Копировать Код
Public ReadOnly Property NewParagraph As Boolean
 Возвращает
 Возвращает true, если данный фрагмент представляет начало нового абзаца текста. В противном случае возвращает false.
 Описание
 Свойство позволяет проверить, является ли данный фрагмент началом нового абзаца текста.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.MTextFragment, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!