Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbCurve3d.SetFitData
 Послать отзыв
 Метод перевычисляет сплайн, используя указанные определяющие точки и степень сплайна, а также точность по умолчанию.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetFitData( int degree, ref Point3dCollection fitPoints );
Копировать Код
Public Sub SetFitData( degree As Integer, ByRef fitPoints As Point3dCollection )
 Параметры
 Параметры
 Описание
 degree
 Степень сплайна. Тип int.
 fitPoints
 Массив определяющих точек сплайна. Тип Point3dCollection.
 Описание
 Метод перевычисляет сплайн, используя указанные определяющие точки и степень сплайна.
 Используется вызов метода NurbCurve3d.SetFitData(int degree, Point3dCollection fitPoints, Tolerance fitTolerance) с точностью по умолчанию, равной Tolerance.Global.
 Замечания
 Чем выше степень, тем более гибким получается сплайн. Степень 1 определяет полилинии, а степень 2 определяет NURBS кривые постоянной кривизны (окружности и круглые дуги) и т.д.
 Ссылки
 Teigha.Geometry.NurbCurve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!