Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.RenderSettings.DisplayIndex
 Послать отзыв
 Свойство DisplayIndex представляет порядок отображения в пользовательском интерфейсе записей словаря ACAD_RENDER_SETTINGS.
 Синтаксис
C#
Visual Basic
Копировать Код
public int DisplayIndex;
Копировать Код
Public Property DisplayIndex As Integer
 Возвращает
 Возвращает порядок отображения записей. Тип int.
 Описание
 Свойство DisplayIndex представляет порядок отображения в пользовательском интерфейсе записей словаря ACAD_RENDER_SETTINGS.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.RenderSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!