Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.SetBreakOffset
 Послать отзыв
 Метод позволяет задать вектор смещения разрыва таблицы.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetBreakOffset( int index, Vector3d offset );
Копировать Код
Public virtual Sub SetBreakOffset( index As Integer, offset As Vector3d )
 Параметры
 Параметры
 Описание
 index
 Индекс фрагмента таблицы, тип int. Индекс должен быть больше или равен нулю и меньше количества фрагментов, на которые разбита данная таблица.
 offset
 Вектор смещения. Тип Vector3d.
 Описание
 Метод позволяет задать вектор смещения разрыва таблицы.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!