Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Ole2Frame.Ole2Frame
 Послать отзыв
 Конструктор по умолчанию класса Ole2Frame.
 Синтаксис
C#
Visual Basic
Копировать Код
public Ole2Frame();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса Ole2Frame.
 Ссылки
 Teigha.DatabaseServices.Ole2Frame, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!