Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocDependency.IsDelegatingToOwningAction
 Послать отзыв
 Свойство проверяет или задает режим делегирования действию-владельцу некоторыми методами зависимостей, если метод не реализован непосредственно в зависимости или в объекте AssocDependencyBody, которым может владеть зависимость.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsDelegatingToOwningAction;
Копировать Код
Public Property IsDelegatingToOwningAction() As Boolean
 Возвращает
 Возвращает true, если режим делегирования установлен. В противном случае возвращает false.
 Описание
 Свойство проверяет или задает режим делегирования действию-владельцу некоторыми методами зависимостей, если метод не реализован непосредственно в зависимости или в объекте AssocDependencyBody, которым может владеть зависимость. По умолчанию установлено значение true, т.е. делегирование имеет место.
 Примерами методов, выполняющих делегирование от зависимости действию-владельцу, являются такие методы, как IsRelevantChange(), HasCachedValue(), IsEqualTo(), IsDependentOnTheSameThingAs(), Evaluate() и т.д.
 Причина такого делегирования — желание предоставить разработчикам пользовательских действий больше свободы в выборе места хранения данных, связанных с зависимостями, которые принадлежат их пользовательским действиям, а также уменьшение потребности в создании новых классов тела зависимости.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.AssocDependency, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!