Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbCurve2d.GetParametersOfC1Discontinuity
 Послать отзыв
 Метод предоставляет значения параметра всех точек сплайна с нарушенной C1 непрерывностью (неравные касательные векторы слева и справа от точки).
 Синтаксис
C#
Visual Basic
Копировать Код
public DoubleCollection GetParametersOfC1Discontinuity();
Копировать Код
Public Function GetParametersOfC1Discontinuity() As DoubleCollection
 Возвращает
 Возвращает массив значений параметра в точках с нарушенной C1 непрерывностью. Тип DoubleCollection.
 Описание
 Метод предоставляет значения параметра всех точек сплайна с нарушенной C1 непрерывностью. В таких точках касательные векторы слева и справа от точки хотя и коллинеарны, но отличаются по модулю.
 Этот метод вызывает NurbCurve2d.GetParametersOfC1Discontinuity(Tolerance tolerance) с точностью, равной на Tolerance.Global.
 Ссылки
 Teigha.Geometry.NurbCurve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!