Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.NurbSurface.DegreeInV
 Послать отзыв
 Свойство представляет степень NURBS поверхности в направлении v.
 Синтаксис
C#
Visual Basic
Копировать Код
public int DegreeInV;
Копировать Код
Public ReadOnly Property DegreeInV As Integer
 Возвращает
 Возвращает степень NURBS поверхности. Тип int.
 Описание
 Свойство представляет степень NURBS поверхности в направлении v.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.NurbSurface, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!