Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotSettings.AddToPlotSettingsDictionary
 Послать отзыв
 Метод добавляет данный объект PlotSettings в словарь настроек печати в указанной базе данных.
 Синтаксис
C#
Visual Basic
Копировать Код
public void AddToPlotSettingsDictionary( ref DatabaseServices.Database toWhichDatabase );
Копировать Код
Public Sub AddToPlotSettingsDictionary( ByRef toWhichDatabase As DatabaseServices.Database )
 Параметры
 Параметры
 Описание
 toWhichDatabase
 База данных, в которую необходимо добавить объект настроек печати. Тип DatabaseServices.Database.
 Описание
 Метод добавляет данный объект PlotSettings в словарь настроек печати в указанной базе данных.
 Ссылки
 Teigha.DatabaseServices.PlotSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!