Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.SetValue
 Послать отзыв
 Метод позволяет задать значение у первого элемента содержимого ячейки.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetValue( int row, int col, ref Object pValue );
Копировать Код
Public virtual Sub SetValue( row As Integer, col As Integer, ByRef pValue As Object )
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 col
 Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
 value
 Задаваемое значение, тип Object.
 Описание
 Метод позволяет задать значение у первого элемента содержимого ячейки.
 Замечания
 Для получения того же результата предпочтительнее использовать метод Table.Cells[row,column].Contents(i).Value.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!