Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ObjectOverrule.Close
 Послать отзыв
 Метод вызывает соответствующий метод OdDbObjectOverrule.Сlose().
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void Close( ref DBObject dbObject );
Копировать Код
Public virtual Sub Close( ByRef dbObject As DBObject )
 Параметры
 Параметры
 Описание
 dbObject
 Объект DBObject базы данных, к которому применяется переопределение.
 Описание
 Calls the corresponding OdDbObjectOverrule::close() method.
 Метод вызывает соответствующий метод OdDbObjectOverrule.Close().
 Ссылки
 Teigha.DatabaseServices.ObjectOverrule, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!