Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.TableStyle.HorizontalCellMargin
 Послать отзыв
 Свойство HorizontalCellMargin представляет величину горизонтального поля ячейки.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual double HorizontalCellMargin;
Копировать Код
Public Overridable Property HorizontalCellMargin As Double
 Возвращает
 Возвращает размер горизонтального поля ячейки. Тип double.
 Описание
 Свойство HorizontalCellMargin представляет величину горизонтального поля ячейки.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.TableStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!