Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FieldEvaluator.FieldEvaluator
 Послать отзыв
 Конструктор по умолчанию класса FieldEvaluator.
 Синтаксис
C#
Visual Basic
Копировать Код
public FieldEvaluator();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса FieldEvaluator.
 Ссылки
 Teigha.DatabaseServices.FieldEvaluator, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!