Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод BlockReference.GeometryExtentsBestFit ()
 Послать отзыв
 Синтаксис
C#
Visual Basic
public Extents3d GeometryExtentsBestFit();
Public Function GeometryExtentsBestFit() As Extents3d
 Описание
 Получает копию всех геометрических объектов в соответствующей записи таблицы блоков.
 Ссылки
 Teigha.DatabaseServices.BlockReference, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!