Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CompositeParameter.LocalParameter
 Послать отзыв
 Свойство LocalParameter представляет значение локального параметра у данного объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public double LocalParameter;
Копировать Код
Public ReadOnly Property LocalParameter As Double
 Возвращает
 Возвращает значение локального параметра. Тип double.
 Описание
 Свойство LocalParameter представляет значение локального параметра у данного объекта.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.CompositeParameter, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!