Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.XrefFullSubentityPath.GetObjectIds
 Послать отзыв
 Метод предоставляет массив идентификаторов объектов, связанных с данным объектом XrefFullSubentityPath.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectId[] GetObjectIds();
Копировать Код
Public Function GetObjectIds() As ObjectId()
 Возвращает
 Возвращает массив идентификаторов объектов. Тип ObjectId[].
 Описание
 Метод предоставляет массив идентификаторов объектов, связанных с данным объектом XrefFullSubentityPath.
 Ссылки
 Teigha.DatabaseServices.XrefFullSubentityPath, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!