Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.ThumbnailBitmap
 Послать отзыв
 Синтаксис
C#
Visual Basic
public Drawing.Bitmap ThumbnailBitmap;
Public Property ThumbnailBitmap() As Drawing.Bitmap
 Описание
 Обеспечивает доступ к растровому изображению чертежа.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!