Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CurveCurveIntersector3d.GetIntersectionRanges
 Послать отзыв
 Метод предоставляет параметрические интервалы, на которых вычисляются точки пересечения кривых.
 Синтаксис
C#
Visual Basic
Копировать Код
public Interval[] GetIntersectionRanges();
Копировать Код
Public Function GetIntersectionRanges() As Interval()
 Возвращает
 Возвращает массив параметрических интервалов. Тип Interval[]. Массив содержит ровно два элемента, которые представляют параметрические интервалы для первой и второй кривой, соответственно.
 Описание
 Метод предоставляет параметрические интервалы, на которых вычисляются точки пересечения кривых.
 Ссылки
 Teigha.Geometry.CurveCurveIntersector3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!