Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.ClipBoundary2d.ClipPolyline
 Послать отзыв
 Метод обрезает полилинию, образованную переданными в метод вершинами.
 Синтаксис
C#
Visual Basic
Копировать Код
public ClipBoundary2dData ClipPolyline( ref Point2dCollection rawVertices );
Копировать Код
Public Function ClipPolyline( ByRef rawVertices As Point2dCollection ) As ClipBoundary2dData
 Параметры
 Параметры
 Описание
 rawVertices
 Входная коллекция вершин обрезаемой полилинии. Тип Point2dCollection.
 Возвращает
 Возвращает полилинию, полученную в результате операции обрезки. Тип ClipBoundary2dData.
 Описание
 Метод обрезает полилинию, образованную переданными в метод вершинами.
 Ссылки
 Teigha.Geometry.ClipBoundary2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!