Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.PointOnSurface.GetInverseTangentVector
 Послать отзыв
 Метод проецирует указанный 3D-вектор на плоскость, касательную к поверхности в данной точке, и возвращает 2D-вектор в пространстве параметров, который отображается на этот спроецированный вектор. В текущей версии не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector2d GetInverseTangentVector( Vector3d vector );
Копировать Код
Public Function GetInverseTangentVector( vector As Vector3d ) As Vector2d
 Параметры
 Параметры
 Описание
 vector
 Входной вектор. Тип Vector3d.
 Возвращает
 Возвращает 2D-вектор в пространстве параметров, который отображается на проекцию вектора vector. Тип Vector2d.
 Описание
 Метод проецирует указанный 3D-вектор на плоскость, касательную к поверхности в данной точке, и возвращает 2D-вектор в пространстве параметров, который отображается на этот спроецированный вектор. В текущей версии этот метод не реализован.
 Ссылки
 Teigha.Geometry.PointOnSurface, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!