Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotSettings.SetShadePlot
 Послать отзыв
 Метод задает параметры для печати тонированных объектов.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetShadePlot( PlotSettingsShadePlotType type, DatabaseServices.ObjectId shadePlotId );
Копировать Код
Public Sub SetShadePlot( type As PlotSettingsShadePlotType, shadePlotId As DatabaseServices.ObjectId )
 Параметры
 Параметры
 Описание
 type
 Режим тонированной печати. Тип PlotSettingsShadePlotType.
 shadePlotId
 Идентификатор объекта визуального стиля (VisualStyle) или объекта настроек рендеринга (RenderSettings), который будет использоваться в качестве объекта тонированной печати. Тип DatabaseServices.ObjectId.
 Описание
 Метод задает параметры для печати тонированных объектов.
 Если для режима тонированной печати установлено значение AsDisplayed или Rendered, параметр shadePlotId игнорируется, а для идентификатора объекта тонированной печати автоматически устанавливается значение Null.
 Если для режима тонированной печати установлено значение VisualStyle или RenderPreset, идентификатор объекта тонированной печати должен указывать на валидный объект VisualStyle или RenderSettings.
 Ссылки
 Teigha.DatabaseServices.PlotSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!