Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CircularArc2d.GetTangent
 Послать отзыв
 Метод позволяет получить линию касательной к дуге в указанной точке.
 Синтаксис
C#
Visual Basic
Копировать Код
public Line2d GetTangent( Point2d point );
Копировать Код
Public Function GetTangent( point As Point2d ) As Line2d
 Параметры
 Параметры
 Описание
 point
 Входная точка, в которой требуется построить касательную к дуге. Тип Point2d.
 Возвращает
 Возвращает линию касательной к дуге. Тип Line2d.
 Описание
 Метод позволяет получить линию касательной к дуге в указанной точке.
 Ссылки
 Teigha.Geometry.CircularArc2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!