Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DataLinkManager.RemoveDataLink
 Послать отзыв
 Метод удаляет внешнюю ссылку с указанным идентификатором объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public void RemoveDataLink( ObjectId idDataLink );
Копировать Код
Public Sub RemoveDataLink( idDataLink As ObjectId )
 Параметры
 Параметры
 Описание
 idDataLink
 Идентификатор удаляемой внешней ссылки. Тип ObjectId.
 Описание
 Метод удаляет внешнюю ссылку с указанным идентификатором объекта ObjectId.
 Ссылки
 Teigha.DatabaseServices.DataLinkManager, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!