Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.KnotCollection.Contains
 Послать отзыв
 Метод позволяет проверить, содержится ли указанное значение в данной коллекции.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool Contains( double value );
Копировать Код
Public Function Contains( value As Double ) As Boolean
 Параметры
 Параметры
 Описание
 value
 Проверяемое значение. Тип double.
 Возвращает
 Возвращает true, если значение value содержится в коллекции. В противном случае возвращает false.
 Описание
 Метод позволяет проверить, содержится ли указанное значение в данной коллекции.
 Ссылки
 Teigha.Geometry.KnotCollection, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!