Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DimAssoc.TransSpatial
 Послать отзыв
 Свойство TransSpatial позволяет определить, распространяется ли ассоциативность данного объекта на все пространства (код DXF 70).
 Синтаксис
C#
Visual Basic
Копировать Код
public bool TransSpatial;
Копировать Код
Public Property TransSpatial As Boolean
 Возвращает
 Возвращает true, если ассоциативность данного объекта распространяется на все пространства. В противном случае возвращает false.
 Описание
 Свойство TransSpatial позволяет определить, распространяется ли ассоциативность данного объекта на все пространства (код DXF 70).
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.DimAssoc, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!