Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FormattedTableData.GetOverride
 Послать отзыв
 Метод позволяет получить переопределения ячейки, строки, столбца или содержимого ячейки.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual CellProperties GetOverride( int row, int column, int content );
Копировать Код
Public Overridable Function GetOverride( row As Integer, column As Integer, content As Integer ) As CellProperties
 Параметры
 Параметры
 Описание
 row
 Индекс строки. Тип int. Индекс может равняться -1.
 column
 Индекс столбца. Тип int. Индекс может равняться -1.
 content
 Индекс элемента содержимого ячейки. Тип int. Индекс может равняться -1.
 Возвращает
 Возвращает выявленные переопределения у линий сетки как комбинацию битовых полей из перечисления GridProperties.
 Описание
 Метод позволяет получить переопределения ячейки, строки, столбца или содержимого ячейки.
 Чтобы указать элемент содержимого ячейки, следует задать допустимые индексы строки, столбца и элемента содержимого ячейки. Чтобы указать ячейку, следует задать допустимые индексы строки и столбца, а также -1 в качестве индекса элемента содержимого ячейки. Чтобы указать строку, следует задать допустимый индекс строки и -1 для индексов столбца и элемента содержимого ячейки. Чтобы указать столбец, следует задать допустимый индекс столбца и -1 для индексов строки и элемента содержимого ячейки.
 Ссылки
 Teigha.DatabaseServices.FormattedTableData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!