Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FaceRecord.IsEdgeVisibleAt
 Послать отзыв
 Метод позволяет определить, является ли видимым ребро с началом в заданной угловой точке.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsEdgeVisibleAt( short faceIndex );
Копировать Код
Public Function IsEdgeVisibleAt( faceIndex As Short ) As Boolean
 Параметры
 Параметры
 Описание
 faceIndex
 Индекс начальной точки ребра. Тип short.
 Возвращает
 Возвращает true, если ребро является видимым. В противном случае возвращает false.
 Описание
 Метод позволяет определить, видимо ли ребро с началом в угловой точке с индексом faceIndex.
 Ссылки
 Teigha.DatabaseServices.FaceRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!