Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CellContentsCollection.Item
 Послать отзыв
 Свойство Item предоставляет доступ к элементу коллекции с указанным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public CellContent this[int val];
Копировать Код
Default Public ReadOnly Property Item( val As Integer ) As CellContent
 Параметры
 Параметры
 Описание
 val
 Входной индекс требуемого элемента. Тип int. Значения индекса отсчитываются от нуля.
 Возвращает
 Возвращает элемент коллекции с указанным индексом. Тип CellContent.
 Описание
 Свойство Item предоставляет доступ к элементу коллекции с указанным индексом.
 Замечания
 Если значение аргумента val окажется недействительным, выбрасывается исключение ArgumentOutOfRangeException.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.CellContentsCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!