Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Viewport.SetUcsToWorld
 Послать отзыв
 Метод позволяет совместить ПСК данного видового экрана с мировой системой координат.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetUcsToWorld();
Копировать Код
Public Sub SetUcsToWorld()
 Описание
 Метод позволяет совместить ПСК данного видового экрана с мировой системой координат (МСК, WCS).
 Ссылки
 Teigha.DatabaseServices.Viewport, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!