Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ShadePlotResLevel
 Послать отзыв
 Данное перечисление определяет доступные уровни разрешения при тонированной печати.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum ShadePlotResLevel { Custom = 5, Draft = 0, Maximum = 4, Normal = 2, Presentation = 3, Preview = 1 }
Копировать Код
Public Enum ShadePlotResLevel Custom = 5 Draft = 0 Maximum = 4 Normal = 2 Presentation = 3 Preview = 1 End Enum
 Члены
 Члены
 Описание
 Draft
 Значение: 0. Черновой вывод на печать.
 Preview
 Значение: 1. Вывод на печать с разрешением предварительного просмотра.
 Normal
 Значение: 2. Вывод на печать с нормальным (типичным) разрешением.
 Presentation
 Значение: 3. Вывод на печать с разрешением, используемым для презентационных видов.
 Maximum
 Значение: 4. Вывод на печать с максимально возможным разрешением для устройства печати.
 Custom
 Значение: 5. Разрешение при выводе на печать определяется пользовательскими настройками.
 Описание
 Данное перечисление определяет доступные уровни разрешения при печати растрированных и тонированных видовых экранов.
 Ваши комментарии по поводу этого топика: Послать отзыв!