Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.PolylineCurve2d.PolylineCurve2d
 Послать отзыв
 Конструктор класса PolylineCurve2d. Создает полилинию, которая аппроксимирует указанную кривую с заданной точностью.
 Синтаксис
C#
Visual Basic
Копировать Код
public PolylineCurve2d( ref Curve2d curve, double epsilon );
Копировать Код
Public Sub New( ByRef curve As Curve2d, epsilon As Double )
 Параметры
 Параметры
 Описание
 curve
 Кривая, которую требуется аппроксимировать полилинией. Тип Curve2d.
 epsilon
 Точность аппроксимации. Тип double.
 Описание
 Конструктор класса PolylineCurve2d. Создает экземпляр класса с указанными параметрами. Создает полилинию, аппроксимирующую кривую curve в пределах заданной точности epsilon.
 Ссылки
 Teigha.Geometry.PolylineCurve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!