Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство DBText.Justify
 Послать отзыв
 Синтаксис
C#
Visual Basic
public DatabaseServices::AttachmentPoint Justify;
Public Property Justify() As DatabaseServices.AttachmentPoint
 Описание
 Возвращает или устанавливает точку (-ки) выравнивания текста.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.DBText, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!