Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Dimtvp
 Послать отзыв
 Синтаксис
C#
Visual Basic
public double Dimtvp;
Public Property Dimtvp() As Double
 Описание
 Возвращает или устанавливает текущее значение DIMTVP для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!