Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MentalRayRenderSettings.ShadowMode
 Послать отзыв
 Свойство ShadowMode представляет используемый метод вычисления теней методом трассировки лучей.
 Синтаксис
C#
Visual Basic
Копировать Код
public GraphicsInterface.ShadowMode ShadowMode;
Копировать Код
Public Property ShadowMode As GraphicsInterface.ShadowMode
 Возвращает
 Возвращает метод вычисления теней методом трассировки лучей. Значение из перечисления GraphicsInterface.ShadowMode.
 Описание
 Свойство ShadowMode представляет используемый метод вычисления теней методом трассировки лучей. Влияет только на источники света, использующие расчет теней методом трассировки лучей.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MentalRayRenderSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!