Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SweptSurface.ProfileRotation
 Послать отзыв
 Свойство ProfileRotation представляет угол поворота профиля.
 Синтаксис
C#
Visual Basic
Копировать Код
public double ProfileRotation;
Копировать Код
Public Property ProfileRotation As Double
 Возвращает
 Возвращает угол поворота. Тип double.
 Описание
 Свойство ProfileRotation представляет угол поворота профиля.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.SweptSurface, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!