Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Cone.HalfAngle
 Послать отзыв
 Свойство HalfAngle представляет угол между осью и образующей конуса.
 Синтаксис
C#
Visual Basic
Копировать Код
public double HalfAngle;
Копировать Код
Public ReadOnly Property HalfAngle As Double
 Возвращает
 Возвращает угол между осью и образующей конуса (в радианах). Тип double.
 Описание
 Свойство HalfAngle представляет угол между осью и образующей конуса.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.Cone, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!