Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.BoundedPlane.BoundedPlane
 Послать отзыв
 Конструктор класса BoundedPlane. Создает ограниченную плоскую поверхность, определяемую ее началом и двумя точками в этой плоскости.
 Синтаксис
C#
Visual Basic
Копировать Код
public BoundedPlane( Point3d p1, Point3d origin, Point3d p2 );
Копировать Код
Public Sub New( p1 As Point3d, origin As Point3d, p2 As Point3d )
 Параметры
 Параметры
 Описание
 p1
 Первая точка. Тип Point3d.
 origin
 Точка начала. Тип Point3d.
 p2
 Вторая точка. Тип Point3d.
 Описание
 Конструктор класса BoundedPlane. Создает ограниченную плоскую поверхность, определяемую ее началом и двумя точками в этой плоскости.
 Ссылки
 Teigha.Geometry.BoundedPlane, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!