Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.EllipticalCone.IsClosed
 Послать отзыв
 Метод позволяет проверить, является ли основание этого эллиптического конуса полным эллипсом.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsClosed();
Копировать Код
Public Function IsClosed() As Boolean
 Возвращает
 Возвращает true, если основание данного эллиптического конуса является полным эллипсом. В противном случае возвращает false.
 Описание
 Метод позволяет проверить, является ли основание этого эллиптического конуса полным эллипсом. Используется вызов метода EllipticalCone.IsClosed(Tolerance) с точностью, равной Tolerance.Global.
 Ссылки
 Teigha.Geometry.EllipticalCone, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!