Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод SymbolTable.Add
 Послать отзыв
 Синтаксис
C#
Visual Basic
public DatabaseServices::ObjectId Add(ref SymbolTableRecord value);
Public Function Add(ByRef value As SymbolTableRecord) As DatabaseServices.ObjectId
 Параметры
 Параметры
 Описание
 value
 Входная запись для добавления в таблицу
 Описание
 Этот метод добавляет запись value и в базу данных, содержащую таблицу, и в саму эту таблицу.
 Ссылки
 Teigha.DatabaseServices.SymbolTable, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!