Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.VertexRef.VertexRef
 Послать отзыв
 Конструктор по умолчанию класса VertexRef.
 Синтаксис
C#
Visual Basic
Копировать Код
public VertexRef();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса VertexRef.
 Ссылки
 Teigha.DatabaseServices.VertexRef, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!