Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DwgFiler.ReadScale3d
 Послать отзыв
 Метод предназначен для получения масштаба из текущего элемента данного объекта Filer.
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract Scale3d ReadScale3d();
Копировать Код
Public MustOverride Function ReadScale3d() As Scale3d
 Возвращает
 Возвращает масштаб. Тип Scale3d.
 Описание
 Метод предназначен для получения масштаба из текущего элемента данного объекта Filer.
 Ссылки
 Teigha.DatabaseServices.DwgFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!