Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LayerStateManager.GetLayerStateLayers
 Послать отзыв
 Возвращает массив с именами всех слоев, сохраненных в состоянии слоя. Если bInvert равно true, массив будет содержать имена слоев в текущем чертеже, которые НЕ сохранены в состоянии слоя.
 Синтаксис
C#
Visual Basic
Копировать Код
public ArrayList GetLayerStateLayers( ref String name, bool bInvert );
Копировать Код
Public Function GetLayerStateLayers( ByRef name As String, bInvert As Boolean ) As ArrayList
 Параметры
 Параметры
 Описание
 name
 Имя состояния слоя, для которого выполняется запрос, тип String.
 bInvert
 Если данному аргументу задано значение true, возвращаемый массив будет содержать имена слоев в текущем чертеже, которые НЕ сохранены в состоянии слоя. Тип bool.
 Возвращает
 Тип результата - ArrayList.
 Описание
 Возвращает массив с именами всех слоев, сохраненных в состоянии слоя. Если bInvert равно true, массив будет содержать имена слоев в текущем чертеже, которые НЕ сохранены в состоянии слоя.
 Ссылки
 Teigha.DatabaseServices.LayerStateManager, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!