Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.TextStyleTable
 Послать отзыв
 Класс представляет таблицу текстовых стилей в базе данных чертежа.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::GraphicsInterface::Drawable Teigha::DatabaseServices::DBObject Teigha::DatabaseServices::SymbolTable Teigha::DatabaseServices::TextStyleTable
 Синтаксис
C#
Visual Basic
[Wrapper("AcDbTextStyleTable")] public class TextStyleTable : SymbolTable;
<Wrapper("AcDbTextStyleTable")> Public Class TextStyleTable Inherits SymbolTable
 Описание
 Этот класс является таблицей символов для TextStyleTableRecords, который представляет текстовые стили.
 Методы
 Конструкторы
 Teigha.GraphicsInterface.Drawable
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 Drawable
 Конструктор класса Teigha.GraphicsInterface.Drawable. (Унаследован от Drawable)
 Teigha.DatabaseServices.DBObject
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 DBObject
 Конструктор. (Унаследован от DBObject)
 Teigha.DatabaseServices.SymbolTable
 ПоказатьPrivateУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 SymbolTable
 This is SymbolTable, a member of class SymbolTable. (Унаследован от SymbolTable)
 Teigha.DatabaseServices.TextStyleTable
 ПоказатьInternal
 Нет совпадений по текущему фильтру
 Имя
 Описание
 TextStyleTable
 This is TextStyleTable, a member of class TextStyleTable.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.GraphicsInterface.Drawable
 Имя
 Описание
 Drawable Методы
 Ниже перечислены методы класса Drawable.
 Drawable Свойства
 Ниже перечислены свойства класса Drawable.
 Teigha.DatabaseServices.DBObject
 Имя
 Описание
 DBObject Методы
 Ниже перечислены методы класса DBObject.
 DBObject Свойства
 Ниже перечислены свойства класса DBObject.
 DBObject События
 Ниже перечислены события класса DBObject.
 Teigha.DatabaseServices.SymbolTable
 Имя
 Описание
 SymbolTable Методы
 Ниже перечислены методы класса SymbolTable.
 SymbolTable Свойства
 Ниже перечислены свойства класса SymbolTable.
 Ссылки
 Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства, DBObject События
 Ваши комментарии по поводу этого топика: Послать отзыв!