Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.OsnapPointRef.Point
 Послать отзыв
 Свойство Point представляет текущие координаты данной точки привязки.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d Point;
Копировать Код
Public Property Point As Point3d
 Возвращает
 Возвращает координаты точки привязки. Тип Point3d.
 Описание
 Свойство Point представляет текущие координаты данной точки привязки.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.OsnapPointRef, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!