Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор SymbolTableRecord.SymbolTableRecord
 Послать отзыв
 This is SymbolTableRecord, a member of class SymbolTableRecord.
 Синтаксис
C#
Visual Basic
public SymbolTableRecord(IntPtr unmanagedPointer, bool autoDelete);
Public Sub New(unmanagedPointer As IntPtr, autoDelete As bool)
 Ссылки
 Teigha.DatabaseServices.SymbolTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!