Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.TextLineSpacingFactor
 Послать отзыв
 Свойство задает или возвращает относительное расстояние между базовыми линиями соседних строк текста.
 Синтаксис
C#
Visual Basic
Копировать Код
public double TextLineSpacingFactor;
Копировать Код
Public Property TextLineSpacingFactor As Double
 Возвращает
 Возвращает коэффициент межстрочного интервала. Тип double.
 Описание
 Свойство задает или возвращает относительное расстояние между базовыми линиями соседних строк текста. Коэффициент межстрочного интервала принимает значения в диапазоне от 0,25 до 4,0. TextLineSpacingFactor имеет тот же эффект, что и свойство LineSpacingFactor объекта MText.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!