Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 ViewportTableRecord.GridSubdivisionRestricted
 Послать отзыв
 Свойство предназначено для настройки разбиения ячеек на более мелкие, чем настроено в свойстве GridIncrements.
 Синтаксис
C#
Visual Basic
public bool GridSubdivisionRestricted;
Public Property GridSubdivisionRestricted() As bool
 Возвращает
 Возвращает тип данных bool:
true – дробление сетки меньше шага включено при условии, что свойство GridAdaptive = true;
false – дробление сетки меньше шага выключено.
 Описание
 C помощью свойства можно настраивать разбиение сетки на более мелкие ячейки, чем настроено в GridIncrements. Если GridSubdivisionRestricted=true, разбиение ячеек будет происходить при условии, что GridAdaptive=true. Кода GridAdaptive=false, значение GridSubdivisionRestricted игнорируется. В интерфейсе свойство настраивается через диалоговое окно «Режимы черчения» для каждого видового экрана отдельно. Окно «Режимы черчения» можно открыть либо командой DDRMODES, DDSETTINGS, либо через меню Сервис -> Режимы черчения…
 Условия
 Чтение и запись.
 Ссылки
 ViewportTableRecord Класс, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!