Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CoordinateSystem3d.Yaxis
 Послать отзыв
 Свойство Yaxis представляет направляющий вектор оси Y данной системы координат.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d Yaxis;
Копировать Код
Public ReadOnly Property Yaxis As Vector3d
 Возвращает
 Возвращает направляющий вектор оси Y данной системы координат. Тип Vector3d.
 Описание
 Свойство Yaxis представляет направляющий вектор оси Y данной системы координат.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.CoordinateSystem3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!