Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство BlockReference.AttributeCollection
 Послать отзыв
 Синтаксис
C#
Visual Basic
public DatabaseServices::AttributeCollection AttributeCollection;
Public Property AttributeCollection() As DatabaseServices.AttributeCollection
 Описание
 Возвращает значение свойства AttributeCollection.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.BlockReference, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!