Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 DimStyleTable.DimStyleTable(IntPtr,bool)
 Послать отзыв
 Констурктор класса.
 Синтаксис
C#
Visual Basic
internal DimStyleTable(IntPtr unmanagedPointer, bool autoDelete);
Friend Sub New(unmanagedPointer As IntPtr, autoDelete As bool)
 Описание
 Констурктор класса.
 Ссылки
 Teigha.DatabaseServices.DimStyleTable, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!