Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotStyleNameType
 Послать отзыв
 Перечисление PlotStyleNameType представляет типы определения имени стиля печати.
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("Oda.PlotStyleNameType")] public enum PlotStyleNameType { PlotStyleNameByLayer = 0, PlotStyleNameByBlock = 1, PlotStyleNameIsDictionaryDefault = 2, PlotStyleNameById = 3 }
Копировать Код
<Wrapper("Oda.PlotStyleNameType")> Public Enum PlotStyleNameType PlotStyleNameByLayer = 0 PlotStyleNameByBlock = 1 PlotStyleNameIsDictionaryDefault = 2 PlotStyleNameById = 3 End Enum
 Члены
 Члены
 Описание
 PlotStyleNameByBlock
 Значение: 1. Имя стиля печати определяется по блоку.
 PlotStyleNameById
 Значение: 3. Имя стиля печати определяется идентификатором объекта.
 PlotStyleNameByLayer
 Значение: 0. Имя стиля печати определяется по слою.
 PlotStyleNameIsDictionaryDefault
 Значение: 2. Имя стиля печати определяется словарем по умолчанию.
 Описание
 Перечисление PlotStyleNameType представляет типы определения имени стиля печати.
 Ваши комментарии по поводу этого топика: Послать отзыв!