Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FormattedTableData.RemoveAllOverrides
 Послать отзыв
 Метод предназначен для удаления всех переопределений в ячейке, строке или столбце.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void RemoveAllOverrides( int row, int column );
Копировать Код
Public Overridable Sub RemoveAllOverrides( row As Integer, column As Integer )
 Параметры
 Параметры
 Описание
 row
 Индекс строки. Тип int. Индекс может равняться -1.
 column
 Индекс столбца. Тип int. Индекс может равняться -1.
 Описание
 Метод удаляет все переопределения в ячейке, строке или столбце.
 Чтобы указать ячейку, следует задать допустимые индексы строки и столбца. Чтобы указать строку, следует задать допустимый индекс строки и -1 в качестве индекса столбца. Чтобы указать столбец, следует задать допустимый индекс столбца и -1 в качестве индекса строки.
 Ссылки
 Teigha.DatabaseServices.FormattedTableData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!