Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CellRange.TopRow
 Послать отзыв
 Свойство возвращает индекс верхней строки этого диапазона ячеек.
 Синтаксис
C#
Visual Basic
Копировать Код
public int TopRow;
Копировать Код
Public ReadOnly Property TopRow As Integer
 Возвращает
 Возвращает индекс верхней строки диапазона. Тип int.
 Описание
 Свойство возвращает индекс верхней строки этого диапазона ячеек.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.CellRange, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!