Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Делегат Teigha.DatabaseServices.MTextFragmentCallback
 Послать отзыв
 This is type Teigha::DatabaseServices::MTextFragmentCallback.
 Синтаксис
C#
Visual Basic
public delegate MTextFragmentCallback();
Public Delegate Sub MTextFragmentCallback()
 Ваши комментарии по поводу этого топика: Послать отзыв!