Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Cone.GetHalfAngles
 Послать отзыв
 Метод позволяет получить косинус и синус угла между осью конуса и его образующей.
 Синтаксис
C#
Visual Basic
Копировать Код
public double[] GetHalfAngles();
Копировать Код
Public Function GetHalfAngles() As Double()
 Возвращает
 Возвращает массив, в котором элемент с индексом 0 представляет косинус угла, а с индексом 1 — синус угла между осью конуса и его образующей. Тип double[].
 Описание
 Метод позволяет получить косинус и синус угла между осью конуса и его образующей.
 Ссылки
 Teigha.Geometry.Cone, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!