Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Chamferd
 Послать отзыв
 Синтаксис
C#
Visual Basic
public double Chamferd;
Public Property Chamferd() As Double
 Описание
 Возвращает или устанавливает текущее значение CHAMFERD для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!