Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocArrayPolarParameters.Direction
 Послать отзыв
 Свойство обеспечивает доступ к направлению кругового массива.
 Синтаксис
C#
Visual Basic
Копировать Код
public ArcDirection Direction;
Копировать Код
Public Property Direction() As ArcDirection
 Возвращает
 Возвращает направление кругового массива как значение из перечисления ArcDirection.
 Описание
 Свойство обеспечивает доступ к направлению кругового массива.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.AssocArrayPolarParameters, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!