Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Line3d
 Послать отзыв
 Класс представляет бесконечные линии в трехмерном пространстве.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Geometry::Entity3d Teigha::Geometry::Curve3d Teigha::Geometry::LinearEntity3d Teigha::Geometry::Line3d
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdGeLine3d")] public class Line3d : LinearEntity3d;
Копировать Код
<Wrapper("OdGeLine3d")> Public Class Line3d Inherits LinearEntity3d
 Описание
 Класс представляет бесконечные линии в трехмерном пространстве.
 Методы
 Конструкторы
 Teigha.Geometry.Line3d
 Имя
 Описание
 Line3d
 Это обзор перегрузок Line3d.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Geometry.Entity3d
 Имя
 Описание
 Entity3d Методы
 Ниже перечислены методы класса Entity3d.
 Teigha.Geometry.Curve3d
 Имя
 Описание
 Curve3d Методы
 Ниже перечислены методы класса Curve3d.
 Curve3d Свойства
 Ниже перечислены свойства класса Curve3d.
 Teigha.Geometry.LinearEntity3d
 Имя
 Описание
 LinearEntity3d Методы
 Ниже перечислены методы класса LinearEntity3d.
 LinearEntity3d Свойства
 Ниже перечислены свойства класса LinearEntity3d.
 Teigha.Geometry.Line3d
 Имя
 Описание
 Line3d Методы
 Ниже перечислены методы класса Line3d.
 Ссылки
 Line3d Конструктор, Line3d Методы, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!