Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector2d.+
 Послать отзыв
 Оператор сложения для класса Vector2d.
 Синтаксис
C#
Visual Basic
Копировать Код
public static Vector2d Vector2d +( Vector2d a, Vector2d b );
Копировать Код
Public Shared Operator +( a As Vector2d, b As Vector2d ) As Vector2d
 Параметры
 Параметры
 Описание
 a
 Левый операнд. Тип Vector2d.
 b
 Правый операнд. Тип Vector2d.
 Возвращает
 Возвращает вектор, который является векторной суммой 2D-векторов a + b. Тип Vector2d.
 Описание
 Оператор создает 2D-вектор, который является векторной суммой двух заданных 2D-векторов.
 Ссылки
 Teigha.Geometry.Vector2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!