Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CompositeParameter.==
 Послать отзыв
 Оператор равенства структуры CompositeParameter.
 Синтаксис
C#
Visual Basic
Копировать Код
public static bool operator ==( CompositeParameter a, CompositeParameter b );
Копировать Код
Public Shared Operator =( a As CompositeParameter, b As CompositeParameter ) As Boolean
 Параметры
 Параметры
 Описание
 a
 Левый операнд. Тип CompositeParameter.
 b
 Правый операнд. Тип CompositeParameter.
 Возвращает
 Возвращает true, если оба объекта не являются нулевыми и одновременно выполняются следующие условия:
Индексы подкривых совпадают.
Значения локальных параметров равны.
 В противном случае возвращает false.
 Описание
 Оператор равенства структуры CompositeParameter.
 Ссылки
 Teigha.Geometry.CompositeParameter, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!