Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Hatch.GetAssociatedObjectIds
 Послать отзыв
 Синтаксис
C#
Visual Basic
public ObjectIdCollection GetAssociatedObjectIds();
Public Function GetAssociatedObjectIds() As ObjectIdCollection
 Описание
 Метод возвращает все Id объектов исходных контуров, ассоциированных с объектом заливки.
 Ссылки
 Teigha.DatabaseServices.Hatch, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!