Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector2dCollection.DefaultSize
 Послать отзыв
 Поле DefaultSize представляет начальную ёмкость новой коллекции Vector2dCollection, создаваемой конструктором по умолчанию.
 Синтаксис
C#
Visual Basic
Копировать Код
public const int DefaultSize = 10;
Копировать Код
Public DefaultSize As Integer = 10
 Возвращает
 Возвращает ёмкость по умолчанию для новой коллекции. Тип int.
 Описание
 Поле DefaultSize представляет начальную ёмкость новой коллекции Vector2dCollection, создаваемой конструктором по умолчанию.
 Ссылки
 Teigha.Geometry.Vector2dCollection, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!