Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Entity2d.ScaleBy
 Послать отзыв
 Метод позволяет изменить масштаб данного объекта на заданную величину относительно указанной точки.
 Синтаксис
C#
Visual Basic
Копировать Код
public void ScaleBy( double scaleFactor, Point2d point );
Копировать Код
Public Sub ScaleBy( scaleFactor As Double, point As Point2d )
 Параметры
 Параметры
 Описание
 scaleFactor
 Коэффициент масштабирования объекта. Тип double.
 point
 Точка, относительно которой выполняется масштабирование объекта. Тип Point2d.
 Описание
 Метод позволяет изменить масштаб данного объекта на заданную величину относительно указанной точки.
 Ссылки
 Teigha.Geometry.Entity2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!