Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PolyFaceMeshVertex.PolyFaceMeshVertex
 Послать отзыв
 Конструктор класса PolyFaceMeshVertex. Создает экземпляр класса в заданной пространственной точке.
 Синтаксис
C#
Visual Basic
Копировать Код
public PolyFaceMeshVertex( Point3d point );
Копировать Код
Public Sub New( point As Point3d )
 Параметры
 Параметры
 Описание
 point
 Координаты вершины в мировой системе координат (WCS). Тип Point3d.
 Описание
 Конструктор класса PolyFaceMeshVertex. Создает экземпляр класса в заданной пространственной точке.
 Ссылки
 Teigha.DatabaseServices.PolyFaceMeshVertex, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!