Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObject.IsAProxy
 Послать отзыв
 Свойство предоставляет информацию, является ли данный объект прокси-объектом.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsAProxy;
Копировать Код
Public Property IsAProxy() As bool
 Возвращает
 Возвращает тип данных bool. Возвращает true, если объект — прокси объект.
 Описание
 Свойство предоставляет информацию, является ли данный объект прокси-объектом.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.DBObject, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!