Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SubentityOverrule.TransformSubentPathsBy
 Послать отзыв
 Этот метод переопределяет метод Entity.TransformSubentityPathsBy() и вызывает его в случае реализации по умолчанию.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void TransformSubentPathsBy( ref Entity entity, ref FullSubentityPath[] paths, Matrix3d xform );
Копировать Код
Public virtual Sub TransformSubentPathsBy( ByRef entity As Entity, ByRef paths As FullSubentityPath[], xform As Matrix3d )
 Параметры
 Параметры
 Описание
 entity
 Объект чертежа, тип Entity.
 paths
 Массив полных путей объектов, идентифицирующих подобъекты, которые подлежат преобразованию. Тип FullSubentityPath[].
 xform
 Матрица преобразования, применяемая к каждому подобъекту. Тип Matrix3d.
 Описание
 Этот метод переопределяет метод Entity.TransformSubentityPathsBy() и вызывает его в случае реализации по умолчанию.
 Метод Entity.TransformSubentityPathsBy() в реализации по умолчанию применяет указанное 3D-преобразование Matrix3d к заданному массиву подобъектов. Метод TransformSubentPathsBy() настоящего класса позволяет переопределить этот механизм.
 Ссылки
 Teigha.DatabaseServices.SubentityOverrule, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!