Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.CurrentSpaceId
 Послать отзыв
 Синтаксис
C#
Visual Basic
public DatabaseServices::ObjectId CurrentSpaceId;
Public Property CurrentSpaceId() As DatabaseServices.ObjectId
 Описание
 Возвращает Id BlockTableRecord текущего пространства (пространства модели или пространства страницы).
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!