Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CellRange.Style
 Послать отзыв
 Свойство позволяет управлять стилем ячеек диапазона.
 Синтаксис
C#
Visual Basic
Копировать Код
public String Style;
Копировать Код
Public Property Style As String
 Возвращает
 Возвращает имя стиля ячеек. Тип String.
 Описание
 Свойство позволяет управлять стилем ячеек диапазона.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.CellRange, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!