Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 ViewTableRecord.AnnotationScale
 Послать отзыв
 В свойстве хранится аннотативный масштаб именованного вида.
 Синтаксис
C#
Visual Basic
Копировать Код
public AnnotationScale AnnotationScale { get; set; }
Копировать Код
Public Property AnnotationScale As AnnotationScale
 Возвращает
 Возвращает тип данных AnnotationScale.
 Описание
 Свойство предназначено для просмотра/изменения аннотативного масштаба именованного вида.
 Условия
 Чтение и запись.
 Ссылки
 ViewTableRecord Класс, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!