Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Surface.ReverseNormal
 Послать отзыв
 Свойство ReverseNormal инвертирует ориентацию нормали данной поверхности.
 Синтаксис
C#
Visual Basic
Копировать Код
public Surface ReverseNormal;
Копировать Код
Public ReadOnly Property ReverseNormal As Surface
 Возвращает
 Возвращает поверхность с обратным направлением нормали. Тип Surface.
 Описание
 Свойство ReverseNormal инвертирует ориентацию нормали данной поверхности. Возвращаемая поверхность геометрически остается без изменений, но нормаль получает обратное направление.
 Замечания
 Направление нормали поверхности вычисляется либо по формуле  + partialU.crossProduct(partialV).normalize(), либо по формуле  - partialU.crossProduct(partialV).normalize(). При создании поверхности всегда используется положительное направление нормали.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.Surface, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!