Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CellContent.Formula
 Послать отзыв
 Свойство Formula представляет формулу в содержимом ячейки таблицы.
 Синтаксис
C#
Visual Basic
Копировать Код
public String Formula;
Копировать Код
Public Property Formula As String
 Возвращает
 Возвращает формулу в содержимом ячейки таблицы. Тип String.
 Описание
 Свойство Formula представляет формулу в содержимом ячейки таблицы.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.CellContent, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!