Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Position3d
 Послать отзыв
 Класс Position3d представляет точки как позиции в трехмерном пространстве.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Geometry::Entity3d Teigha::Geometry::PointEntity3d Teigha::Geometry::Position3d
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdGePosition3d")] public sealed class Position3d : PointEntity3d
Копировать Код
<Wrapper("OdGePosition3d")> Public NotInheritable Class Position3d Inherits PointEntity3d
 Описание
 Класс Position3d представляет точки как позиции в трехмерном пространстве.
 Методы
 Конструкторы
 Teigha.Geometry.Position3d
 Имя
 Описание
 Position3d
 Это обзор перегрузок Position3d.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Geometry.Entity3d
 Имя
 Описание
 Entity3d Методы
 Ниже перечислены методы класса Entity3d.
 Teigha.Geometry.PointEntity3d
 Имя
 Описание
 PointEntity3d Методы
 Ниже перечислены методы класса PointEntity3d.
 Teigha.Geometry.Position3d
 Имя
 Описание
 Position3d Методы
 Ниже перечислены методы класса Position3d.
 Ссылки
 Position3d Конструктор, Position3d Методы, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!