Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBDictionary.Count
 Послать отзыв
 Предоставляет доступ к количеству записей в словаре.
 Синтаксис
C#
Visual Basic
Копировать Код
public int Count;
Копировать Код
Public Property Count() As Integer
 Возвращает
 Возвращает целое число, равное количеству записей в словаре.
 Описание
 Предоставляет доступ к количеству записей в словаре.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.DBDictionary, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!