Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 LayerTable.IncludingHidden
 Послать отзыв
 В свойстве хранится коллекция слоёв, включающая в себя скрытые слои.
 Синтаксис
C#
Visual Basic
public LayerTable IncludingHidden;
Public Property IncludingHidden() As LayerTable
 Возвращает
 Возвращает тип данных LayerTable.
 Описание
 В свойстве хранится коллекция всех слоёв документа, включая скрытые, то есть те, у которых свойство IsHidden = true.
 Такие слои не отображаются в диалоговом окне «Слои», но информация о них хранятся в документе.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.LayerTable, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!