Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод ObjectIterator.MoveNext
 Послать отзыв
 This is MoveNext, a member of class ObjectIterator.
 Синтаксис
C#
Visual Basic
public bool MoveNext();
Public Function MoveNext() As bool
 Ссылки
 ObjectIterator Класс, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!