Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Surface.ProjectOnToSurface
 Послать отзыв
 Метод позволяет создать новые объекты проецированием указанного объекта на данную поверхность в заданном направлении.
 Синтаксис
C#
Visual Basic
Копировать Код
public Entity[] ProjectOnToSurface( ref Entity entityToProject, Vector3d projectionDirection );
Копировать Код
Public Function ProjectOnToSurface( ByRef entityToProject As Entity, projectionDirection As Vector3d ) As Entity()
 Параметры
 Параметры
 Описание
 entityToProject
 Проецируемый геометрический объект. Тип Entity.
 projectionDirection
 Направление проецирования. Тип Vector3d.
 Возвращает
 Возвращает массив геометрических объектов, образованных в результате проецирования. Тип Entity[].
 Описание
 Метод позволяет создать новые объекты проецированием указанного объекта на данную поверхность в заданном направлении.
 Если на поверхность проецируется точка Point, результатом проецирования будет объект Point, представляющий ближайшую точку на этой поверхности в направлении проецирования.
 Замечания
 Этот метод реализован только в среде пространственного моделирования.
 Ссылки
 Teigha.DatabaseServices.Surface, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!