Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Viewport.UcsFollowModeOn
 Послать отзыв
 Свойство UcsFollowModeOn позволяет определить, включен ли для данного видового экрана переход к отображению в плане при переключении с одной пользовательской системы координат (ПСК, UCS) на другую.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool UcsFollowModeOn;
Копировать Код
Public Property UcsFollowModeOn As Boolean
 Возвращает
 Возвращает true, если переход к отображению в плане при каждой смене ПСК включен. В противном случае возвращает false, и тогда смена ПСК не влияет на текущий вид.
 Описание
 Свойство UcsFollowModeOn позволяет определить, включен ли для данного видового экрана переход к отображению в плане при переключении с одной пользовательской системы координат (ПСК, UCS) на другую. Когда этот режим включен, при каждом изменении ПСК в видовом экране происходит переключение на обновленный вид в плане.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Viewport, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!