Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CellRange.GetEnumerator
 Послать отзыв
 Метод позволяет получить перечислитель для этого диапазона ячеек.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual System.Collections.Generic.IEnumerator<CellReference> GetEnumerator();
Копировать Код
Public Overridable Function GetEnumerator() As System.Collections.Generic.IEnumerator(Of CellReference)
 Возвращает
 Возвращает перечислитель для диапазона ячеек. Тип IEnumerator.
 Описание
 Метод позволяет получить перечислитель для этого диапазона ячеек.
 Ссылки
 Teigha.DatabaseServices.CellRange, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!