Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.Dimtofl
 Послать отзыв
 Свойство позволяет управлять отображением линии между выносными линиями или внутри измеряемого объекта, когда размерные линии размещены за пределами выносных линий или измеряемого объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool Dimtofl;
Копировать Код
Public Property Dimtofl As Boolean
 Возвращает
 Возвращает true, если стрелки соединены линией. Если линия подавлена, возвращает false.
 Описание
 Свойство позволяет управлять отображением линии между выносными линиями или внутри измеряемого объекта, когда размерные линии размещены за пределами выносных линий или измеряемого объекта. Свойство принимает следующие значения:
 Значение
 Описание
 true
 Стрелки принудительно соединены линией, даже если стрелки размещены снаружи.
 false
 Стрелки размещены снаружи, но соединяющая их линия отсутствует.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!