Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.PlanarEntity.ClosestPointToLinearEntity
 Послать отзыв
 Метод вычисляет точку на данной плоской поверхности, которая располагается ближе всего к указанной линии, и точку на этой линии, которая ближе всего располагается к данной плоской поверхности. Вычисление координат точек выполняется в пределах явно заданной точности.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d[] ClosestPointToLinearEntity( ref LinearEntity3d line, Tolerance tolerance );
Копировать Код
Public Function ClosestPointToLinearEntity( ByRef line As LinearEntity3d, tolerance As Tolerance ) As Point3d()
 Параметры
 Параметры
 Описание
 line
 Входная линия. Тип LinearEntity3d.
 tolerance
 Заданная геометрическая точность. Тип Tolerance.
 Возвращает
 Возвращает массив из двух точек. Тип Point3d[]. Первый элемент массива соответствует ближайшей точке на линии line, а второй — ближайшей точке на данной плоской поверхности.
 Описание
 Метод вычисляет точку на данной плоской поверхности, которая располагается ближе всего к указанной линии, и точку на этой линии, которая ближе всего располагается к данной плоской поверхности. Вычисление координат точек выполняется в пределах явно заданной точности.
 Ссылки
 Teigha.Geometry.PlanarEntity, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!