Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CellContentsCollection.InsertAt
 Послать отзыв
 Метод вставляет в коллекцию дополнительное содержимое для ячейки по указанному индексу.
 Синтаксис
C#
Visual Basic
Копировать Код
public void InsertAt( int index );
Копировать Код
Public Sub InsertAt( index As Integer )
 Параметры
 Параметры
 Описание
 index
 Индекс, под которым создается дополнительный контент для ячейки. Тип int.
 Описание
 Метод вставляет в коллекцию дополнительное содержимое для ячейки по указанному индексу.
 Ссылки
 Teigha.DatabaseServices.CellContentsCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!