Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.EllipticalArc3d
 Послать отзыв
 Класс EllipticalArc3d представляет трехмерные эллиптические дуги и полные эллипсы в 3D-пространстве.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Geometry::Entity3d Teigha::Geometry::Curve3d Teigha::Geometry::EllipticalArc3d
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdGeEllipArc3d")] public sealed class EllipticalArc3d : Curve3d
Копировать Код
<Wrapper("OdGeEllipArc3d")> Public NotInheritable Class EllipticalArc3d Inherits Curve3d
 Описание
 Класс EllipticalArc3d представляет трехмерные эллиптические дуги и полные эллипсы в 3D-пространстве.
 Замечания
 Угол точки на эллипсе измеряется путем проецирования этой точки перпендикулярно большой оси на окружность, центр которой совпадает с центром эллипса, а радиус равен большому радиусу этого эллипса. Угол между большой осью эллипса и вектором из центра эллипса в спроецированную точку на окружности, измеренный против часовой стрелки относительно векторного произведения большой и малой осей, является углом этой точки на эллипсе.
 У полного эллипса разница между начальным и конечным углами составляет 2 x Pi.
 Методы
 Конструкторы
 Teigha.Geometry.EllipticalArc3d
 Имя
 Описание
 EllipticalArc3d
 Это обзор перегрузок EllipticalArc3d.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Geometry.Entity3d
 Имя
 Описание
 Entity3d Методы
 Ниже перечислены методы класса Entity3d.
 Teigha.Geometry.Curve3d
 Имя
 Описание
 Curve3d Методы
 Ниже перечислены методы класса Curve3d.
 Curve3d Свойства
 Ниже перечислены свойства класса Curve3d.
 Teigha.Geometry.EllipticalArc3d
 Имя
 Описание
 EllipticalArc3d Методы
 Ниже перечислены методы класса EllipticalArc3d.
 EllipticalArc3d Свойства
 Ниже перечислены свойства класса EllipticalArc3d.
 Ссылки
 EllipticalArc3d Конструктор, EllipticalArc3d Методы, EllipticalArc3d Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!