Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.ToleranceSuppressZeroInches
 Послать отзыв
 Свойство позволяет управлять подавлением отображения нулевого значения целых дюймов в отклонениях размеров, выраженных в основных единицах измерения.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool ToleranceSuppressZeroInches;
Копировать Код
Public Property ToleranceSuppressZeroInches As Boolean
 Возвращает
 Возвращает true, если подавление включено. В противном случае возвращает false.
 Описание
 Свойство позволяет включить или отключить подавление отображения нулевого значения целых дюймов в отклонениях размеров, выраженных в основных единицах измерения.
 Этот функционал работает только в случае, если для свойства Dimtol установлено значение true.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!