Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 DimStyleTableRecord.Dimpost
 Послать отзыв
 Свойство отвечает за настройку префикса и суффикса текста измерений в размерах.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual string Dimpost { get; set; }
Копировать Код
Public Overridable Property Dimpost As String
 Возвращает
 Возвращает тип данных string.
 Описание
 В свойстве хранятся префикс и??ли суффикс текста измерений в размерах в виде строки (string) в формате префикс<>суффикс. Значение по умолчанию – пустая строка.
 Свойство также доступно через системную переменную DIMPOST и пользовательское меню в окне изменения/создания размерного стиля:
  При изменении системной переменной DIMPOST будет создан новый размерный стиль под названием <переопределение> на основе текущего с новым значением DIMPOST.
 Условия
 Чтение и запись.
 Пример
 Пример изменения префикса и суффикса текста измерений (значения свойства Dimpost) в размерном стиле Standard:
C#
 Копировать Код
public partial class Commands { [Teigha.Runtime.CommandMethod("DimpostChange")] public void DimpostStandardDimStyle() { // Получение ссылки на активный документ HostMgd.ApplicationServices.Document doc = HostMgd.ApplicationServices.Application.DocumentManager.MdiActiveDocument; // Получение ссылки на редактор документа HostMgd.EditorInput.Editor ed = doc.Editor; // Получение ссылки на базу данных документа Teigha.DatabaseServices.Database db = doc.Database; // Начало транзакции с базой данных документа using (Teigha.DatabaseServices.Transaction trans = db.TransactionManager.StartTransaction()) { // Открываем таблицу размерных стилей для чтения Teigha.DatabaseServices.DimStyleTable dimStyleTable = trans.GetObject(db.DimStyleTableId, Teigha.DatabaseServices.OpenMode.ForRead) as Teigha.DatabaseServices.DimStyleTable; // Находим в таблице размерных стилей ObjectId нужного стиля по его названию Teigha.DatabaseServices.ObjectId styleId = dimStyleTable["Standard"]; // Открываем таблицу размерного стиля для изменений Teigha.DatabaseServices.DimStyleTableRecord obj = trans.GetObject(styleId, Teigha.DatabaseServices.OpenMode.ForWrite) as Teigha.DatabaseServices.DimStyleTableRecord; ed.WriteMessage($"nDimpost before: {obj.Dimpost}"); // Изменяем префикс и суффикс размерного текста obj.Dimpost = "Dimpost<>example"; ed.WriteMessage($"nDimpost after: {obj.Dimpost}"); trans.Commit(); } } }
 Результат работы команды DimpostChange:
 Было:
 Стало:
 Ссылки
 Teigha.DatabaseServices.DimStyleTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!