Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Filters.LayerIndex.LayerIndex
 Послать отзыв
 Конструктор класса LayerIndex по умолчанию.
 Синтаксис
C#
Visual Basic
Копировать Код
public LayerIndex();
Копировать Код
Public Sub New()
 Описание
 Конструктор класса LayerIndex по умолчанию.
 Ссылки
 Teigha.DatabaseServices.Filters.LayerIndex, Teigha.DatabaseServices.Filters
 Ваши комментарии по поводу этого топика: Послать отзыв!