Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Matrix3d.Normal
 Послать отзыв
 Свойство возвращает абсолютное значение наибольшего элемента в линейной части данной матрицы
 Синтаксис
C#
Visual Basic
Копировать Код
public double Normal;
Копировать Код
Public Property Normal() As Double
 Возвращает
 Возвращает абсолютное значение наибольшего элемента. Тип double.
 Описание
 Свойство возвращает абсолютное значение наибольшего элемента в линейной части данной матрицы (верхняя матрица 3x3).
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.Matrix3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!