Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Light.LightColor
 Послать отзыв
 Свойство представляет цвет данного источника света.
 Синтаксис
C#
Visual Basic
Копировать Код
public Color LightColor;
Копировать Код
Public Property LightColor As Color
 Возвращает
 Возвращает цвет источника света. Тип Color.
 Описание
 Свойство представляет цвет данного источника света.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Light, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!