Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Ole2Frame.WcsHeight
 Послать отзыв
 Свойство представляет фактическую высоту этого OLE-объекта в мировой системе координат (WCS).
 Синтаксис
C#
Visual Basic
Копировать Код
public double WcsHeight;
Копировать Код
Public Property WcsHeight As Double
 Возвращает
 Возвращает высоту OLE-объекта. Тип double.
 Описание
 Свойство представляет фактическую высоту этого OLE-объекта в мировой системе координат (WCS).
 Высота может изменяться вследствие выполнения команд типа STRETCH (РАСТЯЖЕНИЕ), изменения высоты объекта в палитре свойств или в диалоговом окне «Размер текста», а также при изменении размера объекта в результате операций с ручками.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Ole2Frame, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!