Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.HostApplicationServices.Product
 Послать отзыв
 Свойство возвращает наименование продукта.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual String Product;
Копировать Код
Public Overridable ReadOnly Property Product As String
 Возвращает
 Возвращает наименование продукта. Тип String.
 Описание
 Свойство возвращает наименование продукта.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.HostApplicationServices, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!