Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Material.TwoSided
 Послать отзыв
 Свойство позволяет указать или проверить, что материал является двусторонним.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool TwoSided;
Копировать Код
Public Property TwoSided As Boolean
 Возвращает
 Возвращает true, если материал является двусторонним. В противном случае возвращает false.
 Описание
 Свойство позволяет указать или проверить, что материал является двусторонним.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Material, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!