Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Spline.Spline
 Послать отзыв
 Конструктор класса Spline. Создает экземпляр класса, который аппроксимирует кривой указанного порядка переданный массив определяющих точек в пределах заданного допуска. Направления касательных на концах сплайна определяются автоматически.
 Синтаксис
C#
Visual Basic
Копировать Код
public Spline( ref Point3dCollection point, int order, double fitTolerance );
Копировать Код
Public Sub New( ByRef point As Point3dCollection, order As Integer, fitTolerance As Double )
 Параметры
 Параметры
 Описание
 point
 Массив определяющих точек. Тип Point3dCollection.
 order
 Порядок сплайна. Тип int.
 fitTolerance
 Точность аппроксимации определяющих точек. Тип double.
 Описание
 Конструктор класса Spline. Создает сплайн, который аппроксимирует переданный массив определяющих точек point кривой порядка order в пределах заданного допуска fitTolerance.
 Нулевой допуск обеспечивает точную интерполяцию, т.е. сплайн пройдет через все определяющие точки.
 Порядок кривой order должен находиться в диапазоне от 2 до 26.
 Направления касательных на концах сплайна определяются из условия наилучшей аппроксимации массива определяющих точек.
 Замечания
 Если какой-либо из входных параметров оказывается неприемлемым, данный конструктор ведет себя как конструктор по умолчанию. Переданные в конструктор аргументы не используются, а методы запроса данных сплайна возвращают недопустимые значения.
 Чтобы определить, удалось ли инициализировать сплайн входными параметрами, рекомендуется использовать свойство Spline.IsNull, которое в случае успешной инициализации возвращает false.
 Ссылки
 Teigha.DatabaseServices.Spline, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!