Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CellRange.BottomRightPlusOne
 Послать отзыв
 Свойство возвращает ячейку, следующую за правой нижней ячейкой диапазона.
 Синтаксис
C#
Visual Basic
Копировать Код
public Cell BottomRightPlusOne;
Копировать Код
Public ReadOnly Property BottomRightPlusOne As Cell
 Возвращает
 Возвращает ячейку таблицы. Тип Cell.
 Описание
 Свойство возвращает ячейку, следующую за правой нижней ячейкой диапазона.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.CellRange, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!