Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Matrix2dInfo.!=
 Послать отзыв
 Оператор неравенства структуры Matrix2dInfo.
 Синтаксис
C#
Visual Basic
Копировать Код
public static bool operator !=( Matrix2dInfo a, Matrix2dInfo b );
Копировать Код
Public Shared Operator <>( a As Matrix2dInfo, b As Matrix2dInfo ) As Boolean
 Параметры
 Параметры
 Описание
 a
 Левый операнд. Тип Matrix2dInfo.
 b
 Правый операнд. Тип Matrix2dInfo.
 Возвращает
 Возвращает true, если операнды не равны друг другу. В противном случае возвращает false.
 Описание
 Оператор неравенства структуры Matrix2dInfo.
 Ссылки
 Teigha.Geometry.Matrix2dInfo, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!