Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.BeginWblockEntireDatabaseEventArgs
 Послать отзыв
 Класс представляет данные для события BeginWblockEntireDatabase базы данных.
 Иерархия классов
Teigha::DatabaseServices::BeginWblockEntireDatabaseEventArgs
 Синтаксис
C#
Visual Basic
Копировать Код
public class BeginWblockEntireDatabaseEventArgs : System.EventArgs;
Копировать Код
Public Class BeginWblockEntireDatabaseEventArgs Inherits System.EventArgs
 Описание
 Класс представляет данные для события BeginWblockEntireDatabase базы данных.
 Методы
 Конструкторы
 ПоказатьInternal
 Нет совпадений по текущему фильтру
 Имя
 Описание
 BeginWblockEntireDatabaseEventArgs
 This is BeginWblockEntireDatabaseEventArgs, a member of class BeginWblockEntireDatabaseEventArgs.
 Топики
 Имя
 Описание
 BeginWblockEntireDatabaseEventArgs Свойства
 Ниже перечислены свойства класса BeginWblockEntireDatabaseEventArgs.
 Ссылки
 BeginWblockEntireDatabaseEventArgs Свойства, Методы, Топики, BeginWblockEntireDatabaseEventArgs Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!