Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ExtrudedSurface.SweepOptions
 Послать отзыв
 Свойство предоставляет доступ к опциям выдавливания SweepOptions.
 Синтаксис
C#
Visual Basic
Копировать Код
public SweepOptions SweepOptions;
Копировать Код
Public Property SweepOptions As SweepOptions
 Возвращает
 Возвращает опции операции выдавливания. Тип SweepOptions.
 Описание
 Свойство предоставляет доступ к опциям выдавливания SweepOptions.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.ExtrudedSurface, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!