Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.EllipticalCylinder.GetAngles
 Послать отзыв
 Метод предоставляет текущие значения начального и конечного углов данного эллиптического цилиндра.
 Синтаксис
C#
Visual Basic
Копировать Код
public double[] GetAngles();
Копировать Код
Public Function GetAngles() As Double()
 Возвращает
 Возвращает двухэлементный массив углов. Первый элемент соответствует начальному углу, а второй элемент - конечному углу эллиптического цилиндра. Тип double[].
 Описание
 Метод предоставляет текущие значения начального и конечного углов данного эллиптического цилиндра с виде массива из двух элементов. Первый элемент соответствует начальному углу эллиптического цилиндра (смещение угла, от которого строятся сегменты эллиптического цилиндра), а второй элемент соответствует конечному углу эллиптического цилиндра (смещение угла, до которого строятся сегменты эллиптического цилиндра).
 Ссылки
 Teigha.Geometry.EllipticalCylinder, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!