Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Material.Anonymous
 Послать отзыв
 Свойство позволяет проверить, является ли этот материал «анонимным». Только для внутреннего использования.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool Anonymous;
Копировать Код
Public Property Anonymous As Boolean
 Возвращает
 Возвращает true, если материал является «анонимным». В противном случае возвращает false.
 Описание
 Свойство позволяет проверить, является ли этот материал «анонимным». Такой материал предназначен исключительно для программного использования через API и не должен быть доступен через какой-либо пользовательский интерфейс.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Material, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!