Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ProxyEntity.GetReferences
 Послать отзыв
 Метод предоставляет коллекцию идентификаторов объектов, на которые ссылается этот прокси-объект.
 Синтаксис
C#
Visual Basic
Копировать Код
public DBObjectReferenceCollection GetReferences();
Копировать Код
Public Function GetReferences() As DBObjectReferenceCollection
 Возвращает
 Возвращает коллекцию идентификаторов объектов. Тип DBObjectReferenceCollection.
 Описание
 Метод предоставляет коллекцию идентификаторов объектов, на которые ссылается этот прокси-объект.
 Ссылки
 Teigha.DatabaseServices.ProxyEntity, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!