Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.PointOnSurface.GetNormal
 Послать отзыв
 Метод вычисляет нормаль к поверхности в указанной точке. В текущей версии не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d GetNormal( Point2d point );
Копировать Код
Public Function GetNormal( point As Point2d ) As Vector3d
 Параметры
 Параметры
 Описание
 point
 Точка поверхности, заданная параметрически. Тип Point2d. Координата point.x определяет значение параметра точки по оси u, а координата point.y - значение параметра по оси v.
 Возвращает
 Возвращает вектор нормали в указанной точке поверхности. Тип Vector3d.
 Описание
 Метод вычисляет нормаль к поверхности в указанной точке. В текущей версии не реализован.
 Ссылки
 Teigha.Geometry.PointOnSurface, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!