Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeaderStyle.TextColor
 Послать отзыв
 Свойство представляет цвет многострочного текста, предусмотренный данным стилем.
 Синтаксис
C#
Visual Basic
Копировать Код
public Teigha.Colors.Color TextColor;
Копировать Код
Public Property TextColor As Teigha.Colors.Color
 Возвращает
 Возвращает цвет многострочного текста. Тип Teigha.Colors.Color.
 Описание
 Свойство представляет цвет многострочного текста, предусмотренный данным стилем.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MLeaderStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!