Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MlineStyle.MlineStyle
 Послать отзыв
 Конструктор по умолчанию класса MlineStyle.
 Синтаксис
C#
Visual Basic
Копировать Код
public MlineStyle();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса MlineStyle.
 Ссылки
 Teigha.DatabaseServices.MlineStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!