Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Событие Database.InsertAborted
 Послать отзыв
 Синтаксис
C#
Visual Basic
public event EventHandler InsertAborted;
Public Event InsertAborted As EventHandler
 Описание
 Событие показывает, что операция вставки в базе данных чертежа была снята и не завершилась.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!