Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotSettingsValidator.SetPlotType
 Послать отзыв
 Метод задает тип печати чертежа, определенный для данного объекта PlotSettings.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetPlotType( ref PlotSettings plotSet, PlotType plotAreaType );
Копировать Код
Public Sub SetPlotType( ByRef plotSet As PlotSettings, plotAreaType As PlotType )
 Параметры
 Параметры
 Описание
 plotSet
 Входной объект PlotSettings с настройками печати.
 plotAreaType
 Тип печати чертежа. Значение из перечисления PlotType.
 Описание
 Метод задает тип печати чертежа, определенный для данного объекта PlotSettings.
 Замечания
 Параметр PaperImageOrigin в настройках PlotSettings остается неизменным, если методу передается значение PlotType.Layout; в других случаях его можно изменять.
 Ссылки
 Teigha.DatabaseServices.PlotSettingsValidator, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!