Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeader.AddLastVertex
 Послать отзыв
 Метод позволяет добавить новую последнюю вершину в указанную линию выноски.
 Синтаксис
C#
Visual Basic
Копировать Код
public void AddLastVertex( int leaderLineIndex, Point3d point );
Копировать Код
Public Sub AddLastVertex( leaderLineIndex As Integer, point As Point3d )
 Параметры
 Параметры
 Описание
 leaderLineIndex
 Индекс линии выноски, в которую будет добавлена вершина. Тип int.
 point
 Точка, определяющая положение новой вершины. Тип Point3d.
 Описание
 Метод позволяет добавить новую последнюю вершину в линию выноски с указанным индексом.
 Ссылки
 Teigha.DatabaseServices.MLeader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!