Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.UnderlayReference.NameOfSheet
 Послать отзыв
 Свойство NameOfSheet представляет имя листа.
 Синтаксис
C#
Visual Basic
Копировать Код
public String NameOfSheet;
Копировать Код
Public Property NameOfSheet As String
 Возвращает
 Возвращает имя листа. Тип String.
 Описание
 Свойство NameOfSheet представляет имя листа.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.UnderlayReference, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!