Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.TypedValue.Value
 Послать отзыв
 Свойство предназначено для хранения типизированного значения, котрое представляет данный объект TypedValue.
 Синтаксис
C#
Visual Basic
Копировать Код
public Object Value;
Копировать Код
Public Property Value() As Object
 Возвращает
 Возвращает типизированное значение как объект Object.
 Описание
 Свойство предназначено для хранения типизированного значения, котрое представляет данный объект TypedValue.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.TypedValue, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!