Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObject.IsModified
 Послать отзыв
 Свойство предоставляет информацию, был ли объект изменен.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsModified;
Копировать Код
Public Property IsModified() As bool
 Возвращает
 Возвращает тип данных bool. Возвращает true, если объект был изменен.
 Описание
 Свойство предоставляет информацию, был ли объект изменен.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.DBObject, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!