Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GeoLocationData.PostToDb
 Послать отзыв
 Метод позволяет отправить этот объект в словарь расширений размера или объекта MLeader.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectId PostToDb();
Копировать Код
Public Function PostToDb() As ObjectId
 Возвращает
 Возвращает идентификатор полученного объекта. Тип ObjectId.
 Описание
 Метод позволяет отправить этот объект в словарь расширений размера или объекта MLeader.
 Ссылки
 Teigha.DatabaseServices.GeoLocationData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!