Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Scale3d
 Послать отзыв
 Структура Scale3d представляет преобразование масштаба в трехмерном пространстве.
 Иерархия классов
Teigha::Geometry::Scale3d
 Синтаксис
C#
Visual Basic
Копировать Код
[DefaultMember("Coordinate")] [Wrapper("OdGeScale3d")] public struct Scale3d
Копировать Код
<DefaultMember("Coordinate")> <Wrapper("OdGeScale3d")> Public Structure Scale3d
 Описание
 Структура Scale3d представляет преобразование масштаба в трехмерном пространстве (векторы 3D-масштабирования).
 Scale3d можно рассматривать как трехэлементный массив вещественных чисел двойной точности. Каждый из его элементов представляет масштабный коэффициент вдоль своей оси координат:
0 — масштабный коэффициент для оси X.
1 — масштабный коэффициент для оси Y.
2 — масштабный коэффициент для оси Z.
 Замечания
 Вектор масштабирования не должен иметь нулевых компонентов.
 Методы
 Конструкторы
 Имя
 Описание
 Scale3d
 Это обзор перегрузок Scale3d.
 Топики
 Имя
 Описание
 Scale3d Методы
 Ниже перечислены методы класса Scale3d.
 Scale3d Операторы
 Ниже перечислены операторы класса Scale3d.
 Scale3d Свойства
 Ниже перечислены свойства класса Scale3d.
 Ссылки
 Scale3d Конструктор, Scale3d Методы, Scale3d Операторы, Scale3d Свойства, Методы, Топики, Scale3d Методы, Scale3d Операторы, Scale3d Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!