Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObject.IsNewObject
 Послать отзыв
 Свойство предоставляет информацию, был ли закрыт объект с момента его создания.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsNewObject;
Копировать Код
Public Property IsNewObject() As bool
 Возвращает
 Возвращает тип данных bool. Возвращает true, если объект еще не был закрыт с того момента, как он впервые был создан.
 Описание
 Свойство предоставляет информацию, был ли закрыт объект с момента его создания.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.DBObject, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!