Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Ole2Frame.ScaleWidth
 Послать отзыв
 Свойство представляет масштабный коэффициент OLE-объекта по ширине, выраженный в процентах.
 Синтаксис
C#
Visual Basic
Копировать Код
public double ScaleWidth;
Копировать Код
Public Property ScaleWidth As Double
 Возвращает
 Возвращает масштаб OLE-объекта по ширине. Тип double.
 Описание
 Свойство представляет выраженное в процентах отношение текущей и исходной ширины OLE-объекта, т.е. его масштаб по ширине.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Ole2Frame, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!