Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Database.OverlayXref
 Послать отзыв
 Синтаксис
C#
Visual Basic
public ObjectId OverlayXref(ref String fileName, ref String blockName);
Public Function OverlayXref(ByRef fileName As String, ByRef blockName As String) As ObjectId
 Параметры
 Параметры
 Описание
 fileName
 Имя файла внешней ссылки
 blockName
 Имя таблицы блоков для наложенного файла внешней ссылки
 Описание
 Производит наложение файла внешней ссылки, определенного параметром fileName в базу данных, затем создает новую запись таблицы блоков. Имя этой записи указано в параметре blockName. Метод возвращает Id этой записи.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!