Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AbstractViewPE.RenderMode
 Послать отзыв
 Свойство RenderMode представляет назначенный режим рендеринга.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.RenderMode RenderMode;
Копировать Код
Public Property RenderMode As DatabaseServices.RenderMode
 Возвращает
 Возвращает режим рендеринга. Значение из перечисления DatabaseServices.RenderMode.
 Описание
 Свойство RenderMode представляет назначенный режим рендеринга (каркасное представление, скрытые линии, режим тонирования и т.п.).
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.AbstractViewPE, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!