Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CurveCurveIntersector2d.NumberOfIntersectionPoints
 Послать отзыв
 Свойство NumberOfIntersectionPoints представляет количество найденных точек пересечения двух кривых.
 Синтаксис
C#
Visual Basic
Копировать Код
public int NumberOfIntersectionPoints;
Копировать Код
Public ReadOnly Property NumberOfIntersectionPoints As Integer
 Возвращает
 Возвращает количество точек пересечения двух кривых. Тип int.
 Описание
 Свойство NumberOfIntersectionPoints представляет количество найденных точек пересечения двух кривых.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.CurveCurveIntersector2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!