Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Shape.ShapeIndex
 Послать отзыв
 Свойство ShapeIndex представляет идентификатор объекта записи в таблице символов шрифта, содержащей шрифт SHX данного объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.ObjectId ShapeIndex;
Копировать Код
Public Property ShapeIndex As DatabaseServices.ObjectId
 Возвращает
 Возвращает идентификатор объекта записи в таблице символов шрифта. Тип DatabaseServices.ObjectId.
 Описание
 Свойство ShapeIndex представляет идентификатор объекта записи в таблице символов шрифта, содержащей шрифт SHX данного объекта. Фактически, объект Shape представляет собой отдельный символ специального шрифта SHX.
 Эквивалентно свойству StyleId.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Shape, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!