Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MentalRayRenderSettings.GISampleRadius
 Послать отзыв
 Свойство GISampleRadius представляет радиус области выборки для испускания фотонов в режиме глобального освещения.
 Синтаксис
C#
Visual Basic
Копировать Код
public double GISampleRadius;
Копировать Код
Public Property GISampleRadius As Double
 Возвращает
 Возвращает радиус области выборки. Тип double.
 Описание
 Свойство GISampleRadius представляет радиус области выборки для испускания фотонов в режиме глобального освещения.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MentalRayRenderSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!