Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.SetFormat
 Послать отзыв
 Метод позволяет задать формат в заданной ячейке.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetFormat( int row, int col, ref String pFormat );
Копировать Код
Public virtual Sub SetFormat( row As Integer, col As Integer, ByRef pFormat As String )
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 col
 Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
 pFormat
 Имя формата. Тип String.
 Описание
 Метод позволяет задать формат в заданной ячейке.
 Замечания
 Метод не реализован. Используйте метод Table.Cells[row,column].DataFormat.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!