Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.RotatedDimension.RotatedDimension
 Послать отзыв
 Данный конструктор создает новый объект RotatedDimension с указанными в аргументах параметрами.
 Синтаксис
C#
Visual Basic
Копировать Код
public RotatedDimension( double rotation, Point3d line1Point, Point3d line2Point, Point3d dimensionLinePoint, ref String dimensionText, DatabaseServices.ObjectId dimensionStyle );
Копировать Код
Public Sub New( rotation As double, line1Point As Point3d, line2Point As Point3d, dimensionLinePoint As Point3d, ByRef dimensionText As String, dimensionStyle As DatabaseServices.ObjectId )
 Параметры
 Параметры
 Описание
 rotation
 Угол поворота размера в радианах, тип double.
 line1Point
 Первая выносная точка - точка, от которой строится размер и где начинается первая выносная линия. Тип Point3d.
 line2Point
 Вторая выносная точка - точка, до которой строится размер и где начинается вторая выносная линия. Тип Point3d.
 dimensionLinePoint
 Точка на размерной линии, тип Point3d.
 dimensionText
 Размерный текст, которым заменяется текст с измеренным значением. Тип String.
 dimensionStyle
 ID размерного стиля, который используется для отображения размера. Тип DatabaseServices.ObjectId.
 Описание
 Данный конструктор создает новый объект RotatedDimension с указанными в аргументах параметрами.
 Ссылки
 Teigha.DatabaseServices.RotatedDimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!