Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Group.Clear
 Послать отзыв
 Метод позволяет очистить эту группу от элементов, делая ее пустой.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Clear();
Копировать Код
Public Sub Clear()
 Описание
 Этот метод очищает содержимое группы, делая ее пустой. При этом все остальные настройки группы остаются неизменными (имя, описание, colorIndex и т.д.).
 Ссылки
 Teigha.DatabaseServices.Group, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!