Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AttributeDefinition.Invisible
 Послать отзыв
 Свойство предоставляет доступ на изменение к флагу невидимости объекта AttributeDefinition.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool Invisible;
Копировать Код
Public Property Invisible() As Boolean
 Возвращает
 Если флаг принимает значение true, объект AttributeDefinition становится невидимым.
 Описание
 Свойство предоставляет доступ на изменение к флагу невидимости объекта AttributeDefinition. Если флаг принимает значение true, объект AttributeDefinition становится невидимым.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.AttributeDefinition, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!