Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.EllipticalArc2d.SetAxes
 Послать отзыв
 Метод позволяет переопределить направления большой и малой осей у данной эллиптической дуги.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetAxes( Vector2d majorAxis, Vector2d minorAxis );
Копировать Код
Public Sub SetAxes( majorAxis As Vector2d, minorAxis As Vector2d )
 Параметры
 Параметры
 Описание
 majorAxis
 Новое направление большой оси эллиптической дуги. Тип Vector2d.
 minorAxis
 Новое направление малой оси эллиптической дуги. Тип Vector2d.
 Описание
 Метод позволяет переопределить направления большой и малой осей у данной эллиптической дуги.
 Ссылки
 Teigha.Geometry.EllipticalArc2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!