Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.UnderlayReference.UnderlayLayerCollection
 Послать отзыв
 Свойство UnderlayLayerCollection представляет коллекцию слоев подложки в базе данных.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.UnderlayLayerCollection UnderlayLayerCollection;
Копировать Код
Public ReadOnly Property UnderlayLayerCollection As DatabaseServices.UnderlayLayerCollection
 Возвращает
 Возвращает коллекцию слоев подложки. Тип DatabaseServices.UnderlayLayerCollection.
 Описание
 Свойство UnderlayLayerCollection представляет коллекцию слоев подложки в базе данных.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.UnderlayReference, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!