Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.PointOnSurface.GetVDerivative
 Послать отзыв
 Метод вычисляет в текущей точке частную производную указанного порядка для поверхности в направлении V. В текущей версии этот метод не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d GetVDerivative( int order );
Копировать Код
Public Function GetVDerivative( order As Integer ) As Vector3d
 Параметры
 Параметры
 Описание
 order
 Порядок вычисляемой производной (1 или 2). Тип int.
 Возвращает
 Возвращает вектор частной производной порядка order в направлении V. Тип Vector3d.
 Описание
 Метод вычисляет в текущей точке частную производную указанного порядка для поверхности в направлении V. В текущей версии этот метод не реализован.
 Ссылки
 Teigha.Geometry.PointOnSurface, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!