Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.EllipticalCylinder.MinorAxis
 Послать отзыв
 Свойство MinorAxis представляет направление малой оси эллиптического цилиндра.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d MinorAxis;
Копировать Код
Public ReadOnly Property MinorAxis As Vector3d
 Возвращает
 Возвращает направляющий вектор малой оси эллиптического цилиндра. Тип Vector3d.
 Описание
 Свойство MinorAxis представляет направление малой оси эллиптического цилиндра.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.EllipticalCylinder, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!