Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GraphNode.MarkTree
 Послать отзыв
 Метод позволяет установить указанные флаги в данном узле GraphNode и во всех его вложенных исходящих узлах GraphNode.
 Синтаксис
C#
Visual Basic
Копировать Код
public void MarkTree( unsigned char flags, ref GraphNodeCollection appendedTo );
Копировать Код
Public Sub MarkTree( flags As unsigned char, ByRef appendedTo As GraphNodeCollection )
 Параметры
 Параметры
 Описание
 flags
 Входные значения битовых флагов, которые должны быть установлены. Тип unsigned char.
 appendedTo
 Входная коллекция, в которую опционально должны быть добавлены данный узел и все его вложенные исходящие узлы. Тип GraphNodeCollection.
 Описание
 Метод позволяет установить указанные флаги в данном узле GraphNode и во всех его вложенных исходящих узлах GraphNode.
 Если задан ненулевой аргумент appendedTo, в эту коллекцию добавляется сам данный узел и все его вложенные исходящие узлы. Если при прохождении ветви узлов метод обнаруживает, что в некотором узле указанные флаги уже установлены, обход данной ветви узлов на этом прекращается. Ответственность за сброс флагов лежит на пользователе. Для этого после завершения работы с флагами он должен вызвать метод Graph.ClearAll() или метод GraphNode.Clear().
 Аргумент flags должен представлять собой комбинацию следующих битовых флагов:
 Имя бита
 Значение
 Описание
 kNone
 0x00
 Значение не задано.
 kVisited
 0x01
 Используется внутренним механизмом метода FindCycles() и в процессе обхода циклического графа.
 kOutsideRefed
 0x02
 Используется в процессе отключения внешних ссылок Xref.
 kSelected
 0x04
 Выделение пользователем. Устанавливается в методе GetOutgoing().
 kInList
 0x08
 Присутствует в списке. Устанавливается в методе GetOutgoing().
 kListAll
 0x0E
 Используется для очистки флагов kSelected, kInList, kOutsideRefed.
 kFirstLevel
 0x10
 Узел первого уровня, связан с корневым узлом графа. Только для чтения.
 kUnresTree
 0x20
 Дерево не разрешимо.
 kAll
 0x2F
 Используется для очистки всех флагов, кроме kFirstLevel.
 Ссылки
 Teigha.DatabaseServices.GraphNode, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!