Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ObjectContextCollection.RemoveContext
 Послать отзыв
 Метод предназначен для удаления контекста из коллекции.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void RemoveContext( ref String contextName );
Копировать Код
Public Overridable Sub RemoveContext( ByRef contextName As String )
 Параметры
 Параметры
 Описание
 contextName
 Имя удаляемого контекста. Тип String.
 Описание
 Метод предназначен для удаления контекста из коллекции.
 Активный контекст удалить нельзя. Чтобы удалить из коллекции текущий контекст, следует сначала сделать текущим другой контекст, а только потом можно удалить требуемый контекст.
 Ссылки
 Teigha.DatabaseServices.ObjectContextCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!