Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.BoundedPlane.IntersectWith
 Послать отзыв
 Метод позволяет создать линию пересечения данного объекта с указанной плоскостью.
 Синтаксис
C#
Visual Basic
Копировать Код
public LineSegment3d IntersectWith( ref Plane plane );
Копировать Код
Public Function IntersectWith( ByRef plane As Plane ) As LineSegment3d
 Параметры
 Параметры
 Описание
 plane
 Плоскость, с которой строится линия пересечения. Тип Plane.
 Возвращает
 Возвращает линейный сегмент, являющийся результатом пересечения данного объекта с входным объектом plane. Тип LineSegment3d.
 Описание
 Метод позволяет создать линию пересечения данного объекта с указанной плоскостью.
 Ссылки
 Teigha.Geometry.BoundedPlane, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!