Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Событие Database.DatabaseConstructed
 Послать отзыв
 Синтаксис
C#
Visual Basic
public event EventHandler DatabaseConstructed;
Public Event DatabaseConstructed As EventHandler
 Описание
 Событие показывает, что конструктор базы данных завершил свою работу.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!