Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve3d.GetSamplePoints
 Послать отзыв
 Метод формирует массив из указанного количества точек на кривой, равноотстоящих друг от друга в параметрическом представлении.
 Синтаксис
C#
Visual Basic
Копировать Код
public PointOnCurve3d[] GetSamplePoints( int numSample );
Копировать Код
Public Function GetSamplePoints( numSample As Integer ) As PointOnCurve3d()
 Параметры
 Параметры
 Описание
 numSample
 Заказанное количество точек, равноотстоящих друг от друга параметрически. Тип int.
 Возвращает
 Возвращает массив точек на кривой. Тип PointOnCurve3d[].
 Описание
 Метод формирует массив из указанного количества точек на кривой, равноотстоящих друг от друга в параметрическом представлении.
 Например, если параметрическим интервалом кривой является [0,1], и заказанное количество точек numSample равно 5, то значения параметра полученных точек будут равны 0.0, 0.25, 0.5, 0.75, 1.0.
 Ссылки
 Teigha.Geometry.Curve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!