Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.EllipticalCone.MinorRadius
 Послать отзыв
 Свойство MinorRadius представляет текущее значение малого радиуса данного эллиптического конуса.
 Синтаксис
C#
Visual Basic
Копировать Код
public double MinorRadius;
Копировать Код
Public Property MinorRadius As Double
 Возвращает
 Возвращает значение малого радиуса эллиптического конуса. Тип double.
 Описание
 Свойство MinorRadius представляет текущее значение малого радиуса данного эллиптического конуса.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.Geometry.EllipticalCone, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!