Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FormattedTableData.GetOverride
 Послать отзыв
 Метод позволяет получить переопределения для сетки в заданной строке, столбце или ячейке.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual GridProperties GetOverride( int row, int column, GridLineType gridLinetype );
Копировать Код
Public Overridable Function GetOverride( row As Integer, column As Integer, gridLinetype As GridLineType ) As GridProperties
 Параметры
 Параметры
 Описание
 row
 Индекс строки. Тип int. Может принимать значение -1.
 column
 Индекс столбца. Тип int. Может принимать значение -1.
 gridLinetype
 Тип линий сетки из перечисления GridLineType. Комбинацию типов линий сетки можно задать с помощью логического оператора OR.
 Возвращает
 Возвращает выявленные переопределения у линий сетки как комбинацию битовых полей из перечисления GridProperties.
 Описание
 Метод позволяет получить переопределения для сетки в заданной строке, столбце или ячейке.
 Чтобы указать ячейку, следует передать действительные индексы строки и столбца. Чтобы указать строку, следует передать действительный индекс строки и -1 в качестве индекса столбца. Чтобы указать столбец, следует передать действительный индекс столбца и -1 в качестве индекса строки.
 Ссылки
 Teigha.DatabaseServices.FormattedTableData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!