Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DynamicBlockReferencePropertyCollectionEnumerator.MoveNext
 Послать отзыв
 Этот метод перемещает указатель на следующий элемент или на маркер конца данной коллекции, если текущий элемент находится в конце коллекции.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool MoveNext();
Копировать Код
Public Function MoveNext() As Boolean
 Возвращает
 Возвращает true, если указатель перемещен на следующий элемент коллекции. Если указатель оказался на маркере конца коллекции, возвращает false.
 Описание
 Метод MoveNext() перемещает указатель на следующий элемент или на маркер конца данной коллекции, если текущий элемент находится в конце коллекции.
 Ссылки
 Teigha.DatabaseServices.DynamicBlockReferencePropertyCollectionEnumerator, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!