Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObject.RemoveField(String)
 Послать отзыв
 Метод удаляет указанное поле по его имени и возвращает его идентификатор.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectId RemoveField(String propertyName);
Копировать Код
Public Function RemoveField(propertyName As String) As ObjectId
 Параметры
 Параметры
 Описание
 propertyName
 Имя свойства, соответствующее которому поле будет удалено. Тип String
 Возвращает
 Возвращает идентификатор поля. Тип ObjectId
 Описание
 Удаляет определенное поле. Возвращает Id удаляемого поля.
 Ссылки
 Teigha.DatabaseServices.DBObject, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!