Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.HostApplicationServices.GRIPOBJLIMIT
 Послать отзыв
 Свойство представляет количество выделенных объектов, свыше которого ручки у набора выделенных объектов подавляются. Диапазон допустимых значений [0..32767].
 Синтаксис
C#
Visual Basic
Копировать Код
public int GRIPOBJLIMIT;
Копировать Код
Public Property GRIPOBJLIMIT As Integer
 Возвращает
 Возвращает верхний предел количества выделенных объектов. Тип int.
 Описание
 Свойство представляет количество выделенных объектов, свыше которого ручки у набора выделенных объектов подавляются. Диапазон допустимых значений [0..32767].
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.HostApplicationServices, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!