Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Cannoscale
 Послать отзыв
 Синтаксис
C#
Visual Basic
public AnnotationScale Cannoscale;
Public Property Cannoscale() As AnnotationScale
 Описание
 Возвращает или устанавливает текущее значение объекта AnnotationScale, являющегося значением CANNOSCALE для базы данных, когда пространство модели является текущим.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!