Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CubicSplineCurve2d.CubicSplineCurve2d
 Послать отзыв
 Конструктор класса CubicSplineCurve2d. Создает кубический сплайн, интерполирующий переданную кривую с заданной точностью интерполяции.
 Синтаксис
C#
Visual Basic
Копировать Код
public CubicSplineCurve2d( ref Curve2d curve, double epsilon );
Копировать Код
Public Sub New( ByRef curve As Curve2d, epsilon As Double )
 Параметры
 Параметры
 Описание
 curve
 Кривая, для которой следует создать интерполирующий ее двумерный кубический сплайн. Тип Curve2d.
 epsilon
 Заданная точность интерполяции. Тип double.
 Описание
 Конструктор класса CubicSplineCurve2d. Создает кубический сплайн, интерполирующий переданную кривую с заданной точностью интерполяции.
 Ссылки
 Teigha.Geometry.CubicSplineCurve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!