Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.UnderlayDefinition.ItemName
 Послать отзыв
 Свойство ItemName представляет имя элемента, на который ссылается эта подложка.
 Синтаксис
C#
Visual Basic
Копировать Код
public String ItemName;
Копировать Код
Public Property ItemName As String
 Возвращает
 Возвращает имя элемента. Тип String.
 Описание
 Свойство ItemName представляет имя элемента, на который ссылается эта подложка.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.UnderlayDefinition, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!