Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve3dCollection.Remove
 Послать отзыв
 Метод предназначен для удаления из коллекции указанного элемента, если он там существует.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Remove( ref Curve3d value );
Копировать Код
Public Sub Remove( ByRef value As Curve3d )
 Параметры
 Параметры
 Описание
 value
 Удаляемый элемент. Тип Curve3d.
 Описание
 Метод предназначен для удаления из коллекции указанного элемента, если он там существует.
 Ссылки
 Teigha.Geometry.Curve3dCollection, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!