Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Matrix2d.Matrix2d
 Послать отзыв
 Конструктор структуры Matrix2d. Создает матрицу, элементы которой сформированы на основе данных из переданного массива.
 Синтаксис
C#
Visual Basic
Копировать Код
public Matrix2d( ref double[] data );
Копировать Код
Public Sub New( ByRef data As Double() )
 Параметры
 Параметры
 Описание
 data
 Входной массив. Тип double[].
 Описание
 Конструктор структуры Matrix2d. Создает матрицу, элементы которой сформированы на основе данных из переданного массива.
 Замечания
 Матрица заполняется значениями из первых девяти элементов массива data (матрица в однородных координатах). Элементы матрицы задаются последовательно по строкам (data11, data12 ... data33).
 Ссылки
 Teigha.Geometry.Matrix2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!