Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Material.Description
 Послать отзыв
 Свойство представляет описание данного материала.
 Синтаксис
C#
Visual Basic
Копировать Код
public String Description;
Копировать Код
Public Property Description As String
 Возвращает
 Возвращает описание материала. Тип String.
 Описание
 Свойство представляет описание данного материала.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Material, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!