Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DimAssoc.DimAssoc
 Послать отзыв
 Конструктор по умолчанию класса DimAssoc.
 Синтаксис
C#
Visual Basic
Копировать Код
public DimAssoc();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса DimAssoc. Создает размер с параллельным выравниванием.
 Ссылки
 Teigha.DatabaseServices.DimAssoc, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!