Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LayerStateManager
 Послать отзыв
 Класс LayerStateManager используется для доступа и управления состояниями индивидуального слоя, связанными с базой данных чертежа.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::DatabaseServices::LayerStateManager
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdDbLayerStateManager")] public class LayerStateManager : RXObject;
Копировать Код
<Wrapper("OdDbLayerStateManager")> Public Class LayerStateManager Inherits RXObject
 Описание
 Класс LayerStateManager используется для доступа и управления индивидуального слоя, связанными с базой данных чертежа. Реализация менеджера состояний слоев не наследует класс коллекции. Его использование предполагает высокоуровневый доступ к функциям управления состояниями слоя. Для перечисления состояний, получения списков и других низкоуровневых функций разработчики должны использовать существующие API для доступа к словарю состояний слоя в словаре расширения таблицы слоев.
 Методы
 Конструкторы
 Teigha.DatabaseServices.LayerStateManager
 Имя
 Описание
 LayerStateManager
 Конструктор класса LayerStateManager, использует базу данных, которую связывает с новым экземпляром менеджера состояния слоя.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.DatabaseServices.LayerStateManager
 Имя
 Описание
 LayerStateManager Методы
 Ниже перечислены методы класса LayerStateManager.
 LayerStateManager Свойства
 Ниже перечислены свойства класса LayerStateManager.
 LayerStateManager События
 Ниже перечислены события класса LayerStateManager.
 Ссылки
 LayerStateManager Методы, LayerStateManager Свойства, LayerStateManager События, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства, LayerStateManager События
 Ваши комментарии по поводу этого топика: Послать отзыв!