Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LayerStateManager.LayerStateToBeRenamed
 Послать отзыв
 Событие создается, если состояние слоя будет переименовано.
 Синтаксис
C#
Visual Basic
Копировать Код
public event LayerStateRenameEventHandler LayerStateToBeRenamed;
Копировать Код
Public Event LayerStateToBeRenamed As LayerStateRenameEventHandler
 Описание
 Событие создается, если состояние слоя будет переименовано.
 Ссылки
 Teigha.DatabaseServices.LayerStateManager, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!