Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.UnderlayReference.AdjustColorForBackground
 Послать отзыв
 Свойство AdjustColorForBackground позволяет определить, настроено ли содержимое подложки для текущего цвета фона.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool AdjustColorForBackground;
Копировать Код
Public Property AdjustColorForBackground As Boolean
 Возвращает
 Возвращает true, если содержимое подложки настроено для текущего цвета фона. В противном случае возвращает false.
 Описание
 Свойство AdjustColorForBackground позволяет определить, настроено ли содержимое подложки для текущего цвета фона.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.UnderlayReference, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!