Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PdfDefinition.PdfDefinition
 Послать отзыв
 Конструктор по умолчанию класса PdfDefinition.
 Синтаксис
C#
Visual Basic
Копировать Код
public PdfDefinition();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса PdfDefinition.
 Ссылки
 Teigha.DatabaseServices.PdfDefinition, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!