Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObject.Drawable
 Послать отзыв
 Свойство предоставляет доступ к графическому объекту, связанном с этим объектом базы данных.
 Синтаксис
C#
Visual Basic
Копировать Код
public Drawable Drawable;
Копировать Код
Public Property Drawable() As Drawable
 Возвращает
 Возвращает отображаемый объект, тип данных Drawable. Если данный объект базы данных не имеет отображаемого объекта, свойство вернёт NULL.
 Описание
 Свойство предоставляет доступ к графическому объекту, связанном с этим объектом базы данных.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.DBObject, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!