Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DataLink.RepathSourceFiles
 Послать отзыв
 Метод перенаправляет ссылки на пути к внешним исходным файлам.
 Синтаксис
C#
Visual Basic
Копировать Код
public void RepathSourceFiles( ref String sBasePath, PathOption nOption );
Копировать Код
Public Sub RepathSourceFiles( ByRef sBasePath As String, nOption As PathOption )
 Параметры
 Параметры
 Описание
 sBasePath
 Базовый путь к файлам. Тип String.
 nOption
 Опции путей. Значение из перечисления PathOption.
 Описание
 Метод перенаправляет ссылки на пути к внешним исходным файлам.
 Ссылки
 Teigha.DatabaseServices.DataLink, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!