Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DynamicBlockReferenceProperty.VisibleInCurrentVisibilityState
 Послать отзыв
 Свойство VisibleInCurrentVisibilityState определяет, является ли данное свойство видимым в текущем представлении динамического блока.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool VisibleInCurrentVisibilityState;
Копировать Код
Public ReadOnly Property VisibleInCurrentVisibilityState As Boolean
 Возвращает
 Возвращает true, если свойство является видимым. В противном случае возвращает false.
 Описание
 Свойство VisibleInCurrentVisibilityState определяет, является ли данное свойство видимым в текущем представлении динамического блока.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.DynamicBlockReferenceProperty, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!