Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Line3d.Create
 Послать отзыв
 Метод создает новую бесконечную линию Line3d из исходного объекта, который передан через указатель.
 Синтаксис
C#
Visual Basic
Копировать Код
public Line3d Create( IntPtr unmanagedPointer, bool autoDelete );
Копировать Код
Public Function Create( unmanagedPointer As IntPtr, autoDelete As Boolean ) As Line3d
 Параметры
 Параметры
 Описание
 unmanagedPointer
 Входной неуправляемый указатель на исходный объект. Тип IntPtr.
 autoDelete
 Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.
 Возвращает
 Возвращает новый объект Line3d.
 Описание
 Метод создает новую бесконечную линию Line3d из исходного объекта, который передан через указатель.
 Ссылки
 Teigha.Geometry.Line3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!