Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Spline.StartFitTangent
 Послать отзыв
 Свойство StartFitTangent представляет касательный вектор в начальной определяющей точке.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d StartFitTangent;
Копировать Код
Public ReadOnly Property StartFitTangent As Vector3d
 Возвращает
 Возвращает касательный вектор. Тип Vector3d.
 Описание
 Свойство StartFitTangent представляет касательный вектор в начальной определяющей точке.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Spline, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!