Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LayerStateManager.HasLayerState
 Послать отзыв
 Возвращает true, если указанное имя состояния слоя существует. В противном случае возвращает false.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool HasLayerState( ref String name );
Копировать Код
Public Function HasLayerState( ByRef name As String ) As Boolean
 Параметры
 Параметры
 Описание
 name
 Имя состояния слоя, String.
 Возвращает
 Возвращает true, если указанное имя состояния слоя существует. В противном случае возвращает false.
 Описание
 Возвращает true, если указанное имя состояния слоя существует. В противном случае возвращает false.
 Ссылки
 Teigha.DatabaseServices.LayerStateManager, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!