Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FileDependencyInfo.FullFileName
 Послать отзыв
 Свойство FullFileName представляет полное имя файла.
 Синтаксис
C#
Visual Basic
Копировать Код
public String FullFileName;
Копировать Код
Public ReadOnly Property FullFileName As String
 Возвращает
 Возвращает полное имя файла. Тип String.
 Описание
 Свойство FullFileName представляет полное имя файла.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.FileDependencyInfo, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!