Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство TextStyleTableRecord.Font
 Послать отзыв
 Синтаксис
C#
Visual Basic
public GraphicsInterface::FontDescriptor Font;
Public Property Font() As GraphicsInterface.FontDescriptor
 Описание
 Возвращает данные определения шрифта из записи текстового стиля. Возвращаются наименование шрифта, его атрибуты — полужирный и курсив, множество символов, высота и т.д.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.TextStyleTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!