Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство DBText.HorizontalMode
 Послать отзыв
 Синтаксис
C#
Visual Basic
public DatabaseServices::TextHorizontalMode HorizontalMode;
Public Property HorizontalMode() As DatabaseServices.TextHorizontalMode
 Описание
 Обеспечивает доступ к горизонтальному режиму текста.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.DBText, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!