Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор LinetypeTableRecord.LinetypeTableRecord ()
 Послать отзыв
 Синтаксис
C#
Visual Basic
public LinetypeTableRecord(); public LinetypeTableRecord(IntPtr obj, bool autoDelete);
Public Sub New() Public Sub New(obj As IntPtr, autoDelete As bool)
 Описание
 Конструктор по умолчанию.
 Приложения могут не использовать этот конструктор. Класс Database создает свою собственную копию и нет никаких причин использовать этот конструктор.
 Ссылки
 Teigha.DatabaseServices.LinetypeTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!