Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор OrdinateDimension.OrdinateDimension (IntPtr, bool)
 Послать отзыв
 This is OrdinateDimension, a member of class OrdinateDimension.
 Синтаксис
C#
Visual Basic
public OrdinateDimension(IntPtr unmanagedObjPtr, bool autoDelete);
Public Sub New(unmanagedObjPtr As IntPtr, autoDelete As bool)
 Ссылки
 OrdinateDimension Класс, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!