Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.XrefBeginOperationEventArgs.FileName
 Послать отзыв
 Свойство FileName представляет имя файла, на который указывает внешняя ссылка.
 Синтаксис
C#
Visual Basic
Копировать Код
public String FileName;
Копировать Код
Public ReadOnly Property FileName As String
 Возвращает
 Возвращает имя файла. Тип String.
 Описание
 Свойство FileName представляет имя файла, на который указывает внешняя ссылка.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.XrefBeginOperationEventArgs, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!