Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotStyle.Description
 Послать отзыв
 Свойство Description представляет описание стиля печати.
 Синтаксис
C#
Visual Basic
Копировать Код
public String Description;
Копировать Код
Public Property Description As String
 Возвращает
 Возвращает описание стиля печати. Тип String.
 Описание
 Свойство Description предоставляет доступ к описанию данного стиля печати.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.PlotStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!