Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LinkedData.Clear
 Послать отзыв
 Метод предназначен для удаления текущих данных. Должен быть реализован в производных классах.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void Clear();
Копировать Код
Public Overridable Sub Clear()
 Описание
 Метод предназначен для удаления текущих данных. Должен быть реализован в производных классах.
 Ссылки
 Teigha.DatabaseServices.LinkedData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!