Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Curve.GetParameterAtDistance
 Послать отзыв
 Метод определяет параметр кривой для точки, находящейся на заданном расстоянии вдоль кривой от её начала.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual double GetParameterAtDistance( double dist );
Копировать Код
Public virtual Function GetParameterAtDistance( dist As double ) As double
 Параметры
 Параметры
 Описание
 dist
 Заданное расстояние вдоль кривой от ее начала, тип double.
 Возвращает
 Значение типа double, которое определяет параметр для точки на кривой, удаленной от начала кривой на заданное расстояние dist.
 Описание
 Метод определяет параметр кривой для точки, находящейся на расстоянии dist вдоль кривой от её начала.
 Ссылки
 Teigha.DatabaseServices.Curve, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!