Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SubentityOverrule.AddSubentPaths
 Послать отзыв
 Данный метод переопределяет метод Entity.AddsubentPaths() и вызывает его при реализации по умолчанию.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void AddSubentPaths( ref Entity entity, ref FullSubentityPath[] paths );
Копировать Код
Public virtual Sub AddSubentPaths( ByRef entity As Entity, ByRef paths As FullSubentityPath[] )
 Параметры
 Параметры
 Описание
 entity
 Объект чертежа, тип Entity.
 paths
 Массив полных путей подобъектов FullSubentityPath[], которые идентифицируют подобъекты, добавляемые к объекту entity.
 Описание
 Данный метод переопределяет метод Entity.AddsubentPaths() и вызывает его при реализации по умолчанию.
 Метод Entity.AddSubentityPaths() в реализации по умолчанию добавляет к геометрическому объекту один или несколько геометрических подобъектов. С помощью метода AddSubentPaths() настоящего класса можно переопределить механизм работы метода.
 Ссылки
 Teigha.DatabaseServices.SubentityOverrule, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!