Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CellRange.==
 Послать отзыв
 Оператор равенства для класса CellRange. Проверяет равенство двух диапазонов ячеек.
 Синтаксис
C#
Visual Basic
Копировать Код
public static bool operator ==( ref CellRange t1, ref CellRange t2 );
Копировать Код
Public Shared Operator =( ByRef t1 As CellRange, ByRef t2 As CellRange ) As Boolean
 Параметры
 Параметры
 Описание
 t1
 Левый операнд. Тип CellRange. Не должен быть нулевым.
 t2
 Правый операнд. Тип CellRange. Не должен быть нулевым.
 Возвращает
 Возвращает true в случае равенства ненулевых операндов t1 и t2, т.е. если выполняются все перечисленные ниже условия:
Совпадают верхние строки.
Совпадают нижние строки.
Совпадают левые столбцы.
Совпадают правые столбцы.
 В противном случае возвращает false.
 Описание
 Оператор равенства для класса CellRange. Проверяет равенство двух диапазонов ячеек.
 Ссылки
 Teigha.DatabaseServices.CellRange, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!