Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MText.getMTextWithFieldCodes
 Послать отзыв
 Метод позволяет преобразовать многострочный текст в строку, в которой поля представлены своими кодами.
 Синтаксис
C#
Visual Basic
Копировать Код
public String getMTextWithFieldCodes();
Копировать Код
Public Function getMTextWithFieldCodes() As String
 Возвращает
 Возвращает строку, в которой автоматические поля представлены своими кодами. Тип String.
 Описание
 Метод позволяет преобразовать многострочный текст, содержащий автоматические поля, в строку, в которой автоматические поля представлены своими кодами.
 Код поля представляет собой пару (ключ - значение), где ключ - наименование поля, значение - код автоматического поля.
 Ссылки
 Teigha.DatabaseServices.MText, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!