Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.NurbSurface.DegreeInU
 Послать отзыв
 Свойство представляет степень NURBS поверхности в направлении u.
 Синтаксис
C#
Visual Basic
Копировать Код
public int DegreeInU;
Копировать Код
Public ReadOnly Property DegreeInU As Integer
 Возвращает
 Возвращает степень NURBS поверхности. Тип int.
 Описание
 Свойство представляет степень NURBS поверхности в направлении u.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.NurbSurface, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!