Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Circle.Radius
 Послать отзыв
 Синтаксис
C#
Visual Basic
public double Radius;
Public Property Radius() As Double
 Описание
 Возвращает или задает радиус окружности.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Circle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!