Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Group.Name
 Послать отзыв
 Свойство обеспечивает доступ к имени данного объекта Group.
 Синтаксис
C#
Visual Basic
Копировать Код
public String Name;
Копировать Код
Public Property Name As String
 Возвращает
 Возвращает имя данной группы. Тип String.
 Описание
 Свойство обеспечивает доступ к имени данного объекта Group.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Group, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!