Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.XrefSubCommandEventArgs.btrIds
 Послать отзыв
 Свойство btrIds представляет коллекцию идентификаторов записей таблицы блоков.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectIdCollection btrIds;
Копировать Код
Public ReadOnly Property btrIds As ObjectIdCollection
 Возвращает
 Возвращает коллекцию идентификаторов объектов. Тип ObjectIdCollection.
 Описание
 Свойство btrIds представляет коллекцию идентификаторов записей таблицы блоков.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.XrefSubCommandEventArgs, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!