Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Surface.SliceByPlane
 Послать отзыв
 Метод позволяет разрезать плоскостью данную поверхность и преобразовать ее в ту часть, которая осталась со стороны от режущей плоскости с положительным направлением нормали.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual SurfaceSliceResults SliceByPlane( ref Plane slicePlane );
Копировать Код
Public Overridable Function SliceByPlane( ByRef slicePlane As Plane ) As SurfaceSliceResults
 Параметры
 Параметры
 Описание
 slicePlane
 Секущая плоскость. Тип Plane.
 Возвращает
 Возвращает объект SurfaceSliceResults, который включает как "отрицательную", так и "положительную" части разрезанной поверхности.
 Описание
 Метод позволяет разрезать плоскостью данную поверхность и преобразовать ее в ту часть, которая осталась со стороны от режущей плоскости с положительным направлением нормали.
 Замечания
 Этот метод реализован только в среде пространственного моделирования Spatial Modeler.
 Ссылки
 Teigha.DatabaseServices.Surface, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!