Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DxfFiler.WritePoint2d
 Послать отзыв
 Метод записывает в данный объект Filer указанную двумерную точку.
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract void WritePoint2d( DxfCode opCode, Point2d value, int precision );
Копировать Код
Public MustOverride Sub WritePoint2d( opCode As DxfCode, value As Point2d, precision As Integer )
 Параметры
 Параметры
 Описание
 opCode
 Групповой код DXF. Тип DxfCode.
 value
 2D-точка, которую следует записать. Тип Point2d.
 precision
 Количество цифр после запятой в интервале от 0 до 16. Тип int. Параметр используется для представления координат точки.
 Описание
 Метод записывает в данный объект Filer указанные групповой код DXF, двумерную точку и точность представления координат точки.
 Ссылки
 Teigha.DatabaseServices.DxfFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!