Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.XrefRedirectedEventArgs.NewId
 Послать отзыв
 Свойство NewId представляет идентификатор объекта записи таблицы символов, на которую перенаправляется запись таблицы символов внешней ссылки.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectId NewId;
Копировать Код
Public ReadOnly Property NewId As ObjectId
 Возвращает
 Возвращает идентификатор объекта записи таблицы символов. Тип ObjectId.
 Описание
 Свойство NewId представляет идентификатор объекта записи таблицы символов, на которую перенаправляется запись таблицы символов внешней ссылки.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.XrefRedirectedEventArgs, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!