Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Curve.GetSecondDerivative
 Послать отзыв
 Метод предназначен для получения вектора второй производной кривой в заданной точке.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual Vector3d GetSecondDerivative( Point3d point );
Копировать Код
Public virtual Function GetSecondDerivative( point As Point3d ) As Vector3d
 Параметры
 Параметры
 Описание
 point
 Точка Point3d на кривой, в которой определяется вторая производная.
 Возвращает
 Возвращает вторую производную кривой в заданной точке, представленную экземпляром класса Vector3d.
 Описание
 Метод предназначен для получения вектора второй производной кривой в заданной точке.
 Ссылки
 Teigha.DatabaseServices.Curve, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!