Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Leader.LastVertex
 Послать отзыв
 Синтаксис
C#
Visual Basic
public Point3d LastVertex;
Public Property LastVertex() As Point3d
 Описание
 Возвращает последнюю точку выноски в WCS координатах. Эта точка будет в конце выноски, где к ней присоединяется аннотация. Заметим, что это может быть значение, отличное от того, которое установлено для вершины, если связанная с объектом аннотация была изменена.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.Leader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!