Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.UnderlayDefinition.GetDictionaryKey
 Послать отзыв
 Метод позволяет получить имя словаря с объектами UnderlayDefinition в словаре именованных объектов.
 Синтаксис
C#
Visual Basic
Копировать Код
public static String GetDictionaryKey( ref Type underlayDefinitionType );
Копировать Код
Public Shared Function GetDictionaryKey( ByRef underlayDefinitionType As Type ) As String
 Параметры
 Параметры
 Описание
 underlayDefinitionType
 Входной дескриптор класса типа подложки, для которого требуется получить имя словаря. Тип Type.
 Возвращает
 Возвращает имя словаря. Тип String.
 Описание
 Метод позволяет получить имя словаря с объектами UnderlayDefinition в словаре именованных объектов.
 Ссылки
 Teigha.DatabaseServices.UnderlayDefinition, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!