Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Cone.BaseCenter
 Послать отзыв
 Свойство BaseCenter представляет центр основания данного конуса.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d BaseCenter;
Копировать Код
Public ReadOnly Property BaseCenter As Point3d
 Возвращает
 Возвращает центр основания данного конуса. Тип Point3d.
 Описание
 Свойство BaseCenter представляет центр основания данного конуса.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.Cone, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!