Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Matrix2dBuilder
 Послать отзыв
 Класс Matrix2dBuilder используется для создания экземпляров класса Teigha.Geometry.Matrix2d, который является неизменяемым типом.
 Иерархия классов
Teigha::Geometry::Matrix2dBuilder
 Синтаксис
C#
Visual Basic
Копировать Код
[DefaultMember("ElementAt")] public class Matrix2dBuilder
Копировать Код
<DefaultMember("ElementAt")> Public Class Matrix2dBuilder
 Описание
 Класс Matrix2dBuilder используется для создания экземпляров класса Teigha.Geometry.Matrix2d, который является неизменяемым типом.
 Методы
 Конструкторы
 Имя
 Описание
 Matrix2dBuilder
 Это обзор перегрузок Matrix2dBuilder.
 Топики
 Имя
 Описание
 Matrix2dBuilder Методы
 Ниже перечислены методы класса Matrix2dBuilder.
 Matrix2dBuilder Свойства
 Ниже перечислены свойства класса Matrix2dBuilder.
 Ссылки
 Matrix2dBuilder Конструктор, Matrix2dBuilder Методы, Matrix2dBuilder Свойства, Методы, Топики, Matrix2dBuilder Методы, Matrix2dBuilder Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!