Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.BlockTableId
 Послать отзыв
 Синтаксис
C#
Visual Basic
public DatabaseServices::ObjectId BlockTableId;
Public Property BlockTableId() As DatabaseServices.ObjectId
 Описание
 Возвращает Id объекта BlockTable базы данных.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!