Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SubentityId.SubentityId
 Послать отзыв
 Конструктор структуры SubentityId. Создает экземпляр структуры с указанными типом подобъекта и целочисленным значением индекса.
 Синтаксис
C#
Visual Basic
Копировать Код
[Obsolete("Use the overload taking IntPtr.")] public SubentityId( SubentityType type, long long i );
Копировать Код
<Obsolete("Use the overload taking IntPtr.")> Public Sub New( type As SubentityType, i As long long )
 Параметры
 Параметры
 Описание
 type
 Тип подобъекта. Тип SubentityType.
 i
 Индекс подобъекта. Тип long long.
 Описание
 Конструктор структуры SubentityId. Создает экземпляр структуры с указанными типом подобъекта и целочисленным значением индекса.
 Замечания
 Устарел. Рекомендуется использовать перегрузку Teigha.DatabaseServices.SubentityId.SubentityId(SubentityType, IntPtr).
 Ссылки
 Teigha.DatabaseServices.SubentityId, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!