Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SubDMesh.SetCrease
 Послать отзыв
 Метод заостряет грани, ребра и вершины сети, заданные массивом подобъектов.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetCrease( ref FullSubentityPath[] subentPaths, double creaseVal );
Копировать Код
Public Sub SetCrease( ByRef subentPaths As FullSubentityPath[], creaseVal As double ) As void
 Параметры
 Параметры
 Описание
 subentPaths
 Массив подобъектов, к которым применяется заострение. Тип FullSubentityPath[].
 creaseVal
 Условие применения заострения, double.
Допустимые значения аргумента creaseVal:
 Описание
 Метод заостряет грани, ребра и вершины сети, заданные массивом подобъектов.
 Ссылки
 Teigha.DatabaseServices.SubDMesh, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!