Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PolylineVertex3d
 Послать отзыв
 Класс PolylineVertex3d представляет вершины 3D полилинии в nanoCAD.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::GraphicsInterface::Drawable Teigha::DatabaseServices::DBObject Teigha::DatabaseServices::Entity Teigha::DatabaseServices::Vertex Teigha::DatabaseServices::PolylineVertex3d
 Синтаксис
C#
Visual Basic
Копировать Код
public class PolylineVertex3d : Vertex;
Копировать Код
Public Class PolylineVertex3d Inherits Vertex
 Описание
 Класс PolylineVertex3d представляет вершины 3D полилинии в nanoCAD.
 Замечания
 В объектах PolylineVertex3d доступны методы объекта Entity для настройки таких свойств, как цвет, слой и тип линии. В то же время вершины являются подобъектами, которые должны иметь те же свойства объекта, что и родительская полилиния. Таким образом, использование в объектах PolylineVertex3d методов Entity для присвоения таким свойствам значений, отличных от родительских, приведет к повреждению вершин. Исправить поврежденные вершины позволяет аудит чертежа.
 Не следует наследовать от этого класса. В противном случае ваше приложение приведет к остановке nanoCAD.
 Методы
 Конструкторы
 Teigha.GraphicsInterface.Drawable
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 Drawable
 Конструктор класса Teigha.GraphicsInterface.Drawable. (Унаследован от Drawable)
 Teigha.DatabaseServices.DBObject
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 DBObject
 Конструктор. (Унаследован от DBObject)
 Teigha.DatabaseServices.PolylineVertex3d
 Имя
 Описание
 PolylineVertex3d
 Это обзор перегрузок PolylineVertex3d.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.GraphicsInterface.Drawable
 Имя
 Описание
 Drawable Методы
 Ниже перечислены методы класса Drawable.
 Drawable Свойства
 Ниже перечислены свойства класса Drawable.
 Teigha.DatabaseServices.DBObject
 Имя
 Описание
 DBObject Методы
 Ниже перечислены методы класса DBObject.
 DBObject Свойства
 Ниже перечислены свойства класса DBObject.
 DBObject События
 Ниже перечислены события класса DBObject.
 Teigha.DatabaseServices.Entity
 Имя
 Описание
 Entity Методы
 Ниже перечислены методы класса Entity.
 Entity Свойства
 Ниже перечислены свойства класса Entity.
 Teigha.DatabaseServices.PolylineVertex3d
 Имя
 Описание
 PolylineVertex3d Свойства
 Ниже перечислены свойства класса PolylineVertex3d.
 Ссылки
 PolylineVertex3d Конструктор, PolylineVertex3d Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства, DBObject События
 Ваши комментарии по поводу этого топика: Послать отзыв!