Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.PointEntity3d.GetPoint
 Послать отзыв
 Метод предоставляет трехмерную точку данного объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d GetPoint();
Копировать Код
Public Function GetPoint() As Point3d
 Возвращает
 Возвращает трехмерную точку данного объекта. Тип Point3d.
 Описание
 Метод предоставляет трехмерную точку данного объекта.
 Ссылки
 Teigha.Geometry.PointEntity3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!