Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Событие Database.XrefComandeered
 Послать отзыв
 Синтаксис
C#
Visual Basic
public event XrefComandeeredEventHandler XrefComandeered;
Public Event XrefComandeered As XrefComandeeredEventHandler
 Описание
 Событие показывает, что объект "присвоен" базе данных, что означает, что объект добавлен в таблицу символов основного чертежа.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!