Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.BoundBlock2d.Contains
 Послать отзыв
 Метод позволяет проверить, содержит ли данная граничная рамка указанную точку.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool Contains( Point2d point );
Копировать Код
Public Function Contains( point As Point2d ) As Boolean
 Параметры
 Параметры
 Описание
 point
 Входная 2D-точка. Тип Point2d.
 Возвращает
 Возвращает true, если и только если указанная точка находится в пределах граничной рамки. В противном случае возвращает false.
 Описание
 Метод позволяет проверить, содержит ли данная граничная рамка указанную точку.
 Ссылки
 Teigha.Geometry.BoundBlock2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!