Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 LayerTableRecord.EntityColor
 Послать отзыв
 В свойстве хранится информации о настройках цвета слоя.
 Синтаксис
C#
Visual Basic
Копировать Код
public EntityColor EntityColor { get; }
Копировать Код
Public ReadOnly Property EntityColor As EntityColor
 Возвращает
 Возвращает тип данных EntityColor.
 Описание
 В свойстве хранится информация о настройке цвета слоя в виде типа данных EntityColor.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.LayerTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!