Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.DimBlockPosition
 Послать отзыв
 Свойство задает или возвращает относительное положение в мировой системе координат WCS блока, связанного с данным размером.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d DimBlockPosition;
Копировать Код
Public Property DimBlockPosition As Point3d
 Возвращает
 Возвращает точку вставки блока данного размера. Тип Point3d.
 Описание
 Свойство задает или возвращает относительное положение в мировой системе координат WCS блока, связанного с данным размером.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!