Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Line2dCollection.Insert
 Послать отзыв
 Метод вставляет в коллекцию новый элемент в позицию с указанным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Insert( int index, ref Line2d value );
Копировать Код
Public Sub Insert( index As Integer, ByRef value As Line2d )
 Параметры
 Параметры
 Описание
 index
 Позиция нового элемента. Тип int.
 value
 Вставляемый в коллекцию элемент. Тип Line2d.
 Описание
 Метод вставляет в коллекцию новый элемент в позицию с указанным индексом.
 Замечания
 В случае некорректного значения индекса метод выбрасывает исключение ArgumentOutOfRangeException.
 Ссылки
 Teigha.Geometry.Line2dCollection, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!