Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.Dimatfit
 Послать отзыв
 Свойство задает способ расположения размерного текста и стрелок, если между выносными линиями недостаточно места для текста и/или для стрелок.
 Синтаксис
C#
Visual Basic
Копировать Код
public int Dimatfit;
Копировать Код
Public Property Dimatfit As Integer
 Возвращает
 Возвращает вариант расположения размерного текста и стрелок относительно выносных линий. Тип int.
 Описание
 Свойство задает способ расположения размерного текста и стрелок, если между выносными линиями недостаточно места для текста и/или для стрелок.
 Значение
 Описание
 0
 Размещение текста и стрелок за пределами выносных линий.
 1
 Стрелки располагаются за пределами выносных линий, текст остается в пределах.
 2
 Текст располагаются за пределами выносных линий, стрелки остаются в пределах.
 3
 Выбирается оптимальный вариант перемещения за пределы выносных линий текста и/или стрелок.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!