Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Entity3d.TranslateBy
 Послать отзыв
 Метод выполняет трансляцию данного объекта на заданный вектор.
 Синтаксис
C#
Visual Basic
Копировать Код
public void TranslateBy( Vector3d translateVector );
Копировать Код
Public Sub TranslateBy( translateVector As Vector3d )
 Параметры
 Параметры
 Описание
 translateVector
 Вектор, определяющий операцию трансляции. Тип Vector3d.
 Описание
 Метод выполняет трансляцию (параллельный перенос) данного объекта на заданный вектор.
 Ссылки
 Teigha.Geometry.Entity3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!