Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Vertex2dType
 Послать отзыв
 Перечисление Vertex2dType определяет типы вершин 2D-полилиний.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum Vertex2dType { SimpleVertex = 0, SplineControlVertex = 1, SplineFitVertex = 2, CurveFitVertex = 3 }
Копировать Код
Public Enum Vertex2dType SimpleVertex = 0 SplineControlVertex = 1 SplineFitVertex = 2 CurveFitVertex = 3 End Enum
 Члены
 Члены
 Описание
 SimpleVertex
 Значение: 0. Стандартная вершина 2D-полилинии.
 SplineControlVertex
 Значение: 1. Управляющая вершина сплайна или полилинии, которая аппроксимирует кривую.
 SplineFitVertex
 Значение: 2. Определяющая точка, автоматически созданная в результате аппроксимации сплайном. Этот тип вершин может исчезнуть или измениться автоматически при последующих операциях редактирования полилинии.
 CurveFitVertex
 Значение: 3. Определяющая точка, автоматически созданная в процессе аппроксимации кривой. Этот тип вершин может исчезнуть или измениться автоматически при последующих операциях редактирования полилинии.
 Описание
 Перечисление Vertex2dType определяет типы вершин 2D-полилиний.
 Ваши комментарии по поводу этого топика: Послать отзыв!