Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.AugmentedPolylineCurve3d.Create
 Послать отзыв
 Метод предназначен для создания объекта AugmentedPolylineCurve3d на основе переданного указателя.
 Синтаксис
C#
Visual Basic
Копировать Код
public static AugmentedPolylineCurve3d Create( IntPtr unmanagedPointer, bool autoDelete );
Копировать Код
Public Shared Function Create( unmanagedPointer As IntPtr, autoDelete As Boolean ) As AugmentedPolylineCurve3d
 Параметры
 Параметры
 Описание
 unmanagedPointer
 Входной неуправляемый указатель на объект, на базе которого создается новый объект. Тип IntPtr.
 autoDelete
 Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.
 Возвращает
 Возвращает новый объект. Тип AugmentedPolylineCurve3d.
 Описание
 Метод предназначен для создания объекта AugmentedPolylineCurve3d на основе переданного указателя.
 Ссылки
 Teigha.Geometry.AugmentedPolylineCurve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!