Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MText.ConvertFieldToText
 Послать отзыв
 Метод позволяет преобразовать существующие в данном объекта MText поля в обычный текст с последующим удалением полей.
 Синтаксис
C#
Visual Basic
Копировать Код
public void ConvertFieldToText();
Копировать Код
Public Sub ConvertFieldToText()
 Описание
 Метод позволяет преобразовать существующие в данном объекта MText поля в обычный текст. Преобразование завершается удалением полей. Перед преобразованием поля не перевычисляются.
 Ссылки
 Teigha.DatabaseServices.MText, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!