Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.LinearEntity3d.IsOn
 Послать отзыв
 Метод проверяет, принадлежит ли данный объект указанной плоскости.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsOn( ref Plane plane );
Копировать Код
Public Function IsOn( ByRef plane As Plane ) As Boolean
 Параметры
 Параметры
 Описание
 plane
 Входная плоскость. Тип Plane.
 Возвращает
 Возвращает true, если данный объект лежит в указанной плоскости. В противном случае возвращает false.
 Описание
 Метод проверяет, принадлежит ли данный объект указанной плоскости. Используется вызов метода LinearEntity3d.IsOn(Plane plane, Tolerance tolerance) с точностью, равной Tolerance.Global.
 Ссылки
 Teigha.Geometry.LinearEntity3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!