Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeaderStyle.BlockId
 Послать отзыв
 Свойство представляет идентификатор ObjectId блока, связанного с данным стилем.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.ObjectId BlockId;
Копировать Код
Public Property BlockId As DatabaseServices.ObjectId
 Возвращает
 Возвращает идентификатор блока. Тип DatabaseServices.ObjectId.
 Описание
 Свойство представляет идентификатор ObjectId блока, связанного с данным стилем.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MLeaderStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!