Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SymbolUtilityServices.IsLinetypeContinuousName
 Послать отзыв
 Метод позволяет проверить, соответствует ли входная строка имени типа линии "Continuous".
 Синтаксис
C#
Visual Basic
Копировать Код
public static bool IsLinetypeContinuousName( ref String name );
Копировать Код
Public Shared Function IsLinetypeContinuousName( ByRef name As String ) As Boolean
 Параметры
 Параметры
 Описание
 name
 Проверяемое имя. Тип String.
 Возвращает
 Возвращает true, если строка name соответствует имени типа линии "Continuous". В противном случае возвращает false.
 Описание
 Метод позволяет проверить, соответствует ли входная строка имени типа линии "Continuous".
 Ссылки
 Teigha.DatabaseServices.SymbolUtilityServices, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!