Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.TransactionManager.GetObject
 Послать отзыв
 Этот метод вызывает метод GetObject() верхней транзакции с передачей ему всех полученных аргументов.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual DBObject GetObject( ObjectId id, OpenMode mode );
Копировать Код
Public virtual Function GetObject( id As ObjectId, mode As OpenMode ) As DBObject
 Параметры
 Параметры
 Описание
 id
 Идентификатор ObjectId получаемого объекта.
 mode
 Режим доступа к объекту из перечисления OpenMode.
 Возвращает
 Возвращает объект DBObject.
 Описание
 Этот метод вызывает метод GetObject() верхней транзакции с передачей ему всех полученных аргументов.
 Поскольку объекты могут быть получены только в верхней транзакции, этот метод избавляет от необходимости как-то сохранять указатель на верхнюю транзакцию или использовать свойство TransactionManager.TopTransaction для его получения.
 Ссылки
 Teigha.DatabaseServices.TransactionManager, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!