Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Cylinder.Cylinder
 Послать отзыв
 Конструктор класса Cylinder. Создает экземпляр класса с указанными осью цилиндра, началом координат и радиусом.
 Синтаксис
C#
Visual Basic
Копировать Код
public Cylinder( double radius, Point3d origin, Vector3d axisOfSymmetry );
Копировать Код
Public Sub New( radius As Double, origin As Point3d, axisOfSymmetry As Vector3d )
 Параметры
 Параметры
 Описание
 radius
 Радиус основания цилиндра. Тип double.
 origin
 Начало координат цилиндра. Тип Point3d.
 axisOfSymmetry
 Ось цилиндра. Тип Vector3d.
 Описание
 Конструктор класса Cylinder. Создает экземпляр класса с указанными осью цилиндра, началом координат и радиусом.
 Ссылки
 Teigha.Geometry.Cylinder, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!