Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 DimStyleTableRecord.Dimtix
 Послать отзыв
 Свойство отвечает за настройку размещения размерного текста внутри выносных линий.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual bool Dimtix { get; set; }
Копировать Код
Public Overridable Property Dimtix As Boolean
 Возвращает
 Возвращает тип данных bool.
 Описание
 В свойстве хранится текущая настройка размещения размерного текста внутри выносных линий. В качестве значения свойства доступны следующие варианты:
false – если есть место, текст разместить внутри выносных линий (по умолчанию);
true – всегда размещать размерный текст внутри выносных линий.
 Свойство также доступно через системную переменную DIMTIX и пользовательское меню в окне изменения/создания размерного стиля:
  При изменении системной переменной DIMTIX будет создан новый размерный стиль под названием <переопределение> на основе текущего с новым значением DIMTIX.
 Условия
 Чтение и запись.
 Пример
 Пример изменения настройки размещения размерного текста внутри выносных линий (значения свойства Dimtix) в размерном стиле Standard:
C#
 Копировать Код
public partial class Commands { [Teigha.Runtime.CommandMethod("DimtixChange")] public void DimtixStandardDimStyle() { // Получение ссылки на активный документ HostMgd.ApplicationServices.Document doc = HostMgd.ApplicationServices.Application.DocumentManager.MdiActiveDocument; // Получение ссылки на редактор документа HostMgd.EditorInput.Editor ed = doc.Editor; // Получение ссылки на базу данных документа Teigha.DatabaseServices.Database db = doc.Database; // Начало транзакции с базой данных документа using (Teigha.DatabaseServices.Transaction trans = db.TransactionManager.StartTransaction()) { // Открываем таблицу размерных стилей для чтения Teigha.DatabaseServices.DimStyleTable dimStyleTable = trans.GetObject(db.DimStyleTableId, Teigha.DatabaseServices.OpenMode.ForRead) as Teigha.DatabaseServices.DimStyleTable; // Находим в таблице размерных стилей ObjectId нужного стиля по его названию Teigha.DatabaseServices.ObjectId styleId = dimStyleTable["Standard"]; // Открываем таблицу размерного стиля для изменений Teigha.DatabaseServices.DimStyleTableRecord obj = trans.GetObject(styleId, Teigha.DatabaseServices.OpenMode.ForWrite) as Teigha.DatabaseServices.DimStyleTableRecord; ed.WriteMessage($"nDimtix before: {obj.Dimtix}"); // Изменяем размещение стрелок и размерного текста // если они не помещаются внутри выносных линий obj.Dimtix = true; ed.WriteMessage($"nDimtix after: {obj.Dimtix}"); trans.Commit(); } } }
 Результат работы команды DimtixChange:
 Было:
 Стало:
 Ссылки
 Teigha.DatabaseServices.DimStyleTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!