Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GraphNodeCollection.Count
 Послать отзыв
 Свойство возвращает текущее количество элементов в коллекции.
 Синтаксис
C#
Visual Basic
Копировать Код
public int Count;
Копировать Код
Public Property Count As Integer
 Возвращает
 Возвращает количество элементов в коллекции. Тип int.
 Описание
 Свойство возвращает текущее количество элементов в коллекции.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.GraphNodeCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!