Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.LineSegment3d.Set
 Послать отзыв
 Метод позволяет переопределить начальную точку и вектор данного линейного сегмента.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Set( Point3d point, Vector3d vector );
Копировать Код
Public Sub Set( point As Point3d, vector As Vector3d )
 Параметры
 Параметры
 Описание
 point
 Новая начальная точка. Тип Point3d.
 vector
 Новый направляющий вектор. Тип Vector3d. Определяет направление линейного сегмента и его конечную точку.
 Описание
 Метод позволяет переопределить начальную точку и вектор данного линейного сегмента.
 Ссылки
 Teigha.Geometry.LineSegment3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!