Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Field.GetFieldCodeWithChildren
 Послать отзыв
 Метод позволяет извлечь код поля с дочерними полями в различных видах, используя аргумент с флагами кодов поля.
 Синтаксис
C#
Visual Basic
Копировать Код
public FieldCodeWithChildren GetFieldCodeWithChildren( FieldCodeFlags flags );
Копировать Код
Public Function GetFieldCodeWithChildren( flags As FieldCodeFlags ) As FieldCodeWithChildren
 Параметры
 Параметры
 Описание
 flags
 Флаг или набор флагов из перечисления FieldCodeFlags.
 Возвращает
 Возвращает код поля. Тип FieldCodeWithChildren.
 Описание
 Метод позволяет извлечь код поля с дочерними полями в различных видах, используя аргумент с флагами кодов поля.
 Ссылки
 Teigha.DatabaseServices.Field, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!