Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Material.Refraction
 Послать отзыв
 Свойство представляет компонент преломления данного материала.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual MaterialRefractionComponent Refraction;
Копировать Код
Public Overridable Property Refraction As MaterialRefractionComponent
 Возвращает
 Возвращает компонент преломления материала. Тип MaterialRefractionComponent.
 Описание
 Свойство представляет компонент преломления данного материала.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Material, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!