Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.TableStyle.TextHeight
 Послать отзыв
 Метод позволяет получить высоту текста, назначенную для строк указанного типа.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual double TextHeight( RowType rowType );
Копировать Код
Public Overridable Function TextHeight( rowType As RowType ) As Double
 Параметры
 Параметры
 Описание
 rowType
 Тип строки таблицы. Перечисление RowType.
 Возвращает
 Возвращает высоту текста. Тип double.
 Описание
 Метод позволяет получить высоту текста, назначенную для строк указанного типа.
 Ссылки
 Teigha.DatabaseServices.TableStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!