Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Group.Append
 Послать отзыв
 Метод предназначен для добавления в данную группу нескольких объектов списком.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Append( ref ObjectIdCollection ids );
Копировать Код
Public Sub Append( ByRef ids As ObjectIdCollection )
 Параметры
 Параметры
 Описание
 ids
 Коллекция идентификаторов объектов чертежа, которые добавляются в данную группу. Тип ObjectIdCollection.
 Описание
 Метод предназначен для добавления в данную группу нескольких объектов списком.
 Один и тот же объект может принадлежать более чем одной группе. Однако в любой такой группе он может присутствовать только в одном экземпляре.
 Ссылки
 Teigha.DatabaseServices.Group, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!