Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.RenderSettings.MaterialsEnabled
 Послать отзыв
 Свойство MaterialsEnabled позволяет определить, включена ли визуализация объектов с использованием индивидуально настроенных материалов.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool MaterialsEnabled;
Копировать Код
Public Property MaterialsEnabled As Boolean
 Возвращает
 Возвращает true, если включен режим использования индивидуально настроенных материалов. В противном случае возвращает false.
 Описание
 Свойство MaterialsEnabled позволяет определить, включена ли визуализация объектов с использованием индивидуально настроенных материалов. Если эта опция отключена, все объекты визуализируются с использованием общего для всех глобального материала.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.RenderSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!