Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Interval.Contains
 Послать отзыв
 Метод позволяет проверить, принадлежит ли указанное значение данному интервалу с учетом используемой точности.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool Contains( double value );
Копировать Код
Public Function Contains( value As Double ) As Boolean
 Параметры
 Параметры
 Описание
 value
 Проверяемое значение. Тип double.
 Возвращает
 Возвращает true, если значение value принадлежит данному интервалу. В противном случае возвращает false.
 Описание
 Метод позволяет проверить, принадлежит ли указанное значение value данному интервалу с учетом настроенной в интервале точности определения границ.
 Ссылки
 Teigha.Geometry.Interval, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!