Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObject.Audit(AuditInfo)
 Послать отзыв
 Метод выполняет операцию аудита над этим объектом.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Audit(AuditInfo auditInfo);
Копировать Код
Public Sub Audit(auditInfo As AuditInfo)
 Параметры
 Параметры
 Описание
 auditInfo
 Объект AuditInfo
 Описание
 Этот метод вызывается nanoCAD, когда выполняется команда AUDIT. Объект AuditInfo, на который указывает auditInfo, содержит функции, которые будут использоваться для определения того, что должно быть сделано, а также для отчета о результатах операции аудита над объектом.
 Ссылки
 Teigha.DatabaseServices.DBObject, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!