Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.HyperLink.HyperLink
 Послать отзыв
 Конструктор по умолчанию класса HyperLink.
 Синтаксис
C#
Visual Basic
Копировать Код
public HyperLink();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса HyperLink.
 Ссылки
 Teigha.DatabaseServices.HyperLink, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!