Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DxfFiler.ResetFilerStatus
 Послать отзыв
 Метод сбрасывает текущий статус этого объекта Filer.
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract void ResetFilerStatus();
Копировать Код
Public MustOverride Sub ResetFilerStatus()
 Описание
 Метод сбрасывает текущий статус этого объекта Filer. Реализация этого метода по умолчанию не делает ничего.
 Ссылки
 Teigha.DatabaseServices.DxfFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!