Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObject.XData
 Послать отзыв
 Свойство предоставляет доступ к XData этого объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public ResultBuffer XData;
Копировать Код
Public Property XData() As ResultBuffer
 Возвращает
 Возвращает тип данных ResultBuffer
 Описание
 Свойство предоставляет доступ к XData этого объекта.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.DBObject, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!