Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbCurve3d.MakePeriodic
 Послать отзыв
 Метод позволяет сделать данную кривую периодическим сплайном.
 Синтаксис
C#
Visual Basic
Копировать Код
public void MakePeriodic();
Копировать Код
Public Sub MakePeriodic()
 Описание
 Метод позволяет сделать данную кривую периодическим сплайном. Если кривая уже является периодической, метод не делает ничего.
 Ссылки
 Teigha.Geometry.NurbCurve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!