Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.RenderGlobal.DimensionsParameter
 Послать отзыв
 Структура DimensionsParameter представляет параметры высоты и ширины для свойства RenderGlobal.Dimensions.
 Иерархия классов
Teigha::DatabaseServices::RenderGlobal::DimensionsParameter
 Синтаксис
C#
Visual Basic
Копировать Код
public struct DimensionsParameter
Копировать Код
Public Structure DimensionsParameter
 Описание
 Структура DimensionsParameter представляет параметры высоты и ширины для свойства RenderGlobal.Dimensions.
 Методы
 Конструкторы
 Имя
 Описание
 DimensionsParameter
 Конструктор структуры DimensionsParameter. Создает экземпляр структуры с указанными значениями высоты и ширины.
 Топики
 Имя
 Описание
 DimensionsParameter Свойства
 Ниже перечислены свойства класса DimensionsParameter.
 Ссылки
 DimensionsParameter Свойства, Методы, Топики, DimensionsParameter Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!