Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ColumnType
 Послать отзыв
 Данное перечисление определяет типы текстовых столбцов (текстовых колонок).
 Синтаксис
C#
Visual Basic
Копировать Код
public enum ColumnType { DynamicColumns = 2, NoColumns = 0, StaticColumns = 1 }
Копировать Код
Public Enum ColumnType DynamicColumns = 2 NoColumns = 0 StaticColumns = 1 End Enum
 Члены
 Члены
 Описание
 DynamicColumns
 Значение: 2. Динамические столбцы.
 NoColumns
 Значение: 0. Столбцы отсутствуют.
 StaticColumns
 Значение: 1. Статические столбцы.
 Описание
 Данное перечисление определяет типы текстовых столбцов (текстовых колонок).
 Ваши комментарии по поводу этого топика: Послать отзыв!