Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Helix.CreateHelix
 Послать отзыв
 Метод создает спираль с параметрами, установленными при предыдущих вызовах метода.
 Синтаксис
C#
Visual Basic
Копировать Код
public void CreateHelix();
Копировать Код
Public Sub CreateHelix()
 Описание
 Метод создает спираль с параметрами, установленными при предыдущих вызовах метода. Без вызова этого метода никакая геометрия на экране отображаться не будет.
 Ссылки
 Teigha.DatabaseServices.Helix, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!