Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Dimtdec
 Послать отзыв
 Синтаксис
C#
Visual Basic
public int Dimtdec;
Public Property Dimtdec() As Integer
 Описание
 Возвращает или устанавливает текущее значение DIMTDEC для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!