Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.SuppressLeadingZeros
 Послать отзыв
 Свойство управляет подавлением ведущих нулей в значениях размеров.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool SuppressLeadingZeros;
Копировать Код
Public Property SuppressLeadingZeros As Boolean
 Возвращает
 Возвращает true, если подавление включено. В противном случае возвращает false.
 Описание
 Свойство управляет подавлением ведущих нулей в значениях размеров. Используются основные единицы измерения.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!