Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObject.RemovePersistentReactor(ObjectId)
 Послать отзыв
 Метод удаляет указанный постоянный реактор из списка реакторов этого объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public void RemovePersistentReactor(ObjectId objId);
Копировать Код
Public Sub RemovePersistentReactor(objId As ObjectId)
 Параметры
 Параметры
 Описание
 ObjId
 Идентификатор постоянного реактора объекта. Тип ObjectId
 Описание
 Метод удаляет указанный постоянный реактор из списка реакторов этого объекта.
 Ссылки
 Teigha.DatabaseServices.DBObject, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!