Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Viewport.TwistAngle
 Послать отзыв
 Свойство TwistAngle представляет угол поворота данного видового экрана в системе координат дисплея (DCS).
 Синтаксис
C#
Visual Basic
Копировать Код
public double TwistAngle;
Копировать Код
Public Property TwistAngle As Double
 Возвращает
 Возвращает угол поворота видового экрана (в радианах) в плоскости дисплея. Тип double.
 Описание
 Свойство TwistAngle представляет угол поворота данного видового экрана в системе координат дисплея (DCS).
 Это вращение происходит в плоскости дисплея, т.е. вокруг направления от камеры к цели, которое всегда перпендикулярно плоскости дисплея. Углы отсчитываются против часовой стрелки от положительного направления оси X DCS, которая горизонтальна и направлена вправо.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Viewport, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!