Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.TableStyle.TextHeight
 Послать отзыв
 Метод позволяет получить высоту текста в указанном стиле ячейки.
 Синтаксис
C#
Visual Basic
Копировать Код
public double TextHeight( ref String cellStyle );
Копировать Код
Public Function TextHeight( ByRef cellStyle As String ) As Double
 Параметры
 Параметры
 Описание
 cellStyle
 Имя стиля ячейки. Тип String.
 Возвращает
 Возвращает высоту текста в ячейке. Тип double.
 Описание
 Метод позволяет получить высоту текста в указанном стиле ячейки.
 Ссылки
 Teigha.DatabaseServices.TableStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!