Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Spline.SetControlPointAt
 Послать отзыв
 Метод позволяет изменить координаты управляющей вершины данного сплайна с заданным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetControlPointAt( int index, Point3d point );
Копировать Код
Public Sub SetControlPointAt( index As Integer, point As Point3d )
 Параметры
 Параметры
 Описание
 index
 Индекс новой управляющей вершины. Тип int.
 point
 Новое положение управляющей вершины в мировой системе координат (WCS). Тип Point3d.
 Описание
 Метод позволяет изменить координаты управляющей вершины данного сплайна с заданным индексом.
 Ссылки
 Teigha.DatabaseServices.Spline, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!