Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Solid3d.ProjectOnToSolid
 Послать отзыв
 Метод предназначен для создания объектов проецированием указанного объекта в указанном направлении на данное 3D-тело. Созданные объекты не являются резидентными в базе данных.
 Синтаксис
C#
Visual Basic
Копировать Код
public Entity[] ProjectOnToSolid( ref Entity entityToProject, Vector3d projectionDirection );
Копировать Код
Public Function ProjectOnToSolid( ByRef entityToProject As Entity, projectionDirection As Vector3d ) As Entity()
 Параметры
 Параметры
 Описание
 entityToProject
 Проецируемый геометрический объект. Тип Entity.
 projectionDirection
 Направление проецирования. Тип Vector3d.
 Возвращает
 Возвращает массив геометрических объектов. Тип Entity[].
 Описание
 Метод предназначен для создания объектов проецированием указанного объекта в указанном направлении на данное 3D-тело. Созданные объекты не являются резидентными в базе данных.
 Если в качестве объекта проецирования указан объект Point, результатом проецирования будет объект Point, представляющий ближайшую точку на твердом теле в направлении проецирования.
 Этот метод реализован только в среде пространственного моделирования.
 Ссылки
 Teigha.DatabaseServices.Solid3d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!