Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.LinearEntity3d.ProjectedIntersectWith
 Послать отзыв
 Метод позволяет вычислить пересечение проекций данного объекта и указанного линейного объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d[] ProjectedIntersectWith( ref LinearEntity3d line, Vector3d projectionDirection );
Копировать Код
Public Function ProjectedIntersectWith( ByRef line As LinearEntity3d, projectionDirection As Vector3d ) As Point3d()
 Параметры
 Параметры
 Описание
 line
 Входной линейный объект. Тип LinearEntity3d.
 projectionDirection
 Направление проецирования. Тип Vector3d.
 Возвращает
 Возвращает массив точек пересечения из двух элементов. Тип Point3d[]. Элемент с индексом 0 представляет точку пересечения на данном объекте, а элемент с индексом 1 - точку на объекте line.
 Описание
 Метод позволяет вычислить пересечение проекций данного объекта и указанного линейного объекта. Метод находит на этих двух объектах такие точки, которые совпадают в проекции на плоскость, нормаль которой определяется вектором projectionDirection.
 Метод используется в основном в графических задачах, где projectionDirection представляет направление взгляда. В этом случае метод возвращает точки на двух линиях, в которых линии кажутся наблюдателю пересекающимися. Если в действительности линии не пересекаются, то вектор между двумя точками параллелен вектору projectionDirection.
 Используется вызов метода LinearEntity3d.ProjectedIntersectWith(LinearEntity3d line, Vector3d projectionDirection, Tolerance tolerance) с точностью, равной Tolerance.Global.
 Ссылки
 Teigha.Geometry.LinearEntity3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!