Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Cecolor
 Послать отзыв
 Синтаксис
C#
Visual Basic
public Colors::Color Cecolor;
Public Property Cecolor() As Colors.Color
 Описание
 Возвращает или устанавливает текущее значение CECOLOR для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!