Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Plane.Plane
 Послать отзыв
 Конструктор класса Plane. Создает экземпляр класса как копию указанной плоскости.
 Синтаксис
C#
Visual Basic
Копировать Код
public Plane( ref Plane source );
Копировать Код
Public Sub New( ByRef source As Plane )
 Параметры
 Параметры
 Описание
 source
 Входная плоскость. Тип Plane.
 Описание
 Конструктор класса Plane. Создает экземпляр класса как копию указанной плоскости source.
 Ссылки
 Teigha.Geometry.Plane, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!