Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.ToleranceSuppressZeroFeet
 Послать отзыв
 Свойство позволяет управлять подавлением отображения нулевого значения целых футов в отклонениях размеров, выраженных в основных единицах формата футы-дюймы.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool ToleranceSuppressZeroFeet;
Копировать Код
Public Property ToleranceSuppressZeroFeet As Boolean
 Возвращает
 Возвращает true, если подавление включено. В противном случае возвращает false.
 Описание
 Свойство позволяет включить или отключить подавление отображения нулевого значения целых футов в отклонениях размеров, выраженных в основных единицах формата футы-дюймы.
 Этот функционал работает только в случае, если для свойства Dimtol установлено значение true.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!