Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство BlockReference.DynamicBlockTableRecord
 Послать отзыв
 Синтаксис
C#
Visual Basic
public DatabaseServices::ObjectId DynamicBlockTableRecord;
Public Property DynamicBlockTableRecord() As DatabaseServices.ObjectId
 Описание
 Возвращает Id определения динамического блока (BlockTableRecord), если блок, на который указывает ссылка, является динамическим блоком.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.BlockReference, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!