Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Database.TimeZoneOffset
 Послать отзыв
 Синтаксис
C#
Visual Basic
public double TimeZoneOffset(DatabaseServices::TimeZone tz);
Public Function TimeZoneOffset(tz As DatabaseServices.TimeZone) As Double
 Параметры
 Параметры
 Описание
 tz
 Одна из часовых зон, находящихся в перечислении TimeZone
 Описание
 Эта функция возвращает смещение в часах от мирового времени (UTC/GMT) часовой зоны, заданной в параметре tz.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Исключения
 validInput : Возникает, если передается некорректное значение TimeZone Note Этот метод не влияет на текущие настройки часовой зоны базы данных.
 Ваши комментарии по поводу этого топика: Послать отзыв!