Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.EllipticalCylinder.EllipticalCylinder
 Послать отзыв
 Конструктор класса EllipticalCylinder. Создает экземпляр класса с указанными точкой начала координат, малым и большим радиусами, направляющими векторами оси симметрии цилиндра и его большой оси, интервалом высоты, а также начальным и конечным углами.
 Синтаксис
C#
Visual Basic
Копировать Код
public EllipticalCylinder( double minorRadius, double majorRadius, Point3d origin, Vector3d axisOfSymmetry, Vector3d referenceAxis, ref Interval height, double startAngle, double endAngle );
Копировать Код
Public Sub New( minorRadius As Double, majorRadius As Double, origin As Point3d, axisOfSymmetry As Vector3d, referenceAxis As Vector3d, ByRef height As Interval, startAngle As Double, endAngle As Double )
 Параметры
 Параметры
 Описание
 minorRadius
 Малый радиус эллиптического цилиндра. Тип double.
 majorRadius
 Большой радиус эллиптического цилиндра. Тип double.
 origin
 Начало координат эллиптического цилиндра. Тип Point3d.
 axisOfSymmetry
 Направляющий вектор оси симметрии цилиндра. Тип Vector3d.
 height
 Интервал высоты эллиптического цилиндра. Тип Interval.
 startAngle
 Начальный угол цилиндра. Тип double.
 endAngle
 Конечный угол цилиндра. Тип double.
 referenceAxis
 Направляющий вектор большой оси эллиптического цилиндра. Тип Vector3d.
 Описание
 Конструктор класса EllipticalCylinder. Создает экземпляр класса с указанными точкой начала координат, малым и большим радиусами, направляющими векторами оси симметрии цилиндра и его большой оси, интервалом высоты, а также начальным и конечным углами.
 Ссылки
 Teigha.Geometry.EllipticalCylinder, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!