Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.SetGridLineWeight
 Послать отзыв
 Метод позволяет задать толщину линии для заданного типа линии сетки и типа строки объекта Table.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetGridLineWeight( DatabaseServices.LineWeight lineWeight, int borders, int rows );
Копировать Код
Public virtual Sub SetGridLineWeight( lineWeight As DatabaseServices.LineWeight, borders As Integer, rows As Integer )
 Параметры
 Параметры
 Описание
 lineWeight
 Толщина линии из перечисления DatabaseServices.LineWeight.
 borders
 Типы линий сетки, для которых нужно изменить толщины линий.
 rows
 Тип строки, для которой изменяется толщина линии, int. См. перечисление RowType.
 Описание
 Метод позволяет задать толщину линии для заданного типа линии сетки и типа строки объекта Table. Можно комбинировать различные типы линий и типы строк таблицы.
 Замечания
 Для получения того же результата предпочтительнее использовать функционал объекта Cell.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!