Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve3d.GetOrthoProjectEntity
 Послать отзыв
 Метод позволяет получить геометрический объект, являющийся ортогональной проекцией кривой на заданную плоскость.
 Синтаксис
C#
Visual Basic
Копировать Код
public Entity3d GetOrthoProjectEntity( ref Plane projectionPlane );
Копировать Код
Public Function GetOrthoProjectEntity( ByRef projectionPlane As Plane ) As Entity3d
 Параметры
 Параметры
 Описание
 projectionPlane
 Плоскость, на которую выполняется проецирование. Тип Plane.
 Возвращает
 Возвращает спроецированный объект. Тип Entity3d.
 Описание
 Метод позволяет получить геометрический объект, являющийся ортогональной проекцией кривой на заданную плоскость. Вызывается метод Curve3d.GetOrthoProjectEntity(Plane projectionPlane, Tolerance tolerance) с точностью, равной Tolerance.Global.
 Ссылки
 Teigha.Geometry.Curve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!