Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbCurve3d.NurbCurve3d
 Послать отзыв
 Конструктор класса NurbCurve3d.
 Синтаксис
C#
Visual Basic
Копировать Код
public NurbCurve3d( ref Point3dCollection fitPoints, ref Vector3dCollection fitTangents, bool periodic );
Копировать Код
Public Sub New( ByRef fitPoints As Point3dCollection, ByRef fitTangents As Vector3dCollection, periodic As Boolean )
 Параметры
 Параметры
 Описание
 fitPoints
 Массив определяющих точек для интерполирующей кривой. Тип Point3dCollection.
 fitTangents
 Векторы, интерполирующие производные кривой в определяющих точках. Тип Vector3dCollection.
 periodic
 Флаг, определяющий, должна ли создаваемая кривая быть периодической (замкнутой). Тип bool.
 Описание
 Конструктор класса NurbCurve3d. Создает трехмерную полиномиальную кривую, которая интерполирует заданный массив трехмерных точек. Используется вызов NurbCurve3d.NurbCurve3d(ref Point3dCollection fitPoints, ref Vector3dCollection fitTangents, Tolerance fitTolerance, bool periodic) с точностью, равной Tolerance.Global.
 Замечания
 Если флаг periodic равен true, должны совпадать первая и последняя определяющие точки в коллекции fitPoints, а также первый и последний векторы производных в коллекции fitTangents.
 Ссылки
 Teigha.Geometry.NurbCurve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!