Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SubDMesh.SetSubentMaterialMapper
 Послать отзыв
 Метод задает сопоставитель (мэппер) для заданного подобъекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetSubentMaterialMapper( SubentityId subentId, ref Mapper mapper );
Копировать Код
Public Sub SetSubentMaterialMapper( subentId As SubentityId, ByRef mapper As Mapper )
 Параметры
 Параметры
 Описание
 subentId
 Идентификатор подобъекта. Тип SubentityId.
 mapper
 Сопоставитель (мэппер) материалов. Тип Mapper.
 Описание
 Метод задает сопоставитель (мэппер) для заданного подобъекта.
 Ссылки
 Teigha.DatabaseServices.SubDMesh, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!