Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DwgFiler.ReadHandle
 Послать отзыв
 Метод предназначен для получения дескриптора объекта Handle из текущего элемента этого объекта Filer.
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract Handle ReadHandle();
Копировать Код
Public MustOverride Function ReadHandle() As Handle
 Возвращает
 Возвращает дескриптора объекта. Тип Handle.
 Описание
 Метод предназначен для получения дескриптора объекта Handle из текущего элемента этого объекта Filer.
 Ссылки
 Teigha.DatabaseServices.DwgFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!