Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector2d.Angle
 Послать отзыв
 Свойство Angle представляет угол между данным вектором и осью X.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Angle;
Копировать Код
Public ReadOnly Property Angle As Double
 Возвращает
 Возвращает угол в радианах между данным вектором и осью X в диапазоне [0, 2 * Pi]. Тип double.
 Описание
 Свойство Angle представляет угол между данным вектором и осью X в диапазоне [0, 2 * Pi].
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.Vector2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!