Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Section.IndicatorTransparency
 Послать отзыв
 Свойство IndicatorTransparency представляет прозрачность индикатора секущей плоскости в интервале [1–100].
 Синтаксис
C#
Visual Basic
Копировать Код
public int IndicatorTransparency;
Копировать Код
Public Property IndicatorTransparency As Integer
 Возвращает
 Возвращает прозрачность индикатора. Тип int.
 Описание
 Свойство IndicatorTransparency представляет прозрачность индикатора секущей плоскости в интервале [1–100].
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Section, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!