Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Material.ReflectanceScale
 Послать отзыв
 Свойство представляет коэффициент отражения данного материала.
 Синтаксис
C#
Visual Basic
Копировать Код
public double ReflectanceScale;
Копировать Код
Public Property ReflectanceScale As Double
 Возвращает
 Возвращает коэффициент отражения материала. Тип double.
 Описание
 Свойство представляет коэффициент отражения данного материала.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Material, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!