Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DxfFiler.ReadScale3d
 Послать отзыв
 Метод возвращает значение масштаба из текущего элемента этого объекта Filer.
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract Scale3d ReadScale3d();
Копировать Код
Public MustOverride Function ReadScale3d() As Scale3d
 Возвращает
 Возвращает масштаб. Тип Scale3d.
 Описание
 Метод возвращает значение масштаба Scale3d из текущего элемента этого объекта Filer.
 Ссылки
 Teigha.DatabaseServices.DxfFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!