Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CircularArc2d
 Послать отзыв
 Класс CircularArc2d представляет окружности и круглые дуги в двумерном пространстве.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Geometry::Entity2d Teigha::Geometry::Curve2d Teigha::Geometry::CircularArc2d
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdGeCircArc2d")] public sealed class CircularArc2d : Curve2d
Копировать Код
<Wrapper("OdGeCircArc2d")> Public NotInheritable Class CircularArc2d Inherits Curve2d
 Описание
 Класс CircularArc2d представляет окружности и круглые дуги в двумерном пространстве.
 Методы
 Конструкторы
 Teigha.Geometry.CircularArc2d
 Имя
 Описание
 CircularArc2d
 Это обзор перегрузок CircularArc2d.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Geometry.Entity2d
 Имя
 Описание
 Entity2d Методы
 Ниже перечислены методы класса Entity2d.
 Teigha.Geometry.Curve2d
 Имя
 Описание
 Curve2d Методы
 Ниже перечислены методы класса Curve2d.
 Curve2d Свойства
 Ниже перечислены свойства класса Curve2d.
 Teigha.Geometry.CircularArc2d
 Имя
 Описание
 CircularArc2d Методы
 Ниже перечислены методы класса CircularArc2d.
 CircularArc2d Свойства
 Ниже перечислены свойства класса CircularArc2d.
 Ссылки
 CircularArc2d Конструктор, CircularArc2d Методы, CircularArc2d Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!