Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector3d.RotateBy
 Послать отзыв
 Метод создает трехмерный вектор, который образуется в результате вращения данного вектора вокруг заданной оси на заданный угол.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d RotateBy( double angle, Vector3d axis );
Копировать Код
Public Function RotateBy( angle As Double, axis As Vector3d ) As Vector3d
 Параметры
 Параметры
 Описание
 angle
 Угол поворота в радианах. Тип double.
 axis
 Направляющий вектор оси вращения. Тип Vector3d.
 Возвращает
 Возвращает трехмерный вектор. Тип Vector3d.
 Описание
 Метод создает трехмерный вектор, который образуется в результате вращения данного вектора вокруг заданного направления axis на заданный угол angle. Ось вращения проходит через начало координат. Положительное направление отсчета углов поворота определяется правилом правой руки.
 Ссылки
 Teigha.Geometry.Vector3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!