Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Leader.Normal
 Послать отзыв
 Синтаксис
C#
Visual Basic
public Vector3d Normal;
Public Property Normal() As Vector3d
 Описание
 Возвращает единичный нормальный вектор выноски.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.Leader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!