Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve2d.HasStartPoint
 Послать отзыв
 Свойство HasStartPoint позволяет проверить, существует ли у данной кривой начальная точка.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool HasStartPoint;
Копировать Код
Public ReadOnly Property HasStartPoint As Boolean
 Возвращает
 Возвращает true, если у данной кривой начальная точка существует. В противном случае возвращает false.
 Описание
 Свойство HasStartPoint позволяет проверить, существует ли у данной кривой начальная точка. Значение false означает, что параметрический интервал кривой не ограничен снизу.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.Curve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!