Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocAction.AddMoreObjectsToDeepClone
 Послать отзыв
 Метод позволяет добавить в процесс глубокого клонирования дополнительные объекты, которые ассоциативно связаны с уже клонированными объектами.
 Синтаксис
C#
Visual Basic
Копировать Код
public void AddMoreObjectsToDeepClone( ref IdMapping idMap, ref ObjectIdCollection additionalObjectsToClone );
Копировать Код
Public Sub AddMoreObjectsToDeepClone( ByRef idMap As IdMapping, ByRef additionalObjectsToClone As ObjectIdCollection )
 Параметры
 Параметры
 Описание
 idMap
 Объект IdMapping текущей сессии глубокого клонирования.
 additionalObjectsToClone
 Коллекция дополнительных объектов, которые требуется включить в процесс глубокого клонирования. Разрешается добавлять уже клонированные объекты; они будут проигнорированы во избежание повторного клонирования. Тип ObjectIdCollection.
 Описание
 Метод позволяет добавить в процесс глубокого клонирования дополнительные объекты, которые ассоциативно связаны с уже клонированными объектами. Метод вызывается непосредственно перед завершением основного цикла глубокого клонирования (перед уведомлением реактора Teigha.DatabaseServices.Database.BeginDeepCloneTranslation()), когда объекты уже клонированы, но их идентификаторы еще не транслированы.
 Метод опрашивает действия, у которых есть зависимости AssocDependency с клонируемыми объектами, требуется ли действиям включить какие-либо дополнительные объекты в процесс глубокого клонирования. В этот момент действия могут сообщить о дополнительных объектах, подлежащих глубокому клонированию, и основной цикл клонирования продолжит глубокое клонирование этих добавленных объектов. Если количество клонируемых объектов возросло, опрашиваются действия, ассоциативно связанные с этими вновь клонированными объектами, что может привести к дальнейшему расширению списка клонируемых объектов. Этот рекурсивный процесс продолжается до тех пор, пока объекты для клонирования не закончатся.
 Если действие владеет объектом AssocActionBody, который переопределяет обратный вызов AddMoreObjectsToDeepCloneOverride(), вызывается этот переопределенный обратный вызов.
 Ссылки
 Teigha.DatabaseServices.AssocAction, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!