Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeaderStyle.BlockColor
 Послать отзыв
 Свойство представляет цвет, предусмотренный данным стилем для отрисовки содержимого блока мультивыноски.
 Синтаксис
C#
Visual Basic
Копировать Код
public Teigha.Colors.Color BlockColor;
Копировать Код
Public Property BlockColor As Teigha.Colors.Color
 Возвращает
 Возвращает цвет блока. Тип Teigha.Colors.Color.
 Описание
 Свойство представляет цвет, предусмотренный данным стилем для отрисовки содержимого блока мультивыноски.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MLeaderStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!