Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve2d.GetDistanceTo
 Послать отзыв
 Метод вычисляет расстояние между ближайшими точками на этой кривой и указанной кривой с заданной точностью.
 Синтаксис
C#
Visual Basic
Копировать Код
public double GetDistanceTo( ref Curve2d curve, Tolerance tolerance );
Копировать Код
Public Function GetDistanceTo( ByRef curve As Curve2d, tolerance As Tolerance ) As Double
 Параметры
 Параметры
 Описание
 curve
 Входная кривая. Тип Curve2d.
 tolerance
 Входная геометрическая точность. Тип Tolerance.
 Возвращает
 Возвращает минимальное расстояние между точками на обеих кривых. Тип double.
 Описание
 Метод вычисляет расстояние между ближайшими точками на этой кривой и указанной кривой с заданной точностью.
 Ссылки
 Teigha.Geometry.Curve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!