Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.CreateContent
 Послать отзыв
 Метод предназначен для создания в ячейке дополнительного содержимого.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual int CreateContent( int row, int column, int contentIndex );
Копировать Код
Public virtual Function CreateContent( row As Integer, column As Integer, contentIndex As Integer ) As Integer
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 contentIndex
 Индекс содержимого ячейки. Значение должно быть больше или равно нулю и меньше количества элементов содержимого в ячейке.
 col
 Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
 Возвращает
 Возвращает индекс созданного элемента содержимого. Тип int.
 Описание
 Метод предназначен для создания в ячейке дополнительного содержимого; один элемент создается по умолчанию.
 Замечания
 Для получения того же результата предпочтительнее использовать методы Table.Cells[row,column].Contents.Add или InsertAt.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!