Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocEvaluationCallback.BeginActionEvaluation
 Послать отзыв
 Метод реализует уведомление о том, что началось вычисление ассоциативного действия. Не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public void BeginActionEvaluation( ref AssocAction action );
Копировать Код
Public Sub BeginActionEvaluation( ByRef action As AssocAction )
 Параметры
 Параметры
 Описание
 action
 Вычисляемое ассоциативное действие. Тип AssocAction.
 Описание
 Метод реализует уведомление о том, что началось вычисление ассоциативного действия. Этот обратный вызов выполняется внутри метода AssocAction.Evaluate() и не должен вызываться из отдельных вызовов метода EvaluateOverride().
 На данный момент не реализован.
 Ссылки
 Teigha.DatabaseServices.AssocEvaluationCallback, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!