Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Point3d.GetHashCode
 Послать отзыв
 Метод позволяет получить хеш-код для данного объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public int GetHashCode();
Копировать Код
Public Function GetHashCode() As Integer
 Возвращает
 Возвращает хеш-код в виде целочисленного значения, которое уникально для каждого экземпляра этого класса. Тип int.
 Описание
 Метод позволяет получить хеш-код для данного объекта.
 Ссылки
 Teigha.Geometry.Point3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!