Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeaderStyle.TextAlignAlwaysLeft
 Послать отзыв
 Свойство позволяет указать, что создаваемый многострочный текст должен всегда выравниваться по левому краю.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool TextAlignAlwaysLeft;
Копировать Код
Public Property TextAlignAlwaysLeft As Boolean
 Возвращает
 Возвращает true, если стиль предусматривает выравнивание текста по левому краю. В противном случае возвращает false.
 Описание
 Свойство позволяет указать, что создаваемый многострочный текст должен всегда выравниваться по левому краю.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MLeaderStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!