Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SubentityId.Type
 Послать отзыв
 Свойство Type представляет тип подобъекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public SubentityType Type;
Копировать Код
Public ReadOnly Property Type As SubentityType
 Возвращает
 Возвращает тип подобъекта. Тип SubentityType.
 Описание
 Свойство Type представляет тип подобъекта.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.SubentityId, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!