Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Событие Database.AbortDxfIn
 Послать отзыв
 Синтаксис
C#
Visual Basic
public event EventHandler AbortDxfIn;
Public Event AbortDxfIn As EventHandler
 Описание
 Событие показывает, что операция восстановления базы данных чертежа снята и не завершилась.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!