Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CellContent.IsAutoScale
 Послать отзыв
 Свойство IsAutoScale позволяет определить состояние флага автомасштабирования содержимого ячейки таблицы.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsAutoScale;
Копировать Код
Public Property IsAutoScale As Boolean
 Возвращает
 Возвращает true, если флаг автомасштабирования содержимого ячейки установлен. В противном случае возвращает false.
 Описание
 Свойство IsAutoScale позволяет определить состояние флага автомасштабирования содержимого ячейки таблицы. Если этот флаг установлен, то при размещении блока в ячейке объект Table автоматически вычисляет масштаб и точку вставки для содержимого блока.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.CellContent, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!