Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.TableStyle.Template
 Послать отзыв
 Свойство Template представляет шаблон данного табличного стиля.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual DatabaseServices.ObjectId Template;
Копировать Код
Public Overridable ReadOnly Property Template As DatabaseServices.ObjectId
 Возвращает
 Возвращает идентификатор шаблона табличного стиля. Тип DatabaseServices.ObjectId.
 Описание
 Свойство Template представляет шаблон данного табличного стиля. Может принимать значение NULL.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.TableStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!