Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PatternDefinition.BaseY
 Послать отзыв
 Свойство представляет y-координату базовой точки.
 Синтаксис
C#
Visual Basic
Копировать Код
public double BaseY;
Копировать Код
Public ReadOnly Property BaseY As Double
 Возвращает
 Возвращает y-координату базовой точки. Тип double.
 Описание
 Свойство представляет y-координату базовой точки.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.PatternDefinition, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!