Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 BlockTableRecord.Comments
 Послать отзыв
 Свойство предназначено для хранения текстовых данных, относящихся к этому определению блока.
 Синтаксис
C#
Visual Basic
Копировать Код
public string Comments { get; set; }
Копировать Код
Public Property Comments As String
 Возвращает
 Возвращает string.
 Описание
 Свойство предназначено для хранения текстовых данных, относящихся к этому определению блока.
 Текстовыми данными могут быть, например, описание блока, комментарии о его особенностях, инструкция по его использованию и прочее.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.BlockTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!