Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.Dimclrd
 Послать отзыв
 Свойство задает или возвращает цвет выносок, стрелок, а также размерных линий и выносных линий.
 Синтаксис
C#
Visual Basic
Копировать Код
public Colors.Color Dimclrd;
Копировать Код
Public Property Dimclrd As Colors.Color
 Возвращает
 Возвращает цвет указанных объектов чертежа. Тип Colors.Color.
 Описание
 Свойство задает или возвращает цвет выносок, стрелок, а также размерных линий и выносных линий.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!