Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.MergeCells
 Послать отзыв
 Метод предназначен для объединения ячеек в указанном диапазоне.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void MergeCells( ref CellRange range );
Копировать Код
Public virtual Sub MergeCells( ByRef range As CellRange )
 Параметры
 Параметры
 Описание
 range
 Диапазон объединяемых ячеек. Тип CellRange.
 Описание
 Метод предназначен для объединения ячеек в указанном диапазоне.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!