Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 DimStyleTableRecord.Dimse2
 Послать отзыв
 Свойство предназначено для контроля подавления второй выносной линии.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual bool Dimse2 { get; set; }
Копировать Код
Public Overridable Property Dimse2 As Boolean
 Возвращает
 Возвращает тип данных bool.
 Описание
 В свойстве хранится настройка подавления второй выносной линии.
 Свойство принимает в качестве значения тип данных bool:
false – не подавляется (по умолчанию);
true – подавляется.
 Свойство также доступно через системную переменную DIMSE2 и пользовательское меню в окне изменения/создания размерного стиля:
  При изменении системной переменной DIMSE2 будет создан новый размерный стиль под названием <переопределение> на основе текущего с новым значением DIMSE2.
 Условия
 Чтение и запись.
 Пример
 Пример подавления второй выносной линии (изменения значения свойства Dimse2) в размерном стиле Standard:
C#
 Копировать Код
public partial class Commands { [Teigha.Runtime.CommandMethod("Dimse2Change")] public void Dimse2StandardDimStyle() { // Получение ссылки на активный документ HostMgd.ApplicationServices.Document doc = HostMgd.ApplicationServices.Application.DocumentManager.MdiActiveDocument; // Получение ссылки на редактор документа HostMgd.EditorInput.Editor ed = doc.Editor; // Получение ссылки на базу данных документа Teigha.DatabaseServices.Database db = doc.Database; // Начало транзакции с базой данных документа using (Teigha.DatabaseServices.Transaction trans = db.TransactionManager.StartTransaction()) { // Открываем таблицу размерных стилей для чтения Teigha.DatabaseServices.DimStyleTable dimStyleTable = trans.GetObject(db.DimStyleTableId, Teigha.DatabaseServices.OpenMode.ForRead) as Teigha.DatabaseServices.DimStyleTable; // Находим в таблице размерных стилей ObjectId нужного стиля по его названию Teigha.DatabaseServices.ObjectId styleId = dimStyleTable["Standard"]; // Открываем таблицу размерного стиля для изменений Teigha.DatabaseServices.DimStyleTableRecord obj = trans.GetObject(styleId, Teigha.DatabaseServices.OpenMode.ForWrite) as Teigha.DatabaseServices.DimStyleTableRecord; ed.WriteMessage($"nDime2 before: {obj.Dimse2}"); // Изменяем признак подавления второй выносной линии obj.Dimse2 = true; ed.WriteMessage($"nDimse2 after: {obj.Dimse2}"); trans.Commit(); } } }
 Результат работы команды Dimse2Change:
 Было:
 Стало:
 Ссылки
 Teigha.DatabaseServices.DimStyleTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!