Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Viewport.SetViewDirection
 Послать отзыв
 Метод позволяет задать в данном видовом экране предопределенную ориентацию вида из набора ортогональных видов. Не реализован.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetViewDirection( OrthographicView view );
Копировать Код
Public Sub SetViewDirection( view As OrthographicView )
 Параметры
 Параметры
 Описание
 view
 Тип ортогонального вида. Перечисление OrthographicView.
 Описание
 Метод позволяет задать в данном видовом экране предопределенную ориентацию вида из набора ортогональных видов. В текущей версии не реализован.
 Ссылки
 Teigha.DatabaseServices.Viewport, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!