Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Filters.SpatialFilter.OriginalInverseBlockTransform
 Послать отзыв
 Свойство OriginalInverseBlockTransform возвращает обратное геометрическое преобразование блока для связанного вхождения блока BlockReference, когда данный пространственный фильтр был задан в последний раз.
 Синтаксис
C#
Visual Basic
Копировать Код
public Matrix3d OriginalInverseBlockTransform;
Копировать Код
Public ReadOnly Property OriginalInverseBlockTransform As Matrix3d
 Возвращает
 Возвращает обратное геометрическое преобразование блока. Тип Matrix3d.
 Описание
 Свойство OriginalInverseBlockTransform возвращает обратное геометрическое преобразование блока для связанного вхождения блока BlockReference, когда данный пространственный фильтр был задан в последний раз.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Filters.SpatialFilter, Teigha.DatabaseServices.Filters
 Ваши комментарии по поводу этого топика: Послать отзыв!