Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeaderStyle.LandingGap
 Послать отзыв
 Свойство представляет величину зазора между концом линии полки и многострочным текстом мультивыноски.
 Синтаксис
C#
Visual Basic
Копировать Код
public double LandingGap;
Копировать Код
Public Property LandingGap As Double
 Возвращает
 Возвращает величину зазора. Тип double.
 Описание
 Свойство представляет величину зазора между концом линии полки и многострочным текстом мультивыноски.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MLeaderStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!