Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CurveBoundaryData
 Послать отзыв
 Структура CurveBoundaryData представляет данные, которые определяют объект CurveBoundary.
 Иерархия классов
Teigha::Geometry::CurveBoundaryData
 Синтаксис
C#
Visual Basic
Копировать Код
public struct CurveBoundaryData
Копировать Код
Public Structure CurveBoundaryData
 Описание
 Структура CurveBoundaryData представляет данные, которые определяют объект CurveBoundary.
 Топики
 Имя
 Описание
 CurveBoundaryData Методы
 Ниже перечислены методы класса CurveBoundaryData.
 CurveBoundaryData Операторы
 Ниже перечислены операторы класса CurveBoundaryData.
 CurveBoundaryData Свойства
 Ниже перечислены свойства класса CurveBoundaryData.
 Ссылки
 CurveBoundaryData Методы, CurveBoundaryData Операторы, CurveBoundaryData Свойства, Топики, CurveBoundaryData Методы, CurveBoundaryData Операторы, CurveBoundaryData Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!