Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.LinearEntity3d.Direction
 Послать отзыв
 Свойство Direction представляет единичный направляющий вектор данного линейного объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3d Direction;
Копировать Код
Public ReadOnly Property Direction As Vector3d
 Возвращает
 Возвращает единичный направляющий вектор данного объекта. Тип Vector3d.
 Описание
 Свойство Direction представляет направляющий вектор данного линейного объекта. Этот вектор является единичным и ориентирован в направлении увеличения значения параметра.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.LinearEntity3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!