Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocArrayCommonParameters.GetRowElevation
 Послать отзыв
 Метод извлекает приращение отметок между рядами массива.
 Синтаксис
C#
Visual Basic
Копировать Код
public double GetRowElevation( out String expression, out String evaluatorId );
Копировать Код
Public Function GetRowElevation( ByRef expression As out String, ByRef evaluatorId As out String ) As Double
 Параметры
 Параметры
 Описание
 expression
 Выражение для параметра. Тип String.
 evaluatorId
 Полученное строковое представление идентификатора вычислителя. Тип String.
 Возвращает
 Возвращает приращение отметок между рядами массива. Тип double.
 Описание
 Метод извлекает приращение отметок между рядами массива. Если для параметра выражение отсутствует, то после выполнения метода строки expression и evaluatorId после выполнения метода остаются пустыми.
 Ссылки
 Teigha.DatabaseServices.AssocArrayCommonParameters, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!