Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SymbolUtilityServices.GetLayerDefpointsId
 Послать отзыв
 Метод предоставляет идентификатор объекта слоя "DEFPOINTS" в указанной базе данных.
 Синтаксис
C#
Visual Basic
Копировать Код
public static ObjectId GetLayerDefpointsId( ref Database database );
Копировать Код
Public Shared Function GetLayerDefpointsId( ByRef database As Database ) As ObjectId
 Параметры
 Параметры
 Описание
 database
 База данных, из которой извлекается идентификатор объекта. Тип Database.
 Возвращает
 Возвращает ненулевой идентификатор слоя "DEFPOINTS" в базе данных database. Тип ObjectId.
 Описание
 Метод предоставляет идентификатор объекта слоя "DEFPOINTS" в указанной базе данных.
 Ссылки
 Teigha.DatabaseServices.SymbolUtilityServices, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!