Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Entity.ExplodeGeometryToBlock(BlockTableRecord)
 Послать отзыв
 Метод разбивает этот объект на набор более простых объектов и добавляет их в указанный блок.
 Синтаксис
C#
Visual Basic
Копировать Код
public void ExplodeGeometryToBlock(BlockTableRecord btr);
Копировать Код
Public Sub ExplodeGeometryToBlock(btr As BlockTableRecord)
 Параметры
 Параметры
 Описание
 btr
 Блок, в который будет добавлен набор объектов, полученных в результате разбиения данного. Тип BlockTableRecord
 Описание
 Метод разбивает объект на подобъекты и добавляет их в указанных блок. Созданные объекты являются или не являются резидентами базы данных, в зависимости от владельца BlockTableRecord. Если BlockTableRecord является резидентом базы данных, то созданные объекты также будут резидентами базы данных. Если BlockTableRecord не является резидентом базы данных, то созданные объекты также не будут резидентами базы данных.
 Стандартная реализация этой функции вызывает subWorldDraw() и создает сущности из геометрии, сгенерированной subWorldDraw(). Этот метод может быть переопределен в пользовательских классах.
 Ссылки
 Teigha.DatabaseServices.Entity, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!