Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SubentRef.SubentId
 Послать отзыв
 Свойство SubentId возвращает идентификатор подобъекта SubentityId, который представлен данной ссылкой SubentRef.
 Синтаксис
C#
Visual Basic
Копировать Код
public SubentityId SubentId;
Копировать Код
Public Property SubentId() As SubentityId
 Возвращает
 Возвращает идентификатор подобъекта. Тип SubentityId.
 Описание
 Свойство SubentId возвращает идентификатор подобъекта SubentityId, который представлен данной ссылкой SubentRef.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.SubentRef, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!