Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Entity2d.IsOn
 Послать отзыв
 Метод позволяет проверить, лежит ли указанная точка на данном объекте. Используется геометрическая точность по умолчанию.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsOn( Point2d point );
Копировать Код
Public Function IsOn( point As Point2d ) As Boolean
 Параметры
 Параметры
 Описание
 point
 Проверяемая точка. Тип Point2d.
 Возвращает
 Возвращает true, если в рамках используемой точности точка point лежит на данном объекте. В противном случае возвращает false.
 Описание
 Метод позволяет проверить, лежит ли указанная точка на данном объекте. Вызывается метод Entity2d.IsOn(Point2d point, Tolerance tolerance) с использованием геометрической точности по умолчанию, равная Tolerance.Global.
 Ссылки
 Teigha.Geometry.Entity2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!