Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.SetCellState
 Послать отзыв
 Метод позволяет установить состояние ячейки.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetCellState( int row, int column, CellStates cellState );
Копировать Код
Public virtual Sub SetCellState( row As Integer, column As Integer, cellState As CellStates )
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 cellState
 Новое состояние ячейки из перечисления Teigha.DatabaseServices.CellStates.
 col
 Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
 Описание
 Метод позволяет установить состояние ячейки.
 Замечания
 Данный метод не влияет на внутренние состояния ячеек, которые нельзя изменить (например, CellStateLinked).
 Для получения того же результата предпочтительнее использовать Table.Cells[row,column].State.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!