Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 DimStyleTableRecord.Dimtih
 Послать отзыв
 Свойство отвечает за настройку ориентации размерного текста для всех типов размеров, кроме ординатных, если текст вписывается внутри выносных линий.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual bool Dimtih { get; set; }
Копировать Код
Public Overridable Property Dimtih As Boolean
 Возвращает
 Возвращает тип данных bool.
 Описание
 В свойстве хранится текущая настройка ориентации размерного текста для всех типов размеров, кроме ординатных, если размерный текст вписывается внутри выносных линий. В качестве значения свойства доступны следующие:
false – выравнивание по линии измерения, вдоль размерной линии;
true – горизонтально (по умолчанию).
 Свойство также доступно через системную переменную DIMTIH и пользовательское меню в окне изменения/создания размерного стиля:
  При изменении системной переменной DIMTIH будет создан новый размерный стиль под названием <переопределение> на основе текущего с новым значением DIMTIH.
 Условия
 Чтение и запись.
 Пример
 Пример изменения настройки ориентации размерного текста (значения свойства Dimtih) в размерном стиле Standard:
C#
 Копировать Код
public partial class Commands { [Teigha.Runtime.CommandMethod("DimtihChange")] public void DimtihStandardDimStyle() { // Получение ссылки на активный документ HostMgd.ApplicationServices.Document doc = HostMgd.ApplicationServices.Application.DocumentManager.MdiActiveDocument; // Получение ссылки на редактор документа HostMgd.EditorInput.Editor ed = doc.Editor; // Получение ссылки на базу данных документа Teigha.DatabaseServices.Database db = doc.Database; // Начало транзакции с базой данных документа using (Teigha.DatabaseServices.Transaction trans = db.TransactionManager.StartTransaction()) { // Открываем таблицу размерных стилей для чтения Teigha.DatabaseServices.DimStyleTable dimStyleTable = trans.GetObject(db.DimStyleTableId, Teigha.DatabaseServices.OpenMode.ForRead) as Teigha.DatabaseServices.DimStyleTable; // Находим в таблице размерных стилей ObjectId нужного стиля по его названию Teigha.DatabaseServices.ObjectId styleId = dimStyleTable["Standard"]; // Открываем таблицу размерного стиля для изменений Teigha.DatabaseServices.DimStyleTableRecord obj = trans.GetObject(styleId, Teigha.DatabaseServices.OpenMode.ForWrite) as Teigha.DatabaseServices.DimStyleTableRecord; ed.WriteMessage($"nDimtih before: {obj.Dimtih}"); // Изменяем ориентацию размерного текста obj.Dimtih = false; ed.WriteMessage($"nDimtih after: {obj.Dimtih}"); trans.Commit(); } } }
 Результат работы команды DimtihChange:
 Было:
 Стало:
 Ссылки
 Teigha.DatabaseServices.DimStyleTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!