Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector3dCollection.IndexOf
 Послать отзыв
 Метод определяет индекс конкретного элемента в коллекции, в котором хранится указанный объект Vector3d.
 Синтаксис
C#
Visual Basic
Копировать Код
public int IndexOf( Vector3d value );
Копировать Код
Public Function IndexOf( value As Vector3d ) As Integer
 Параметры
 Параметры
 Описание
 value
 Входной объект. Тип Vector3d.
 Возвращает
 Возвращает индекс объекта value в данной коллекции. Тип int. Если объект в коллекции отсутствует, возвращается значение -1.
 Описание
 Метод определяет индекс конкретного элемента коллекции, в котором хранится указанный объект Vector3d.
 Ссылки
 Teigha.Geometry.Vector3dCollection, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!