Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SectionSettings.LinetypeScale
 Послать отзыв
 Метод позволяет получить масштаб типа линий, который используется для геометрии указанного типа.
 Синтаксис
C#
Visual Basic
Копировать Код
public double LinetypeScale( SectionType nSecType, SectionGeometry nGeometry );
Копировать Код
Public Function LinetypeScale( nSecType As SectionType, nGeometry As SectionGeometry ) As Double
 Параметры
 Параметры
 Описание
 nSecType
 Тип сечения. Перечисление SectionType.
 nGeometry
 Типы элементов геометрии сечения. Перечисление SectionGeometry.
 Возвращает
 Возвращает значение масштаба типа линий. Тип double.
 Описание
 Метод позволяет получить значение масштаба типа линий, который используется для геометрии указанного типа.
 Ссылки
 Teigha.DatabaseServices.SectionSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!