Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство TextStyleTableRecord.TextSize
 Послать отзыв
 Синтаксис
C#
Visual Basic
public double TextSize;
Public Property TextSize() As Double
 Описание
 Возвращает размер текста по умолчанию для текстов, отображаемых с помощью данного текстового стиля.
 Если эта величина равна 0, то каждое использование команд nanoСAD TEXT и DTEXT приглашает ввести высоту текста для использования в создаваемом текстовом объекте. Если свойство textsize не равно 0, то команды TEXT и DTEXT приглашения не выдают и в качестве высоты текста используется значение textsize.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.TextStyleTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!