Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.SetDataType
 Послать отзыв
 Метод позволяет задать в ячейке тип данных элемента содержимого с указанным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetDataType( int row, int column, int contentIndex, DataTypeParameter dataType );
Копировать Код
Public virtual Sub SetDataType( row As Integer, column As Integer, contentIndex As Integer, dataType As DataTypeParameter )
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 contentIndex
 Индекс элемента содержимого ячейки, тип int. Индекс должен быть больше или равен нулю и меньше количества элементов содержимого в ячейке.
 dataType
 Тип данных, которые следует установить в ячейке. Тип DataTypeParameter.
 col
 Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
 Описание
 Метод позволяет задать в ячейке тип данных элемента содержимого с указанным индексом.
 Замечания
 Для получения того же результата предпочтительнее использовать Table.Cells[row,column].Contents[i].DataType.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!