Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DataType
 Послать отзыв
 Данное перечисление определяет допустимые типы данных.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum DataType { Buffer = 128, Date = 8, Double = 2, General = 512, Long = 1, ObjectId = 64, Point = 16, Point3d = 32, Resbuf = 256, String = 4, Unknown = 0 }
Копировать Код
Public Enum DataType Buffer = 128 Date = 8 Double = 2 General = 512 Long = 1 ObjectId = 64 Point = 16 Point3d = 32 Resbuf = 256 String = 4 Unknown = 0 End Enum
 Члены
 Члены
 Описание
 Unknown
 Значение: 0. Неизвестный тип данных.
 Long
 Значение: 1. Длинное целое число.
 Double
 Значение: 2. Число с плавающей точкой двойной точности.
 String
 Значение: 4. Строка.
 Date
 Значение: 8. Дата.
 Point
 Значение: 16. Точка.
 Point3d
 Значение: 32. Трехмерная точка.
 ObjectId
 Значение: 64. Идентификатор объекта.
 Buffer
 Значение: 128. Буфер.
 Resbuf
 Значение: 256. Буфер результатов.
 General
 Значение: 512. Общий тип данных.
 Описание
 Данное перечисление определяет допустимые типы данных.
 Ваши комментарии по поводу этого топика: Послать отзыв!