Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.SurfaceSurfaceIntersectorConfigurations
 Послать отзыв
 Структура SurfaceSurfaceIntersectorConfigurations предназначена для хранения данных о конфигурации каждой из двух пересекающихся поверхностей в окрестности кривой пересечения.
 Иерархия классов
Teigha::Geometry::SurfaceSurfaceIntersectorConfigurations
 Синтаксис
C#
Visual Basic
Копировать Код
public struct SurfaceSurfaceIntersectorConfigurations
Копировать Код
Public Structure SurfaceSurfaceIntersectorConfigurations
 Описание
 Структура SurfaceSurfaceIntersectorConfigurations предназначена для хранения данных о конфигурации каждой из двух пересекающихся поверхностей в окрестности кривой пересечения.
 Замечания
 Экземпляры этой структуры используются методом Teigha.Geometry.SurfaceSurfaceIntersector.GetIntersectionConfigurations для представления результатов.
 Топики
 Имя
 Описание
 SurfaceSurfaceIntersectorConfigurations Методы
 Ниже перечислены методы класса SurfaceSurfaceIntersectorConfigurations.
 SurfaceSurfaceIntersectorConfigurations Операторы
 Ниже перечислены операторы класса SurfaceSurfaceIntersectorConfigurations.
 SurfaceSurfaceIntersectorConfigurations Свойства
 Ниже перечислены свойства класса SurfaceSurfaceIntersectorConfigurations.
 Ссылки
 SurfaceSurfaceIntersectorConfigurations Методы, SurfaceSurfaceIntersectorConfigurations Операторы, SurfaceSurfaceIntersectorConfigurations Свойства, Топики, SurfaceSurfaceIntersectorConfigurations Методы, SurfaceSurfaceIntersectorConfigurations Операторы, SurfaceSurfaceIntersectorConfigurations Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!