Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObjectReferenceCollection.Insert
 Послать отзыв
 Метод вставляет в коллекцию указанную объектную ссылку в позицию с заданным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Insert( int index, DBObjectReference value );
Копировать Код
Public Sub Insert( index As Integer, value As DBObjectReference )
 Параметры
 Параметры
 Описание
 index
 Входное значение индекса места вставки. Тип int.
 value
 Вставляемая в коллекцию объектная ссылка. Тип DBObjectReference.
 Описание
 Метод вставляет в коллекцию указанную объектную ссылку в позицию с заданным индексом.
 Замечания
 Если переданный в метод индекс оказывается недействительным, выбрасывается исключение ArgumentOutOfRangeException.
 Ссылки
 Teigha.DatabaseServices.DBObjectReferenceCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!