Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MatchProperties.CopyProperties
 Послать отзыв
 Метод предназначен для копирования предписанных свойств из исходного объекта в указанный целевой объект.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void CopyProperties( ref Entity sourceEntity, ref Entity targetEntity, int flag );
Копировать Код
Public Overridable Sub CopyProperties( ByRef sourceEntity As Entity, ByRef targetEntity As Entity, flag As Integer )
 Параметры
 Параметры
 Описание
 sourceEntity
 Объект-источник свойств. Тип Entity.
 targetEntity
 Объект-получатель свойств. Тип Entity.
 flag
 Флаг, представляющий комбинацию копируемых свойств. Тип int.
 Описание
 Предполагается, что этот метод скопирует все предписанные свойства из объекта sourceEntity в объект targetEntity.
 Флаг flag представляет собой комбинацию битовых флагов, определяющих копируемые свойства. Перечислимый тип предоставляет в ваше распоряжение ряд предопределенных битов для аргумента flag. Поскольку flag является целым числом, неиспользуемые биты вы можете использовать по своему усмотрению.
 Список предопределенных битов для аргумента flag:
 Имя Значение
 Свойство
 -------------------- -----------
 ---------------------
 kColorFlag 0x00001
 Цвет
 kLayerFlag 0x00002
 Слой
 kLtypeFlag 0x00004
 Тип линий
 kThicknessFlag 0x00008
 Толщина
 kLtscaleFlag 0x00010
 Масштаб типа линий
 kTextFlag 0x00020
 Текст
 kDimensionFlag 0x00040
 Размер
 kHatchFlag 0x00080
 Штриховка
 kLweightFlag 0x00100
 Толщина линий
 kPlotstylenameFlag 0x00200
 Имя стиля печати
 kPolylineFlag 0x00400
 Полилиния
 kViewportFlag 0x00800
 Видовой экран
 kTableFlag 0x01000
 Таблица
 kMaterialFlag 0x02000
 Материал
 kShadowDisplayFlag 0x04000
 Отображение теней
 kMultileaderFlag 0x08000
 Мультивыноска
 kTransparencyFlag 0x10000
 Прозрачность
 kSetAllFlagsOn 0x1FFFF
 Все типы
 Ссылки
 Teigha.DatabaseServices.MatchProperties, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!