Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство RasterImage.ReactorId
 Послать отзыв
 Синтаксис
C#
Visual Basic
public DatabaseServices::ObjectId ReactorId;
Public Property ReactorId() As DatabaseServices.ObjectId
 Описание
 Обеспечивает доступ к Id реактора изображения геометрического объекта.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.RasterImage, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!