Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Solid3d.CreateExtrudedSolid
 Послать отзыв
 Метод предназначен для создания твердого тела методом выдавливания указанной грани на заданную длину.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void CreateExtrudedSolid( ref Entity sweepEntity, SubentityId faceSubEntityId, double height, ref SweepOptions sweepOptions );
Копировать Код
Public Overridable Sub CreateExtrudedSolid( ByRef sweepEntity As Entity, faceSubEntityId As SubentityId, height As Double, ByRef sweepOptions As SweepOptions )
 Параметры
 Параметры
 Описание
 sweepEntity
 Выдавливаемый объект. Тип Entity.
 faceSubEntityId
 Идентификатор подобъекта грани, которую требуется выдавить. Тип SubentityId.
 height
 Длина выдавливания. Тип double. Используется как множитель для вектора направления выдавливания.
 sweepOptions
 Опции операции выдавливания. Тип SweepOptions.
 Описание
 Метод предназначен для создания твердого тела методом выдавливания указанной грани на заданную длину. Реализован только в среде пространственного моделирования.
 Ссылки
 Teigha.DatabaseServices.Solid3d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!