Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Sphere.Center
 Послать отзыв
 Свойство Center представляет текущее положение центра данной сферической поверхности.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d Center;
Копировать Код
Public ReadOnly Property Center As Point3d
 Возвращает
 Возвращает точку центра данной сферической поверхности. Тип Point3d.
 Описание
 Свойство Center представляет текущее положение центра данной сферической поверхности.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.Sphere, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!