Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PropertiesOverrule.List
 Послать отзыв
 Метод позволяет переопределить текст, выводимый командой LIST.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void List( ref Entity entity );
Копировать Код
Public virtual Sub List( ByRef entity As Entity )
 Параметры
 Параметры
 Описание
 entity
 Объект из базы данных чертежа, тип Entity.
 Описание
 Метод позволяет переопределить текст, выводимый командой LIST.
 Пример
 В приведенном ниже примере переопределяется текст, который команда LIST выводит для всех объектов чертежа типа Line.
C#
 Копировать Код
 using Teigha.DatabaseServices; using Teigha.Runtime; using HostMgd.ApplicationServices; using HostMgd.EditorInput; // Создаем класс-наследник класса PropertiesOverrule class HelloPropsOverrule : PropertiesOverrule { // Переопределяем метод List, который отвечает за поведение команды LIST public override void List(Entity entity) { // Закомментирована строка, выводящая стандартную информацию  // об объекте чертежа //base.List(entity); // Получаем доступ к активному документу Document doc = Application.DocumentManager.MdiActiveDocument; // Получаем ссылку на редактор документа Editor ed = doc.Editor; // Задаем текст, который нужно вывести командой LIST вместо стандартного ed.WriteMessage("ObjectId from PropertiesOverrule :" + entity.Id.ToString()); } } public partial class Commands { // Делаем статическое свойство, чтобы не было  // лишних регистраций в платформе static HelloPropsOverrule propsOverrule; // Создаем метод – команду, которая будет  // включать и отключать перегрузку команды LIST [CommandMethod("HelloPropsOverrule")] public void HelloPropsOverrule() { // Проверка, включена ли перегрузка команды LIST // путем проверки наличия в памяти экземпляра класса-перегурзки if (propsOverrule == null) { // Если в памяти свойства нет, создаем его propsOverrule = new HelloPropsOverrule(); // Активируем механизм Overrule для объектов типа Line Overrule.AddOverrule(RXObject.GetClass(typeof(Line)), propsOverrule, false); Overrule.Overruling = true; } else { // Если перегрузка включена, то отключаем ее Overrule.Overruling = false; Overrule.RemoveOverrule(RXObject.GetClass(typeof(Line)), propsOverrule); // Принудительно удаляем данные из памяти propsOverrule.Dispose(); propsOverrule = null; } } }
В пространство модели добавляется объект типа Line.
Вызывается команда LIST, которая запрашивает объект(ы) с чертежа, о которых нужно вывести информацию в командную строку nanoCAD.
После завершения выбора мы видим в командной строке информацию о выбранном объекте:
Вызывается команда HelloPropsOverrule, которая включает переопределение команды LIST для всех объектов типа Line. С объектами другого типа это переопределение работать не будет.
Вызываем команду LIST повторно, выбираем на чертеже объект типа Line и теперь видим в командной строке то, что мы задали вывести: ().
Если раскомментировать строку //base.List(entity);, то вместе с нашей строкой также выведется вся информация об объекте, которая вывелась без PropertiesOverrule.
Повторный вызов команды HelloPropsOverrule выключит это переопределение и команда LIST будет работать так же, как работала изначально.
 Ссылки
 Teigha.DatabaseServices.PropertiesOverrule, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!