Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SectionSettings.SetHatchScale
 Послать отзыв
 Метод позволяет задать масштаб штриховки геометрии указанного типа.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetHatchScale( SectionType nSecType, SectionGeometry nGeometry, double fScale );
Копировать Код
Public Sub SetHatchScale( nSecType As SectionType, nGeometry As SectionGeometry, fScale As Double )
 Параметры
 Параметры
 Описание
 nSecType
 Тип сечения. Перечисление SectionType.
 nGeometry
 Типы элементов геометрии сечения. Перечисление SectionGeometry.
 fScale
 Значение масштаба штриховки. Тип double.
 Описание
 Метод позволяет задать величину масштаба штриховки геометрии указанного типа.
 Ссылки
 Teigha.DatabaseServices.SectionSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!