Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.RevolveOptionsBuilder.RevolveOptionsBuilder
 Послать отзыв
 Конструктор по умолчанию класса RevolveOptionsBuilder.
 Синтаксис
C#
Visual Basic
Копировать Код
public RevolveOptionsBuilder();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса RevolveOptionsBuilder.
 Ссылки
 Teigha.DatabaseServices.RevolveOptionsBuilder, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!