Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Hatch.GetLoopAt
 Послать отзыв
 Синтаксис
C#
Visual Basic
public HatchLoop GetLoopAt(int loopIndex);
Public Function GetLoopAt(loopIndex As Integer) As HatchLoop
 Параметры
 Параметры
 Описание
 loopIndex
 Индекс выбранной петли
 Описание
 Эта функция возвращает определение петли (полилинии) выбранной петли контура объекта заливки. Параметр loopIndex определяет индекс выбранной петли.
 Пустое множество может быть возвращено, если петля полилинии содержит только сегменты линий.
 Ссылки
 Teigha.DatabaseServices.Hatch, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!