Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Polyline.HasWidth
 Послать отзыв
 Синтаксис
C#
Visual Basic
public bool HasWidth;
Public Property HasWidth() As bool
 Описание
 Возвращает признак того, что для полилинии задано значение ширины для сегментов. Значение ширины необходимо для измененения ширины сегментов в полилинии.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.Polyline, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!