Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MentalRayRenderSettings.MemoryLimit
 Послать отзыв
 Свойство MemoryLimit представляет максимальный объем памяти, который может быть выделен для рендеринга.
 Синтаксис
C#
Visual Basic
Копировать Код
public int MemoryLimit;
Копировать Код
Public Property MemoryLimit As Integer
 Возвращает
 Возвращает максимальный объем памяти, доступный для рендеринга. Тип int.
 Описание
 Свойство MemoryLimit представляет максимальный объем памяти, который может быть выделен для рендеринга.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MentalRayRenderSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!