Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotSettings.ShowPlotStyles
 Послать отзыв
 Свойство ShowPlotStyles определяет, отображаются ли стили печати для этого объекта PlotSettings в режиме листа.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool ShowPlotStyles;
Копировать Код
Public Property ShowPlotStyles As Boolean
 Возвращает
 Возвращает true, если стили печати отображаются. В противном случае возвращает false.
 Описание
 Свойство ShowPlotStyles определяет, отображаются ли стили печати для этого объекта PlotSettings в режиме листа.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.PlotSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!