Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.CurveBoundary.Clone
 Послать отзыв
 Метод создает копию данного объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public Object Clone();
Копировать Код
Public Function Clone() As Object
 Возвращает
 Возвращает созданный клон данного объекта. Тип Object.
 Описание
 Метод создает копию данного объекта.
 Ссылки
 Teigha.Geometry.CurveBoundary, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!