Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LoftOptions.LoftOptions
 Послать отзыв
 Конструктор по умолчанию класса LoftOptions.
 Синтаксис
C#
Visual Basic
Копировать Код
public LoftOptions();
Копировать Код
Public Sub New()
 Описание
 Конструктор по умолчанию класса LoftOptions.
 Ссылки
 Teigha.DatabaseServices.LoftOptions, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!