Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Matrix3dBuilder.Matrix3dBuilder
 Послать отзыв
 Конструктор класса Matrix3dBuilder. Создает новый экземпляр класса на основе указанной матрицы.
 Синтаксис
C#
Visual Basic
Копировать Код
public Matrix3dBuilder( Matrix3d value );
Копировать Код
Public Sub New( value As Matrix3d )
 Параметры
 Параметры
 Описание
 value
 Входная матрица, на основе которой создается новый экземпляр класса. Тип Matrix3d.
 Описание
 Конструктор класса Matrix3dBuilder. Создает новый экземпляр класса на основе указанной матрицы.
 Ссылки
 Teigha.Geometry.Matrix3dBuilder, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!