Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SubDMesh.NormalArray
 Послать отзыв
 Свойство представляет доступ к нормалям во всех вершинах данного объекта SubDMash.
 Синтаксис
C#
Visual Basic
Копировать Код
public Vector3dCollection NormalArray;
Копировать Код
Public Property NormalArray() As Vector3dCollection
 Возвращает
 Возвращает массив нормалей в вершинах объекта SubDMash. Тип Vector3dCollection.
 Описание
 Свойство представляет доступ к нормалям во всех вершинах данного объекта SubDMash.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.SubDMesh, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!