Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Matrix2dInfo.IsEqualTo
 Послать отзыв
 Метод проверяет равенство данного объекта указанному объекту типа Matrix2dInfo c заданной точностью.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsEqualTo( Matrix2dInfo a, Tolerance tolerance );
Копировать Код
Public Function IsEqualTo( a As Matrix2dInfo, tolerance As Tolerance ) As Boolean
 Параметры
 Параметры
 Описание
 a
 Входной объект для сравнения. Тип Matrix2dInfo.
 tolerance
 Входная геометрическая точность. Тип Tolerance.
 Возвращает
 Возвращает true, если с точностью tolerance объекты можно считать равными. В противном случае возвращает false.
 Описание
 Метод проверяет равенство данного объекта указанному объекту типа Matrix2dInfo c заданной точностью.
 Замечания
 Объекты типа Matrix2dInfo считаются равными, если
Равны масштабные множители;
Равны углы поворота;
В обеих матрицах присутствует, либо в обеих отсутствует зеркальное отражение;
Совпадают направления зеркального отражения.
 Ссылки
 Teigha.Geometry.Matrix2dInfo, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!