Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.BulgeVertexCollection.Insert
 Послать отзыв
 Метод вставляет в коллекцию указанный объект BulgeVertex по указанному индексу.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Insert( int index, ref BulgeVertex value );
Копировать Код
Public Sub Insert( index As Integer, ByRef value As BulgeVertex )
 Параметры
 Параметры
 Описание
 index
 Индекс для нового элемента коллекции. Тип int.
 value
 Вставляемый объект. Тип BulgeVertex.
 Описание
 Метод вставляет в коллекцию указанный объект BulgeVertex по указанному индексу.
 Ссылки
 Teigha.DatabaseServices.BulgeVertexCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!