Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство RasterImageDef.ActiveFileName
 Послать отзыв
 Синтаксис
C#
Visual Basic
public String ActiveFileName;
Public Property ActiveFileName() As String
 Описание
 Обеспечивает доступ к пути реального файла, который будет использоваться для определения изображения. Требует, чтобы RasterImageDef был открыт на чтение.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.RasterImageDef, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!