Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DrawOrderTable.BlockId
 Послать отзыв
 Свойство обеспечивает доступ к идентификатору записи BlockTableRecord, которой принадлежит данный экземпляр DrawOrderTable.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.ObjectId BlockId;
Копировать Код
Public Property BlockId As DatabaseServices.ObjectId
 Возвращает
 Возвращает идентификатор объекта BlockTableRecord. Тип DatabaseServices.ObjectId.
 Описание
 Свойство обеспечивает доступ к идентификатору записи BlockTableRecord, которой принадлежит данный экземпляр DrawOrderTable.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.DrawOrderTable, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!