Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DatabaseSummaryInfoBuilder.RevisionNumber
 Послать отзыв
 Свойство обеспечивает доступ к номеру ревизии объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public String RevisionNumber;
Копировать Код
Public Property RevisionNumber() As String
 Возвращает
 Возвращает номер ревизии объекта. Тип String.
 Описание
 Свойство обеспечивает доступ к номеру ревизии объекта.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.DatabaseSummaryInfoBuilder, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!