Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MlineStyle.ShowMiters
 Послать отзыв
 Свойство управляет отображением линий стыков (miterlines) в вершинах мультилиний.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool ShowMiters;
Копировать Код
Public Property ShowMiters As Boolean
 Возвращает
 Возвращает true, если отображение линий стыков включено. В противном случае возвращает false.
 Описание
 Свойство управляет отображением линий стыков (miterlines) в вершинах мультилиний.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MlineStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!