Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LineJoinStyle
 Послать отзыв
 Перечисление LineJoinStyle определяет поддерживаемые стили соединения сегментов полилиний и иных составных объектов.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum LineJoinStyle { LjsMiter = 0, LjsBevel = 1, LjsRound = 2, LjsDiamond = 3, LjsUseObject = 5 }
Копировать Код
Public Enum LineJoinStyle LjsMiter = 0 LjsBevel = 1 LjsRound = 2 LjsDiamond = 3 LjsUseObject = 5 End Enum
 Члены
 Члены
 Описание
 LjsMiter
 Значение: 0. Острый угол. Соединение сегментов под углом, при котором внешние края линий продолжаются до точки пересечения. При очень острых углах может вызывать нежелательные артефакты, если не использовать дополнительные ограничения.
 LjsBevel
 Значение: 1. Срезанный угол. Стиль соединения, при котором острый угол между двумя линиями срезается по прямой. Позволяет избегать проблем с очень острыми углами.
 LjsRound
 Значение: 2. Скругленный угол. Стиль соединения, при котором вершина углового соединения сегментов скругляется по круглой дуге.
 LjsDiamond
 Значение: 3. Угол в форме ромба. Стиль соединения, при котором в вершине углового соединения сегментов отображается ромб.
 LjsUseObject
 Значение: 5. Угловое соединение сегментов, стиль которого определяется предоставленным объектом (его свойствами).
 Описание
 Перечисление LineJoinStyle определяет поддерживаемые стили соединения расположенных под углом сегментов полилиний и иных составных объектов.
 Ваши комментарии по поводу этого топика: Послать отзыв!