Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Hatch.NumberOfPatternDefinitions
 Послать отзыв
 Синтаксис
C#
Visual Basic
public int NumberOfPatternDefinitions;
Public Property NumberOfPatternDefinitions() As Integer
 Описание
 Возвращает общее количество образцов определения линий в образце объекта заливки.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.Hatch, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!