Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Surface.TrimSurface
 Послать отзыв
 Метод позволяет обрезать поверхность с указанными режущими поверхностями (или кривыми).
 Синтаксис
C#
Visual Basic
Копировать Код
public static void TrimSurface( DatabaseServices.ObjectId blankSurfaceId, ref ObjectIdCollection toolSurfaceIds, ref ObjectIdCollection toolCurveIds, ref Vector3dCollection projVectors, Point3d pickPoint, Vector3d viewVector, bool bAutoExtend, bool associativeEnabled );
Копировать Код
Public Shared Sub TrimSurface( blankSurfaceId As DatabaseServices.ObjectId, ByRef toolSurfaceIds As ObjectIdCollection, ByRef toolCurveIds As ObjectIdCollection, ByRef projVectors As Vector3dCollection, pickPoint As Point3d, viewVector As Vector3d, bAutoExtend As Boolean, associativeEnabled As Boolean )
 Параметры
 Параметры
 Описание
 blankSurfaceId
 Обрезаемая поверхность. Тип DatabaseServices.ObjectId.
 toolSurfaceIds
 Массив идентификаторов режущих объектов, тела которых будут использоваться для обрезки поверхности непосредственно, без каких-либо дополнительных операций типа проецирования. Тип ObjectIdCollection.
 toolCurveIds
 Массив идентификаторов режущих кривых, которые будут использоваться для обрезки поверхности после предварительного проецирования их на поверхность. Тип ObjectIdCollection.
 projVectors
 Массив направлений проецирования для каждой режущей кривой из массива ToolCurveIds. Соответственно, размеры коллекций projVectors и ToolCurveIds должны совпадать. Тип Vector3dCollection.
 pickPoint
 Точка выбора, которая определяет, какую именно область указанной поверхности необходимо обрезать. Тип Point3d.
 viewVector
 Вектор, представляющий направление обзора для создания луча из точки выбора. Используется для устранения возможной неоднозначности определения обрезаемой области поверхности при использовании точки выбора. Искомой областью будет та, которую луч, построенный в этом направлении, встретит первой. Тип Vector3d.
 bAutoExtend
 Если флаг принимает значение true, то, когда тело инструмента состоит из одной грани с аналитической геометрией, эта базовая геометрия достраивается до поверхности, чтобы обеспечить обрезку. Геометрия самого режущего объекта не изменяется. Тип bool.
 associativeEnabled
 Флаг ассоциативной обрезки. Определяет, должна ли данная операция обрезки быть ассоциативной. Тип bool.
 Описание
 Метод позволяет обрезать поверхность с указанными режущими поверхностями (или кривыми).
 Поверхность можно обрезать по другим поверхностям или кривым. В случае использования кривых фактическая граница обрезки образуется проецированием кривых на поверхность, поэтому необходимо предоставить дополнительную информацию о направлениях проекции.
 Ссылки
 Teigha.DatabaseServices.Surface, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!