Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод LinetypeTableRecord.SetDashLengthAt
 Послать отзыв
 Синтаксис
C#
Visual Basic
public void SetDashLengthAt(int index, double value);
Public Sub SetDashLengthAt(index As Integer, value As Double)
 Параметры
 Параметры
 Описание
 index
 Индекс (начинающийся с 0) штриховки, для которой должна быть получена длина
 value
 Значение длины для штриховки
 Описание
 Этот метод устанавливает значение длины (в единицах чертежа nanoCAD — штриховка будет отображаться с этой длиной, если масштаб типа линии равен 1.0) в строке index штриховки в LinetypeTableRecord.
 Значение index должно быть больше или равно 0, но меньше чем значение, возвращаемое LinetypeTableRecord.NumDashes. index представляет собой индекс, начинающийся с нуля (формы и текстовые строки имеют тот же самый индекс, как и штриховка, предшествующая им в определении типа линии) с первым элементом типа линии, соответствующим индексу, равному 0.
 Для получения дополнительной информации об определении типа линии и длины штриховки, смотри раздел "Типы линий" в Инструкции пользователя по nanoCAD.
 Ссылки
 Teigha.DatabaseServices.LinetypeTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!