Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Cell.DataLink
 Послать отзыв
 Свойство обеспечивает доступ к ссылке на внешние данные, которая хранится в данной ячейке.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectId DataLink;
Копировать Код
Public Property DataLink As ObjectId
 Возвращает
 Возвращает ссылку на данные. Тип ObjectId.
 Описание
 Свойство обеспечивает доступ к ссылке на внешние данные, которая хранится в данной ячейке.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Cell, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!