Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Tdupdate
 Послать отзыв
 Синтаксис
C#
Visual Basic
public DateTime Tdupdate;
Public Property Tdupdate() As DateTime
 Описание
 Обеспечивает доступ к текущему значению TDUPDATE для базы данных.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!