Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AbstractViewPE.HasViewOffset
 Послать отзыв
 Свойство HasViewOffset позволяет проверить, задано ли смещение вида для связанного видового экрана.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool HasViewOffset;
Копировать Код
Public ReadOnly Property HasViewOffset As Boolean
 Возвращает
 Возвращает true, если смещение вида задано. В противном случае возвращает false.
 Описание
 Свойство HasViewOffset позволяет проверить, задано ли смещение вида для связанного видового экрана.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.AbstractViewPE, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!