Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Ole2Frame.setCompoundDocument
 Послать отзыв
 Метод выполняет чтение данных составного документа из указанного потока.
 Синтаксис
C#
Visual Basic
Копировать Код
public void setCompoundDocument( int nSize, ref Runtime.StreamBuf streamBuf );
Копировать Код
Public Sub setCompoundDocument( nSize As Integer, ByRef streamBuf As Runtime.StreamBuf )
 Параметры
 Параметры
 Описание
 nSize
 Размер считываемых составных данных в байтах. Тип int.
 streamBuf
 Буфер потока, из которого выполняется чтение данных. Тип Runtime.StreamBuf.
 Описание
 Метод выполняет чтение данных составного документа из указанного потока.
 Ссылки
 Teigha.DatabaseServices.Ole2Frame, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!