Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.HyperLink.IsOutermostContainer
 Послать отзыв
 Свойство позволяет определить, связан ли данный объект HyperLink с самым внешним контейнером.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsOutermostContainer;
Копировать Код
Public ReadOnly Property IsOutermostContainer As Boolean
 Возвращает
 Возвращает true, если гиперссылка связана с самым внешним контейнером. В противном случае возвращает false.
 Описание
 Свойство позволяет определить, связан ли данный объект HyperLink с самым внешним контейнером.
 Свойство помогает понять, какие гиперссылки доступны для редактирования в коллекции, содержащей гиперссылки-контейнеры. Так, в случае объекта, который входит в состав блока, допускается редактировать только гиперссылки, связанные со вставкой блока. Гиперссылки, связанные с объектом и определениями его блоков, для редактирования недоступны.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.HyperLink, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!