Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObjectReferenceCollection.Remove
 Послать отзыв
 Метод удаляет из коллекции элемент, соответствующий указанной объектной ссылке.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Remove( DBObjectReference value );
Копировать Код
Public Sub Remove( value As DBObjectReference )
 Параметры
 Параметры
 Описание
 value
 Входная объектная ссылка, которая определяет удаляемый из коллекции элемент. Тип DBObjectReference.
 Описание
 Метод удаляет из коллекции элемент, соответствующий указанной объектной ссылке value.
 Ссылки
 Teigha.DatabaseServices.DBObjectReferenceCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!