Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Tolerance
 Послать отзыв
 Структура Tolerance представляет значения точности (допуски), используемые для проверки равенства точек и векторов.
 Иерархия классов
Teigha::Geometry::Tolerance
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdGeTol")] public struct Tolerance
Копировать Код
<Wrapper("OdGeTol")> Public Structure Tolerance
 Описание
 Структура Tolerance представляет значения точности (допуски), используемые для проверки равенства точек и векторов.
 Замечания
 Для оценки совпадения точек и векторов предусмотрены значения equalPoint и equalVector, соответственно. Используются следующие критерии равенства точек и векторов:
Две точки p1 и p2 считаются равными, если расстояние между ними не превышает значения equalPoint, т.е. (p1 - p2).length() <= equalPoint.
Два вектора v1 и v2 считаются равными, если длина вектора их разности не превышает значения equalVector,
 т.е. (v1 - v2).length() <= equalVector..
Два вектора v1 и v2 считаются параллельными, если длина вектора суммы или разности этих векторов после их нормирования на единицу меньше значения equalVector, т.е.
 (v1/v1.length() - v2/v2.length()).length() < equalVector или (v1/v1.length() + v2/v2.length()).length() < equalVector.
Два вектора v1 и v2 считаются перпендикулярными, если модуль скалярного произведения приведенных к единичной длине векторов v1 и v2 не превышает значения equalVector, т.е.
 abs((v1.dotProduct(v2))/(v1.length()*v2.length())) <= equalVector.
Две прямые линии или два луча параллельны (или перпендикулярны), если их направляющие векторы параллельны (или, соответственно, перпендикулярны).
 Методы
 Конструкторы
 Имя
 Описание
 Tolerance
 Конструктор структуры Tolerance. Создает экземпляр класса с указанными значениями equalPoint и equalVector для проверки равенства точек и векторов.
 Топики
 Имя
 Описание
 Tolerance Свойства
 Ниже перечислены свойства класса Tolerance.
 Ссылки
 Tolerance Свойства, Методы, Топики, Tolerance Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!