Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Sphere.IsClosed
 Послать отзыв
 Метод позволяет проверить, является ли данный объект полной сферой в пределах указанной точности.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsClosed( Tolerance tolerance );
Копировать Код
Public Function IsClosed( tolerance As Tolerance ) As Boolean
 Параметры
 Параметры
 Описание
 tolerance
 Заданная геометрическая точность. Тип Tolerance.
 Возвращает
 Возвращает true, если в пределах точности tolerance данный объект можно считать полной сферой. В противном случае возвращает false.
 Описание
 Метод позволяет проверить, является ли данный объект полной сферой в пределах указанной точности. Экватор полной (замкнутой) сферической поверхности представляет собой полную окружность.
 Ссылки
 Teigha.Geometry.Sphere, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!