Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Ole2Frame.AutoOutputQuality
 Послать отзыв
 Свойство представляет качество печати, "автоматически выбираемое приложением".
 Синтаксис
C#
Visual Basic
Копировать Код
public byte AutoOutputQuality;
Копировать Код
Public Property AutoOutputQuality As Byte
 Возвращает
 Возвращает качество печати. Тип byte.
 Описание
 Свойство представляет качество печати, "автоматически выбираемое приложением". Качество печати влияет на глубину цвета и разрешение, используемые при выводе OLE-объекта на печать. См. также свойство OutputQuality.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Ole2Frame, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!