Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Событие Database.XrefAttachEnded
 Послать отзыв
 Синтаксис
C#
Visual Basic
public event EventHandler XrefAttachEnded;
Public Event XrefAttachEnded As EventHandler
 Описание
 Событие показывает, что в операции присоединения этой внешней ссылки была выполнена в чертеже, и успешно завершилась.
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!