Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotSettingsValidator.SetStdScale
 Послать отзыв
 Метод задает для указанного объекта PlotSettings стандартный масштаб как действительное число с плавающей точкой.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetStdScale( ref PlotSettings plotSet, double standardScale );
Копировать Код
Public Sub SetStdScale( ByRef plotSet As PlotSettings, standardScale As Double )
 Параметры
 Параметры
 Описание
 plotSet
 Входной объект PlotSettings с настройками печати.
 standardScale
 Стандартный масштаб. Тип double.
 Описание
 Метод задает для указанного объекта PlotSettings стандартный масштаб как действительное число с плавающей точкой.
 Ссылки
 Teigha.DatabaseServices.PlotSettingsValidator, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!