Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.FileDependencyManager
 Послать отзыв
 Синтаксис
C#
Visual Basic
public DatabaseServices::FileDependencyManager FileDependencyManager;
Public Property FileDependencyManager() As DatabaseServices.FileDependencyManager
 Описание
 Возвращает объект FileDependencyManager базы данных.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!