Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeader.TextHeight
 Послать отзыв
 Свойство представляет текущую высоту многострочного текста.
 Синтаксис
C#
Visual Basic
Копировать Код
public double TextHeight;
Копировать Код
Public Property TextHeight As Double
 Возвращает
 Возвращает высоту текста. Тип double.
 Описание
 Свойство представляет текущую высоту многострочного текста.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MLeader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!