Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Solid3d.CreateBox
 Послать отзыв
 Метод позволяет создать 3D-тело в виде прямоугольного параллелепипеда заданного размера, ребра которого выровнены по осям мировой системы координат (WCS), с центром в начале системы координат WCS.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void CreateBox( double lengthAlongX, double lengthAlongY, double lengthAlongZ );
Копировать Код
Public Overridable Sub CreateBox( lengthAlongX As Double, lengthAlongY As Double, lengthAlongZ As Double )
 Параметры
 Параметры
 Описание
 lengthAlongX
 Длина тела вдоль оси X WCS. Тип double.
 lengthAlongY
 Длина тела вдоль оси Y WCS. Тип double.
 lengthAlongZ
 Длина тела вдоль оси Z WCS. Тип double.
 Описание
 Метод позволяет создать 3D-тело в виде прямоугольного параллелепипеда заданного размера, ребра которого выровнены по осям мировой системы координат (WCS), а центр располагается в начале этой системы координат.
 Замечания
 На значения входных аргументов накладываются следующие ограничения:
lengthAlongX >= 1e-6,
lengthAlongY >= 1e-6,
lengthAlongZ >= 1e-6.
 Ссылки
 Teigha.DatabaseServices.Solid3d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!