Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotSettings.PlotPaperUnits
 Послать отзыв
 Свойство PlotPaperUnits представляет единицы измерения на бумаге, используемые для полей, смещений, размера бумаги и единиц чертежа для данного объекта PlotSettings.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.PlotPaperUnit PlotPaperUnits;
Копировать Код
Public ReadOnly Property PlotPaperUnits As DatabaseServices.PlotPaperUnit
 Возвращает
 Возвращает настроенные единицы измерения на бумаге из перечисления DatabaseServices.PlotPaperUnit.
 Описание
 Свойство PlotPaperUnits представляет единицы измерения на бумаге, используемые для полей, смещений, размера бумаги и единиц чертежа для данного объекта PlotSettings.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.PlotSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!