Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.UnderlayReference.ScaleFactors
 Послать отзыв
 Свойство ScaleFactors представляет коэффициенты масштабирования данной подложки.
 Синтаксис
C#
Visual Basic
Копировать Код
public Scale3d ScaleFactors;
Копировать Код
Public Property ScaleFactors As Scale3d
 Возвращает
 Возвращает коэффициенты масштабирования подложки. Тип Scale3d.
 Описание
 Свойство ScaleFactors представляет коэффициенты масштабирования данной подложки.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.UnderlayReference, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!