Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.ExternalBoundedSurface.IsNurbs
 Послать отзыв
 Свойство IsNurbs позволяет проверить, является ли неограниченная базовая поверхность данного объекта NURBS поверхностью.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsNurbs;
Копировать Код
Public ReadOnly Property IsNurbs As Boolean
 Возвращает
 Возвращает true, если базовая поверхность данного объекта является NURBS поверхностью. В противном случае возвращает false.
 Описание
 Свойство IsNurbs определяет тип неограниченной базовой поверхности данного объекта и возвращает true, если она является NURBS поверхностью.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.ExternalBoundedSurface, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!