Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.LinearEntity2d.IsParallelTo
 Послать отзыв
 Метод позволяет проверить, является ли указанный линейный объект параллельным данному линейному объекту с некоторой заданной точностью.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsParallelTo( ref LinearEntity2d line, Tolerance tolerance );
Копировать Код
Public Function IsParallelTo( ByRef line As LinearEntity2d, tolerance As Tolerance ) As Boolean
 Параметры
 Параметры
 Описание
 line
 Проверяемый линейный объект. Тип LinearEntity2d.
 tolerance
 Заданная геометрическая точность. Тип Tolerance.
 Возвращает
 Возвращает true, если в пределах заданной точности можно считать, что данный объект параллелен объекту line. В противном случае возвращает false
 Описание
 Метод позволяет проверить, является ли указанный линейный объект параллельным данному линейному объекту с некоторой заданной точностью.
 Ссылки
 Teigha.Geometry.LinearEntity2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!