Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Cone.BaseRadius
 Послать отзыв
 Свойство BaseRadius представляет доступ к радиусу основания данного конуса.
 Синтаксис
C#
Visual Basic
Копировать Код
public double BaseRadius;
Копировать Код
Public Property BaseRadius As Double
 Возвращает
 Возвращает радиус основания данного конуса. Тип double.
 Описание
 Свойство BaseRadius представляет доступ к радиусу основания данного конуса.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.Geometry.Cone, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!