Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.Dimcen
 Послать отзыв
 Свойство управляет отображением и размерами маркеров центра и центровых линий дуг и окружностей.
 Синтаксис
C#
Visual Basic
public double Dimcen;
Копировать Код
Public Property Dimcen As Double
 Возвращает
 Возвращает размер маркеров центра и центровых линий. Тип double.
 Описание
 Свойство управляет отображением и размерами маркеров центра и центровых линий дуг и окружностей.
 Абсолютное значение Dimcen определяет половину длины маркера центра, длину части центровой линии за пределами дуги или окружности, а также длину просвета между маркером центра и центровой линией.
 Знак значения Dimcen управляет отображением маркеров центра и центровых линий:
 Значение
 Описание
 0
 Не отображаются ни маркеры центров, ни центровые линии.
 <0
 Отображаются центровые линии.
 >0
 Отображаются маркеры центров.
 public double Dimcen;
 Условия
 Чтение и запись.
 Смотри также
 Teigha::DatabaseServices::Dimension::CenterMarkType
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!