Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Point2d
 Послать отзыв
 Данный класс представляет геометрические точки в 2D-пространстве.
 Иерархия классов
Teigha::Geometry::Point2d
 Синтаксис
C#
Visual Basic
Копировать Код
[StructLayout(LayoutKind.Sequential),Wrapper("OdGePoint2d"),DefaultMember("Coordinate")] public class Point2d : IFormattable;
Копировать Код
<StructLayout(LayoutKind.Sequential),Wrapper("OdGePoint2d"),DefaultMember("Coordinate")> Public Class Point2d Inherits IFormattable
 Описание
 Данный класс представляет геометрические точки в 2D-пространстве.
 Методы
 Конструкторы
 Имя
 Описание
 Point2d
 Это обзор перегрузок Point2d.
 Топики
 Имя
 Описание
 Point2d Методы
 Ниже перечислены методы класса Point2d.
 Point2d Операторы
 Ниже перечислены операторы класса Point2d.
 Point2d Свойства
 Ниже перечислены свойства класса Point2d.
 Ссылки
 Point2d Конструктор, Point2d Методы, Point2d Операторы, Point2d Свойства, Методы, Топики, Point2d Методы, Point2d Операторы, Point2d Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!