Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocEvaluationCallback.CancelActionEvaluation
 Послать отзыв
 Метод реализует уведомление о том, что вычисление действия должно быть отменено.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool CancelActionEvaluation();
Копировать Код
Public Function CancelActionEvaluation() As Boolean
 Возвращает
 Возвращает true, если обновление (вычисление) действия должно быть отменено. В противном случае возвращает false.
 Описание
 Метод реализует уведомление о том, что вычисление действия должно быть отменено.
 Ссылки
 Teigha.DatabaseServices.AssocEvaluationCallback, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!