Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.NurbsData.KnotTolerance
 Послать отзыв
 Свойство возвращает значение допуска, используемое для операций с узлами NURBS.
 Синтаксис
C#
Visual Basic
Копировать Код
public double KnotTolerance;
Копировать Код
Public ReadOnly Property KnotTolerance As Double
 Возвращает
 Возвращает значение допуска для операций с узлами NURBS. Тип double.
 Описание
 Свойство возвращает значение допуска, используемое для операций с узлами NURBS.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.NurbsData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!