Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SubDMesh.GetCrease
 Послать отзыв
 Метод предназначен для получения величин сгибов для массива подобъектов сети.
 Синтаксис
C#
Visual Basic
Копировать Код
Public Function GetCrease( ref subentPaths As FullSubentityPath[] ) As DoubleCollection
Копировать Код
Public Function GetCrease( ByRef subentPaths As FullSubentityPath[] ) As DoubleCollection
 Параметры
 Параметры
 Описание
 subentPaths
 Массив подобъектов сети. Тип FullSubentityPath[].
 Возвращает
 Возвращает коллекцию величин сгибов. Тип DoubleCollection.
 Описание
 Метод предназначен для получения величин сгибов для массива подобъектов сети.
 Ссылки
 Teigha.DatabaseServices.SubDMesh, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!