Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Leader.SetPlane
 Послать отзыв
 Синтаксис
C#
Visual Basic
public void SetPlane(ref Plane value);
Public Sub SetPlane(ByRef value As Plane)
 Описание
 Задает плоскость, которая содержит выноску. Элементы данных выноски будут изменены для того, чтобы отражать это изменение плоскости. Чтобы выполнить эти действия, будет создана матрица преобразования для преобразования всех точек из текущей координатной системы плоскости в систему координат новой плоскости — проекция не используется. Note Метод сбрасывает установленные ассоциативности.
 Ссылки
 Teigha.DatabaseServices.Leader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!