Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DataColumn.DataColumn
 Послать отзыв
 Конструктор класса DataColumn по умолчанию.
 Синтаксис
C#
Visual Basic
Копировать Код
public DataColumn();
Копировать Код
Public Sub New()
 Описание
 Конструктор класса DataColumn по умолчанию.
 Ссылки
 Teigha.DatabaseServices.DataColumn, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!