Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Dimension.SuppressAngularLeadingZeros
 Послать отзыв
 Свойство управляет подавлением ведущих нулей в значениях угловых размеров.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool SuppressAngularLeadingZeros;
Копировать Код
Public Property SuppressAngularLeadingZeros As Boolean
 Возвращает
 Возвращает true, если подавление включено. В противном случае возвращает false.
 Описание
 Свойство управляет подавлением ведущих нулей в значениях угловых размеров.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Dimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!