Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.SubSelection
 Послать отзыв
 Данное свойство предоставляет доступ к диапазону ячеек в подвыборке.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual CellRange SubSelection;
Копировать Код
Public virtual Property SubSelection() As CellRange
 Возвращает
 Возвращает диапазон ячеек в подвыборке. В отсутствие подвыборки возвращает недопустимый диапазон.
 Описание
 Данное свойство предоставляет доступ к диапазону ячеек в подвыборке.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!