Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CellContent.Scale
 Послать отзыв
 Свойство Scale контролирует масштаб содержимого ячейки.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Scale;
Копировать Код
Public Property Scale As Double
 Возвращает
 Возвращает масштабный множитель для содержимого ячейки. Тип double.
 Описание
 Свойство Scale контролирует масштаб содержимого ячейки.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.CellContent, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!