Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DxfFiler.ReadVector2d
 Послать отзыв
 Метод возвращает 2D-вектор из текущего элемента этого объекта Filer.
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract Vector2d ReadVector2d();
Копировать Код
Public MustOverride Function ReadVector2d() As Vector2d
 Возвращает
 Возвращает 2D-вектор. Тип Vector2d.
 Описание
 Метод возвращает 2D-вектор из текущего элемента этого объекта Filer.
 Ссылки
 Teigha.DatabaseServices.DxfFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!