Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Light.Softness
 Послать отзыв
 Свойство представляет параметр мягкости тени для данного источника света.
 Синтаксис
C#
Visual Basic
Копировать Код
public int Softness;
Копировать Код
Public Property Softness As Integer
 Возвращает
 Возвращает параметр мягкости тени. Тип int.
 Описание
 Свойство представляет параметр мягкости тени для данного источника света.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Light, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!