Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.XrefGraphNode.IsNested
 Послать отзыв
 Свойство IsNested позволяет проверить, представляет ли данный узел вложенную внешнюю ссылку.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsNested;
Копировать Код
Public ReadOnly Property IsNested As Boolean
 Возвращает
 Возвращает true, если данный узел представляет вложенную внешнюю ссылку. В противном случае возвращает false.
 Описание
 Свойство IsNested позволяет проверить, представляет ли данный узел внешний объект, на который главный чертеж напрямую не ссылается.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.XrefGraphNode, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!