Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.LinearEntity3d.IntersectWith
 Послать отзыв
 Метод вычисляет точку пересечения данного линейного объекта с указанной плоскостью.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d[] IntersectWith( ref PlanarEntity plane );
Копировать Код
Public Function IntersectWith( ByRef plane As PlanarEntity ) As Point3d()
 Параметры
 Параметры
 Описание
 plane
 Входная плоскость. Тип PlanarEntity.
 Возвращает
 Возвращает массив из одного элемента с точкой пересечения. Тип Point3d[].
 Описание
 Метод определяет, пересекает ли данный объект указанную плоскость, и если да, возвращает точку их пересечения. Используется вызов метода LinearEntity3d.IntersectWith(PlanarEntity plane, Tolerance tolerance) с точностью, равной Tolerance.Global.
 Ссылки
 Teigha.Geometry.LinearEntity3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!