Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SweepOptions.PathEntityTransform
 Послать отзыв
 Свойство PathEntityTransform представляет матрицу преобразования для системы координат в начале/конце траектории вытягивания.
 Синтаксис
C#
Visual Basic
Копировать Код
public Matrix3d PathEntityTransform;
Копировать Код
Public ReadOnly Property PathEntityTransform As Matrix3d
 Возвращает
 Возвращает матрицу преобразования. Тип Matrix3d.
 Описание
 Свойство PathEntityTransform представляет матрицу преобразования для системы координат в начале/конце траектории вытягивания.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.SweepOptions, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!