Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector3d.IsCodirectionalTo
 Послать отзыв
 Метод позволяет проверить, является ли данный вектор сонаправленным входному вектору.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsCodirectionalTo( Vector3d vector );
Копировать Код
Public Function IsCodirectionalTo( vector As Vector3d ) As Boolean
 Параметры
 Параметры
 Описание
 vector
 Входной вектор для сравнения на сонаправленность. Тип Vector3d.
 Возвращает
 Возвращает true, если векторы можно считать сонаправленными. В противном случае возвращает false.
 Описание
 Метод позволяет проверить, является ли данный вектор сонаправленным входному вектору. Реализация использует вызов Vector3d.IsCodirectionalTo(Vector3d vector, Tolerance tolerance) со значением аргумента tolerance, равным Tolerance.Global. Метод возвращает true, если это условие выполнено, и false в противном случае.
 Ссылки
 Teigha.Geometry.Vector3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!