Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AuditInfo.PrintError
 Послать отзыв
 Метод уведомления, вызываемый для печати информации об ошибке.
 Синтаксис
C#
Visual Basic
Копировать Код
public void PrintError( ref DBObject value, ref String value2, ref String validation, ref String defaultValue );
Копировать Код
Public Sub PrintError( ByRef value As DBObject, ByRef value2 As String, ByRef validation As String, ByRef defaultValue As String )
 Параметры
 Параметры
 Описание
 value
 Объект, вызвавший ошибку. Тип DBObject.
 value2
 Входное ошибочное значение. Тип String.
 validation
 Входное описание причины, по которой данные рассматриваются как ошибочные. Тип String.
 defaultValue
 Устанавливаемое значение по умолчанию. Тип String.
 Описание
 Метод уведомления, вызываемый для печати информации об ошибке.
 Печатает информацию журнала о выявленных или исправленных ошибках, используя в качестве имени тип объекта, на который указывает значение (его возвращает свойство RXClass.Name). Например, если значение указывает на объект Handle, то именем будет "Handle".
 Замечания
 Любой из строковых аргументов может быть нулевым.
 Ссылки
 Teigha.DatabaseServices.AuditInfo, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!