Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LoftOptionsBuilder.Closed
 Послать отзыв
 Свойство позволяет проверить состояние флага замкнутости получаемой поверхности.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool Closed;
Копировать Код
Public Property Closed As Boolean
 Возвращает
 Возвращает true, если результирующая поверхность является замкнутой. В противном случае возвращает false.
 Описание
 Свойство позволяет проверить состояние флага замкнутости получаемой поверхности.
 Если для этого флага установлено значение true, созданная лофтом поверхность начинается и заканчивается в первом поперечном сечении (таким образом, получается замкнутой). В этом случае поперечных сечений должно быть задано не менее трех. Если все контуры поперечных сечений являются замкнутыми кривыми, результирующая поверхность имеет топологию тора.
 Если для этого флага установлено значение false, получаемая поверхность начинается и заканчивается плоскими поверхностями, образованными первым и последним сечениями.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.LoftOptionsBuilder, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!