Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocArrayPathParameters.SetStartOffset
 Послать отзыв
 Метод задаёт смещение первого элемента массива по траектории.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetStartOffset( double offset, ref String expression, ref String evaluatorId );
Копировать Код
Public Sub SetStartOffset( offset As Double, ByRef expression As String, ByRef evaluatorId As String )
 Параметры
 Параметры
 Описание
 offset
 Смещение первого элемента массива. Тип double.
 expression
 Выражение для параметра. Тип String. Строка может быть пустой.
 evaluatorId
 Строковое представление идентификатора вычислителя. Тип String. Строка может быть пустой.
 Описание
 Метод задаёт смещение первого элемента массива по траектории. Если для параметра выражение отсутствует, строки expression и evaluatorId должны быть пустыми.
 Ссылки
 Teigha.DatabaseServices.AssocArrayPathParameters, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!