Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Cone.GetAngles
 Послать отзыв
 Метод позволяет получить начальный и конечный углы поворота образующей для данного конуса.
 Синтаксис
C#
Visual Basic
Копировать Код
public double[] GetAngles();
Копировать Код
Public Function GetAngles() As Double()
 Возвращает
 Возвращает массив, содержащий углы поворота. Тип double[]. Элемент массива с индексом 0 представляет начальный угол, а с индексом 1 — конечный угол.
 Описание
 Метод позволяет получить начальный и конечный углы поворота образующей для данного конуса.
 Ссылки
 Teigha.Geometry.Cone, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!