Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.RasterVariables
 Послать отзыв
 Класс RasterVariables представляет объекты RasterVariables в базе данных.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Runtime::RXObject Teigha::GraphicsInterface::Drawable Teigha::DatabaseServices::DBObject Teigha::DatabaseServices::RasterVariables
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("AcDbRasterVariables")] public class RasterVariables : DBObject
Копировать Код
<Wrapper("AcDbRasterVariables")> Public Class RasterVariables Inherits DBObject
 Описание
 Класс RasterVariables представляет объекты RasterVariables в базе данных. В каждом файле чертежа, содержащем объекты изображений, имеется единственный объект этого типа. Он определяет все переменные чертежа, связанные с управлением и отображением растровых изображений.
 Методы
 Конструкторы
 Teigha.GraphicsInterface.Drawable
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 Drawable
 Конструктор класса Teigha.GraphicsInterface.Drawable. (Унаследован от Drawable)
 Teigha.DatabaseServices.DBObject
 ПоказатьУнаследован
 Нет совпадений по текущему фильтру
 Имя
 Описание
 DBObject
 Конструктор. (Унаследован от DBObject)
 Teigha.DatabaseServices.RasterVariables
 Имя
 Описание
 RasterVariables
 Это обзор перегрузок RasterVariables.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Runtime.RXObject
 Имя
 Описание
 RXObject Методы
 Ниже перечислены методы класса RXObject.
 Teigha.GraphicsInterface.Drawable
 Имя
 Описание
 Drawable Методы
 Ниже перечислены методы класса Drawable.
 Drawable Свойства
 Ниже перечислены свойства класса Drawable.
 Teigha.DatabaseServices.DBObject
 Имя
 Описание
 DBObject Методы
 Ниже перечислены методы класса DBObject.
 DBObject Свойства
 Ниже перечислены свойства класса DBObject.
 DBObject События
 Ниже перечислены события класса DBObject.
 Teigha.DatabaseServices.RasterVariables
 Имя
 Описание
 RasterVariables Свойства
 Ниже перечислены свойства класса RasterVariables.
 Ссылки
 RasterVariables Конструктор, RasterVariables Свойства, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства, DBObject События
 Ваши комментарии по поводу этого топика: Послать отзыв!