Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Extents2d.IsEqualTo
 Послать отзыв
 Метод проверяет совпадение данного объекта с указанным объектом Extents2d.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsEqualTo( Extents2d a );
Копировать Код
Public Function IsEqualTo( a As Extents2d ) As Boolean
 Параметры
 Параметры
 Описание
 a
 Проверяемый объект. Тип Extents2d.
 Возвращает
 Возвращает true, если минимальные и максимальные точки сравниваемых объектов совпадают. В противном случае возвращает false.
 Описание
 Метод проверяет совпадение данного объекта с указанным объектом Extents2d.
 Ссылки
 Teigha.DatabaseServices.Extents2d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!