Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Solid3d.ShellBody
 Послать отзыв
 Метод позволяет преобразовать твердое тело в тонкостенную твердотельную оболочку путем смещения граней исходного тела.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void ShellBody( ref SubentityId[] subentityIds, double offsetDistance );
Копировать Код
Public Overridable Sub ShellBody( ByRef subentityIds() As SubentityId, offsetDistance As Double )
 Параметры
 Параметры
 Описание
 subentityIds
 Идентификаторы подобъектов граней твердого тела. Тип SubentityId[].
 offsetDistance
 Величина смещения граней. Тип double.
 Описание
 Метод позволяет преобразовать твердое тело в тонкостенную твердотельную оболочку путем смещения граней исходного тела.
 Грани смещаются наружу, если параметр offsetDistance положителен, и внутрь, если отрицателен.
 Грани с поверхностью, которая не допускает смещение по толщине, удаляются из твердого тела. Образовавшаяся несплошность затягивается поверхностями соседних граней. Ребра и вершины на предоставленных гранях по возможности объединяются слиянием. Изолированные ребра в измененных гранях и соседних гранях могут вырождаться в точки и, вследствие этого, удаляться.
 Однако при удалении контуров (петель) или граней вставка ребер или другие топологические изменения не допускаются. В некоторых случаях эта операция может привести к тому, что тело окажется недопустимым.
 Этот метод реализован только в среде пространственного моделирования.
 Ссылки
 Teigha.DatabaseServices.Solid3d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!