Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PlotStyleDescriptor.ToString
 Послать отзыв
 Данный класс предназначен для формирования эквивалентного строкового представления объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public String ToString();
Копировать Код
Public Function ToString() As String
 Возвращает
 Возвращает строку String.
 Описание
 Данный класс предназначен для формирования эквивалентного строкового представления объекта. Подробнее см. в документации Microsoft .NET API.
 Ссылки
 Teigha.DatabaseServices.PlotStyleDescriptor, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!