Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PatternDefinition.Angle
 Послать отзыв
 Свойство представляет угол поворота штриховки.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Angle;
Копировать Код
Public ReadOnly Property Angle As Double
 Возвращает
 Возвращает угол поворота в радианах. Тип double.
 Описание
 Свойство представляет угол поворота штриховки.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.PatternDefinition, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!