Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CompoundObjectId.IsSimpleObjectId
 Послать отзыв
 Свойство позволяет проверить отсутствие пути, когда имеется только идентификатор конечного объекта (который может быть нулевым).
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsSimpleObjectId;
Копировать Код
Public Property IsSimpleObjectId() As Boolean
 Возвращает
 Возвращает true, если путь отсутствует. В противном случае возвращает false.
 Описание
 Свойство позволяет проверить отсутствие пути, когда имеется только идентификатор конечного объекта (который может быть нулевым).
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.CompoundObjectId, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!