Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.OffsetSurface.IsSphere
 Послать отзыв
 Свойство IsSphere позволяет определить, является ли поверхность смещения сферой.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsSphere;
Копировать Код
Public ReadOnly Property IsSphere As Boolean
 Возвращает
 Возвращает true, если поверхность смещения является плоскостью. В противном случае возвращает false.
 Описание
 Свойство IsSphere позволяет определить, является ли поверхность смещения сферой.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.OffsetSurface, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!