Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Curve.Area
 Послать отзыв
 Свойство возвращает площадь кривой.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Area;
Копировать Код
Public Property Area() As double
 Описание
 Свойство возвращает площадь кривой.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Curve, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!