Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.ClipBoundary2d
 Послать отзыв
 Класс ClipBoundary2d представляет ограничивающий многоугольник, определяющий плоскую границу обрезки произвольных 2D-полигонов или полилиний.
 Иерархия классов
Teigha::Runtime::DisposableWrapper Teigha::Geometry::Entity2d Teigha::Geometry::ClipBoundary2d
 Синтаксис
C#
Visual Basic
Копировать Код
[Wrapper("OdGeClipBoundary2d")] public sealed class ClipBoundary2d : Entity2d
Копировать Код
Public NotInheritable Class ClipBoundary2d Inherits Entity2d
 Описание
 Класс ClipBoundary2d представляет ограничивающий многоугольник, который определяет плоскую границу обрезки произвольных 2D-полигонов или полилиний. Результатом обрезки являются двумерные выпуклые открытые или замкнутые полилинии или прямоугольники. Реализация аналогична алгоритму обрезки Сазерленда - Ходжмана.
 Для отслеживания источника каждого сегмента отсеченного многоугольника опционально может генерироваться подробная информация о ребрах. Она может пригодиться для управления отображением ребер или для эффективного объединения отсеченных многоугольников, полученных по нескольким границам обрезки (возможно, путем декомпозиции невыпуклой границы обрезки до нескольких выпуклых границ).
 Кроме того, генерируется информация о пространственной взаимосвязи между отсеченным многоугольником или полилинией и областью обрезки.
 Методы
 Конструкторы
 Teigha.Geometry.ClipBoundary2d
 Имя
 Описание
 ClipBoundary2d
 Это обзор перегрузок ClipBoundary2d.
 Топики
 Имя
 Описание
 DisposableWrapper Методы
 Ниже перечислены методы класса DisposableWrapper.
 DisposableWrapper Операторы
 Ниже перечислены операторы класса DisposableWrapper.
 DisposableWrapper Свойства
 Ниже перечислены свойства класса DisposableWrapper.
 Teigha.Geometry.Entity2d
 Имя
 Описание
 Entity2d Методы
 Ниже перечислены методы класса Entity2d.
 Teigha.Geometry.ClipBoundary2d
 Имя
 Описание
 ClipBoundary2d Методы
 Ниже перечислены методы класса ClipBoundary2d.
 Ссылки
 ClipBoundary2d Конструктор, ClipBoundary2d Методы, Методы, Топики, DisposableWrapper Методы, DisposableWrapper Операторы, DisposableWrapper Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!