Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DynamicBlockReferencePropertyCollectionEnumerator
 Послать отзыв
 Этот класс реализует перечислитель в коллекции свойств динамического блока DynamicBlockReferencePropertyCollection.
 Иерархия классов
Teigha::DatabaseServices::DynamicBlockReferencePropertyCollectionEnumerator
 Синтаксис
C#
Visual Basic
Копировать Код
public class DynamicBlockReferencePropertyCollectionEnumerator : System.Collections.IEnumerator;
Копировать Код
Public Class DynamicBlockReferencePropertyCollectionEnumerator Inherits System.Collections.IEnumerator
 Описание
 Этот класс реализует перечислитель в коллекции свойств динамического блока DynamicBlockReferencePropertyCollection.
 Топики
 Имя
 Описание
 DynamicBlockReferencePropertyCollectionEnumerator Методы
 Ниже перечислены методы класса DynamicBlockReferencePropertyCollectionEnumerator.
 DynamicBlockReferencePropertyCollectionEnumerator Свойства
 Ниже перечислены свойства класса DynamicBlockReferencePropertyCollectionEnumerator.
 Ссылки
 DynamicBlockReferencePropertyCollectionEnumerator Методы, DynamicBlockReferencePropertyCollectionEnumerator Свойства, Топики, DynamicBlockReferencePropertyCollectionEnumerator Методы, DynamicBlockReferencePropertyCollectionEnumerator Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!