Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MentalRayRenderSettings.SamplingContrastColor
 Послать отзыв
 Свойство SamplingContrastColor представляет пороговые нижние границы отсечения для цветовых каналов, ниже которых выборочные значения игнорируются.
 Синтаксис
C#
Visual Basic
Копировать Код
public MentalRayRenderSettingsTraitsFloatParameter SamplingContrastColor;
Копировать Код
Public Property SamplingContrastColor As MentalRayRenderSettingsTraitsFloatParameter
 Возвращает
 Возвращает пороговые нижние границы отсечения для цветовых каналов. Тип MentalRayRenderSettingsTraitsFloatParameter.
 Описание
 Свойство SamplingContrastColor представляет пороговые нижние границы отсечения для цветовых каналов, ниже которых выборочные значения игнорируются.
 Параметр MentalRayRenderSettingsTraitsFloatParameter хранит значения красного, зеленого, синего и альфа-каналов в диапазоне [0..1].
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MentalRayRenderSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!