Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbCurve3d.NurbCurve3d
 Послать отзыв
 Конструктор класса NurbCurve3d. Создает трехмерную NURBS кривую, которая в пределах точности по умолчанию интерполирует указанный массив трехмерных точек.
 Синтаксис
C#
Visual Basic
Копировать Код
public NurbCurve3d( ref Point3dCollection fitPoints );
Копировать Код
Public Sub New( ByRef fitPoints As Point3dCollection )
 Параметры
 Параметры
 Описание
 fitPoints
 Входная коллекция определяющих точек. Тип Point3dCollection.
 Описание
 Конструктор класса NurbCurve3d. Создает трехмерную NURBS кривую, которая в пределах точности по умолчанию интерполирует указанный массив трехмерных точек.
 Ссылки
 Teigha.Geometry.NurbCurve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!