Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.UcsTableRecord.SetUcsBaseOrigin
 Послать отзыв
 Метод позволяет задать трехмерную точку начала пользовательской системы координат (UCS) для указанного ортогонального вида, при условии, что в системной переменной UCSBASE сохранено имя данной UCS.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetUcsBaseOrigin( Point3d origin, DatabaseServices.OrthographicView view );
Копировать Код
Public Sub SetUcsBaseOrigin( origin As Point3d, view As DatabaseServices.OrthographicView )
 Параметры
 Параметры
 Описание
 origin
 Точка начала пользовательской системы координат. Тип Point3d.
 view
 Тип ортогонального вида из перечисления DatabaseServices.OrthographicView.
 Описание
 Метод позволяет задать трехмерную точку начала пользовательской системы координат (UCS) для указанного ортогонального вида, при условии, что в системной переменной UCSBASE сохранено имя данной UCS.
 Ссылки
 Teigha.DatabaseServices.UcsTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!