Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeaderStyle.BlockRotation
 Послать отзыв
 Свойство представляет угол поворота блока, на который ссылается данный стиль.
 Синтаксис
C#
Visual Basic
Копировать Код
public double BlockRotation;
Копировать Код
Public Property BlockRotation As Double
 Возвращает
 Возвращает угол поворота блока (в радианах). Тип double.
 Описание
 Свойство представляет угол поворота блока, на который ссылается данный стиль.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MLeaderStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!