Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Sphere.GetAnglesInU
 Послать отзыв
 Метод предоставляет текущий диапазон изменения параметра u.
 Синтаксис
C#
Visual Basic
Копировать Код
public double[] GetAnglesInU();
Копировать Код
Public Function GetAnglesInU() As Double()
 Возвращает
 Возвращает двухэлементный массив. Тип double[]. Элемент с индексом 0 соответствует начальному углу, а элемент с индексом 1 - конечному углу для параметра u.
 Описание
 Метод предоставляет текущий диапазон изменения параметра u.
 Ссылки
 Teigha.Geometry.Sphere, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!