Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Polyline.IsOnlyLines
 Послать отзыв
 Синтаксис
C#
Visual Basic
public bool IsOnlyLines;
Public Property IsOnlyLines() As bool
 Описание
 Возвращает признак того, что полилиния содержит только линии.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.Polyline, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!