Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Leader.AnnoWidth
 Послать отзыв
 Синтаксис
C#
Visual Basic
public double AnnoWidth;
Public Property AnnoWidth() As Double
 Описание
 Возвращает ширину аннотации.
 Если аннотация имеет тип MText, то возвращаемое значение является действительной шириной текста. Если аннотация имеет тип FeatureControlFrame, то возвращаемое значение представляет ширину ограничивающего прямоугольника. Для остальных типов аннотации возвращается значение 0.0.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.Leader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!