Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.OsnapOverrule.IsContentSnappable
 Послать отзыв
 Метод позволяет выяснить, определена ли объектная привязка для объекта чертежа.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsContentSnappable( ref Entity entity );
Копировать Код
Public Function IsContentSnappable( ByRef entity As Entity ) As Boolean
 Параметры
 Параметры
 Описание
 entity
 Объект чертежа, тип Entity.
 Возвращает
 Возвращает true, если объектная привязка возможна, и false в противном случае.
 Описание
 Метод позволяет выяснить, определена ли объектная привязка для объекта чертежа.
 Ссылки
 Teigha.DatabaseServices.OsnapOverrule, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!