Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObject.XDataTransformBy(Matrix3d)
 Послать отзыв
 Метод применяет матрицу трехмерного преобразования к данным этого объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public void XDataTransformBy(Matrix3d transform);
Копировать Код
Public Sub XDataTransformBy(transform As Matrix3d)
 Параметры
 Параметры
 Описание
 transform
 Матрица преобразования. Тип Matrix3d
 Описание
 Этот метод применяет матрицу преобразования к любым xdata типов 1011, 1021, 1031, 1012, 1022, 1032, 1013, 1023, 1033, 1041, и 1042 из xdata объекта. Для более подробной информации о применении матрицы преобразования к xdata разных типов, смотрите документацию на xdata.
 Этот метод следует вызывать вместе с методом TransformBy() для пользовательских геометрических объектов, так что такие геометрические объекты будут преобразовывать свои xdata таким же образом, как это делают встроенные геометрические объекты.
 Ссылки
 Teigha.DatabaseServices.DBObject, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!