Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Hatch.GradientName
 Послать отзыв
 Синтаксис
C#
Visual Basic
public String GradientName;
Public Property GradientName() As String
 Описание
 Обеспечивает доступ к имени текущего градиента.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Hatch, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!