Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CellRange.ContentLayout
 Послать отзыв
 Свойство обеспечивает доступ к настройкам размещения содержимого ячеек диапазона из перечисления CellContentLayout.
 Синтаксис
C#
Visual Basic
Копировать Код
public CellContentLayout? ContentLayout;
Копировать Код
Public Property ContentLayout As CellContentLayout?
 Возвращает
 Возвращает вариант размещения содержимого ячеек. Значение из перечисления CellContentLayout.
 Описание
 Свойство обеспечивает доступ к настройкам размещения содержимого ячеек диапазона из перечисления CellContentLayout.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.CellRange, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!