Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbCurve3d.NurbCurve3d
 Послать отзыв
 Конструктор класса NurbCurve3d. Создает трехмерную кривую, которая с точностью по умолчанию интерполирует заданный массив трехмерных точек, используя предписанный метод узловой параметризации и указанные направления касательных в начальной и конечной точках.
 Синтаксис
C#
Visual Basic
Копировать Код
public NurbCurve3d( ref Point3dCollection fitPoints, Vector3d startTangent, Vector3d endTangent, bool startTangentDefined, bool endTangentDefined, KnotParameterizationEnum knotParam );
Копировать Код
Public Sub New( ByRef fitPoints As Point3dCollection, startTangent As Vector3d, endTangent As Vector3d, startTangentDefined As Boolean, endTangentDefined As Boolean, knotParam As KnotParameterizationEnum )
 Параметры
 Параметры
 Описание
 fitPoints
 Массив определяющих точек для интерполирующей кривой. Тип Point3dCollection.
 startTangent
 Вектор касательной в начальной точке. Тип Vector3d.
 endTangent
 Вектор касательной в конечной точке. Тип Vector3d.
 startTangentDefined
 Флаг, который указывает, что следует использовать аргумент startTangent. Тип bool.
 endTangentDefined
 Флаг, который указывает, что следует использовать аргумент endTangent. Тип bool.
 knotParam
 Метод узловой параметризации сплайна. Перечисление KnotParameterizationEnum.
 Описание
 Конструктор класса NurbCurve3d. Создает трехмерную кривую, которая с точностью по умолчанию интерполирует заданный массив трехмерных точек, используя предписанный метод узловой параметризации и указанные направления касательных в начальной и конечной точках.
 Используется вызов NurbCurve3d.NurbCurve3d(ref Point3dCollection fitPoints, Vector3d startTangent, Vector3d endTangent, bool startTangentDefined, bool endTangentDefined, KnotParameterizationEnum knotParam, Tolerance fitTolerance) с точностью, равной Tolerance.Global.
 Ссылки
 Teigha.Geometry.NurbCurve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!