Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector3d.IsEqualTo
 Послать отзыв
 Метод позволяет проверить, совпадает ли данный вектор с входным вектором в пределах заданной точности.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsEqualTo( Vector3d vector, Tolerance tolerance );
Копировать Код
Public Function IsEqualTo( vector As Vector3d, tolerance As Tolerance ) As Boolean
 Параметры
 Параметры
 Описание
 vector
 Входной вектор для сравнения. Тип Vector3d.
 tolerance
 Входная точность для сравнения векторов. Тип Tolerance.
 Возвращает
 Возвращает true, если в пределах заданной точности оба вектора можно считать равными. В противном случае возвращает false.
 Описание
 Метод позволяет проверить, совпадает ли данный вектор с входным вектором vector в пределах заданной точности tolerance. В случае совпадения векторов возвращает true. В противном случае возвращает false.
 Ссылки
 Teigha.Geometry.Vector3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!