Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.HostApplicationServices.ModelerFlavor
 Послать отзыв
 Свойство возвращает возможные уровни поддержки средств геометрического моделирования, доступные в хост-приложениях.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual ModelerFlavor ModelerFlavor;
Копировать Код
Public Overridable ReadOnly Property ModelerFlavor As ModelerFlavor
 Возвращает
 Возвращает уровень поддержки средств геометрического моделирования. Перечисление ModelerFlavor.
 Описание
 Свойство возвращает возможные уровни поддержки средств геометрического моделирования, доступные в хост-приложениях.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.HostApplicationServices, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!