Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 LayerTable.GenerateUsageData()
 Послать отзыв
 Метод предназначен для обновления информации об использовании слоёв в чертеже.
 Синтаксис
C#
Visual Basic
Копировать Код
public void GenerateUsageData();
Копировать Код
Public Sub GenerateUsageData()
 Описание
 С помощью метода можно обновить информацию о задействовании слоёв в чертеже. После отработки метода обновляется значение свойства IsUsed каждой записи (LayerTableRecord) таблицы слоёв LayerTable.
 Ссылки
 Teigha.DatabaseServices.LayerTable, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!