Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 DimStyleTableRecord.Dimsd1
 Послать отзыв
 Свойство предназначено для контроля подавления первой размерной линии и окончания левой стрелки в размерах.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual bool Dimsd1 { get; set; }
Копировать Код
Public Overridable Property Dimsd1 As Boolean
 Возвращает
 Возвращает тип данных bool.
 Описание
 В свойстве хранится настройка подавления первой размерной линии и окончания левой стрелки в размерах. Свойство принимает в качестве значения тип данных bool:
false – не подавляется (по умолчанию);
true – подавляется.
 Свойство также доступно через системную переменную DIMSD1 и пользовательское меню в окне изменения/создания размерного стиля:
  При изменении системной переменной DIMSD1 будет создан новый размерный стиль под названием <переопределение> на основе текущего с новым значением DIMSD1.
 Условия
 Чтение и запись.
 Пример
 Пример изменения настройки подавления первой размерной линии и окончания левой стрелки в размерах (значения свойства Dimsd1) в размерном стиле Standard:
C#
 Копировать Код
public partial class Commands { [Teigha.Runtime.CommandMethod("Dimsd1Change")] public void Dimsd1StandardDimStyle() { // Получение ссылки на активный документ HostMgd.ApplicationServices.Document doc = HostMgd.ApplicationServices.Application.DocumentManager.MdiActiveDocument; // Получение ссылки на редактор документа HostMgd.EditorInput.Editor ed = doc.Editor; // Получение ссылки на базу данных документа Teigha.DatabaseServices.Database db = doc.Database; // Начало транзакции с базой данных документа using (Teigha.DatabaseServices.Transaction trans = db.TransactionManager.StartTransaction()) { // Открываем таблицу размерных стилей для чтения Teigha.DatabaseServices.DimStyleTable dimStyleTable = trans.GetObject(db.DimStyleTableId, Teigha.DatabaseServices.OpenMode.ForRead) as Teigha.DatabaseServices.DimStyleTable; // Находим в таблице размерных стилей ObjectId нужного стиля по его названию Teigha.DatabaseServices.ObjectId styleId = dimStyleTable["Standard"]; // Открываем таблицу размерного стиля для изменений Teigha.DatabaseServices.DimStyleTableRecord obj = trans.GetObject(styleId, Teigha.DatabaseServices.OpenMode.ForWrite) as Teigha.DatabaseServices.DimStyleTableRecord; ed.WriteMessage($"nDimsd1 before: {obj.Dimsd1}"); // Изменяем признак подавления первой размерной линии и ее окончания obj.Dimsd1 = true; ed.WriteMessage($"nDimsd1 after: {obj.Dimsd1}"); trans.Commit(); } } }
 Результат работы команды Dimsd1Change:
 Было:
 Стало:
 Ссылки
 Teigha.DatabaseServices.DimStyleTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!