Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SectionSettings.Visibility
 Послать отзыв
 Метод позволяет проверить, включено ли отображение геометрии указанного типа.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool Visibility( SectionType nSecType, SectionGeometry nGeometry );
Копировать Код
Public Function Visibility( nSecType As SectionType, nGeometry As SectionGeometry ) As Boolean
 Параметры
 Параметры
 Описание
 nSecType
 Тип сечения. Перечисление SectionType.
 nGeometry
 Типы элементов геометрии сечения. Перечисление SectionGeometry.
 Возвращает
 Возвращает true, если отображение геометрии включено. В противном случае возвращает false.
 Описание
 Метод позволяет проверить, включено ли отображение геометрии указанного типа.
 Ссылки
 Teigha.DatabaseServices.SectionSettings, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!