Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FlowDirection
 Послать отзыв
 Данное перечисление определяет направление, в котором текстовая строка следует от начала к своему концу.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum FlowDirection { BottomToTop = 4, ByStyle = 5, LeftToRight = 1, NotSet = 0, RightToLeft = 2, TopToBottom = 3 }
Копировать Код
Public Enum FlowDirection BottomToTop = 4 ByStyle = 5 LeftToRight = 1 NotSet = 0 RightToLeft = 2 TopToBottom = 3 End Enum
 Члены
 Члены
 Описание
 NotSet
 Значение: 0. Не задано.
 BottomToTop
 Значение: 4. Снизу вверх.
 ByStyle
 Значение: 5. Направление определяется во время исполнения текущим текстовым стилем.
 LeftToRight
 Значение: 1. Слева направо.
 RightToLeft
 Значение: 2. Справа налево.
 TopToBottom
 Значение: 3. Сверху вниз.
 Описание
 Данное перечисление определяет направление, в котором текстовая строка следует от начала к своему концу.
 Ваши комментарии по поводу этого топика: Послать отзыв!