Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LoftOptionsBuilder.LoftOptionsBuilder
 Послать отзыв
 Конструктор класса LoftOptionsBuilder. Создает новый экземпляр класса LoftOptionsBuilder на основе существующего объекта LoftOptions.
 Синтаксис
C#
Visual Basic
Копировать Код
public LoftOptionsBuilder( ref LoftOptions value );
Копировать Код
Public Sub New( ByRef value As LoftOptions )
 Параметры
 Параметры
 Описание
 value
 Входной объект типа LoftOptions.
 Описание
 Конструктор класса LoftOptionsBuilder. Создает новый экземпляр класса LoftOptionsBuilder на основе существующего объекта LoftOptions.
 Ссылки
 Teigha.DatabaseServices.LoftOptionsBuilder, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!