Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.HostApplicationServices.HostApplicationServices
 Послать отзыв
 Конструктор класса HostApplicationServices.
 Синтаксис
C#
Visual Basic
Копировать Код
public HostApplicationServices( IntPtr unmanagedObject, bool autoDelete );
Копировать Код
Public Sub New( unmanagedObject As IntPtr, autoDelete As Boolean )
 Параметры
 Параметры
 Описание
 unmanagedObject
 Неуправляемый указатель на исходный объект. Тип IntPtr.
 autoDelete
 Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.
 Описание
 Конструктор класса HostApplicationServices.
 Ссылки
 Teigha.DatabaseServices.HostApplicationServices, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!