Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.RotatedDimension.Rotation
 Послать отзыв
 Свойство задает или получает угол поворота (в радианах) для повернутого размера.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Rotation;
Копировать Код
Public Property Rotation() As double
 Возвращает
 Возвращает или получает угол поворота (в радианах) для повернутого размера.
 Описание
 Свойство задает или получает угол поворота (в радианах) для повернутого размера.
 Угол поворота измеряется от оси X OCS до размерной линии объекта-размера . Положительное направление отсчета углов - против часовой стрелки, если смотреть в сторону начала вектора нормали плоскости размера.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.RotatedDimension, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!