Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DwgFiler.WritePoint3d
 Послать отзыв
 Метод предназначен для записи указанной трехмерной точки Point3d в этот объект Filer.
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract void WritePoint3d( Point3d value );
Копировать Код
Public MustOverride Sub WritePoint3d( value As Point3d )
 Параметры
 Параметры
 Описание
 value
 Записываемое в Filer значение. Тип Point3d.
 Описание
 Метод предназначен для записи указанной трехмерной точки Point3d в этот объект Filer
 Ссылки
 Teigha.DatabaseServices.DwgFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!