Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.EllipticalArc3d.IntersectWith
 Послать отзыв
 Метод вычисляет точки пересечения данной дуги с указанным линейным объектом, используя заданную геометрическую точность.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d[] IntersectWith( ref LinearEntity3d line, Tolerance tolerance );
Копировать Код
Public Function IntersectWith( ByRef line As LinearEntity3d, tolerance As Tolerance ) As Point3d()
 Параметры
 Параметры
 Описание
 line
 Линейный объект, точки пересечения с которым требуется вычислить. Тип LinearEntity3d.
 tolerance
 Заданная геометрическая точность. Тип Tolerance.
 Возвращает
 Возвращает массив из двух элементов. Тип Point3d[]. Первый элемент соответствует первой точке пересечения, а второй элемент соответствует второй точке пересечения (если она существует).
 Описание
 Метод вычисляет точки пересечения данной дуги с указанным линейным объектом, используя заданную геометрическую точность. Результатом является массив точек пересечения (если они существуют).
 Замечания
 В случае отсутствия точек пересечения метод возвращает null.
 Ссылки
 Teigha.Geometry.EllipticalArc3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!