Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Surface.CreateOffsetSurface
 Послать отзыв
 Метод позволяет создать поверхность смещения и загрузить ее в текущую базу данных.
 Синтаксис
C#
Visual Basic
Копировать Код
public static DatabaseServices.ObjectId CreateOffsetSurface( ref Entity entity, double offsetDistance, bool associativeEnabled );
Копировать Код
Public Shared Function CreateOffsetSurface( ByRef entity As Entity, offsetDistance As Double, associativeEnabled As Boolean ) As DatabaseServices.ObjectId
 Параметры
 Параметры
 Описание
 entity
 Входная поверхность для смещения. Тип Entity.
 offsetDistance
 Величина смещения. Тип double.
 associativeEnabled
 Флаг, определяющий, требуется ли создавать ассоциативную поверхность смещения. Тип bool.
 Возвращает
 Возвращает идентификатор объекта полученной смещением поверхности. Тип DatabaseServices.ObjectId.
 Описание
 Метод позволяет создать поверхность смещения и загрузить ее в текущую базу данных.
 Замечания
 Данный метод реализован только в среде пространственного моделирования Spatial Modeler.
 Ссылки
 Teigha.DatabaseServices.Surface, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!