Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Перечисление Teigha.DatabaseServices.AssocDraggingState
 Послать отзыв
 This is record Teigha::DatabaseServices::AssocDraggingState.
 Синтаксис
C#
Visual Basic
[Wrapper("AcDbAssocDraggingState")] public enum AssocDraggingState { NotDraggingAssocDraggingState = kNotDraggingAssocDraggingState, FirstSampleAssocDraggingState = kFirstSampleAssocDraggingState, IntermediateSampleAssocDraggingState = kIntermediateSampleAssocDraggingState, LastSampleAssocDraggingState = kLastSampleAssocDraggingState }
<Wrapper("AcDbAssocDraggingState")> Public Enum AssocDraggingState NotDraggingAssocDraggingState = kNotDraggingAssocDraggingState FirstSampleAssocDraggingState = kFirstSampleAssocDraggingState IntermediateSampleAssocDraggingState = kIntermediateSampleAssocDraggingState LastSampleAssocDraggingState = kLastSampleAssocDraggingState End Enum
 Ваши комментарии по поводу этого топика: Послать отзыв!