Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Polyline.GetLineSegment2dAt
 Послать отзыв
 Синтаксис
C#
Visual Basic
public LineSegment2d GetLineSegment2dAt(int index);
Public Function GetLineSegment2dAt(index As Integer) As LineSegment2d
 Параметры
 Параметры
 Описание
 index
 Индекс (отсчитываемый от 0) вершины для начала сегмента
 Описание
 Если сегмент с вершиной с номером, заданным index, является линией, то метод создает 2D копию сегмента с информацией выбранного сегмента полилинии в собственных объектных координатах (OCS) полилинии.
 Ссылки
 Teigha.DatabaseServices.Polyline, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!