Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Curve2d.GetClosestPointTo
 Послать отзыв
 Метод позволяет с заданной точностью получить точку на этой кривой, ближайшую к указанной точке.
 Синтаксис
C#
Visual Basic
Копировать Код
public PointOnCurve2d GetClosestPointTo( Point2d point, Tolerance tolerance );
Копировать Код
Public Function GetClosestPointTo( point As Point2d, tolerance As Tolerance ) As PointOnCurve2d
 Параметры
 Параметры
 Описание
 point
 Входная точка, для которой требуется найти ближайшую точку на кривой. Тип Point2d.
 tolerance
 Входная точность вычислений. Тип Tolerance.
 Возвращает
 Возвращает точку на кривой, которая является ближайшей к заданной точке point. Тип PointOnCurve2d.
 Описание
 Метод позволяет с заданной точностью получить точку на этой кривой, ближайшую к указанной точке.
 Ссылки
 Teigha.Geometry.Curve2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!