Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocFlags
 Послать отзыв
 Перечисление AssocFlags определяет, какая опорная точка ассоциативного размера используется.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum AssocFlags { FirstPoint = 1, SecondPoint = 2, ThirdPoint = 4, FourthPoint = 8 }
Копировать Код
Public Enum AssocFlags FirstPoint = 1 SecondPoint = 2 ThirdPoint = 4 FourthPoint = 8 End Enum
 Члены
 Члены
 Описание
 FirstPoint
 Значение: 1. Используется первая опорная точка.
 SecondPoint
 Значение: 2. Используется вторая опорная точка.
 ThirdPoint
 Значение: 4. Используется третья опорная точка.
 FourthPoint
 Значение: 8. Используется четвертая опорная точка.
 Описание
 Перечисление AssocFlags определяет, какая опорная точка ассоциативного размера используется.
 Ваши комментарии по поводу этого топика: Послать отзыв!