Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DxfFiler.ReadString
 Послать отзыв
 Метод возвращает текстовую строку из текущего элемента этого объекта Filer.
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract String ReadString();
Копировать Код
Public MustOverride Function ReadString() As String
 Возвращает
 Возвращает строку. Тип String.
 Описание
 Метод возвращает текстовую строку из текущего элемента этого объекта Filer.
 Ссылки
 Teigha.DatabaseServices.DxfFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!