Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocArrayRectangularParameters.ColumnCount
 Послать отзыв
 Свойство обеспечивает доступ к количеству стобцов в массиве.
 Синтаксис
C#
Visual Basic
Копировать Код
public int ColumnCount;
Копировать Код
Public Property ColumnCount() As Integer
 Возвращает
 Возвращает количеству стобцов в массиве. Тип int.
 Описание
 Свойство обеспечивает доступ к количеству стобцов в массиве.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.AssocArrayRectangularParameters, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!