Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AttributeCollection.AppendAttribute
 Послать отзыв
 Метод добавляет к вхождению блока новый атрибут.
 Синтаксис
C#
Visual Basic
public ObjectId AppendAttribute(ref AttributeReference attributeToAddToBlockReference);
Копировать Код
Public Function AppendAttribute( ByRef attributeToAddToBlockReference As AttributeReference ) As ObjectId
Копировать Код
public ObjectId AppendAttribute( ref AttributeReference attributeToAddToBlockReference );
 Параметры
 Параметры
 Описание
 attributeToAddToBlockReference
 Атрибут, который следует добавить. Тип AttributeReference.
 Возвращает
 Возвращает ObjectId вхождения блока с новым атрибутом.
 Описание
 Метод добавляет к вхождению блока новый атрибут attributeToAddToBlockReference.
 Ссылки
 Teigha.DatabaseServices.AttributeCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!