Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Filters.Index.IsUptoDate
 Послать отзыв
 Свойство IsUptoDate проверяет актуальность данного индекса.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsUptoDate;
Копировать Код
Public ReadOnly Property IsUptoDate As Boolean
 Возвращает
 Возвращает true, только если данный индекс актуален. В противном случае возвращает false.
 Описание
 Свойство IsUptoDate проверяет актуальность данного индекса. Его возможно использовать для проверки достоверности в пределах сеанса.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Filters.Index, Teigha.DatabaseServices.Filters
 Ваши комментарии по поводу этого топика: Послать отзыв!