Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод LinetypeTableRecord.TextAt
 Послать отзыв
 Синтаксис
C#
Visual Basic
public String TextAt(int index);
Public Function TextAt(index As Integer) As String
 Параметры
 Параметры
 Описание
 index
 Индекс (начинающийся с 0) строки, для которой производится определение используемого текстового поля
 Описание
 Этот метод возвращает для строки LinetypeTableRecord со значением индекса index значение поля текста.
 Ссылки
 Teigha.DatabaseServices.LinetypeTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!