Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Перечисление Teigha.Geometry.ErrorCondition
 Послать отзыв
 This is record Teigha::Geometry::ErrorCondition.
 Синтаксис
C#
Visual Basic
[Wrapper("OdGe.ErrorCondition")] public enum ErrorCondition { OK = OdGe.kOk, This = OdGe.k0This, Arg1 = OdGe.k0Arg1, Arg2 = OdGe.k0Arg2, PerpendicularArg1Arg2 = OdGe.kPerpendicularArg1Arg2, EqualArg1Arg2 = OdGe.kEqualArg1Arg2, EqualArg1Arg3 = OdGe.kEqualArg1Arg3, EqualArg2Arg3 = OdGe.kEqualArg2Arg3, LinearlyDependentArg1Arg2Arg3 = OdGe.kLinearlyDependentArg1Arg2Arg3, Arg1TooBig = OdGe.kArg1TooBig, Arg1OnThis = OdGe.kArg1OnThis, Arg1InsideThis = OdGe.kArg1InsideThis, NonCoplanarGeometry = OdGe.kNonCoplanarGeometry, DegenerateGeometry = OdGe.kDegenerateGeometry, SingularPoint = OdGe.kSingularPoint }
<Wrapper("OdGe.ErrorCondition")> Public Enum ErrorCondition OK = OdGe.kOk This = OdGe.k0This Arg1 = OdGe.k0Arg1 Arg2 = OdGe.k0Arg2 PerpendicularArg1Arg2 = OdGe.kPerpendicularArg1Arg2 EqualArg1Arg2 = OdGe.kEqualArg1Arg2 EqualArg1Arg3 = OdGe.kEqualArg1Arg3 EqualArg2Arg3 = OdGe.kEqualArg2Arg3 LinearlyDependentArg1Arg2Arg3 = OdGe.kLinearlyDependentArg1Arg2Arg3 Arg1TooBig = OdGe.kArg1TooBig Arg1OnThis = OdGe.kArg1OnThis Arg1InsideThis = OdGe.kArg1InsideThis NonCoplanarGeometry = OdGe.kNonCoplanarGeometry DegenerateGeometry = OdGe.kDegenerateGeometry SingularPoint = OdGe.kSingularPoint End Enum
 Ваши комментарии по поводу этого топика: Послать отзыв!