Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.UnitsConverter
 Послать отзыв
 Класс UnitsConverter реализует конвертер единиц измерения.
 Иерархия классов
Teigha::DatabaseServices::UnitsConverter
 Синтаксис
C#
Visual Basic
Копировать Код
public class UnitsConverter : TypeConverter
Копировать Код
Public Class UnitsConverter Inherits TypeConverter
 Описание
 Класс UnitsConverter реализует конвертер единиц измерения.
 Топики
 Имя
 Описание
 UnitsConverter Методы
 Ниже перечислены методы класса UnitsConverter.
 Ссылки
 UnitsConverter Методы, Топики, UnitsConverter Методы
 Ваши комментарии по поводу этого топика: Послать отзыв!