Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AttributeReference.IsPreset
 Послать отзыв
 Свойство предоставляет доступ к флагу, который определяет статус "Установленный" данного объекта AttributeReference.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsPreset;
Копировать Код
Public Property IsPreset() As Boolean
 Возвращает
 Возвращает true, если задан статус "Установленный" (Preset). В противном случае возвращает false.
 Описание
 Свойство предоставляет доступ к флагу, который определяет статус "Установленный" данного объекта AttributeReference.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.AttributeReference, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!