Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Wipeout.HasFrame
 Послать отзыв
 Свойство HasFrame позволяет определить, отображается ли граница данной маски.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool HasFrame;
Копировать Код
Public Property HasFrame As Boolean
 Возвращает
 Возвращает true, если граница маски отображается. В противном случае возвращает false.
 Описание
 Свойство HasFrame позволяет определить, отображается ли граница (рамка) данной маски.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Wipeout, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!