Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MText.StackStart
 Послать отзыв
 Свойство возвращает строку перехода к дробному тексту "S".
 Синтаксис
C#
Visual Basic
Копировать Код
public static String StackStart;
Копировать Код
Public Shared ReadOnly Property StackStart As String
 Возвращает
 Возвращает строку перехода к дробному тексту. Тип String.
 Описание
 Свойство возвращает строку перехода к дробному тексту "S". Может использоваться вместо строковой константы "S", чтобы сделать код более понятным. При использовании в строке, возвращаемой свойством MText.Contents, "S" означает переход к дробному тексту.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.MText, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!