Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeaderStyle.LeaderLineType
 Послать отзыв
 Свойство представляет предусмотренный данным стилем тип линий выноски (прямая, сплайн, невидимая).
 Синтаксис
C#
Visual Basic
Копировать Код
public LeaderType LeaderLineType;
Копировать Код
Public Property LeaderLineType As LeaderType
 Возвращает
 Возвращает тип линий выноски из перечисления LeaderType.
 Описание
 Свойство представляет предусмотренный данным стилем тип линий выноски (прямая, сплайн, невидимая).
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MLeaderStyle, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!