Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 DimStyleTableRecord.Dimzin
 Послать отзыв
 Свойство предназначено для настройки подавления нулей в линейных размерах.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual int Dimzin { get; set; }
Копировать Код
Public Overridable Property Dimzin As Integer
 Возвращает
 Возвращает тип данных int.
 Описание
 В свойстве хранится настройка подавления нулей в линейных размерах. В качестве значений свойства доступны следующие целые числа:
0 – подавление ноль футов и ровно ноль дюймов, ведущие и конечные десятичные нули не подавляются (значение по умолчанию);
1 – включение ноль футов и ровно ноль дюймов, ведущие и конечные десятичные нули не подавляются;
2 – включение ноль футов и подавление ровно ноль дюймов, ведущие и конечные десятичные нули не подавляются;
3 – подавление ноль футов и включение ровно ноль дюймов, ведущие и конечные десятичные нули не подавляются;
4 – подавление ведущих десятичных нулей;
8 – подавление конечных десятичных нулей;
12 – подавление начальных и конечных десятичных нулей.
 Первые три значения свойства влияют только если в чертеже установлены измерения в дюймах, последние три – если в чертеже установлены измерения в миллиметрах.
 Примеры:
«Подавление ведущих десятичных нулей»: было без подавления 0,005 – стало ,005;
«Подавление конечных десятичных нулей»: было без подавления 0,5000 – стало 0,5;
«Подавление начальных и конечных десятичных нулей»: было без подавления 0,5000 – стало ,5.
 Свойство также доступно через системную переменную DIMZIN и пользовательское меню в окне изменения/создания размерного стиля:
  При изменении системной переменной DIMZIN будет создан новый размерный стиль под названием <переопределение> на основе текущего с новым значением DIMZIN.
 Условия
 Чтение и запись.
 Пример
 Пример изменения настройки подавления нулей в линейных размерах (значения свойства Dimzin) в размерном стиле Standard:
C#
 Копировать Код
public partial class Commands { [Teigha.Runtime.CommandMethod("DimzinChange")] public void DimzinStandardDimStyle() { // Получение ссылки на активный документ HostMgd.ApplicationServices.Document doc = HostMgd.ApplicationServices.Application.DocumentManager.MdiActiveDocument; // Получение ссылки на редактор документа HostMgd.EditorInput.Editor ed = doc.Editor; // Получение ссылки на базу данных документа Teigha.DatabaseServices.Database db = doc.Database; // Начало транзакции с базой данных документа using (Teigha.DatabaseServices.Transaction trans = db.TransactionManager.StartTransaction()) { // Открываем таблицу размерных стилей для чтения Teigha.DatabaseServices.DimStyleTable dimStyleTable = trans.GetObject(db.DimStyleTableId, Teigha.DatabaseServices.OpenMode.ForRead) as Teigha.DatabaseServices.DimStyleTable; // Находим в таблице размерных стилей ObjectId нужного стиля по его названию Teigha.DatabaseServices.ObjectId styleId = dimStyleTable["Standard"]; // Открываем таблицу размерного стиля для изменений Teigha.DatabaseServices.DimStyleTableRecord obj = trans.GetObject(styleId, Teigha.DatabaseServices.OpenMode.ForWrite) as Teigha.DatabaseServices.DimStyleTableRecord; ed.WriteMessage($"nDimzin before: {obj.Dimzin}"); // Изменяем настройку подавления нулей  // на 8 «подавление конечных десятичных нулей», // так как единицы измерения чертежа - метрические obj.Dimzin = 8; ed.WriteMessage($"nDimzin after: {obj.Dimzin}"); trans.Commit(); } } }
 Результат работы команды DimzinChange:
 Было:
 Стало:
 Ссылки
 Teigha.DatabaseServices.DimStyleTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!