Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Isolines
 Послать отзыв
 Синтаксис
C#
Visual Basic
public int Isolines;
Public Property Isolines() As Integer
 Описание
 Возвращает или устанавливает текущее значение ISOLINES для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!