Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DxfFiler.WriteUInt16
 Послать отзыв
 Метод записывает в данный объект Filer указанное 16-разрядное целое число без знака (unsigned short).
 Синтаксис
C#
Visual Basic
Копировать Код
public abstract void WriteUInt16( DxfCode opCode, unsigned short value );
Копировать Код
Public MustOverride Sub WriteUInt16( opCode As DxfCode, value As unsigned short )
 Параметры
 Параметры
 Описание
 opCode
 Групповой код DXF. Тип DxfCode.
 value
 Значение, которое следует записать. Тип unsigned short.
 Описание
 Метод записывает в данный объект Filer указанные групповой код DXF и 16-разрядное целое число без знака (unsigned short).
 Ссылки
 Teigha.DatabaseServices.DxfFiler, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!