Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Polyline.SetBulgeAt
 Послать отзыв
 Синтаксис
C#
Visual Basic
public void SetBulgeAt(int index, double bulge);
Public Sub SetBulgeAt(index As Integer, bulge As Double)
 Параметры
 Параметры
 Описание
 index
 Индекс (отсчитываемый от 0) вершины
 bulge
 Значение степени выпуклости для вершины
 Описание
 Этот метод устанавливает значение степени выпуклости для вершины, указанной в index. Это определяет степени выпуклости сегмента полилинии, который следует за вершиной index.
 Ссылки
 Teigha.DatabaseServices.Polyline, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!