Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SymbolUtilityServices.MakeDependentName
 Послать отзыв
 Метод позволяет объединить указанные имя чертежа и имя символа, чтобы получить зависимое имя символа.
 Синтаксис
C#
Visual Basic
Копировать Код
public static String MakeDependentName( ref String dwgName, ref String symbolName );
Копировать Код
Public Shared Function MakeDependentName( ByRef dwgName As String, ByRef symbolName As String ) As String
 Параметры
 Параметры
 Описание
 dwgName
 Имя чертежа. Тип String.
 symbolName
 Имя символа. Тип String.
 Возвращает
 Возвращает строку, которая представляет объединение имён параметров name и symbolName. Тип String.
 Описание
 Метод позволяет объединить указанные имя чертежа и имя символа, чтобы получить зависимое имя символа.
 Ссылки
 Teigha.DatabaseServices.SymbolUtilityServices, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!