Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.UnderlayDefinition.SetUnderlayItem
 Послать отзыв
 Метод позволяет задать имя элемента подложки, на который должна ссылаться эта подложка, и выгружает предыдущий элемент подложки, на который имелась ссылка.
 Синтаксис
C#
Visual Basic
Копировать Код
public void SetUnderlayItem( ref String sourceFileName, ref String activeFileName, ref UnderlayItem item );
Копировать Код
Public Sub SetUnderlayItem( ByRef sourceFileName As String, ByRef activeFileName As String, ByRef item As UnderlayItem )
 Параметры
 Параметры
 Описание
 sourceFileName
 Путь к исходному файлу. Тип String.
 activeFileName
 Путь к активному файлу. Тип String.
 item
 Элемент, на который создается ссылка. Тип UnderlayItem.
 Описание
 Метод позволяет задать имя элемента подложки, на который должна ссылаться эта подложка, и выгружает предыдущий элемент подложки, на который имелась ссылка.
 Ссылки
 Teigha.DatabaseServices.UnderlayDefinition, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!