Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод Hatch.GetGradientColors
 Послать отзыв
 Синтаксис
C#
Visual Basic
public array<GradientColor> GetGradientColors();
Public Function GetGradientColors() As array<GradientColor>
 Описание
 Этот метод возвращает цвет и интерполированную величину, описывающую, как будет применено определение наполнения градиента.
 Ссылки
 Teigha.DatabaseServices.Hatch, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!