Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LayerStateEventArgs.Id
 Послать отзыв
 Свойство Id представляет идентификатор объекта слоя.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.ObjectId Id;
Копировать Код
Public ReadOnly Property Id As DatabaseServices.ObjectId
 Возвращает
 Возвращает идентификатор объекта слоя. Тип DatabaseServices.ObjectId.
 Описание
 Свойство Id представляет идентификатор объекта слоя.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.LayerStateEventArgs, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!