Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Position2d.Position2d
 Послать отзыв
 Конструктор класса Position2d. Создает объект позиции в указанной 2D-точке.
 Синтаксис
C#
Visual Basic
Копировать Код
public Position2d( Point2d point );
Копировать Код
Public Sub New( point As Point2d )
 Параметры
 Параметры
 Описание
 point
 Входная точка, в которой создается объект позиции. Тип Point2d.
 Описание
 Конструктор класса Position2d. Создает объект позиции в указанной 2D-точке.
 Ссылки
 Teigha.Geometry.Position2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!