Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство ObjectIterator.Current
 Послать отзыв
 This is Current, a member of class ObjectIterator.
 Синтаксис
C#
Visual Basic
public Object Current;
Public Property Current() As Object
 Ссылки
 ObjectIterator Класс, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!