Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.RenderGlobal.ExposureType
 Послать отзыв
 Свойство ExposureType представляет текущий тип управления экспозицией в данном объекте.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.ExposureType ExposureType;
Копировать Код
Public Property ExposureType As DatabaseServices.ExposureType
 Возвращает
 Возвращает тип управления экспозицией. Значение из перечисления DatabaseServices.ExposureType.
 Описание
 Свойство ExposureType представляет текущий тип управления экспозицией в данном объекте (автоматический, логарифмический).
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.RenderGlobal, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!