Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.SetCustomData
 Послать отзыв
 Метод позволяет задать пользовательские данные в ячейке, строке или столбце.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetCustomData( int row, int column, ref String key, ref Object value );
Копировать Код
Public virtual Sub SetCustomData( row As Integer, column As Integer, ByRef key As String, ByRef value As Object )
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс может равняться -1.
 key
 Ключ для использования с пользовательскими данными. Тип String.
 value
 Новые пользовательские данные для ячейки, тип Object. В случае значения NULL пользовательские данные удаляются.
 col
 Индекс столбца, тип int. Индекс может равняться -1.
 Описание
 Метод позволяет задать пользовательские данные в ячейке, строке или столбце.
 Чтобы задать ячейку, следует указать допустимые индексы строки и столбца. Чтобы задать строку, следует указать допустимый индекс строки и -1 в качестве индекса столбца. Чтобы задать столбец, следует указать допустимый индекс столбца и -1 в качестве индекса строки.
 Замечания
 Для получения того же результата предпочтительнее использовать метод Table.Cells[row,column].SetCustomData.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!