Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.Table
 Послать отзыв
 Конструктор.
 Синтаксис
C#
Visual Basic
Копировать Код
public Table( IntPtr unmanagedPointer, bool autoDelete );
Копировать Код
Public Sub New( unmanagedPointer As IntPtr, autoDelete As Boolean )
 Параметры
 Параметры
 Описание
 unmanagedPointer
 Указатель на объект, тип IntPtr.
 autoDelete
 Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.
 Описание
 Конструктор.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!