Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.NurbSurface.IsPeriodicInV
 Послать отзыв
 Свойство IsPeriodicInV позволяет проверить, является ли данная поверхность периодической в направлении V.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsPeriodicInV;
Копировать Код
Public ReadOnly Property IsPeriodicInV As Boolean
 Возвращает
 Возвращает true, если поверхность является периодической в направлении V. В противном случае возвращает false.
 Описание
 Свойство IsPeriodicInV позволяет проверить, является ли данная поверхность периодической в направлении V.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.NurbSurface, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!