Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.BoundBlock3d.Extend
 Послать отзыв
 Метод изменяет размеры граничной рамки так, чтобы она включала указанную точку.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Extend( Point3d pointToInclude );
Копировать Код
Public Sub Extend( pointToInclude As Point3d )
 Параметры
 Параметры
 Описание
 pointToInclude
 Входная точка, которая должна находиться в пределах граничной рамки. Тип Point3d.
 Описание
 Метод изменяет размеры граничной рамки так, чтобы она включала указанную точку.
 Ссылки
 Teigha.Geometry.BoundBlock3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!