Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Curve.CreateFromGeCurve
 Послать отзыв
 Метод CreateFromGeCurve создает экземпляр класса Curve из объекта класса Curve3d с явно указанной точностью, используя аргумент типа Vector3d.
 Синтаксис
C#
Visual Basic
Копировать Код
public Curve CreateFromGeCurve( ref Curve3d geCurve, Vector3d vec, Tolerance tolerance );
Копировать Код
Public Function CreateFromGeCurve( ByRef geCurve As Curve3d, vec As Vector3d, tolerance As Tolerance ) As Curve
 Параметры
 Параметры
 Описание
 geCurve
 Входная кривая, тип Curve3d.
 vec
 Аргумент типа Vector3d.
 tolerance
 Допустимая погрешность геометрических построений, тип Tolerance.
 Возвращает
 Возвращает экземпляр класса Curve.
 Описание
 Метод CreateFromGeCurve создает экземпляр класса Curve из объекта класса Curve3d с явно указанной точностью, используя аргумент типа Vector3d.
 Ссылки
 Teigha.DatabaseServices.Curve, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!