Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.PlanarEquationCoefficients.B
 Послать отзыв
 Свойство B представляет коэффициент b в общем уравнении плоскости.
 Синтаксис
C#
Visual Basic
Копировать Код
public double B;
Копировать Код
Public ReadOnly Property B As Double
 Возвращает
 Возвращает коэффициент b в общем уравнении плоскости. Тип double.
 Описание
 Свойство B представляет коэффициент b в общем уравнении плоскости.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.PlanarEquationCoefficients, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!