Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Matrix2d.Scaling
 Послать отзыв
 Метод предоставляет матрицу равномерного масштабирования относительно указанной точки с заданным коэффициентом масштабирования.
 Синтаксис
C#
Visual Basic
Копировать Код
public static Matrix2d Scaling( double scaleAll, Point2d center );
Копировать Код
Public Shared Function Scaling( scaleAll As Double, center As Point2d ) As Matrix2d
 Параметры
 Параметры
 Описание
 scaleAll
 Масштабирующий множитель. Тип double.
 center
 Точка, относительно которой выполняется масштабирование. Тип Point2d.
 Возвращает
 Возвращает матрицу геометрического преобразования для равномерного масштабирования относительно точки center с коэффициентом масштабирования scaleAll. Тип Matrix2d.
 Описание
 Метод предоставляет матрицу равномерного масштабирования относительно точки center с коэффициентом масштабирования scaleAll.
 Ссылки
 Teigha.Geometry.Matrix2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!