Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Cell.UpdateDataLink
 Послать отзыв
 Метод обновляет в этой ячейке ссылки на внешние данные.
 Синтаксис
C#
Visual Basic
Копировать Код
public void UpdateDataLink( UpdateDirection dir, UpdateOption option );
Копировать Код
Public Sub UpdateDataLink( dir As UpdateDirection, option As UpdateOption )
 Параметры
 Параметры
 Описание
 dir
 Направление обновления ссылок. Значение из перечисления UpdateDirection.
 option
 Опции обновления ссылок. Значение из перечисления UpdateOption.
 Описание
 Метод обновляет в этой ячейке ссылки на внешние данные. Аргументы метода позволяют указать направление и опции обновления ссылок.
 Ссылки
 Teigha.DatabaseServices.Cell, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!