Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.Treedepth
 Послать отзыв
 Синтаксис
C#
Visual Basic
public int Treedepth;
Public Property Treedepth() As Integer
 Описание
 Обеспечивает доступ к текущему значению TREEDEPTH для базы данных.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!