Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AbstractViewportData.IsSnapIsometric
 Послать отзыв
 Свойство IsSnapIsometric позволяет определить, является ли изометрическая привязка текущим типом шаговой привязки.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsSnapIsometric;
Копировать Код
Public Property IsSnapIsometric As Boolean
 Возвращает
 Возвращает true, если изометрическая привязка является текущим типом шаговой привязки в видовом экране. В противном случае возвращает false.
 Описание
 Свойство IsSnapIsometric позволяет определить, является ли изометрическая привязка текущим типом шаговой привязки.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.AbstractViewportData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!