Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LoftOptions.VirtualGuide
 Послать отзыв
 Свойство позволяет определить, используется ли при создании лофт-поверхностей опция virtual guide (виртуальная направляющая).
 Синтаксис
C#
Visual Basic
Копировать Код
public bool VirtualGuide;
Копировать Код
Public ReadOnly Property VirtualGuide As Boolean
 Возвращает
 Возвращает true, если опция virtual guide используется. В противном случае возвращает false.
 Описание
 Свойство позволяет определить, используется ли при создании лофт-поверхностей опция virtual guide (виртуальная направляющая).
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.LoftOptions, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!