Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SecurityParameters.ToString
 Послать отзыв
 Метод позволяет получить эквивалентное строковое представление данного объекта, учитывающее заданные языковые и региональные настройки.
 Синтаксис
C#
Visual Basic
Копировать Код
public String ToString( ref IFormatProvider provider );
Копировать Код
Public Function ToString( ByRef provider As IFormatProvider ) As String
 Параметры
 Параметры
 Описание
 provider
 Входной провайдер языковых и региональных настроек. Тип IFormatProvider.
 Возвращает
 Возвращает эквивалентное строковое представление данного объекта с учетом заданных языковых и региональных настроек. Тип String.
 Описание
 Метод позволяет получить эквивалентное строковое представление данного объекта, учитывающее заданные языковые и региональные настройки.
 Ссылки
 Teigha.DatabaseServices.SecurityParameters, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!