Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Torus.Center
 Послать отзыв
 Свойство Center представляет центр данного тора.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d Center;
Копировать Код
Public ReadOnly Property Center As Point3d
 Возвращает
 Возвращает текущее положение центра тора. Тип Point3d.
 Описание
 Свойство Center представляет центр данного тора.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.Torus, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!