Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Curve.IsPeriodic
 Послать отзыв
 Возвращает true, если кривая является периодической.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsPeriodic;
Копировать Код
Public Property IsPeriodic() As Boolean
 Возвращает
 Возвращает true, если кривая является периодической и false в противном случае.
 Описание
 Возвращает true, если кривая является периодической.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.Curve, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!