Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.HyperLink.NestedLevel
 Послать отзыв
 Свойство позволяет определить уровень вложенности данного объекта HyperLink.
 Синтаксис
C#
Visual Basic
Копировать Код
public int NestedLevel;
Копировать Код
Public ReadOnly Property NestedLevel As Integer
 Возвращает
 Возвращает уровень вложенности данного объекта. Тип int.
 Описание
 Свойство позволяет определить уровень вложенности данного объекта HyperLink.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.HyperLink, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!