Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Entity.Position
 Послать отзыв
 Свойство предназначено для получения или установки координат точки в мировой системе координат (WCS).
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d Position;
Копировать Код
Public Property Position() As Point3d
 Возвращает
 Возвращает значение типа Point3d, представляющее текущее положение точки в трёхмерном пространстве.
 Описание
 Устанавливает или возвращает значение положения точки в WCS координатах.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.DBPoint, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!