Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AbstractViewTableRecord.Height
 Послать отзыв
 Свойство Height представляет высоту данного объекта TableRecord в координатах DCS.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Height;
Копировать Код
Public Property Height As Double
 Возвращает
 Возвращает высоту объекта TableRecord в координатах DCS. Тип double.
 Описание
 Свойство Height представляет высоту данного объекта TableRecord в координатах дисплея (DCS).
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.AbstractViewTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!