Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SweepOptionsAlignOption
 Послать отзыв
 Данное перечисление определяет варианты выравнивания вытягиваемого по траектории объекта относительно касательной к траектории вытягивания.
 Синтаксис
C#
Visual Basic
Копировать Код
public enum SweepOptionsAlignOption { NoAlignment = 0, AlignSweepEntityToPath = 1, TranslateSweepEntityToPath = 2, TranslatePathToSweepEntity = 3 }
Копировать Код
Public Enum SweepOptionsAlignOption NoAlignment = 0 AlignSweepEntityToPath = 1 TranslateSweepEntityToPath = 2 TranslatePathToSweepEntity = 3 End Enum
 Члены
 Члены
 Описание
 NoAlignment
 Значение: 0. Выравнивание отсутствует.
 AlignSweepEntityToPath
 Значение: 1. Вытягиваемый объект в каждой точке траектории ориентируется перпендикулярно направлению касательной к траектории в этой точке.
 TranslateSweepEntityToPath
 Значение: 2. Вытягиваемый объект смещается к траектории вытягивания.
 TranslatePathToSweepEntity
 Значение: 3. Траектория вытягивания смещается к вытягиваемому объекту.
 Описание
 Данное перечисление определяет варианты выравнивания вытягиваемого по траектории объекта относительно касательной к траектории вытягивания.
 Ваши комментарии по поводу этого топика: Послать отзыв!