Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.FieldEvaluationResult
 Послать отзыв
 Данный класс представляет результат вычисления поля.
 Иерархия классов
Teigha::DatabaseServices::FieldEvaluationResult
 Синтаксис
C#
Visual Basic
Копировать Код
[StructLayout(LayoutKind.Sequential)] public class FieldEvaluationResult;
Копировать Код
<StructLayout(LayoutKind.Sequential)> Public Class FieldEvaluationResult
 Описание
 Данный класс представляет результат вычисления поля.
 Топики
 Имя
 Описание
 FieldEvaluationResult Свойства
 Ниже перечислены свойства класса FieldEvaluationResult.
 Ссылки
 FieldEvaluationResult Свойства, Топики, FieldEvaluationResult Свойства
 Ваши комментарии по поводу этого топика: Послать отзыв!