Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.PolyFaceMesh.AppendFaceRecord
 Послать отзыв
 Данный метод добавляет запись FaceRecord, указанную в аргументе toAppend, в конец списка граней PolyFaceMesh, определяет объект PolyFaceMesh владельцем FaceRecord и добавляет FaceRecord в базу данных, содержащую PolyFaceMesh.
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.ObjectId AppendFaceRecord( ref FaceRecord toAppend );
Копировать Код
Public Function AppendFaceRecord( ByRef toAppend As FaceRecord ) As DatabaseServices.ObjectId
 Параметры
 Параметры
 Описание
 toAppend
 Запись FaceRecord для добавления к сети.
 Возвращает
 Возвращает ObjectId.
 Описание
 Данный метод добавляет запись FaceRecord, указанную в аргументе toAppend, в конец списка граней PolyFaceMesh, определяет объект PolyFaceMesh владельцем FaceRecord и затем добавляет FaceRecord в базу данных, содержащую PolyFaceMesh. Обратите внимание, для успешной работы метода сеть PolyFaceMesh должна быть резидентной в базе данных.
 Вызывающее приложение должно явно закрыть добавленную запись FaceRecord после возврата из метода AppendFaceRecord().
 Предупреждение
 Все вершины должны быть добавлены прежде, чем будут добавлены какие-либо записи FaceRecord. После добавления хотя бы одного FaceRecord методы AppendVertex() перестают работать.
 Ссылки
 Teigha.DatabaseServices.PolyFaceMesh, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!