Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Свойство Database.ObjectContextManager
 Послать отзыв
 Синтаксис
C#
Visual Basic
public DatabaseServices::ObjectContextManager ObjectContextManager;
Public Property ObjectContextManager() As DatabaseServices.ObjectContextManager
 Описание
 Возвращает менеджер контекста объекта.
 Условия
 Только на чтение
 Ссылки
 Teigha.DatabaseServices.Database, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!