Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AssocAction.PostProcessAfterDeepClone
 Послать отзыв
 Метод позволяет реализовать уведомление исходных действий о завершении процедуры их глубокого клонирования.
 Синтаксис
C#
Visual Basic
Копировать Код
public void PostProcessAfterDeepClone( ref IdMapping idMap );
Копировать Код
Public Sub PostProcessAfterDeepClone( ByRef idMap As IdMapping )
 Параметры
 Параметры
 Описание
 idMap
 Экземпляр класса IdMapping в текущей сессии глубокого клонирования.
 Описание
 Метод вызывается из метода уведомления реактора (идентификаторы клонов уже оттранслированы) для информирования исходных действий о завершении их клонирования, чтобы они могли обновить клоны или выполнить какие-либо другие необходимые операции. Заметим, что исходное действие может найти свой клон, обратившись к переданному в метод объекту IdMapping.
 Если действие владеет объектом AssocActionBody с переопределенным обратным вызовом PostProcessAfterDeepCloneOverride(), вызывается переопределенный обратный вызов.
 Ссылки
 Teigha.DatabaseServices.AssocAction, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!