Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ProxyObject.OriginalClassName
 Послать отзыв
 Свойство OriginalClassName представляет имя класса объекта, представленного данным прокси-объектом.
 Синтаксис
C#
Visual Basic
Копировать Код
public String OriginalClassName;
Копировать Код
Public ReadOnly Property OriginalClassName As String
 Возвращает
 Возвращает имя класса. Тип String.
 Описание
 Свойство OriginalClassName представляет имя класса объекта, представленного данным прокси-объектом.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.ProxyObject, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!