Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Matrix2dInfo.IsEqualTo
 Послать отзыв
 Метод проверяет равенство данного объекта указанному объекту типа Matrix2dInfo.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsEqualTo( Matrix2dInfo a );
Копировать Код
Public Function IsEqualTo( a As Matrix2dInfo ) As Boolean
 Параметры
 Параметры
 Описание
 a
 Входной проверяемый объект. Тип Matrix2dInfo.
 Возвращает
 Возвращает true, если с используемой точностью объекты можно считать равными. В противном случае возвращает false.
 Описание
 Метод проверяет равенство данного объекта указанному объекту типа Matrix2dInfo. Используется вызов метода Matrix2dInfo.IsEqualTo(Matrix2dInfo a, Tolerance tolerance) с точностью, равной Tolerance.Global.
 Замечания
 Объекты типа Matrix2dInfo считаются равными, если
Равны масштабные множители;
Равны углы поворота;
В обеих матрицах присутствует, либо в обеих отсутствует зеркальное отражение;
Совпадают направления зеркального отражения.
 Ссылки
 Teigha.Geometry.Matrix2dInfo, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!