Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.NurbsData.Degree
 Послать отзыв
 Свойство возвращает степень кривой NURBS.
 Синтаксис
C#
Visual Basic
Копировать Код
public int Degree;
Копировать Код
Public ReadOnly Property Degree As Integer
 Возвращает
 Возвращает степень кривой NURBS. Тип int.
 Описание
 Свойство возвращает степень кривой NURBS.
 Высокие значения степени делают кривую более гибкой. Например, степень 1 используется для определения линейного сегмента, а степень 2 используется для определения окружности NURBS и т.д.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.NurbsData, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!