Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Метод IdPair.Equals
 Послать отзыв
 This is Equals, a member of class IdPair.
 Синтаксис
C#
Visual Basic
public bool Equals(ref Object obj);
Public Function Equals(ByRef obj As Object) As bool
 Ссылки
 IdPair Структура, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!