Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Xline.SecondPoint
 Послать отзыв
 Свойство SecondPoint обеспечивает доступ ко второй опорной точке, через которую проходит объект Xline.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point3d SecondPoint;
Копировать Код
Public Property SecondPoint() As Point3d
 Возвращает
 Возвращает или задает вторую опорную точку данного объекта Xline. Тип Point3d.
 Описание
 Свойство SecondPoint обеспечивает доступ ко второй опорной точке, через которую проходит объект Xline.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Xline, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!