Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MLeader.LeaderLineType
 Послать отзыв
 Свойство представляет тип линий выноски (прямая, сплайн, невидимая).
 Синтаксис
C#
Visual Basic
Копировать Код
public DatabaseServices.LeaderType LeaderLineType;
Копировать Код
Public Property LeaderLineType As DatabaseServices.LeaderType
 Возвращает
 Возвращает тип линий выноски из перечисления DatabaseServices.LeaderType.
 Описание
 Свойство представляет тип линий выноски (прямая, сплайн, невидимая).
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.MLeader, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!