Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Solid3d.GetSection
 Послать отзыв
 Метод предназначен для построения области Region, являющейся результатом сечения твердого тела указанной плоскостью.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual Region GetSection( ref Plane plane );
Копировать Код
Public Overridable Function GetSection( ByRef plane As Plane ) As Region
 Параметры
 Параметры
 Описание
 plane
 Секущая плоскость. Тип Plane.
 Возвращает
 Возвращает созданную область. Тип Region.
 Описание
 Метод создает объект Region как результат сечения твердого тела указанной плоскостью.
 Этот метод реализован только в среде пространственного моделирования.
 Ссылки
 Teigha.DatabaseServices.Solid3d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!