Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Конструктор LinetypeTable.LinetypeTable
 Послать отзыв
 This is LinetypeTable, a member of class LinetypeTable.
 Синтаксис
C#
Visual Basic
internal LinetypeTable(IntPtr unmanagedPointer, bool autoDelete);
Friend Sub New(unmanagedPointer As IntPtr, autoDelete As bool)
 Ссылки
 Teigha.DatabaseServices.LinetypeTable, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!