Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CompoundObjectId.Set
 Послать отзыв
 Метод позволяет задать этот CompoundObjectId, используя входной идентификатор составного объекта из указанной базы данных.
 Синтаксис
C#
Visual Basic
Копировать Код
public void Set( ref CompoundObjectId compoundID, ref Database hostDatabase );
Копировать Код
Public Sub Set( ByRef compoundID As CompoundObjectId, ByRef hostDatabase As Database )
 Параметры
 Параметры
 Описание
 compoundID
 Идентификатор составного объекта. Тип CompoundObjectId.
 hostDatabase
 Главная база данных. Тип Database.
 Описание
 Метод позволяет задать этот CompoundObjectId, используя входной идентификатор составного объекта из указанной базы данных.
 Ссылки
 Teigha.DatabaseServices.CompoundObjectId, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!