Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 LayerTable.GetEnumerator()
 Послать отзыв
 Метод предназначен для перебора в цикле содержимого таблицы слоёв.
 Синтаксис
C#
Visual Basic
public SymbolTableEnumerator GetEnumerator();
Public Function GetEnumerator() As SymbolTableEnumerator
 Возвращает
 Возвращает тип данных SymbolTableEnumerator.
 Описание
 С помощью метода можно получить доступ к счетчику коллекции, который осуществляет переход от одного элемента коллекции к другому по порядку расположения этих элементов в коллекции.
 Ссылки
 Teigha.DatabaseServices.LayerTable, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!