Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.GradientBackground.Height
 Послать отзыв
 Свойство предоставляет доступ к текущей высоте среднего (промежуточного) цвета, которая определяет его положение в трехцветном градиенте и выражается в процентах. Значению 0 соответствует двухцветный градиент с переходом от цвета ColorBottom к цвету ColorTop.
 Синтаксис
C#
Visual Basic
Копировать Код
public double Height;
Копировать Код
Public Property Height As Double
 Возвращает
 Возвращает высоту в процентах среднего (промежуточного) цвета градиента. Тип double.
 Описание
 Свойство предоставляет доступ к текущей высоте среднего (промежуточного) цвета, которая определяет его положение в трехцветном градиенте и выражается в процентах. Значению 0 соответствует двухцветный градиент с переходом от цвета ColorBottom к цвету ColorTop.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.GradientBackground, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!