Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Ole2Frame.CreateFromFile
 Послать отзыв
 Метод предназначен для создания объекта Ole2Frame, используя указанный файл в качестве источника данных.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool CreateFromFile( ref String FileName );
Копировать Код
Public Function CreateFromFile( ByRef FileName As String ) As Boolean
 Параметры
 Параметры
 Описание
 FileName
 Имя файла с данными. Тип String.
 Возвращает
 Возвращает true в случае успешного завершения операции. В противном случае возвращает false.
 Описание
 Метод предназначен для создания объекта Ole2Frame, используя указанный файл в качестве источника данных.
 Ссылки
 Teigha.DatabaseServices.Ole2Frame, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!