Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObject.SupportsCollection(String)
 Послать отзыв
 Метод проверяет, поддерживается ли данным объектом определенный тип контекста.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool SupportsCollection(String collectionName);
Копировать Код
Public Function SupportsCollection(collectionName As String) As bool
 Параметры
 Параметры
 Описание
 collectionName
 Имя коллекции (тип контекста) для проверки. Тип String
 Возвращает
 Возвращает тип данных bool. true, если объект поддерживает тип контекста с указанным именем.
 Описание
 Определяет, что определенный тип контекста поддерживается объектом. Этот метод показывает, поддерживает ли объект тип коллекции, но не показывает , участвует ли этот объект в каких-либо контекстах этого типа. См. также метод HasContext().
 Ссылки
 Teigha.DatabaseServices.DBObject, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!