Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.PolylineCurve3d.PolylineCurve3d
 Послать отзыв
 Конструктор класса PolylineCurve3d. Создает полилинию по заданному массиву определяющих точек.
 Синтаксис
C#
Visual Basic
Копировать Код
public PolylineCurve3d( ref Point3dCollection points );
Копировать Код
Public Sub New( ByRef points As Point3dCollection )
 Параметры
 Параметры
 Описание
 points
 Входная коллекция определяющих точек. Тип Point3dCollection.
 Описание
 Конструктор класса PolylineCurve3d. Создает полилинию по заданному массиву определяющих точек points.
 Ссылки
 Teigha.Geometry.PolylineCurve3d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!