Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Entity.MaterialId
 Послать отзыв
 Свойство предназначено для получения или установки идентификатора материала, связанного с геометрическим объектом, что определяет его визуальные свойства при трёхмерной визуализации.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectId MaterialId;
Копировать Код
Public Property MaterialId() As ObjectId
 Возвращает
 Возвращает значение типа ObjectId, представляющее собой ссылку на объект материала в базе данных чертежа.
 Описание
 Свойство обеспечивает доступ к Id материала, ассоциированного с объектом.
 Условия
 На чтение и запись
 Ссылки
 Teigha.DatabaseServices.Entity, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!