Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.SetRotation
 Послать отзыв
 Метод позволяет задать угол поворота элемента содержимого ячейки, который задан его индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetRotation( int row, int column, int contentIndex, double angle );
Копировать Код
Public virtual Sub SetRotation( row As Integer, column As Integer, contentIndex As Integer, angle As double )
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 column
 Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
 contentIndex
 Индекс элемента содержимого ячейки, тип int. Индекс должен быть больше или равен нулю и меньше количества элементов содержимого в ячейке.
 angle
 Угол поворота элемента содержимого в радианах, тип double.
 Описание
 Метод позволяет задать угол поворота элемента содержимого ячейки, который задан его индексом.
 Замечания
 Для получения того же результата предпочтительнее использовать Table.Cells[row,column].Contents[i].Rotation.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!