Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DimAssoc.UpdateDimension
 Послать отзыв
 Метод позволяет обновить размер, связанный с данным объектом, либо разорвать ассоциативную связь с ним.
 Синтаксис
C#
Visual Basic
Копировать Код
public void UpdateDimension( bool update );
Копировать Код
Public Sub UpdateDimension( update As Boolean )
 Параметры
 Параметры
 Описание
 update
 Входной флаг, который определяет, следует ли обновить размер (значение true) или разорвать ассоциативную связь с ним (значение false). Тип bool.
 Описание
 Метод позволяет обновить размер, связанный с данным объектом, либо разорвать ассоциативную связь с ним.
 Ссылки
 Teigha.DatabaseServices.DimAssoc, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!