Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AnnotativeStates
 Послать отзыв
 Это перечисление предоставляет значения для состояний аннотации (существует она или нет).
 Синтаксис
C#
Visual Basic
Копировать Код
public enum AnnotativeStates { True, False, NotApplicable }
Копировать Код
Public Enum AnnotativeStates True False NotApplicable End Enum
 Члены
 Члены
 Описание
 True
 Аннотация существует. Состояние true.
 False
 Аннотация отсутствует. Состояние false.
 NotApplicable
 Существование аннотации значения не имеет.
 Описание
 Это перечисление предоставляет значения для состояний аннотации (существует она или нет).
 Ваши комментарии по поводу этого топика: Послать отзыв!