Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.AbstractViewPE.UcsName
 Послать отзыв
 Свойство UcsName представляет идентификатор объекта пользовательской системы координат.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectId UcsName;
Копировать Код
Public Property UcsName As ObjectId
 Возвращает
 Возвращает идентификатор объекта пользовательской системы координат. Тип ObjectId.
 Описание
 Свойство UcsName представляет идентификатор объекта пользовательской системы координат.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.AbstractViewPE, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!