Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DataTable.RemoveRowAt
 Послать отзыв
 Метод предназначен для удаления строки с указанным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public void RemoveRowAt( int index );
Копировать Код
Public Sub RemoveRowAt( index As Integer )
 Параметры
 Параметры
 Описание
 index
 Индекс удаляемой строки. Тип int. В случае недействительного индекса метод выбрасывает исключение Teigha.Runtime.ErrorStatus.eInvalidInput.
 Описание
 Метод предназначен для удаления строки с указанным индексом.
 Ссылки
 Teigha.DatabaseServices.DataTable, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!