Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Vector2d.IsZeroLength
 Послать отзыв
 Метод проверяет, является ли данный вектор нулевым в пределах указанной точности.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsZeroLength( Tolerance tolerance );
Копировать Код
Public Function IsZeroLength( tolerance As Tolerance ) As Boolean
 Параметры
 Параметры
 Описание
 tolerance
 Заданная геометрическая точность. Тип Tolerance.
 Возвращает
 Возвращает true, если в пределах точности tolerance длина данного вектора равна нулю. В противном случае возвращает false.
 Описание
 Метод проверяет, является ли данный вектор нулевым в пределах указанной точности.
 Ссылки
 Teigha.Geometry.Vector2d, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!