Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 LayerTableRecord.RemoveAllOverrides()
 Послать отзыв
 Метод предназначен для удаления всех переопределений слоя во всех видовых экранах документа.
 Синтаксис
C#
Visual Basic
Копировать Код
public void RemoveAllOverrides();
Копировать Код
Public Sub RemoveAllOverrides()
 Описание
 В видовых экранах пространства листа можно переопределять цвет, тип линии, вес линии, прозрачность слоя. После переопределения параметров слоя в видовом экране будут применены новые параметры. В каждом видовом экране может быть своё переопределение параметров слоя.
 С помощью метода можно удалить все переопределения параметров слоя во всех видовых экранах документа.
 Ссылки
 Teigha.DatabaseServices.LayerTableRecord, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!