Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.SecurityParameters.SerialNumber
 Послать отзыв
 Свойство SerialNumber представляет серийный номер сертификата (цифрового ID).
 Синтаксис
C#
Visual Basic
Копировать Код
public String SerialNumber;
Копировать Код
Public Property SerialNumber As String
 Возвращает
 Возвращает серийный номер сертификата. Тип String.
 Описание
 Свойство SerialNumber представляет серийный номер сертификата (цифрового ID).
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.SecurityParameters, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!