Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.DBObjectCollection.Add
 Послать отзыв
 Добавляет в коллекцию указанный объект и возвращает индекс нового элемента коллекции (отсчитываемый от нуля).
 Синтаксис
C#
Visual Basic
Копировать Код
public int Add( ref DBObject value );
Копировать Код
Public Function Add( ByRef value As DBObject ) As Integer
 Параметры
 Параметры
 Описание
 value
 Добавляемый в коллекцию объект типа DBObject.
 Возвращает
 Возвращает отсчитываемый от нуля индекс добавленного в коллекцию элемента.
 Описание
 Добавляет в коллекцию указанный объект. Возвращает отсчитываемый от нуля индекс созданного элемента коллекции.
 Ссылки
 Teigha.DatabaseServices.DBObjectCollection, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!