Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.PointOnSurface.Parameter
 Послать отзыв
 Свойство Parameter представляет текущее параметрическое представление точки поверхности.
 Синтаксис
C#
Visual Basic
Копировать Код
public Point2d Parameter;
Копировать Код
Public Property Parameter As Point2d
 Возвращает
 Возвращает текущие параметрические координаты точки поверхности. Тип Point2d. Координата point.x определяет значение параметра точки по оси u, а координата point.y - значение параметра по оси v.
 Описание
 Свойство Parameter представляет текущее параметрическое представление точки поверхности.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.Geometry.PointOnSurface, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!