Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.SetRowHeight
 Послать отзыв
 Метод позволяет задать высоту строки с указанным индексом.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetRowHeight( int row, double height );
Копировать Код
Public virtual Sub SetRowHeight( row As Integer, height As double )
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
 height
 Новая высота строки, double.
 Описание
 Метод позволяет задать высоту строки с указанным индексом.
 Замечания
 Для получения того же результата предпочтительнее использовать Table.Rows[col].Height.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!