Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.SetGridVisibility
 Послать отзыв
 Метод позволяет задать видимость сетки у ячеек, строк или столбцов.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual void SetGridVisibility( int row, int column, GridLineType gridLineType, Visibility visibility );
Копировать Код
Public virtual Sub SetGridVisibility( row As Integer, column As Integer, gridLineType As GridLineType, visibility As Visibility )
 Параметры
 Параметры
 Описание
 row
 Индекс строки, тип int. Индекс может равняться -1.
 visibility
 Видимость линий из перечисления Teigha.DatabaseServices.Visibility.
 col
 Индекс столбца, тип int. Индекс может равняться -1.
 gridlineType
 Тип линии сетки из перечисления GridLineType.
 Описание
 Метод позволяет задать видимость сетки у ячеек, строк или столбцов.
 Чтобы задать ячейку, следует указать допустимые индексы строки и столбца. Чтобы задать строку, следует указать допустимый индекс строки и -1 в качестве индекса столбца. Чтобы задать столбец, следует указать допустимый индекс столбца и -1 в качестве индекса строки.
 Чтобы установить одно и то же значение сразу для нескольких типов линий сетки, можно объединить эти типы, используя оператор OR.
 Замечания
 Для получения того же результата предпочтительнее использовать метод Table.Cells[row,column].{Top,Bottom,Left,Right}Edge.IsVisible
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!