Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.LayoutManager.CurrentLayout
 Послать отзыв
 Свойство предоставляет имя текущего листа.
 Синтаксис
C#
Visual Basic
Копировать Код
public String CurrentLayout;
Копировать Код
Public Property CurrentLayout() As String
 Возвращает
 Возвращает имя текущего листа, тип string.
 Описание
 Свойство предоставляет имя текущего листа.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.LayoutManager, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!