Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Solid3d.Slice
 Послать отзыв
 Метод разрезает твердое тело указанной плоскостью и преобразует исходное твердое тело в часть, оставшуюся со стороны от режущей плоскости с положительным направлением нормали. Дополнительно метод позволяет получить в виде твердого тела и "отрицательную" половину исходного 3D-тела.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual Solid3d Slice( ref Plane plane, bool negativeHalfToo );
Копировать Код
Public Overridable Function Slice( ByRef plane As Plane, negativeHalfToo As Boolean ) As Solid3d
 Параметры
 Параметры
 Описание
 plane
 Режущая плоскость. Тип Plane.
 negativeHalfToo
 Флаг, определяющий, должна ли другая ("отрицательная") часть исходного тела создаваться как отдельное твердое тело. Тип bool.
 Возвращает
 Возвращает созданное твердое тело, представляющее "отрицательную" половину исходного 3D-тела. Тип Solid3d.
 Описание
 Метод разрезает твердое тело указанной плоскостью и преобразует исходное твердое тело в часть, оставшуюся со стороны от режущей плоскости с положительным направлением нормали. Дополнительно метод позволяет получить в виде твердого тела и "отрицательную" половину исходного 3D-тела.
 Этот метод реализован только в среде пространственного моделирования.
 Ссылки
 Teigha.DatabaseServices.Solid3d, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!