Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.MlineStyleElement.LinetypeId
 Послать отзыв
 Свойство возвращает идентификатор объекта типа линий, используемого как часть элемента стиля.
 Синтаксис
C#
Visual Basic
Копировать Код
public ObjectId LinetypeId;
Копировать Код
Public ReadOnly Property LinetypeId As ObjectId
 Возвращает
 Возвращает идентификатор объекта типа линий. Тип ObjectId.
 Описание
 Свойство возвращает идентификатор объекта типа линий, используемого как часть элемента стиля.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.MlineStyleElement, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!