Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.ObjectId.IsValid
 Послать отзыв
 Свойство определяет, связан ли ObjectId с базой данных, которая в данный момент загружена в память. Если ObjectId связан с базой данных, которая больше недоступна (другими словами, была удалена), то возвращается значение false.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsValid;
Копировать Код
Public Property IsValid() As Boolean
 Возвращает
 Возвращает значение true, если этот ObjectId связан с базой данных, которая в данный момент находится в памяти. Если ObjectId связан с базой данных, которая больше недоступна (другими словами, была удалена), то возвращается значение false.
 Описание
 Свойство определяет, связан ли ObjectId с базой данных, которая в данный момент загружена в память. Если ObjectId связан с базой данных, которая больше недоступна (другими словами, была удалена), то возвращается значение false.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.ObjectId, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!