Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.TransformOverrule.CloneMeForDragging
 Послать отзыв
 Метод проверяет необходимость создавать для операций перетаскивания клон указанного объекта.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual bool CloneMeForDragging( ref Entity entity );
Копировать Код
Public virtual Function CloneMeForDragging( ByRef entity As Entity ) As Boolean
 Параметры
 Параметры
 Описание
 entity
 Проверяемый объект чертежа. Тип Entity.
 Возвращает
 Возвращает значение true, если для операции перетаскивания необходимо создать объект-клон, в противном случае возвращает значение false.
 Описание
 Метод проверяет, следует ли создавать клон указанного объекта для операций перетаскивания.
 Ссылки
 Teigha.DatabaseServices.TransformOverrule, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!