Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.Table.MinimumTableWidth
 Послать отзыв
 Данное свойство представляет доступ к минимальной общей ширине таблицы.
 Синтаксис
C#
Visual Basic
Копировать Код
public virtual double MinimumTableWidth;
Копировать Код
Public virtual Property MinimumTableWidth() As double
 Возвращает
 Возвращает минимальную общую ширину таблицы, тип double.
 Описание
 Данное свойство представляет доступ к минимальной общей ширине таблицы.
 Условия
 Чтение и запись.
 Ссылки
 Teigha.DatabaseServices.Table, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!