Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.DatabaseServices.CellBorders.Horizontal
 Послать отзыв
 Свойство возвращает границу ячейки на всех горизонтальных линиях сетки, кроме верхней и нижней.
 Синтаксис
C#
Visual Basic
Копировать Код
public CellBorder Horizontal;
Копировать Код
Public Property Horizontal() As CellBorder
 Возвращает
 Возвращает границу ячейки. Тип CellBorder.
 Описание
 Свойство возвращает границу ячейки на всех горизонтальных линиях сетки, кроме верхней и нижней.
 Условия
 Только чтение.
 Ссылки
 Teigha.DatabaseServices.CellBorders, Teigha.DatabaseServices
 Ваши комментарии по поводу этого топика: Послать отзыв!