Свернуть всеРазвернуть все
 Справочное руководство .NET API
 Закрыть
 Послать отзыв
 Teigha.Geometry.Point3dCollection.IsReadOnly
 Послать отзыв
 Свойство показывает, является ли эта коллекция доступной только для чтения.
 Синтаксис
C#
Visual Basic
Копировать Код
public bool IsReadOnly;
Копировать Код
Public Property IsReadOnly() As Boolean
 Возвращает
 Возвращает true, если эта коллекция доступна только для чтения; в противном случае возвращает false.
 Описание
 Свойство показывает, является ли эта коллекция доступной только для чтения.
 Условия
 Только чтение.
 Ссылки
 Teigha.Geometry.Point3dCollection, Teigha.Geometry
 Ваши комментарии по поводу этого топика: Послать отзыв!